{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "admirallakeandpondrestoration.com",
      "Review": [
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug V",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T21:30:16.000Z",
          "Titre": "Almost 5 stars",
          "Contenu": "Almost 5 stars. There was a problem when I got my fountain unit but I will say the company took care of the issue promptly. A sign of a good company. All works well now. Love the unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug V",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T21:43:25.000Z",
          "Titre": "Honest service.",
          "Contenu": "My fountain had a couple of issues when I got it. Only one star reduction because the company stood behind their product and fixed the issues quickly once I told them the issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Garner",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T15:43:25.000Z",
          "Titre": "Excellent results from the Ice-Out Ice Eater",
          "Contenu": "I'm very pleased at how much water the Ice-Out circulates and how easy it was to install. A quality product that I've had excellent results with. I would recommend it to anybody that needs to keep a large open water space in winter. Consistently keeps open approximately 100' x 200' water space in the dead of winter in South Dakota. Makes a world of difference."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Sparks",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T14:20:37.000Z",
          "Titre": "Great Equipment",
          "Contenu": "I took my time to research the best tools to clean up my lake in hopes of creating a swimming area. I was happy to find a local company that had low prices and decided to purchase a lake rake, an aqua/muck blower, the deep stake mount, and the weed roller mount. Every piece of equipment has been highly flexible, and has filled a major need of mine that I was unable to find elsewhere, especialy in the case of the deep stake and weed roller mount for the muck blower. Now, I can use my blower anywhere along my 300' of lake shore, tidy things up much faster, and my favorite - attach the muck blower to my weed roller for a full 360 clean that gets EVERYTHING. I'm really impressed with all of the equipment and my wife would tell you, I'm not easy to please!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Barry",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:34:13.000Z",
          "Titre": "Quick-Rink Takes the Cake",
          "Contenu": "The Quick-Rink was the most recent Barry family Christmas present in a long tradition of \"family gifts\". Going back at least 10 years, we buy a single gift each year that everyone can enjoy. This past year, the Quick-Rink was it! The kids and adults alike had an absolute blast skating and we cut down on our usual rink-making time by at least half. The whole process was so much more convenient. Truly a must-have for anybody that regularly makes an ice rink!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abraham G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T05:46:26.000Z",
          "Titre": "Ice-Out Aerator and De-iCer",
          "Contenu": "The Ice-Out aerator and deicer from Admiral provided consistent open water protection to my boat and dock through winter, doing great despite the sub-zero temperatures. I'm very satisfied. Also saved me the time of taking everything in, storing it, and spending thousands more. Well worth the money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly Orr",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:12:40.000Z",
          "Titre": "Thanks Charlie! Love the fountain!",
          "Contenu": "Hey! Leaving a quick review here to thank Charlie for his awesome service and the beautiful aerator fountain. Love the fountain, the light set, and the quality help. Thanks!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kara Graham",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T12:28:37.000Z",
          "Titre": "So Far, so Good",
          "Contenu": "I ordered the floating pond fountain with lights and have been waiting to leave a review. I can now say with confidence that this is a good, quality fountain. It compares favorably to those I've had in the past, everything from small \"\"toyish\"\" fountains to a larger industrial style fountain. It doesn't have any plastic materials, so it gives a feeling of quality, and the compact design is nice for installing and removing. The light kit option is beautiful and the timer that comes with the lights is convenient as it can be set automatically according to ambient light.As an aerator, it seems good, much better than smaller fountains we've purchased online, and  less than the big industrial one we had, but that is to be expected given the horsepower difference. If anything goes wrong, it has a lifetime warranty on everything but the cord (3 yrs), very impressive. I'm very happy with my purchase and may be purchasing another if I can convince my husband that we need a lake aerator up at our cabin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen Pierce",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T09:49:39.000Z",
          "Titre": "Lake Aeration at it's Finest",
          "Contenu": "If you're looking for a lake aerator, few things are as pleasant to look at as an Admiral Lake Fountain. Effective at aerating as well, we quickly gathered that this was the best option for our 1 acre pond. The best of both worlds, and at a very reasonable price. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Doe",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T07:20:01.000Z",
          "Titre": "Much Better Experience",
          "Contenu": "I had a very unpleasant experience with the Weeders Digest company prior to encountering Admiral Lake and Pond Restoration in an online search. Unlike Weeders, Admiral quickly responded to all of my questions, did not use any bait and switch tactics, and were very up-front about pricing and what to expect. As for results, the JetStream Aqua Blower has cleaned up my muck and weed issues by and large and I am very content. My neighbors can't say the same about their Weeders Digest Aqua Thruster. My apologies for bringing up the competition during this review; I wanted to shed some light on my purchasing journey up to this point and highlight what I felt both the highs and lows were for others to see and (hopefully) learn from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Baldwin",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T11:36:28.000Z",
          "Titre": "So Far, so Good",
          "Contenu": "\"I ordered the floating pond fountain with lights and have been waiting to leave a review. I can now say with confidence that this is a good, quality fountain. It compares favorably to those I've had in the past, everything from small \"\"toyish\"\" fountains to a larger industrial style fountain. It doesn't have any plastic materials, so it gives a feeling of quality, and the compact design is nice for installing and removing. The light kit option is beautiful and the timer that comes with the lights is convenient as it can be set automatically according to ambient light.As an aerator, it seems good, much better than smaller fountains we've purchased online, and  less than the big industrial one we had, but that is to be expected given the horsepower difference. If anything goes wrong, it has a lifetime warranty on everything but the cord (3 yrs), very impressive. I'm very happy with my purchase and may be purchasing another if I can convince my husband that we need a lake aerator up at our cabin!\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Knox",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T16:43:40.000Z",
          "Titre": "Great weed and muck Blower",
          "Contenu": "Simplistic design works great and the Jetstream aqua thruster has been a huge help in my lake front project. Easily moves weeds and eats away at the muck slowly but surely. I expect my 200 feet of shoreline to look a whole lot clearer come next year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Morse",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T06:28:21.000Z",
          "Titre": "Small Family Company",
          "Contenu": "Admiral Lake and Pond Restoration has given us wonderful service and we are very satisfied. We are happy to support a small family business and they are a pleasure to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T12:47:53.000Z",
          "Titre": "Have your cake and eat it too",
          "Contenu": "Aerate your pond, clear your muck, and do so with little effort. That is, if you own an aqua jet blower"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Mcmahon",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T11:34:06.000Z",
          "Titre": "Good service",
          "Contenu": "Came quick, almost no assembly necessary, which my back appreciates!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Malik Williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T17:05:19.000Z",
          "Titre": "Great Addition",
          "Contenu": "Purchased this floating lake fountain for my place down in FL. Very happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Delafont",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:17:46.000Z",
          "Titre": "I had no idea what I was doing (first…",
          "Contenu": "I had no idea what I was doing (first time rink-maker here!), but the Quick-Rink made it simple and turned our pond into a a beautiful skating area. Very quick, convenient, and fun for the whole family. Highly recommended. PS - Definitely read the manual. Super helpful and gave us all a chuckle!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cade Peterson",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T16:37:31.000Z",
          "Titre": "Best Hunting Gift",
          "Contenu": "This has been the best hunting gift ever.. Used to be hard to attract geese and now I have more of them than I know what to do with. I recommend the ice-out hands down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patty Bender",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T06:20:56.000Z",
          "Titre": "Way cheaper then getting the…",
          "Contenu": "Way cheaper then getting the competitors' aqua thruster and better service too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark DuChene",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:00:54.000Z",
          "Titre": "Quick Rink",
          "Contenu": "We purchased a Quick Rink in January 2023 for our pond in the backyard for the kids to skate on and couldn't be happier.  It's the easiest thing to drill a hole, set the Quick Rink in, plug it in and start flooding or resurfacing the pond to keep it skatable longer.  Even the kids loved helping keeping the ice.   Great product and already recommended to lots of friends and family.  Looking forward to this winter and making an even bigger pond hockey rink."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JM Greene",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:21:31.000Z",
          "Titre": "Regained my lakeshore!",
          "Contenu": "I had an amazing experience working with Hal. Our lakeshore is more usable than ever. It was full of muck and weeds until I  started using the Jetstream blower. Once I add the oscillating mount it will tale all the work away. I'll actually have time to enjoy my lake! The products from Admiral are top notch, and the customer support is even better. I will continue to refer them to anyone I know with a lake or pond."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meg Hadlock",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T21:38:15.000Z",
          "Titre": "30+ Years of Lake Muck",
          "Contenu": "Admiral Lake and Pond is a wonderful business!  Our lakefront cottage had 30+ years of muck build-up that was never addressed.  I was hopeful, but not optimistic that we could clean it up without a dredge.  I researched several muck remover products and selected the JetStream due to the fact that I could easily move it around to address all quadrants of our mucky shore.  Customer service is top-notch!  Hal and Charlie responded to my questions in record time.  Our lakefront recovery is still very much a work in progress, but WE HAVE SAND!!  I am beyond happy with what I’ve been able to achieve with my JetStream and highly recommend it to anyone looking to address shorefront muck issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Felckowski",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T00:54:38.000Z",
          "Titre": "Great customer service and product",
          "Contenu": "Admiral Lake and Pond Restoration provides incredible customer service! Answered all of our questions and shipped JetStream and replacement propellers in a timely manner. The JetStream works great! No more muck! Love seeing the sandy lake bottom again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Westcott",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T23:08:48.000Z",
          "Titre": "This is one of the best companies I’ve…",
          "Contenu": "This is one of the best companies I’ve ever interacted with. They are quick to respond to my questions. When I placed an order, a personalized email came out with my product information as well as my tracking. You can tell this company really cares about its customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Wentler",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:53:42.000Z",
          "Titre": "Great local product",
          "Contenu": "I researched all the different brands of muck remover products and decided to go with the JetStream. The biggest reason was because I could actually talk to someone who was responsive to questions I had and were local. So far I have been extremely happy with my purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kurt Vande Wettering",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:34:03.000Z",
          "Titre": "This works great",
          "Contenu": "We bought the Jet stream with the standard stake.  This has been great.  We are able to move around and aim in different directions.  I would recommend to anyone that is trying to gain some lake front appearance.  We still have the muck however we have gained the appearance and don't have the weeds growing up.  Even when the water gets a little green we plug the blower in and in no time things are looking great again.  My neighbor has a different brand that attaches to the dock and he has even commented that he likes the mobility that ours has.  I recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis claRk",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T05:17:50.000Z",
          "Titre": "The amazing ice out",
          "Contenu": "I purchased the ice out for hunting purposes to keep a large area ice free to duck hunt on. When I received my unit I was overly excited to see how much of an area it would keep open. When I sat it up and turned the unit on, it was actually a huge disappointment, something just wasn’t right so I called. Talk about customer service, from the time I contacted them till I receive my unit back, it’s now working better than I ever expected. Top notch, five stars. I’m excited for hunting season this year. Thanks Admiral!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Arias",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T15:26:50.000Z",
          "Titre": "Best Value Fountain on the Market!",
          "Contenu": "I spent months researching several brands of fountains and it became clear that the Admiral fountain had quite a few advantages over competitors, oftentimes at a fraction of the price. Initially I was a bit taken aback at the prices of other 2 HP fountains and ended up getting the 1.5 HP Admiral model with a light set and the pump attachment (btw, this accessory is worth it's weight in gold!) and paid less for it than I would have paid for some competing units' 1 HP fountains with lights. I couldn't be happier with my decision! The lights are beautiful, my pond stays aerated, and I can even use the pump attachment to turn my fountain into a pump - I just connect the attachment to a garden hose and can water my wife's plants in summer and even make an ice rink in the winter for the kids! I'm thrilled at how the fountain has gone so far above and beyond what I expected.Truly a great product. Thanks to everyone at Admiral Lake and Pond!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Mechtel",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:16:18.000Z",
          "Titre": "Our Jet Stream has made our lake shore more accessible",
          "Contenu": "We purchased our Jet Stream for our cabin in Silver Bay in spring of 2022.  We have been 110% satisfied with the results.  We had to clear lily pads our to get access to our dock and the Jet Stream has kept that area lily pad free for two summers with no signs of any creeping back in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T23:01:17.000Z",
          "Titre": "The Aqua thruster is amazing we went…",
          "Contenu": "The Aqua thruster is amazing we went from not being able to use our beach to having a gorgeous beach and no debris, not to mention the excellent customer service.   100% recommend to anyone trying to clean up your shoreline"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T16:55:58.000Z",
          "Titre": "Our fountain is beautiful and the jetstream clears our lake bottom",
          "Contenu": "Hal and Charlie are great people to work with and being a family business makes it an even better experience. I own both a fountain with light kit for my home, and a jetstream for my cabin. Both have been practical and economical solutions for my needs. I’m sure I’ll be buying an oscillating kit for the jetstream at our cabin when it becomes available. It should be a real game changer for an already impressive jetstream product. I have been impressed with the quality products and the stellar company service, and I appreciate that they quickly respond to any and all my questions. I had a small issue with my fountain pump this spring, and they were able fix the issue in no time to get it back in service 100%. I would never consider buying any of these types of products from any other source. Price, quality, and service cannot be beat. Such a joy to get all three in a company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Marsh",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T23:41:27.000Z",
          "Titre": "We purchased the jet stream last summer…",
          "Contenu": "We purchased the jet stream last summer and it has exceeded our expectations! Everyone we spoke to is super helpful.  The area we are in is in a bay on a large lake and we purchased the Jet Stream to help with the duckweed and to help with the water flow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JENNIFER SCHNEIDER",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T11:00:31.000Z",
          "Titre": "Product came quickly",
          "Contenu": "Product came quickly, easy to set up and use. In one afternoon had excellent results. Our beach is now sandy and no muck or weeds. Having a little issue with the remote, probably just needs to be paired again. We wonder why we waited so long to get this! I did a Google review also with a photo of the results after using it just a few times. Can't figure out how to attach it to this review.Figured out the remote, it was operator error!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Wieber",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T14:50:57.000Z",
          "Titre": "I have been using my one horse power…",
          "Contenu": "I have been using my one horse power pump for half the summer and it is making my lake bottom more firm.  It is exciting to walk into the lake and not sink into the much that was once my shore line."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brook King",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T22:30:17.000Z",
          "Titre": "Should have bought the Jetstream years ago",
          "Contenu": "I have the Jetstream blower, and it's doing a great job of cleaning out the muck and lilypads.  I don't have power on the lake lot, so I run off a generator.  Normally I put in about 20 hours of manual labor to keep boat access to the channel.  This year, even with the late, start I've put in far fewer hours.Next year I have really high hopes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Mahle",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:02:30.000Z",
          "Titre": "JETSTREAM IS FANTASTIC",
          "Contenu": "We recently purchased the Jetstream for our lake property.  The Jetstream has done a great job of moving the muck away from our beach and dock. Looking forward to really cleaning the area this fall after the dock and boat are out. Great well made product!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cory M",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:20:27.000Z",
          "Titre": "Our Jet Stream Works Great",
          "Contenu": "We have had ours running for about a month now and it is making great progress on a shoreline that had not been cared for in over a decade."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Robitaille",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T21:15:23.000Z",
          "Titre": "Excellent and trustworthy company with…",
          "Contenu": "Excellent and trustworthy company with quality made and fairly priced products.  Very helpful communication is deciding if the product is right for you and what accessories you might need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duwayne Platt",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T22:25:36.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shippingHonest pricingContinuous improvement of an already solid piece of equipmentYou can actually talk to someone because it's an American company in America"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Dostal",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:20:29.000Z",
          "Titre": "Great company",
          "Contenu": "Great company. Have had a blower for two summers and it has been flawless. Also like purchasing from a local US company. Great group to purchase from and solid products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandi Raines",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T19:26:24.000Z",
          "Titre": "Love the JetStream Aqua Blower",
          "Contenu": "I own Suburban Pools and Lake Fun and purchased a few of the Aqua Blowers from Charlie and Hal. Love the product. It really does keep your lakeshore from growing weeds. I definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Melquist",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T21:04:20.000Z",
          "Titre": "Fountain is beautiful and Aqua Jet Stream is great",
          "Contenu": "I installed the fountain for a beautiful water feature and the aquablaster to get rid of weeds and much on the beach. Both are working great!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cole Brenny",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:05:37.000Z",
          "Titre": "Love these guys",
          "Contenu": "Love these guys. They were so helpful and friendly. We purchased a JETstream blower to help with weeds and muck in our lake swimming area. We've used the blower the past two years and now have a large muck free - sandy bottom! I HIGHLY recommend the JETstream."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Root-McDaniel",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T12:48:30.000Z",
          "Titre": "Website was easy to use and when…",
          "Contenu": "Website was easy to use and when contacting the company for additional information they were helpful and responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Huber",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T17:23:00.000Z",
          "Titre": "Heavy Muck Clearing",
          "Contenu": "I have had my Jet Stream for just over one month and have cleared a space of 100’ long by 15’ wide.We had removed cattails from the area and the muck under the cattails was 16”-20” deep.After an area is cleared, the lake floor is hard. Aside from removing the muck, it blows away the root systems of the weeds. Now the areas we have cleared with the Jet Stream are weed free!With the deep muck we are dealing with, I keep the Jet Stream in an area for 12 hours and it clears an area of 5’ wide by 10’ long.My neighbors and friends are amazed at the results and I have referred them to Charlie and his amazing product. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Olson",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T00:25:11.000Z",
          "Titre": "It moves a lot debris from the bottom…",
          "Contenu": "It moves a lot debris from the bottom of our lake.  It’s done a great job clearing out the muck and leaves.  Can’t wait to see the oscillating feature!  It will be in our cart when available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Weber",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T23:27:53.000Z",
          "Titre": "Great product",
          "Contenu": "Great people easy to talk with, and a truly remarkable product. Our lakeshore has seen a remarkable improvement!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mindy Joos",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T19:20:13.000Z",
          "Titre": "Clean water and pond floor!",
          "Contenu": "We have been pleased with our Jet Stream.  It moves a lot of water and keeps our pond water and pond floor a lot cleaner and much more pleasant for swimming. It works quickly too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tricia Stolz",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T22:51:55.000Z",
          "Titre": "Very supportive and responsive!",
          "Contenu": "Super responsive to questions and very helpful details for getting started. So far, we are getting good results from the JetStream."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Sills",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T16:00:12.000Z",
          "Titre": "Blower has been awesome",
          "Contenu": "Blower has been awesome.  Highly recommend the dock mount if in shallow water.  Company has also been great to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Schmidt",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:43:39.000Z",
          "Titre": "1-hp Jetstream Blower",
          "Contenu": "We had purchased a 1-hp Jetstream Blower, later last fall.  Wow this thing ROCKS!!!  It is amazing how much power it has.  I let a few of my neighbors use it and they were also amazed how well it worked. Great design!  Can't wait for the rotator! Thank you Kind regards, -Al Schmidt Waupaca, WI."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Greene",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:29:10.000Z",
          "Titre": "Jet stream",
          "Contenu": "I have the jet stream. It has worked well at our lake.  I had an issue with the motor stopping and they fixed it under warranty with no issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Boettcher",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T17:40:29.000Z",
          "Titre": "I purchased a jet stream and in a short…",
          "Contenu": "I purchased a jet stream and in a short period of time I have a weds free sandy beach. I would recommend this product to everyone. Todd Boettcher"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Bigelbach",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T03:27:48.000Z",
          "Titre": "Quick shipment",
          "Contenu": "Quick shipment, O made an error on my order and they took care of me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Kennedy",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:18:38.000Z",
          "Titre": "Great product and great service!",
          "Contenu": "Great product and great service!!  Very responsive and actually care, rare thing nowadays."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcie",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:29:02.000Z",
          "Titre": "Charlie was super kind and helpful",
          "Contenu": "Charlie was super kind and helpful. We are very happy with our JetStream! We did research and believe we found the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Laudenbach",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T21:07:06.000Z",
          "Titre": "Love our Jetstream",
          "Contenu": "Love our Jetstream!  Quality built and much more affordable than the competitors!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Cole",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T03:34:30.000Z",
          "Titre": "We love the jet stream we purchased",
          "Contenu": "We love the jet stream we purchased. It keeps the water moving and helps keep the weeds away and the muck away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Vaughan",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:13:24.000Z",
          "Titre": "The jet stream is amazing",
          "Contenu": "The jet stream is amazing. It is helping us create our beach."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Koehler",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:06:03.000Z",
          "Titre": "Products are superior quality and…",
          "Contenu": "Products are superior quality and customer service is second to none!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Y",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T19:13:42.000Z",
          "Titre": "Great product",
          "Contenu": "Bought a aqua blower a few years ago and still going strong. Cleans up nicely"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Newell",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T21:53:04.000Z",
          "Titre": "Quality products and excellent service…",
          "Contenu": "Quality products and excellent service for industry-best value!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MJ",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T01:26:35.000Z",
          "Titre": "Top notch product",
          "Contenu": "Very happy with my purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Conklin",
          "Nb_Reviews": 4,
          "Date": "2023-09-01T18:54:49.000Z",
          "Titre": "Great products at a great price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Moss",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T01:08:41.000Z",
          "Titre": "Excellent customer service!"
        }
      ]
    }
  ]
}