{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "alignable.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Olivera",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T01:57:01.000Z",
          "Titre": "This is a scam",
          "Contenu": "This is a scam. You pay and in return all you get is soliciting and more soliciting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "johnsageek",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T03:01:27.000Z",
          "Titre": "Received an email from an elderly…",
          "Contenu": "Received an email from an elderly client who has verified she has never heard of Alignable. Concerned with security and verification and the ability of third parties to \"spoof\" an \"invitation\" email from an elderly woman."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BosTech",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:54:19.000Z",
          "Titre": "I received a bogus email from…",
          "Contenu": "I received a bogus email from Alignable. They were impersonating one of our partners in business introducing the platform. We confirmed that our partner never sent the request and doesn't use the platform. Alignable made the email appear to come from someone else. Beware of emails from Alignable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Hayes",
          "Nb_Reviews": 4,
          "Date": "2023-11-04T13:07:23.000Z",
          "Titre": "This company continues to send me…",
          "Contenu": "This company continues to send me unwanted emails and I am considering legal action since there is no way to contact them'Today, November 3,2023 Alignable sent a response that I can simply “unsubscribe “ but I think it is important to note that this company sends emails from people you have a connection with on LinkedIn for example, and make it seem as though the email was sent by that person. This is what I consider to be fraud. Just like the person that did the next complaint under this one. I had that very same experience. Why should I have to be the person to take an action to stop Alignable from contacting me? The unmitigated nerve of these people. To put it bluntly, they are terrible! Also like the person that did the review below my review, Alignable made it appear as though someone in my network emailed me and I contacted that person and they confirmed they did not send the email. FRAUD!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rcs son",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T08:15:34.000Z",
          "Titre": "The worst",
          "Contenu": "The worstSending emails to everyone i ever sent an email?From my business email?The worst"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katbrat",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T16:06:01.000Z",
          "Titre": "Scam Company, Rips You Off, and Spams You!",
          "Contenu": "I tried Alignable because \"said other business network\" was going downhill. I even opted for the premium membership and their newsletter upgrade advertisement to send event info to my select areas. Spent over $1000 on this network and I didn't even get a newsletter to show me where my ad was, just a \"confirmation\" it was sent! Received absolutely no new business, connections, or anything relevant in my area. They spammed my contact list, I couldn't get a hold of their customer service\", and I couldn't remove my company after I got ripped off! Not worth it, don't bother! This is a scam company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ruth Goldston",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T01:35:22.000Z",
          "Titre": "Using my contact list without permission is not OK!",
          "Contenu": "I received an invitation to join from someone I know and accepted it. I did not give permission for Alignable to access my contact list, yet several people I know have received invitations to join purportedly from me. I want to just get off...it's not something I really need and I am disappointed that other people are now getting what seem to them to be spam emails from me. Please let me know how I can get off Alignable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dario Garcia",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T22:30:19.000Z",
          "Titre": "they are using my name to email other…",
          "Contenu": "they are using my name to email other people and pretend is me who sent those emails. unacceptable.Hi,It’s Dario from Dario Garcia Insurance Agency in South Salt Lake.I’d like to be able to refer customers to you, so I’ve added you to my network on Alignable, a site exclusively for business owners to network with each other.Accept my invitation(Note: this invite expires in 24 hours)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Monique B",
          "Nb_Reviews": 4,
          "Date": "2021-04-14T15:43:20.000Z",
          "Titre": "On the Low End of Real Estate Software",
          "Contenu": "Product is difficult to use and getting hold of a live person is practically impossible. I've asked their \"Support\" staff, such as it is, multiple times, to stop sending unsolicited requests to connect from me to other business. They say they've turned that feature off, then it starts again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Bernett",
          "Nb_Reviews": 2,
          "Date": "2022-09-07T18:03:04.000Z",
          "Titre": "Sorry folks; to me it's a sham",
          "Contenu": "Sorry folks, but I find the whole thing to be a farce.  It all seems to be based on how many recommendations everyone has.  But what I see is a bunch of people making and/or asking for recommendations from or to people who they don't know and have never even met.  How can you possibly give an honest recommendation to a person or business that you have absolutely no experience with.  That fact, in itself, makes the whole concept a sham."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Todd Greiner",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T05:28:58.000Z",
          "Titre": "I found the service very expensive for…",
          "Contenu": "I found the service very expensive for market coverage….C$300-500 per prospective customer to look at our sponsorship page. No new customers. Maybe alignable is just not big or relevant in our area. It was very difficult to navigate their site to cancel or change and customer service very difficult to reach.  No phone nos available….only web service. Frustrating.The impressions are not representative of anything significant for marketing results. The 9 warm leads, were mostly are friends and colleagues …not true prospective customers. None become new customers. Over 4 months of about C$1500…disappointing results. Sorry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bizzy sox",
          "Nb_Reviews": 1,
          "Date": "2021-08-26T16:51:43.000Z",
          "Titre": "Once you dive in deeper you learn that…",
          "Contenu": "Once you dive in deeper you learn that not everyone is legit on Alignable.  Beware of hard money lenders - big scam site for them :(  Even the \"Recommendations\" aren't trustworthy!  Private money scammers are posing as legitimate lenders and using info to look like they are real.  Talk to them before sending $$ if their voice sounds suspicious and their email doesn't exactly match the website, just beware.  Do a lot of research and try not to get so caught up emotionally that you will be receiving money.  I learned the hard way.  Don't Zelle or Venmo etc.  These guys have become very knowledgeable in the industry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Foreverflyyphotos",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T15:24:56.000Z",
          "Titre": "No Support and Intrusive",
          "Contenu": "They bait you into thinking contacts of yours are on the platform when they arent and spam them acting like you invited them... they will not respond to support emails nor give any rhyme or reason why their site is broken other than upgrade to premium for better support..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Advanced Computer Diagnostics",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T17:53:35.000Z",
          "Titre": "So far one of the worst support I have…",
          "Contenu": "So far one of the worst support I have ever experienced. I'm a premium member. I have reached out to my support \"coach\" it took 3 days to get a response that did not deal with my issue, (not being able to create a product because alignable things it's already been created), When I responded with exact pictures and an even more detailed description of the issue, I got nothing back from my \"premium coach\" it's been over a week and I'm left extremely disappointed. I've worked with free services that had better support!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Meheroo Jamshedji",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T16:31:18.000Z",
          "Titre": "Fake and False site",
          "Contenu": "Fake and False site.  Every week we receive an email from the Company informing us of a Promotion 'we sent in last week' and how they sent it to 470 viewers.  We wrote back to say we have not posted anything for over a year.  Our email came back \"Oops. Your reply ended up in an unattended mailbox\".  They continuously ask for referrals and recommendations for businesses we don't know, have never spoken to and have never met.  This \"fake\" referral practice has been going on for ages. Customer Service is nil when a customer cannot call and speak with a person, and when all emails land up in the \"unattended mailbox\"."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christie",
          "Nb_Reviews": 1,
          "Date": "2021-04-24T00:36:41.000Z",
          "Titre": "Credit cards charged for a FREE account and refund refused!",
          "Contenu": "I talked to someone in tech support to ask them why they had charged me a monthly fee every month in 2020 on TWO SEPARATE credit cards while I was taking care of a relative in another state even though I was told that, according to their records, my listing was a FREE listing. I then asked them to refund the incorrect charges and their response was \"Sorry, we aren't going to refund the money we charged in error but we will stop charging you as of this month.\" It was unfair, uncouth and added insult to my injury! So I need to call Alignable out as a disreputable SCAM.  Way to add to the misery of everything else that happened in 2020!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jody Hooper",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T18:39:32.000Z",
          "Titre": "Fillmore Eye Clinic; Las Cruces",
          "Contenu": "The customer service/patient care is at the bottom of the pole.  After 4 appts over past year, I arrived at 8 am for an 8:15 am appt.  After 1 hr and 20 min and being insulted by the front desk (taller lady) I walked out -- never to return again.  Believe Dr. Fillmore would be better served to teach his people to respect other people and their time and that there is no room for being told lies or talked to unrespectful, unappreciate and their darn don't give a d---- about you as a patient came through loud a clear -- again after 1 hr. 20 and still have not seen a doctor.  Don't waste your time here.  Lots of others in LC"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Timmons",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T21:36:08.000Z",
          "Titre": "Worst company ever stay away I hope…",
          "Contenu": "Worst company ever stay away I hope everyone leaves them a 1 star rating. I canceled their services because they do not work. And they keep changing my charge card . I disputed charge they lie to the charge card company to rob me ! Stay away from them! They are liars they will not cancel even when calling as I did and they still charge my card lairs !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Cynthia Ganga",
          "Nb_Reviews": 11,
          "Date": "2022-07-31T01:00:36.000Z",
          "Titre": "Super racist and creepy posts to talk…",
          "Contenu": "Super racist and creepy posts to talk about current events from a very racist or neo-conservative framework. I know I live in Alberta, but I\"m not a racist red neck. Kept meeting people who I would avoid like the plague in real life."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dolly Miller-Brennan/Brennan Artography",
          "Nb_Reviews": 4,
          "Date": "2021-09-19T06:41:54.000Z",
          "Titre": "Alignable Harassment",
          "Contenu": "Alignable is without doubt the very worst of any business networking group. There is no communication nor is there even a method through which to communicate to Alignable. I was constantly being added to groups without my permission. I responded politely,  simply asking please do not add me to groups without my permission. The final straw was being added to a group called Elevator Pitches. When I asked not to be added, I then was harassed by Kevin O'Mera, an Alignable staff person. He laughed and told me to leave my pitch before I left for good. The group then continued to harass me  with notices. I reached out to Alignable customer service but they obviously  refused to  respond. I would like to give them a minus 10. I closed out my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Rubi",
          "Nb_Reviews": 1,
          "Date": "2021-02-21T07:19:35.000Z",
          "Titre": "I wish I could give them 0 stars",
          "Contenu": "I wish I could give them 0 stars.  Terrible customer support.  They won't allow me to cancel my subscription.  They won't reply to my emails.  The \"Premium Coach\" feature is an absolute joke.  I wouldn't normally wish this upon any business, but I truly hope they close up shop.  Oh and when I was using it, it was absolutely useless.  If you're about to sign up for Alignable, do yourself a favor and close  the tab."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ka Zh",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T06:03:27.000Z",
          "Titre": "This website advertises for…",
          "Contenu": "This website advertises for illegitimate and fraudulent business practices who do not have business licenses, insurance or pay taxes. In particular, one that comes to mind is King Dome Roofing in Central Saanich, located at 7427 CENTRAL SAANICH RD. Phone number  (778)679-4565. Person's name: Andrew O'Connell."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Berazate",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T20:28:25.000Z",
          "Titre": "Alignable is great if you are in need of friends.",
          "Contenu": "Alignable is great if you are looking to make Friends who are business owners and who want Referrals. I have yet to have anyone engage me to do actual business. Just a lot of Hey let's refer business to each other. I do not see the point in paying for something that has not gotten me not one lead. Just a lot of people who want business referred to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zen Makai",
          "Nb_Reviews": 2,
          "Date": "2022-05-21T05:48:31.000Z",
          "Titre": "The WORST The Small Business Networking Experience I have ever had!",
          "Contenu": "Terrible service!  If I could give \"minus 100 stars\", I would.  I am NOT happy that non-business contacts were imported.  This was NOT made at all clear when I was going through their business profile set up.  Literally one day after halfway setting up my businesses profile I began getting emails from several  non-business contacts who were confused as to why they were receiving emails from Alignable/me out of the blue.  We promote a \"No Spam\" clause on our business contact page so those unwanted emails to non-business clients were not only confusing to them but also gave my business a bad look.  Alignable does not offer an easy way to go through imported contacts after the fact to to update and remove non-business contacts which is ridiculous.  Because of all of that, and the amount of time I wasted trying to figure out how to modify contacts, I found ZERO value from Alignable and ended up deleting my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victim",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T19:31:23.000Z",
          "Titre": "I dislike how they do business . I hate spam",
          "Contenu": "We started to receive email from someone who is a customer of ours.The email acted like we were best friends with them. I have no idea who they were.So I looked up Alignable and they are a \"networking\" company who charges alot for a perceived value. Mainly is get other businesses looking for customers to be your customer. The initial email pretending to have only a 24 hour time limit or offer will expire. But in reality, they will keep hounding you When people sign up for the service it will ask to get access to all your contacts so they can email all your contacts on you behalf stating how great Alignable is and that they should join Alignable within 24 hours. And since the emails would be sent out just after someone JUST signed up, how  can their emails stating how great is the service?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronen ben Reuben",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T06:43:03.000Z",
          "Titre": "I See Dead People.",
          "Contenu": "I received a request from a dead person, several months after their death.  It is beyond disturbing and should be criminal. At the very least it is pathetic. What a crap platform."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzanne Marcus Fletcher",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T01:20:45.000Z",
          "Titre": "Alignable's Predatory & Abusive Internet Practices",
          "Contenu": "Alignable634 N. Falmouth Hwy, Suite 1666North Falmouth, MA  If I could give negative zero stars to this malevolent, pond-scum of an organization, I would. Instead, I am filing a lawsuit after numerous, unheeded COMPLAINTS which have not been remedied, and worse, copiously repeated with defiant will. It's as if they are saying, \"MAKE US DO THE RIGHT THING.”  I am among the alleged (many) who issued Alignable very specific demands to delete the fraudulent use of my personal name, delete the fraudulent use of my business name, and, not least, delete from Google an entirely FALSE CLAIM THAT SUGGESTS I AM MANAGING OR ORGANIZING A NETWORKING NEWSLETTER FOR THEM! They are the LAST COMPANY on earth I would associate myself with. After Google has TWICE REMOVED this negative, false association from their search engine, (twice within two weeks), Alignable has brazenly re-posted it on their URL it within 24 hours. This behavior is not only predatory, they are using unsuspecting people's bright reputations to try and boost their own deplorable internet profile. STEER FAR AWAY unless, of course, you like this kind of abuse."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-06-12T15:52:04.000Z",
          "Titre": "This is totally worthless",
          "Contenu": "This is totally worthless It will help you zero If you enjoy expressing yourself this is a platform If you want to make money , this is not the platform Please remove me froYour participants I find it annoying and have requested to not renew I give this platform a minus 100 .. worthless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gone Fishing",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T12:42:10.000Z",
          "Titre": "Alignable is hard to use and really not…",
          "Contenu": "Alignable is hard to use and really not worth the effort. I tried it and joined several groups. Most have a no self promotion clause in their rules. If this is to promote your business, you have to self promote. But that is not allowed by every group I joined. There are restrictions on introducing yourself and your business. All of this is really strange for a site that is there to promote a business. I made one post on a women's business site. It was taken down as self promotion even though I saw other posts up for several weeks exactly like it. Maybe it is who you are? If you get an invite. PASS. It is not worth the time.Update: I got a reply from Alignable wanting to talk to me about my experience. I found that reply catering to my experience with their website by saying they are examining their no self-promotion policy What is the use of having a site to promote your business if you are unable to promote your business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Jameson",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T19:36:35.000Z",
          "Titre": "I never signed up for Alignable that I…",
          "Contenu": "I never signed up for Alignable that I know of but I keep getting email invites from people in my area but don't know. I never write bad reviews. This is actually my first, but wanted people to know.  I called one of the email invites to see if he actually sent me an invite to connect or if it was a bot.  He had no idea what I was talking about and yelled \"I do not know you.. and hung up\". Obviously, he did not send the invite to connect. Hah.  This is a scam/bot illegally getting your contacts and others and sending fake invites to people and businesses in the area."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Latonya",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T15:44:46.000Z",
          "Titre": "Absolutely the worst social media…",
          "Contenu": "Absolutely the worst social media platform to say the least. I stopped using Alignable 5 months ago. All of a sudden late January of this year, i get charges of $420. I emailed several times about the charges and to credit my account back the charges. Guess what....no communication. My last email to them this month was letting them know how unprofessional they were by not responding. Instead of returning my funds that I did not authorize, they choose not to respond. Now, I am putting the claim in with my bank and providing my bank with the emails. I will be filing a complaint with BBB as well. You would think instead of making it right...this hideous social media platform chooses to keep a past customers funds and go through all the negativity of bad reviews etc. Oh by the way, before these charges from them, I received an email out the blue from support. My response was to please advise. Well darn without no response....me asking to please advise was not a greenlight to bill my account for services I had not used in 5 months. It amazes me that they were so quick to take funds, yet they lack miserably at customer service and communication."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Moon Dragon Hemp Co.",
          "Nb_Reviews": 2,
          "Date": "2021-07-16T20:50:54.000Z",
          "Titre": "I will update this if your services…",
          "Contenu": "I will update this if your services actually get our business results.  I received this review link 5 m8ns after send a post. 1 star doesn't mean it won't be a 5 I just need time. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JKramer",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T15:26:28.000Z",
          "Titre": "It provides absolutely no benefit to…",
          "Contenu": "It provides absolutely no benefit to business outreach and development. After testing it out for a few months, I was able to generate exactly zero leads but did manage to generate the need for new SPAM filter rules on our company e-mails server!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Curtis B",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T21:44:42.000Z",
          "Titre": "This company somehow stole my wife's…",
          "Contenu": "This company somehow stole my wife's data and created a profile without her knowledge. It then spammed her contacts about joining it.  This company should be shut down or sued!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 4,
          "Date": "2022-12-27T01:22:15.000Z",
          "Titre": "Alignable is marketed as a new social…",
          "Contenu": "Alignable is marketed as a new social network site for local businesses. I was invited by an employee of a local business to the platform. They had my email in their database from 4 years ago when we reserved something in their store. I don't believe this individual intentionally invited me. I believe while registering they chose the option to allow Alignable access to their email contacts. Alignable's bot found our business url in their database. The Alignable bot is certainly an ingenious bit of spoofing. It drills into your contacts and emails other business owners with the identity of the individual who registered. That person never even knows the emails were sent out in their name. When I registered directly through the site versus the email invite from this individual, I could see how I got the initial email \"invite\".  Once you sign up, it unleashes relentless invites to make you engage with it. I'm seeing invites in our spam folder by businesses unrelated to our market, including out of state businesses.Do not, by any means sign up or allow anyone you know to register with Alignable. Alignable is taking in new unsuspecting victims daily. I highly suggest using the more trusted LinkedIn platform instead, until somebody else offers a safer alternative to Alignable for local businesses."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Eli Araboff",
          "Nb_Reviews": 3,
          "Date": "2021-09-22T21:09:54.000Z",
          "Titre": "Can't connect with people in my neighbourhood",
          "Contenu": "Recently I can't connect people who Alignable used to send them over to my email. I used to connect to all, but now it doesn't send my request to the people which Alignable send emails to connect with them. This is so weird. And the worse is that customer service doesn't reply my messages. I reported this issue or bug  to couple of people but nobody's there to reply. I'm a bit pissed off with this system."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeoperdized_user",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T06:15:51.000Z",
          "Titre": "Use at Your Own Risk",
          "Contenu": "Today, my company encountered a serious issue with Alignable that I believe warrants immediate attention. Without our approval, numerous invitations were sent from our domain to group email addresses, posing as official communications from a user in our company. This not only jeopardizes our reputation but also raises severe concerns about the platform's security and integrity.We reached out to Alignable's executive team as soon as we became aware of this situation, hoping for a swift and adequate response. Regrettably, we received no communication in return, further eroding our trust in their service.At this point, we can't be sure whether Alignable's system was compromised or if this is an inherent issue with their service. Regardless, the potential damage to our reputation and the clear lack of customer support make it impossible for us to recommend Alignable to others.Our Advice: If you're considering using Alignable, proceed with caution. We strongly advise against connecting your company's domain address to their service, as you run the risk of unauthorized and potentially harmful actions being taken on your behalf."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremy Larsen",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T22:49:51.000Z",
          "Titre": "Steer clear",
          "Contenu": "Literally a bogus email from \"Sara\" at Alignable that bounced back as a bad email address when I replied.  These are horridly bad people.  Nothing but bogus leads and made up connections."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T21:00:11.000Z",
          "Titre": "Beware, it spams all your contacts",
          "Contenu": "This site blasted invites to everyone on my sister's contact list without really asking permission"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JENNIFER",
          "Nb_Reviews": 3,
          "Date": "2022-02-22T16:25:31.000Z",
          "Titre": "This company is shady AF",
          "Contenu": "This company is shady AF - they will spam your entire list. I've worked with a lot of sites and vendors and I've never seen anything like it. Please do NOT use!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Lee",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T16:14:07.000Z",
          "Titre": "UPDATED Beware! Alignable will spam your contacts without your permission",
          "Contenu": "Beware!! Alignable will spam your contact list without your permission, despite assurances on their website that they won't. I have been getting an influx of new connection requests in the past week from my contacts (after months of nothing) and discovered just this morning that Alignable emailed 60+ of my contacts with the same generic connection request. The company clearly doesn't care, as evidenced by the ridiculous non-response from Alignable on the many similar comments about the same issue in which they only restate that they won't do what they are obviously doing.*Edit to address Alignable's 4/4/23 reply: I went through the \"onboarding\" process months ago and at that time I did \"skip\" the option to invite others. I am very aware of this option and always decline it (on this and other platforms). The incident I reported was *not* the result of user error during account setup. Again, these connection request messages were sent by Alignable without any choice or initiation on my part. Further, colleagues of mine have been reporting the same thing happening to them in the past few weeks: contact requests are being sent on their behalf with neither their knowledge nor permission. Despite making multiple attempts to raise this concern with Alignable – that there may be something wrong on their end that needs further investigation – the company keeps repeating the assertion that they will never send out connection requests without the user's permission and attempting to deflect these concerns by blaming user error. Interestingly, a search online shows that users have been complaining about this *exact* issue for more than a year, and probably far longer. The fact that the issue still persists clearly demonstrates that Alignable knows about the problem but doesn't care and has no intention of solving the issue. I will continue to warn others about the issues at Alignable and the need for users to protect do everything they can to protect themselves (ideally by avoiding Alignable entirely), since the company clearly won't."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Leigh Publicover",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T14:10:27.000Z",
          "Titre": "Poor and unproductive business engagement",
          "Contenu": "Aside from having been useless at making business connections for me, I deactivated my account because of an unscientific public survey regarding masking and vaccinations. This \"survey\" could be answered multiple times and did not reflect actual local business standards. It was disproportionately flooded with misinformation and invited controversial and non-productive dialogue which had the potential to reflect negatively on business. This was extremely poor business practice and Alignable should have known better."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ramesh",
          "Nb_Reviews": 2,
          "Date": "2021-01-12T03:01:11.000Z",
          "Titre": "I am a doctor who was registered with…",
          "Contenu": "I am a doctor who was registered with alignable. One person wrote that he has chest pain and wanted treatment. I have no protection for this kind of situation and I may have to employ a lawyer.This is an emergency situation and he was I guess trying to trap me into litigation.If you are a professional please think twice about joining this group"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-29T17:14:33.000Z",
          "Titre": "I think there’s too much work to reach…",
          "Contenu": "I think there’s too much work to reach out and find the right partnerships for people to make relationships during Covid that cannot be face-to-face or introduces businesses that could work together. I sponsored a newsletter I never got any kind of replies I think there should be more follow through on your companies and complementing or endorsing companies that spend the money on the newsletters as well as trying to pair off. I tried to disenroll but paid for a year"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EZ",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T22:47:17.000Z",
          "Titre": "Spam generator",
          "Contenu": "Spam generator, nothing more. I got an invite from a 10 year old personal contact after Alignable dug into email history and spammed invites to any contacts without this person's knowledgeable consent. These are data collectors and profiteers, not community builders. Do not sign up. Do not give them your email. Avoid at all costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cal bader",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T16:34:16.000Z",
          "Titre": "alignable wants a better score",
          "Contenu": "Alignable has some issues where users mistakenly email their entire contact lists. I'm not sure why people enjoy this service and have never signed up. I notice a lot of the 5 star reviews they got here are all from July 15-16th, whereas prior to that time their reviews are spread out and closer to 1 star. Also my 1 star review was flagged by alignable to try and get it removed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Melissa Wheeler Tulloch",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T16:11:25.000Z",
          "Titre": "I did not sign up for this service but…",
          "Contenu": "I did not sign up for this service but my husband received an email \"from me\" saying that I work for a business (that I do not work for) and asking that he follow the link so I can refer customers.Since it was sent a family member they obviously knew it was not sent by me and that I am not associated with the business the email claimed I was but it was very misleading to someone who may not be a closely connected."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "George Gidora",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T15:07:45.000Z",
          "Titre": "I accepted an invitation from a colleague",
          "Contenu": "I accepted an invitation from a colleague to Alignable, followed the prompts, and before I knew it every single friend I had on Facebook and on my contacts were getting invites from me. I had no choice on who I wanted to invite. This was way over the top in my estimation so I spent a lot of time apologizing to very many people for getting something from me unsolicited. I quickly de-activated my account and I want nothing further to do with this outfit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Altman",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T22:14:33.000Z",
          "Titre": "This scam is pure evil",
          "Contenu": "This scam is pure evil. I did not fall for it, because I don't allow myself to get hit by such obvious scams.Apparently... Someone in an industry that has nothing to do with mine, and that I haven't spoken with in probably 5 years, suddenly emails me and wants to connect about clients? HA!A quick Google search and I can tell this is a ridiculous scam. Please don't spread it. They are like a virus."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lotus Wellness Choice - Nilou",
          "Nb_Reviews": 2,
          "Date": "2020-11-27T05:56:50.000Z",
          "Titre": "Alignable have no customer service",
          "Contenu": "Alignable have no customer service. No way to contact a human being. If you go for paid membership they charge you year after year without the notice. You cannot contact them to ask for refund or complain. They didn’t help my business growth s bit. And they can get quiet expensive.  Don’t waste your time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt Bell",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T14:25:38.000Z",
          "Titre": "I have never hated a product that I…",
          "Contenu": "I have never hated a product that I have never used before. Alignable is the worst perpetrator of social media invitation spam that I have ever experienced. I have received 100s of invites to Alignable, yet still do not know what Alignable is nor why I would want to use it. In reviewing the site, oh look it's a small business referral network. Like LinkedIn? If I never get another email from Alinagble again it won't be soon enough."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Data Diva",
          "Nb_Reviews": 2,
          "Date": "2020-05-29T13:35:04.000Z",
          "Titre": "Don't reuse your passwords",
          "Contenu": "A friend who started a new business signed up, so I made a profile to help him.  Very much regret it.  Constant emails even though I have unsubscribed.  They are using the same trick LinkenIN used years ago, having something that looks like a login page but is asking for your contacts.  So someone that thinks they are logging, but in fact are giving access to their contacts.  It's a good reason to not re-use your passwords, especially the one for your email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Lowe",
          "Nb_Reviews": 2,
          "Date": "2019-07-23T14:26:36.000Z",
          "Titre": "I joined about a week ago - BIG MISTAKE!",
          "Contenu": "I joined about a week ago.  I thought this company was similar to LinkedIn.  However, this morning I received an Email from one of my customers in my Email contacts that said he has received about 50 Emails from this company since I signed up - not him.   This is very negative for my business.    DO NOT SIGN UP WITH THEM!  I NEVER AGREED TO SHARE MY EMAIL CONTACTS, BUT THEY MUST HAVE THEM ANYWAY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Mckee",
          "Nb_Reviews": 2,
          "Date": "2019-07-15T22:19:49.000Z",
          "Titre": "scam....",
          "Contenu": "Scam, notice the detail in all the 1 star reviews and the generic posts of the 5 star ones..?And the equal amount of 1 and 5 reviews..?  Try deactivating your account. You're instructed to click on a link to be emailed instructions.  What...? lolIn 20 years, i'm afraid our entire world will be run like this site, entirely by algorithm's. Not a single beating heart to be found..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marion Renk-Rosenthal",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T03:35:34.000Z",
          "Titre": "Horrible experience",
          "Contenu": "Horrible experience! I was recently invited by a vendor I have known for a while. I signed up and deleted my account very quickly. The interface is horrible. The email campaigns are spammy and there are basically no free features, Plus, with LinkedIn, Google and all the other networks out there, this is a massive waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "william clyde",
          "Nb_Reviews": 10,
          "Date": "2019-06-03T17:59:09.000Z",
          "Titre": "No way to opt out",
          "Contenu": "A business friend of mine sent me something it had his name on it it was tied to alignable I clicked on it and I’ve never been able to get the these pathetic insects off of my phone or any of my devices there’s no way to ever opt out I have contacted attorney generals in 31 states already I’m going to make it my life goal to shut this Educate everyone I can about how pathetic this company is"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Bubbah",
          "Nb_Reviews": 1,
          "Date": "2019-05-31T18:05:22.000Z",
          "Titre": "Did not sign up for the service",
          "Contenu": "Did not sign up for the service, but I saw the exact same message delivered to two individuals in our company from the same source.This networking tool should be using a legitimate (ie intentional) method of distribution rather than misrepresenting you to your contact list. Else, it appears to simply use your contacts to spread to as many people as possible in order to get a few who might willingly sign up for their paid service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrey Radovski",
          "Nb_Reviews": 1,
          "Date": "2019-03-08T23:45:21.000Z",
          "Titre": "They filled out my profile with wrong…",
          "Contenu": "They filled out my profile with wrong information from an old defunct business without my consent, and then sent invites to hundreds of other local businesses to check it out before I could edit or proof anything - now all these potential local connections have a wrong idea of what my business does. This service is not just useless - it's potentially detrimental to your business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer Service",
          "Nb_Reviews": 1,
          "Date": "2019-04-29T04:08:42.000Z",
          "Titre": "They deceitfully made me think I was…",
          "Contenu": "They deceitfully made me think I was 'connecting' with people I knew already on the platform, but instead they were inviting everyone in my contacts list, which included some of my customers and colleagues in my industry. Now both I, and the people I know (who received an invite from me that I never sent) are bombarded with hundreds of emails and notifications each day and week. It is a nuisance and has caused my company more harm than good"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Lucania",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T20:55:06.000Z",
          "Titre": "HORRIBLE EXPERIENCE ALIGNABLE",
          "Contenu": "HORRIBLE EXPERIENCE WITH ALIGNABLE. UNLESS YOU PAY $30 PER MONTH, IT'S USELESS! AND IF YOU REALLY WANT IT TO BENEFIT YOUR BIZ, THEN YOU BETTER UP THE GAME BY FORKING OVER $89 PER MONTH! I DELETED MY ACCOUNT AS SOON AS I LEARNED THAT. NOT SURE WHAT THESE PEOPLE ARE SMOKING, BUT IT LOOKS LIKE THEY SHOULD HANG IT UP AND RENAME IT RESIGNABLE.COM ONLY A MORON WOULD THROW THEIR MONEY AWAY TO THESE PEOPLE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jared",
          "Nb_Reviews": 1,
          "Date": "2018-09-14T15:07:00.000Z",
          "Titre": "i started the process to sign up…",
          "Contenu": "i started the process to sign up because I thought it was a legit website (which maybe it is).  I decided half way through the sign up process not to proceed but had already submitted my email address.  It's been less than 1 hour since my original email inviting me and I've received 8 different requests asking for me to connect with them.  Seems like spam to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 5,
          "Date": "2018-06-29T12:26:47.000Z",
          "Titre": "Alignable asking full email account access",
          "Contenu": "Any company asking for access to my email account should get blocked instead. Giving anyone, specially completely unknown to you, full email account access is a enormous security risk and I still can wrap my head around why would someone give them such a permission.I won't even cover, how useless this service as referral platform is. When I see these 5 star reviews IMHO they are fake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stan Gawlik",
          "Nb_Reviews": 1,
          "Date": "2019-08-14T13:20:22.000Z",
          "Titre": "Conceptually good, execution and capability are however terrible",
          "Contenu": "I joined a few weeks ago, an old work colleague had sent me an invite. Conceptually alignable is a good idea, however execution and capability are significantly lacking.Oh, emails, meaningless emails, I know get at least five of these a day, please stop, they are annoying. In fact, I now have a spam rule just for alignable emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AN",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T17:58:43.000Z",
          "Titre": "Should change their name to The Spam Network",
          "Contenu": "They should really change their name to The Spam Network. They rely on people to subscribe as part of a chain reaction of spam. Just received an invitation to join and did a little research and they are known for this. They forcibly use peoples contacts and even if they opt out of it, they send spam invitations to all of their contacts. Very shady business tactics, which actually goes against the CAN-SPAM laws. Will be reporting them to FTC. A Reminder each individual email they send that is spam is  $43,280 in fines FTC can charge them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DCP123",
          "Nb_Reviews": 4,
          "Date": "2020-01-06T17:25:13.000Z",
          "Titre": "Avoid spreading this plague at all costs",
          "Contenu": "Alignable is blatant Spam looking to scrape your contacts and Spam everyone you know with fake messages in your name.There are two types of reviews for this site one-star reviews from victims and five-star reviews from Alignable's bots.  OK, maybe there are a few other reviews, but 99% are one of these two."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LL D",
          "Nb_Reviews": 1,
          "Date": "2018-12-10T14:25:35.000Z",
          "Titre": "Heed all the 1-star review",
          "Contenu": "Heed all the 1-star review.  They are honest.  Alignable is just a 'wanna-be' Facebook or LinkedIn.  Their software will mine your contact list and send spam to everyone.  If your contact list still contains names of folks you'd rather forget or have been trying to cut ties with Alignable will destroy your efforts.  SPAM SPAM SPAM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "roxanne ong",
          "Nb_Reviews": 1,
          "Date": "2018-11-15T20:19:38.000Z",
          "Titre": "Spammy",
          "Contenu": "I am sorry I even vaguely responded to my friend's request -- they don't know where to draw the line on their contact frequency and end up spamming you when you are simply not ready to engage (ever heard of the snooze button in customer lifecycle??!).  It's so annoying I had to unsub. I'm ok with good old fashioned LinkedIn."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 1,
          "Date": "2020-05-22T19:32:00.000Z",
          "Titre": "If only these messages truly did expire in 24 hours...",
          "Contenu": "A business acquaintance I haven't heard from in 4 years sent me an invite to Alignable on May 20, 2020, saying the invite will expire in 24 hours. I did not respond, and lo and behold! Another invite from her 2 days later. I see the pattern, and will now proceed to mark these messages as SPAM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharyn Provenzano",
          "Nb_Reviews": 1,
          "Date": "2019-07-29T20:49:12.000Z",
          "Titre": "ABSOLUTELY THE WORST!",
          "Contenu": "ABSOLUTELY THE WORST!! You cannot reach anyone with whom to speak. Only e-mails. And I swear they are being answered by robots!!!!  Do NOT get SCAMMED into giving them your money. You will never get it back! You will have to close your account to get rid of these robots/people whoever the hell they are!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tp4boo!!!",
          "Nb_Reviews": 2,
          "Date": "2018-04-02T16:30:29.000Z",
          "Titre": "DO NOT JOIN!!!",
          "Contenu": "DO NOT JOIN!!!!  They are a spam farm. I do not remember giving them access to my contacts, but I received a message from them thanking me for granting them access.  Shortly after someone began sending emails from me but from a different email address.  They were asking my contacts for money in the form of -iTunes gift cards.  I went back to the site and deleted my account, but my contacts still get spammed from me.  IT IS A MAJOR INCONVENIENCE!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 6,
          "Date": "2018-11-28T20:18:16.000Z",
          "Titre": "Spammers",
          "Contenu": "It's spam all the way down.Try reading the five-star reviews for Alignable and ask yourself how many seem like real users and how many are fake.Alignable seems to be in business just to suck down contact information.  I only receive Alignable email from people I don't know — people who can easily find my email address/twitter handle and contact me directly. It's viral in the same way that herpes is viral, except you're more likely to have fun contracting herpes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "bfelter",
          "Nb_Reviews": 13,
          "Date": "2019-11-03T14:41:16.000Z",
          "Titre": "I joined Alignable and was horrified to…",
          "Contenu": "I joined Alignable and was horrified to see dozens and dozens of people I know, and some I hoped to never know again listed in my contacts. I was asked \"what can I do for you\" by numerous accomplices and learned from a tech savvy friend they tap your contact list. I spent an hour responding to connections that it was an accident and hopefully un-joined the next morning but they never said they deleted all my information. Unless you're starting in business and are desperate for connections, its Creepy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Stinson",
          "Nb_Reviews": 1,
          "Date": "2018-05-25T20:27:12.000Z",
          "Titre": "They are not only stealing your contact…",
          "Contenu": "They are not only stealing your contact list but every email and every communication you have made in any platform you give them access, too. They sell your personal data to Axciomm just like Google does when it steals from your phone and makes 109 billion off of your pictures and what not. This program is to be considered hostile."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Parker",
          "Nb_Reviews": 2,
          "Date": "2020-04-06T18:19:13.000Z",
          "Titre": "Quite the nightmare of a company",
          "Contenu": "Quite the nightmare of a companyTheir tactics for recruitment are scummy to say the least. Luckily no one in my org. has fallen for it yet, but it appears a lot of the clients we work with do, as our system seems to get one of their spam deceptive recruitment emails about 3 times a day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Simons",
          "Nb_Reviews": 1,
          "Date": "2018-12-13T15:02:41.000Z",
          "Titre": "I joined at the 'invitation' of a vague…",
          "Contenu": "I joined at the 'invitation' of a vague contact. I did NOT allow them access to my contacts. I was immediately contacted by multiple people in my area, some that I already work with which was fine, some of which had businesses 20 miles away. As soon as I saw a few others I wanted to contact, I was told they were outside my radius unless I went \"premium\", read, paid for it. I asked about this on their question forum and my question disappeared. I think business is a SCAM!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andrew Yull",
          "Nb_Reviews": 1,
          "Date": "2019-06-03T13:51:26.000Z",
          "Titre": "Insidious &, invasive. Do NOT use this software",
          "Contenu": "I don't need to go into details, as every other 1 star rating has obviously had the same experience I did. The fact that almost every review is either 1 or 5 stars makes me think these people are doing their own 5 star reviews to drive up their ratings. No product gets genuine results that polarized."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Brown",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T18:04:35.000Z",
          "Titre": "I signed up for Trustpilot just so I…",
          "Contenu": "I signed up for Trustpilot just so I could write this bad review.I am absolutely astonished by the level of email spam I get from this company. I am talking about those tactics that the first social media networks used to get you and everyone you know on to their platforms. Alignable still does this. I've unsubscribed multiple times. I've gone in and clicked through the copious amounts of dropdown menus that Alignable has created to spam me within narrower and narrower categories of spam. It doesn't stop.It's unbelievable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Tunkel",
          "Nb_Reviews": 2,
          "Date": "2019-09-04T13:25:23.000Z",
          "Titre": "A spam generator",
          "Contenu": "A spam generator.  Tried to explore it, got a couple of screens into the signup process and then cancelled after it wanted permission to grab all my contacts.IT GRABBED MY CONTACTS ANYWAY, and then started spamming me with email purporting to be from my contact list.Just say no and run away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Metzgar",
          "Nb_Reviews": 2,
          "Date": "2019-07-27T16:10:10.000Z",
          "Titre": "Garbage hole / spammers",
          "Contenu": "I got added to their mailing list months ago, so I clicked on a link to see what it was all about. Since that day I received on average 5 emails a day from them. They’re spam, and a garbage site. Also seems like they’re violating GDPR in a pretty big way having my info before I even signed up."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Patrick Brunelle",
          "Nb_Reviews": 1,
          "Date": "2018-10-18T14:40:47.000Z",
          "Titre": "They seem to be applying some shady…",
          "Contenu": "They seem to be applying some shady marketing tactics. Many of the people leaving reviews on here have only ever left one or two reviews. First alarm bell. Second, I keep getting spam invites to join the network from people I barely have relationships with (might have met with them once or twice). Beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Capes",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T19:32:08.000Z",
          "Titre": "Yes, Alignable.com is a scam!",
          "Contenu": "Actually, No Stars if I could rate that way.Yes, Alignable tried to scam me into joining by making their invitation to join look like it was coming from a friend with his own business. That friend never heard of them. Don't be a SUCKER!Here is what the sender looks like: Friend's Name via Alignable  invitations(at)alignable.comVery professionally done; but, even my GoDaddy spam filter caught it and sent it into \"Bulk Mail\". I usually sift through there to see if they have redirected one of my clients, which rarely happens, but..."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Glen Brown",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T01:44:50.000Z",
          "Titre": "Work towards pevention or ending the pandemic",
          "Contenu": "Why doesn't Alignable look at promoting businesses that are actually doing something to prevent or stop the spread of coronavirus or COVID =19.  There are lots of front line businesses that are combating the virus, cleaning companies, restoration companies etc..  Also look at who owns Alignable.  I know we are all struggling at this time and everyone is trying to stay afloat, but at least be honest, I do not know any person or company that doesn't want this pandemic to come to an end.  Come on people let work on prevention with a positive attitude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave M",
          "Nb_Reviews": 2,
          "Date": "2020-11-03T13:11:42.000Z",
          "Titre": "This is a scam site",
          "Contenu": "This is a scam site! I just received a \"Connection request\" which I KNOW that person didn't send!!! How do I know this? Because the person who sent it (Supposedly) is my sister, and she passed away earlier this year!!! Another lying tech company!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SamS",
          "Nb_Reviews": 1,
          "Date": "2018-10-26T23:32:39.000Z",
          "Titre": "A horrible experience",
          "Contenu": "A horrible experience.  Wish I had never clicked on the link. Not entirely sure they didn't grab my business contacts and send notes to all of them.  I wonder if that's how they got my info.  Let the high-pressure marketing begin!  Email after email.  Utterly useless approach to doing business."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Carol Carter",
          "Nb_Reviews": 7,
          "Date": "2019-01-21T18:36:46.000Z",
          "Titre": "So terribly disorganized",
          "Contenu": "So terribly disorganized.  I have sent email after email and asked questions in the forum and no one is responding .This person Gabriel must be a robot because he addresses me like we are friends and I hate that !!! If yo cannot be professional and answer emails then do not contact me !!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher M",
          "Nb_Reviews": 3,
          "Date": "2019-05-20T16:07:23.000Z",
          "Titre": "Spams your contacts and claims you are interested in referring.  Terrible!",
          "Contenu": "I got a generic request from a contact to join because he wanted to refer us business.  Next thing you know I signed up free and it ended up spamming my entire contact database posing as me saying I was INTERESTED in referring them business how embarrassing.  Even myOwn colleagues.  The concept is good but for God’s sake this is a disgusting business practice and really needs to stop. They cannot represent you as interested in anything do to your contacts.  If I see another email go to my contacts I plan to contact the BBB and a lawyer"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon Benson",
          "Nb_Reviews": 20,
          "Date": "2020-05-26T12:39:28.000Z",
          "Titre": "Apparently Dr Steven R Poliakoff MD…",
          "Contenu": "Apparently Dr Steven R Poliakoff MD from Miami wants me to join so he can refer clients to me.Really?  Never heard of him or Alignable until I received this 'time limited' offer.Will be blocking these scammers from the various mail servers I run for clients."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Yoder",
          "Nb_Reviews": 1,
          "Date": "2018-04-24T13:11:49.000Z",
          "Titre": "If I could give zero stars I would",
          "Contenu": "If I could give zero stars I would, this is completely worthless, unless you enjoy your email blowing up with junk email. I have asked Alignable questions on how I can make the most of this application but all I get ways to promote Alignable rather than my businesses. Completely useless waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M",
          "Nb_Reviews": 1,
          "Date": "2018-06-26T17:42:59.000Z",
          "Titre": "poor attempt at a social network for small businesses",
          "Contenu": "This network does not allow exploring its solution without giving access to one's email account.  It also does not give a way to ensure all your personally collected data has been removed from their system upon deactivation of one's account.  Horrible UI, confusing purpose, poor execution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anne Rothenberg",
          "Nb_Reviews": 2,
          "Date": "2019-09-04T17:23:06.000Z",
          "Titre": "I originally thought this was a good…",
          "Contenu": "I originally thought this was a good idea to sign up for. I have been on for over a year and have not received one referral. Even worse is that I received a request from a friend who owned a business but is deceased. I know he could not have set up the request! This is a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Polite Tia",
          "Nb_Reviews": 6,
          "Date": "2020-07-01T13:58:43.000Z",
          "Titre": "Alignable  Is Very Suspicious",
          "Contenu": "Alignable  spammed one of FaceBook contacts. He was a former co-worker as well.In the midst of filling out the link, emailed to me, I decided to call my FaceBook contact. He know nothing about Alignable, nor did he forward any link, from Alignable, to me!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Valerie K",
          "Nb_Reviews": 2,
          "Date": "2018-03-27T18:39:28.000Z",
          "Titre": "I started receiving spam from someone I…",
          "Contenu": "I started receiving spam from someone I emailed ages ago. When I got in touch with them, they had no idea that Alignable had been sending all of these emails on their behalf. I'm not even in the U.S.! Alignable, please delete my email address from your databases and leave me alone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl Klodzinski",
          "Nb_Reviews": 1,
          "Date": "2019-04-23T16:10:00.000Z",
          "Titre": "I am disappointed that i cannot see…",
          "Contenu": "I am disappointed that i cannot see connections without a paid subscription. I was not happy that it send out emails to all my contacts me knowing it. I was hoping that this sight would have been better and not i wish i would have looked at the reviews before accepting"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Saper",
          "Nb_Reviews": 3,
          "Date": "2017-12-23T18:03:05.000Z",
          "Titre": "Alignable has spammed all of my social …",
          "Contenu": "Alignable has spammed all of my social media contacts with invitations Despite repeated attempts to contact the company ( support contact button doesn't work) and to deactivate my account  ( deactivation doesn't work),I can't reach them and want to quit my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2018-10-23T20:33:03.000Z",
          "Titre": "Random Spam, Not Valuable Networking",
          "Contenu": "I've never done business with this company and am getting spam from them, claiming I have a connection to some unknown weight loss business in another state. I would not trust a company that sends out meaningless junk to strangers and calls it \"networking.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred m",
          "Nb_Reviews": 2,
          "Date": "2020-10-21T14:28:15.000Z",
          "Titre": "This is just a scam to steal…",
          "Contenu": "This is just a scam to steal information from your contact list. You will get multiple daily fake emails from them pretending to be people you know. Any company that starts a relationship lying and trying to trick you is a company to avoid"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Malorie Ann",
          "Nb_Reviews": 2,
          "Date": "2020-04-10T18:09:40.000Z",
          "Titre": "Illegal Email Marketing",
          "Contenu": "I was auto-subscribed to their emails (never visited their site before). Pretty sure it's illegal to send marketing emails to people without their consent. Definitely wouldn't do business with a company that's so desperate and shady."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allison C",
          "Nb_Reviews": 2,
          "Date": "2018-06-11T19:20:47.000Z",
          "Titre": "Phish? Scam? I don't think it's a legit company.",
          "Contenu": "I had never heard of this site before this morning, when they stole contacts of someone else and started spamming me with creepy emails about my \"account\" (which doesn't exist, and using the wrong name). I'm very concerned about clicking the unsubscribe button, as this looks very much like a scam or phish. I'll be reporting all the emails as spam and hoping Google's filters can handle it.If this is actually a legit company, they should know that this is a great way to make a name for themselves, but that name may not get past a lot of language filters."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed Terry",
          "Nb_Reviews": 2,
          "Date": "2018-11-18T17:33:17.000Z",
          "Titre": "My dead friend did what? DO NOT SIGN UP!",
          "Contenu": "I was originally very excited by the active community. That was until I received an e-mail stating that a recently deceased local had checked my profile and welcomed me to the community. Now I'm realizing that most of this activity isn't real. This company appears to be using the names, businesses and accounts in their system to fictitiously reach out and spam other people into signing up for or getting more engaged on Alignable. This is a bad business practice! I tried to deactivate my account and they said that they'll send an e-mail with instructions. Still haven't received it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vanessa Love",
          "Nb_Reviews": 2,
          "Date": "2018-05-13T21:51:31.000Z",
          "Titre": "Not worth it.",
          "Contenu": "I joined this because of a person in a referral group said it was great for networking. And it was, AT FIRST. Then, they started monetizing. So, if you're not paying premium for their service, then, you're not getting too many connections. I've repeatedly ask what exactly constitutes a local connection, since I can't connect to someone 7 miles away, and there was just an automated response about how many local connections I get IF I don't buy their service. I haven't received any solid referrals from it and right now, I'm SEVERELY disappointed with their service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Garage Door",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T20:58:11.000Z",
          "Titre": "Everyone looking to sell ; no buyers",
          "Contenu": "IF YOU WANT TO SPEND MONEY ON CONSULTNTS ND OTHE4R BUSINESS SERVICRES AND SCHEME HOW TO ADVANCE YOUR BUSINESS GO AHED.  EXPECT A TON OF EMAILS FROM DIFFERNET ALIGNABLE ENTITIESif you want to increase business or advance sales this is not a good place for you.  Think weak and solicitous chamber of commerce.also use trustpikot to reduce bad reviews which is a nuisance"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heidi",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T20:26:27.000Z",
          "Titre": "Pointless, stick to LinkedIn",
          "Contenu": "No. Just no. I only joined because I thought I was being personally invited by a trusted contact. Turns out this email was sent on her behalf without her knowledge or permission. Now I'm being inundated with endless connection requests from unrelated businesses, And all I can think is how many of these were actually legitimately sent on purpose? Their growth model seems to only be based on forcing their way into our address book and soliciting to our contacts on our behalf without being clear that they are doing this. This is dishonest, misleading, and just plain wrong.Stick to LinkedIn."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "onlye",
          "Nb_Reviews": 9,
          "Date": "2022-11-02T19:59:24.000Z",
          "Titre": "Should You Join Alignable - Maybe - Maybe NOT",
          "Contenu": "I have had a membership for over a year.  May be good for some but I have not benefited.  You'll have to detemine the value yourself.I did have quite a bit of trouble canceling the membership.  Alignable did respond after several attempts and canceld the membership.  I appreciate that response.So should you join?  Maybe, the concept is good but not so much the implementation.  The local connections didn't play out for me.  I got suggestions to a other members outside my target area.  For me, I couldn't justify the cost based on benefits."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeanne ar",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T03:01:30.000Z",
          "Titre": "contacts list",
          "Contenu": "As you are signing in, it does briefly ask if it can have access to your email contacts and send everyone of your contacts an invitation making it look like it came directly from you but it still accessed my email contacts and asked if I wanted to connect with others and gave me the option to say yes or no. The bottom line, I don't like programs that access my contacts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Schwing at Big Dog Models",
          "Nb_Reviews": 18,
          "Date": "2020-09-21T17:04:43.000Z",
          "Titre": "Very underwhelming B2B experience",
          "Contenu": "Very underwhelming with a confusing platform, no dynamic newsfeed, and requests for bogus referrals from unknown businesses. Free LinkedIn is better for nationwide reach. Way too many emails. It cost 15 bucks to find that out for \"verified\" status and business links were still blocked in messages. Save your money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "joann Bradley",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T01:03:24.000Z",
          "Titre": "Little concerned",
          "Contenu": "Little concerned, there are a lot of bad reviews on this site. I just stumbled on the page. My beef is that I can't connect with someone down the street from me because I don't have a PAID account. so every time I try to connect with folks I know it directs me to the sign up to pay, Now the cost is not high but I definitely get more from a free linkedin account so why would I pay for a something I can't even add contacts to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T12:49:53.000Z",
          "Titre": "Pay $180 per year or it serves no purpose.",
          "Contenu": "Everything is hidden behind the paywall. Why would I pay $180 per year when I can do the same things on LinkedIn for free. My advice is to provide more accessibility for free with some features locked behind the paywall.  You'll at least grow your user-base this way. Otherwise, advertise this as a premium service and provide something really unique. I am constantly hit over the head with full-screen overlays and emails that constantly remind me that I need to pay to use this. You have every right to charge for your service, but if you're going to have a free version, make it worth it. I'm satisfied with other apps & networks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Jo Hamlin",
          "Nb_Reviews": 2,
          "Date": "2020-11-11T02:29:46.000Z",
          "Titre": "Helpful in some ways but not in others",
          "Contenu": "We have found Alignable helpful in connecting with other businesses, but we purchased 2 Newsletter ads - one for a week in October & 1 for a week in November. I never got the October Newsletter ad in my email so I don’t know if it even ran. The November Newsletter ad came to my email, but it said “Check out this Salon.” We are not a salon - we are a bowling alley! I asked the person who has communicated with us about our ads a week ago and she has never responded! I feel like we threw away our money, which after being forced to be closed for 5 months this year due to the Covid situation in our State, this is especially difficult. I would at least like a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "don",
          "Nb_Reviews": 10,
          "Date": "2019-02-16T14:08:27.000Z",
          "Titre": "Someone sent me a request to sign up…",
          "Contenu": "Someone sent me a request to sign up and I did. So far it is useless because you cannot do anything without a paid subscription. I will not buy to find out if the value is there. Based on reviews here I defintiely will not buy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dale Hill",
          "Nb_Reviews": 1,
          "Date": "2018-09-09T21:22:15.000Z",
          "Titre": "I don't  understand it, can't use it, and they mislabeled my firm",
          "Contenu": "I don't know how I was put on alignable.  They got the name of \"my company\" wrong -- it is a membership organization I advise, and I have no authority to network on their behalf. It took me a long time to have  my own company registered but I still get questions on the other one. I have repeatedly asked what it is for (of both the company and so-called connections) and gotten no satisfactory answer. They keep bugging me. Meanwhile, when I try to reset my password, a three-step process is described (seemingly linked to linked in) which simply does not match what I see  on the screen. I sense it might be useful, but it is hopelessly poorly designed, so I haven't unsubscribed yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T14:38:17.000Z",
          "Titre": "My profession is not listed so I have…",
          "Contenu": "My profession is not listed so I have to use something that I am not.I can not enter my business so most people pass over me.Alignable has not been very helpful"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben Ridley",
          "Nb_Reviews": 3,
          "Date": "2019-03-11T05:21:47.000Z",
          "Titre": "Very often",
          "Contenu": "Very often, they don't put the businesses in the right category. I wanted to share Esco Title, which appears as an \"Insurance Company\" in their website (???) and after I searched for few other small businesses, and often the category has nothing to do with the activities really done. Also, they allow a company to recommend itself (???) and to be recommended several times by the same person or entity (???), what is boosting their recommendation's score. It's the case with Barron Brook Inn I wanted also to share and saw that Barron Brook Inn were recommending itself and Debbie Krider recommended twice. Last point; When you are in vacation or business trip outside US/Canada (what happens from time to time in my case for business purpose), you can't sign-in (or sign-up if you want to join)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Ledford",
          "Nb_Reviews": 2,
          "Date": "2019-08-01T12:50:47.000Z",
          "Titre": "All about the Money!",
          "Contenu": "Want way to much money for it, really can't do anything with this,unless your willing to pay 30 to 45 dollars a month or more!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T13:00:18.000Z",
          "Titre": "Because you take information from…",
          "Contenu": "Because you take information from others email address and try to use them as new contacts that we already have and know."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Loza",
          "Nb_Reviews": 1,
          "Date": "2018-08-12T02:27:53.000Z",
          "Titre": "For Beginners Only",
          "Contenu": "I have been contacted before by someone I \"know\" encouraging me to sign up on Alignable. Just happened again this week, and I noticed this time a notice telling me the offer would \"expire in 24 hours\". Now why would that be if it was simply a referral to a cool new website? It wouldn't.Notice also that all the positive reviews on 'Trustpilot' are WAY over the top, managing to hit all the key \"marketing\" points without citing specific and quantifiable results for their particular business. Not saying this is a complete scam, but no real online networking site I've ever seen acts this way. Real web service companies - the legitimate and useful ones like 'Mail Monkey' who ask for your contact list etc. are open about what they do (usually email management and promo activities), and about what they charge for their service. 'Alignable' is pretending to be something it is not.IMO, if anyone really needs this \"service\" to meet people in their area of work, then they are beginners, and will look back one day on this experience as part of their gullible early years. Seriously."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Henry Frattaroli",
          "Nb_Reviews": 6,
          "Date": "2019-09-18T12:16:51.000Z",
          "Titre": "I have not received any referrals yet",
          "Contenu": "I have not received any referrals yet.  It has been over a year since I joined."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 3,
          "Date": "2018-12-22T13:42:16.000Z",
          "Titre": "Clear Concept, Abysmal Execution",
          "Contenu": "Alignable's concept is clearly defined: become aware of and connect with local businesses.  The execution, however, borders on a train wreck.  For example, there is no place for basic, individual profiles -- e.g. if a citizen simply wants to have a profile, and then connect to local businesses.  The assumption is that everyone is part of a local business, and so you have to list your business name in your profile.  That may seem benign on its face, but consider the ramifications if you work for Amazon, Google, et al.  You'll get spammed to death.  Sure, you can enter hyphens or underscores in your profile's business name, but that's a clunky work-around.Once in the Alignable ecosystem, it is not clear what should happen.  The algorithm driving suggested connections is in dire need of training, but there is no clear path for an individual user to help it out.  There are some preference and interest settings, but they don't seem to impact anything.  To illustrate, I am a middle-aged male who's been getting the same haircut for decades; nowhere in my profile is any interest in hair services or spa services listed; yet at least 30% of the suggestions provided to me by Alignable were for stylists, salons and the like.  Maybe I live in an area with an overabundance of hair service professionals.  Or maybe Alignable is a good idea that is not executed well, at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathryn Lane",
          "Nb_Reviews": 2,
          "Date": "2020-07-08T16:33:55.000Z",
          "Titre": "The website is very difficult to…",
          "Contenu": "The website is very difficult to navigate and find what I want."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T01:47:54.000Z",
          "Titre": "YOU  DO  NOT  SUPPORT   THE  SMALL …",
          "Contenu": "YOU  DO  NOT  SUPPORT   THE  SMALL  COMPANIES...Dr. Sasha"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Collins",
          "Nb_Reviews": 9,
          "Date": "2023-08-25T14:18:07.000Z",
          "Titre": "Limited, glitchy, time-consuming",
          "Contenu": "A small-business social network focused on solving business problems and helping each other succeed? Sounds great! Too bad the execution is so poor. After half a year I realized I have spent more time helping Alignable fix its issues than building connections to potential colleagues. Alignable actually makes those connections difficult. YMMV if you are based in a densely populated metropolis, but my radius of permitted contacts is way too narrow. Even when a premium member from outside my radius contacted me, I couldn't reply through Alignable unless I paid first. That makes it pretty clear where the company's priorities are. Even premium members complain of limitations on their allowed activities. It's a self-defeating way to run a social network, because your customers will take their relationship off-network (to LinkedIn, Facebook, etc.) when you make it too difficult to work within yours. About that network interface: Alignable is poorly designed and confused about its aims, so as a new user it's hard to find your way and quickly determine what this is for. (Alignable, you haven't communicated anything about yourselves that's as clear and concise as my definition in the first sentence of this review. You should steal it. And try to live up to it.) On the technical side, there are some glitches that are frankly bizarre to see in a 21st-century website. One is the way outgoing messages used to appear (thru spring 2019) with arbitrary line breaks in the middle of words. Are you guys still using Windows 98? Because that's what your message interface reminds me of. Elsewhere you'll find the interface too busy and ambiguous. I haven't forgotten how many steps it took to customize my notifications from Alignable (and trust me, you'll get a lot of them, even when there's nothing new to report). That interface was absurdly unresponsive, forcing you to click twice to expand lists, then select checkboxes one by one. I assume that was intended to make you give up. What it almost did instead was convince me to close my account -- but I can only imagine how difficult they make that process. After half a year and several contacts with Alignable staff, I am persuaded that the company leadership sees customers not as people to be served well, but as sheep to be shorn of vendable data. I don't think the situation is likely to improve.UPDATE: In reply to Nick's comment below, I believe I did enter into the spirit of Alignable's stated mission, and I was thoughtful about which businesses I approached. I don't appreciate the implication that my business was sending out too many invitations or seeking sales opportunities. Also, I cannot buy his claim that the notifications interface was made extra time-consuming \"based on feedback we've had from other members.\" I won't accuse Nick of being dishonest, but I do not believe that that was an honest statement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sparkles",
          "Nb_Reviews": 3,
          "Date": "2020-07-16T00:27:55.000Z",
          "Titre": "1 Star",
          "Contenu": "1 Star sorry."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Hammond",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:48:40.000Z",
          "Titre": "I have just started using Alignable…",
          "Contenu": "I have just started using Alignable more and am still deciding if my experience is useful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael McCleve",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T14:56:51.000Z",
          "Titre": "Alignable Is Good - Needs Improvement",
          "Contenu": "Alignable Is Good Needs Improvement. They provide a very useful platform for connecting with other businesses. They offer effective ways to connect with groups of other like-minded people. They are not very good at being responsive to business owners who offer to provide content (and agreeing to upgrade their membership to do it) and to host networking events. I've experienced a lack of responsiveness to my submissions and I have spoken with others on the platform who have had significant issues with their lack of responsiveness."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Collins",
          "Nb_Reviews": 4,
          "Date": "2023-06-17T20:16:02.000Z",
          "Titre": "I think that one has to think carefully…",
          "Contenu": "I think that one has to think carefully before subscribing to this service and look carefully at its benefits. There is a very successful Realtor in my office who has subscribed for a couple of years and has not got one connection that could help him in his business. We are both Realtors in Beverly Hills, CA. We're mostly being hit up by mortgage brokers and inspection services. I subscribed after I had already joined. Manage your expectations on how this can help you grow your business,"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mohammad Muddassar Alvi",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T12:29:59.000Z",
          "Titre": "Nothing exciting new stuff going on",
          "Contenu": "Nothing exciting new stuff going on. Just do something different!!!You Have members so get them involved Get fresh new ideas from members Offer something like nice rewards and good gifts for good ideas."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heide Rainey",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T21:46:41.000Z",
          "Titre": "Social Media Marketing Shouldn't Break Your Budget",
          "Contenu": "While you can connect to local businesses and it is a typical social media site for business, the cost to make it really useful is far too high.You can only connect to 10 people within 2 miles of you in the free version. The next step, $15 mo gets you 15 connects within 8 miles; $30/mo does get you 40 connects but is still only with 24 miles. In order to connect to other businesses nationally it is $90/mo. This is quite a bit of money each month for a social media site and quite frankly, not worth it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Earl Williams",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T19:17:25.000Z",
          "Titre": "I have made several recommendations to…",
          "Contenu": "I have made several recommendations to you in regards to your premium rates you need to LOWER the cost on your premium and give people More for what they are paying for ! I DO want to become a Ambassador  BUT here again I feel by lowering your premium rate more people will actually invest into your platform. give People MORE for what they are actually getting, Offer discounts, Special Promotions and special pricing just for Ambassadors!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Hayden",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T10:21:56.000Z",
          "Titre": "I joined Alignable to acquire customers…",
          "Contenu": "I joined Alignable to acquire customers period. I haven’t acquired any customers since I joined. To be honest the platform has been useless to me. Facebook has been 1000 times more effective for me. It might be helpful if we could view our network by business category so that we know who we want to reach out to."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "John D Allen",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T23:50:28.000Z",
          "Titre": "Am I reinstated as an Ambassador?",
          "Contenu": "I sent my updated credit card information in 3 - 3 1/2 weeks ago. I was told when you got it I would be reinstated as the Ambassador for the St. Thomas, ON area. So far nothing.?????"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-04T23:46:41.000Z",
          "Titre": "While i think the platform is great and…",
          "Contenu": "While i think the platform is great and your staff amazing, the difficulty for multiple business owners to have an account for each business is very disappointing. With one cell number it is surpremely difficult to verify multiple businesses. I would suggest you look at google, twitter, youtube as ways to handle this better. We should also have a way to do an introduction in addition to a referral, a lot of times i have to people i want to introduce, but i am not endorsing them which is what i feel a referral is."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joyce Paulette Fox",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T00:15:25.000Z",
          "Titre": "Ability to Post Information/Offers About Business",
          "Contenu": "I would like to be able to post more information about my business and what I offer. I am a new business and need to build up clients."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 2,
          "Date": "2021-06-26T16:25:54.000Z",
          "Titre": "Several of my collegues have complained…",
          "Contenu": "Several of my collegues have complained that if they join me on this site, they get to many emails from total strangers and it fills up their inboxes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Gilbertson",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T18:28:47.000Z",
          "Titre": "Alignable is not a social media platform. That doesn't make it useless.",
          "Contenu": "To be fair to Alignable, it's important to realize that the kinds of SMB that can benefit from an online networking platform are the kinds of small businesses that can benefit from (mostly local) networking of any kind. And it's important to keep in mind the word \"small.\"--This is not LinkedIn. Real estate agents/brokers, financial advisors, accountants, plumbers, contractors: businesses that are primarily focused on a local area can network beyond where they might otherwise be able to reach. But if networking breakfasts or your local Chamber of Commerce aren't useful to you, Alignable probably won't be, either.It is not a platform for advertising. Nor is it a social network in the mold of Facebook. It IS a platform where business owners can reach out to their local business community for advice, or help, or to share experiences.So if you go into Alignable expecting to boost your sales through social advertising, you will be disappointed. If you want to connect with your peers in an ad-free, conspiracy theory-free environment, like a non-stop online MeetUp, it will work for you.I'm not on Alignable to generate business, mostly because I don't have clients/customers in my local area (and in most cases they aren't small businesses). But I enjoy being able to help a national community in my profession that I probably wouldn't reach otherwise, and it's good to be in touch with peers outside of my normal circle."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wendy Levey Consulting",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T15:23:29.000Z",
          "Titre": "Relevant connections",
          "Contenu": "I have made some really good connections on Alignable, I just wish there were more educationally oriented people."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T17:20:25.000Z",
          "Titre": "Not much activity on this site maybe…",
          "Contenu": "Not much activity on this site maybe because it’s new and growing"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T19:46:51.000Z",
          "Titre": "I love the ability to connect with…",
          "Contenu": "I love the ability to connect with other companies but I am getting tired of being baited to keep buying products or buying promotions… I did have a very expensive membership for a year and was never prompted to use it which caused us to decide to cancel it now it feels like every time I do something I am told I could pay so much a month and it’s a real deterrent when I’m trying to grow my business in these difficult times"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-01-11T18:49:03.000Z",
          "Titre": "Although I find the platform helpful",
          "Contenu": "Although I find the platform helpful, I am offended by the phoney reviews. People keep giving me positive reviews even if they don't interact with me or refuse to.If this happens to me, how can I trust reviews that are positive for others?Also, I waste countless—credits for companies that are not active. They should be removed.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rochelle Klein-Loper",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T22:07:50.000Z",
          "Titre": "Point of View",
          "Contenu": "When I first started it was offered free which was a great way t meet and network. Then you went to Pro which is a monthly charge, As a small business owner especially during this Covid crisis I have to watch my money. You are also limited in the area of your business. Honestly, the concept is great but the pricing is not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2020-07-16T16:17:00.000Z",
          "Titre": "Easy to use for making connections",
          "Contenu": "Easy to use for making connections. Once the connection is made there is little to no follow-up on the connection side. Usually hear like a month or two later - I didn't see your message because I don't check this site that often. Very slow load time for all activities on this site. I built a pretty good network here, but it hasn't paid off like LinkedIn has for actually giving and receiving referrals."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Wall",
          "Nb_Reviews": 3,
          "Date": "2020-11-29T19:10:20.000Z",
          "Titre": "I have seen no business benefit",
          "Contenu": "Personally - I have seen no benefit from alignable. I tried to use it but it has not generated any quality leads. Most of the connections I have had through Alignable have been spam or people trying to con me out of something. Not to say that there hasn't been some contact...but overall not been proven to be worth my time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katalina Nolen",
          "Nb_Reviews": 1,
          "Date": "2018-12-28T14:28:26.000Z",
          "Titre": "Have to spend money to make connections.",
          "Contenu": "Constantly get emails stating my network has grown. Not true unless you pay for it. You are allowed 15 connections, that is it, before having to fork over money per new connection. Not worth it. The connections currently made, there is no real interaction. If you want to build a base, find a site that allows it for free with extra special features that cost. Connections should not cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nannette",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T20:59:10.000Z",
          "Titre": "I am here as a small business owner to…",
          "Contenu": "I am here as a small business owner to promote my business. I am here to learn about other businesses in my area, and how we can work together as one to lift one another up and not necessarily compete for customers. In this trying time of insanity we need to be united in our approach."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eloise Schwarz",
          "Nb_Reviews": 2,
          "Date": "2020-10-27T18:16:35.000Z",
          "Titre": "Resources for one and all",
          "Contenu": "One of many referral and social medias to use these days, I have to attend to many activities in the day.  I volunteer on 5 different committees for three different organizations.  Mind you I am retired and disabled but I know that the work that I do is meaningful for those who receive them.  I do what I can with what I have when I am able.  Nothing in my hands is available but what I have in my mind and heart.  These are free for you so that you may be safe and able to hear well and go about your activities of the day as others do.  This is but one of the vehicles I use to help you know me and I know you.  Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Robbins Network",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T15:22:10.000Z",
          "Titre": "Alignable Review",
          "Contenu": "Alignable is a good way to get a lot of networking done without attending inconvenient meetings. However, whether you use the free version, or one of the paid versions, it can be difficult to land actual clients. Like a network meeting, everyone is there to sell their own stuff. While you do get your information seen, even at the highest paid membership level, my experience has been that maybe 1% or less of all the people you contact, actually do business with you. Plus, there are technical glitches with Alignable which help render it less effective, whether you pay for the service or not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Spector",
          "Nb_Reviews": 2,
          "Date": "2020-06-25T22:33:49.000Z",
          "Titre": "Alignable is rather strange",
          "Contenu": "Alignable is rather strange. They use glowing descriptions about themselves, but when you sign up it is not clear exactly how being a member will help your company, or how you can help other companies.I was sent an invitation to a webinar apparently one day before it is to be held, with no information about exactly when it will be (or even how to sign up), so it is not likely that I can fit it into my schedule.The registration process was okay, and I was invited to share my company on a \"newsletter\", but when I looked at the details, I found it costs a minimum of $200. Sight unseen!Yes, it's a strange company, hard to understand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T22:08:37.000Z",
          "Titre": "I don't  have a complaint",
          "Contenu": "I don't  have a complaint.  I don't even know if this is possible, but I would so love for the businesses to be catagorized in some fashion where as you could pick a catagory and see all in that catagory."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pat Hand",
          "Nb_Reviews": 2,
          "Date": "2018-02-20T23:40:53.000Z",
          "Titre": "I'm on the fence",
          "Contenu": "I'm on the fence.  I've made a handful of great contacts, had a few cups of coffee in face-to-face meetings -- but the geographic limitations are very frustrating.   In order to add new contacts outside my immediate neighborhood (even those who have reached out to me and requested to connect), Alignable requires that I download my contacts.   At one point I did download dozens of my contacts, but that did not result in the ability to connect with even a single business outside my current neighborhood.   I see the potential here but too difficult to connect with my own contacts who happen to be outside my immediate location."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Miranda",
          "Nb_Reviews": 1,
          "Date": "2019-01-28T21:15:00.000Z",
          "Titre": "I guess I would say that I find it…",
          "Contenu": "I guess I would say that I find it ineffective because the responses, or lack thereof, is the issue.  I have reached out to individuals on a consistent basis to no avail.   Not a negative nightmare but just a non effective platform."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Joan Powell",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T14:52:41.000Z",
          "Titre": "The one thing that annoys me is I have…",
          "Contenu": "The one thing that annoys me is I have not found a way to express my real concern because I've not located 'free' spaces. If there is no place to ask my question, I have found no alternative."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Wilkinson",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T20:46:55.000Z",
          "Titre": "I should be able to Connect with Local…",
          "Contenu": "I should be able to Connect with Local Business Owners and Clients without having to pay extra $$$.  You know, like Fb and LinkedIn.JW"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T00:44:06.000Z",
          "Titre": "Nice way to stay connected with local…",
          "Contenu": "Nice way to stay connected with local business owners and keeping up to date with what is helping and hurting entrepreneurs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2021-01-05T15:00:13.000Z",
          "Titre": "We cant pay for this service",
          "Contenu": "We cant pay for this service, but what is free is helpful- mike spino, director of community partnerships- 770-355-7587"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KATHE",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T22:13:47.000Z",
          "Titre": "I noticed that the initials on my…",
          "Contenu": "I noticed that the initials on my profile are incorrect... Other than that, all is well..."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Delia",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T20:59:11.000Z",
          "Titre": "How come the App is no longer useful on…",
          "Contenu": "How come the App is no longer useful on Android?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Woodburck Noe",
          "Nb_Reviews": 9,
          "Date": "2021-01-03T06:34:22.000Z",
          "Titre": "Somewhat Effective",
          "Contenu": "Somewhat effective to network with businesses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobbie Abdallah",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:41:26.000Z",
          "Titre": "It's a great platform to network with…",
          "Contenu": "It's a great platform to network with other businesses. I also like the new ideas and groups they are constantly adding to make the platform better!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candy Wilson Canigan",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T16:54:05.000Z",
          "Titre": "Overlapping Events",
          "Contenu": "Excellent networking tool and educational webinar opportunities to learn.  I left one star blank because the only problem I find is that if I below to more than a few Groups, then Administrators may schedule an event at the same day and time as other Groups that I belong to will is a conflict for me. Is there a way that you can prevent the over-lapping of events? Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Vasquez",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T22:18:38.000Z",
          "Titre": "Great site for business networking.",
          "Contenu": "So far, I have had a great experience. My biggest complaint is, I made a post letting people know I'm an ambassador and that I would be happy to help people get their profiles set up. Someone responded asking for help. When I tried to give them my contact info so we could set up an appointment to walk through their profile it immediately said it was \"blocked by a moderator\". I don't understand why that would happen. I thought part of being an ambassador was to do that. I wasn't trying to solicit business, I was trying to help. I also once had a post say that, and when I tried to reach out to figure out exactly why no one ever responded."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Ryder",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:22:46.000Z",
          "Titre": "I really enjoy the vast majority of the…",
          "Contenu": "I really enjoy the vast majority of the people on Alignable and I do appreciate the emphasis on getting to know people before you try and sell them something. However, there needs to be more opportunities to showcase products and to sell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Abroms",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T20:37:15.000Z",
          "Titre": "I thought the meeting was…well done",
          "Contenu": "I thought the meeting was professionally done.  Many good points on keeping your clients in check.  However, I have found meeting a prospect for the 1st time doesn't allow for too much personal exchange of information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Ahlquist",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T22:27:15.000Z",
          "Titre": "I find most network partners are not…able to refer me",
          "Contenu": "I find most network partners are not able for me to refer to and vice versa. I feel like for a networking site, I should NOT have to pay extra money for unlimited connects. That is not going to help anyone's business but Alignable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oleg P Moskalensky",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T04:02:31.000Z",
          "Titre": "Mostly very good, but can be dramatically improved better",
          "Contenu": "Mostly very good, but still many small things that need to be fixed, like being unable to delete one's own posts, automatically hiding posts for no good reason etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T19:39:53.000Z",
          "Titre": "No Effective Helpline!",
          "Contenu": "I repeat, since it erased. Your service seems like a useful tool. But I have no means of contacting anyone at your company directly for help or advice, no name, no email. Also I have no price list as to what it would cost to upgrade my outreach. I am not particularly tech savvy and I am basically operating with you blindly in the dark! Lissa Moira Arthrob Productions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Smolinski",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T14:13:59.000Z",
          "Titre": "It took a bit to write some content",
          "Contenu": "It took a bit to write some content, upload photo's, and get set up, but once I went through the process I noticed a significant contact increase with respect to businesses and communicating to them directly from Alignable.  The site is continuously active and increasing traffic with a very high level of proficiency in making a portal functional.  The proof is in the positive results I am receiving. Well done Alignable team!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sally Jo",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T16:05:50.000Z",
          "Titre": "email notifications not working",
          "Contenu": "Overall, I am very pleased with Alignable. I am still not being notified by email when someone sends me a message. My email is correct on file as I'm receiving everything else. Please fix this problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren Mayfield",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T21:40:03.000Z",
          "Titre": "I am enjoying making connections with…",
          "Contenu": "I am enjoying making connections with other businesses which I can receive and offer support from and to! I would like to maybe have a bit more geological area preference, as a lot of my connections work in a state in which I cannot assist."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Breau",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T19:09:01.000Z",
          "Titre": "Slow, Steady Progress",
          "Contenu": "I haven't gotten any new students directly through Alignable, but I'm getting good responses on my blogs and have met two different math teachers who want to work with me to offer a full slate of services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Morris Therapy and Consulting,",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T23:04:03.000Z",
          "Titre": "Great responses from other business owners in the area.",
          "Contenu": "After receiving feedback Alignable immediately referred my company to responsive businesses in my community. Two businesses reached out and exchanged information with me. The other business referred my services to the head of their company. This I was very helpful. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Wayne Worley, Ph.D. Dr. J",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T17:20:43.000Z",
          "Titre": "I cannot endorse someone \"sight unseen!",
          "Contenu": "Alignable has tremendous potential but lacks proper endorsement when asking me to approve someone when I have never met or had a discussion with the individual. I cannot endorse someone sight-unseen that has not been vetted properly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 6,
          "Date": "2022-04-07T16:55:21.000Z",
          "Titre": "I am enjoying the conversations but…",
          "Contenu": "I am enjoying the conversations but having trouble finding messages from the contacts.  Just need to take a little more time to figure it out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Rojas",
          "Nb_Reviews": 2,
          "Date": "2021-02-14T09:05:30.000Z",
          "Titre": "New & good so far",
          "Contenu": "I’ve only been on Alignable for 3 weeks. So far it’s a good place to get to know the community around you and connect with other business owners. I will leave a more detailed review later down the road once I have experienced Alignable more. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DJ Stutz",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T02:33:29.000Z",
          "Titre": "Have enjoyed making connections through…",
          "Contenu": "Have enjoyed making connections through the smart connect and workshops.  While my connections have increased, my business has not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T19:06:11.000Z",
          "Titre": "I guess I need to pay for networking…",
          "Contenu": "I guess I need to pay for networking opportunities.  I wish I could see how many businesses are on alignable in the Whatcom County area."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "ZenBillions.com",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T18:08:16.000Z",
          "Titre": "Alignable Is Sensible",
          "Contenu": "Alignable is backed by sensible, caring and responsible team of professionals who genuinely want to help you get the best out of what the platform offers."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jeff SugarmanMBA",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T16:46:21.000Z",
          "Titre": "Alignable is a Great Site for Small…",
          "Contenu": "Alignable is a Great Site for Small Business Owners.Connect with Experts in many Fields.Get your Business on the Map with the Alignable Network."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher S",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T19:43:00.000Z",
          "Titre": "So far so good-  Im happy I can reach a…",
          "Contenu": "So far so good-  Im happy I can reach a National or a local market because I need that but I have met some great people here so far.  More later"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shane Hicks",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T00:58:34.000Z",
          "Titre": "The interface is simple and easy to…",
          "Contenu": "The interface is simple and easy to use. The tools, like Smart Connect, are outstanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail P Perez",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T22:15:13.000Z",
          "Titre": "Today there is NOT A TIME slot on my…",
          "Contenu": "Today there is NOT A TIME slot on my event; otherwise I would have given 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 2,
          "Date": "2021-02-22T17:32:42.000Z",
          "Titre": "The only criticism...",
          "Contenu": "Yes, I have met some great people on Alignable! The only criticism I have is that the dues for a premium membership are too high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nadya Tatsch",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T14:51:22.000Z",
          "Titre": "You listen.",
          "Contenu": "You listen to members.You work closely with leaders and moderators.You pivot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna Goetz",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T21:54:20.000Z",
          "Titre": "Still got some work to do to make the…",
          "Contenu": "Still got some work to do to make the platform more user friendly, but it is coming along."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T00:48:43.000Z",
          "Titre": "So far, no complaints",
          "Contenu": "Just getting used to Alignable, so far nothing really to complain about yet, so far so good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheri Moore",
          "Nb_Reviews": 4,
          "Date": "2021-12-04T19:48:49.000Z",
          "Titre": "Enjoying Alignable",
          "Contenu": "Enjoying Alignable. Took me awhile to learn that contacts were from other areas in the US."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T15:30:03.000Z",
          "Titre": "I wish you had the option of purchasing…",
          "Contenu": "I wish you had the option of purchasing more tokens if our tokens run out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MarciaGrace Tropin, M.S.C.",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T03:26:11.000Z",
          "Titre": "I love the quick connects",
          "Contenu": "I love the quick connects! I get to meet 5 or 6 people in just and hour. Just wish they were more targeted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ELZIE",
          "Nb_Reviews": 3,
          "Date": "2023-08-09T21:33:47.000Z",
          "Titre": "METTING HARD WORKING GOOD PEOPLE."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Mastrodonato",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T02:27:34.000Z",
          "Titre": "I like alignable but wish it had better…",
          "Contenu": "I like alignable but wish it had better businesses on it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evan Raoof",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T23:04:16.000Z",
          "Titre": "The netwotking and connections have…",
          "Contenu": "The netwotking and connections have been great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-06-13T19:33:06.000Z",
          "Titre": "This is technically a five",
          "Contenu": "This is technically a five, it is very hard to please me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T18:28:13.000Z",
          "Titre": "Great benefits, clean layout, bright future",
          "Contenu": "Alignable has a lot of great benefits for small businesses to connect to local customers and other businesses.Two features to add I'd love to see:1. Ability to share my connection link. I'd love to be able to share a link publically so others can join without me having to know their email address, which in this day and age, is often hidden to curb bots.2. Dark Mode! :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-24T16:07:33.000Z",
          "Titre": "Happy to be here .",
          "Contenu": "I’ve only been with Alignable for about a month and I’ve been a little slow in getting to know the platform and really use it. However, from what I’ve experienced so far I am very pleased. I know if I am active on this site , commenting on post, posting my own material and making connections, Alignable will be a tremendous resource for my business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trish M.",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T22:05:02.000Z",
          "Titre": "Love this networking site@",
          "Contenu": "Alignable is a great online networking site!  I have been on Linked In as long as I can remember with no viable connections.  I've  lost count of the number of \"active\" connections I've  made.My only disappointment is the number of my connection requests that are still pending.  Can you give members the option to connect or respond they are not interested?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Heaney",
          "Nb_Reviews": 1,
          "Date": "2020-11-01T18:47:00.000Z",
          "Titre": "I like the concept very much",
          "Contenu": "I like the concept very much.  A lot of people sharing and looking for customers.  But I have not actually gotten any new clients or referrals from it yet.  So I will give it more time.  I will offer some member discounts on initial visits to see if that works. I also plan on using some of the group members that I have talked to. Hopefully it will work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Durand",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T20:40:24.000Z",
          "Titre": "Alignable is a very active website",
          "Contenu": "Alignable is a very active website, and a great support for small businesses. However, I do feel like getting access to who is viewing my profile should be free!  It would promote a great deal more interaction between members.  Especially with so many companies being negatively impacted by the pandemic and the recession/down economy, this would be a way to stimulate activity, communication, and interaction amongst the Alignable community."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laureli Shimayo",
          "Nb_Reviews": 1,
          "Date": "2019-08-01T15:30:12.000Z",
          "Titre": "Great local and global connections",
          "Contenu": "I appreciate being able to post events and meet others in my neighborhood and in my field across the globe. Some connections have been spectacular. I'm a coach and an intuitive. I work with people anywhere by video, plus I run events in 4 big metro areas and online - so it is great to be able to post in one place and connect with so many relevant people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tabitha Naylor",
          "Nb_Reviews": 2,
          "Date": "2020-07-22T22:21:06.000Z",
          "Titre": "It’s a great platform, with 2 drawbacks",
          "Contenu": "It’s a great platform, with 2 drawbacks:1.  A lot of users don’t seem to understand that this is supposed to be a networking platform.  This means being a bit more active than spamming someone with a message as soon as they accept a connection request, only to disappear and never be heard from again.   2. The messaging inbox is a mess. There’s no way to delete messages there, nor organize them, so legitimate conversations end up getting buried in all the junk. And there’s a lot of junk (with no way to report it)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen Hamilton",
          "Nb_Reviews": 1,
          "Date": "2018-09-14T16:03:21.000Z",
          "Titre": "I really like the site and keep busy…",
          "Contenu": "I really like the site and keep busy with businesses wanting to link up with me. People are open and like connecting with me. Looks like we get great help from Jo and Gabe. I see many businesses that I would like to discuss business with and actually can connect with them. I started with Alignable a year ago and am glad I took the time to connect. I recommend the site to any real small business.Thank you Alignable for your exposure to my market."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T20:43:51.000Z",
          "Titre": "Good program overall",
          "Contenu": "Good program overall. Takes awhile to understand mainly by trail and error on talking to others on it. Once I learned theses things I use alignable all the time.  Customer support not always available when you need it. Need to always set an appointment. Some things should be made easier to use"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Halyna",
          "Nb_Reviews": 1,
          "Date": "2018-02-06T19:25:36.000Z",
          "Titre": "Alignable: New Company with Great Potential",
          "Contenu": "Alignable is based on a great concept.  It allows small-business owners to connect and refer clients to each other.  Is the website perfect?  No.  But with all its imperfections, it has already become my number one tool to find potential referral sources.  The website’s technical support is easily accessible, responsive, and courteous.  One by one, the bugs are getting fixed.  I think Alignable has a great potential.  Way to go!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2020-07-16T15:27:46.000Z",
          "Titre": "evaluation",
          "Contenu": "Alignable has been an eye opener and is clearly a fresh and useful means of sharing information among commercial, community, and entrepreneur interests.   I would prefer fewer messages sent my way - not sure how that could be filtered but email fatigue begins to enter and I ignore topics."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chefrandell",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T05:52:02.000Z",
          "Titre": "I give it four stars for the good…",
          "Contenu": "I give it four stars for the good connection I've been on the site for a while in Maryland Washington DC Virginia area and 3 1/2 years now in Orlando Florida I haven't made any money from being on the site but I've made some good business connections"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "John Bates",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T19:59:02.000Z",
          "Titre": "Read before you click ...",
          "Contenu": "I see repeatedly on these Alignable reviews that people \"didn't know they were sending email\" and their email lists were stolen - blaming the company for spamming. I joined and actually read what I was clicking on - obviously none of these complainers did. Every person signing up clicked an agreement to send these emails. As for how the company works, I see it being used as a way to interact with local businesses as opposed to mega-corps. I don't know if it will work but I just got annoyed at all these \"people\" on here passing the responsibility off for their own actions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "THE CREDIT FILES COMPANY, INC.",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T16:15:11.000Z",
          "Titre": "WE RECEIVED LEADS IN 24 HOURS!!",
          "Contenu": "WE ARE NEW TO THE SITE AND IMMEDIATELY STARTED GETTING FAST BUSINESS LEADS WITHIN 24 HOURS OF JOINING!! WE WILL LEAVE 5-STARS LATER ONCE WE GET A SALE!! SO FAR, WE HIGHLY RECOMMEND ALIGNABLE -- THEY ARE EXCELLENT FOR NETWORKING!!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carl",
          "Nb_Reviews": 2,
          "Date": "2020-07-15T23:48:47.000Z",
          "Titre": "I am finding many businesses do not…",
          "Contenu": "I am finding many businesses do not include a phone number or email so one can contact them.  I think this should be a requirement for membership.  What good is it to find a business only to see they do not have contact information?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy McCoy",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T04:00:55.000Z",
          "Titre": "Networking",
          "Contenu": "It has been a great way to network"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine S",
          "Nb_Reviews": 18,
          "Date": "2021-01-07T13:11:44.000Z",
          "Titre": "Great way to connect with local…",
          "Contenu": "Great way to connect with local business owners and peers. Still trying to figure out all the ways we can reach out to each other. Use this tool more than Linkedin as a form of local communication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suzette Stevens MHS, MSTD,CPC,",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T04:10:29.000Z",
          "Titre": "Business connect to other business",
          "Contenu": "Met my first.client on alignable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yvonne Guyton Johnson",
          "Nb_Reviews": 1,
          "Date": "2019-09-17T21:30:20.000Z",
          "Titre": "Alignable makes networking easy",
          "Contenu": "Alignable makes networking easy. You can find out what type of services a business offer what type of clients they have before meeting them. It takes the “cold” out of cold calling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claudia",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T02:48:52.000Z",
          "Titre": "The issue for me is",
          "Contenu": "The issue for me is - the platform is not that user friendly. Too much back and forth in and out of screens. Also , difficult to keep track of all of my conversations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Homeowners Marketing (homeownersmktg)",
          "Nb_Reviews": 2,
          "Date": "2019-08-01T17:30:27.000Z",
          "Titre": "Great platform to nurture business relationships",
          "Contenu": "intuitive and easy to use, helpful in establishing business relationships.I wish however it would be less \"laser-focused\" on local search and locality (per algorithm driven recommendations etc.) and would allow a business to indicate if it's national, regional or local such that the experience would differ for those of us who are able and willing to partner with businesses not necessarily ordered by their distance from us (i.e. local = more important) but rather be able to rank  based on other factors (target business category, size what have you).Overall - a well crafted tool filling a niche that was in need of such solution (forget facebook.... their corporate solutions fit very narrow vertical).Finally - if you ever rebrand - change the name - \"alignable\" so not catchy and hard to pronounce... that one needs a redo ... fast :-)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis O'Connor",
          "Nb_Reviews": 3,
          "Date": "2021-01-28T22:02:39.000Z",
          "Titre": "Just starting out with your group and…",
          "Contenu": "Just starting out with your group and see it’s beginning to take root a bit!  Hoping for a growth of connections and partners is businesses!  Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T22:09:11.000Z",
          "Titre": "It was a helpful webinar and answered…",
          "Contenu": "Alignable hosted a helpful webinar and answered my questions. Even without the webinar, customer service is good at quickly addressing my inquiries"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Davis",
          "Nb_Reviews": 6,
          "Date": "2021-01-23T01:53:12.000Z",
          "Titre": "It's a good network to have and be a…",
          "Contenu": "It's a good network to have and be a part of.  It would help if photos can be attached with a post; not just only a link."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Delaunay Aroma Solutions",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T14:30:00.000Z",
          "Titre": "The technical support team at ALIGNABLE…",
          "Contenu": "The technical support team at ALIGNABLE was able to help me and answer all my questions which will increase my visibility."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LMT HEALTH & WELLNESS SOLUTION",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T16:25:20.000Z",
          "Titre": "Alignable is a great platform to make…",
          "Contenu": "Alignable is a great platform to make good network connections and let others know what your company offers."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Ben Cooper",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T17:55:22.000Z",
          "Titre": "A good and trustworthy platform for…",
          "Contenu": "A good and trustworthy platform for entrepreneurs, business owners and professional executives."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-05T15:05:53.000Z",
          "Titre": "Great Service at getting the word out…",
          "Contenu": "Great Service at getting the word out on my affordable CoWorking Space and Private Office"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "RBO CONSULTANTS",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T00:02:22.000Z",
          "Titre": "Well-structured and focussed…",
          "Contenu": "Well-structured and focussed highlighting the professionalism of the members."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MIchele",
          "Nb_Reviews": 1,
          "Date": "2020-07-26T17:45:13.000Z",
          "Titre": "I would like to go beyond Latham…",
          "Contenu": "I would like to go beyond Latham without having to add another expense."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Light and Shadow Photography",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T17:37:54.000Z",
          "Titre": "Network your business with more communication",
          "Contenu": "I think this year was just bad all around because of Covid19.We were limited and could not make any in person contact.Having Alignable to make the first step is excellent but we still need to know the business to make any referrals.I notice that many business just want referrals without even knowing the other business. Some of them not even have a Website so we can get to know the business and their quality.I am now starting to do a second contact to business in my network to see if I can get to know them better and start referring them. I usually search for highly recommended business and most of them related to my own.Unfortunately most of them don't return message after we do the first contact. Eider they are not interested or their are too busy or just don't see the value to have a good solid network.A lot of business don't know how to implement Alignable into the business and maybe they need some in-depth explanation or tutorials in how to use and incorporate Alignable and how to develop a solid network of contacts and referrals.No use to have a good tool like Alignable if only a few business are returning the first contact message. I always try to make contact and get into a phone conversation so I can get a better feel of the business that I want to referrer and vise versa.Maybe Alignable should promote and emphasize first and second communications between business.I think all business should promote more communication between themselves and get to know each-other better.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-10T14:17:05.000Z",
          "Titre": "Nice app.",
          "Contenu": "Nice app. Will continue to use it to see how it works past a week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T01:58:50.000Z",
          "Titre": "Good start!",
          "Contenu": "Good start!  I look forward to a mutually beneficial relationship."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Ropp",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T15:39:42.000Z",
          "Titre": "It has been good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T20:29:14.000Z",
          "Titre": "Don't charge for advertising for you…",
          "Contenu": "Don't charge for advertising for you members."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas D'Angelo",
          "Nb_Reviews": 6,
          "Date": "2021-08-14T20:59:29.000Z",
          "Titre": "The fee part is great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raymond Wells",
          "Nb_Reviews": 1,
          "Date": "2021-01-27T22:13:55.000Z",
          "Titre": "Some of us cannot afford $30 a month"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2020-11-22T15:32:47.000Z",
          "Titre": "Would like an app for android."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Patti Mclean",
          "Nb_Reviews": 2,
          "Date": "2021-01-28T16:53:47.000Z",
          "Titre": "Just waiting for results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T13:47:44.000Z",
          "Titre": "Great virtual networking!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Ouspenskaya",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:28:30.000Z",
          "Titre": "Good vibe of community",
          "Contenu": "Good vibe of community. I like to be informed about activity on my posts and responses. One question: I am not sure why there is such a low limit to how many contact requests one can send? I assume there is a reason for that, but seems to me that it would benefit the space if people could connect more rather than less."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Veronica Negrin",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:55:42.000Z",
          "Titre": "It is easy to work on this site",
          "Contenu": "It is easy to work on this site. I like the many options I have to connect with business that will help my own grow. Reading all the comments from other business owners is helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sujit Dey",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:58:38.000Z",
          "Titre": "A Worth Referral",
          "Contenu": "I was invited to join Alienable by one of the Sisters in Christ.  Thus, I trusted it just by knowing that a fellow Christian of the same faith will not recommended me a scam site.  I was so right.  Since joining Alliable, I could connect with so may businesses around my neighborhood.  Learned a lot from others discussions.I have helped join many businesses since I became a member."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Monaco, CEBS",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:12:41.000Z",
          "Titre": "Alignable is a great platform to…connect and share with other businesses",
          "Contenu": "Alignable is a great platform to connect with other businesses and meet different business owners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Brooks",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T19:57:13.000Z",
          "Titre": "I spend almost all my online time on…",
          "Contenu": "I spend almost all my online time on Alignable. Enjoy the platform and building long term relationships. Proud to be a group leader and running a group to help Alignable members understand the platform and have their business survive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimi Blankenship",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:29:34.000Z",
          "Titre": "Likeminded professionals",
          "Contenu": "Meeting people who are potential clients with genuine interest, exchanging information and building a relationship."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Gallagher",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:06:25.000Z",
          "Titre": "Networking is the strongest path to success",
          "Contenu": "I find this is a great place to network in a non pressured way from either side. I have met some great people on the platform and have now gained several clients. It is nice to see the different web of other peoples networks and find just the right people to contact. This platform gives suppliers an opportunity to discuss there goods in a less scrutinized arena than other social media."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willian Jensen SR",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T20:53:51.000Z",
          "Titre": "Impressed on enjoyable and easy to use",
          "Contenu": "The Process is enjoyable and easy to do and was happy to see how many people use Alignable, most of my Business I know."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valerie Gaston Medina",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T02:21:14.000Z",
          "Titre": "Networking is fun!!!",
          "Contenu": "The ease in which we can build our networks for gaining more knowledge is awesome!Which helps in helping each other improve oneself as they grow their individual business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael O'Connell",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:27:38.000Z",
          "Titre": "Ran into old friends I lost touch with…",
          "Contenu": "Ran into old friends I lost touch with over time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla Girolamo",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T04:17:22.000Z",
          "Titre": "I have a real advantage of meeting…",
          "Contenu": "I have a real advantage of meeting business owners to gain referrals for my business. These professionals are like minded in a sense they want to provide products and services to better communities. This has been a great networking opportunity and way to excel my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HOPEvolution LLC",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T22:22:09.000Z",
          "Titre": "What makes Alignable great to me is…the professional relationships you build",
          "Contenu": "What makes Alignable great to me is that it does well with having a platform allowing like-minded business owners to connect directly, frequently and sincerely. The platform has several options to choose from to network."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claire R Podesta",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:30:09.000Z",
          "Titre": "I think Alignable is an excellent at engaging people in the community",
          "Contenu": "I think Alignable is an excellent networking group!I have made a lot of contacts.  My business has grown since joining this group."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sanjeev Dutta",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T06:29:01.000Z",
          "Titre": "Alignable is very professional",
          "Contenu": "Alignable is very professional. It helps a lot to grow business. Networking is their strength."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bombas Customer",
          "Nb_Reviews": 5,
          "Date": "2023-10-31T15:35:55.000Z",
          "Titre": "Such a wonderful way to network without…",
          "Contenu": "Such a wonderful way to network without fear of sales pitches. I've made great business connections and met referral partners to help my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tami Toomire",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T21:12:20.000Z",
          "Titre": "Alignable has been a valuable resource…",
          "Contenu": "Alignable has been a valuable resource for my business. I love how it has connected me to other business owners via networking events."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Cramer",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T22:23:56.000Z",
          "Titre": "Serving One Another",
          "Contenu": "I'm still kind of new. However, I like and enjoy what I see/hear. I feel I made a great choice of social media outlets to use and get involved in. I am looking forward to a grrrreat relationship with Alignable as well as all future relationships I can help serve. Whether you serving me or I'm serving you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacey Hughes",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T01:45:50.000Z",
          "Titre": "I like the opportunity to connect with…",
          "Contenu": "I like the opportunity to connect with other like minded people. The company created this platform which is assisting me to do that and also the hosts of all smart connects that I have been to have been Great!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Sobkov",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T21:24:22.000Z",
          "Titre": "it is a community of people looking to…",
          "Contenu": "it is a community of people looking to build relationships and that seems to permeate Alignable.I have identified a problem and a solution.  People signup for an event and do not show up.  Yes, we all have work.   It is a question of priority. My solution is to be more proactive and message registrants prior to meetings a few times.  Over time, I will send emails as well for my Alliance Smart Connects to encourage greater participation in a defined community"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Daryl Marples",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T07:34:43.000Z",
          "Titre": "Alignable exceeds expectations by educating and connecting businesses from start-up to well established",
          "Contenu": "Alignable has tremendously improved the education for all aspects of networking. The guidance customers receive is top notch and helps those who are beginning or even veterans.The Quick Connect events are such fun and bring us all together, one at a time.Bravo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Witt",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:48:20.000Z",
          "Titre": "Alignable my favorite networking platform                                  on my…",
          "Contenu": "I really enjoy networking on my favorite platform Alignable… I feel at home among other business mindsets. I find People very engaged and engaging and offering lots of advice and coaching inside many business challenges. I share Alignable daily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack OHalloran",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T18:09:16.000Z",
          "Titre": "I have found invaluable information on…My industry as an actor, writer, producer. Constructive accurate information is vital.",
          "Contenu": "I have found invaluable information on this site. Being in the film industry for 47yrs. Things constanly change. Having a place to have constructive up dates is a true value."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beatrice Phillips",
          "Nb_Reviews": 4,
          "Date": "2023-06-29T14:53:00.000Z",
          "Titre": "New & Improved 10X business referral platform",
          "Contenu": "I joined the platform initially 5 years ago and came back about 2 years ago. What a change! When I came back I joined several different groups and now enjoy attending their Smart Connects 1:1 and educational sessions.This is by far the most personable, caring, and effective platform to make new connections with local and nationwide businesses. You can participate without needing to pay for an upgrade, however, if you do upgrade to the next step,(still less than 1/2 the price of LI), you get so many insights and information, who visited your page and when, which makes it easy to reach back out to potential customers. Off course, like everything else, you have to use it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Lisa Whalen",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T20:02:59.000Z",
          "Titre": "Great Job",
          "Contenu": "I really appreciate this program as it gives a whole new level to networking.  When the world shut down Alignable stepped up keeping us in contact with others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doris Foley",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T01:31:55.000Z",
          "Titre": "It's all about helping hands",
          "Contenu": "The Company has very clear guidelines, it is a portal where you can exchange knowledge or learn even more. It is not about making sales; it is about helping each other more so. Most people are aware about that this site is not here to make sales. It is giving each other a helping Hand, to understand each other, to be able to learn and share experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helena",
          "Nb_Reviews": 6,
          "Date": "2023-07-02T03:10:25.000Z",
          "Titre": "Since joining Alignable",
          "Contenu": "Since joining Alignable, I have experienced growth in terms of building my company brand. The team at Alignable is quite supportive as well the connections I have, made so much possible in voting Velocity Athletic Training as business of the Year positioned at #4 in the USA! 2021, 2022, 2023! The networking and the meeting of the most amazing individuals who support one another on many levels makes Alignable the #1 Small Business Platform across ALL boards!Thank you to team Alignable!Thank you to ALL my amazing connections for your continued support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Adams",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T03:40:18.000Z",
          "Titre": "I've been on Alignable for two years",
          "Contenu": "I've been on Alignable for two years.  It was so nice right after COVID to be able to meet so many nice people online.  I've been to a lot of Quick Connect events and then done one to one Zoom meetings.  It is really helping grow my network.  I enjoy it a lot.  I just applied to be an Ambassador in Southeast Idaho and we are holding our second in-person meeting this next week.  I really like how the in-person meetings are relaxed and friendly without certain rules and restrictions like other groups that charge fees.  It's great. I hope this will continue to help my business and that I can help other businesses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Callahan",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T18:45:30.000Z",
          "Titre": "I initially hesitated to join Alignable…",
          "Contenu": "I initially hesitated to join Alignable because I didn't want another social media account to manage. I received numerous invitations from friends and businesses, but I turned them down. However, I eventually decided to give it a try, expecting it to be just like any other platform. To my surprise, it's much more interactive and engaging. In just a few weeks of being active on the site, I have already made connections with new businesses and connected with individuals who are interested in the services I offer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosalind Severin McClean",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T02:21:53.000Z",
          "Titre": "Oceans of Thoughts book series exprience",
          "Contenu": "Oceans of Thoughts is my book series which inspires you and encourages you to look within, as my life changing messages in the series address social issues as well. My experience on Alignable is excellent as I get to meet multiple people through the different platforms and that exposure certainly helps to share my voice in poetry and grow my business as an author"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Moore",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:46:46.000Z",
          "Titre": "so far so good talking to many…",
          "Contenu": "so far so good talking to many prospects, hopefully they will buy and making my time worth all the effort of using alinable. Time will tell."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lisa McGrath",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:43:12.000Z",
          "Titre": "Alignable and its members are great support",
          "Contenu": "Alignable is made up of a whole bunch of people who want to strive and support and guide each other into the direction of success, by supporting and providing invaluable information to each of its members, along with the assistance of providing opportunities for lead generation. Proud to be a part of alignables, and one of its ambassadors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Silver Voiceover Artist/Voice Actor",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T23:09:50.000Z",
          "Titre": "Excellent Source",
          "Contenu": "Alignable is an excellent networking source, and it is growing as much momentum as it is. I have discovered VoiceOver opportunities on here that have led to success, and there is confidence that my membership and overall presence on here will lead to even more VoiceOver reads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAWN FITCHETT FERNANDES",
          "Nb_Reviews": 4,
          "Date": "2023-07-22T01:29:54.000Z",
          "Titre": "Alignable Rocks!",
          "Contenu": "Alignable has been incredible for building my business as I tripled my business in a couple of years. It is the most warm & authentic b2b business building site! ~Dawn @ Faith Graphix Printing You Can Trust"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeanette",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T22:46:22.000Z",
          "Titre": "Better than FB",
          "Contenu": "Like anything else you get what you put into it.  I found out about this forum, from a friend, and I was hooked. I started going to all the networking events, and free learning classes,  I am not a premium person because I am tight, but, I plan to change that, I love the groups that are formed in Alignable. each group gives you updates and notifications of upcoming events. I participate in Boss Babes, Veteran group, and that is just a few. I have joined 11 groups, I have 209 referrals, 17 recommendations, 912 visits, and 95.2k impressions. Love the Smart Connects.  I like meeting people this is better than Fb and Instagram. I have received 3 orders, this has all happened in a period of two months. I am extremely happy with Alignable and the people I have met have been all professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loraine Yoder",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T23:40:19.000Z",
          "Titre": "I have met some incredible giving…",
          "Contenu": "I have met some incredible giving people on Alignable. People that truly want to help others with their businesses. Everyone I've connected to have been very responsive and get back with me. I have found a good place to find \"my people\"."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T06:05:20.000Z",
          "Titre": "The best",
          "Contenu": "It is the best that I have been a part of.  Outstanding results so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Lawton",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T17:18:10.000Z",
          "Titre": "the connections I've gained from…",
          "Contenu": "the connections I've gained from Alignable has been very fruitful and has helped me expand my customer base."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Steen",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T22:38:54.000Z",
          "Titre": "Wonderful Networking Platform!",
          "Contenu": "Alignable is a wonderful networking platform! I have formed some great friendships from it as well as obtained business. I've only had approximately three issues, mainly minor, and Alignable was quick to respond."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stephanie Saad",
          "Nb_Reviews": 1,
          "Date": "2022-03-12T19:33:37.000Z",
          "Titre": "Alignable Best Business Networking Platform …",
          "Contenu": "I have joined alignable about 3 years ago . I absolutely love it. You can connect with real people, get questions and answers about business and get customers for your business as well. I absolutely love Alignable its all about awesome business connections and referring people to other businesses  ..An excellent Business network to increase sales and have like minded business relationships.  I highly recommend Alignable!!."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margie Basaraba",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T07:08:05.000Z",
          "Titre": "I love the frequent smart connects in…",
          "Contenu": "I love the frequent smart connects in the systems around those to help you make the right connections and leverage your time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Strohecker",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T13:17:18.000Z",
          "Titre": "Meeting great people",
          "Contenu": "I have met so many great people, learned so much about running g a business, and the site is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Knight",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T14:16:33.000Z",
          "Titre": "THE EXPERTISE OF THE WHOLE COM[ANY",
          "Contenu": "I REALLY LIKE THE EXPERTISE OF THE WHOLE COMPANY. THEY ARE JUST CONSIDERATE OF ALL THINGS BUSINESS. THEY PAY ATTENTION TO DETAILS TO EVERY ASPECT OF THEVARIOUS  INDUSTRIES.THRY ARE DELIGTFUL PEOPLE WITH CREATIVE CONTENT TO SHARE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Surface Artist",
          "Nb_Reviews": 8,
          "Date": "2023-06-28T04:58:02.000Z",
          "Titre": "Make bold moves with your business",
          "Contenu": "I’m honorable can help you make your dreams come true with the business to business support and assets they have created. This is the most important network on the web and I can only urge you to rush to it and start to flourish"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Levinson",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T20:36:20.000Z",
          "Titre": "I'm a huge fan of Alignable",
          "Contenu": "I'm a huge fan of Alignable. This is largely because I know how to leverage the capabilities it offers for maximum benefits. An astounding 95% of the business I received in my 1st year in business came directly from Alignable. This was vital for my family's survival to navigate the pandemic. I wasn't even using the paid membership! I utilized the Alignable referral platform in the best ways I knew how as a long-term marketing person. All the functionality within the Alignable platform helped me to connect with people on a much deeper level. In a 10-month period recently, I received 17 straight 5-Star Google Reviews from my Alignable clients. It simply made sense to continue to grow my network by becoming a premium member which opened up even more functionality to me. Adding Smart Connects recently has also been extremely helpful too. My bandwidth is completely stretched and my dance card is full and I love it. Frankly, Alignable coupled with my marketing talents has made my business soar! Thank you Alignable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Honey Wesley",
          "Nb_Reviews": 9,
          "Date": "2023-06-10T01:07:14.000Z",
          "Titre": "I guess I'm an Alignable groupie now!",
          "Contenu": "I've grown to love and appreciate Alignable, once I learned that it wasn't a Facebook or LinkedIn wannabe. Alignable does amazing things for businesses, not just local (which they do) but also for nationwide businesses. I try to do something positive everyday on the platform, and I love seeing my connections and recommendations continuing to grow. I especially appreciate that they offer helpful, informative training videos to help you get the most from your Alignable membership. And a special shout out to Sue Brooke, whom I was fortunate enough to meet in person! I enjoyed the platform so much after using it consistently for a few months, I upgraded to a Premium account. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Al Brouillard",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T15:40:34.000Z",
          "Titre": "What Alignable does best is concentrate on businesses",
          "Contenu": "What Alignable does best is concentrate on our businesses. They provide outlets for Webinars, Meetings and a convenient avenue to connect and meet new clients and talk to old clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 4,
          "Date": "2022-02-04T17:53:23.000Z",
          "Titre": "I wasn't interested in one more social…",
          "Contenu": "I wasn't interested in one more social media option, but I took a 1 hour class from Sue Brooke Marketing/Advocacy at Alignable. In that one class I was educated and convinced that Alignable is a valuable networking tool to me as a realtor. Right after the class I spent over 10 hours that day setting up my account and adding my contacts and reaching out to people. I hope to learn about more services and products that I feel are valuable to send to my contacts. I already recommended multiple companies to people looking for a recommendation. I especially think Alignable will be a good tool to use for my clients that are new to the area."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Bartley",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T18:27:25.000Z",
          "Titre": "Highly recommend Alignable!",
          "Contenu": "Alignable has been very valuable to me in not only building referral partners, but also building business partnerships.  The support staff at Alignable is very invested in helping businesses make long-lasting connections.  I would highly recommend Alignable as a networking platform to build your business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Drumm",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T00:05:04.000Z",
          "Titre": "Alignable is unlike other networking…",
          "Contenu": "Alignable is unlike other networking platforms out there. Everyone on Alignable is there to network. They have made the platform easy to get around, and with just a few videos and webinars, you know exactly what to do and how to connect on Alignable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Smith",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T19:06:01.000Z",
          "Titre": "Alignable helps to grow businesses",
          "Contenu": "Alignable is a great way for small businesses to get exposure, as well as to create and increase business/clients.  It also is a way to network with other businesses to trade services and/or establish a business relationship with places that you had not known about previously."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Hill",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T02:22:30.000Z",
          "Titre": "That’s The Way Uh Uh I Like It repeat",
          "Contenu": "Since August 15, 2022, I had not heard of Alignable.com. When I started, there was immediate communication contact and personable communication from people. I quickly understood that I had found what I needed, which was the ability to talk to people not just for sales, marketing, or transactional communication, but the interest in you as a person coming through in the different quick connect opportunities. I have new customers as a result of being a part of Alignable. I can provide my expertise in the advice section and build relationships with people in similar businesses. It’s simply learning how to give, listen and serve others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Goode-Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T23:47:25.000Z",
          "Titre": "Alignable is a great platform to grow your business.",
          "Contenu": "Alignable is a great platform to use to advertise your business. It is a very good resource to build a network of colleagues and clients. I highly recommend using Alignable to grow your business."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Luba Rascheff",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T17:52:59.000Z",
          "Titre": "The nicest and most supportive business people are on Alignable",
          "Contenu": "I am able to meet and connect with some of the nicest, most supportive business people ever! Thanks for this amazing opportunity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Bateman",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T22:48:53.000Z",
          "Titre": "My initial impression on upgraded membership",
          "Contenu": "I find the Alignable platform an excellent way to connect with fellow Entrepreneurs that are looking to network both to increase business and learn from each other. Glad I upgraded to a paid membership."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AdrianMathews.com",
          "Nb_Reviews": 2,
          "Date": "2021-08-29T19:32:36.000Z",
          "Titre": "Small Business Networking Helping Others",
          "Contenu": "What a great service for small busines to be able to help each other through networking. I always look here first before going somewhere else to be able to help like minded individuals and to try to recommend others to look here first too. The countryhealthstore.com approves this message."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-19T21:14:54.000Z",
          "Titre": "After being introduced to such a…",
          "Contenu": "After being introduced to such a brilliant application and meeting awesome people here have really boosted my confidence in my business Healing Journey With A Rastah. I’ve been able to connect with over 100 people. I am thrilled and excited for Alignable!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Montreal Home Inspection Svcs",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T18:02:16.000Z",
          "Titre": "Alignable is a wonderful platform to…",
          "Contenu": "Alignable is a wonderful platform to meet and great other business professionals in your neighborhood. Moreover, Alignable keeps developing and becoming a solid networking platform. Happy I joined from day one.Robert Young,Robert Young Montreal Home Inspection Services Inc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beatrice Phillips",
          "Nb_Reviews": 4,
          "Date": "2022-02-28T12:38:59.000Z",
          "Titre": "Excellent way to connect with locals",
          "Contenu": "I joined Alignable about a year ago and found the platform refreshing was well worth the time to set up a profile and join their groups. I got into conversations and ended up making great connections including getting customers through these. What I like about the platform is that it promotes in person connections, discussions and there are many business oriented events that are free to join. As well as the Alignable Alliance, which is a in-person local network initiative, this platform has turned out to be a great resource."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GARY",
          "Nb_Reviews": 3,
          "Date": "2023-08-31T21:24:44.000Z",
          "Titre": "Professional People and Discussions",
          "Contenu": "It has been very professional and in most cases interesting to read about member questions.  However, there are way to many request for virtual meetings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T22:12:09.000Z",
          "Titre": "Here at PromanRoofing.com we rely…",
          "Contenu": "Here at PromanRoofing.com we rely heavily on internet marketing to find new customers. Alignable really hit the ball out of the park for  us with their small business network."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Bowers",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:47:27.000Z",
          "Titre": "Love the program"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Krupnick Approach LLC- Emi",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T22:04:04.000Z",
          "Titre": "Alignable is an excellent platform for…",
          "Contenu": "Alignable is an excellent platform for business owners and professionals to connect and network. Sincerely, Emily The Krupnick Approach, LLCCo-Founder, Chief Management Officer, Consultant, Advisor, Therapist"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Cohen",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T00:37:11.000Z",
          "Titre": "A great stepping stone for people…",
          "Contenu": "A great stepping stone for people putting their careers on hold to be a caregiver. Now it's time to master the game!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "momTee",
          "Nb_Reviews": 2,
          "Date": "2022-02-12T03:30:20.000Z",
          "Titre": "Alignable is a great place to network…",
          "Contenu": "Alignable is a great place to network with other businesses!I went to a LinkedIn Networking posting party, hosted by another business and had the opportunity to meet a lot of new people!It was an exciting experience! I had a chance to set up some personal zoom meetings and guide a few people on my website, so that they can experience sending their first physical card for FREE on my website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Warren",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T23:19:26.000Z",
          "Titre": "Connecting people with curiosity",
          "Contenu": "Connecting people with curiosity, a need for community, a willingness to be curious and to learn, to exchange and share. You give it a platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sally Fisher",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T13:04:33.000Z",
          "Titre": "I received quality work from Ambers…",
          "Contenu": "I received quality work from Ambers painting services. Contacting their company is easy, as I found the service through allgnable. Great people nice family. Couldn’t be more grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Knopp",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T21:33:03.000Z",
          "Titre": "Alignable has a lot to offer and most…",
          "Contenu": "Alignable has a lot to offer and most of the companies are very good.  I appreciate all the recommendations they have been giving me.  I also return the favor and help as much as I can."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sammy Dijan",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T01:32:07.000Z",
          "Titre": "Alignable, aligns your business with the outside world.",
          "Contenu": "Alignable, helps your business to, stand out among the competition, to get noticed, and to get customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "COSMarketing Agency",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T17:28:20.000Z",
          "Titre": "Great Platform",
          "Contenu": "Great response rates, always trying new things, and are actively getting our feedback on the platform. That shows me they care about making it better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nelson Estepa",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:38:10.000Z",
          "Titre": "The Alignable application is excellent…",
          "Contenu": "The Alignable application is excellent and user friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Toebe",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T17:56:27.000Z",
          "Titre": "Kathy was professional, friendly and helpful",
          "Contenu": "Kathy was pleasant, informative and helpful and didn't treat me as just a task to check off her to-do list. She was engaging in conversing about my questions. I appreciated her for it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L. Kelly",
          "Nb_Reviews": 3,
          "Date": "2021-11-30T18:38:49.000Z",
          "Titre": "Best Small Business Networking Site",
          "Contenu": "This site has given me the most return on a little spent. I've met people from all over the US and Canada, received the most valuable advice from other business owners, been given new opportunities to not only market myself but create actual, lasting relationships with other business owners. If you're willing to put in the effort the rewards are amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Turk",
          "Nb_Reviews": 3,
          "Date": "2021-07-27T14:08:10.000Z",
          "Titre": "Let people find what you do in a way…",
          "Contenu": "Let people find what you do in a way that is easy, convenient and connecting.   Connect with businesses where you can both benefit one another, this is what you will find here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Savage Aka SIRTONY",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T07:17:37.000Z",
          "Titre": "Alignable in our time is a MIRACLE ..",
          "Contenu": "Alignable in our time is a MIRACLE ... everyone NEEDS to be ABLE to make Great Friends and Connections and to also Be HONORED for your WORK....so the Community and the World know it.. They have Honored my Work with 6 AWARDS and the members are special souls...So BRAVO ALIGNABLE.. THANK YOU Forever !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T21:23:19.000Z",
          "Titre": "I have added people to my network that…",
          "Contenu": "I have added people to my network that have changed my business.  People have messaged me real tips for improvement in my business and offered advice as if we were at the dinner table together. Thank you to all of you that participate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerKathy Kovell",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T21:07:31.000Z",
          "Titre": "Very amazing & brings people together…",
          "Contenu": "Very amazing & brings people together to help other organizations And businesswoman &  volunteers who do much work for thosein need thr other and this site Keep it going"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2021-12-13T17:44:41.000Z",
          "Titre": "Many great advantages to Alignable...",
          "Contenu": "I have been using Alignable here in Calgary, AB for 3+ years now & it has been a very valuable tool in connecting with local businesses. With the current \"atmosphere\" for SMB's here in Alberta and all over the world, it has definitely been more challenging to acquire new clientele and everyone is looking for the best \"price\"! When I hear companies offering \"free\" delivery it really gets my haunches up as so many companies have been \"squeezing\" the delivery & transportation industry to provide \"Amazon\" like rates. I think that soon there will be a monumental shift in the way business is done & Alignable is definitely a part of that shift!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 3,
          "Date": "2023-07-01T19:20:28.000Z",
          "Titre": "EVERYONE TRIES TO BE HELPFUL AND…",
          "Contenu": "EVERYONE TRIES TO BE HELPFUL AND KNOWLEDGABLE ABOUT THEIR BUSINESS AND WHAT THE OFFERAND NEW THINGS THAT COME DOWN THE PIKE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Moyer",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T08:13:17.000Z",
          "Titre": "Meeting people who respond and interact…",
          "Contenu": "Meeting people who respond and interact to create potential present and future progressive business has been a real plus on Alignable . Only recently has this been happening after much sifting through many connections to finally connect with more meaningful associates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Wynn, Philanthrepreneur",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T21:23:38.000Z",
          "Titre": "Alignable is a great platform for your business",
          "Contenu": "Alignable is a great platform for promoting your business, connecting with clients, potential partners and collaborators, and sharing (and receiving) resources. I've found this community (Nonprofits and Public Charities) to be very supportive, welcoming, and generous. I've used the platform to promote specials, events, and services. I share regularly and receive a lot of valuable resources from other businesses in the field. I like Alignable much more than the other social media platforms. It doesn't feel as spamy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Partner, Diana Dahlberg of 1 MONTH REALTY",
          "Nb_Reviews": 3,
          "Date": "2023-08-19T02:41:05.000Z",
          "Titre": "I appreciate the opportunities…",
          "Contenu": "I appreciate the opportunities Alignable offers me.  I especially enjoy meeting like minded business professionals and having a cup of coffee and getting to know how we might best be able to benefit one another's business.  I have met a number of wonderful connections here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T06:10:59.000Z",
          "Titre": "Alignable is an amazing networking site…if you are \"Able\" I encourage you to \"Align\" your business with \"Alignable\"!",
          "Contenu": "Alignable is an amazing networking site that has helped me connect with other business owners offering advice and encouragement for marketing my business. If you are \"Able\" I encourage you to \"Align\" your business with \"Alignable\" where the networking all about the network of your business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Vo, J.D./SmileOnClub",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T22:20:19.000Z",
          "Titre": "The smart connect with Brittany…",
          "Contenu": "The smart connect with Brittany Sandoval was good..she always has been nice and helpful. Her support to team leaders has always been exceptional and professional. Much appreciated 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "THOMAS M HILL",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T22:58:59.000Z",
          "Titre": "The ease of access",
          "Contenu": "The ease of accessIn times of having responses readily available, my experiences have been stellar."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Waterboy AkA Waterboy Delivery",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T01:25:12.000Z",
          "Titre": "Excellent and quality customer service",
          "Contenu": "Excellent and quality customer service, always present and ready to help businesses Excel into the next level. Alignable is like our great big family of businesses bonding together for success. Businesses helping businesses be successful in their own community."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wes McKibbon",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T01:59:59.000Z",
          "Titre": "I'm extremely pleased with Alignable",
          "Contenu": "I'm extremely pleased with Alignable! I've been an advent user of IN, but find that Alignable has it own social SEO abilities and ranking high for my keyword use on Google."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abby Beck",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T17:01:32.000Z",
          "Titre": "I love all of the different classes &…",
          "Contenu": "I love all of the different classes & groups that you offer to help you with the tools you need to become more successful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Ann Shaner",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:20:13.000Z",
          "Titre": "ConnectionsAlignable has had me connect with some…",
          "Contenu": "Alignable has had me connect with some wonderful people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Bailey",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T01:32:00.000Z",
          "Titre": "I am enjoying being on Alignable",
          "Contenu": "I am enjoying being on Alignable. It’s great to meet new people and learn about their businesses. I always love to refer a good business or service.The emails I receive from alignable are very helpful, they give me ideas forthings to post and share. The polls are great also.it’s good to see how other businesses are faring during this pandemic and how we can help each other.All in all, I’m very happy being part of this  group."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madonna Brown",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T21:46:50.000Z",
          "Titre": "It's great for networking & meeting…",
          "Contenu": "It's great for networking & meeting people, much better than any other social media, at this point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:10:50.000Z",
          "Titre": "Great to meet people of like mind and…",
          "Contenu": "Great to meet people of like mind and learn what others are doing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "fred chirco",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T21:06:52.000Z",
          "Titre": "Excellent customer support and the…",
          "Contenu": "Excellent customer support and the timing to get the issue fixed was very fast unmatched thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy New Business Owner",
          "Nb_Reviews": 4,
          "Date": "2023-07-07T01:30:39.000Z",
          "Titre": "Great service for connecting business…",
          "Contenu": "Great service for connecting business owners to each other and the communities we serve.  I would like to see better performing and better priced advertising."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sparky lee",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T09:01:05.000Z",
          "Titre": "It's been useful",
          "Contenu": "It's been useful. I'm grateful for the platform as a small and upcoming buisness. I have no complaints. Made some great contacts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DOROTHY MCLEOD",
          "Nb_Reviews": 8,
          "Date": "2023-09-16T01:28:32.000Z",
          "Titre": "Good keeping in touch and knowing whats…",
          "Contenu": "Good keeping in touch and knowing whats going on.  Great for networking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley M. Sullivan/Nutritioni",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T22:46:12.000Z",
          "Titre": "I like alignable platform",
          "Contenu": "I like alignable platform.  It is easy to use and I have made some great connections over the past year.  Also enjoy the online groups and community events.  Thank you!!  Namaste"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Ramos",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T16:34:40.000Z",
          "Titre": "Posting events",
          "Contenu": "After navigating to the portion I need, it is easy to post my events without to much trouble."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitchell Groves",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:21:24.000Z",
          "Titre": "Amazing Platform for Small & Medium sized Businesses…",
          "Contenu": "Amazing platform for businesses to network with other businesses to drive growth, share advice and find the best solutions for my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam Spencer",
          "Nb_Reviews": 6,
          "Date": "2023-06-15T15:14:41.000Z",
          "Titre": "Alignable is the best online…",
          "Contenu": "Alignable is the best online professional networking company in my opinion. It’s always people first here, Build relationships build your business on a solid foundation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harry Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:18:45.000Z",
          "Titre": "I am very active in networking and can…",
          "Contenu": "I am very active in networking and can look up find trades people quickly and easily."
        }
      ]
    }
  ]
}