{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "altrady.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "LK",
          "Pseudo": "Darshana",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T11:07:24.000Z",
          "Titre": "Scanner, pump and dump signal",
          "Contenu": "A pump and dump signal is where a coin pumps massively (100%+ easily) and CBS sends a signal on the crash back down.I have 4 live trade bots & 4 paper trading bots. I'm backtested it.Indeed I think CBS signal algorithm still in developing session. It's need to be upgrade for filterout pump and dump signal. Small profit huge loss. profitability (30-50 trades) get wiped out by one single “pump and dump signal”. it's horrible !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Esther Kirkham",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:16:44.000Z",
          "Titre": "Try joining",
          "Contenu": "Ęåśybęę has extremely knowledgeable people in their customer support area. They are super effective! Unlike these"
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Rauhoffer",
          "Nb_Reviews": 5,
          "Date": "2023-04-19T19:39:02.000Z",
          "Titre": "Useless. You buy very expensive peanuts.",
          "Contenu": "Guys, it is useless. You can equally do with Tradingview and Binance whatever they expensively sell you as altrady platform. Most features included you don't need for successful trading. Save your money buying real trading lessons that helps you to make money on every single market (Forex, Crypto, Stock and so on). Conclusion: CRAP."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Rauhoffer",
          "Nb_Reviews": 5,
          "Date": "2023-05-01T10:13:30.000Z",
          "Titre": "Useless",
          "Contenu": "I have used this service for a while. It is useless. Options they offer are free with many other similar services. I did not find anything useful and have asked for refund. Unfortunately, they aggressively refused to refund me. The crypto signals are mostly random without generating a profit. Spend your money much better buying some book for trading."
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Rauhoffer",
          "Nb_Reviews": 5,
          "Date": "2023-04-21T16:33:45.000Z",
          "Titre": "L.E  as answer for this insistent platform operator that hates 1* reviews.",
          "Contenu": "L.E. as answer for this insistent platform operator that hates 1* reviews. None of those options/functions/features whatever you may name them, are having a contribution for successful trade with profit. This platform ensures a constant income for jobless coders that has nothing related to trading. If I would be a successful trader  I wouldn't code a platform.This is the reason that less informed money pays for and NEVER, but NEVER a smart money would pay a cent for. Guys, it is useless. You can equally do with Tradingview and Binance whatever they expensively sell you as altrady platform. Most features included you don't need for successful trading. Save your money buying real trading lessons that helps you to make money on every single market (Forex, Crypto, Stock and so on). Conclusion: CRAP."
        },
        {
          "Note": 1,
          "Lieu": "SI",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2021-11-28T15:20:20.000Z",
          "Titre": "worst support ever, buggy software, expensive",
          "Contenu": "Buggy software, cant close some open orders being doomed to watch them go off, support cant fix it, price driven up every year without real cause, after complaining i got my account deactivated. Phone abb is not even capable of doint TRADES!! also their charting is broken on the phone app. Avoid by all costs."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "soud A",
          "Nb_Reviews": 2,
          "Date": "2023-08-26T13:03:39.000Z",
          "Titre": "I just rejoin",
          "Contenu": "I just rejoin , it’s still worse than before"
        },
        {
          "Note": 2,
          "Lieu": "GE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T11:09:08.000Z",
          "Titre": "bugs reported months still not fixed",
          "Contenu": "bugs reported months still not fixed, not responding to support emails on support*altrady.com"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "ABDALLAH",
          "Nb_Reviews": 7,
          "Date": "2022-08-13T20:18:14.000Z",
          "Titre": "The signals can't be configured to…",
          "Contenu": "The signals can't be configured to blacklist a cryptocurrency pair"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicolas Hart",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T11:55:39.000Z",
          "Titre": "Scouting for 2024 crypto firm to bank…",
          "Contenu": "Scouting for 2024 crypto firm to bank with. my 2023 was filled with 9rofit wi7h FTCINVESTMENTS. need a second stream source of inc0m3 f0r 2o24."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Rogier Brand",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T23:36:57.000Z",
          "Titre": "Great number of options!",
          "Contenu": "I like Altrady for its extensive functionality! Yet for simple SPOT / day trading I find it too complex and I rather use something else. Been using it in addition to another software package for the last few years."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Jeroen Jansen van Rosendaal",
          "Nb_Reviews": 4,
          "Date": "2023-03-23T18:39:26.000Z",
          "Titre": "I use Altrady for 2.5 years now..",
          "Contenu": "I use Altrady for 2.5 years now... And they are improving every day of the week.Signalbot, Gridbot, Trailing stop loss... etc etc...The team is working every day.... Support is helping me out when I have questions... Short respons times... And the Discourd server is amazing.... HUGE supporting community.....If you want some true trading results... Just look at my Twitter account.... @JeroenJvr"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Aki",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T06:00:18.000Z",
          "Titre": "I know Altrady for 2 years",
          "Contenu": "I know Altrady for 2 years, they have improved the platform by a numerous number of features. There's no equivalent in the space about that. You can trade with a large amount of opportunities.That being said, there are still some slowness and bugs that can be annoying from time to time. Altrady needs a bit of twick, debug & polish to be at its full potential of efficiency."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Piergiuseppe",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T09:24:26.000Z",
          "Titre": "The platform is great really...",
          "Contenu": "The platform is great really...Please add a more proper GRID bot features.It's too basic and cannot set parameters like grid lines  distance, etc.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brighton",
          "Nb_Reviews": 3,
          "Date": "2023-04-04T22:47:53.000Z",
          "Titre": "Expensive but has good tools",
          "Contenu": "Expensive, but can provide some edge in trading tools not available on exchanges, signals aren't very straightforward and never produced a trade in my 2 week trial, but ladder trades have been increasing my win rate overall. I would give 5 stars, but a couple trades had api errors that caused grief for my positions. I didn't pay for anything beyond the basic package, because the base scanner doesn't make sense to me"
        },
        {
          "Note": 4,
          "Lieu": "OM",
          "Pseudo": "tariq albalghuni",
          "Nb_Reviews": 38,
          "Date": "2022-12-22T09:59:08.000Z",
          "Titre": "I apologize for the misunderstanding",
          "Contenu": "Something went wrong, so the review must be correctedMaybe my api was hacked in one of the platforms and when he couldn't withdraw money from my wallet he did this bad deedI always disable the opt out option when linking the api for thatI apologize for the misunderstanding that occurred. I wish you successThanks to .trustpilot"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Harsh Anand",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T09:00:49.000Z",
          "Titre": "Superb",
          "Contenu": "This platform is quite amazing but there's one feature missing for which I am searching from a long time. If, Altrady Quick Scan would have an option to scan multiple indicators like MACD crossover n all then that would make it perfect."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Danny Starostek",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T13:39:15.000Z",
          "Titre": "Altrady is here to stay!",
          "Contenu": "I use Altrady for almost one year now and I have to say it works very friendly. They are always striving to be innovative and give the best service.  On Telegram they run their own Altrady group for tips, feedback and issues, perfect!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Osman",
          "Nb_Reviews": 2,
          "Date": "2022-11-11T23:22:25.000Z",
          "Titre": "Very nice trading tool.",
          "Contenu": "Very nice tool.Sometimes error occures when orders are placed and get triggerd. They are cancelled.The subscription model changes alot."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Florin Filip",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T18:39:55.000Z",
          "Titre": "Using it for over one year! Great app.",
          "Contenu": "Using for over one year, they are always improving and the support team is awesome. Very good service overall!!"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Richard Stegeman",
          "Nb_Reviews": 6,
          "Date": "2020-10-28T19:17:35.000Z",
          "Titre": "Great service and support",
          "Contenu": "Great service and support, for each problem small or big. Very good trading software with a lot off stunning features"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Bonduelle",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T22:25:23.000Z",
          "Titre": "Great trading-tool",
          "Contenu": "Great trading-tool, Very reliable, not as versatile as other tool, but very trusworthy. Support always close at hand."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Carel",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T17:50:08.000Z",
          "Titre": "Great functionality for traders",
          "Contenu": "Great functionality for traders. But it takes some time to learn all the features."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Valentino De Rooij",
          "Nb_Reviews": 2,
          "Date": "2020-10-28T13:52:41.000Z",
          "Titre": "This is by far the best tool worth…",
          "Contenu": "This is by far the best tool worth paying for,i personally have many Sub Accounts on different exchanges, if i would have to go back and control them manually i would go crazy,feedback and suggestions are taken seriously, regular updates, Kudos !!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T23:13:30.000Z",
          "Titre": "Over priced",
          "Contenu": "Over priced. Billed my account with permission"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Simone Verver",
          "Nb_Reviews": 3,
          "Date": "2023-01-29T22:01:15.000Z",
          "Titre": "Stable platform and good help(center)",
          "Contenu": "Stable platform and good help(center). Easy to use and a lot of settings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Madero",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:19:38.000Z",
          "Titre": "One stop shop for both automated bots and smart trading. Tech support is 100% helpfull",
          "Contenu": "Wonderfull tech support. Crypto Base Scanner is a fantastic tool that combined with their signal bot makes for a simple automated solution for those with busy schedules. Altrady security is second to none."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "IA_DC",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:22:49.000Z",
          "Titre": "Grid trailing down and trailing up",
          "Contenu": "Great trailing down and trailing up for grid trading. A great backtester. A great support team. Perhaps we will see futures grid trading soon?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karin Maya",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T03:55:00.000Z",
          "Titre": "Altrady is such a great platform!!",
          "Contenu": "Altrady is such a great platform and the support is superb!! I am a boomer and not as tech savy as many are. They worked with me on an issue that I could not understand but they never gave up on me and I finally figured it out! I am doing great with the signal bots and I imagine I will be with this company a long long time"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Gabi",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:37:25.000Z",
          "Titre": "Great experience so far",
          "Contenu": "The platform is great....initially seems overwhelming but slowly and steadily you're getting your head around it.Support is prompt and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "carlos Montelongo",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T09:26:48.000Z",
          "Titre": "Altrady's BOT does what it is supposed to do.",
          "Contenu": "Altrady's BOT does what it is supposed to do. It is simple to learn, to understand how it works: and makes security of every transaction a priority. Altrady encrypts all customer data and NO-ONE, but the customer knows the password to trade. It communicates with other trading platforms in a seamless way. Moreover, when I had a question, I was able to reach Altrady's Customer Service within  a minute. When it comes to money, the Customer Service aspect becomes quite important. One of the main aspects of this department is how knowledgeable their staff is. Altready offers the best value for my money, and it has allowed me to focus on achieving positive results on my trading."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customerDan Giffon",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:46:17.000Z",
          "Titre": "A lifetime of searching for financial truth.",
          "Contenu": "Is was a value to see different perspectives of a concept that can move a mountain of financial setbacks and create the possibility of a brand new start with a brand new game of financial self mastery.It's exciting."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T09:50:47.000Z",
          "Titre": "Great App",
          "Contenu": "Great App - which gives you a lot of tools which help take over the irritation of making trades,using AI and automations which bring the fun back into trading, helps to see a lot of things which would take researchers hours very quickly,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim M.",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T05:25:57.000Z",
          "Titre": "Altrady makes trading crypto a breeze",
          "Contenu": "1. Easy to get started2. Lots of widgets that allow you to access all the data necessary to make informed decisions3. Customer service is great4. Documentation and videos are very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SCOTT flanegin",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T10:49:24.000Z",
          "Titre": "I really like the format so far,I’m…",
          "Contenu": "I really like the format so far,I’m still only half way thru with getting set up to do paper trades but I can already tell I made the correct decision with Altrady!!!I’m excited."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Murray",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T04:51:51.000Z",
          "Titre": "A new experience",
          "Contenu": "I recently committed to Altrady and commenced with paper trades. I have now gone live with the signal bots and find they appear fairly regularly. I'm currently with only two exchanges due to limited funds but when possible I intend to run with more exchanges to get more signals.Right now in addition to the above I'm experimenting with paper trades on Smart trades and have had some good results. Another week and I'll go live with these too."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rusty",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T11:07:09.000Z",
          "Titre": "Excellent - Full of potential",
          "Contenu": "Excellent support, vastly superior to 3Commas in this respect. The Altrady platform feels like it is growing towards a very good place. One key thing I would like to see though is an API for users to query and manipulate bots and trades automatically (with the same full functionality as manually the website)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Laukaitis",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T00:30:38.000Z",
          "Titre": "Trust worthy & great support says 3 yr member",
          "Contenu": "I've been with Altrady 3 years after being frustrated with Coinigy. The support is great. Ben, Jenn and several others are very approachable, and exceedingly helpful. I never feel awkward asking questions, or making suggestions. It's amazing how much development Ben's team puts into improvements. The BOT is worth joining the altrady team all by itself, but there are lots of features that make it great. Thanks for all your hard work, guys! Nomanzero"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Piergiuseppe",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T17:29:20.000Z",
          "Titre": "This platform absolutely rocks!",
          "Contenu": "This platform absolutely rocks!I am currently using several platform but this one is really special.They just need to update the Grid Bot features to become PERFECT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Birchler",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T01:04:00.000Z",
          "Titre": "Great  bots and smart trading controls.",
          "Contenu": "I found Altrady when I first got into crypto.  But I didn't continue to use the software...didn't realize some of the unique features of the base scanner and trading bots.But I have found my way back, and find that the platform has many features that will enable a skilled trader to plan and execute trades effectively or to automate them through bots.They have really responsive customer service.  So I would highly recommend this platform."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "ChipDavis",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T22:16:57.000Z",
          "Titre": "All's Right with Altrady",
          "Contenu": "Support staff is patient and makes it a point to address all problems quickly and thoroughly. There's a genuine interest in making the platform accessible to all skill and knowledge levels and it's evident from the top all the way down. This is the trading platform I've been looking for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juggerke",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:16:45.000Z",
          "Titre": "Best platform and customer service",
          "Contenu": "I have been using the platform for over 6 months, with over 4 accounts added, without any problem.I couldn't understand something, requested help in the Support Chat and they instantly replied, helped, and provided answers to all my questions. Best platform you can find for trading with one or multiple accounts."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Fredm",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T22:10:17.000Z",
          "Titre": "Great platform with a big variety of…",
          "Contenu": "Great platform with a big variety of trading options, including ladder orders, smart orders and bots. Very accessable and no-nonsense team. Quick response from helpdesk,  also late at night or in weekends. If there is an issue, Benoist (founder) and his team jumps in to solve, fix or improve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "andrew aligo",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T22:46:43.000Z",
          "Titre": "Tech support",
          "Contenu": "Tech support. I was driving myself crazy for 3 hrs trying to figure out some settings I must have messed up to not let me trade properly on futures market. I got onto the discord server, went to support, Timothy started helping me, then sent me over to the main Altrady support page so I could sent some screen shots showing the problem. He noticed the issue within 2 minutes. I changed the setting, and now I'm back off to the races. Thanks again Timothy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Mathis",
          "Nb_Reviews": 2,
          "Date": "2023-09-16T22:27:15.000Z",
          "Titre": "Customer support is great!",
          "Contenu": "Altrady has extremely knowledgeable people in their customer support area. You chat with real people who are quick to answer questions in a professional and personable way.  They are super!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Tijn",
          "Nb_Reviews": 6,
          "Date": "2022-07-06T14:35:07.000Z",
          "Titre": "Clear interface, great helpdesk",
          "Contenu": "I'm using Altrady for about 1,5 years now on a daily basis. I love the clear interface and the possibilities you get with smart orders. A great plus is the very supportive helpdesk in case you have questions or some trouble. The build in grid bot and signal bot are great too. I had some minor issues with replacing trendlines, but that's more a problem because Tradingview is not very supportive towards Altrady."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Paul Klein",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T17:56:31.000Z",
          "Titre": "Awesome trading tool and lightning fast support",
          "Contenu": "Not much to say, Altrady has an amazing set of feature for trading. It might have bit of learning curve but it's worth it. As for the support, i never had to wait for more then 5 minutes for someone responding in the live chat. Very friendly people and also very patient."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Aristide",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T11:30:12.000Z",
          "Titre": "Trading crypto with ease",
          "Contenu": "Pretty good software, the UI/UX is amazing, the base scanner / quick scan is a pretty usefull tool, everything to get you started trading crypto. The dev team is amazing, the support is amazing, the only missing thing is some advanced trading features but as we can see this is actively developed with a lot of efforts so this can only get better & better, can't wait to see the futures updates ! :D"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "RS",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T17:36:09.000Z",
          "Titre": "HAPPY USER REVIEW",
          "Contenu": "HAPPY USER REVIEWStarted the crypto journey mid 2020 with no trading background. Initially signed up to Altrady to get a big picture portfolio overview. Friends used Hypertrader, I sticked with Altrady.. It is of Dutch origin and Benoist is a brilliant no nonsense company owner. At the time I was missing Bitvavo as an exchange and several indicators that came along during the learning experience. I decided to trust the feedback from Altrady support that many more features would be added in a fast pace.Well, Altrady delivered! Soooo many new functions and features are added every day and support is always super fast and extremely helpful.Altrady makes the road to grow from a beginning trader to advanced user so much better."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Nikolas Fakeus",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T21:52:04.000Z",
          "Titre": "smart positions are great",
          "Contenu": "smart positions are great, the progress made since the initial release blows my mind. the developers help you pretty quick with amy issues you might have and a monthly report for profitable signals is released regulary. never regret buying a lifetime package so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark McNutt",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T22:33:49.000Z",
          "Titre": "Exactly what I needed to bring my trading to the next level",
          "Contenu": "I heard of Altrady from a couple friends that use it. I thought nothing of it - \"oh this is just another trading platform/exchange\". Then I looked into it and realized it is every trading platform I use consolidated into one spot. Rather than having a million tabs open to check each one (I used 4 different ones) I can now use Altrady to track each one! It saves so much time and hassle and I regret not setting it up sooner. This is exactly what the crypto trading community needed and I'm grateful to the amazing Altrady team that has helped me so far!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Deniz Altindas",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:52:39.000Z",
          "Titre": "A user's perspective.",
          "Contenu": "I've been using Altrady for a few years now and I'm always amazed by the scope and possibilities of this trading platform.  If I have to compare Altrady with others, I can only say that it is not possible, because what Altrady offers is unique.  it's so unique that you can't live without it and you have to come back immediately.  The bot is indescribable.  Based on QF Luc's idea.  if you don't know Quickfinger's Luc, you've missed something.His idea of ​​trading Crypto is amazing.  He sadly deleted all his videos on youtube and yet he remains a legend.  I will forever be grateful for the best tip I've ever received.  thank you Altrady for creating such an amazing bot and trading platform."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Argosa",
          "Nb_Reviews": 2,
          "Date": "2023-05-20T16:59:28.000Z",
          "Titre": "Perfect Support, Perfect Platform",
          "Contenu": "They have tremendous customer support. I just discovered this platform and I wish I had discovered it sooner. It is of high quality and I use it with great enthusiasm. As for the negative reviews; they are likely from a competing company. Don't pay attention to them. This is a wonderful platform and the customer service representatives are exceptionally good. It deserves more than 5 stars.I will share my experiences here again after a month has passed. That's all for now."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jan van der Pas",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T16:13:46.000Z",
          "Titre": "Best crypto trading platform",
          "Contenu": "It's the best crypto trading platform out there. Especially when you want to manage your assets over multiple exchanges.App provides some handy tools to place trades e.g. using a ladder and to analyses your portfolio growth.It also has the function to automatically scan for drops and notify you. I use it to trade automatically. It's a bit of work to set up automatic trading, but I doubled my value on Kucoin with it."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jeroen Jansen van Rosendaal",
          "Nb_Reviews": 4,
          "Date": "2022-11-17T13:31:47.000Z",
          "Titre": "Fast and reliable trading platform",
          "Contenu": "Fast and reliable trading platform. Great ability to link many different exchanges.Built-in Signalsbot works super well. Good profits.Customer service works fast. Also accessible through different channels (Discord, chat). Problems/questions I asked were resolved quickly.All in all a nice and reliable platform to use."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Cristi Duma",
          "Nb_Reviews": 1,
          "Date": "2020-11-21T14:24:50.000Z",
          "Titre": "The best crypto trading tool",
          "Contenu": "Altrady is a complete crypto trading platform made by traders for traders.The UI is clean and highly customizable. The UX is simple and intuitive.It integrates some of the most popular exchanges into one easy to use interface.The dev and support team are fantastic and they are continuously developing and improving the platform.This is, by far, the best crypto trading tool on the market and it's getting better and better every day.Well done!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Arne “aFluxx” De Belser",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T19:16:23.000Z",
          "Titre": "Best trading terminal ever made",
          "Contenu": "Altrady is an awesome trading terminal. Most terminals offer basic trading features, altrady goes the extra mile.The past few months they've added handy new features which help active traders alot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric P",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:26:24.000Z",
          "Titre": "The Altrady platform is top-notch",
          "Contenu": "The Altrady platform is top-notch, the software is out of this world, and the features are second-to-none. Supa impressed!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Marius",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T08:01:07.000Z",
          "Titre": "I have used several tools in the last…",
          "Contenu": "I have used several tools in the last year (varying from Tradedash, Hypertrader, Binance App/web, Bitvavo etc.), and I came to Altrady because (in the end) it had additional functionality (base scanner, QFL) and it used a lot less CPU power than others tools out there.The support is absolutely good and I think I have really good value for my money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T14:03:16.000Z",
          "Titre": "This is by far the best experience that…",
          "Contenu": "This is by far the best experience that I've had with a trading platform. I'm trading mostly on Kucoin and ByBit futures and been able to use the signal and grid bots makes it even easier. A bit overwhelming for the beginners, still the support helped me straight away. Keep up the good work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Slusser",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T19:17:53.000Z",
          "Titre": "As a long-time coach with The Better…",
          "Contenu": "As a long-time coach with The Better Traders, I am happy to recommend Altrady as a platform to my students.  It's a comprehensive platform that allows our students to execute the strategies learned in our courses, with excellent support to boot. -J"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T19:05:03.000Z",
          "Titre": "Simply the best",
          "Contenu": "Altrady offers very good customer support.  The extensive smart orders enable complete trade setups, including a P&L calculation per trade and the Risk Reward ratio for your trade account.  The program is suitable for all crypto exchanges and offers a complete package of trading facilities such as: a base scanner, quick-scan FF, grid and signal bots, alerts and order positions.  The paper accounts make it possible to test a trading strategy in advance on any exchange based on a fictitious trading budget.  Simply the best."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T04:51:45.000Z",
          "Titre": "Altrady customer service offered nice…",
          "Contenu": "Altrady customer service offered nice trial period while I was not able to pay my subscription being out of  town. Thank you for your understanding."
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Dominik eragon sk",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:46:05.000Z",
          "Titre": "I was never more excited than how I am…",
          "Contenu": "I was never more excited than how I am while setting my trades to trade for me while I sleep, I wake up with gratitude daily just to discover gains I've never dreamed of before. You are wasting your time until you begin to utilize altrady's limitless capabilities. A true Lifechanger❤️❤️❤️ Thanks to Altradýs Team of developers and their support and the fastest problem-solving company you never heard of before! Thanks to @Benoist for his neverending knowledge❤️ Never leaving!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T05:06:30.000Z",
          "Titre": "Support and platform 5+ stars!",
          "Contenu": "I've had multiple questions and requests for support. But besides the truly mindblowing servicelevel, the platform is hands-down the best I've used thus far. Bye bye 3commas and welcome Altrady!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T23:14:21.000Z",
          "Titre": "fast, satisfactory, good support teams",
          "Contenu": "Nice interface, it works on Mac, and it is surely better than trading on Binance Web or Binance Mac app. The speed is a lot faster. Another major pro is that the support is extremely quick and nice. I was asking loads of questions. But the support teams really did their best to help me out and their responses were very satisfactory.Also, the features are great. I find those features available here enough for me to gamble this market."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Philip Meir",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T19:00:49.000Z",
          "Titre": "Altrady",
          "Contenu": "Awesome trading platform, Their support is great as well, Benoist from AT always brings  a solution for any problem! Every question you have or suggestion they take it serious, big thumbs up for the Team! 👍🏻"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T15:39:34.000Z",
          "Titre": "A trading tool fit for modern day's…",
          "Contenu": "A trading tool fit for modern day's trading. In constant development adding great new features. Support is very swift and accessible on several platforms like Discord and Telegram. I love this tool, it's worth every bitcoin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julio Medina",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T15:51:27.000Z",
          "Titre": "Here since the start and never leaving.",
          "Contenu": "I have been using altrady since the launch. There is nothing out there that can compare to the thought and care behind the development of this platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harley",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T02:33:23.000Z",
          "Titre": "Great help",
          "Contenu": "Great help. I had trouble figuring out the proper code for a trading view alert for a signal bot and Timothy helped tremendously! Love the versatility of the Altrady platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert B",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T18:02:51.000Z",
          "Titre": "Incredible Product and Support",
          "Contenu": "Altrady is awesome.  The customer support on its own is worth the 5 Star review.  Possibly the best customer support that I have ever received from a digital company.The product/trading terminal drastically improved my trading and my profits.  I use Coinbase Pro (GDAX) as my primary account and I find that interface to be nearly unusable and very difficult to work with.  The integration with between that and Altrady was quick and very straightforward.  This put all of the information that I could not find on CBPro right in front of me and it was very customizable.I highly recommend this software for both the product and the support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Woollard",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T19:22:41.000Z",
          "Titre": "Great platform and excellent customer support",
          "Contenu": "I had set up a bot to make some trades. After looking at one of the trades, I was confused why the trade was opened because there was no base on the chart. After contacting support, I was asked to enter my email address. I entered my email address and Timothy with support answered in under 2 mins. He explained that the position was opened with conservative settings and showed me how to change from day trader to conservative settings with a screenshot. I was manually changing the chart from 1 hour to 2 hour for the day trader and conservative settings, which was not working. Being new to the Altrady platform, I did not understand I had to change the algorithm settings under base info. Support was fast and courteous. I also was using another bot platform at the time, and the signals from Altrady seem to be superior, and I was able to get out of trades faster. I am very happy with the bot, trading terminal, and the customer support. Keep it up, guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHARLENE TRAN",
          "Nb_Reviews": 3,
          "Date": "2023-07-09T18:57:26.000Z",
          "Titre": "i am new with this solfware and Timothy…",
          "Contenu": "i am new with this solfware and Timothy help me step by step in details on Sunday . It is amazing how helpful of him to be patient with me until i finish the set up . Highly recommand this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "christian swanson PaRappa the",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T04:16:27.000Z",
          "Titre": "Simple easy platform to use even for…",
          "Contenu": "Simple easy platform to use even for beginners and has real costumer service. Had an issue with my account and within 15mins had it sorted. Great service."
        },
        {
          "Note": 5,
          "Lieu": "BQ",
          "Pseudo": "Marc Franken",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T14:52:53.000Z",
          "Titre": "I did not want to renew",
          "Contenu": "I did not want to renew. Also did not receive any message upfront for the annual renew.> 20/6//2023 - Meanwhile, well helped by support. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T13:18:39.000Z",
          "Titre": "Real Customer support!",
          "Contenu": "Customer support is the best I've come across. Real people not bots answering in depth questions with in depth answers straight away. They know their stuff."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "johnnyboyX",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T07:28:36.000Z",
          "Titre": "very pleasant to work with",
          "Contenu": "very pleasant to work with. on the android phone app the TP smaart order has some trouble of not responding when i want to drag it, and i need to delete it,  and place a SELL ordeer instead."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Vahid AG",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T10:40:23.000Z",
          "Titre": "Super versatile and user friendly…",
          "Contenu": "Super versatile and user friendly trading tool. I have used many and Altrady is by far the best I have ever used. And the support is just unbelievable. Recommend!"
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "matendzo",
          "Nb_Reviews": 2,
          "Date": "2021-11-13T19:47:34.000Z",
          "Titre": "Nice software",
          "Contenu": "It's really nice software for more advanced users. For me, beginner, it has too much features. Great and quick acting support. I hope I will come back another time:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "no",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T01:00:48.000Z",
          "Titre": "Altrady",
          "Contenu": "🔥Yo, yo, yo! Chadbro here, your all-in-one guide to the sickest, most fly stuff on the internet. Today, I'm gonna drop some mad knowledge on y'all about the baddest trading platform in the game: ALTRADY!💥Buckle up, bros and bro-ettes, 'cause we're about to take a wild ride into the world of crypto trading that'll leave you feeling like the Tony Hawk of digital coinage! 🚀First off, let's talk about Altrady's dope interface, man. This baby is smoother than a freshly waxed surfboard, and more eye-popping than the sickest fireworks show. You got customizable layouts, rad charts, and a whole lotta tools to make your trading game unstoppable. 📈You think you're pretty slick with your trades? Just wait until you experience Altrady's real-time alerts and market scanners. This righteous platform is like having your very own crypto sensei, guiding you through the digital jungle to find those sweet, sweet trading opportunities. 🧠💡But Chadbro, what about managing multiple exchanges, you ask? Dude, Altrady's got your back with their cross-exchange management. You can manage all your accounts in one gnarly dashboard, making it easier to keep track of everything and focus on what's really important: raking in those profits, bro! 💰🏄‍♂️Now, you may be thinking, \"Chadbro, this sounds great and all, but I'm new to the crypto game. Can Altrady help a bro out?\" Fear not, my fellow crypto surfers! Altrady's got a wicked customer support team that's more dependable than a lifeguard on duty, and a knowledge base that's like having the raddest encyBROpedia of crypto trading at your fingertips. 🆘📘So, if you want to kick your crypto trading game up to the stratosphere and ride the digital waves like a true legend, then look no further than Altrady. It's the ultimate trading platform that'll make you feel like the king or queen of the crypto beach. 🤴👸In the wise words of Chadbro, don't just trade crypto, DOMINATE it with Altrady. Catch you on the flip side, dudes and dudettes! 🤙💥"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T12:38:04.000Z",
          "Titre": "Great customer service",
          "Contenu": "Very helpful customer service and assistance given  when requested. Thank you so much. I am very happy."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Sajjad Ali shah",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:38:37.000Z",
          "Titre": "Pupg mobile gift uc",
          "Contenu": "Send many br"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Patrick",
          "Nb_Reviews": 21,
          "Date": "2022-10-19T09:16:16.000Z",
          "Titre": "Best Crypto tradingsoftware",
          "Contenu": "Great tool for excellent Crypto trading. Nice interface for a good overview. It is easy to customize your dashboard!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Tom W.",
          "Nb_Reviews": 3,
          "Date": "2023-03-24T13:39:13.000Z",
          "Titre": "By far the best and most convenient…",
          "Contenu": "By far the best and most convenient trading software out there. Already using it since the beginning!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "meneer\t\t\t\t\tKokkelkoren",
          "Nb_Reviews": 5,
          "Date": "2023-01-07T21:04:18.000Z",
          "Titre": "It is a very stable platform",
          "Contenu": "It is a very stable platform. The user interface is flexible built with widgets. Curious what the next releases will bring."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R B",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T17:03:48.000Z",
          "Titre": "great experience",
          "Contenu": "great experience. easy to use. very comfortable using even tho i just started trading 3 months ago."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "BvD",
          "Nb_Reviews": 3,
          "Date": "2023-05-12T21:07:48.000Z",
          "Titre": "Top voor ‘Crypto’ Traders!",
          "Contenu": "Top voor ‘Crypto’ Traders!Altrady is naar mijn idee super gebruiksvriendelijk, het kent vele opties voor traden met handige smart orders. De meeste zaken die ik gebruik zitten in het basis abonnement, Altrady is daarmee een uitgebreid en zeer prettige tool voor het Traden. Ik leer nog steeds bij en ben nog lang niet klaar met alle opties te leren ontdekken elke keer ontdek ik wel iets nieuws. Zo is er ook een scanner optioneel maar die ken ik nog niet. Naast de opties die er al inzitten zijn ze constant in ontwikkeling en wordt het steeds beter en uitgebreider, ook voor GridBot traders zijn er uitgebreide youtube filmpjes om je op weg te helpen. Het is een Nederlands product met een goede, snelle en kundige helpdesk in meerdere talen. Ook handig zijn de diverse social media kanalen zoals Discord  en Telegram. Waar het een en ander uitgelegd wordt door de ontwikkelaar en de team leden en waar je simpele vragen kunt stellen of anders wordt doorverwezen helpdesk chat via de website. Op social media kunnen gebruikers elkaar ook helpen, op Discord zelfs in meerde kanalen.Kortom een aanrader als je een stabiel, uitgebreid en prettige tool zoekt, voor zowel beginners en gevorderde traders die zelf- of geautomatiseerd trades willen plaatsen.Top for 'Crypto' Traders!Altrady is super user-friendly in my opinion, it has many options for trading with handy smart orders. Most of the things I use are in the basic subscription, making Altrady a comprehensive and very enjoyable tool for Trading. I am still learning and am far from finished discovering all the options every time I discover something new. For instance, there is also a scanner optional but I don't know it yet. Besides the options that are already in it, they are constantly developing and getting better and more extensive, also for GridBot traders there are extensive youtube videos to get you started. It is a Dutch product with a good, fast and knowledgeable helpdesk in several languages. Also handy are the various social media channels such as Discord and Telegram. Where things are explained by the developer and team members and where you can ask simple questions or else be referred to helpdesk chat via the website. On social media, users can also help each other, on Discord even in multiple channels.In short, highly recommended if you are looking for a stable, comprehensive and pleasant tool, for both beginners and advanced traders who want to place trades themselves or automatically."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Johannes Felsch",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T08:21:46.000Z",
          "Titre": "So far the best trading platform I…",
          "Contenu": "So far the best trading platform I used. And you can combine several exchanges in one place."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Toni",
          "Nb_Reviews": 8,
          "Date": "2023-06-18T22:52:26.000Z",
          "Titre": "Great functions that are missing on CEX…",
          "Contenu": "Great functions that are missing on CEX trading plattforms. Great signals for DCA bots."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R B",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T23:03:09.000Z",
          "Titre": "what made my experience great is the…",
          "Contenu": "what made my experience great is the ease of use. very easy to use for me as a beginner. excellent work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony IRA",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T10:02:08.000Z",
          "Titre": "Great software, better devs",
          "Contenu": "The devs are awesome and fast af at helping out. Software just keeps getting better."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andrej.A",
          "Nb_Reviews": 5,
          "Date": "2022-10-15T23:57:56.000Z",
          "Titre": "The best of the best Platform",
          "Contenu": "First of all, I would like to give due thanks to the support service, and this is the whole team Altrady. I have experienced a lot of services, and my experience is quite long. And this platform is all in one, all inclusive, and everything a trader needs to trade, many tools, alerts, robot trading automation, alerts for each trade.I like that the team themselves are traders, which means they understand what they are doing. The working environment on this platform is comfortable, and I feel here as if I am in their team, and not just a user.Their robots, which trade without interruption and confidently. Even if some kind of problem sometimes appears, then robots like an all-terrain vehicle and an armored car continue to trade further, notifying the trader to pay attention to the settings. With all this, the robot does not stop, which is a great advantage. I repaired it and the tarpedo flew on. ))The guys are always in touch and have a very strong patience with all clients, explain on the fingers until the client understands or jointly find bugs and misunderstandings. The guys recognize the mistakes with dignity, as if you are working with a friend together (they do not make excuses and do not evade), but quickly correct them.They also listen to clients about innovations, as it will be convenient in the first place for the user.I would like to write a lot, but already enough. I recommend them 1000% and you will be safe and comfortable in trading as one friendly family of traders. )) I think with this approach they will achieve a lot, and I wish to achieve a lot in development. The only thing I don’t understand is why he is not in the top, apparently they work for themselves and their clients, and marketing is secondary))). As of now, many have super marketing, but the product leaves much to be desired. I choose the first, this is the quality and reliability of the ALTRADY service. It's really a pleasure to work with them. This is the level of professionals."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cesar Waddington Cruz",
          "Nb_Reviews": 6,
          "Date": "2023-04-28T22:06:27.000Z",
          "Titre": "This tool is simply fantastic!",
          "Contenu": "This tool is simply fantastic for anyone who wants to actively trade!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Liesbeth De Haes",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:42:12.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service! Very good everything! Best trading platform ive traded on"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2020-11-07T22:30:31.000Z",
          "Titre": "A+ experience with the trading platform…",
          "Contenu": "A+ experience with the trading platform and the support. They are very professional and helpful in getting you setup and started off to trading."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T19:32:58.000Z",
          "Titre": "Great Response",
          "Contenu": "Excellent precise and fast response to any issues.Thanks for the great job!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thomas Gibb",
          "Nb_Reviews": 3,
          "Date": "2023-04-28T20:32:16.000Z",
          "Titre": "Just starting but the process looks…",
          "Contenu": "Just starting but the process looks great and my trials are exciting"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Ella P.",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T06:11:18.000Z",
          "Titre": "Has the best customer service",
          "Contenu": "Has the best customer service! Thank you again, Timothy of Altrady!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T21:59:00.000Z",
          "Titre": "Ease of smart trading",
          "Contenu": "Ease of smart tradingSecurity with whitelisting IP on exchanges"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARJAN SKUBIC",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T17:52:03.000Z",
          "Titre": "quick response and professional answers"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "D.F.",
          "Nb_Reviews": 11,
          "Date": "2020-10-28T13:56:54.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience, A+. Best trading tool I have used so far."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T23:22:14.000Z",
          "Titre": "Great work",
          "Contenu": "Great work . Excellent product. Just want some updates hope it will be live soon"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Bart Helsdingen",
          "Nb_Reviews": 4,
          "Date": "2023-02-18T23:50:31.000Z",
          "Titre": "Great tool for trading with crypto…",
          "Contenu": "Great tool for trading with crypto pairs. Easy and friendly interface!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Roel",
          "Nb_Reviews": 4,
          "Date": "2020-11-02T09:21:11.000Z",
          "Titre": "Perfect trading app",
          "Contenu": "Perfect trading app. Has everething i wished for and more. Easy trading."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Dlareg",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T12:33:38.000Z",
          "Titre": "excellent program",
          "Contenu": "excellent program, and from Europe. Always new trading information, program always with updates which make this a very attractive trading terminal..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T23:28:06.000Z",
          "Titre": "The best support ever for Altrady…",
          "Contenu": "The best support ever for Altrady platform"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Richard",
          "Nb_Reviews": 5,
          "Date": "2023-08-02T20:55:01.000Z",
          "Titre": "Great functionality",
          "Contenu": "Great functionality. Flexible desktop. Multi OS"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Abrl",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T21:16:14.000Z",
          "Titre": "Awesome 👍 Experience",
          "Contenu": "It has been a awesome experience."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:43:35.000Z",
          "Titre": "Very good support"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Vincent",
          "Nb_Reviews": 4,
          "Date": "2022-09-24T22:29:08.000Z",
          "Titre": "Easy to setup this trading bot",
          "Contenu": "Easy to setup this trading bot. Good and quick support. Platform and tools are easy to use."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Jan",
          "Nb_Reviews": 4,
          "Date": "2023-09-22T19:51:46.000Z",
          "Titre": "Subscription renewa",
          "Contenu": "Easy, simple and fast Subscription renewal."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Aldwin",
          "Nb_Reviews": 4,
          "Date": "2021-12-15T19:00:56.000Z",
          "Titre": "Great customer service and easy to…",
          "Contenu": "Great customer service and easy to trade with"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Fritz Timothy",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T22:53:48.000Z",
          "Titre": "Detailed info on all trading activity",
          "Contenu": "Detailed info on all trading info"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shawn O'Hail",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T05:09:50.000Z",
          "Titre": "Love the app",
          "Contenu": "Love the app, constant development/improvements. And the customer support is awesome too."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Jan",
          "Nb_Reviews": 4,
          "Date": "2022-09-26T21:35:45.000Z",
          "Titre": "straight forward procedure",
          "Contenu": "Simple and fast payment processing."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bfreedom",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T18:46:24.000Z",
          "Titre": "Altrady is excellent",
          "Contenu": "Excellent trading terminal… so many options… great"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Roel",
          "Nb_Reviews": 4,
          "Date": "2020-11-25T05:44:50.000Z",
          "Titre": "Smooth trading."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T23:02:27.000Z",
          "Titre": "Great platform and quite easy to use."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Mevr. Claassen,",
          "Nb_Reviews": 4,
          "Date": "2020-10-28T14:20:12.000Z",
          "Titre": "Perfect trading tool!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sébastien Michaud",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T00:48:39.000Z",
          "Titre": "Perfect and very fast"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T13:32:33.000Z",
          "Titre": "The best trading tool in the world"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Johnny",
          "Nb_Reviews": 10,
          "Date": "2020-10-28T13:40:35.000Z",
          "Titre": "Perfect and helpful platform",
          "Contenu": "Perfect and helpful platform for trading cryptocurrencies!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T17:23:47.000Z",
          "Titre": "Ease of use & reliability."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "makou",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T20:44:57.000Z",
          "Titre": "great platform",
          "Contenu": "great platform, great service and continuous development"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T09:05:12.000Z",
          "Titre": "Verry fine to work with 👍"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "The best way to trade online",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T14:50:02.000Z",
          "Titre": "amazing platform"
        }
      ]
    }
  ]
}