{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "atomicnetworks.co",
      "Review": [
        {
          "Note": 1,
          "Lieu": "IR",
          "Pseudo": "Meisam Hashemi",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:30:38.000Z",
          "Titre": "Very unproffessional support",
          "Contenu": "Very unproffessional support. I was stuck for almost 72 hours beacause i was short of 3 cents(probably the crypto transfer fees).although it was partly my fault i recieved no help/explanation the least thing they could do was help me find the reason and invoice me again and then we could figure out something about the underpaid invoice."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "xVOFqJjInA",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:08:22.000Z",
          "Titre": "3, out of 5, for neither positive, nor negative. Neutral. Asked by them to leave a review.",
          "Contenu": "3 out of 5 stars because I could not see another way for a grade of neutral. I mean, I do not want to discourage the reader from becoming a customer. Nor do I want to encourage him. Plain point of no opinion about it. I never was a customer. As of this writing, it looks like I will not be one in the near future. This review is written because I was asked to write it in their reply. Which could be a standard automatic signature for the email address who sent me their reply. I was not promised any gain out of writing it. I will try to describe only facts, and all of them. It is written out of memory. I hope I will not be wrong with the details.  I was considering their cheapest, USD 6.50 VPS black-friday-2023 plan for a single VPS. USD 6.50 per year, paid in advance. Link for the exact offer removed because Trustpilot disallow it. I did not look for anything else. I emailed contact@, which is the only email address I could see at their site, with pre purchase questions. 24 hours passed without receiving a reply. So I tried to open a ticket as a guest, repeating my previous pre purchase questions, along with more questions. The message confirming the ticket submission stated I will receive a confirmation email. Which I have not received. After about 1 hour, I tried to submit another ticket as a guest. This ticket shortly mentioned my previous ticket and email, and also wondered if they have a bug which caused the ticket confirmation email not to be sent. For this last ticket I rather quickly got a reply, by email as well as by their ticket system, that a confirmation email would be sent if I was opening tickets after signing in. Their reply also had an explicit user name email address, rather then contact@. I emailed that user, and quickly got a reply my pre purchased questions were noticed. All my email messages, as well as all the tickets I have opened, were noticed. And will be answered when the owner will be available, because they are waiting for his decision. One day after that I got a short reply by email, they normally do not allow a VPS sending and receiving of email. Which was one of my pre purchase questions. Their message also asked me to write this review. Again, the review request could be by an automatic signature for the user sending me that reply. They did not answer the other 7, or 8, pre purchase questions. That is all my experience with them up to 11/30/2023.For completeness, at mid December 2023 I decided to ask them to clarify their use of the word normally in their statement of `normally not allow a vps to send and receive email'. 6 hours later, I was told `they don't normally allow sending mail on their VPS's however if the customer share his use case and acknowledge that if they receive any spam reports the port will be closed then they do open the mail port for customers.' I was also told to keep asking them if I have more questions. Once again, I do not get any reward for updating this review. I will reconsider my previous statement about not purchasing their vps, though I might choose some other option I have for a vps. For me, their offer does look compelling."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Gocb b",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T14:24:10.000Z",
          "Titre": "it not bad",
          "Contenu": "it Good but it not the best of the best I love it bc no lag at all ez to setup but the support team is a bit bad"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "playroblox",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:47:58.000Z",
          "Titre": "Great free server hosting only problem…",
          "Contenu": "Great free server hosting only problem is the ping because I’m in australia"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Deus Ferrinho",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:47:43.000Z",
          "Titre": "brazilian servers???????"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "YASH KUMAR",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T04:50:37.000Z",
          "Titre": "Atomic Networks is a great provider",
          "Contenu": "Atomic Networks is a great provider. The performance of their VPS is pretty good. Also, they respond very quickly. Like, I wanted to install a custom OS and they instantly attached the CD."
        },
        {
          "Note": 5,
          "Lieu": "UG",
          "Pseudo": "Sseki Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:11:43.000Z",
          "Titre": "Very good customer service",
          "Contenu": "This company is good with their handling of customers. Please support their efforts. Thank you Atomic networks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orion",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T19:56:16.000Z",
          "Titre": "Wow.",
          "Contenu": "Honestly, this is the best performing server Host for GMOD/TF2. I truly haven't had this experience with any other host. Most servers offer crappy packages for twice the price they offer here not to mention the fact that they offer Dedicated IP **FREE** development servers. Truly a pioneer in Garrys Mod Server Hosts. I can't express enough how happy I am to have Atomic as my host. Support is 10/10 and super quick, panel looks amazing, and servers crash very few times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NoName",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:10:25.000Z",
          "Titre": "I had a small problem with my server…",
          "Contenu": "I had a small problem with my server and I summited a ticket within 5 minutes I got an Email back saying it was fixed so far 10 out of 10 support and good serves"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 7,
          "Date": "2023-09-17T18:38:06.000Z",
          "Titre": "Up and coming Hosting Provider",
          "Contenu": "Up and coming Hosting ProviderThey have great prices, always offer some kind of promotion to give back to community, and are on Discord. Someone said bad customer service but every time I reached out via ticket system or Discord they've been nothing but helpful.They have a money back guarantee as well so I'd definitely give them a shot. Their set up and config panel are really nice UI and I have no complaints."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Somer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T15:22:52.000Z",
          "Titre": "Everything is automated",
          "Contenu": "Everything is automated, it was really so easy to deploy my VPS and i was able to setup IPv6 distribution to openwrt clients via Wireguard + Slaac so easily. A single wireguard connection is running on openwrt and every device at home gets public IPv6 addresses from openwrt via VPS. I have cgnat so this was very useful for me. They provide ::/56 for free."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HAYDEN CONRAD",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T18:22:51.000Z",
          "Titre": "As of about 2 weeks into my service…",
          "Contenu": "As of about 2 weeks into my service everything has been great. Server has been up with no drops and I’ve always had instant fast connection to their web services. The price is perfect and affordable. The ease of use is also perfect with built it FTP access and mod managers make my life a heck of a lot easier. Couldn’t be happier. I will be staying for the foreseeable future as a customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William K",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T19:34:44.000Z",
          "Titre": "BEST PRICES & HARDWARE!",
          "Contenu": "Want a decked out fully capable game server for almost any game check out atomicnetworks a host specialised and marginlized in the gaming community they know there servers! they got you! 8/10 SUPPORT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ayy",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T11:39:57.000Z",
          "Titre": "Peter Griffin",
          "Contenu": "My experience with the services provided by Atomic Hosting have been fantastic. Throughout my time with the service, I have seen improvements to the panel and features that I've never seen in other panels but I've also seen these improvements in real time as I played with the server. Whenever I had questions or a problem I always went to Wilkers, who I feel I have known longer than most of my friends. He always responds quickly and gives the best responses and he's a family guy. I don't have a lot of questions since I've been messing around with garrysmod servers for 5 years but it's nice to know that some of those questions were recently added in their Support Knowledgebase."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Farlow",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T08:26:48.000Z",
          "Titre": "Review as a Client",
          "Contenu": "The Staff are Fantastic, go out of their way to make your experience great. Prices are honestly a bang for your buck, extremely good prices and the servers are also extremely good. Very easily transfer files into the server, I have nothing but positives about this hosting service, if you don't use this hosting service, you're missing out!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tyler Muldown",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T18:52:52.000Z",
          "Titre": "The most helpful staff",
          "Contenu": "They have helped me on multiple occasions for something being so cheap you would think they wouldn’t really care about customer service but they do great company great prices great staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Levi Crozier",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T22:24:19.000Z",
          "Titre": "A professional experience through and through...",
          "Contenu": "A professional experience through and through, and hosting at dirt cheap prices. From the user experience, to the amazing owners and support team, to the top level hardware with unbeatable pricing, I cannot fathom how they even profit. Everyone involved has experience and it truly shows. You will not regret hosting with Atomic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "james",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T04:55:52.000Z",
          "Titre": "easy to order",
          "Contenu": "easy to order, quick activation"
        },
        {
          "Note": 5,
          "Lieu": "IR",
          "Pseudo": "Max Ohara",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:04:11.000Z",
          "Titre": "That so wooow awesome  😎👍"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Andrew AceServers LTD",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T01:32:07.000Z",
          "Titre": "Fantastic host",
          "Contenu": "Fantastic host, Cheap prices quality hardware and network."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Najib Najib",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T01:45:31.000Z",
          "Titre": "Very Helpful",
          "Contenu": "Atomic has not only offered a GREAT service but awesome Support, AMAZING equipment for their servers at very affordable prices.10/10 would 100% recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Arguirov",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T02:53:58.000Z",
          "Titre": "Amazing Server Hosting",
          "Contenu": "Amazing Server Hosting! It has great customer service, and a high amount of CPU Usage for a low price. Definitely would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick DeMonte",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T01:17:53.000Z",
          "Titre": "Owner Was Customer Service",
          "Contenu": "Owner Was Customer ServiceExtremely HelpfulResolved my issues VERY QUICKLYKnew exactly what they were doing"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alexander JH S",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T02:24:33.000Z",
          "Titre": "Great Service",
          "Contenu": "I am extremely pleased with the services provided by Atomic Networks. They truly lived up to their promise of being fast and reliable. The network speed was exceptional, delivering quick and seamless connectivity. Their advertised claims were not just empty words - I experienced it firsthand!Not only was the network lightning-fast, but the service itself was top-notch. Their team was prompt, professional, and efficient in addressing any concerns or inquiries I had. They went above and beyond to ensure my satisfaction, and I appreciated their commitment to providing excellent customer service.In conclusion, I highly recommend Atomic Networks to anyone in need of reliable and speedy network services. Their performance, as advertised, combined with their exceptional customer service, make them a standout provider in the industry."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "daniel qian",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:38:00.000Z",
          "Titre": "Quick response",
          "Contenu": "happy with the service so far"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "Aloninja",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T21:53:47.000Z",
          "Titre": "Amazing",
          "Contenu": "Amazing, I bought supporter and a case and they were quick and right on it Beautiful staff team and community"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom J",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:34:35.000Z",
          "Titre": "their support is great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T03:46:44.000Z",
          "Titre": "Best DarkRP/Hosting Service",
          "Contenu": "Great service the staff need to communicate more but amazing experience compared to the other DarkRP servers very clear simple TOS super easy communication with management. I've been using their hosting service for 2 years"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pastry",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T23:01:56.000Z",
          "Titre": "Thanks for cancelling the invoice",
          "Contenu": "Thanks for cancelling the invoice, i was getting worried my servers and account would be removed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bofa Deez nuts ATRIC Networks",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T08:29:33.000Z",
          "Titre": "Good server host honestly it’s good and…",
          "Contenu": "Good server host honestly it’s good and affordable and runs amazingly aswell good support"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ADC Sucks",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T21:02:30.000Z",
          "Titre": "Had an issue and it was quickly…",
          "Contenu": "Had an issue and it was quickly answered and resolved by multiple service reps and the owner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JalaBeanos",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T12:22:07.000Z",
          "Titre": "Amazing Service",
          "Contenu": "Owner helped us with our server and gave us a free gig so help us start it. 10/10 service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Najib Najib",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T16:21:16.000Z",
          "Titre": "The best out there!",
          "Contenu": "Amazing server hosting, the best prices around, and along with that if you buy an unleashed server you get a free webhosting package, as a folk that has been bouncing back and forth between different server hostings over the years it's safe to say that this is my permanent server hosting, you cannot beat Atomic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laz Garcia",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T00:57:05.000Z",
          "Titre": "good stuff i use game hosting gmod and…",
          "Contenu": "good stuff i use game hosting gmod and i like it :D"
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T10:36:27.000Z",
          "Titre": "Just working well",
          "Contenu": "Just working well. Good provider for me."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Anakhin",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T01:11:45.000Z",
          "Titre": "Fast Response From The Owner Really…",
          "Contenu": "Fast Response From The Owner Really Helpful And Informational"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Arya MauLana",
          "Nb_Reviews": 4,
          "Date": "2023-09-05T01:41:31.000Z",
          "Titre": "very nice",
          "Contenu": "amazing services with awesome supports. thankyou"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "szo",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T20:03:34.000Z",
          "Titre": "Atomic Networks A+++",
          "Contenu": "Great company, professional, attentive to all their clients needs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Ottey",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T07:29:19.000Z",
          "Titre": "good hosting service",
          "Contenu": "good support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DEAD PIXEL",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T06:59:01.000Z",
          "Titre": "AMAZING SERVERS",
          "Contenu": "there amazing ppl and the site is very ez to use."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "masy uzilo",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T22:15:17.000Z",
          "Titre": "Cheap and fast vps server"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Kipas Tanda",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T00:48:40.000Z",
          "Titre": "Excellent vps"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "ubaid lulli asdasd",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T02:31:33.000Z",
          "Titre": "duck the pussy",
          "Contenu": "duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy duck the pussy"
        }
      ]
    }
  ]
}