{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "bisecthosting.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Okpala",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:47:16.000Z",
          "Titre": "I had an event that was very excited…",
          "Contenu": "I had an event that was very excited for while streaming  and when it came down to it. There were so many different issues coming from laggy transition, constant crashing and just so many problems that it was hard to see this as something I would use in the future. However, I will say the constant help from tech support was a major plus when it came to helping me fix \"some\" of the issues. But as of now I can't see myself continuing using this product as it left a very bad taste in my mouth."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Crypto",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T20:37:28.000Z",
          "Titre": "10/30/2023",
          "Contenu": "10/30/2023The hosting is pretty bad ngl, my server is always running so far behind in ticks, and it's not like we have lag machines and stuff it's my survival server with 4 people. We make sure to limit our farm sizes and everything to reduce lag. I will be switching to another hosting provider.UPDATE: It's now December and they upgraded my server to 6 gigs and installed some server plugin for \"free\" even though the billing started charging me +$10 extra for this shiiit. I'm done with this fuccking company and I'm just gonna start running servers off my spare PC. Dont buy from here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josiah Woodbridge",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:59:18.000Z",
          "Titre": "Just not what I was needing and…",
          "Contenu": "Just not what I was needing and moderator flay out said I need to spend more money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T04:15:00.000Z",
          "Titre": "Deceptive Customer Service",
          "Contenu": "12 hours of down time with no notification from Bisect. No timeframes provided outside of \"could be a few days or a few minutes.\" Server is still down, although for a little bit they thought it was working. It appears I had to notify them of that outage as well. Not open about issues with their equipment/network. It took several messages to even admit that there was a larger issue at play from the original tech. I've had to continually reach out for updates as there is no outage notification in the client.I have spent an entire day dealing with an excess of exclamation points and smiley faces while system admins apparently do nothing. It takes an hour max to change out a node but heaven forbid anyone actually do something that isn't remote. This problem could and should have been fixed in 2 to 3 hours max and there is still no end in sight.Bisect clearly is after quick cash and cares nothing for their customers. If they did, they would address issues with expediency and have redundancies in place to prevent such egregious failures on their part."
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Wincade",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T19:43:39.000Z",
          "Titre": "assetto corsa server was rented from…",
          "Contenu": "assetto corsa server was rented from you, then we werent able to use any mods on the server, and the server hasnt started with stock settings. i paid for nothing. :)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hera",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:17:25.000Z",
          "Titre": "$37.92 for an unplayable server",
          "Contenu": "I paid $37.92 for a 7Gig server that constantly crashed or lagged.  When I reached out to support, I was told to download Spark (which I did).  The first support staff member was able to help us, getting us from 300+ ticks  behind to about 30.  After another day we were back up to 200+ ticks behind so I logged another ticket.  I was once again told to send the server info via Spark commands, which I did.  I was then told it was the wrong information and to download Spark.  When I said I'd already downloaded Spark and had run the commands through /sparkc (/spark didn't register as a command), I was given a link to download Spark.  A few more \"you need to download Spark and run the /spark command\" messages later, and I just gave up and moved to a host that offered 12Gig for $30/month where my server has zero lag and zero crashing issues with more mods than we were using with Bisect as our host."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Leah H",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T04:39:17.000Z",
          "Titre": "Extremely Laggy",
          "Contenu": "Purchased a 9GB server for playing modded with 5-10 players consistantly, (which was what the website recommended). Server was fine at first, but after a few days the server lagged like crazy all the time and crashed. I figured we'd just play it till the end of the month since we were already past the refund policy date, but the lag was just too much. I have since gone with another hosting site with only a 8GB plan and its been fine."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Avante Water",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T02:06:50.000Z",
          "Titre": "I paid for a online server",
          "Contenu": "I paid for a online server, my account got hacked. I contacted the team immediately requesting assistance for account recovery.No response to the tickets. No help. But each month I get a bill to my email. So I contacted them 3 times letting them know I have no access to my server or the login info and can't access my bisect hosting account. Immediately No reply just a closed ticket and another bill in the email next month. So I cancelled my PayPal and cards so they cannot keep billing me."
        },
        {
          "Note": 1,
          "Lieu": "PA",
          "Pseudo": "Shenkay",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T19:56:04.000Z",
          "Titre": "A service full of lies",
          "Contenu": "A service full of lies, You ask, create support tickets, all good and welcome. They never told you or detail you if you cancel a server to configure a new service, they will charge you for download a backup of your server (NO matter if its on the same bisect service)Dont trust bisect, its full on scamming and liesYou think its the backup price? How far and worse can this server become. If you notice i pay another server on your System.... for 30$ not only you lie about the 30% permanent discount on ticket 396265, you lie about how to continue the server of my old server. Your support team its a full of liers and unexperienced people I ever seem. You can blame me all you want, I have chats, emails and proof all posted on reddit."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Efren Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T06:46:17.000Z",
          "Titre": "Don't bother hiring bisect, go with any other hosting",
          "Contenu": "I paid for their premium service with a server in brazil and the game was unplayable, long loading times, constant bugs when players died that could only be solved by deleting profiles, VERY slow loading of chunks.Don't bother hiring bisect, go with any other hosting.Edit: It's interesting how they blame the new version of minecraft when other hosting services run smooth as silk with only 2 GB of RAM and a way less powerfull CPU on the same version (1.20.1)And regarding the location ... the problem happened also to a friend located in Argentina, very close to Brazil, I think :)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T02:04:04.000Z",
          "Titre": "Not working as expected",
          "Contenu": "Most of the time we try to join the server would be down or not working properly. Only been able to play two or three times when it did work. Will be canceling my subscription."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Andrey  Vlasoff",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T16:32:11.000Z",
          "Titre": "well for starters",
          "Contenu": "well for starters, my server never popped up in games list, did everything I could to trouble shoot the issues and still got nothing,I asked for help via support team and they didn't help me one bit,2nd of all, I cant even sign back in, iv been through my emails multiple times to change password, but when I go to sign in it says \"sorry but unfortunately the Email & or password doesn't exist please try again\" so another words iv been scammed, cant log in to terminate the transaction, cant play on my own server, help is never there when needed.. wouldn't recommend unless you want to get scammed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cam",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T05:01:04.000Z",
          "Titre": "Spam Emails",
          "Contenu": "Good servers, but expect a lot of spam emails even if you uncheck subscribe to emails. Also sent an email literally begging for a review reading, \"🥺 Only 1% of our customers leave a review.\" They need to review their marketing staff choices and get a grip because this is just sad."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Justin",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T23:56:56.000Z",
          "Titre": "Your 'amazing support team' are garbage…",
          "Contenu": "Your 'amazing support team' are garbage and didn't give a f$%k enough to try to help me and closed my callEdit:They are also lying below. The ticket was closed off the second they replied. It also happened with my second ticket. These guys don't care in any way. My experience so far is they are lazy, a d deceptive liars."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Mikkel Egholm Nissen",
          "Nb_Reviews": 8,
          "Date": "2023-10-08T15:55:25.000Z",
          "Titre": "If you're looking to play VAULTHUNTERS, THEN DONT",
          "Contenu": "If you're looking to play VAULTHUNTERS, THEN DONT RENT A SERVER!however Bisect hosting has SOME good elements through our journey with them...Bisect hosting has an easy setup and has some good elements.We opted for the budget range.since day 1 the has not been stable, and we have written back and forward with support, who answered quickly. 3 tickets an a LOT of massages, test 10 crash reports and log from server side and client side later. They finally go with, \"oh that's a known problem with the modpack\" nothing we can do!SO!if u want to play Vaulthunters with a friend, you can not. it crashes constantly.we have a 10 player server with 3gb's more RAM than recommended by Bisect self for this modpack.and Still its not thair problem.... apparently! so we have been paying for at server that does not run properly for 2 months, in constant correspondence with server support team, an no one had any idea what the problem was, until its just not a problem they can do anything about all of a sudden."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joey Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T13:46:03.000Z",
          "Titre": "Bad Servers",
          "Contenu": "I wanted a refund as the server is not fit to run mods at all, it crashes at the slightest inconvenience or loaded chunk and it is very vague on how to operate the server and manage the mods on it. I wanted a refund but was given help that wasn't very helpful. The support is quick to reply and add the mods for you but are unaware of the issues that occur and don't know how to fix them. I don't think I will be buying from this server hosting program again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erik Grommes",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T02:39:37.000Z",
          "Titre": "Bad experience",
          "Contenu": "The mod pack I wanted to play was bugged on your end. I find it very unprofessional that you wouldn't test this beforehand, control panel is very frustrating to work with and your main site is no better. I switched to akliz hosting and it is a million times better from the start. I cant Believe I spent 20 on this."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Victor Verhoeft",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:29:33.000Z",
          "Titre": "Why do i have to ask you guys to stop…",
          "Contenu": "Why do i have to ask you guys to stop paying I don't want to run my server anymore so please stop de subscription"
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Georgi Kamenov",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T09:29:50.000Z",
          "Titre": "BisectHosting charges additional 4$ to…",
          "Contenu": "BisectHosting charges additional 4$ to setup your modded server's jar after the first time. My server stopped working with the client version of the modpack, which made me update. Turns out it's pretty hard to do on your own."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Akash patel",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T07:13:28.000Z",
          "Titre": "I purchased the 12 gb server on 4/7 and…",
          "Contenu": "I purchased the 12 gb server on 4/7 and had nothing but problems to the point where are me and my friends were constantly changing mod packs to see what would work. The support service was absolutely amazing though they help me through every single problem. But for the fact that I paid $60 just to have all these problems nonstop to the point where it’s not even playable or I had to completely restart, my world is absolutely insane."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Daughtry",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T01:16:25.000Z",
          "Titre": "Had to reset my sever then it wanted my…",
          "Contenu": "Had to reset my sever then it wanted my password which I forgot and I can’t reset it. Plus I’m pretty sure I never made a password bc it’s a public sever"
        },
        {
          "Note": 1,
          "Lieu": "BH",
          "Pseudo": "Abdulrahman",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T09:29:51.000Z",
          "Titre": "server been lagging ever since i bought…",
          "Contenu": "server been lagging ever since i bought it... even thou when i bought it and chose the location i was promised around 90ping. Which is true, IF there are less than 4 people online... once 4 or more people logs at the same  the server start to struggle so hard its not even a joke. i chose for 20 people to be online when i made my plan with you but its been nothing but struggle with lagAnd when i tried to talk with you support team. they shut the server down for several hours for \"reginal fix\" but all they did was despawn all mobs in the discovered regions of the world.really i had nothing but bad time with your service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gavin A",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T09:00:46.000Z",
          "Titre": "Cheap server but frequent problems with the host",
          "Contenu": "The hosting node for the server has gone down 4 times in the last 4 days for at minimum 2 hours each. I can accept a problem or two but the consistency of drops in the new jersey node has made the server unplayable for up to 10 hours"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Calvert",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T03:32:53.000Z",
          "Titre": "They really mean no refunds",
          "Contenu": "Bought a month of hosting 3 days later I get deployed overseas. Bisect said no to a refund even though I never even got the server running. Asked if they could somehow pause my subscription instead and they said no to that too."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tori",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T06:16:00.000Z",
          "Titre": "More trouble than the cost was worth",
          "Contenu": "I'm not sure if it is the modpack we were trying to use through the site or my computer but since purchasing, my friend and I have been unable to connect to play. I have been unable to connect entirely and when my friend attempts it, their game consistently crashes. We have spent upwards of 5 hours over the course of having this server trying to troubleshoot to no avail.This has been a waste of $80 for the last 3 weeks on something we have been unable to use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "micah greuel",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T10:01:28.000Z",
          "Titre": "price is expensive for budget servers",
          "Contenu": "price is expensive for budget servers server connectivity was fine until a week after i got it (now) it consistently times out and cannot sustain a good connection for more than 15 minutes"
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Jorge Munoz",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T04:32:48.000Z",
          "Titre": "Server lag",
          "Contenu": "With a few friends, we paid for a hosting with Better Minecraft mod, but since the beginning the server has a lot of lag. For the amount of money we are paying for a hosting, the service is extremely bad. Not recommended."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Massey",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T03:52:25.000Z",
          "Titre": "First experience with server hosting…",
          "Contenu": "As a first time buying access to a server. It was VERY difficult to get the the console of the server.I had restrictive access to my own server that I have subscribed to.Customer support was unprofessional by answering my questions with another question instead of getting to the point since the question was blatantly obvious.I have set scheduled resets on the server to not reset on times that I’m online.The server I had access with continuously reset on its own at random times.This has made MULTIPLE setbacks on my saves and has ruined my experience with not just the service but also lost my own viewers during my streams since the server was acting bugged."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Kristian Myhre",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T16:05:57.000Z",
          "Titre": "not enougth resources",
          "Contenu": "writing this after ive been renting the server for a month, and therefor my 5 star now changed to 1 star. so when i rent a server ment for a specific game, i allso expect to actually get the resources needed on the server to be able to run that specific game properly. we only 2 players on the server, and havent been doing much at all, not using any mods to increase ram use, and alrdy the server start to crash randomly apparently due to lack of enougt ram. bisectHosting now want us to pay an additional 40% to get needed amount of ram and what they promissed us in the first place. this is somewhere between false advertisment and stright up scam, and not acceptable at all. it dont take them much to incrase it by another gb ram or so on basic package to make sure the game actually runs properly, and wouldent mind pay another dollar a month for it, but apparently thats not an acceptable solution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan Belonga",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T14:39:45.000Z",
          "Titre": "Don’t pass the buck!",
          "Contenu": "I had a server and website login issue and filed a ticket for help.  Couldn’t log into the website but could log into my server control panel.Problem 1. The server was in a loop where it was repeatedly running AutoCompaction over and over again and would kick everyone out of the server.Problem 2.When I contacted support, I was asked to login so they could see my services.  Ok no problem… only I was logged in on my end and informed the customer service rep.  When I attempted to log in again I began to receive odd messages from the server informing me that my email no longer existed in besecthostings records…  I spent all weekend attempting to get this resolved being pasted from one tech to the next emails and live chat until I connected with Brendan G.  This tech not only got the issue resolved, they didn’t pass me off to emails just to get rid of me.  Within about 15 mins the server issue was resolved and the website issues were fixed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T09:48:45.000Z",
          "Titre": "Consider another hosting service.",
          "Contenu": "Minecraft Servers dropped multiple times, connectivity was spotty and laggy despite paying for the premium package and having 16gb with less than 6 players at a time. Customer service was unresponsive to my cancellation and they never reported any downtime despite multiple outages of both the server hosting website and the billing page."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T02:50:20.000Z",
          "Titre": "Less than a month in and spammed with emails...",
          "Contenu": "I have had the server for less than a month and gotten a total of 11 emails I didnt provide my email so you could spam me with requests for me to rate your service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T02:37:55.000Z",
          "Titre": "Told to purchase add-on to fix server breaking bug",
          "Contenu": "The server settings were incorrect (mob spawns were set to off and various other settings were not optimised). Once server was started, a game breaking bug caused by an entity spawning in a protected area (that occurred naturally without player cause) continuously caused the server to crash me restart over and over again without us being able to access it. I asked for the server to be rolled back as players had made significant progress already and support had told us they were unable to fix the issue. Instead, I was told to purchase the backup add-on to restore it to the backup bisecthosting held for the server world.Genuinely disappointed that a ‘bug’ causing the service (server) I purchased to be unusable was met with ‘you need to purchase this add-on otherwise we won’t fix it’."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Vang",
          "Nb_Reviews": 2,
          "Date": "2022-11-26T05:24:03.000Z",
          "Titre": "High Latency servers",
          "Contenu": "High Latency servers, server keeps kicking us out and not letting us back in resulting in us having to restart the server even though there was go crash according to the console. Very laggy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Svain Idland",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T01:58:24.000Z",
          "Titre": "Too much lag with the valheim server…",
          "Contenu": "Too much lag with the valheim server with very few people on. We have less with a crappy gaming laptop I transferred the world to. I won’t be subscribing for this service again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jxy . JxPvP",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T02:35:37.000Z",
          "Titre": "i try to get help but theres always…",
          "Contenu": "i try to get help but theres always something going wrong i paid over $40 for a 5gb ram server that barley works."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T02:41:15.000Z",
          "Titre": "Server broke and endlessly loops",
          "Contenu": "Server broke and endlessly loops when I press start. It starts for around 5-11 seconds then crashes. I cannot find any tutorial on how to totally reset a server"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "emanuel root",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T08:08:11.000Z",
          "Titre": "Website is too complicated I",
          "Contenu": "Website is too complicated I  Naught a server and there is no way to see how to join it, I refunded the server and didnt get my money back it's a scam website"
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Liana Marinina",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T17:04:40.000Z",
          "Titre": "I bought your severe 2 days try to…",
          "Contenu": "I bought your severe 2 days try to solve problems with your Support and nothing happend i still cant play on Zomboid server"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scoutachron.",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T02:56:06.000Z",
          "Titre": "Annyoing to mod",
          "Contenu": "Very poor interface. Also extremely annoying to mod. The tutorials are out of date. And not alot of servers in the northwest."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Damiano Vicidomini",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T17:13:58.000Z",
          "Titre": "bad servers",
          "Contenu": "bad servers, can’t load past a few hundred blocks w/o crashing, lagging, and poor frame rate"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T07:06:36.000Z",
          "Titre": "My server keeps crashing for…",
          "Contenu": "My server keeps crashing for everything. Demon slayer mod which only needs 5GB crashes everytime we fight a boss. Even vanilla Minecraft crashes time to time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sam allen",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:59:06.000Z",
          "Titre": "Server wend down figured it would be…",
          "Contenu": "Server wend down figured it would be back up very quickly. it was not. i wish they could get the server back up a bit quicker."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tz",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T00:41:31.000Z",
          "Titre": "Server keeps crashing. Gotta pay to fix",
          "Contenu": "Bought a server in bisect it worked fine for a little over a week. Was running to a new village an it took a little to load in so i logged out of MY server an logged back in and from that point on i cant get back onto the server. Its like the village is overloading the server trying to load it an everything else at once so everytime i log onto it. It just crashes the entire server. Now its just me and a buddy on the server but still figured id message support team and see what to do. All theyve said is to add a mod to the pack that i already had an tried to use. An then i asked it it could he set back a few hours. Yano just so i wasnt at the village anymore. Well you cant do hours at least not on this server. But all im told back is that id have to pay for a backup and it ranged from 1 day to a few days all different prices. Yes its only a dollar for a backup save but i deadass paid 30 or so for a server for two people.  Not paying anymore if you cant solve something so easy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Baldwin",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T00:41:11.000Z",
          "Titre": "Was mislead by every person I spoke to",
          "Contenu": "Was mislead by every person I spoke to. Paid to much money for the same experience as the cheap option. Not worth. Would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Gonzales",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T12:38:13.000Z",
          "Titre": "I was able to play on the server for one day only",
          "Contenu": "I was able to play on the server for a day before having it crash every single time I try to join it. It's not unplayable and I cannot join the server."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ochochocho snailailailail",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T02:19:39.000Z",
          "Titre": "payment",
          "Contenu": "removed paying to a minecraft server yet it still payed, also nearly impossible and not very clear on how to reach the place to remove payment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ty McDermott",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T21:36:17.000Z",
          "Titre": "Server was unplayable and laggy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Myles Erby",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T01:42:10.000Z",
          "Titre": "Difficult Experience!",
          "Contenu": "Very hard to install mods, couldn't find the version of Pixelmon I needed, complicated GUI, and tutorial didn't explain much."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "sean rumney",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T16:43:41.000Z",
          "Titre": "I feel like I followed all the…",
          "Contenu": "I feel like I followed all the instructions to modding and changing settings to my space engineers server, and I still can’t figure it out to the point where at the time I am currently paying for a server that I don’t even attempt to use because it just doesn’t work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grosswolf",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T04:24:22.000Z",
          "Titre": "It was awful switching minecraft mods…",
          "Contenu": "It was awful switching minecraft mods was bad it would crash the server to the point I canceled it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "javeon mccain",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T00:36:40.000Z",
          "Titre": "I couldn’t use the server it’s was a…",
          "Contenu": "I couldn’t use the server it’s was a horrible experience"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Callan Faulks",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T08:52:13.000Z",
          "Titre": "servers so laggy idk what premium…",
          "Contenu": "servers so laggy idk what premium servers on bought because this sure aint premium"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Enda Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:54:15.000Z",
          "Titre": "I went on support to get help on an…",
          "Contenu": "I went on support to get help on an issue and the support guy helped me corrupt my world :)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jace hunter",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T02:31:13.000Z",
          "Titre": "I have been wanting a refund and you…",
          "Contenu": "I have been wanting a refund and you guys won’t refund me and you keep charging me"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Amadeus",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T09:30:05.000Z",
          "Titre": "did not even manage to load the mods or…",
          "Contenu": "did not even manage to load the mods or start server."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "gabriel alberto penagos rodrig",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T16:35:47.000Z",
          "Titre": "32 gb server with 8 players, unplayable.",
          "Contenu": "Im paying an expensive 32 GB server for 8 players 95 USD, the game is unplayable either because the lag or because the server crashes every 5 min.worst server this year for me. im going back to shockbyte, their customer service is trash but at least the server worked there.UPdate: afeter doing some testing i discovered that I was paying for a 32 gig server and they were giving me only 16........ wow."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Harry",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T20:25:44.000Z",
          "Titre": "Waste of money",
          "Contenu": "I wasn't able to change minecraft version. 100% would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyrin Vice",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T03:35:08.000Z",
          "Titre": "Just a horrible greedy website",
          "Contenu": "Just a horrible greedy website, doesn't work that well and is an extreme mess to set up"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Niklas Naumzik",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T12:24:45.000Z",
          "Titre": "my sever goes offline after 7 days and…",
          "Contenu": "my sever goes offline after 7 days and i cant chainge it and cant logg in into the support side"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Teneisha Arnold",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T21:09:15.000Z",
          "Titre": "Extreme Lag",
          "Contenu": "Extreme Lag. It takes a full 1 minute for a chest to open and cannot go outside of already rendered distance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David West",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T09:03:19.000Z",
          "Titre": "displeased",
          "Contenu": "very annoying to navigate interface with little to no tutorials to help new customers, after the free trial it was very confusing to have to manually set up my server with mods for me and my friends."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T04:32:48.000Z",
          "Titre": "I already wrote a review/survey",
          "Contenu": "I already wrote a review/survey. So kinda janky i get a 2nd. Perhaps replace the automated bot messages with component people? My purchase experience?? I was robbed, the sever worked half the time with the mere several days i had it, and now refund because 3 days is enough time to gauge temhe service as a whole?"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Joakim Bjørneng",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T01:18:13.000Z",
          "Titre": "Hello,",
          "Contenu": "Hello,The server was constantly getting Tick issues so was lagging alot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pyromancer",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T05:49:17.000Z",
          "Titre": "NONE!!",
          "Contenu": "NONE!!! of the videos from the response coverd the biggest problem I had ...........NOTE ..how I fixed it ..... logged out and back in a few times tell the infinite buffer was gone"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "qamarul jeffry",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T13:09:22.000Z",
          "Titre": "unable to start server due to rcon",
          "Contenu": "unable to start server due to rcon not being able to start"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T17:21:40.000Z",
          "Titre": "Vault Hunters Unplayable and Confusing Interface",
          "Contenu": "I had several issues playing Vault Hunters 1.16. The worst one was entering a vault, getting kicked for flying. After relogging I'd end up on the roof without being able to ever leave or enter a different vault. Iskall85 had promoted Bisecthosting and I know that they are planning to sponsor the dev team for Vault Hunters 1.18. I only hope that for their sake they make it so that it's playable. The second reason for the one star is the user interface for switching instances is confusing and complicated. I was only abler to successfully switch instances once without my vanilla world bugging out by forgetting userdata."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nicolas Michaud",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T01:50:24.000Z",
          "Titre": "i can't get my server to work",
          "Contenu": "i can't get my server to work, i haven't yet been able to play on it"
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Evelina Sudikaite",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:17:34.000Z",
          "Titre": "Billing",
          "Contenu": "Its too hard to cancel your service ive been at it for the past 3 months"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Fritz McCool",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T15:04:31.000Z",
          "Titre": "can't unsubscribe",
          "Contenu": "can't unsubscribe, can't even change password that's nice."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "bruh",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T23:37:05.000Z",
          "Titre": "Connection was horrible with two of us…",
          "Contenu": "Connection was horrible with two of us on server"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Soumodeep  Bhowmik",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T18:06:35.000Z",
          "Titre": "Not legitimate traffic! Its not a Creators Fault!",
          "Contenu": "I am a Creator, I Started the Partnership at 10/13/2022.A really common thing we all Creators have is haters. Some random hater set up a bot on my Partner's link and they somehow got 92k clicks within a month. This is something that we Creators can't control and can happen to anyone. I myself chose Bisect Hosting because I believe they provide the best service. I am disappointed, if it was some other random service I wouldn't have cared about it! I was so excited to work with Bisect Hosting. But I couldn't and I blame it all on haters! Also, Bisect Hosting should do something about this!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ethan garrett",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T04:11:43.000Z",
          "Titre": "Couldn’t start server I want my money…",
          "Contenu": "Couldn’t start server I want my money back and to stop the server I boght this is ethan garrett"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael jones",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T17:46:59.000Z",
          "Titre": "Y’all won’t let me cancel and your…",
          "Contenu": "Y’all won’t let me cancel and your servers don’t work"
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T17:33:51.000Z",
          "Titre": "The server close when i do cright click…",
          "Contenu": "The server close when i do cright click and all changes i want to make is with money... they want money for a hosting with bugs...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N/A",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T04:24:34.000Z",
          "Titre": "Says incorrect login information when I…",
          "Contenu": "Says incorrect login information when I try to cancel my server subscription."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Candice Powers-Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T04:52:23.000Z",
          "Titre": "Server was too laggy"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Arian Rexhepi",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T18:39:42.000Z",
          "Titre": "every time i have to change my passwort…",
          "Contenu": "every time i have to change my passwort and the bills to high"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "al",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T22:28:16.000Z",
          "Titre": "constant lag and players struggled to…",
          "Contenu": "constant lag and players struggled to join"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Juan Ignacio Hernandez Gunning",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T10:19:33.000Z",
          "Titre": "Terrible lag",
          "Contenu": "Terrible lag, unplayable, I want a refund please"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Tillman Eichhorn",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T12:58:19.000Z",
          "Titre": "Everything is Bad on this Kinda thing",
          "Contenu": "Everything is Bad on this Kinda thing, i try to delete my server and it doesnt work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "simon stine",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:01:03.000Z",
          "Titre": "Just about everything i ended up…",
          "Contenu": "Just about everything i ended up switchimg services"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T19:35:10.000Z",
          "Titre": "Never got it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Rolfs",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T13:48:09.000Z",
          "Titre": "Miserable and still not able to add my…",
          "Contenu": "Miserable and still not able to add my own modpack i made."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth  Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T03:31:05.000Z",
          "Titre": "I Dont Want it anymore",
          "Contenu": "I tried to cancel the server and its still going"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T21:43:19.000Z",
          "Titre": "Support so bad it seems fraudulent."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Ole Mathias Børtinghus",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T17:32:47.000Z",
          "Titre": "everything was laggy",
          "Contenu": "everything was laggy, even when i paid more just so it wouldn't. i would like a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cameron Hattendorf",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T04:45:07.000Z",
          "Titre": "F*** you guys",
          "Contenu": "F*** you guys.  Never used the server and no refund. Waste of time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T03:31:29.000Z",
          "Titre": "Stop paywalling the modpack jar swapper"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seth Koch",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T01:44:38.000Z",
          "Titre": "The server wqs super laggy"
        },
        {
          "Note": 1,
          "Lieu": "PS",
          "Pseudo": "faris alshamas",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T02:32:55.000Z",
          "Titre": "I cancelled the rental but i don't get…",
          "Contenu": "I cancelled the rental but i don't get my money back 😔😔"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Devin",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T05:10:29.000Z",
          "Titre": "my world just keeps crashing and i only…",
          "Contenu": "my world just keeps crashing and i only play me and 1 other"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brendan last",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T08:19:05.000Z",
          "Titre": "all my progress was deleted"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jack Dodd",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T02:57:00.000Z",
          "Titre": "Server Crashing Issue",
          "Contenu": "The server is constantly crashing and resetting small amounts of progress."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "alex patton",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T00:32:34.000Z",
          "Titre": "Literally will not let me cancel my…",
          "Contenu": "Literally will not let me cancel my subscription"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erick Cruz",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T18:09:55.000Z",
          "Titre": "There were many problems with my sever, and not much help to back me up.",
          "Contenu": "There were many problems with my server, and not much information on how to fix specific problems, I always have to create a support ticket, and those always take a while to get answered. The support tickets are really hit or miss, sometimes they help and fix problems, or they simply do nothing for the server and just give useless information."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Felix",
          "Nb_Reviews": 4,
          "Date": "2022-06-25T00:16:41.000Z",
          "Titre": "????",
          "Contenu": "Everything was looking good, until I tried to pay.When it came to paying I got a 'fraud check' Interesting. I opened a ticket, thinking it would be an easy fix, they want EVERYTHING from you. goverment issued id, proof of address, utility bill, everything. To host a minecraft server. Oh my.EDIT: found a way better hosting service anyway. Use g portal for anyone else reading this!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin Popiel",
          "Nb_Reviews": 2,
          "Date": "2022-07-04T23:05:35.000Z",
          "Titre": "Only server hosting that was very laggy…",
          "Contenu": "Only server hosting that was very laggy for me and my group. I’ve used a few different hosts, but I wanted to try this one for once. I paid around $30 with 50% off my first order yet the servers I pay $10 for run better. I do not recommend this hosting; However, their support team is awesome and responds very quickly."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kurt Galea",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T04:38:57.000Z",
          "Titre": "my server wouldnt load even after…",
          "Contenu": "my server wouldnt load even after requesting a ticket nothing fixed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T20:04:01.000Z",
          "Titre": "Got locked out of my account",
          "Contenu": "Got locked out of my account, and there's a 2FA question that I haven't even put on there, so can't get back in. Emailed them and no response, so getting stung for something I don't even play any more. Getting charged too much a month to let it keep running without me playing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Caitlan  Halvorson",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T21:14:43.000Z",
          "Titre": "Disappointed",
          "Contenu": "At the beginning the week I had a great review to give because Timothy had listened to my financial concerns and moved a payment date for me. However. A few days later and the moved date did not go thru. So I had to apply for a refund because a mistake was made. I also was not told at the time (with Timothy) that my service would be suspended til the new pay date. A small oversight to Bisect maybe but a huge disappointment to me. I feel a little less cared about right now which isn’t great due to a lot of other things going on. So sadly I need to drop a few stars from my once happy review. Hopefully in the future their agents will remember to give all the info upfront."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frederick Bulmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:53:28.000Z",
          "Titre": "There are some lag Lagggspikes happening in…",
          "Contenu": "There are some lag spikes happening in the game causing myself and my friends to be killed unnecessarily. It is a huge pain to have to deal with this and makes the game unfun to play."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed Brown",
          "Nb_Reviews": 6,
          "Date": "2023-12-11T03:47:32.000Z",
          "Titre": "Instant installation, Terrible servers or connections...",
          "Contenu": "Instant installation, well done. Playing on a server with 2 players that lagged the server so bad it became unplayable. 2 players? Really? Come on... This happened on several occasions and several different days. Terrible servers or connections..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "a-l",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T13:32:07.000Z",
          "Titre": "The prices for a basic Minecraft server…",
          "Contenu": "The prices for a basic Minecraft server with absolutely no add-ons just to play the game is kinda dumb. Bought a $40 used office pc on Facebook and am running a 400+ modded server off it with zero issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Demczyszyn",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T03:58:13.000Z",
          "Titre": "Server lags and constantly needs to be…",
          "Contenu": "Server lags and constantly needs to be restarted. Has nothing to do with players online, only players that have logged in has been 2. Vanilla with 1gb, bare minimum shouldnt lag, at all"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raymond Bostock",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T03:35:35.000Z",
          "Titre": "The customer service is 5/5, the servers are not.",
          "Contenu": "The customer service is 5/5, but the actual servers and reliability of said servers is truthfully terrible. I've had nothing but issues with my Minecraft server, and don't really think I'm going to recommend anyone else use Bisect for server hosting because of this. I understand I'm only paying for a budget server, but for the past 4-5 days my server's had constant connectivity issues, and have even had my progress wiped. It's frustrating, but the people I've worked with trying to figure the constant issues out have been incredible."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Pg",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T19:34:23.000Z",
          "Titre": "Bad ping",
          "Contenu": "I chose the server closest to my location with thr lowest ping which was 18 ms but playing in the server it was always around 70ms which made the game constantly laggy. When i logged off the game the server did not save my proggress properly and this happened almost every time it was annoying as hell."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Coopr",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T06:33:43.000Z",
          "Titre": "Laggy overloaded servers constantly but staff friendly",
          "Contenu": "Bought a server and was set up pretty quickly. UI was easy to figure out and the modpack setup is helpful. But the actual hosting side of things is very hit and miss (most miss in my case). Servers could barely handle 3 players even though I bought the recommended package. Credit where its due the support staff were friendly and helpful but felt like going in circles with trying to fix the lag and most 'fixes' didn't really solve much. The lag got so bad and I got tired of asking for help so our interest faded and we've stopped playing."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "ZacharyLevi",
          "Nb_Reviews": 1,
          "Date": "2014-05-10T14:19:57.000Z",
          "Titre": "Cheap minecraft server hosting Services in Uk",
          "Contenu": "ProMinecraftHost.com provides quality and cheap Minecraft server hosting with premium features starting at $5.99 per month.Don't pay extra for premium features, go with Pro Minecraft host and get fastest servers and quickest support so that you see zero to very little downtime."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kody spencer",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T02:44:50.000Z",
          "Titre": "The server was unplayable",
          "Contenu": "The server was unplayable. I bought a 6gb server and when I upgraded from the 4 to the 6 the customer service was great but the server itself was extremely laggy. Dawncraft with 4 people was far from playable as the server would crash or lag out all the time. One of the service reps tried to adjust some settings to make it play better but it still didn't work. The customer service was great and the pricing would be pretty good if the product worked how I wanted it to."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dai",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T14:31:17.000Z",
          "Titre": "Read Between the Lines…",
          "Contenu": "We weren’t informed there was a price to set up fabric and so we had to move to a custom profile. Of course, it shut down our server during a large event and we spent hours fixing it. It kept telling us the .jar files were “missing”. One of my admins had to work extremely hard to fix the program. Will be switching to a different host when my subscription ends."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dominic Pagano",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T05:20:23.000Z",
          "Titre": "Minecraft server was lagging",
          "Contenu": "Minecraft server was lagging constantly no matter which mod pack we ran. And support wasn’t very helpful unless I paid for more stuff which is just toxic capitalism"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Yarin Agami",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T13:40:43.000Z",
          "Titre": "so many things went wrong to the point…",
          "Contenu": "so many things went wrong to the point of me thinking of just shutting down my server. it hasnt even been a whole month and i already had a few days of just server crashes and lags because of server issues. luckily your customer support is pretty good so well done on that."
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "MSKDx",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T02:33:54.000Z",
          "Titre": "Lag, crashes and unplayability",
          "Contenu": "The server is laggy and easily crashes in the act of players joining and loading chunks. It is really annoying to the point of the server being unplayable, I demand a refund of some sort and the issue fixed, I feel scammed as I could get this or better experience from a free server host"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D. Nash",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T03:23:38.000Z",
          "Titre": "Too many crashes…",
          "Contenu": "Purchased a \"Premium Server\" for Minecraft. It had a supposed 8GB RAM and was only played by a Max of five people at any given time. Within two days of playing, it crashed, resetting our world, and we lost all our progress. I tried the \"auto restore\" point to get back all of our data (The only data that should have been there); Lost. The next day on our new world it crashed twice and was accelerating in intervals of how frequent it crashed. I contacted support to see what was going on with the server. Was told it was a \"chunk tick\" issue, that it was processing too much data and was causing it to crash repeatedly. I was then informed that the support agent was going to max the limit to see if it stopped the crashing; it did not. After the third crash I contacted support again. This time they wanted to try to restore my initial world that was \"saved\" when I started the game. Still no luck and more crashing. I decided to give up and cancel my subscription to look elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sk",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T15:07:48.000Z",
          "Titre": "Great support fir a not so great servic",
          "Contenu": "Really honestly rough site lay out. You have to reach out to support a ton. Positive is support team is great and really fast to respond. However I had an easier experience with apex."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike K",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T02:47:32.000Z",
          "Titre": "not the most effective server",
          "Contenu": "The support staff is responsive but has been unable to resolve TPS issues on my server.  Still working through the issues and would expect that the more expensive server hosting option would be a little smoother"
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Rasmus Alkestrup Eskesen",
          "Nb_Reviews": 33,
          "Date": "2023-02-04T16:06:59.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience. Setting up the server with mods was very confusing and the support pages were completely useless, describing stuff that was not on the page etc. When experiencing a bit of lag we decided to use another provider but figuring out how to properly cancel my subscription was also far from intuitive and I was worried if I had even done it correctly at the end - parts of the experience honestly felt a bit like a scam. Asking the support in chat just linked to the useless support pages all the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "evan punter",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T02:34:09.000Z",
          "Titre": "Server is constantly lagging and…",
          "Contenu": "Server is constantly lagging and randomly crashes.says it capable of 40 people but struggles with 3.it randomly runs smoothly then drops frames to 0 every 5 seconds."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Olson",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T05:38:16.000Z",
          "Titre": "1gb was not anywhere enough",
          "Contenu": "1gb was not anywhere enough for the 3 player terraria server. This is probably not your fault you provided what was promised but I'm still not pleased."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "gavin guerrero Jizz Clan",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T18:32:41.000Z",
          "Titre": "I’m only putting 2 stars because when I…",
          "Contenu": "I’m only putting 2 stars because when I bought the server I tired playing on it but it shut down when ever I tried to play and I maybe I’m just not intelligent enough to figure it out and my passwords don’t work anymore for trying to log in."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Antonyo Kay",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T19:26:30.000Z",
          "Titre": "the idea of being able to change…",
          "Contenu": "the idea of being able to change modpacks only for 5 days is insane to me, and another way to grab money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "keith martin",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T06:09:52.000Z",
          "Titre": "went to long in couldnt log in changed…",
          "Contenu": "went to long in couldnt log in changed password went to long it said password was wrong got locked out of account"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Client",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T10:18:04.000Z",
          "Titre": "I got a lot of crash server",
          "Contenu": "I got a lot of crash server and i dont know where this come from but i have followed all the requirement and tips send by bisec so i dont get it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Colin",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T17:37:48.000Z",
          "Titre": "I have zero problems with the services…",
          "Contenu": "I have zero problems with the services provided. They're fantastic...One and ONLY problem is trying to force me to give a review / let them know how they are doing...If you're NOT doing a good job, or there is a problem, people will tell you by making a ticket...NEVER push for a review because as you can see by this one, you get a LOT less \"stars\" than you would if you didn't keep asking folks to give a review..."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "joshua harms",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T21:33:08.000Z",
          "Titre": "i could pick a mod pack and i only had…",
          "Contenu": "i could pick a mod pack and i only had a 5 ram server could have marked in the first place that i needet a 8 ram server server just woulnt load"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Christopher Hinz",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T12:36:50.000Z",
          "Titre": "Servers are overloaded",
          "Contenu": "When the Server runs everything is wokring fine. But the Server has a Problem to stay Online for over 5 minutes so every 5 minutes or so the server restarts and we can play another 5 minutes. Thats a huge flaw and i hope you can work on that."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Lee Fall",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T05:22:27.000Z",
          "Titre": "Not great",
          "Contenu": "Linux Rust server not Window, lags and hitches for all users even if in the same state as the server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Noah",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T04:09:06.000Z",
          "Titre": "Very laggy",
          "Contenu": "Very laggy, doubled the recommended RAM. And runs worse then a realm at several times the cost."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ethan Ratz",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T02:53:23.000Z",
          "Titre": "Make sure save files are actually…",
          "Contenu": "Make sure save files are actually backed up. First modpack wiped every time server stopped"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tyler Kapolnek",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T02:31:40.000Z",
          "Titre": "Servers are extremely laggy",
          "Contenu": "Servers are extremely laggy, quite disappointing considering the price. Not sure if I’d recommend these servers to anyone else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KCS",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T04:18:49.000Z",
          "Titre": "Despite pouring 12-14 gigs into a…",
          "Contenu": "Despite pouring 12-14 gigs into a modded server, it still lags for everyone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jaxon Vaughn",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T00:37:16.000Z",
          "Titre": "You wont cancel my server",
          "Contenu": "You wont cancel my server. I'm Trying to cancel and if you dont let me the farther the review will go down."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Creacy",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T07:19:47.000Z",
          "Titre": "On the server page it said recommended…",
          "Contenu": "On the server page it said recommended 8 gigs I upgraded my server and it's still lagging"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Deni Tomic",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T22:21:53.000Z",
          "Titre": "Server lagging for everybody when…",
          "Contenu": "Server lagging for everybody when someone is traveling alone at high speed loading new chunks. Wish this coul be solved."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ethan Baker",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T03:49:08.000Z",
          "Titre": "Mid.",
          "Contenu": "I purchased a server above the recommended ram to purchase, and the server was still incredibly laggy. You could be online alone and the server would time out randomly, time out constantly. Basically I got much less than I paid for and would not recommend this service. The only reason I am leaving a 2 star review is because their customer support responded very fast and the modpack we played on the server was also quite fun."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:20:03.000Z",
          "Titre": "server crashes all the time",
          "Contenu": "server crashes all the time, friend cannot join"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roy Easley",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T04:06:02.000Z",
          "Titre": "The server shut down on us like 4 times…",
          "Contenu": "The server shut down on us like 4 times within 10 days. They sead a node was bad. It's not fixed yet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "anson brown",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T07:29:36.000Z",
          "Titre": "My server is super laggy right now I…",
          "Contenu": "My server is super laggy right now I don’t know why , it has enough ram"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tyler Jaramillo",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T03:49:22.000Z",
          "Titre": "Find a better option",
          "Contenu": "For the price paid, Bisect offers less features and more complications than other hosting services."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christian Honaker",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T04:18:21.000Z",
          "Titre": "My server constantly crashes",
          "Contenu": "My server constantly crashes. Unplayable half the time."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Kaen Parker",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T17:20:57.000Z",
          "Titre": "below average service",
          "Contenu": "below average service, constant crashing and permanently lagging, would not use again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "braydon collins",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T05:27:08.000Z",
          "Titre": "Extremely laggy when more than 2-3…",
          "Contenu": "Extremely laggy when more than 2-3 people are online"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Avery Whiteaker",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T05:05:50.000Z",
          "Titre": "The server lags a lot when we are…",
          "Contenu": "The server lags a lot when we are loading new chunks."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mee",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T21:57:34.000Z",
          "Titre": "Bro ur ticket things aren’t useful"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Justin Klassen",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T03:46:20.000Z",
          "Titre": "Sever closer by me",
          "Contenu": "Sever closer by me. Sometimes no one can connect"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jake Myers",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T21:19:32.000Z",
          "Titre": "Basics",
          "Contenu": "I couldn’t figure out how to do basic things like play with my friend. This is all very very very new to me and wanted to play modded Minecraft and I struggled. Even now I want to change the mod pack but I have no idea how"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Fedoriw",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T01:16:57.000Z",
          "Titre": "Server is very unreliable and kicks…",
          "Contenu": "Server is very unreliable and kicks people randomly and requires to be restarted several times a day for no known reason. The admin interface is pretty easy to use and intuitive though and for being a relatively low priced server option I guess it’s not terrible."
        },
        {
          "Note": 2,
          "Lieu": "SI",
          "Pseudo": "Jure Hribar",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T19:19:29.000Z",
          "Titre": "Terrible server preformance",
          "Contenu": "Terrible server preformance, confusing payment process, unreliable server connection. But at least it's sometimes playable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dawn Evans",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T15:23:17.000Z",
          "Titre": "Purchase and setup was very user…",
          "Contenu": "Purchase and setup was very user friendly, but the server experience itself had been awful. It crashes constantly and we spend more time waiting to get back in than actually playing. There are only 2 users so there is no overload of players. It is very disappointing and frustrating."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Bearattaq",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T12:49:24.000Z",
          "Titre": "Review",
          "Contenu": "ReviewThe server itself worked like a charm, but i find it pretty disgusting that you would put the server on auto renew without warning and without me selecting that i would want auto renew. And at the same time you made it as difficult as possible to turn this off since you have no actual setting for this instead i had to go to my Paypal settings and remove you as a active website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2022-05-22T19:07:46.000Z",
          "Titre": "The server was easy to set up and use, but full of lag.",
          "Contenu": "The server was easy to set up and use, but my friends and I experience constant lag so far with the server. It seemed like there was a lag spike every couple minutes and it was really frustrating. Pretty disappointing since I opted for the premium package for the server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Entombed",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T03:31:28.000Z",
          "Titre": "It’s incredibly difficult to add mods…",
          "Contenu": "It’s incredibly difficult to put mods on a server. We spent 5 and a half hours trying to put a few mods on the server. I was hoping it would be a little easier speaking that I’m paying for this but normal servers are fine."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Logan Hill",
          "Nb_Reviews": 3,
          "Date": "2022-01-21T04:41:25.000Z",
          "Titre": "There were a few issues in renting the…",
          "Contenu": "There were a few issues in renting the second server as the interface seemed to break stating I already had an account which I already knew i had but couldn't buy the second server with out navigating from the purchase screen to my account then back in order to detect it as a new order from the account I was logged in with."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "catherine Jocelyn killers cats",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T22:12:54.000Z",
          "Titre": "Bad servers",
          "Contenu": "Bad servers. Barely ran."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremias",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T02:48:35.000Z",
          "Titre": "Poor Expectation Management",
          "Contenu": "We started up a modded minecraft server for up to 10 players with 7GB of ram. We started noticing poor performance and opted to upgrade to 12GB but have seen worse performance. Multicraft page showed we were using upwards to 80% of ram and less than 10% CPU before upgrade and around 40% of ram after upgrade. Support has explained this is due to a Minecraft update but failed to explain why an upgrade has not resulted in any improvements. Feels like we're being throttled down to our original 7GB package."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Christoph Schwarzinger",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T19:18:14.000Z",
          "Titre": "Tried to get a server with RLCRAFT…",
          "Contenu": "Tried to get a server with RLCRAFT going, recommended is 4GB RAM from your site and the modpack creator. I got 6GB plan to be safe, game is not playable. Server falls behind hundreds if not thousands of milliseconds. No matter what I do. Even when I am alone on the server it constantly tells me the server is overloaded. Which I do not get quite frankly. With 6-8GB ram I can host a 10-20 player LAN session on my laptop without any lags ever.There is no fix to be found on the internet. If you could fix this issue for me then I will definitely change my rating. It would be otherwise 5 stars. A bit more expensive but very clean UI and friendly people etc. But the game that I wanted to play does not work."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Osiel",
          "Nb_Reviews": 4,
          "Date": "2022-07-27T19:07:57.000Z",
          "Titre": "The service is ok but the servers are…",
          "Contenu": "The service is ok but the servers are not very powerful, I have tried a mod pack with 170 mods, 10GB of ram and it is lag with 4 players without having explored more than 3 thousand blocks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aj Hutch",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T18:57:47.000Z",
          "Titre": "EVERYTHING",
          "Contenu": "Haveing alot of trouble with the stability of the server, and there is only three of us. i have no way to alter map settings, to play the modpack the way we want. i cant change the seed for a better one, i have to change the name and HOPE a good name has a good seed."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "michael frazer",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T03:28:03.000Z",
          "Titre": "A few problems",
          "Contenu": "I recently rented one of your servers for me and some friends. Several times so far the server has closed, crashed or had problems with its connectivity to us. I expected better as this provider was recommended by the modpack we are using and the price I am paying for this premium server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Wheeler",
          "Nb_Reviews": 2,
          "Date": "2021-09-07T15:08:26.000Z",
          "Titre": "Server Performance",
          "Contenu": "Came down to poor server performance. For the package I was on, I expected a higher quality server. MSPT would sky rocket when a second player/bot joined the server. Was also unable to run a smaller world eater without the server crashing. There also wasn't any information about the server specifications outside of allocated ram."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Michael Calvert",
          "Nb_Reviews": 1,
          "Date": "2021-04-25T01:01:50.000Z",
          "Titre": "Server modding failures.",
          "Contenu": "Server modding failures.I asked about 3 times on how modding this server works and I get the same cut and paste reply every time.I know how to read.I read the instructions and it is still not clear. I told your representative at the time and got the same copy paste reply.Clearly don't care. Otherwise would have actually listened to my question instead of assuming everyone is as familiar or tech-savvy as they are."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "Zeadz",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T02:02:31.000Z",
          "Titre": "There seems to be a problem. (Valheim)",
          "Contenu": "There seems to be a problem with the server for Valheim(modded).Here's what I and my friends encountered.1. Monsters or bosses somehow became invisible to most of the players. (All of my friends have considerably high-end PCs, so it's not because of us.)2. We can't pick up the items dropped on the ground. (need to wait for about 2-3 minutes)3. Grave can't be seen or interacted with. (again, we have to wait for 2-3 minutes)P.S. There are none of these problems when we host the server ourselves.P.S.2 Anything besides this is FINE."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christian Joyner",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T03:33:27.000Z",
          "Titre": "Server is currently offline",
          "Contenu": "Server is currently offline. Was hoping for assistance, got generic fix. Server is unavailable as far as I can tell. Still paying for server. Will probably cancel as of next week. Hopefully this isn't a public review board because the server setup was easy and simple and when it worked it worked well. Minimal lag. Otherwise I hope that you all can provide better service in the future. Thanks!"
        },
        {
          "Note": 2,
          "Lieu": "MY",
          "Pseudo": "Adrian Lim",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T01:40:37.000Z",
          "Titre": "Unable to connect.",
          "Contenu": "Unable to connect.Unfortunately for the Valheim servers the port requires to be based on the manual, otherwise there will be issues in terms of seeing the servers in the server list and also my friends couldn't connect if it wasn't the standard port.Unfortunately due to this I couldn't use bisect hosting for the Valheim hosting and instead set up our own server and unblocked the relevant ports and we could all connect."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Camila C. Duque",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T14:46:29.000Z",
          "Titre": "I'm a little disappointed...",
          "Contenu": "I already talked to the staff about this, but it charges me more than what I had to pay. The email they sent me said that I could cancel the order, but the tutorial for the cancelation didn't work for me. I'm not saying the whole website is bad because the staff try and make sure I have the best experience with what I purchased, but I'm a little disappointed with what I received from the purchase."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tim Funk",
          "Nb_Reviews": 3,
          "Date": "2021-03-05T03:52:59.000Z",
          "Titre": "I got a server that had 5gb of RAM for…",
          "Contenu": "I got a server that had 5gb of RAM for up to 5 players. However even when online alone there was extreme server lag when just cutting trees when the leaves despawned/broke. I couldn't imagine how laggy or worse it would become once we started introducing machines and automation that would draw more RAM. Dont recommend unless maybe you pay for even more RAM to play."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Salata",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T22:03:16.000Z",
          "Titre": "Questionable",
          "Contenu": "Asked for a refund when my server was constantly crashing and restarting on the first day of playing it, now two weeks later they're telling me the refund is out of the time window for one when I never received it. Their customer service has been great at attempting to trouble shoot the issue, though a friend of mine had purchased another server through a different company that we have been using relatively crash and lag free with the same options since I initially rented a server through bisect hosting. I just wanted a refund was all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Caleb Hendrickson",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T04:42:38.000Z",
          "Titre": "The server is lacking",
          "Contenu": "The server I bought is lacking even though I'm paying for 8 gbs of ram the server is constantly behind on memory and skipping ticks so it has to be reset every now and then and that still doesn't fix it I keep going up in ram and nothing fixes it there is only two people at most on it and even when its running by itself it still is behind on ticks until it restarts automatically but it doesn't catch up."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Hime_dere",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T01:13:55.000Z",
          "Titre": "Server Review",
          "Contenu": "This will be a short review. I liked the installation of the Modpack. It was easy and quick however the Server seems to crash quiet often even though I have above the recommended amount of Memory."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Lachlan",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T21:31:54.000Z",
          "Titre": "We’re having issues all the time with…lag",
          "Contenu": "We’re having issues all the time with server lag even running a more basic mod pack. The dedicated cpu cores seem to still struggle on just generating chunks or loading player data. All around still a much worse experience then self hosting for performance"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2021-06-11T05:03:22.000Z",
          "Titre": "We ran into a issue where my friends…",
          "Contenu": "We ran into a issue where my friends and I couldn't connect but was due to our error. Now a week later we've been having issues trying to login. The server lags more even though it's based in LA and we're in Nevada. The server doesn't want to stop after 5 minutes so if I want to shut off the server to update or just so we can login I have to kill the server. Running our own server seemed to have less issues. These are issues that i shouldn't even be running into for $30 a month I believe."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T02:13:50.000Z",
          "Titre": "Poor performance with mods",
          "Contenu": "Hosting a nodded server with less than 10 friends. Server has difficult time keeping up with just one of us online, crashes occasionally when multiple of us are on. Server panel is nice, but I wouldn't recommend listening to the recommended ram it tells you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stanley Kovach",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T00:12:04.558Z",
          "Titre": "I asked for help with a specific…",
          "Contenu": "I asked for help with a specific situation and all I got was an email saying you were aware of the issue and working on it. There was no “communication” with a support staff member. I checked the server to see if it was fixed to find out that it was. No one told me. No one even acknowledged the issue I was having. Just, “ we’re aware” like an automated response. Nothing  else. The server host I left for this one, though they could not resolve the issue they were having, at least had great customer service so I am a bit let down by Bisect. Now I am having trouble with the server constantly kicking players off and not sure I want to ask for help if the response will be so generic and  insincere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 2,
          "Date": "2022-04-26T02:40:44.449Z",
          "Titre": "Low power, rough interface = unhappy customer.",
          "Contenu": "The prices aren't terrible and I got a good deal to get started.My issues did not become apparent until after the refund policy ended unfortunately.  The power of the servers leaves much to be desired.  Lag has been pretty common, the server interface is not to my liking.  I have no idea how much memory is being used, or what's taxing the server behind the scenes other then what the console tells me.  Use the plugins, if you don't have much experience with plugins you're out of luck, because again, the interface is not intuitive.  This coming from a server admin who worked on the game and store side verses the plugins.  I won't be returning when my time runs out for the month."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Vincent Rupert Johnston - Fors",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T00:38:05.000Z",
          "Titre": "Give me a minute...",
          "Contenu": "Hello my name is Modded Bisect Server I've come to Lags anonymous, I would like to thank Internet explorer for inviting me today. I have a small  set of mods about 60-70 yet doing anything can take anywhere up to 5 minutes, plus my users get kicked because my tps is so bad."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Esteban Durazo",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T21:57:56.000Z",
          "Titre": "The entire platform seems very…",
          "Contenu": "The entire platform seems very over-engineered... I had a very hard time figuring out how to begin the hosting of my minecraft server even after I purchased the membership and I'm a software engineer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dakota Allen",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T10:25:25.000Z",
          "Titre": "the servers are actually decently laggy…",
          "Contenu": "the servers are actually decently laggy and i couldnt play on a server of me and one friend without him getting DC'd or lagging like crazy, and boy when i brought in 2 friends for a total of 3 whole people i we couldnt walk in a minecraft server without getting rubber banded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Jones",
          "Nb_Reviews": 1,
          "Date": "2022-06-23T19:38:44.000Z",
          "Titre": "Poor performance",
          "Contenu": "Every Bisect server I’ve been on has suffered from tps issues. Issues that I haven’t had using digital ocean or apex hosting. And the bundled upcharge for a west coast server is lame."
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "Tycjan",
          "Nb_Reviews": 1,
          "Date": "2019-02-23T11:00:16.000Z",
          "Titre": "I do not recommend this hosting",
          "Contenu": "I do not recommend this hosting, i had to pick out a hosting which accepted paysafecard as payment so i checked the reviews about BisectHosting and they were pretty decent. I bought a premium server for 16$, with 5 players on the server it was unplayable. The tps was dropping to as low as 15 and the ping was dreadful also. I was running a spigot server with only 1 plugin."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ilir Demi",
          "Nb_Reviews": 1,
          "Date": "2021-08-22T19:07:15.000Z",
          "Titre": "Subpar, did not meet expectations",
          "Contenu": "My experience with the server was a multitude of crashes caused by players just playing the game as intended. As well as constant freezing even when all players have great connection, it was global lag not individual. Overall not the best experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2018-04-01T22:29:31.000Z",
          "Titre": "My server is shutting down and experiencing lag.",
          "Contenu": "I have had a great amount of fun with the server I am paying for, and I thank you for hosting it. Although this is true, my server often has a lot of lag, and without me doing anything, shuts down. This has been very annoying, and is not at all what I thought I was getting into. Unless this problem of server shut downs and lag can be fixed, I am going to have to go with another company to host my friends' and my world."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T20:04:35.000Z",
          "Titre": "Most services have a way to see your…",
          "Contenu": "Most services have a way to see your ram and cpu usage that bisect lacks. I was also pretty put off by having been referred to the service and not got my first month discount or had my referer receive their benefits because I went for a multi-month plan. The nickle and diming for extra features wouldn't bother me so much if it wasn't obvious that the site is intentionally clunky to promote the sale of those features. I'm half way through my 3 months and I'll be comparing other hosting in the next few weeks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 5,
          "Date": "2018-10-05T11:56:06.000Z",
          "Titre": "Won’t fix the issue, wants me to point to their nameservers",
          "Contenu": "I asked them in a support ticket to add the resolver ip addressees for cloudflare so I can add an addon domain in cPanel, their solution was to temporarily point the domain to their nameservers which I already have dns configured with cloudflare and doing that would break everything that relies on the dns records being there for the domain. I will be moving my site to BuyShared once the hosting package expires as they are more willing to help over there."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Skyler Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T04:35:02.000Z",
          "Titre": "I haven’t been able to host a server it…",
          "Contenu": "I haven’t been able to host a server it doesn’t let me."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "O.A.G",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T16:43:05.000Z",
          "Titre": "Internal Error ruined my experience",
          "Contenu": "I have had massive issues connecting to my server and spent days talking to support with absolutely no solution or cause being found. When I asked for a refund on account of not being able to join my own server for multiple days, I was denied. Support is typically very fast however, and they did try many solutions. The only exception was the one occasion where I had to wait 40 minutes between responses on my first ticket. I honestly believe the support is better than the service. Even now I still can’t join my own server.My advice is: if in the first three days you encounter an “Internal Error” ask for a refund, as for whatever reason their servers hate your connection and the problem will never go away, you wont be able to connect to your server for hours and sometimes days on end."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Antonio P",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T03:16:17.000Z",
          "Titre": "Teasing from support employee",
          "Contenu": "Im mostly happy with how the service works.But yesterday i joined ur discord to ask a question in support. I got trolled by user TMellen#3967 who was the only answer/nonsense i got. Lately i asked same question on live chat in bisecthosting.com and i got a serious answer by someone called Timmy... when i complained about that member of your comunity traing to gain some atention and making fun of your custommers, the guy who was supporting me (Timmy) laught. Thats kind of treatment is making me to think about hire the hosting in other place. My money and specially my person deserves respect."
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Jorge Nogueira",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T08:33:05.000Z",
          "Titre": "The server getss laggy too many times :(",
          "Contenu": "The server getss laggy too many times :(I discovery only gets laggy after a couple of hours of goin to new terrain, in facto 1gb servers are a little slow but if you only have a few players besides all are findding new terrain it can work really good. :)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Coren Bennett",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T22:56:07.000Z",
          "Titre": "Server work fine with 1 player, but crashes immediately with 2",
          "Contenu": "The server works perfectly fine with only 1 player online, but as soon as even 2 people are online, it begins to lag constantly and usually crashes within 10 minutes, remaining offline for at least an hour."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Craig Flaskerud",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T17:01:26.000Z",
          "Titre": "Modpack install",
          "Contenu": "There used to be unlimited modpack install and now it only a 3 day free trial."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "justin durham",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T03:20:58.000Z",
          "Titre": "Well I would like to give you a good…",
          "Contenu": "Well I would like to give you a good review but your services are far to expensive for what you pay for one of your customer service reps contacted me telling me you could match it or do better if I was interested then just stopped talking to me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2018-03-28T22:38:25.000Z",
          "Titre": "Poor server hosting reliability",
          "Contenu": "Poor server hosting reliability. Even with a few people on the server and minimum use, server connection becomes too poor to use without many restarts. Several attempts were made to fix connection issues with support and were unsuccessful. Will not be renewing with them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terra",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T18:25:43.000Z",
          "Titre": "About what you'd expect on the cheap.",
          "Contenu": "Pricing is cheap, but you get what you pay for. Actually paying them is a serious chore too, since they refuse to acknowledge payments are made until just before the due date, leading people to believe they need to give more money than they do."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Everhart",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T05:08:30.000Z",
          "Titre": "Expensive with unnecessary paywalls",
          "Contenu": "Very expensive for small freind group modded servers. Having to pay extra for quick modpack updates just punishes the active player base who are playing the newer packs, which seem like not the base you want to alienate"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ryan Bercovitch",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T01:48:29.000Z",
          "Titre": "Lag spikes for RL Craft",
          "Contenu": "Me and my friend are constantly getting lag spikes and booted from the game despite having good internet speeds when tested. Don't know how to fix this problem as others who use the same wifi don't have this issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ira Feltz",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T01:09:37.000Z",
          "Titre": "Worked good. Better options to find.",
          "Contenu": "Overall the server worked well. I went for a 5gigs ram server. But the website sends lots of emails and it's annoyingly pushy. I also quickly found a better solution with an old laptop used as a server box.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Turbo",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T17:40:55.000Z",
          "Titre": "Frequent outages and bad rubber banding",
          "Contenu": "Frequent rubberbanding and outages made it extremely difficult to hold a server through BisectHosting. It was really frustrating because I was trying to stream with my viewers and I was constantly having issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "deathbedsniper deathbedsniper",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T17:21:44.000Z",
          "Titre": "TYPE ISSUE",
          "Contenu": "TYPE ISSUEIt was going good then it would not let me tap or type it made my time bad becouse i never played online minecraft im mad"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "kfir deutsher",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T13:31:16.000Z",
          "Titre": "Almost isnt playable",
          "Contenu": "The server was laggy and me and my friends almost cant play on it and moat of the times the server doesnt even open"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "scotty",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T05:57:37.000Z",
          "Titre": "Wayyyy too expensive."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "František Škoda",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:54:26.000Z",
          "Titre": "Hi i have a problem",
          "Contenu": "Hi i have a problem, write to a support and then we were chating and then he closed chat and my problem is still unsolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANTHONY KING",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:46:46.000Z",
          "Titre": "Like the customer support but",
          "Contenu": "Like the customer support, me and my friends have used you guys several times. Only big complaints I have is everything we host our original server location is always super super laggy and we have to change it to have the sever run decently and if we need support at like 3 am they usually can't fix it and whoever takes over for them in the morning fixes it in like 3 seconds"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "gaelic_odin",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:49:50.000Z",
          "Titre": "honest opinion and experience lol",
          "Contenu": "The UI is user friendly, it is but you'll need to watch hours of video for any custom Minecraft mod packs. The servers in New Jersey were down for myself not long after I got a pack running so I couldn't use the free trial stuff so that went to waste, I ended up paying for it since their videos for it were either outdated or misleading. But after I paid the extra 3 dollars (I think it was) it was easier. I haven't had any other issues other than instances not being able to delete and start over"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mason Fierge",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T03:37:09.000Z",
          "Titre": "Lag despite below recommended player size.",
          "Contenu": "So I bought a 6 gigabyte server to run a custom forge modpack on. That being said the gui and console is very user friendly, and I applaud. The only issues I face right now is the lag I got with my price. Consistently I average three to four players on at a time, but it crashes frequently when there is more than three. I’d like to upgrade but the price for one gigabyte more is a whole extra two dollars. Now the lag is tolerable most of the time, and it has highs and lows, but I can’t rate any higher because of it."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Josh Waycott",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T01:40:39.000Z",
          "Titre": "I would like to be able to change…",
          "Contenu": "I would like to be able to change modpacks whenever I want without having to pay a fee, even if I do it myself."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Luka Lakia",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T23:18:58.000Z",
          "Titre": "Bisect is a very good server hosting…",
          "Contenu": "Bisect is a very good server hosting website, however the thing that got this review to 3 stars was the help I got from costumer support. Managing the server itself was somewhat hard and UI was simply not clear enough to what it did. The main problem I had was just configuring the server but the server it self in-game was really good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Owen Hitchcock",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T13:21:31.000Z",
          "Titre": "Good Communication, Bad experience.",
          "Contenu": "I really like the communication and how quickly problems are addressed. That being said I had an issue with extreme server lag and still do. I upgraded the server from 10GB to 14GB of ram still had issues on a 6GB recommended pack. Customer support did a check on it for corrupt chunks it didn't really change anything the server is still messing up I'll probably just end up canceling at the end of this month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IonicEmperor",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:02:54.000Z",
          "Titre": "The support is fast at responding.but…",
          "Contenu": "The support is fast at responding.but that's about the main good thing.my server lags a ton and I will only assume that's because the modpack we chose. Maybe needs more ram would fix the issue. but the cost for the server hosting is quite expensive so I will not pay for more once my server time is done"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "elijah trees",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T04:52:34.000Z",
          "Titre": "It was INSANELY confusing",
          "Contenu": "It was INSANELY confusing to make my world into a server! I spent many hours trying to get it up and running. If that was the only problem it probably would have been a or four. But there are also frequent server crashes. If those two glaring flaws get fixed then it would probably be a 5. The reason I give 3 stars instead of 2 is because their customer service is on point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kody Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T18:55:14.000Z",
          "Titre": "At the beginning of the server",
          "Contenu": "At the beginning of the server, everything was working smoothly. My friends and I, were able to hold 40 mods that equated to .12G and things worked fantastic for just 8gb for a server. However, we are able to get the same result on pebblehosting for only 8$ a month, with reasonable server statistics. I think the prices, in my opinion, are a bit expensive. On the third day of the world, we started to receive lag spikes, which disappointed my experience with the server itself."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "SebbeVG",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T03:35:29.000Z",
          "Titre": "I would rate bisecthosting a 5 star but you need to buy package 2 for ark",
          "Contenu": "I would rate bisecthosting a 5 star but I have a really big complaint to make. The fact that you can't run an ark server with package one. You have to buy package two to be able to have more than 3 players and some crusial mods. Although it is still kind of cheap, I would still want to spend that money on for example an ark cluster."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Riley Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T03:52:33.000Z",
          "Titre": "A lot of lag with more than recommended ram",
          "Contenu": "Modding is very easy, but my server has been lagging and restarting for my friends and I all day. It's just vanilla minecraft with plug-ins and I have a 6GB plan. The plugings I am using through your modding page recommends 4gb so I thought I would be way covered with 6. The \"mod\" is just a bunch of plug-ins, not even mods"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dudetanki",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T02:33:51.000Z",
          "Titre": "Ai keeps breaking",
          "Contenu": "There seems to be some kind of ai suppression that we experience only on your services, particularly with villagers and trying to trade with them, their ai breaks and then they don’t restock. This is of course most affected by villagers which directly interact with players"
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Alejandro del Río",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T10:25:06.000Z",
          "Titre": "Good client service, improvement is possible in servers",
          "Contenu": "The support tickets system is really good, they answer at any hour and really fast too. The servers are fine, they do feel a bit laggy and I wish there were more options to manage the server."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Johnny",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T23:38:52.000Z",
          "Titre": "Great... when it works",
          "Contenu": "I've had a server for a few weeks now and it seems to be down at least once or more per week. When it works, it works very well, but it gets very frustrating having to wait until the \"node\" I'm on is working again."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "George P",
          "Nb_Reviews": 3,
          "Date": "2023-07-14T08:01:33.000Z",
          "Titre": "Host lost connection",
          "Contenu": "Most to Nealy every time using I lose connection with the host or something happens with the host that makes me lose some progress. I get a message on screen saying this. I go to the control panel and the server has reset or in the process of resetting. If this is normal then it's very annoying. Only takes 10 minutes to get back online but when there is a group of you playing then we get get the boot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T02:01:39.000Z",
          "Titre": "server kicks all player's then becomes unavailable.",
          "Contenu": "I ordered the cheapest ark survival evolved server BisectHosting offered and I would like to be satisfied with it as I've not suffered much if any lag or rubber banding, but randomly every 5 or 6 hours it will kick all players and then no longer be available in the search menu for the game ark. untill I do a server restart that is."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chels",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T18:56:37.000Z",
          "Titre": "You can’t switch from the budget to…",
          "Contenu": "You can’t switch from the budget to premium easily. Server in NJ was down on my friend’ birthday and we couldn’t play for his birthday stream."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "X F",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T03:39:16.000Z",
          "Titre": "Easy accessibility but multiple server issues.",
          "Contenu": "I liked how easy it was to set up to the server and connect. The server owner interface was also very useful but I found that I had a lot of difficulties setting up a secondary server restart time. I was following guides and setting the correct scheduled restart times using the converter to UTC but the server still never restarted. On top of this my RLCraft server with my friends had 8GB of RAM but it was still constantly lagging whenever we explored with multiple consecutive 5-10 second server freezes in a row. We decided to spend the extra buck and upgrade to 12GB but it didn’t really fix the issue at all."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Leonardo Fernández",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T04:00:03.000Z",
          "Titre": "unstable performance",
          "Contenu": "I got one of their budget plans (8 GB of ram). I installed a self built mod pack that I had already tested elsewhere. During the first 4 days the server was excellent with good speed in chunk generation.But, then it started to go wrong and the speed was not the same, for no apparent reason. And I have only been playing on the server myself. It's still a better and cheap service compared to others, but that loss of performance (even on new worlds) I don't understand and dislike."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Boyd",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T23:14:48.000Z",
          "Titre": "unfortunate crashing",
          "Contenu": "Server can be connected to and runs good, but after 45 mins it will just crash. I am not sure if the mods are the cause, or the server itself This is bad because I play on it solo and it still happens. When I put in a support ticket, I was just told to buy a better server package. This seems dumb, as if the minimum server package cant handle one player, why sell it. Either that, or I got bad service on my ticket. I am willing to upgrade, but am not willing to pay without first seeing it work properly on the upgraded server. I probably will not renew my subscription this month, unless a resolution could be found to this issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Claire",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T01:22:20.000Z",
          "Titre": "Cost is good.",
          "Contenu": "Cost is good. Clunky interface, difficulty with mod installation for larger servers in relation to the users. There are better hosts out there that will provide you with mod packages but at additional cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SpasticPanda",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T07:04:02.000Z",
          "Titre": "When I first got the server it did not work",
          "Contenu": "When I first got the server it did not work at all it took me many hours to try to get it to work to no avail. I had to open more than 3 tickets for you guys to finally figure out the constant problems that where happening where on yours guys end. although it may sound like I am being harsh I am very satisfied with the customer service he was very help full and attentive to the problems I was experiencing and at the end of the day all was fixed after 3 days of it being up and down. It has worked ever since with little to no problem. although I think if I paid for the premium service there should be no problem  that is why I am giving it a 3/5."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Landyn Young",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T02:40:10.000Z",
          "Titre": "I really like it but I was really…",
          "Contenu": "I really like it but I was really struggling trying to find the control panel for my server. I also think there should be more customization on the server like keep inventory and the rate that which the day cycle runs other than this it was good!"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Ibrahim Azeez",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T14:09:58.000Z",
          "Titre": "Good services, few issues",
          "Contenu": "The servers were good and the price was nice. Im not sure if its our ping problem or something wrong with the server, so to be safe i rated it 3 stars, sometimes people would just be kicked out and sometimes the server gets laggy, especially when going to new locations."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Corne",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T10:38:34.000Z",
          "Titre": "Its a decent server",
          "Contenu": "Its a decent server, but for the price its a bit laggy. My ram isnt full but still we are experiencing huge lag problems when exploring our minecraft world"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T16:07:17.000Z",
          "Titre": "Server was a bit expensive",
          "Contenu": "Server was a bit expensiveServer had issues with lag on most modpacks and tended to crash constantly despite buying a higher level plan than recommended.Server support was nice, setup was easy so theres that."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "KHALID ALSHAHRANI",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T02:42:41.000Z",
          "Titre": "5 out 10",
          "Contenu": "As a first-time hosting user, I thought it would be smooth and the server would run fine, but the server didn't run fine so I upgraded my server from 6G to 8G and still there is some lag. When I talked to the support, they helped me more than once, and it is better now, but still, there is some lag in the server from time to time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt phillips",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T17:23:52.000Z",
          "Titre": "The first week of playing on the server…",
          "Contenu": "The first week of playing on the server was great. I have no issues with lag or anything above that but now I’m experiencing major lag issues to where I have to reset the server five times at most to even stop the lag from happening."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Zorrito Del Campo",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T03:09:38.000Z",
          "Titre": "The most basic service is a lie and not…",
          "Contenu": "The most basic service is a lie and not enough.My first purchase was the most basic server (5 USD) with 3GB RAM for a 7 days to die server, but it couldn't even handle 2 persons in different locations (Always disconnected us) because it was using 3.5 GB RAM...It was until I had to upgrade to the tier 2 (11 USD) with 6GB RAM to be able to use the server as it consumes between 3.7 to 4.5 GB with 8 people inside and in different places! Which is almost the same as 2 persons...It's a complete lie or at least you should be able to gather all this kind of information an offer a minimum service for specific games BEFORE we make a purchase :)Something like a purchase wizard would be good: 1) What game are you going to be using the server for?2) This tier works for 2-8 people in the server (11 USD) - And this info changes depending on the game and expected people to join3) etc."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T11:55:11.000Z",
          "Titre": "Mostly laggy",
          "Contenu": "Mostly laggy, with features that are provided for free on other hosting platforms (like mod support) locked behind paywalls.I'm running a Minecraft Vault Hunters server and the recommended server specs cause lag for ~3 players unless you're all standing in the same place 100% of the time.Other than that, the setup is fast, mod setup is easy (if you pay for it) but they do also provide manual setup. The dashboard provided is useful but there are no performance metrics at all. Due to this, when your server lags, you can't tell what the bottleneck actually is. (There is apparently a downloadable plugin for server stats as stated on their dashboard, but this didn't work when I downloaded it - again, this is a basic feature provided by other hosting services).If you aren't looking to load a lot of chunks at once then the server runs mostly fine. I wouldn't recommend for Vault Hunters as the mod does require chunk loading. I'd personally try another service next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler Weckherlin",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T03:36:07.000Z",
          "Titre": "A Very Slightly Above-Average Experience",
          "Contenu": "The server performs almost perfectly with only 2 or 3 players, but we see a lot more lag with more than 3 players on our server. I was hoping $40/month would give us better than a maximum no-lag capacity of 3 people :/"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brett B",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T05:59:29.000Z",
          "Titre": "Mixed impressions",
          "Contenu": "Server hosting was easy, and relatively good prices. However my ark server seems to be a bit laggy, and sometimes even crashes on me. Seems like the minimum cost ark servers aren't as good as I would expect. Even for having only 2 players on it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dom",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T05:21:30.000Z",
          "Titre": "Unimpressed for the money",
          "Contenu": "Had to upgrade to 6gb just to be more than 1000 blocks away from each other at a time and when we are finally all able to play together all of our games crash at the same time due to a server issue in your end,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brennan Poulson",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T20:03:09.000Z",
          "Titre": "Love the fact that you have diffrent…",
          "Contenu": "Love the fact that you have diffrent prices for whatever mods I'm running to host the servers but not all to user friendly only thing I would change is how to get to the server ,stop it exct"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GalenGoose",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T03:52:35.000Z",
          "Titre": "It was okay",
          "Contenu": "It was good, but a lot of my server members were having trouble getting into the server at the time and the customer service weren't helping much. I took matters into my own hands and had to change the modpack that was being used."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaeger",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T03:26:04.000Z",
          "Titre": "It's an okay service",
          "Contenu": "It's an okay service, there are a good bit of plugins that make it better but the datapacks aren't set up and it quite expensive compared to other sites, probaly my last time on this."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "JoshuaC",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T04:36:22.000Z",
          "Titre": "It's great but…",
          "Contenu": "When the game is running it's great but the server seems to crash often. Gets really annoying having to reboot the server every few hours, loosing progress."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Elias",
          "Nb_Reviews": 3,
          "Date": "2023-03-26T18:24:51.000Z",
          "Titre": "Servers are good, but promises are not always kept",
          "Contenu": "The servers themselves are pretty good, the price too, but not all the promises made at the time of purchase are true. For example, I bought a modded Minecraft server from them in August 2022 and now I want to restore the backup 7 months later, which is theoretically possible according to their promise to keep the backups for 2+ years. When after waiting 29 hours for them to respond, I only got the answer that the files no longer exist, I felt a bit like a fool, because I specifically bought another server from them to continue playing with my old files. It was not even explained why the files no longer exist. In one sentence only the statement that they are no longer exsistent and thank you that I have written to support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nani Kantan None",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T08:08:13.000Z",
          "Titre": "Lag and crashes",
          "Contenu": "Lag and skipping around. I have a 8g server and I can't load in chunks without crashing the whole server. I wouldn't mind just restarting the server but it takes about 5 minutes. Not happy that a paid around 40 dollar for that experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabriel Pinson",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T23:13:38.000Z",
          "Titre": "I recently bought a 8gb modded…",
          "Contenu": "I recently bought a 8gb modded Minecraft server for better Minecraft 1.19, I think, and every time we would open chests that were on small boats specifically, the server would crash."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shania Cornelius",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T23:16:50.000Z",
          "Titre": "Incorrect info on log screen, bad connectivity",
          "Contenu": "the information that was given to me wasn't fully correct so I had to search deep to find the actual information for my server. Along with that, the server barely works for me when others hop on, even though the server isn't hosted directly on my pc."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Liam Strand",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T12:53:04.000Z",
          "Titre": "The server is doing and is well",
          "Contenu": "The server is doing and is well, but there is also some times the moment when there server freezes and we have to Wait a couple of minutes. Das kinda annoying, but otherwise is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jake smith",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T06:06:43.000Z",
          "Titre": "I like the server experience but…",
          "Contenu": "I like the server experience but sometimes the sever is laggy and ineffective for the price, also I find it difficult to install mods. It is not bad but can be improved. But it is still pretty good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcus McKee",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T03:41:36.000Z",
          "Titre": "the server lagged for a while when i…",
          "Contenu": "the server lagged for a while when i first got it. Then the server would crash repetitivly on the second day. I later than contacted for support but the server is still crashing every 1-2 hours we play on it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deryk Reiss",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T04:51:04.000Z",
          "Titre": "One Issue",
          "Contenu": "Everything on the server side has been working fine but there has been an issue of random people joining the server withought getting the ip."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trent",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T01:22:45.000Z",
          "Titre": "Nice Support and Admin Panel, Unreliable Service so Far",
          "Contenu": "I’ve been with Bisect for less than a month and I’ve had a mixed experience.One one hand, support is responsive and the server usually runs smoothly.Two big issues have come up though:1. My backup manager broke and permanently locked up one out of two manual backup slots offered on my plan. We’re going on one week of this being an issue and it still isn’t fixed (the ticket is open in my Support panel). The reason for this is that the automatic 7day backup process offered on the Premium plans totally broke (according to their System Admin) on my node. So… I’m glad I’m not a Premium subscriber? Sounds like a false sense of security.2. With the release of 1.20, server slowed down immensely, even with just a few players on the 4GB plan. When I asked support about it, it was due to high traffic. Aren’t I paying for 4GB? Why does other server traffic affect mine? So they moved me to a different node to make it better. So I’m happy it’s fixed, but still a weird thing to have happen.Overall, I’m doing my research again to see if other hosts offer a similarly robust admin panel (one of the great things about Bisect) but with a more reliable infrastructure."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Erwin Francis Galido",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T09:48:24.000Z",
          "Titre": "I like the fast response of the support…",
          "Contenu": "I like the fast response of the support team but when the server crashes I just downloaded some of the modpacks that were listed there on their modpack list and they dont seem to know how to handle or fix it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben C",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T22:46:00.000Z",
          "Titre": "Server is pretty laggy",
          "Contenu": "The customer support is amazing and the experience on the website was good. However I have almost double the recommended ram for the mod I am running, and it still isn't very smooth when 2+ people are on."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Andreas Petersson",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T15:10:34.000Z",
          "Titre": "Not a very informative response or any…",
          "Contenu": "Not a very informative response or any information about an expected date when this is fixed. Quick response time at least"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Payne",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T02:39:17.000Z",
          "Titre": "The response was very quick which I…",
          "Contenu": "The response was very quick which I appreciate greatly. But unfortunately i felt that the responses that I did receive were rather generic and unhelpful. Maybe it was just my experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RageTurtle",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T03:33:13.000Z",
          "Titre": "Fair",
          "Contenu": "I got good information but it took like three days to get it. Room for improvement but thanks for the help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T22:26:45.000Z",
          "Titre": "I like the way the panel is easy to…",
          "Contenu": "I like the way the panel is easy to use, there were a lot of problems with adding plugins and the server becomes very laggy randomly once in a while."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul B",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:39:39.000Z",
          "Titre": "Server has long connection times for…",
          "Contenu": "Server has long connection times for all players and has big lag spikes."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:01:58.000Z",
          "Titre": "Good Host, but got issues with some mods",
          "Contenu": "Everything worked fine, apart from the mods. Wanted to play with mods, but couldn’t follow the tutorials because the mods there was an error and support couldn’t help me either."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Evan Parr",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T03:26:27.000Z",
          "Titre": "Server runs great",
          "Contenu": "Server runs great, but you and i both know its complete BS to charge a second time for something as simple as adding a new modpack"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CLIFF",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T21:17:34.000Z",
          "Titre": "SUGGESTION",
          "Contenu": "good enough for me but I recommend you guys should upgrade the panel, it's kind of difficult to control and doesn't have many options like another website. tks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Garrett DeMoss",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T19:39:12.000Z",
          "Titre": "One of the best services so far but way…",
          "Contenu": "One of the best services so far but way to expensive. Still debating if its worth the price..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Demchenko",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T23:50:22.000Z",
          "Titre": "It’s a bit buggy but example when more…",
          "Contenu": "It’s a bit buggy but example when more the one person joins at a time it crashes the server. Next every time when someone join it lags the server a lot. Though I love the amount of different mods."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon White",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T03:30:38.000Z",
          "Titre": "Multiple crashes and tough latency",
          "Contenu": "Server tends to crash at least 4-5 times each time more than 1 playet is connected. Fairly laggy for such a high priced server."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Crazysloppyjoe",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T08:12:09.000Z",
          "Titre": "It's good but for people in your country",
          "Contenu": "My server lags a decent but when I have 10+ people on. Some are from different countries and I want them all to have fun man. Other than that it's alright"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Broodman",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T13:17:26.000Z",
          "Titre": "The servers ran terribly",
          "Contenu": "The servers ran terribly. I ran 3gb minumum recommended modpack and it struggled to have 2 players online. I bought 6gb. Alright value for money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Leete",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T18:06:40.000Z",
          "Titre": "Pricey",
          "Contenu": "These costs are quite high, but I guess that's what I should expect from this kind of quality hosting"
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "jesper Forsberg",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T17:40:41.000Z",
          "Titre": "Server did not load properly",
          "Contenu": "Server did not load properly at all, very slow chunk loading, both inside and outside the vaults, multiplayer comptability was low since other players leaving vaults, loggin in or out, made the server lag."
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Guys",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:09:44.000Z",
          "Titre": "Great for that ammount of money…",
          "Contenu": "Great for that ammount of money but sometimes laggy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chritsian Moore",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T20:16:56.000Z",
          "Titre": "The server lags a good amount in some…",
          "Contenu": "The server lags a good amount in some mod packs and when loading chunks fast lags the server too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Random_Bloop",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T15:18:59.000Z",
          "Titre": "Great but lags out even though I chose recommended RAM",
          "Contenu": "I was recommended an amount of ram to use to run my sever for just my boyfriend and I. It lags out and and keeps saying that the sever can't run fast. Besides that, it's great."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Khaled Ayman",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T04:48:12.000Z",
          "Titre": "I purchased 12 gb ram and when i play…",
          "Contenu": "I purchased 12 gb ram and when i play with my friends we only use 7 gb of ram and there is so much lag"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Jerome O’Rourke",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T23:51:22.000Z",
          "Titre": "I put the world on large and it was set…",
          "Contenu": "I put the world on large and it was set to small and we get kicked for random stuff like \"title spam\" and \"liquid spam\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam Kirk",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T02:46:38.000Z",
          "Titre": "my server is having lag and very slow…",
          "Contenu": "my server is having lag and very slow chunk loading. though i have used the recommended amount of ram for the server."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rodney McCullough",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T03:41:55.000Z",
          "Titre": "The server lags and I have had troubles…",
          "Contenu": "The server lags and I have had troubles with the mods loading properly for all people on the server"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "zeph wynder",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T15:34:25.000Z",
          "Titre": "outages daily",
          "Contenu": "the service is very good, however there appears to be an outage daily"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ally",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T02:48:09.000Z",
          "Titre": "The price doesnt match the quality.",
          "Contenu": "Honestly for $20 a month, the server is still laggy and has its issues and thats kinda what I was trying to avoid. If I were to price this it’d be like $12 a month or $15. But $20 for a laggy server? Its a bit much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jordan  Dickens",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T03:55:17.000Z",
          "Titre": "Not very user friendly",
          "Contenu": "I ordered my server with the 24/7 help, but I was never given any help, and the interface was so confusing I had to look it up to find out how to do stuff, the server itself runs great but the interface was confusing."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Connor Taylor-Marriott",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T11:09:57.000Z",
          "Titre": "Minecraft Server Experience",
          "Contenu": "i don’t know what makes it do it but for example when two of my friends were on it they weren’t lagging but then when i joined it started to lag and vice versa this is on a minecraft server btw in london and we are in scotland not far from eachother so i’m confused why it lags so bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Devon Simcox",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T06:59:24.000Z",
          "Titre": "I can’t get admin to work on the server…",
          "Contenu": "I can’t get admin to work on the server so I can’t fly or spawn anything"
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "BroGames",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T16:43:21.000Z",
          "Titre": "Its fine",
          "Contenu": "There was a down time of a whole day without any reimbursement for the lost time.Other than that, its great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jordan  Brewer",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T03:36:31.000Z",
          "Titre": "I didn’t get clear info and I’d like to…",
          "Contenu": "I didn’t get clear info and I’d like to be better told exactly where to go rather than what to do randomly."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Cristi",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T15:16:06.000Z",
          "Titre": "I don't like that you ask for a setup…",
          "Contenu": "I don't like that you ask for a setup fee for your server, especially for the automated installs. This service is more expensive than others, and while the servers may be better, it leaves a sour taste in my mouth to pay extra for an automatic setup."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nikki Doe",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T12:17:19.000Z",
          "Titre": "Lag!",
          "Contenu": "Server was cheap but it lagged alot, I recommend buying a server with lots of ram to avoid these issues."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "leroux steven",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T10:27:54.000Z",
          "Titre": "I took a server recommended by and for…",
          "Contenu": "I took a server recommended by and for the mod I wanted to play and even a little more powerful (recommended for 15 players when we play 5)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Phan",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T10:07:38.000Z",
          "Titre": "Server still lagging quite a bit…",
          "Contenu": "Server still lagging quite a bit despite upgrading the ram"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Ferdinand Firmbach",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T23:46:01.000Z",
          "Titre": "Why du you habe tonpay to install a…",
          "Contenu": "Why du you habe tonpay to install a Modpack?!!!But good services"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Delaney",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T01:59:38.000Z",
          "Titre": "Can't login to my server"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HughMann",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T22:00:12.000Z",
          "Titre": "Good, but pricey",
          "Contenu": "Good hosting service, however a little pricey."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "amos  kiob",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:59:26.000Z",
          "Titre": "Some things work",
          "Contenu": "Some things work, some didn’t. Server pings tends to go up and down a lot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George Grund",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T17:09:22.000Z",
          "Titre": "Hosting great, documentation not.",
          "Contenu": "While the hosting itself is great, it is disheartening to open your support articles and have the UI look completely different and not have the same flow.It took me half an hour to move a file in a lower folder because I did not know if ../ would bring the file up or not and the move file article is out of date."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Li Jun Pan Yau",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:39:38.000Z",
          "Titre": "When install the plugins",
          "Contenu": "When install the plugins, the staff will be upset"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Freddie",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T17:55:41.000Z",
          "Titre": "Constant lag in servers",
          "Contenu": "Constant lag in servers but great for long distance"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Toast",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T03:31:51.000Z",
          "Titre": "Expensive + exclusive",
          "Contenu": "It was quite expensive and there wasn't a server in Australia in budget edition of the servers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sean meletti",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T03:04:04.000Z",
          "Titre": "Keeps crashing may be due to the mods…",
          "Contenu": "Keeps crashing may be due to the mods but I have more then they require"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Ruiz",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T17:16:29.000Z",
          "Titre": "It felt robotic but the response time…",
          "Contenu": "It felt robotic but the response time was excellent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allen Hooker",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T06:14:26.000Z",
          "Titre": "No real issues up until the last few…",
          "Contenu": "No real issues up until the last few days.  Several server crashes and outages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dylan",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T01:32:54.000Z",
          "Titre": "the server is a bit laggy i guess",
          "Contenu": "the server is a bit laggy i guess, but for the price its alright"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Titouan Langouët",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T17:25:52.000Z",
          "Titre": "i'm a bit underwhelmed by the…",
          "Contenu": "i'm a bit underwhelmed by the capabilities of the minecraft server. I bought for three month a server for 15 players, but when we started playing with my friends the server keped crashing.Your team was very helpful and help me fix the issue, but to fix it i had to use MCpaper and i don't really like plugins that much on minecraft, because it change some little things here and there you don't notice at first but when you wish to do some redstone you realise for exemple it change spawn rate, dispawn hostile mob with name tag, the IA of mobs ...So in the end the problem i have is that i pay for a server normaly capable to handle 15 players BUT it need to use plugins and other way to make it more performante, it fells like a waste of money.Have a nice daysincerely Titouan Langouët"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Makhi Carr",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T23:43:47.000Z",
          "Titre": "A bit expensive and a tad bit laggy but…",
          "Contenu": "A bit expensive and a tad bit laggy but solid"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Mausoleum",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T03:56:35.000Z",
          "Titre": "The server is pretty laggy considering…",
          "Contenu": "The server is pretty laggy considering my wifi and others are good and we Brought premium"
        },
        {
          "Note": 3,
          "Lieu": "CR",
          "Pseudo": "Alejandro Somogyi",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T08:51:58.000Z",
          "Titre": "Regarding the budget servers there is a…",
          "Contenu": "Regarding the budget servers there is a lot of lag and many other problems"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Anas Adolph",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T11:28:00.000Z",
          "Titre": "The server sometimes crashes when u…",
          "Contenu": "The server sometimes crashes when u open chests"
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "hoang an",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T07:49:35.000Z",
          "Titre": "Instructions overcomplicate a rather…",
          "Contenu": "Instructions overcomplicate a rather simple process and submitting tickets were minimal to no help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monica Sigman",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T14:13:26.000Z",
          "Titre": "Good server hosting",
          "Contenu": "Good server, I should probably upgrade by a little more RAM for my modded MC server. Despite using 6gb of ram instead of the reccomended 8 for the pack it still runs correctly and I have no issues with it."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Sz_dS",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:22:24.000Z",
          "Titre": "A good and decently user friendly UI",
          "Contenu": "A good and decently user friendly UI, making it fairly easy to change configurations and manage the files of your server. The pricing could be a bit better, but overall the servers are good and stable"
        },
        {
          "Note": 4,
          "Lieu": "LV",
          "Pseudo": "Edijs",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:33:54.000Z",
          "Titre": "Good choice for Minecraft server",
          "Contenu": "The console layout is easy to navigate and understand. The support was top-notch and I got all my questions answered. And I love the tools provided to manage the server."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Collamer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:07:16.000Z",
          "Titre": "Great customer support and discord…",
          "Contenu": "Great customer support and discord community.  Happy I was reached out for my activity on Curseforge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn Heinis",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:59:11.000Z",
          "Titre": "The support was great",
          "Contenu": "The support was great, very instant response for a simple fix. The server is a bit slower with the same mods than I’d expect compared to other servers at similar capacity of ram, but it still runs with 2+ people smoothly. Otherwise was great"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "xInsanityx",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:14:21.000Z",
          "Titre": "Modpack didnt want to work.",
          "Contenu": "I had 5 different people helping me on this case. all 4 with help just to no working extent. The last person. Clay G helped me and within 20 minutes figured out the problem and solved it for me. I am very happy to have this fixed because of how long this problem took."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Safowan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:09:21.000Z",
          "Titre": "Affordable and great support services",
          "Contenu": "Love how affordable and quick the service was. Everything was very easy to setup and I loved the UI, it was very user friendly. However I did have some minor issues with the servers and lagg that was resolved by the support but that is the only reason I give a 4 star. Other than that their support and service is great. So many options and function."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Snowden",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:54:20.000Z",
          "Titre": "The hosting services alright",
          "Contenu": "The hosting services alright, they provide a plethora of guides to help you set up, at least for the Arma server that I was using. The interface is relatively intuitive even for me, someone who's never had any experience running a server. My only complaint is that they do not provide enough ram and might be throttling it a little to encourage you to pay an extra $1/Gb/month to add more. 7/10 might keep using"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shkeyro  Brandenburg",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T03:19:41.000Z",
          "Titre": "My thoughts of bisecthosting",
          "Contenu": "Firstly the server part wasn't lagging all that much and the way you can add and or change the modpack at will is pretty neat"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Kentra",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T07:40:49.000Z",
          "Titre": "So far the service has been good",
          "Contenu": "So far the service has been good, other then the occasional mini connection issues, but that could have many causes out of BisectHosting's control. Server went up really quick, easy to manage, and works lagless. Overall really good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ari Volchenboum",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:29:27.000Z",
          "Titre": "I think everything works and…",
          "Contenu": "I think everything works and performance is acceptable. I just think the console and commands should be more accessible to people. I also think it would be nice to make it much easier change specific mods. I understand that causes issues with the game client if the user does not disable the same mod but it could just tell them to do it or directly change their launcher preset."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Max Bak",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T10:34:46.000Z",
          "Titre": "It’s not very user-friendly program",
          "Contenu": "It’s not very user-friendly program, PC’s are new to me and I wanted to play Minecraft with my friends and I was making a server for like an hour before we could play and, then searching for server id in emails omg… but I made It we cool"
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Jamee",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T11:27:45.000Z",
          "Titre": "Recommended but knowledge base needs an update",
          "Contenu": "Overall easy to setup, no issues or lag spikes while playing on the server. The ability to mod and setup missions is easy and enjoyable. However, one thing I really struggled with and the knowledge base failed to mention this was the fact when you drag and drop files into the server files via the website panel, it makes a sub folder instead of copying and pasting the file itself. I had issues with my mod list not reading because the html file got placed in its own sub folder and the server couldn’t read it. I found this out when I used FTP that revealed that it was actually putting into a folder. Only way I could ensure my drag and drop was not being placed in a new sub folder was to use the FTP. Otherwise it would have been a 5 star rating."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customerBot",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T06:44:31.000Z",
          "Titre": "Bit overpriced but does the job well…",
          "Contenu": "Bit overpriced but does the job well enough. If you’re modding a server you going to want a lot more RAM than they recommend, a good double amount for anything close to a smooth service. I bought 9 GBs for my mod with about 125 mods installed and it got janky when 6 or more players were simultaneously logged on."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Sam Van Achte",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T12:20:06.000Z",
          "Titre": "Short explenation what the problem is",
          "Contenu": "In the beginning we had a lot of people telling us random stuff like having to roll back our player data/ world, etc but also resseting our nodes and stuff. When i looked on the discord I got in contact with Dustyn W, he fixed our biggest problem in 1 hour while 4 other people took a minimum of 12 hours and weren't able to fix it. I really appreaciate the help of Dustyn W and he should really get a raise :) ."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Sheny",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T13:36:23.000Z",
          "Titre": "Yo support system was perfect but...",
          "Contenu": "Yo support system was perfect, there is no AI and guys are funny. problem is on site, when you wanna buy new server under your nickname, it still says that you are not logged in, even tho you are logged on your acc. Weird. but at least they have easy ticket management."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "NaSiX",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T23:39:42.000Z",
          "Titre": "Overall good experience",
          "Contenu": "Sometimes the server throws you out and doesn't let you rejoin for around half a minute, but it is quite rare. Other than that, i'm perfectly satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Forsyth",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T01:19:27.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service but servers tend to lag on some things but in the end they try to improve always"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Rainier Bayer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T08:30:39.000Z",
          "Titre": "It's good I guess",
          "Contenu": "Worked quick, Modpack compatibility and easy to setup. Pretty good for the price I'd say"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Adam Pintea Pintea company",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:59:46.000Z",
          "Titre": "Updating the modpack",
          "Contenu": "I think that everything is really nice and good butI think choosing a modpack/updating a modpack i should be able to do it at all times (and make it so if i dont have premium then i need to update the modpack manually) but exept for that the server is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryce Wilkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T18:40:42.000Z",
          "Titre": "Very easy",
          "Contenu": "I know nothing about servers and it was pretty easy to set up thanks to their tutorials I have no ping issues a little bit of lag but think that’s probably fro atm8"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Goobert Froobert",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T07:08:24.000Z",
          "Titre": "Dylan F done good",
          "Contenu": "Dylan F done good. Had an issue with my server's machine, he made sure it got fixed up on the spot.He even refunded the credits I used to attempt to make the server run better when my attempt at fixing it didn't work.Quick, straight to business, efficient, and incredibly helpful considering I was getting fed up with the performance of my server before he came along."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T22:08:14.000Z",
          "Titre": "Really easy setup and maintenance",
          "Contenu": "Really easy setup, no downtime whatsoever so far. The control panel tools are fantastic. Only negatives so far are 1) the servwr lags with 5 people, nevermind the supposed 10 that my toer should be able to support, and 2) certain times of day the server seems laggier, presumably as CPU load increases on the shared processors, however I have to acknowledge that both of these problems easily could be inefficiencies in the specific modpacks we are using. Overall an excellent experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bonsai",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T20:33:21.000Z",
          "Titre": "The server itself and its connection…",
          "Contenu": "The server itself and its connection was great, but the server settings tend to reset whenever the server shuts down, changing the difficulty back to easy and other game rules. I would love if this issue was resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Earl",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:20:13.000Z",
          "Titre": "Buying is simple and straightforward",
          "Contenu": "Buying is simple and straightforward, server has some crashing issues and errors that I can’t tell are because of the mod itself (Direwolf) or the servers, but overall way better than other providers at this price point."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ned",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:22:26.000Z",
          "Titre": "Good service but the back end UI could be better",
          "Contenu": "Does the job although the back end UI can be a bit confusing to navigate but at the end of the day it is better then not having a UI"
        },
        {
          "Note": 4,
          "Lieu": "LT",
          "Pseudo": "Tomas Jurgelevicius",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T08:48:01.000Z",
          "Titre": "Rating",
          "Contenu": "Overall the server seems okay, sometimes we do get server crashes, but its either when we do alot of thing, like eveyone is traveling and loading all different chuncks at the same time.Maybe one thing is unreasonable. I have a budget version, so i understant that i had a modpack update function on trial. Wouldn't it make more sence as give user 1 time ticket to updates server not on time based?Since updates isnt something that come on exact dates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "The Game",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:58:49.000Z",
          "Titre": "... Everything just works perfectly",
          "Contenu": "I try to be brutally honest when reviewing any media, so if someone happens to be on the fence on whether or not this service is legit or worth it for their needs, allow me to clear the air: This service is great. Extremely intuitive, snappy UI with a well-organized layout. I got this service to host a GregTech: New Horizons server and it was very easy to get things going. Having a dedicated tab for manual backups is awesome. Upgrading the modpack version when there was a new update was a little finicky, as access to server files is handled through menus rather than an actual folder you can just browse and drag through; altered files need to be reuploaded which can take some time, but that's really the only gripe I have–and even then it's not a huge problem. Overall this is a great service and I will 100% be using it again the next time I want to host a modpack server."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "gwyv",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T00:24:43.000Z",
          "Titre": "Best on market",
          "Contenu": "Had many hosting providers before.. This one is far best on market! Fast server for good price. Easy to use, clean and nice UI. Dedicated IP adress, so you can forward your number IP via DNS to your domain and actually use your custom IP… Nice thing that you can easily install most common plugins, datapacks and mods via web UI dirrectly."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "TF",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T10:58:51.000Z",
          "Titre": "Great servers but need a bit of work",
          "Contenu": "Great servers, easy UI! The xtra link for the sever hosting panel was a bit confusing at first.Also sad that you are not able to manually change the mods in a pre-installed modpack. I have been having some issues because of incompatible modpacks.(I have 1.8.28 installed and so does the server, but when you want to join \"FML incompatible modpack - mod list is not compatible\" gets displayed. You can still join but some items are bugged / missing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adenn",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T01:10:27.000Z",
          "Titre": "good however it does lag",
          "Contenu": "Just fun to be able to add and remove any and every mod we want from the server easily however there were times where I couldn’t play for a good hour because it was so laggy and I couldn’t do anything."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "JUKR",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T00:55:07.000Z",
          "Titre": "Great server for small amount of players and large amount of mods",
          "Contenu": "I had a lot of fun in this server especially since I don’t need to turn it on with each of my friends wanting to play on it. Great server easy changeable settings to the world and really easy to change mods. Overall good amount of money to spend!"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "エイビスAvis",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T16:09:58.000Z",
          "Titre": "Really great site for hosting.",
          "Contenu": "So on the start of my journey with bisect (i started like 5 days ago around), it wasn't that good i guess, i encountered a issue with payment but dylan helped me with it so i greatly appreciated his help. The overall experience with the site and the panel is really good! Smooth, after some tutorials the things are really simple to understand after a while. The service support is really great too!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aydin Keener",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T03:01:25.000Z",
          "Titre": "it was going great",
          "Contenu": "it was going great, but I logged into the server today and my items were changed and alot had missing textures, false renders, and invisible chest. I can fix it so this is a guide, just restart the world, other than that, this server hosting has been lovely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron B",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T01:56:04.000Z",
          "Titre": "Quick and easy to set up and the budget…",
          "Contenu": "Quick and easy to set up and the budget control panel or whatever it's called is great. My only quarrel was sometimes thered be huge lag spikes which I'm sure its because I had low ram for the server but it wasnt constant which annoys me and mine. Also the server would crash when going into certain modded structures."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brady Langdon",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T11:35:05.000Z",
          "Titre": "Had problems getting on the server the…",
          "Contenu": "Had problems getting on the server the support employee figured it out and had to change the IP address. Was fast and good service. Now for the options and userface is very limited and can't customize the server settings such as resources, or exp gain without knowing more about code and entering text in the server config. Files. Also can't create manual backups my server hasn't been backup in 5 days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chowder",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T21:27:26.000Z",
          "Titre": "No hidden funny business",
          "Contenu": "Your service is wonderful. Little overwhelming at first glance, but everything makes sense when you start reading. The negatives are the server has gone down momentarily a couple times in a two week span. However, relogging fixes everything. Last negative, the price is a little much. I enjoy the service, and feel safe using it, just wish it was a little cheaper so I could afford to do this long term instead of a couple months at a time"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Hideyoshiq",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T14:19:28.000Z",
          "Titre": "Friends & I bought the 5gb server pack, great support",
          "Contenu": "Me and my friend bought the minecraft server 5gb pack and it has served us well, only hard part is downloading mod packs by yourself... better to pay or download the right one off the bat. After spending multiple hours trying to figure it out myself, I contacted support and they installed the pack FREE of charge! I was pleasantely surprised by this gesture and immediately came here to give them a good review. They seeminly appreciate their customers greatly with the support I have received so far. Thank you BisectHosting team & Timothy SR for the quick response time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jus Jam",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T16:53:36.000Z",
          "Titre": "Bisect hosting has generally been good",
          "Contenu": "Bisect hosting has generally been good. I wish it had better support for Co-ownership, such as two minecraft accounts owning the panel and splitting the cost equally. The server has run excellently with 5GB ram and nearly 50 mods. One weird thing though, is that despite turning off the setting that kicks players for fly hacks, our server still automatically kicks anyone moving rapidly in the air, including when they're trying to water bucket clutch"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ulysse Clément",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T07:05:37.000Z",
          "Titre": "I had a hard time comprehending the…",
          "Contenu": "I had a hard time comprehending the menu but tech support helped me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colin",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:54:32.000Z",
          "Titre": "It Was good for the most part",
          "Contenu": "It Was good for the most part. Just had the basic hosting and they replied in a timely manner. My Experience just didint go well because I was hosting a mudded server and the mods broke allot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Galactic Empress",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T12:36:34.000Z",
          "Titre": "Great Service Specialists",
          "Contenu": "Bought a premium 8GB server for minecraft a few months back to play with buddies. The first guys in the additional support services I bought were very helpful in helping me reset the Nether map without resetting my server. Not that long ago we finished the modded run we did and planned to move on to Valheim, as we canceled the server, I replied to an immediate cancel request just out of courtesy and got offered a reoccurring discount along with the offer to assist setting up the next server panel for me.Overall helpful staff and experts that reply at any hour of the day. (It was almost 6:00 AM EST where I was at.)"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Fabian",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T08:47:26.000Z",
          "Titre": "Review of BisectHosting",
          "Contenu": "Very simple to navigate the server consoles as well as tutorial videos on if you get stuck on anything, the servers run smoothly pretty much all of the time. On top of all of that the support team responds to you really quickly if you have any questions or issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T15:48:39.000Z",
          "Titre": "Terraria server crashed constantly",
          "Contenu": "Terraria server crashed constantly, was unable to stay up for more than 2 hours at a time, lagged, kicked us out, etc. Went to Apex hosting because of how awful this was and have had no problems sinceEdit:I appreciated the quick reply. I only made the review because I got an email asking me about my experience. We had a medium terraria world, vanilla, so I'm surprised that it still was crashing so often. I didn't realize that this package was only for small worlds, so maybe that's something that needs to be advertised better. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Connor Russell",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T17:10:09.000Z",
          "Titre": "Server restarts often on its own",
          "Contenu": "Server restarts often on its own at least every second dayEdit: Support team looked into it and fixed the issue which turned out to be insufficient RAM"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Davide Mazzonetto",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T10:43:04.000Z",
          "Titre": "Good hosting",
          "Contenu": "Good hosting. I paid for a preconfigurated game server but some mods where outdated. The preconfigured service is a paid extra so i contacted the assistance but they linked me the wiki to update it myself, not the best but the wiki was very well made and i fixed the problem fast. Servers are stable and they are very fast if you need something"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Aviles",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T19:48:35.000Z",
          "Titre": "Occasional Freeze",
          "Contenu": "The server worked well, and there were no major lag spikes apart from due to player connectivity. However, there were moments where the server would seemingly stop running and be stuck attempting to restart. The only way to fix this was for me to log onto the website and manually hardstop the server and restart it. This would occur at random times about twice a day. While not extremely detrimental and with an easy fix, it is still not desired."
        },
        {
          "Note": 4,
          "Lieu": "EE",
          "Pseudo": "Hoshy",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T10:26:20.000Z",
          "Titre": "Overall experience",
          "Contenu": "To start with. It is quite expensive to rent Minecraft server like this. I went with Better Minecraft and its ~25 EUR a month. Took 8gb server as recommended by support. Server itself is not laggy mostly but there are times when server just doesn't load the game map and I have to wait in the \"end\" of the world for textures to load in. Also, support themselves are not quite knowledgeable. 1 support person says one thing, another one says something totally different which makes being the server host quite difficult tbh. Was expecting a smooth server hosting with no issues considering the price and recommendation from support themselves, but not quite what I expected."
        },
        {
          "Note": 4,
          "Lieu": "LT",
          "Pseudo": "fellasufferer",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T02:46:11.000Z",
          "Titre": "Great hosting experience",
          "Contenu": "Really liked pricing, server was easy to set up on my own, although I struggled with making server cracked and whitelisted, only time server struggles is when we load a lot of new chunks but that's to be expected from modded 1.19.2 world with only 8GB RAM. Overall, I enjoyed everything about BisectHosting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jack N.",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T22:22:30.000Z",
          "Titre": "Great customer service",
          "Contenu": "Even though in the beginning my server didn't work due to a faulty machine, the customer service was patient and helpful, after some questions they moved me to another machine to run my server off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Backus",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T01:36:46.000Z",
          "Titre": "Couple of bumps",
          "Contenu": "Honestly the server had a couple of hiccups but after that the server ran pretty good and was an enjoyable time for me and my friends."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Tamás Bálint Varga",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T15:05:27.000Z",
          "Titre": "The server was easy to setup and i…",
          "Contenu": "The server was easy to setup and i loved the budget options. I also have to say that website lacked some of the competitors feachures. I’d love to see an easy way to change players game mode and also to teleport them to a specific coordinate not just to another player. Also it would be amazing to see their last death coordinate. And the add button doesnt seem to work on some items like spruce wood etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Whitlock",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:51:22.000Z",
          "Titre": "Server runs great most of the time",
          "Contenu": "Server runs great most of the time. Problem sometimes with disconnects"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Arien Hosseini",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T10:26:00.000Z",
          "Titre": "The server hosting server is great, but it could do better",
          "Contenu": "The server hosting server is impressive, but the server struggles to render in blocks when I’m travelling with my friend. I upgraded from 8gb to 10gb ram, but the issue persists. Playing DawnCraft with 2 people on the server"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jarrod Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T18:59:23.000Z",
          "Titre": "Great service and product",
          "Contenu": "It's been a very simple process with very helpful control panel options and really powerful servers for ATM8. The only issues I've had have come from a few weird connection issues that are more from the game itself. I highly recommend Bisect for anyone looking for a group server."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Queen Huney Bee",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T05:48:19.000Z",
          "Titre": "Timmy",
          "Contenu": "Timmy was super helpful and made sure my needs were met! definitely made sure i had all i needed and answered all my questions. felt like i was talking to a professional in all things minecraft"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Banana Man",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T14:58:02.000Z",
          "Titre": "Good server, cheap, just difficult to understand.",
          "Contenu": "The server is good and is experiencing almost no lag spikes even though the cheap server. My friends like it and I reset it yesterday because we were all cheating and it was supposed to be survival. The only thing wrong it how complicated the server board is if you dont want to watch a 10m long video on it, but with a little bit of learning its all pretty simple and easy to do things."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christian Quintero",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T03:25:37.000Z",
          "Titre": "Easy and convenient to mod and fix",
          "Contenu": "Easy and convenient to mod and fix, sometimes runs slow but overall great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mason McGinty",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T20:47:23.000Z",
          "Titre": "The only reason I took one star off was…",
          "Contenu": "The only reason I took one star off was for the UI. When trying to add more ram to an existing server that I had paid for, I ended up paying more money and what I thought was a 3GB upgrade was actually a downgrade that I got charged for. I immediately got in touch with their customer support line and got a reimbursement and now have an adequate amount of RAM for the server =)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Hunt",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T20:37:47.000Z",
          "Titre": "They make every effort they can.",
          "Contenu": "One of few hosting sites that has live chat accessibility, even if they have to route you to support tickets, they'll sit with you and promptly try to address any of your queries. Troubleshooting goes beyond the norm with manual hardware adjustments if attempted hosting efforts run into resource issues. Only had one ticket where I received a useless cookie cutter response, but many issues can be hunted down in an extensive support desk. The price and terms are some of the best available for gaming servers, with significant flexibility."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DarknessEmbraced",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T16:19:32.000Z",
          "Titre": "The prices and customer service are…",
          "Contenu": "The prices and customer service are both great. The only thing I don't like is that half the settings are missing from my Ark server and you have to add them manually. I've run several Ark servers before over the last 7 years and have never had to do that with other hosts but their help team is always available to assist when you need help so it's only a minor inconvenience."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Gauntlett",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T11:44:32.000Z",
          "Titre": "The website was easy to follow and the…",
          "Contenu": "The website was easy to follow and the desktop app is great! But phone app as well would have been more helpful and when I asked how to migrate the server from the previous provider to this one they only got me to transfer my world and not plugins. I'm on Android and was also having trouble entering commands though the website on Google Chrome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mbrutusv",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T06:55:05.000Z",
          "Titre": "I have no issue with the Factorio…ARK support was interesting",
          "Contenu": "I have no issue with the Factorio hosting service. Everything works as advertised.I inquired about ARK hosting, and the information given was sparse. Something worth looking into is pre-configured ARK server clusters. Most people do not have the technical knowledge to set it up even with a guide. I do, but at that point, I might as well just rent a vps and set up the cluster myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T22:38:55.000Z",
          "Titre": "The server runs great",
          "Contenu": "The server runs great. Me and my friends can play on it with almost no issues. The only problem is that one of my friends has trouble connecting and playing without jittery movement but I thinks it's mostly their internet and not the server."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Ahmad Ansori Palembani ZiRO",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T12:25:31.000Z",
          "Titre": "So far, amazing service",
          "Contenu": "Amazing service. Although there are some missing features such as whitelist manager (maybe they have it already, but I can't find it)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rahul Hegde",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T03:03:15.000Z",
          "Titre": "The setup was made very easy but..",
          "Contenu": "The setup was made very easy but... the server is a bit laggy. That may be just because of the fact that it is running a heavy modpack on perhaps a bit too little ram -- I'm running Roguelike Adventures and Dungeons 2 modpack on minecraft on 5gb ram. 5gb was the recommended minimum but the server is still laggy at times. The administrative experience was good though. Either the recommended minimum ram for the server should be changed or performance should be increased for 5gb for the existing suggestion to be valid."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Bubbles",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T18:57:54.000Z",
          "Titre": "Amazing Customer Support",
          "Contenu": "Amazing Customer Support with insanely fast response times. Helped out with all my issues and resolved them effectively. Server crashes from cascading world gen lag often if we are exploring though and cant seem to resolve the issue but plan to contact support after my holiday."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Asher Playzs Target",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T15:35:37.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service, fast response and friendly staff. The server never crashed and overall felt like i was playing in a solo world with the little amount of lag. Only takeaway is how expensive the server is, maybe lower prices 1 or 2$"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jamie Timuik",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T05:45:12.000Z",
          "Titre": "Honestly I've used 2 other providers…",
          "Contenu": "Honestly I've used 2 other providers before and the hour of setup it takes is something I've gotten good at, but spending the extra money to instantly have the server up and going was a great feeling and auto restarts I don't have to code is nice.overal  just a bit pricy but it's worth"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Miles Brinkerhoff",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:32:28.000Z",
          "Titre": "Great for loading pre-made modpacks",
          "Contenu": "I choose this platform for my sever because it was the easy to install pre-made modpacks from cruseforge. I do fine it expensive because the lost tiers do not have enough ram. However if you spilt the cost between friends it is not too bad. Another pro is their customer service and support team. I had an issue and they resolved it for me quickly. I would recommend to a friend"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "JulieBeans",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T05:18:18.000Z",
          "Titre": "The setup and upload of my server was a…",
          "Contenu": "The setup and upload of my server was a little tricky as i've never done anything like this before, and my internet was decidedly patchy (thanks ISP). The operator who helped me was very patient after he worked out what i was trying to do."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Blakpurple Quintini",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T16:00:13.000Z",
          "Titre": "Excellent you can save money",
          "Contenu": "Excellent and save your money it's very cool for small minecraft server and big it make you to recive a bit of money you use for the server whit the allowed shop"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ido Biran",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T03:22:07.000Z",
          "Titre": "Great Service",
          "Contenu": "the service was amazing: reliable, super fast response time, and overall just really easy to communicate with. The support staff did an amazing job helping solve my problems and it impressed me how they were patient with me the entire time. I would highly recommend!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Francisco  Gavira Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T15:20:09.000Z",
          "Titre": "The experience of playing in a server",
          "Contenu": "The experience of playing in a server is my Friends is pretty good overall, but there are some things that i wasn't able to configure, like the simple voice chat mod, since i had a budget server instead of the premium one. Nevertheless, almost everything is working perfectly, and there's only a little bit of lag in the server, something understandable since we are 17 people and there are many mods. Overall we are having a good experience and we're Happy right now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew Hansen-Judd",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T09:39:04.000Z",
          "Titre": "Easy to use but expensive.",
          "Contenu": "I think this service is way too expensive. You have to pay too much for an actually good server. Edit: I looked back at this review, and while it's true, it's still a very good server hosting service and has a very easy to use interface making it user friendly."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Zulu",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T22:51:04.000Z",
          "Titre": "Service was what you'd expect",
          "Contenu": "Service was what you'd expect, cheap, easy to order and 100% uptime. Problem comes when you want to cancel the service - you can't just cancel the service, you _request_ to cancel. It's been 3-4 days and I still have not had my request accepted."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ashleigh Marlow",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T13:49:48.000Z",
          "Titre": "Customer service is good but the IT is a bit rusty",
          "Contenu": "The staff like Timothy G are very quick at responding and being relatable. I gave it 4 stars for the service staff for how nice they were after an issue but it can't be 5 stars due to the IT problem which could have been avoided. I had requested a mod be removed our server, they were quick to respond and complete the request but did not back up the server (although i did not tell them to, it is highly assumed you do it by default). They warned me about visual glitches when removing the mod and it did happen so we requested to go back to our original before removal but it was 5 hours prior to the mod removal which caused a lot of lost progress, many repeated restarts to a certain point and most people to quit. As i said the staff are lovely, were very sorry and gave a discount on the next payment but yeah a easily avoidable mistake."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Blokey Bolocker",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T11:11:27.000Z",
          "Titre": "Great Connection And Performance But One Thing",
          "Contenu": "I have been hosting a Modded Minecraft server for 2 weeks now with Bisect Hosting and have been impressed with their 4GB plan cheaper than most other hosts.I was impressed with their connectivity and performance.Although I was dissatisfied that you must pay extra for a custom IP which meant I could not add support for bedrock clients to connect to the server. I would be more satisfied if it was more accessible to upgrade an existing server to one with a custom IP.Overall great server hosting but needs to make server upgrades more accessible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T04:15:28.000Z",
          "Titre": "Gets the job done",
          "Contenu": "Server crashes when riding vehicles too quickly. Editing server settings such as length of days or xp % gain was a little confusing to change but the guides provided made it easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriel Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T05:21:55.000Z",
          "Titre": "service is good.",
          "Contenu": "The server is pretty good for the price that I got it. I usually only really play Minecraft for a month at a time, so being able to spend that time with other people is really nice. The control panel is easy to use, and changing modpacks with the premium pack takes literally seconds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T19:11:03.000Z",
          "Titre": "Overall great hosting platform with one major drawback",
          "Contenu": "Overall great hosting platform.  My major complaint is that I can't see server hardware usage stats by default.  I used Apex hosting in the past and would have again, except they didn't have the pack we wanted to play.  They have usage statistics enabled by default.  I did notice a plugin to view resource usage on your site but after installing the plugin my server continually crashed on startup and I had to restore it to an old backup.  We didn't lose any progress but I found the entire experience frustrating and wish usage stats were automatically tracked, not locked behind selectively functional plugins.Overall I am happy with my experience using Bisect, It is comparable to Apex in every way except the usage stat readouts.  However, since all else is equal this one issue does mean I would go back to Apex given the option.  I remain here because you have a wider offering of mod packs.  If/when we move to another pack that Apex does offer I would return unless the stats are added/fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Antonio Zaragosa",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:54:27.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service, after a issue I had and went to customer service it was being looked at and being fixed in less than an hour! Prices are just a little bit high but that's just me:)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T18:43:17.000Z",
          "Titre": "The help staff here at bisect are some of the best I've seen!",
          "Contenu": "The help staff here at bisect are some of the most kind and personable people I've met when needing help. I love that I can tell how I am not talking to some bot or AI. My one grievance was the speed I got my help. It could take up to 15 minutes to get an updated response, which was pretty not fun when I was ready to go to sleep at 2am. Nevertheless, I'm glad I was up waiting for them and not some bot or rude staff member."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tadhg McDonald-Jensen McDJ Sol",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T19:00:30.000Z",
          "Titre": "Server is easy to configure and stats…",
          "Contenu": "Server is easy to configure and stats are useful, had some issues one early morning (5-6am EST) where the server was trying to download a config file from somewhere and failed so it couldn't start, and the mod \"serializationisbad\" was clearly enabled by bisect hosting as I did not recognize it and when I disabled it, it immidiately replaced itself on next boot. But other than that morning server is working great."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dev",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T05:53:47.000Z",
          "Titre": "Overall Satisfied",
          "Contenu": "It's pretty good, my friend and I were both surprised how smoothly the game ran; we were expecting a bit of delay considering we chose a pretty small amount of RAM for such a big mod."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ekowastooshort",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T13:49:38.000Z",
          "Titre": "Fun and reliable :)",
          "Contenu": "Good services and very easy to u set stand how to use. If you are planning to play modded or vanilla, BisectHosting is a great option (DONT FORGET TO USE DISCOUNT CODES!!!)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ethan Combe",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T02:31:47.000Z",
          "Titre": "Extremely prompt and helpful every time…",
          "Contenu": "Extremely prompt and helpful every time i’ve had an issue. actual service is spotty at times and only functions smoothly when no new chunks are being loaded"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Synquer",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T17:12:11.000Z",
          "Titre": "Own mods",
          "Contenu": "It works really well with instructions in youtube videos but i didnt find how to install my own mods into the server"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "MS",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T07:54:35.000Z",
          "Titre": "Budget friendly but lack information",
          "Contenu": "Price point and easy to start a basic server. However, there's not enough knowledge base (or maybe I failed to find one) to help setting up server properties. I have to google/search and learn myself how to do it."
        },
        {
          "Note": 4,
          "Lieu": "VE",
          "Pseudo": "Andres Velásquez",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T02:49:48.000Z",
          "Titre": "I was looking to create a custom…",
          "Contenu": "I was looking to create a custom Minecraft server to my small community, everything was fast and easy to set up, their support is really fast and servers work pretty well with great prices too.But I wish they had far more games to host, like the mytical counter strike 1.6"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Serra Souza",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T17:40:04.000Z",
          "Titre": "Great and easy to use so far!",
          "Contenu": "So far it’s been a few weeks and everything is working great. Had help from you guys when setting up a server and the people were very knowledgeable and friendly. I’m very happy with the service and the experience I’m getting out of it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peyton Wolf",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T02:40:03.000Z",
          "Titre": "It's almost perfect",
          "Contenu": "It's almost perfect. I love the amount of modpacks that I can choose from and the amount of people that can be on a server but I don't like that some of the mod packs make the server lag. I understand that it depends on ram but even with decent ram it still can a lag alot."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ookahalla",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T07:50:48.000Z",
          "Titre": "Modded minecraft server",
          "Contenu": "Easy to get set up and play, with no hassle at all. I'm sure there would be help if I needed it but so far there's been no issues with the servers. No lag to boot, overall a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PaperMon",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T02:46:53.000Z",
          "Titre": "Everything goes perfect",
          "Contenu": "Everything goes perfect, there's exceptions for sure but I am really happy whit the customer support,tanks"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Neonalig",
          "Nb_Reviews": 4,
          "Date": "2023-05-05T03:03:24.000Z",
          "Titre": "Server was relatively painless to setup.",
          "Contenu": "Server was relatively painless to setup, and once finished, works like a charm. The biggest issue is the lack of easily visible documentation. The host clearly focuses on Minecraft server hosting, but other games like Terraria struggle a bit from over complication and duplicate configuration files which don't work. Some visible documentation on the portal itself, instead of having to go searching, would be very useful. Especially for basic things like adding mods and creating a world."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Angelofdoom",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T21:33:24.000Z",
          "Titre": "Great service great support team",
          "Contenu": "Great service great support team easy to sign up good ui easy to navigate the one problem from it 5 stars is the tickets links make you sign in when you have forgot your password and can't reset it because you forgot your security question and all the links to make a new password still need you to sign in/use your security password other than that great stuff 9.5/10"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alice Poplin",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T02:37:24.000Z",
          "Titre": "Fantastic! Had to generate a new world tho",
          "Contenu": "I used a guide published by you for your server management website to upload my own world to be the server world, but it wouldn’t work despite following the instructions published. Ultimately that wasn’t a problem in the long run, but it was nonetheless an issue I had."
        },
        {
          "Note": 4,
          "Lieu": "MD",
          "Pseudo": "Dark Symbol",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T18:02:56.000Z",
          "Titre": "Pretty good server host.",
          "Contenu": "No massive problems with the server. Pretty good and responsive support. I gave it 4 stars because I'm angry from other irl matters, if I wouldn't be angry I would've given it 5 stars. Good job people."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Robin - FarmerJohny",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T21:39:43.000Z",
          "Titre": "Fast and good service. But I'm german",
          "Contenu": "Fast and good service.\"Only\" 4 Stars not because I'm german, it's because the walkthrough the Interface is kinda much If you just want to go setup and play"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Riccardo Piccioni",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T00:21:18.000Z",
          "Titre": "really great hosting a bit of lag prob…",
          "Contenu": "really great hosting a bit of lag prob cause of ram but yea really great hosting, ill' def buy it all the times if 4gb was 5$ instead of 10$"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance Van Ostran",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:08:27.000Z",
          "Titre": "I've used bisect for several of my…",
          "Contenu": "I've used bisect for several of my servers with friends for a couple years now. The server has never had any major issues, and minor ones were usually caused by myself and were easily fixed. They have a very user friendly website with wiki-links and tutorials to help you with just about anything. On top of that any time I've reached out with help their response has been quick and they always got the problem solved. 10/10 service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Scovill",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:55:44.000Z",
          "Titre": "The server is actually really smooth",
          "Contenu": "The server is actually really smooth and the set up process was extremely painless. I used to use another host but they seem to have fallen hard compared to what they used to be so I opened my horizons more. Honestly my favorite feature that I have noticed lacks with most hosting is being able to view the console even with the server off. Such a simple feature but it easily has made the most difference for me."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Roy Tommy Tobiassen",
          "Nb_Reviews": 7,
          "Date": "2023-12-18T19:50:09.000Z",
          "Titre": "Amazing support",
          "Contenu": "The support on this hosting site is next level. They respond usualy within seconds to any and all issues. The support team works with you trough the issues you might have. Me coming to Bisect from another hostingcompany due to the lack of quality in their support, i found Bisect to be a god send! Their user panel is modern and easy to navigate.10/10 and i will continue to host all my servers from them going further :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EXSilver",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:01:17.000Z",
          "Titre": "Customer Service",
          "Contenu": "The people at BisectHosting are the most kind and patient customer service I have had in a while. They were understanding with my situation having all my question's answered and amazing response time and having affordable servers. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Dytmire",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:46:30.000Z",
          "Titre": "These servers seem to be more balanced…",
          "Contenu": "These servers seem to be more balanced than any others that I have ever rented. Managing the servers and backups couldn't be easier."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Platitron",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:03:31.000Z",
          "Titre": "Super reliable and easy to handle",
          "Contenu": "Amazingly responsive customer support. It's very easy to do whatever you want with your server because the support is always here for you whenever you got any problems. Super stress free and enjoyable."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "AngL",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:02:39.000Z",
          "Titre": "Support experience",
          "Contenu": "The best support I've had the privilege of dealing with. They respond almost immediately. They don't play games and are honest and very helpful when solving problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Petry",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:43:37.000Z",
          "Titre": "customer service listed to what i had…",
          "Contenu": "customer service listed to what i had to say and wasnt afraid to push it off to someone who actually had the answers to help instead of giving me the same information 14 times. A+ for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "-Abstract SD-",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:39:33.000Z",
          "Titre": "Great energy and even better service I …",
          "Contenu": "Great energy and even better service I  have been struggling with datapacks for a month or so and with 30-40 min a month of struggling disappeared"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Georgie Cartagena",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T11:24:29.000Z",
          "Titre": "Best service I’ve ever gotten",
          "Contenu": "You guys helped me in every way possible when I had tried another service and didn’t get any help because their page kept refreshing. I’ve been able to play on my terraria server perfectly with my friends and even got and extra gb or ram from one of the helpers! Amazing service and will always come back when I want another server :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Val Chumak",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:55:31.000Z",
          "Titre": "I was running into an annoying issue…",
          "Contenu": "I was running into an annoying server issue and the specialist at Bisect helped me out quickly, knowledgably, and explained everything they were doing during the process just so I would understand too.Best server hosting service."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Diamon Sword",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:01:30.000Z",
          "Titre": "Diamon's Customer Experience",
          "Contenu": "the Incredible kindness even though i might be a bit annoying, they still keep it friendly and it's also amazing how the operator tries different changes to the code in the server to fix it, they nail it. I gladly restarted my server about 5 times for his tactics, he apologised for the server restarts but i said that there's no need to apologise, as i know it's the main way the server updates. Please thank Thomas P for me, he is a GREAT operator for getting the attention of the plugin-creator for me so I could fix it with the creator himself!Thomas even told me about the Discord that I could watch for answers after he created a support tab in the Discord server of the plugin's creator, so the use of Discord is great with you guys it seems, which is very important these days, and it's nice to know that I'm not the only one that uses Discord, mainly to know that a company such as you guys use it, as it's not often i have seen that :DThank you SO much Thomas P, you are incredible for getting me the help i needed.Have a lovely christmas and new-year-Diamon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chance McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:12:56.000Z",
          "Titre": "Good Support",
          "Contenu": "Almost instant responses and assistant, they asked the questions they needed to know, and got everything setup in a timely matter. They were also very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:36:16.000Z",
          "Titre": "Reliable, fast and easy to use",
          "Contenu": "Simple process to set up and use. Sever runs great with no lag. Tons of features in the control panel that are easy for anyone to understand. I’ve been running Minecraft servers from home for a couple of years and I switched to this because of speed, ease of use and reliability. I would recommend this service to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caitlan  Halvorson",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T17:58:56.000Z",
          "Titre": "Fast, Friendly, and They LISTEN",
          "Contenu": "Timothy G didn't even hesitate to help me push my payment out due to financial struggles AND keep my server up and running. They're always around to answer questions no matter what time of day and super helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Blanco",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T03:49:54.000Z",
          "Titre": "Service support 10/10",
          "Contenu": "Quick to answer and showed clear experience dealing with problems and usual ways to solve them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "malcolm vallier;",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T17:02:46.000Z",
          "Titre": "Needed a server for a buddy and I",
          "Contenu": "Needed a server for a buddy and I so I rented one very rare we will get disconnected but every now and then it happens however this had happened when I ran the server myself so I don’t think it’s bisect they work good"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Cray",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:52:08.000Z",
          "Titre": "Great Ticket Support!",
          "Contenu": "The Support was responsive, simple and direct. As someone who has never hosted a minecraft server, it was very easy to follow the steps and execute them. The server in the end did aswell achieve better performance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Hall",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T05:20:52.000Z",
          "Titre": "BisectHosting is Absolutely Amazing!!",
          "Contenu": "BisectHosting has been amazing! The setup is super simple and they do almost all the work for you. Customer service is outstanding and they go above and beyond to take care of you. I highly recommend BisectHosting for any server hosting need you have!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Delta FoxtrotMaster07",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T18:29:32.000Z",
          "Titre": "Good Service, Good Experience",
          "Contenu": "Our Minecraft Server had a Deamon connection Error...Was fixed within five minutes of sending in a ticket on a Thursday Morning! :)"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Nobody",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:16:43.000Z",
          "Titre": "Incredible service",
          "Contenu": "It's a wonderful service, the server are fast, configurable, the dashboard is clean and easy to understand. even if you have trouble with it there are many video and text tutorial. and even then if you still have trouble their staff is quick on the response and kind. glad I choose them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan Streckfuss",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:05:23.000Z",
          "Titre": "English based!",
          "Contenu": "I've only used two groups, y'all being the second, and the first one was a German based company so I never understood their emails. Thanks for being English language based! (Also very easy to understand platform)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Xaiver Regalado",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:34:18.000Z",
          "Titre": "Bisect is awesome",
          "Contenu": "Well every time I have had a question needed help or even made a mistake all my own. Bisect has gotten back to me and helped me through whatever my problem was under an hour after I asked usually less. its one of the best experiences I have ever had with a company."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "YoussefSegBari Spain",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:20:34.000Z",
          "Titre": "The best hosting that exists, everything is perfect, and if you have some problems, they help you as quickly as possible, that's why this company is the best, don't wait too long to buy their services",
          "Contenu": "The service provided by this hosting company is the most professional, I have not seen any company so far that is like this, fast and efficient customer service, and the servers work correctly.I would always recommend this company to users."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "CrashingSounds",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T17:06:37.000Z",
          "Titre": "Overall great performance",
          "Contenu": "Overall great performance, and a very helpful service desk with swift response. These people know what they're talking about!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alex Love",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:55:17.000Z",
          "Titre": "Had our server set up in 15 minutes…",
          "Contenu": "Had our server set up in 15 minutes with the world I was hosting locally. Support is very fast and responsive"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "João Garção",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:11:25.000Z",
          "Titre": "Amazing, just amazing!",
          "Contenu": "I couldn't describe a better support experience, they went above and beyond what I could expect. Helped me, more than they should've had!Amazing!"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "honzik",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:01:38.000Z",
          "Titre": "Support (Timothy G best support)",
          "Contenu": "The best support I ever had. Fast replies and very friendly people. The server dashboard is very noob-friendly even someone like me who never hosted a server this was so easy. \"Timothy G\" is the real G in the support team very friendly and a nice guy and of course helped me a lot. Much recommended service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T08:50:13.000Z",
          "Titre": "Amazing Support Team!!",
          "Contenu": "The support team was insanely helpful with very quick responses. Did whatever they could to help me fix multiple issues on our end. They reinstalled plugins, unpacked whole server zip files when we wanted to transfer all of our information, it was amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathan Reynolds",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:53:06.000Z",
          "Titre": "Very good first server host",
          "Contenu": "The premium Minecraft server was excellent. This was my first Minecraft server, so I wanted something easy to use while still being advanced enough to learn on. I could not have asked for a better host for this purpose."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Frazier",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:33:13.000Z",
          "Titre": "The people are great to work with",
          "Contenu": "The people are great to work with, they have solutions and do everything they can for me. Please give everyone who worked on my account a raise!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevor Abare",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:29:05.000Z",
          "Titre": "Dustyn W Helped us get our server going…",
          "Contenu": "Dustyn W Helped us get our server going in mins when it took us all day with no luck This mans gets nothing but the up most praise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Addie",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:24:06.000Z",
          "Titre": "Quick responses",
          "Contenu": "Quick responses, and friendly attitude! glad I was able to have my issues resolved so quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megacacti",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:47:21.000Z",
          "Titre": "The server ran incredibly smoothly even…",
          "Contenu": "The server ran incredibly smoothly even with 10 people on. Also I absolutely loved the stickers the only thing is that I would love to have atleast a small variety of stickers to choose from"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "bob the builder",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:35:52.000Z",
          "Titre": "Utterly incredible",
          "Contenu": "I had Timothy G and he was incredible, he put up with my onslaught of questions and provided helpful links and aided my server being created!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ze",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:11:24.000Z",
          "Titre": "Some of the best customer service i have received",
          "Contenu": "So when it comes to actually doing the behind the scenes stuff, i'm mostly clueless. But customer support agent Hunter was fantastic at helping me and providing useful information and links. they deserver as much praise as i can offer them"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Thomas Geneau",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:57:14.000Z",
          "Titre": "Quick and helpful",
          "Contenu": "Quick and helpful . If you need a minecraft server running not on your own PC I totally recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T19:03:30.000Z",
          "Titre": "Review; 10/10 Server Service.",
          "Contenu": "I've been using different server services a while. I've had Minecraft since it was in Alpha 1.7.3 and still occasionally come back to it. I've run my own server out of an old machine I threw linux on, and had a lot more success there than with previous subscription servers so I stopped using them for a while. Me and my friends wanted to do a modded run this time, and after failing to build our own little vanilla+ pack for it, we quickly switched to BMC4, adding a couple mods. We found that BMC4, much like many other premade packs, simply doesn't work immediately when you drop it on a forge server. There's something the authors forgot, perhaps, or the version is out of date, or whatever the case, we quickly ran into headache, and this being short notice, I didn't have the time or medicine to suppress the inevitable migraine, so we went and purchased a server off BisectHosting. We weighed our options of servers and our pings and picked a budget server that fit what we needed better than available Permium servers.So far so good. The service gives full access to the files of the server without needing and FTP app open and connecting. You can simply drag and drop like most modern websites (I wanna guess React was used but I've not looked at any of the web code and likely won't bother to) and quickly situates the files correctly. Every mod pack you could want to run is preset and working, the service loads it all up and runs the server instantly, letting you get right to playing without any hassle. Whole packs and individual mods both are super easy to change and reinstall with different versions, right inside the gui of the website.It's a bit on the expensive side, even with a discount code on the first month, but the service is 100% worth it. I haven't had a single issue server side that wasn't user error. That's incredible, I remember a number of other services having server lag at weird intervals, and I can safely say I haven't seen anything of the sort running with 4 people on at once. We anticipated more and so have paid a little more for the extra power/space, but it likely isn't the only reason this service runs so smooth.The layout is a little wonky, but once I figured out everything was all set and I could manage the server with ease all while playing on it as well. 10/10 would recommend, they're hands down the best option for Minecraft gamers if any type."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriel Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T11:30:58.000Z",
          "Titre": "The first week of purchasing the…",
          "Contenu": "The first week of purchasing the service I did have issues with the server but were quickly and expertly resolved by your team! the turn around time to getting my questions answered is fast definitely made the right choice in using your services"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jomarie  Dagdag",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T01:57:20.000Z",
          "Titre": "Excellent and Highly efficient service.",
          "Contenu": "The Layout isn't as confusing as other services I've used.Editing configurations are simplified too which makes it feel efficient.There's also a Help button on the corner which really does a lot for me because I don't know much about server hosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colton Nicpon",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:28:50.000Z",
          "Titre": "My go to Server Hosting",
          "Contenu": "The staff was crazy fast and helped immensely. I was so confused about something... I then sent one ticket, and they responded--I kid you not--3 minutes later, saying they would do it for me. (Install a mod pack on the server) If you are ever wondering what hosting service to use, give this one a chance."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Keko",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:09:37.000Z",
          "Titre": "Good support",
          "Contenu": "Had great moment with support that helped me with servers problems very quick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:43:00.000Z",
          "Titre": "AMAZING CUSTOMER SUPPORT",
          "Contenu": "I was struggling with server issues trying to get a modpack to work. LUCKLY I had Timmy to help me and was SUPER helpful and patient. We had some struggles with the versions but got it all working in the end. AMAZING team!!! I will always go to them if I am ever having issues because it is instant help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hannah L.",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T05:41:10.000Z",
          "Titre": "Give Ray a Raise",
          "Contenu": "Ray was such a huge help in getting the server up and running. I'm not tech savy in the slightest so having their help really made this whole experience the best ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Judd",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T23:27:08.000Z",
          "Titre": "Top Tier CS",
          "Contenu": "I don't even host with bisect, but the customer service was absolute tops. I play on a friends server hosted with them and I just had some questions, they worked with me, talked with me, answered everything very fast. The server has always run well, and honestly, you don't get better than good customer service like that. Seriously, I don't even pay them for anything and they treat me like I'm an old friend. That's top tier. Much love for Bisect."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "FeezTaa",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T02:22:44.000Z",
          "Titre": "Very quick and easy with live chat",
          "Contenu": "Very quick and easy with live chat, they answer right away, and the servers don't lag and you can mod them to the fullest degree, 100% suggest this company!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "jarik forsberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T13:22:16.000Z",
          "Titre": "Always helpful",
          "Contenu": "Always helpful, no matter what the question is. Replies within a few minutes even with a low priority ticket. I've asked a few questions and never gotten a \"we can't help you with that, sorry\". They're always trying to help no matter what the question is. 11/10 Service for sure!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "TNYT Business",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:18:39.000Z",
          "Titre": "Anna - Best support agent!",
          "Contenu": "Anna, my support agent, was so helpful. Changed my info to keep me anonymous, etc. Best person!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Howell",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T04:21:20.000Z",
          "Titre": "Easy to understand upfront pricing with…",
          "Contenu": "Easy to understand upfront pricing with detailed services made it easy to choose. Quarterly discount was nice and monthly rate is acceptable. The server runs great with 8GB RAM and our custom mods and world's were easy to upload with the excellent guides provided. Overall 5☆ and I would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Florie Jo Hickman",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T05:51:22.000Z",
          "Titre": "KNOWLEDGEABLE REAL PEOPLE",
          "Contenu": "KNOWLEDGEABLE REAL PEOPLE. cheers! I’m a new server owner and I was assured that things happened and got multiple of my issues fixed from not knowing how to add plug on to data pack glitching. ALL tickets resolved in one day. Give the staff some holy water to cleanse all the sins I’ve caused."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Hunter Hays",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:18:03.000Z",
          "Titre": "Great Hosting Service",
          "Contenu": "Bisect hosting is super straightforward with great prices. I am hosting a terraria server with 8+ mods that runs perfectly. It took me about 15 minutes to get the whole thing setup because Bisect Hosting has step by step tutorial videos on how to make it all work."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Rick Stefan",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T14:05:49.000Z",
          "Titre": "All in all good",
          "Contenu": "Not too complicate, easy to set up, and good customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TheAlgothram",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:50:34.000Z",
          "Titre": "It's been a fantastic trip!",
          "Contenu": "It's been fantastic. Great servers, no lag, it all works perfectly! Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mo feldman",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:55:57.000Z",
          "Titre": "Both Ray S and  Ashley L have been…",
          "Contenu": "Both Ray S and  Ashley L have been fantastic reps. and i really appreciate how easily they made it for me to open a 16gb server with a custom mod pack!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh T.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:53:00.000Z",
          "Titre": "Good experience for a first time server renter",
          "Contenu": "Easy to use website with everything I needed to know easy to find in the help section. First time renting a server and I have no complaints!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tsuno_Hikari",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T21:26:23.000Z",
          "Titre": "The response team is always on top of things",
          "Contenu": "The response team is always on top of it and willing to switch members to get your problem solved at any point in time! This is the only and best hosting service I have had to date. I don’t see myself switching to anyone else any time soon. Leave reviews so they can get more people to good quality servers with low lag I have 1mb/s and get 40 - 60 ping to my server"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Green",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:27:15.000Z",
          "Titre": "He did amazing!",
          "Contenu": "The worker stayed up late just so he could help us with some questions which then turned into him setting up the server which we really appreciated! I’d gladly have him help again with how quick and helpful he was."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MCExpress",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T20:45:23.000Z",
          "Titre": "Custom JVM Flags",
          "Contenu": "While the server host does not let you add your own JVM flags, I reached out to the support team and they added the custom flags to my server. I received replies within 24 hours. My server is running smoothly and it allows me to pretty much customize everything. I had another server issue and the support team replied to me within MINUTES. Truly awesome!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Roketchu",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:01:41.000Z",
          "Titre": "Very good server for cheap compared to…",
          "Contenu": "Very good server for cheap compared to other services, best service i have experienced, i have made a modded server for me and a dozen of friends on a 6GB server and it handled it perfectly with surprisingly no lags issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chandler Bonnette",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:22:19.000Z",
          "Titre": "Server Access",
          "Contenu": "The ease of access to your server. Going through other providers, they offer very difficult to navigate menus, especially when it comes to canceling a server. With Bisect, everything you could possibly need information wise is there for you. Not to mention their great customer service team that’s there to help any questions you might have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edgar",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:38:43.000Z",
          "Titre": "The setup of the server was quick and…",
          "Contenu": "The setup of the server was quick and no complications."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ScottishGoliath",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:43:25.000Z",
          "Titre": "Rust admin/server owner!",
          "Contenu": "I have been an admin on rust, also server owner. I have used a lot of services but this one has been great, its stable, easy to use and really worth the money. Easy use knowledge base with videos to walk you through the processes to start up and get everything rolling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Griffin",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T09:05:39.000Z",
          "Titre": "Dylan has been great!",
          "Contenu": "Dylan has been great so far and has been very responsive with me.  Can't recommend him enough and hope we can get this issue sorted out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordon Young Local bears UMAIN",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:25:39.000Z",
          "Titre": "Good pricing, minor lag",
          "Contenu": "I’ve been having a great time playing with my friends in a modded Minecraft server. The modding process is super easy, I don’t experience much lag back, and despite going with the budget option, it runs great! Also the stickers are very nice :) edit: I’m running a 1.12.2 server with 4 GB ram and 75 mods. It does occasionally have client side issues where you may disconnect if you are running a potato of a computer, but after the first hump, I can successfully get in most of the time, which is better than shockbyte and apexhosting, which are less user friendly."
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Audrius Vilkevicius",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T04:10:56.000Z",
          "Titre": "I'd say not bad not bad but need more options",
          "Contenu": "Support is absolutely amazing. Almost fixed all my problems with arma 3 server and to be continued, one down side if u buying arma 3 server u can't change the ram only if u make ticket. Also support gave me 1 free gig to test out arma 3 problems I had, it seemed I needed to download more ram I guess to work. Also they changed my node to new one after I had some rubber banding. Overall worth it"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "jaimeglz92",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T23:00:34.000Z",
          "Titre": "Very VERY fast support response time",
          "Contenu": "I have created two tickets for issues I had and both were answered blazingly FAST. One of them was even on a Sunday morning and the problem was fixed in less than 10 minutes. The support agent also explained the problem and told me how to fix it by myself in case support was slow. Definitely will continue hosting my game servers here! Please allow us to swap to Ark servers! :D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joshua davidson",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:10:27.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, super fast customer service, and they always make everything right. I purchased an 11 gig all the mods 9 minecraft server for myself and friends to play on. The set up was a breeze and at first i experienced some lag so i submitted s ticket and got a response back within 15 mins! They went the extra mile to remedy this by migrating my server to a different node and it has been buttery smooth since. Updated the atm9 version recently and the gui took care of everything i had no configuration to make at all. Overall i am very impressed with the quality of the service and customer support is top notch. THANKS BISECT HOSTING you guys are great"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bryan Adamson",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T18:44:34.000Z",
          "Titre": "Amazing service Amazing people",
          "Contenu": "i was having troubles with a server and these guys went above and beyoon for me they spent a whole week trying to fix my problem, problem turned out to be the game it self being poorly optimized and they switched out my server for a diffrent game they rent servers for and they did all this for free. I have to say Bisect Hosting is my favorite server hosting site. Keep rocking guys!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carson Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T06:06:20.000Z",
          "Titre": "i dont know who this is going out to…",
          "Contenu": "i dont know who this is going out to but give my boy Dylan F a raise, i never had better service in my life. I know Dylan will help me figure out what i need in a matter of minutes when i see his name in the top right."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Vlascort",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:40:06.000Z",
          "Titre": "Great Ticket Support",
          "Contenu": "They are really active when it comes to responding to my ticket support, and they were fast at fixing my issue when I was in need. Really appreciated!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "brian larmour",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:06:34.000Z",
          "Titre": "quick simple service and even the help…",
          "Contenu": "quick simple service and even the help with getting set up was very helpful and quick responses"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Darius Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T09:51:34.000Z",
          "Titre": "Great service!",
          "Contenu": "Bisect team is always available for help with skilled staff and easy to use interface and control panels. The server locations are fantastic as well to cater to any region. Great deals and VERY affordable services for any modpack size or group."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "SZU HAN YANG",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T00:55:50.000Z",
          "Titre": "Real Tech Support person answering you in seconds. Enough said.",
          "Contenu": "In today's world, you almost never run into quick and responsive customer service. Anna and Dustyn from the support team answered anything related or not related to the purchase and held my newB hand from making the purchase all the way through. Till I can start playing. It's THE BEST online experience I have had in a long time. Thank you, Team BisectHosting!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiesole",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:55:40.000Z",
          "Titre": "Dustyn is awesome!",
          "Contenu": "Dustyn responded quickly, was courteous, and worked with me to find a solution to my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan Hopkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:32:56.000Z",
          "Titre": "Support was beyond 5 stars",
          "Contenu": "Normally I don't do reviews but I was worried about server performance based on the pricing of the plan I had selected. I spoke with Trevor B and he was extremely helpful with getting a mod installed on my server so I wouldn't have chunk lag anymore. He assisted with the actual forge link to the mod, the link to adding a mod and even mentioned how to backup server files before doing so just incase anything goes wrong.Very professional and very informed individual. I appreciate his help a bunch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caleb",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:18:14.000Z",
          "Titre": "Very enjoyable to work with interface…",
          "Contenu": "Very enjoyable to work with interface was a bit a confusing at start but it’s really easy to get the hang of it thanks for the great server hosting for GTNH because GTNH is GTNH and everyone knows how that goes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A T Amasia",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:28:54.000Z",
          "Titre": "Timothy G was fast and salved my issue",
          "Contenu": "Timothy G was fast and salved my issue! Perfect customer support from Bisect hosting!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:58:25.000Z",
          "Titre": "i bought the 4gb budget server and its…",
          "Contenu": "i bought the 4gb budget server and its amazing!i love playing it with friends - i have experienced no problems and ive had it since the start of october. i made a custom modpack, and it was installed to the server within a few clicks! it only took a couple of minutes of playing around with to start playing. even though this is my favourite server host for the fantastic servers they provide, but their customer service is unmatched. they are very quick to respond, are very polite and were able to solve all my problems.10/10 service."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jomarie  Dagdag",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T08:49:54.000Z",
          "Titre": "Fast response",
          "Contenu": "The customer service is quite responsive. That alone, is what I consider the best factor.Having a provider that cares about the customer is always a must."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Christopher Almonte",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:41:16.000Z",
          "Titre": "Amazing Minecraft Modded Server Hosting Service",
          "Contenu": "The thing I love the most about using BisectHosting is the quick response from the Support Team. I started using the service because my friends and I wanted to play Minecraft with Valhesia. Having it pre-installed, and with the guidance of the Support Team, we've been having a lot of fun playing and also tweaking our server for our liking.I would recommend this for anyone who's not very experience in creating a Minecraft server due to easy way to pre-install mods. My only complain would be to have a server closer to me (we all play from the Dominican Republic, the closest server we could get was NJ, USA)"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Angelo Montoya",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:07:16.000Z",
          "Titre": "Fast response to my ticket"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Hyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:53:13.000Z",
          "Titre": "Anytime I had an issue the support team…",
          "Contenu": "Anytime I had an issue the support team was very effective and helped greatly, they even helped me clear up lag issues."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:23:20.000Z",
          "Titre": "Great quick response and issue solving"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doodert",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T15:46:33.000Z",
          "Titre": "The staff were cool.",
          "Contenu": "The staff were cool.My major issue is the fact that I didn't catch the feedback, and realized just how many feedback requests I had in my email, with frowny faces etc.That's a bit much. Whatever this trustpilot thing is, not a fan, and it makes me not want to put in more service requests because I'm just going to get more spam mail."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jonnilip",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:30:38.000Z",
          "Titre": "Probably my favourite Minecraft server host",
          "Contenu": "Tried Bisect for the first time for a Minecraft server and it is incredible. Easy to use, helpful tutorial videos and good quality speeds at a great price. I've used a few companies now for my Minecraft servers and I must say BisectHosting is probably the best I've tried so far by a long shot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Tigue",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:29:16.000Z",
          "Titre": "Very Good Company And User Experience",
          "Contenu": "Ive Used Them A Couple Times And Theyre Servers Are The Best Priced And Best Running Servers Ive Had The Pleasure Of Using"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ares zz",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T09:15:29.000Z",
          "Titre": "overall good but I don't know any other",
          "Contenu": "This is the only hosting site I know so take this with a grain or two of salt there was rubber banding and lag but opening a ticket got  that fixed pretty quick and the menu is pretty easy to use just needed to look some stuff up. I use ark and had to go through three people to get an answer on how to use two custom ends at once mine was Cave flyers and seasonal events turns out you need a space not a comma couldn't find that anywhere, might have missed it though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darke Shadow",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T14:44:24.000Z",
          "Titre": "Very fast lovely support staff",
          "Contenu": "Very fast lovely support staff. Been using them for literally 8 years now on and off. Never once disappointed me. I have tried other game hosts in the past because Bisect is a little more pricey. But the truth is that quality for money Bisect has always been the best deal. Don't go cheap on your order spend the little extra for the quality here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fogg_y",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T07:19:05.000Z",
          "Titre": "The help I received was amazing!!",
          "Contenu": "I was having difficulties with getting the server running with mods, but it was a user error and the help I received from the live chat was astounding and they went above and beyond in order to help me out. The CurseForge modpack selection is far wider than many other server hosting websites. I would definitely recommend Bisect to anyone who asks what server hosting company to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rozzy",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T12:52:22.000Z",
          "Titre": "This is the best service for MC servers…",
          "Contenu": "This is the best service for MC servers it has a whole panel and the server can't lag and it adds mods and plugins in a snap!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Harman",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T13:07:04.000Z",
          "Titre": "good hosting",
          "Contenu": "great server hosting even with 6+ of us on at once lag was barely ever noticable would highly suggest"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Niesig",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:56:57.000Z",
          "Titre": "Server Performance",
          "Contenu": "The start process was very easy and this server runs much better and overall gives a much smoother experience than any other I have used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tobey Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:01:49.000Z",
          "Titre": "Responses to questions and solving…",
          "Contenu": "Responses to questions and solving problems always goes efficiently and effectively. My only complaint is that I'm hoping to get a Dedicated Server, but there are none available which is a testament to the quality of Bisect's hosting services in my opinion."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T13:37:06.000Z",
          "Titre": "Customer support is vServer works incredibly smooth and fast. I have low ping all the timeery good I had no…",
          "Contenu": "Customer support is very good I had no issues using it.Server works incredibly smooth and fast. I have low ping all the time all my friends are happy that bosses are stable and works as they should (not like in the server from option \"Connect with steam\". I'm very happy and I will use this site again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George w bush",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:49:10.000Z",
          "Titre": "10/10 they cool",
          "Contenu": "i got to argue with them and it honestly made my experience 50X even better because of there hospitality give anna a raise at least 35 an hour and she deserves 2 months pto  brandon on the other hand only deserves a week of pto and maybe if you could throw him a pizza party for his troubles"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Blanco",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T05:02:20.000Z",
          "Titre": "Nothing wrong",
          "Contenu": "It doesn't take long to answer and my tickets get responded to as quickly as possible, haven't encountered any real issues with my servers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zack m.",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T10:33:12.000Z",
          "Titre": "Amazing customer service.",
          "Contenu": "I had a server going through a mid-life crisis. Dylan F. at bisect hosting sat with me for three and a half hours to resolve it. Amazing costumer service day or night. was able to resolve the issue and get me and my family playing again. 10/10 would recommend bisect hosting to any gamers in need of a good server host."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DDZ ZioNeX",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:34:28.000Z",
          "Titre": "good hosting service",
          "Contenu": "overall very stable server services, loved how easy it was to step up and join the server."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave F",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T22:59:44.000Z",
          "Titre": "Great staff and support",
          "Contenu": "Great staff and support. Very easy to deal with issues when they do arise, will use again for sure!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liam Crank",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:14:59.000Z",
          "Titre": "Fantastic UI for the server",
          "Contenu": "Fantastic UI for the server. Easy to follow instructions, and help when you need it. 10/10 would recommend for anyone who wants to play modded Minecraft with friends"
        }
      ]
    }
  ]
}