{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "bitcoinmerch.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Wade Martin",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T01:42:24.000Z",
          "Titre": "2 of the cards I got don't work",
          "Contenu": "2 of the cards I got don't work. Raspberry Pie keeps dropping out and can't handle the input from the miners. Had to pay extra $400 income tax to Australia. Power inputs needed to buy all new to fit Australian plugs. Waited over a month to get the product. Wrote emails and got no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bernhard Wolf",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:08:24.000Z",
          "Titre": "After 20 days not shipped",
          "Contenu": "After 20 days, still not shipped. No response or explanation despite repeated inquiry."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Wade Martin",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T00:39:11.000Z",
          "Titre": "I haven't received my order then have had scammers asking for more money. I am reporting this to the bank this morning",
          "Contenu": "I haven't received my order. Also I got a message today saying I need to pay more when I paid for the extra secured postage. I am going to the bank today to report fraud.My response to your reply. After reading the reply I am still not happy. I paid THE EXTRA POSTAGE FEES TO SECURE SAFE TRAVEL AND ARRIVAL WHEN PURCHASED it also stated I would get it with in 7 days when I paid extra and now been over 2 weeks. So it should had included as you just stated in your reply. Regardless of the fact, I cancelled with my bank to get my money back. Extra $400 fees are not exceptable. Rubbish..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2023-11-14T00:01:32.000Z",
          "Titre": "Sad after a good start.",
          "Contenu": "Had to remove other review. Sadly of the two items I previously ordered, one is now faulty after a week. I had several contacts with the company about it, and sent the required information and screenshots of the problem. At that point, I stopped getting responses from support. I tried several more times afterwards and still no reply. Very disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Hopkins",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T06:39:47.000Z",
          "Titre": "company is very quick to take money and…",
          "Contenu": "company is very quick to take money and answer questions before you buy. Advertised as in stock and same day shipping yet hasnt shipped yet. might just get refund and go else where. Wasted whole week waiting on shipment. my miner from china ordered same day got here already!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Vishnu Vishnu",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T16:43:02.000Z",
          "Titre": "Well  I ordered l3+ control board via…",
          "Contenu": "Well  I ordered l3+ control board via PayPal , bitcoin merch canceled my order,refunded it, visa charged refund fee of $15, if you are going to cancel a order, at least you can contact the buyer, I would have settled for a gift card,  why do you have the PayPal option in the first place ? Well, good luck to everyoneUpdate : \"The customer used multiple names, multiple addresses\" Well that's a lie. Why would anyone use multiple name and address using paypal? And more important, why is a big site lying carelessly on easily verifiable things?"
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "Elisha.",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T21:45:32.000Z",
          "Titre": "Don't buy from this site",
          "Contenu": "Order #35059 Order #35057They made me wait for one week after making the payments, then the orders where cancelled thereafter.Reason being i should use PayPal for payment.Don't buy from them it will end with premium tears"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Kyle Rogers",
          "Nb_Reviews": 3,
          "Date": "2022-12-07T15:31:43.000Z",
          "Titre": "Usb Bitcoin miner",
          "Contenu": "Ordered product. Took almost a week for them to ship it. Before they even shipped it I emailed them and asked them to cancel. 2hrs after I sent the email I got a notification saying a label was created emailed them again with no response till 5 hrs after the first email was sent. Responded with “sorry we read your email to late it’s already shipped” even on there site it’s says top tier customer support Aka email. Yea sorry 5hrs response time isn’t A tier."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kristin v",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T22:23:56.000Z",
          "Titre": "I bought the 3 miners... 2 work",
          "Contenu": "I bought the 3 miners, raspberry pi 4 monitor, USB hub, heat fans, etc with the whole set up ready out of the box which i paid over a grand for. One of the miners seems to already have malfunctioned, but was treat with no difference than the other two. Heard more vibration than the other two upon start up and guess it didnt like that very much. The SD was generic and won't boot on the raspberry pi 4. I tried a couple other ones that also didn't work. I tried USB boot as well with no luck. I got two running out of three minus the raspberry pi ."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Manit Nagpal",
          "Nb_Reviews": 3,
          "Date": "2022-05-07T01:41:18.000Z",
          "Titre": "ORDER #34598",
          "Contenu": "ORDER #34598Order #34599ORDER #34597These r the order numbersWhich r not delivered and didn’t get any shipment notification yet . Its been already 1 week i paid for overnight shipment Solve my issue asap Pls"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T21:17:47.000Z",
          "Titre": "I love it",
          "Contenu": "I love it. It was super easy to setup with the guide on the website. It's a wonderful addition to my desk and this is a company I am happy to support. Very kind, high vibe, and just creating a wonderful set of products. Here's to finding the next block! =DEdit: Used to be 5 stars. Down to 1 star. They did some update, Mars Lander 2.0. Now my hash rate slowly drops WAY below what it was. We are talking 30% lower. And there doesn't seem to be a way to downgrade when it was working well above spec. I use an ethernet connection as well. Way overpriced for the hash rate and now it's broken. Customer service hasn't been any help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T04:27:49.000Z",
          "Titre": "\"1/2 Star\" -  Junk and bad Service.",
          "Contenu": "1. You sent me a unit that the SD card was unusable.   a.  No Offer to reimburse me or send a good card with the operating system.2. When I tried to use your instant help messaging nobody answered. That was 2 attempts made with nada. Finally, website contact and what did I get, a curt download it, with no explanation of where the file was to download.  Bad screen so I can't see anything.3.  The video screen doesn't work.  I worked and worked and in desperation contacted a friend with a blog site and we did a ZOOM meet up.  We went through the entire setup (he has one of the miners). He told me something was defective and to return it, so...4. This will be a return, and no, I do not want another one.   Junk machine and bad service!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Turnea Ioan",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T11:34:34.000Z",
          "Titre": "I installed my miner for about 3 days…",
          "Contenu": "I installed my miner for about 3 days and it doesn't mine anything and what's more, it crashes and I have to reset it almost every hour"
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Demian Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T11:59:07.000Z",
          "Titre": "The paint on the Bitcoin coins went off…",
          "Contenu": "The paint on the Bitcoin coins went off in less than a month... Poor qualityEDIT: They sent me a refund and a new keyring. It's the same poor quality and they won't stop asking me to change my opinion because \"I got my money back and a free gift\". Don't you see I don't want your FREE bad-quality product? I want a GOOD quality product. This review won't change until that happens. Just keep sending me new coins..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ComputerGenie",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T10:52:30.000Z",
          "Titre": "HORRIBLE company, will NEVER use again!",
          "Contenu": "After 2 weeks of waiting and multiple attempts to contact them, they still haven't shipped my miners.Account shows \"Label Created\" to ship 1 of the 2 miners that I was told would ship over a week ago.They have my money and I have no product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "daniel markum",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T23:54:27.000Z",
          "Titre": "out of stock no refund still hasn't shipped",
          "Contenu": "after getting an email 3 days later that the item is out of stock I requested that if the item in question wasn't able to be delivered by Friday would need a refundits the end of workday Monday and the item still hasn't even been sent to the post office for shipping I should have just used a reliable vendor on amazon I could have had 3 or 4 by now  they seem so be more about making money than having a positive interaction with the customer  they should have been honest and jsut given me a refund"
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "Elisha.",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T21:40:22.000Z",
          "Titre": "Don't purchase from this site, they don't honor.",
          "Contenu": "I made my orders.Then they where cancelled there after without proper explanations."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Manit Nagpal",
          "Nb_Reviews": 3,
          "Date": "2022-05-06T22:28:30.000Z",
          "Titre": "I didnt recived the package yet",
          "Contenu": "I didnt recived the package yet 4 order still pending You sending feedback form for wht?"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "THIRUMALAI KUMARASAMY MANIVASA",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T05:21:38.000Z",
          "Titre": "After eight days ordered product still…",
          "Contenu": "After eight days ordered product still lying with customs for clearance 1"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Rachid BARHOUNE",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T11:12:53.000Z",
          "Titre": "Order and deliver issue",
          "Contenu": "HelloI ordered some materials and I didn't receive them yet. It s not normal"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Manit Nagpal",
          "Nb_Reviews": 3,
          "Date": "2022-05-18T13:30:19.000Z",
          "Titre": "Didn’t send my product and marked my…",
          "Contenu": "Didn’t send my product and marked my trancation fraud after 15 days lol i can make money double lol Try to fool some1 else12k$ product Fake siteDont trust"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ram M",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T14:13:36.000Z",
          "Titre": "Do not honour their return policy",
          "Contenu": "Received a defective item"
        },
        {
          "Note": 1,
          "Lieu": "BH",
          "Pseudo": "Jamal Obaid",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T13:29:12.000Z",
          "Titre": "I DINT RECEIVE MY ORDER U SCAMMERS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jarrod Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T21:15:43.000Z",
          "Titre": "I have no idea when I will get my…",
          "Contenu": "I have no idea when I will get my order.  Says it was oversold"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Burak Ates",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T12:55:10.000Z",
          "Titre": "Worst support experience one could get"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey DeHaas",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T22:47:15.000Z",
          "Titre": "Still waiting on my item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "devion brown",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T03:38:38.000Z",
          "Titre": "Never received order"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "darryn mcclelland",
          "Nb_Reviews": 4,
          "Date": "2023-10-06T08:50:36.000Z",
          "Titre": "Ordered the bitcoin mars lander on the…",
          "Contenu": "Ordered the bitcoin mars lander on the 28th of last month.Tried contacting them to ask an eta of dispatch but was met younan email saying they are making the item as we speak they said.I paid for fast tracked delivery aswell 3/5 days delivery.Very slow in contacting you back Misleading information on the website"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T08:24:07.000Z",
          "Titre": "It turns on but that all just a blank screen"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Jordy",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T02:42:33.000Z",
          "Titre": "I've ordered 2 Gekkoscience Newpac F…",
          "Contenu": "I've ordered 2 Gekkoscience Newpac F usb miners + 3 usb miner fans, but I only received less then half of the order (1 miner and 1 usb miner fan). Hence why my experience is also less than half of the amount of stars that can be rated. I've communicated about the incomplete order to Bitcoinmerch a couple of days ago, but no resolution has been offered so far. I hope to get a (half) refund. The miner I received does work well tough."
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "Andrej Kudláček",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T13:52:13.000Z",
          "Titre": "GekkoScience R909 Pod",
          "Contenu": "I received miner GekkoScience R909 Pod Miner  on 27th February, but not functional. There was a short circuit on the miner from the beginning. Power supply included in box is ok."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Salts",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T19:03:29.000Z",
          "Titre": "Pre-ordered V2 and was sent the V1 now…",
          "Contenu": "Pre-ordered V2 and was sent the V1 now I have to mess with updating it and I don't have a microSD card reader"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T05:15:39.000Z",
          "Titre": "Item I bought was suppose to take 4…",
          "Contenu": "Item I bought was suppose to take 4 business days but hasn't been shipped out yet. I understand if there is a backlog. Tried to get a update on my purchase but no response. other then that everything else was fine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Gunter",
          "Nb_Reviews": 3,
          "Date": "2023-02-14T01:27:57.000Z",
          "Titre": "Say ship but doesn't tell you were from…",
          "Contenu": "Say ship but doesn't tell you were from or how long it will take"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan Fulkerson",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T05:40:59.000Z",
          "Titre": "i  paid  a  lot  of  money for the …",
          "Contenu": "i  paid  a  lot  of  money for the  thing  thats  coming  late  even  though  i  paid  for  express  shipping  i  had  my  express  shipping  fee  refunded  though  so  that  balances  out  the  fact  that  its  late"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Spazfire",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T20:23:52.000Z",
          "Titre": "Possibly give them another try",
          "Contenu": "Ordered two ASIC miners from them. Unfortunately they both arrived damaged. A refund has now been given. They are being helpful now offering to send replacement part for the miners to possibly get them going. Which is very much appreciated. Hopefully they can be fixed. Possibly give them another try if the miners can be repaired."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kane Smith",
          "Nb_Reviews": 6,
          "Date": "2022-12-22T01:16:27.000Z",
          "Titre": "Great customer support...",
          "Contenu": "Update:  Awaiting working product,  I will add product review once received. So far as for support I'll give them a thumbs up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P. Hawes",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:58:24.000Z",
          "Titre": "Bitaxe miner",
          "Contenu": "Very small and extremely quiet miner. Fast shipping however communication was a little slow but definitely worth it for the beginner level experience."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "A random costumer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:38:15.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy to understand website, hassle-free ordering. Unfortunately, the pelxiglas arrived broken on my first order, but this does not affect the functionality of the Mars lander."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Preston Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:34:15.000Z",
          "Titre": "Excellent and eager to please with some hiccups",
          "Contenu": "My first purchase was excellent and the product met and exceeded expectation.My attempt at a second purchase was on back order and had to go through another supplier, but still very happy when it was received and worked in conjunction with the first purchase.The assistance however left a little to be desired. The initial attempts to contact was not successful until an account was created. After that, contact was a lot easier the staff was pretty friendly and eager to make an experience better within their control."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "bentik",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T10:21:25.000Z",
          "Titre": "My free replacement cover arrived…",
          "Contenu": "My free replacement cover arrived today. Thank you very much for that! However, buyers from Germany should consider the import tax!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Craig Grant",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T19:06:12.000Z",
          "Titre": "Doesn't mention anything about  import…",
          "Contenu": "Doesn't mention anything about  import fees of $180 cad on the website. Ups wants their cut on delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessie  Conchola",
          "Nb_Reviews": 5,
          "Date": "2023-07-27T20:42:52.000Z",
          "Titre": "With the replacement Raspberry PI zero…",
          "Contenu": "With the replacement Raspberry PI zero 2. my Mars lander is working great. They stand behind there product. I highly recommend buying from Bitcoin Merch"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bob Chapman",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T19:30:44.000Z",
          "Titre": "Couple issues all resolved",
          "Contenu": "Neat little unit. Had a couple issues but all resolved to my satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Barton",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T19:08:27.000Z",
          "Titre": "Great customer service they contacted…",
          "Contenu": "Great customer service they contacted me immediately to work out my issues an send me the correct items an offered to walk me three the process very please!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean Bayla",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T17:23:36.000Z",
          "Titre": "A link or printed instructions would be…",
          "Contenu": "A link or printed instructions would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jody",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T19:07:03.000Z",
          "Titre": "Using BTC to make a purchase",
          "Contenu": "I purchased using Bitcoin and it was not easy, but I was able to do it and appreciated the option.  I wish the item I ordered would have come quicker.....it took weeks!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T07:00:38.000Z",
          "Titre": "Has setup issues with cgminer waiting…",
          "Contenu": "Has setup issues with cgminer waiting for pool took 3-4 days to find a pool generally happy when it’s in a pool but the down time waiting for a pool needs to be fixed ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Gunter",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T18:20:47.000Z",
          "Titre": "They do a good job I am just impatient…",
          "Contenu": "They do a good job I am just impatient with delivery times. still, they do a good job answering questions giving advice, and support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kane Smith",
          "Nb_Reviews": 6,
          "Date": "2023-07-11T19:13:51.000Z",
          "Titre": "Product was lost in mail but they sent…",
          "Contenu": "Product was lost in mail but they sent a replacement, as always support is great."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Mattia Mastropietro",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T20:44:36.000Z",
          "Titre": "fast delivery, great support during the whole supply",
          "Contenu": "the items arrived as described in the shop, the package was conpleteoverall excellent support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T16:56:33.000Z",
          "Titre": "I love my purchase",
          "Contenu": "I love my purchase! The Mars lander is fun. I just wanted a little bit more communication on when It was getting shipped and sent upon purchase."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "D.Atlas",
          "Nb_Reviews": 5,
          "Date": "2023-02-21T05:40:20.000Z",
          "Titre": "Mars Lander BTC Solo miner.",
          "Contenu": "I got the Mars Lander solo BTC miner and so far it’s a great device to have on the table. While the odds of finding a block are next to impossible, it’s never 0. You don’t won’t if you don’t play. If it was slightly cheaper, like $400, it would be perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alfredo Feliciano",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T02:26:58.000Z",
          "Titre": "The process to buy is ok just still…",
          "Contenu": "The process to buy is ok just still waiting on delivery of R909"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Disappointed customer.",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T19:31:29.000Z",
          "Titre": "Sent package with product.",
          "Contenu": "Edited review. Company contacted me and sent product. Good follow up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ant",
          "Nb_Reviews": 3,
          "Date": "2022-10-06T08:18:51.000Z",
          "Titre": "Great Crypto Store",
          "Contenu": "Good service, good packing, decent shipping times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kane Smith",
          "Nb_Reviews": 6,
          "Date": "2023-07-11T13:14:18.000Z",
          "Titre": "Product works well sofar after day of…",
          "Contenu": "Product works well sofar after day of use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Ellis",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:15:09.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, product and shipping. When I received my Mars Lander pre flashed micro usb it was packaged well and overall a great product.Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jurgen Ebert",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:07:01.000Z",
          "Titre": "Disappointing performance less than 30GH",
          "Contenu": "Updating my review power supply was bad and Bitcoin Merch is sending out a new one for free.Had it running 24/7 since Feb 2023 Disappointing performance less than 30GH"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "JAMES CULLEN",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T08:24:20.000Z",
          "Titre": "Cool products and excellent service",
          "Contenu": "Cool products and excellent customer service, I was surprised each time with the high level of customer service for both times I've ordered. They go above and beyond."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Ramirez",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T01:00:00.000Z",
          "Titre": "Bitaxe 1366 bitcoin miner",
          "Contenu": "Received products, seemed packaged well so far,  I will leave a review once I get it set up and hashing. Thinking about starting a YouTube channel reviewing the miners you sell on your website.  I love the fast and reliable shipping. Thanks again have a great weekend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Riley Hagen",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:04:28.000Z",
          "Titre": "Great product & support",
          "Contenu": "Great product & support! Zeeshan was extremely helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Doose",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T23:56:06.000Z",
          "Titre": "Amazing customer service!!!!",
          "Contenu": "So I am a longtime customer of bitcoin merch's amazing products. But you never really know how a company is until you have a problem. Well,  let me tell you, THEY ARE AMAZING. I have been working with Zeeshan for the last couple of weeks because my mars lander's raspberry pi zero stopped working. Not only did he reach out almost daily to see how I was doing, he worked with me to first try and fix the problem so I would not have to send it in and be with out it. He even went as far as to put me in touch with the CEO. Just amazing. Unfortunately, we were not able to resolve my issue this way, so he immediately had me return the raspberry pi to have it evaluated. He keep me informed throughout the entire process (when he received it and how things we going). As soon as he was able to establish the problem, he immediately informed me of the issue and sent me a new raspberry pi. But not only did he send me the new raspberry pi, he made sure I got the new one up and running and everything back to where it was before it went down. I am a long time customer and will remain one for even longer. Thank you Zeeshan for the amazing customer service!james"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Loko",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:54:23.000Z",
          "Titre": "FAST SHIPPING",
          "Contenu": "FAST SHIPPING EAZY TO SET UP LETS FIND A BITCOIN BLOCK"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T BurrWolf BurrWolf",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T22:04:53.000Z",
          "Titre": "Outstanding customer service when the…",
          "Contenu": "Outstanding customer service when the first miner arrived and just couldn't work no matter what we did. They answered the phone quickly and had a new one out the door right away with 2-day shipping.New miner works awesome! Thanks again gang!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arturo",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T22:52:27.000Z",
          "Titre": "Like dealing with Friends",
          "Contenu": "Every time I order from these pros, it is an awesome experience. Even when something might be off with the order, they handle above and beyond my expectations. I am going to keep ordering from them, just don't tell the wife."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shon Ruff",
          "Nb_Reviews": 6,
          "Date": "2023-10-08T07:09:47.000Z",
          "Titre": "Exemplary Customer Service Experience!",
          "Contenu": "Everything I've ordered has either worked like a charm or been made right 👍 I am impressed with Idan and BitcoinMerch.  When I ordered an item that turned out to be defective he refunded my entire order, and not only that, he also added me to an exclusive list of customers to help launch a new plug and play miner.  I couldn't be more happy with BitcoinMerch, thanks for everything Idan!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Don matthew Padilla",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T19:17:24.000Z",
          "Titre": "Convenient and easy to use",
          "Contenu": "Convenient and easy to use. Everything you need from purchase to shipping in one page. That’s what made my experience with bitcoin merch outstanding. Although im still waiting for my purchase and excited to receive it. I would recommend bitcoin merch to everyone for their crypto mining needs. Thank you bitcoin merch"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Don matthew Padilla",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T18:09:08.000Z",
          "Titre": "Made a purchase(mars lander) from the…",
          "Contenu": "Made a purchase(mars lander) from the website and had it shipped. Although it took awhile to recieve but it was all worth it. And i was very pleased with the service that they provide. All on all a majestic experience from bitcoin merch. Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Ballantine",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T22:28:15.000Z",
          "Titre": "Bitcoinmerch is the best!",
          "Contenu": "Bitcoinmerch is the best!! They honestly want to see you successful and it's genuine. Going above and beyond in my opinion for customers and the merchandise, always fast and top-notch shipping, and the staff are willing to answer calls and emails, I am grateful to know who to call for anything crypto mining.  Always a good experience I look forward to the next... Thank you again Bitcoinmerch!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T03:12:29.000Z",
          "Titre": "Upgrading my previous 4 star rating as…",
          "Contenu": "Upgrading my previous 4 star rating as everything has been quickly replaced where necessary. As is, I'm able to hit 1 Th with this setup. It would probably run faster, but I'm powering the PI on the hub as well so free amps are low."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Jester",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:23:01.000Z",
          "Titre": "Got exactly what was promised",
          "Contenu": "Got exactly what was promised. Great customer service and package came on time and packed well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shon Ruff",
          "Nb_Reviews": 6,
          "Date": "2023-10-03T04:45:36.000Z",
          "Titre": "Five Star Service",
          "Contenu": "I got a bad unit but also world-class service to make it right! They fully refunded my order and even gave me exclusive access on a new project atop of the refund.  BitcoinMerch is awesome 😎 thanks for everything Idan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T06:24:47.000Z",
          "Titre": "Fast response for a non-functional device",
          "Contenu": "I had an issue with a device and they sent a replacement immediately. New device works great! Easy return process of the old one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sol Harvester",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T06:42:36.000Z",
          "Titre": "Gave replacement for damaged part",
          "Contenu": "Bought a Mars Lander but I needed a new acrylic cover as it was damaged. They sent me a new one, packed it really well and with the updated design and even peeled the paper off for me. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Reuben  Smith",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T17:45:45.000Z",
          "Titre": "Amazing",
          "Contenu": "If I’m being honest, Bitcoin Merch has to be one of the best businesses I’ve purchased from, not just relating to crypto hardware. Every step/stage of the sales process has been amazing. The website is spot on, very easy to navigate, nice clean and simple to use with lots of information and videos for support, the products are great and shipped well with good packaging, the service/after care has been spot on. They clearly understand the importance of adding value at each step of the way to help to help increase their customer base/sales. What a great business, don’t need to shop at any other sites."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Henry Christiaanse",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T11:25:43.000Z",
          "Titre": "Very satisfied with Bitcoinmerch.",
          "Contenu": "Very satisfied with Bitcoinmerch.Good packaging and excellent service, I missed the remote control of my Marslander contacted by email and it is delivered without any problems.They indicate that the Marslander 250 GH/s, but I get 300.4 GH/s with the cable, so this Marslander is an excellent product.Just a tip for ordering in Europe, order the USB internet adapter and also the plug for Europe.Keep it up! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nestor Villalobos",
          "Nb_Reviews": 5,
          "Date": "2023-04-10T16:02:34.000Z",
          "Titre": "I am very satisfied with my purchase of 10 Port Powered USB Hub",
          "Contenu": "I am very satisfied with my purchase of 2 of 10 Port Powered USB Hub. The build quality is excellent and it feels sturdy and well-constructed. The hub performs well, providing consistent data transfer speeds, and has enough power to charge all my devices. The design is also sleek and easy to use, with a convenient on/off switch. Overall, I highly recommend this product. Additionally, the seller provided great customer service, answering all my questions promptly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Juan Velazquez",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T03:03:53.000Z",
          "Titre": "It's Here!!",
          "Contenu": "I have been looking forward to get this miner and just got it in today. I quickly set it up with no issues (took less than 10 minutes making sure I put correct info, and yes I am a rookie doing this) running smoothly so far...between purchase and receiving it was pretty standard since I was in no major rush to get it. May think about getting a second one down the road....👍👍👍👍👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher P",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T23:37:27.000Z",
          "Titre": "Guys are truly awesome. 3rd time around...",
          "Contenu": "My third time using them, just for solo mining fun I thought I had gotten a defective unit but just the power supply was bad after trouble shooting and they sent me a new one right away no questions asked. They really stand behind their products and definitely make sure you are satisfied with whatever you had bought. I highly recommend them even if just for novelty fun as the Mars Landers are super cool and fun units to play with and learn. You get that ticker too for the constant price updates. Hopefully they can add more to (different currency) the ticker system in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "william troy",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T02:01:45.000Z",
          "Titre": "R909 pod meet Mars lander.....",
          "Contenu": "The R909 pod, connected to Mars lander is really awesome,  doing 2.01 Th,  these things look good together,  work great together,   and if like me, need a little help getting up and running,  Idan works with you,  this my 2nd purchase,  can't wait to get more."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Dennis Manaoat Corpuz",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T10:49:00.000Z",
          "Titre": "The PET cover mars lander and power supply",
          "Contenu": "The PET cover of the mars lander I received was disassembled. Seems like there is not enough adhesive was put to hold it together. Also, I read on the website that the package includes a 5V 5A power supply that is missing in the box. Idan from Bitcoin Merch reached out to me immediately and send the missing item and replaced the damaged cover. I'm very thankful for the excellent after sales service provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Holmes",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T22:07:02.000Z",
          "Titre": "Excellent bitcoin miner and buying experience",
          "Contenu": "The buying experience from BitcoinMerch was easy and good overall. The product was shipped to me quickly and was packaged well. The miner itself was easy to get going and is quiet. It is actually the perfect way to mine Bitcoin at home and has been made easier for first-time users. Even though the chances are slim at finding a Bitcoin block with such a small hashrate, you are also not spending a lot of money on electricity to have your hand in the game. The fact that it is quiet is another bonus you don't often get with Bitcoin miners. If you have expensive electricity and don't like noise but you want to be part of the Bitcoin ecosystem, this miner is THE way to do it. Oh and it's much easier than dealing with a stick miner and mining software and running a computer 24/7. Win/Win"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabio",
          "Nb_Reviews": 4,
          "Date": "2023-07-16T14:02:52.000Z",
          "Titre": "The product I ordered arrived quickly…",
          "Contenu": "The product I ordered arrived quickly and works as expected. Very simple to setup and any additional questions I had were resolved quickly via chat. I will definitely keep coming back for additional hardware.Thanks againFabio"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "harley wallis",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T08:54:38.000Z",
          "Titre": "Best solo miner on the market, and best customer service in the game!!",
          "Contenu": "I had many troubles with my mar lander and setting it up. But the customer service is absolutely awesome and I highly recommend this miner. It's awesome and looks just as awesome!! Very well built product and good on the electric bill. I would recommend this to anyone trying to get in to mining crypto or has been in the game!! 10/10 I plan on buying more in the future!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Havrila",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T16:10:07.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices, fast responses and great support! I've purchased multiple items from them and plan to purchase more in the future."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "D.Atlas",
          "Nb_Reviews": 5,
          "Date": "2023-09-18T11:48:24.000Z",
          "Titre": "The support while machine was down.",
          "Contenu": "The support when my machine was having issues was excellent. My machine was experiencing low hash rate problems, and a replacement power supply, the new one, solved the problem and made my machine run better and faster. Excellent work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessie  Conchola",
          "Nb_Reviews": 5,
          "Date": "2023-09-14T02:08:03.000Z",
          "Titre": "I bought orginally a 7 port USB",
          "Contenu": "I bought orginally a 7 port USB, but I could get it to run on a steady bases. I switch to 10 Port Powered USB Hub ONLY 120W 12V 10A plug in 3 Gekko science compac F with a mars lander. Also received software update for the new mars lander and it has been run steadly for the pass few days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rogelio",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T01:58:39.000Z",
          "Titre": "As advertised! The MARS LANDER is pretty cool!",
          "Contenu": "I am a total beginner with all the anxiety of learning new technology. BitcoinMerch.com took all the stress out of my first steps in Crypto.The MARS LANDER looks sweet and is easy to set up. It is very quiet too.I had a few questions about the setup because I entered my wallet ID instead of my BTC wallet address. No problem! Excellent customer service.Update: I had a weak WiFi signal and I do not have access to the router. They suggested a USB Wifi antenna and it totally boosted the signal...I'm clocking at 280+ GH/s!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-08-28T14:14:49.000Z",
          "Titre": "A company that aims to please by realistic means!",
          "Contenu": "Expedient Shipping, Had a issue that I caused, they quickly reach out and helped out. This is not your average company definitely looking forward to doing business with them again. Outstanding Service and Products!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shawn wine",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T15:30:41.000Z",
          "Titre": "Love everything you all do!!!",
          "Contenu": "Love everything you all do!!!! My marslander took a dump and they turned around and shipped me a new one and the support and customer service was amazing great company who stand behind they product will def keep buying from this place will be buying more product soon for entertainment purposes <3"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donnie Hall",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T01:18:57.000Z",
          "Titre": "Update to a previous review.",
          "Contenu": "Here is an update to my last review. ldan, got involved and resolved the miss communication issues, I was experiencing.I was offered a new unit, offered a full refund and apologized for all the issues I had.I think this was the best response, I have gotten from a company, in years.I will order another device and give it a try, I was so happy when I plugged in my first one, I want to experience that feeling again.DonnieI fully trust Bitcoin Merch and back up their support team."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Mattia Mastropietro",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T20:39:48.000Z",
          "Titre": "bitcoinmerch.com - great support and keeps the promise",
          "Contenu": "I ordered again some products thru bitcoinmerch.com and received the items as described.Always great support and willing to help, fast reply.Great experience, will buy for sure more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince Radigan",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T22:49:41.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, Excellent customer service. R909 plugged into mars lander and hashing with no extra setup! Awesome company"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Bertrand Robert",
          "Nb_Reviews": 5,
          "Date": "2023-08-14T21:24:59.000Z",
          "Titre": "Mining ? -> bitcoinmerch.com",
          "Contenu": "Once again I've ordered a product from bitcoinmerch.com and they keep their promises on quality and delivery times !Highly recommended and well known online store !I love it ❤️"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Quintessential Promotions",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T00:29:50.000Z",
          "Titre": "Love my Mars lander",
          "Contenu": "Love my Mars lander, now expanded! The Bitcoin Merch guys are super helpful and I am really happy with my purchases. I didn't think I could ever mine BTC before discovering these guys. Now, we are 1 block away ;)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shon Ruff",
          "Nb_Reviews": 6,
          "Date": "2023-09-11T19:43:59.000Z",
          "Titre": "Bitcoin Merch is always there to help…",
          "Contenu": "Bitcoin Merch is always there to help me out, whether it's a silly how-to question or an update to an order I've already placed, they put their customers first and I love them for it!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Zack Chance",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T03:53:35.000Z",
          "Titre": "Idan is awesome",
          "Contenu": "Idan is awesome, responsive, and stands behind his product. I highly recommend shopping at Bitcoin Merch with confidence! Thanks Idan, I will be back for more merch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "leolustig",
          "Nb_Reviews": 7,
          "Date": "2023-06-13T15:26:42.000Z",
          "Titre": "The replacement case I ordered for my…",
          "Contenu": "The replacement case I ordered for my Mara Lander came a bit sooner than originally stated. I am always super satisfied with my experience with Bitcoin Merch! They are the best!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben Buhbut",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T19:31:33.000Z",
          "Titre": "Overall service was incredible",
          "Contenu": "Overall service was incredible! The Bitcoin Merch team was very supportive answered each and every question I had, I purchased the Mars Lander which is made by them and it's a great product, The purchase was effortless with zero issues!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis Baker",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T06:54:50.000Z",
          "Titre": "Very knowledgeable",
          "Contenu": "Very knowledgeable. Very glad to be part of this team very excited for the future.  Thanks Idan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joey Valdez",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T05:28:26.000Z",
          "Titre": "Being a person with expectations being…",
          "Contenu": "Being a person with expectations being set very high i have to give 5 star review. Customer service responsed quickly, instructions were very easy to follow. Overall excellent experience! Happy mining yall."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Evdokimos",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T21:29:32.000Z",
          "Titre": "Idan is there to support and…",
          "Contenu": "I recently purchased the Gekko Science Compacf ASIC miner from this site, and I couldn't be happier with my experience. The transaction process was smooth and hassle-free, and the product arrived promptly, well-packaged and in perfect condition.The Gekko Science Compacf ASIC miner itself is a powerhouse! It exceeded my expectations in terms of performance and efficiency. Not only is this miner incredibly efficient, but it's also surprisingly quiet, which is a huge plus for me.The build quality is outstanding, and it's evident that this product is designed to last. The durability and reliability of the Gekko Science Compacf ASIC miner give me confidence in its long-term performance.Overall, I'm extremely satisfied with my purchase and the service provided by Idan.I highly recommend it to anyone in the market for a top-notch power efficient starter ASIC miner. Kudos to the team for delivering such an exceptional product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shon Ruff",
          "Nb_Reviews": 6,
          "Date": "2023-10-31T00:37:36.000Z",
          "Titre": "Way smaller than expected but super stoked!",
          "Contenu": "I was quite shocked to see just how small it is, it's smaller than my mars lander and super cute! I can't wait to see what it looks like in a case!! Working on setting up a case for it like my Mars Lander!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Peter Boaventura Marques",
          "Nb_Reviews": 2,
          "Date": "2023-04-20T17:15:17.000Z",
          "Titre": "Great Miner",
          "Contenu": "Great Miner, service, great support, ordered in the US on 14th April, in house in Belgium installed and mining on the 20th April. Nice gadgets included. Very happy customer so thanks Bitcoin Merch ;-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T16:18:41.000Z",
          "Titre": "Mars Lander",
          "Contenu": "I've had the Mars Lander running for a little over a week. It has been stable and works with no issues. I am getting 270 GH/s with an ethernet adapter, and 290 GH/s with wifi. I like the wifi option, because I can put it anywhere. It's a neat product.Before ordering, I called to ask a couple questions. Service was good and shipping was fast. You can tell this guy cares about his company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 5,
          "Date": "2023-06-07T20:53:13.000Z",
          "Titre": "Takes different payment methods.",
          "Contenu": "Received what I ordered quickly. I like that different payment methods are accepted. I have actually purchased a second miner that I'm currently waiting to be shipped."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "leolustig",
          "Nb_Reviews": 7,
          "Date": "2023-04-07T14:59:47.000Z",
          "Titre": "Bitcoin Merch has the best customer…",
          "Contenu": "Bitcoin Merch has the best customer service ever!  Not only do they have a great selection of products for home crypto miners but their customer service and support is out of this world excellent. I have been recommending Bitcoin Merch to all of my home miner friends!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Krypto Rima",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T14:16:42.000Z",
          "Titre": "You can feel the joy of Bitcon!",
          "Contenu": "The order was processed quickly and reliably and sent from America to Switzerland.  All within 5 working days!  Everything is well packaged and works as it should!  You can feel the joy of Bitcoin, thank you all very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antione Motley",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T10:04:12.000Z",
          "Titre": "easy to use",
          "Contenu": "I like the site a lot easy to use tho I whis their was a payback of some kind I don't have a lot of money but some miners like the ks0 I whis I could just like pay into my account then use a coin or feit to buy what mineri need"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nestor Villalobos",
          "Nb_Reviews": 5,
          "Date": "2023-06-30T15:37:45.000Z",
          "Titre": "8GB MicroSD Card with the pre-flashed Linux and CGMiner for my Raspberry Pi",
          "Contenu": "I have been using the 8GB MicroSD Card with the pre-flashed Linux and CGMiner for my Raspberry Pi Compact F USB Miner, and overall, I am quite satisfied with the product. The quality of the MicroSD Card is excellent, and it has performed reliably with the Raspberry Pi Compact F USB Miner.I would also like to acknowledge the excellent customer service I received throughout the purchasing process. Your support team was responsive, knowledgeable, and promptly addressed my queries. I appreciate the professionalism and assistance I received.Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nestor Villalobos",
          "Nb_Reviews": 5,
          "Date": "2023-04-12T22:32:08.000Z",
          "Titre": "I'm very satisfied with my purchase",
          "Contenu": "I'm very satisfied with my purchase. The quality of the product was excellent and it worked exactly as advertised. Shipping was prompt, and the product was well-packaged to prevent damage during transport. I also had a great experience with the customer service team Mr. Abada at BitcoinMerch. He  was very helpful and responsive to my questions and concerns.Overall, I would highly recommend BitcoinMerch to anyone looking to purchase cryptocurrency mining equipment. The website was easy to navigate, and the checkout process was smooth. Thanks, BitcoinMerch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clinton Harris",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T15:52:47.000Z",
          "Titre": "Well the bitcoin coin that I ordered…",
          "Contenu": "Well the bitcoin coin that I ordered had a some kind of stain, smudge, looking thing on the coin.  The coin fell out of the case when I opened it so it looked damaged.   I had given Bitcoin Merch a 3 star but they earned my respect for a 5 star.  I feel that a company that will reach out to a customer no matter what the amount of the purchase and fix it.  Now that is an awesome company to keep ordering your products from.  I am looking forward of returning and ordering a Mars Lander next month.  Thank You Bitcoin Merch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T00:42:28.000Z",
          "Titre": "Good stuff",
          "Contenu": "My experience so far has been quite comfortable! Quick responsive service right from the beginning. Looking forward with excitement and ease of mind!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J I",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T05:50:56.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, Idan was very helpful in assisting me with an issue I had with an order. I feel more confident buying from bitcoin merch again, Thank you! 😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peanutthead Mining",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T12:31:03.000Z",
          "Titre": "If you run into a problem they will help you with it",
          "Contenu": "When I came into a problem with the Mars lander they Sent me a replacement part. They are a Legit business As long as they have things that I need I will continue doing business with them"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Susu Andrei",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T13:59:28.000Z",
          "Titre": "Great experience. Pretty good delivery times.",
          "Contenu": "I had a good experience in terms of delivery. The package was delivered a bit at the last minute but I'm glad the packaging was properly done to avoid damage to the gadgets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T01:01:31.000Z",
          "Titre": "Great experience",
          "Contenu": "awesome customer service before i even made my first purchase was able to call and have questions answered. shipping was super fast v1 mini showed up in excellent condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kane Smith",
          "Nb_Reviews": 6,
          "Date": "2023-02-01T17:22:32.000Z",
          "Titre": "Great Tech support",
          "Contenu": "Great Tech support, after getting updated unit this finally works as stated. Will you get rich... probably not but this Mars Lander unit is awesome desktop peice! Very low power usage an never know maybe you'll find the next block😎"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Doose",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T06:18:27.000Z",
          "Titre": "Bitcoinmerch.com Mars Lander",
          "Contenu": "Just received my Mars Lander from Bitcoinmerch.com. This thing is amazing.  Having so much fun with it. And I can not begin to tell you how amazing the customer service is with these guys. I am a beginner and they have been so patient and understanding. Super fast response time when I reach out to them. Not only do they offer amazing products, they truly put the customer first and ensure you are going to have a  great experience. On top of that, the instructional videos they provide at are amazing as well. So happy I found them. If you want great products with great support, you can not go wrong with these guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen Allan",
          "Nb_Reviews": 4,
          "Date": "2023-02-20T02:45:43.000Z",
          "Titre": "Really just a case of actually having…",
          "Contenu": "Really just a case of actually having the thing in stock. Oh, and the price was better than anyone else. I assume there's no difference between these and any others, so best deal out there it seems!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Hall",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T04:06:33.000Z",
          "Titre": "HANDS DOWN BEST CUSTOMER SERVICE!!!!",
          "Contenu": "HANDS DOWN!!! the best service I have experienced in many years!!!! I had a product show up with damage, I emailed them that night I received the product the next morning when they were open I received a email wanting my order# sent the # along with a picture with in 2hrs I had a email saying my new part was it's way with, NO HASSLES OR DO THIS OR DO THAT. I will use them FRIST in the future. THANKS AGAIN!!! Oh yeah the shipping was very quick, it comes from the USA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 5,
          "Date": "2023-05-08T20:21:47.000Z",
          "Titre": "Everything as expected great experience",
          "Contenu": "Customer service answered email timely. The item was shipped promptly and they have several different payment methods. I will buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brent",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T01:52:22.000Z",
          "Titre": "Very happy to be a valued customer",
          "Contenu": "Interesting product offerings and pretty good prices. Placing my order was easy. Sales support was fantastic and responsive, adjusting my order qty at my request. It is my pleasure to be a valued customer and I will highly recommend this company to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince Radigan",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T15:56:15.000Z",
          "Titre": "Great products and customer service",
          "Contenu": "While shipping can be a little slow, customer service is always responsive, and products perform as advertised. This was my second order from this company and I would definitely order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Rankin",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T02:13:10.000Z",
          "Titre": "BitcoinMerch.com",
          "Contenu": "The website was very easy to navigate and check out was a breeze. I truly enjoy my Mars Lander Miner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabio",
          "Nb_Reviews": 4,
          "Date": "2023-07-27T21:34:19.000Z",
          "Titre": "As usual great product",
          "Contenu": "As usual great product, fast shipping and already up and running. This last order completed my mining setup.I will come back as soon as I will be able to do so to expand my setup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bao Tran",
          "Nb_Reviews": 3,
          "Date": "2023-02-05T22:51:07.000Z",
          "Titre": "Thank you to Idan(CEO) for helping out…",
          "Contenu": "Thank you to Idan(CEO) for helping out how to setup a Mars Lander Solo Bitcoin Miner , very happy with their Customer Services, keep it up with your good works , I definitely come back to purchase more items for Bitcoin Miner ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BENJAMIN",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T01:35:03.000Z",
          "Titre": "FAST shipping!!!",
          "Contenu": "FAST shipping! Set-up was plug and play and took less than 10 minutes! Will definitely buy from Bitcoin Merch again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T02:50:16.000Z",
          "Titre": "Bitcoin mining …",
          "Contenu": "Want to get into bitcoin miner and was looking for a affordable solution.  I purchased the Mars Lander and had it up and running in 15 mins. I also setup pooling. So far very happy with the service and miner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T00:31:06.000Z",
          "Titre": "Good shopping, order, & after sale support experience",
          "Contenu": "The shopping experience and order delivery were excellent. However, detailed technical specs for the fans and USB hub are missing. Of the 3 fans I purchased, one produces a loud vibration buzz. The 7-port USB hub's structure also produces loud vibration noise when any of the fans is running (louder with all 3 on), thus requiring specific placement with additional dampening/suppression to prevent it from vibrating as much and making the loud buzz noise that it does on its own when placed upright directly on a solid surface.EDIT 2/26/23: Bitcoin Merch sent me a fan to replace the one that has the excessive vibration and noise issue, and the new fan works quite well with no issues. I very much appreciate Idan's response and action to send me a replacement fan. When I wrote the review, I had not reached out to Bitcoin Merch yet to notify them of the issue, but they seem to be on top of things and took action based on my review of the items and before I had the chance to contact them about the issue. This is how one ensures repeat customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Redding",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T21:37:08.000Z",
          "Titre": "The delivery was quick and my solo…",
          "Contenu": "The delivery was quick and my solo bitcoin miner was in good working order. I wish I would of order my other miner from you guys. I'm still waiting on the one I purchase from gold shell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Szeles",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T04:02:33.000Z",
          "Titre": "Can’t say enough good about bitcoinmerch.com",
          "Contenu": "Follow up and service is second only to products they carry. I highly recommend to anyone if you’re just getting into Bitcoin or if you’re a vet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfred Gatt",
          "Nb_Reviews": 3,
          "Date": "2023-10-15T16:49:03.000Z",
          "Titre": "I am happy with my first purchase and…",
          "Contenu": "I am happy with my first purchase and anxiously await the second orders delivery."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Blddvl",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T00:31:07.000Z",
          "Titre": "Delivered quickly",
          "Contenu": "Delivered quickly, but a small error in shipping was rectified immediately and the missing part was forwarded. Support was friendly and provided precise information on how to fix the problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Gunter",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T22:00:19.000Z",
          "Titre": "Service",
          "Contenu": "What made my experience a good one . The owner called me to ensure my purchase had been delivered. He took the time to ensure I was satisfied with the product and service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andrew Prince",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:36:55.000Z",
          "Titre": "I ordered you mars lander device",
          "Contenu": "I ordered you mars lander device. When I got it the software on the micro usb didn’t work. I tried calling and left a message. I tried contacting you through the chat feature. So far no one has bothered to respond to me so I can get up and running"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfred Gatt",
          "Nb_Reviews": 3,
          "Date": "2023-09-30T16:17:49.000Z",
          "Titre": "Excellent support on the phone and the…",
          "Contenu": "Excellent support on the phone and the web. The new video for the mars lander setup helped tremendously."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 3,
          "Date": "2023-09-23T01:12:52.000Z",
          "Titre": "Everything arrived but my powered USB…",
          "Contenu": "Everything arrived but my powered USB hub so I can't test anything yet. Pending support responses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Kreisman",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T17:51:18.000Z",
          "Titre": "Great fun",
          "Contenu": "Great fun!  Love my Mars Lander.   Had some issues getting going and email support and they were fantastic.  Killing at 300.1 GH/s."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "bobby",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T00:42:15.000Z",
          "Titre": "The R909 arrived from California to…",
          "Contenu": "The R909 arrived from California to Ireland in under 5 days from order. Really good service can't wait to set it up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Gibbs",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T02:39:14.000Z",
          "Titre": "Awesome Crypto Playing Cards!",
          "Contenu": "The crypto playing cards are awesome :) I love the artwork on the face cards and the representation of other ethnic groups."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UriahisWorldwide",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T05:28:13.000Z",
          "Titre": "10/10 definitely best bitcoin mining…",
          "Contenu": "10/10 definitely best bitcoin mining company since my involvement in crypto! Definitely getting every kind you all have 👑"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry V",
          "Nb_Reviews": 4,
          "Date": "2023-11-09T03:24:36.000Z",
          "Titre": "Totally awesome company to do business…",
          "Contenu": "Totally awesome company to do business with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RKG",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T04:42:37.000Z",
          "Titre": "Great Service.",
          "Contenu": "Very easy to order from and prompt shipping. Item was delivered on time with no issues.   Fair Pricing. Products work as expected."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Kim Berg",
          "Nb_Reviews": 13,
          "Date": "2023-08-09T16:23:48.000Z",
          "Titre": "Bitcoin Merch® 10-Port USB Hub - COMBO Up to 1.6+TH/s",
          "Contenu": "It is always a pleasure to shop at Bitcoin-Merch. Bitcoin Merch® 10-Port USB Hub - COMBO Up to 1.6+TH/s."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "leolustig",
          "Nb_Reviews": 7,
          "Date": "2023-08-08T18:17:15.000Z",
          "Titre": "Everything about my experience with…",
          "Contenu": "Everything about my experience with BitcoinMerch has been top notch! They are the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Ballantine",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T00:02:48.000Z",
          "Titre": "Awesome customer service with integrity…",
          "Contenu": "Awesome customer service with integrity and passion! Very pleased and impressed, thank you Bitcoin Merch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher P",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T19:15:56.000Z",
          "Titre": "Idan is the man",
          "Contenu": "Idan is the man. Makes sure you are all set and just doesn't sell you a brick and let you squirm like a worm trying to figure it out. Tons of patience. I highly recommend buying from here. They truly are the best. HASH on!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabio",
          "Nb_Reviews": 4,
          "Date": "2023-07-03T15:29:13.000Z",
          "Titre": "Great customer service support via…",
          "Contenu": "Great customer service support via Chat. Product as expected and overall a great experience. I have already purchased additional hardware. Thank you !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vn",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T18:31:31.000Z",
          "Titre": "who knows if it will ever solo mine a…",
          "Contenu": "who knows if it will ever solo mine a block but its very cool and unique to look at and have. I personally think its a fun gift and its all in 1. easy to set up watching youtube videos."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Thompson",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T00:49:00.000Z",
          "Titre": "Good Customer Support",
          "Contenu": "I had a small issue with mine when I first received it. I sent an email and they replied that night. We got the issue fixed and its been working fine ever since."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T04:52:08.000Z",
          "Titre": "Professional Company",
          "Contenu": "The communication and short delivery time is great. It's always great doing business with the \"Bitcoin Merchant\"."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T02:33:26.000Z",
          "Titre": "I have made multiple purchases and…",
          "Contenu": "I have made multiple purchases and always have the same results. Great customer service. Awesome products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T06:31:43.000Z",
          "Titre": "It is the customer service that has…",
          "Contenu": "It is the customer service that has made things so great for me. They are great about getting back to you as quickly as possible. I am new to this, so I have had alot of questions and needed quit a bit of help. They have been so patient and helpful. It has been really nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley Coates",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T19:50:18.000Z",
          "Titre": "Communication is key",
          "Contenu": "Communication is key! Awesome experience, for I am new to crypto mining.And I have many questions! Lol"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Bertrand Robert",
          "Nb_Reviews": 5,
          "Date": "2023-08-09T06:09:10.000Z",
          "Titre": "Mining ? -> Bitcoinmerch.com",
          "Contenu": "Bitcoinmerch is the refference for buying mining equipment. They offer top quality products at a reasonable price !"
        }
      ]
    }
  ]
}