{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "bravado.co",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon Tratnyek",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:08:45.000Z",
          "Titre": "Fake job posts impersonating software companies",
          "Contenu": "I am a recruiter at a software company. Recently a candidate messaged me asking about a sales job posted on Bravado that claimed we hired in Canada, asking me for more information. We do not hire in Canada, are not currently hiring SDRs, and we've never worked with Bravado. This company is fraudulently representing us to the market in job posts that don't explicitly use our name but provide a slightly anonymized version of our company description and founding story and claim the post was created on behalf of us a client.  I would strongly urge caution to any candidate applying to the jobs posted on this site. I don't know what would happen to your information if you applied via Bravado, but you would not be speaking to a recruiter or hiring manager at the actual company you think you're applying to in this case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick McClure",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:46:40.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible.  Can’t make changes to my portfolio"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T02:00:33.000Z",
          "Titre": "This feels like a pointless website",
          "Contenu": "This feels like a pointless website. The War Room or whatever is set up exactly in the same format as Reddit with the same types of questions.There’s no way to track what job applications I applied to. I have no visibility into the job search process. There’s no actual job board where I can look for roles.Their website doesn’t detect a few large companies i worked for, so formatting looks off. There’s no way to upload a simple thing such as a resume as achievements don’t describe the whole story. To add insult to injury the job postings on LinkedIn don’t even have the company name so I’m still in the dark about what I’m applying to but without any status update of any kind or the ability to even review the job post later, it all honestly feels like a waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris C",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T18:24:13.000Z",
          "Titre": "Disappointing Software",
          "Contenu": "Very disappointing software. After taking the necessary time to build a profile legitimately, there's no jobs available to me. I found a job posting from Bravado on LinkedIn and I cannot apply for the position. This has nothing to do with qualifications. I just get stuck in a loop. What's the point?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Job Seeker",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T22:06:01.000Z",
          "Titre": "Can't follow up with the hiring company",
          "Contenu": "I always follow up with the recruiters, hiring managers... of the companies that I am applying for. However, Bravado does not give the name of the customer so I cannot follow up. It is like my application goes into the black hole and I am not able to help myself with follow up."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "R Patel",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T21:19:35.000Z",
          "Titre": "CEO supports killing of children and…",
          "Contenu": "CEO supports killing of children and genocide. Shame on anyone who supports this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T14:25:52.000Z",
          "Titre": "I have an extensive and proven sales…",
          "Contenu": "I have an extensive and proven sales track record, yet am unable to find gig work in my free time. Not only that, but the site isn't very user friendly. If I could rate it a 0 I would because it's completely worthless."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Max",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T22:08:44.000Z",
          "Titre": "They spam and send invitation pretending is from other trusted referral",
          "Contenu": "I received an invitation to join Bravado pretending that the invitation was from my University, faking also the sender. A shameful way to hook new subscribers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eun Bae",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T20:34:21.000Z",
          "Titre": "Bravado Tech Sales U Refund",
          "Contenu": "I enrolled for the Bravado Tech Sales U program. I was never contacted about receiving my initial REFUNDABLE $100 deposit back and paid to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T06:14:49.000Z",
          "Titre": "I don’t even know what this website is",
          "Contenu": "I don’t even know what this website is. Thought I was applying for a job, and now I’m getting emails daily about unrelated stuff."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 4,
          "Date": "2023-04-04T00:31:53.000Z",
          "Titre": "Not a great sales community",
          "Contenu": "Not a great sales community. No job network or listing. Keep listing fake roles on LinkedIn. Tough to find value."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "VTN",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T20:53:54.000Z",
          "Titre": "Why on earth do you need access to my…",
          "Contenu": "Why on earth do you need access to my gmail contacts? Ridiculous.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T20:36:14.000Z",
          "Titre": "You did nothing!!",
          "Contenu": "You did nothing but send a bunch of emails. Nothing compared to what was promised. Is this even a real site?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T18:32:26.000Z",
          "Titre": "I applied for a job and got spammed…",
          "Contenu": "I applied for a job and got spammed instead it’s bad business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T20:04:12.000Z",
          "Titre": "Applied",
          "Contenu": "Applied Haave had ZERO updates"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T05:01:49.000Z",
          "Titre": "Not really relevant info."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T21:16:44.000Z",
          "Titre": "I’m getting no jobs from this"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T19:03:04.000Z",
          "Titre": "Cool all-around concept, but not helpful",
          "Contenu": "Cool concept, but I've been registered for several weeks and haven't received a single match (I've tried retailoring my profile several times to no avail)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T15:45:49.000Z",
          "Titre": "The navigation of the app is very…",
          "Contenu": "The navigation of the app is very difficult and different than the website version. Doesn’t make sense."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KS",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T02:47:12.000Z",
          "Titre": "Scam",
          "Contenu": "The videos were informative, but none of the self assessments worked. The follow up email I got for my certificate, the link didn’t work. Then I was told I would get a refund through Venmo or Paypal… when the deposit was made via a credit card? They didn’t ask for my Venmo or Paypal. Highly doubt I’ll get my money back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T05:19:44.000Z",
          "Titre": "Paid and didn’t get access for weeks. No refund after completion thus far. Sketchy.",
          "Contenu": "Wasn’t able to log in after I paid.  Emailed someone who it said to email. They never replied. Finally found another email to reach out. Got it fixed but then assignments wouldn’t load in Slack and now I’ve been told my refund has been processing but it’s been almost a week and my bank hasn’t saw even a inkling that that is true. Very scammy. Would not recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T17:36:24.000Z",
          "Titre": "Wish it worked better",
          "Contenu": "Seems like a great idea.  However I have not heard back from any of the positions I have applied for.  Not even a thanks but no thanks email?Update. This is a scam. Many people seem to have been taken. Don't waste your time and work with a legit recruiter"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Ziegler",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T17:42:41.000Z",
          "Titre": "I think Bravado offers a safe space for…",
          "Contenu": "I think Bravado offers a safe space for asking the questions most of us would never feel like we could.  It’s an open and somewhat honest way to gauge your own perspective.  I applaud the community and War Room approach."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Escolas",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T22:50:41.000Z",
          "Titre": "War Room is great for Savages...unless you're trying to DM with Android.",
          "Contenu": "I love the dedicated sales based experience and personnel that I communicate with in the War Room. The current mods are great and quick to respond/fix any issues that arise. SalesGPT is a fun and possibly useful tool to use for the craft. Earning \"commission\" and using them towards fun rewards is cool too. Only issue is that there is no Android App and therefore lose out on direct message functionality, and I'm not sure it's even on the roadmap...damn apple addicts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TennisandSales",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T19:39:21.000Z",
          "Titre": "The community every sales person needs to be apart of.",
          "Contenu": "A super legit place to hear other sales ppl experience and get questions answered that you wouldn’t be able to ask in any other setting. The “commission” or points you ear to get free stuff is a really fun way to drive engagement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T21:56:39.000Z",
          "Titre": "Very good option for sales professionals",
          "Contenu": "Interesting company and concept that uses a message board to gain interactions. It then offers fractional and full time sales recruiting through it. A nice option, but nothing too crazy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc P. Perez",
          "Nb_Reviews": 5,
          "Date": "2023-01-26T17:29:07.000Z",
          "Titre": "The Content about sales is awesome",
          "Contenu": "The Content about sales is awesome, I have been in sales for a long time and the advice and best practices that are taught are top-notch for those who aspire to be top performers. My only gripe is the website itself for bravado.co, specifically, the Tech Sales U portion is very glitchy and often has to be cleared in the browser for you to login. Website issues aside,I love the content and I’m a fan of Bravado, keep up the great work."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Diablo",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T20:53:47.000Z",
          "Titre": "Sales professionals can't afford to miss this",
          "Contenu": "This is an amazing platform for sales professionals to discuss anything sales related. Very active community where all the members are purpose driven - purpose to help others like them succeed.Bonus - you get rewarded for your contribution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PH",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T13:19:25.000Z",
          "Titre": "Atten-hut! War Room Officers On Deck!",
          "Contenu": "The War Room has served as an interesting venue for sales professionals (and the adjacent) to come together and share challenges, best practices, and even a laugh here and there. I personally have solved a few sticky points with the help of the community, and I hope that my advice has impacted others as well.The items I would like to see improved are:1) Greater participation by the Bravado team. Perhaps a community manager or team of paid experts can hop in and help out from time to time.2) Focus on community experience rather than DAU/MAU. It's clear that the community is self-policed, and moderators would be helpful.Beyond those two points, the War Room has been valuable to me and I hope to continue to participate far into the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T21:35:24.000Z",
          "Titre": "Nice interface and strong community",
          "Contenu": "Nice interface and strong community. Also has learning materials."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sarah G",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:24:32.000Z",
          "Titre": "my go to community",
          "Contenu": "As someone who has joined the Bravado community this year and been affected by a RIF a few months ago - Bravado has been something I go to multiple times a day. The biggest thing I would call out is the War Room. As someone who was apart of a RIF a few months ago, having a community to go to for questions and also able to go and see past posts and conversations - has been invaluable to me. The WR is authentic and full of useful conversations and helpful from the community that isn't saturated with all of the self promotion and 'influencers' like Linkedin is. As time has gone on, I've gone from someone asking a question or two for honest help for myself to then being an active contributor to other people (especially as I've learnt things on my sales journey and job seeking). Especially since many of us in sales don't have an office full of others anymore - the Bravado community feels like you get to have that (and a place where trust me - you're gonna get the truth, but in the best way possible). Not only is the WR incredibly helpful and gives me a sense of community - the academy is a great source to learn - whether you are someone looking to get into your first role, youre a seasoned vet who needs a refresh on how best to interview, looking to switch into a new role and not sure how best to go about it is extremely helpful. All in all, I'd say Bravado is the only place I've been able to find that offers the sales community a place that keeps things real and if you're a respectful member - you will get that respect right back."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jason Seguin",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T17:42:54.000Z",
          "Titre": "Awesome community",
          "Contenu": "Awesome community where you can ask questions about sales and get answers from people who are in the trenches.  Anonymity means there is very little self righteous \"influencer\" posts and for the most part everyone is friendly and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:20:52.000Z",
          "Titre": "Great resource",
          "Contenu": "Bravado (and specifically the War Room forum for sales professionals) is a total game changer for anyone in sales. Between the Academy, which features short form quick tips on different aspects of the sales process, as well as other topics; and the wealth of knowledge that comes from other users, it's an unbeatable resource.Also great to be able to banter with other sales pros in a completely anonymous environment. Even if I don't actually know these people, I feel like I 'know' them.Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Hypnotist",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T06:43:40.000Z",
          "Titre": "Become a sales savage",
          "Contenu": "Draw upon a wealth of knowledge and pick the brains of a legion of hardened sales savages. Ask for advice on your current dilemas, learn about best practices, or how to fast track your sales career, safe in the knowledge that you are anonymous and can speak your mind without fear of chastisement. You can also earn gifts for your contribution to discussions. I’ve never seen any other forum quite like it. What are you waiting for?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Gerrish",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T18:51:38.000Z",
          "Titre": "Anonymous Sales Community Thats Actually Helpful",
          "Contenu": "Sales can be lonely. Other apps (see Glassdoor, fishbowl, etc) tend to be focused on non sales positions. Bravado fills that gap. The War Room (main forum) is completely anonymous, so you can ask your most burning questions without judgement or repercussions. The best part- the answers are actually helpful. I’ve gotten a lot out of this app, and I think others would as well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T20:03:12.000Z",
          "Titre": "Bravado is a phenomenal resource",
          "Contenu": "Bravado is a phenomenal resource for salespeople - it doesn’t matter if you’re just starting out or a seasoned veteran. Whether you’re looking for a new full-time gig, a side hustle, sage advice, or just somewhere to vent with likeminded peers, you’ll find what you need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T14:26:49.000Z",
          "Titre": "Have really enjoyed the Bravado War…",
          "Contenu": "Have really enjoyed the Bravado War Room over the last 12+ months. It’s a great place to share and receive advice/tips as a sales person as well as share a few laughs. Sales is hard and so it’s nice to have a place dedicated to sales people to better our skills set and relate to others. They also have a cool commission system where you get points for good content and can redeem on prizes (like AirPods or a Rolex)."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T17:43:21.000Z",
          "Titre": "Bravado is the best place to learn from other sellers",
          "Contenu": "Bravado is a great place to share insights in the sales field. I’ve found many pieces of helpful advice, and feel safe posting there. I find other sales forums can be very critical and harsh, but here if feels like everyone genuinely wants the best for you.Rewards make it fun/interesting to keep posting. The mods are awesome"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Randy Lahey",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T18:16:54.000Z",
          "Titre": "Finally, a useful social media community",
          "Contenu": "Likely the most useful Social media community I have come across. Perfect? No. But it gets 5 stars, because Bravado actively seeks out the advice of its members, and implements it. A vibrant community of self-policing sales professionals. I have learned a ton from experienced reps through the War Room; an engaging forum that allows you to share wins, debate best practices and shoot the breeze.It's a must join for sales professionals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabe",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T14:26:03.000Z",
          "Titre": "A valuable sales community",
          "Contenu": "I joined the war room over a year ago for a few reasons. Primarily, to connect and learn from others in sales roles. The contributing members that actively give valuable feedback is outstanding. Applicable insight into many industries, sales strategies, culture, etc. I highly recommend anyone looking for a no BS sales community to join, engage, and learn!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Varenya Penna",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:20:12.000Z",
          "Titre": "Bravado has been an amazing portal…",
          "Contenu": "Bravado has been an amazing portal where you can read, write and listen to sales experiences and stories from across the globe. Not just that, there are academy articles where you can find a lot of helpful articles (by sales folks) that help people in transitions, in resume building and even in negotiations. I have been massively benefited so far by just being on the platform."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Natalie Sela",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T05:51:16.000Z",
          "Titre": "My authentic self",
          "Contenu": "My guilty pleasure, I know I can be as salty and real as needed in my sales life. Anonymity gives that freedom to ask questions, give advice based on my own real experience and even vent (God knows in sales we all need that once in a while)Saving sh$t ton on psychologist Such a great place to just be me."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Agastya Adams",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T14:53:50.000Z",
          "Titre": "Reddit for Sales",
          "Contenu": "• Brilliant community for Sales and Revenue ICs• USP is Anonymity - which is driving the entire War Room to bring out rich, honest and fruitful content • UI, UX is very relatable to Reddit - which is actually a very good thing• The different tangents to the Bravado community in addition to building a network - like Academy and Exploring Sales Jobs is icing on the cake• Overall - a big thumbs up and Bravo for Bravado!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T23:03:36.000Z",
          "Titre": "If you're a Sales Professional, go here",
          "Contenu": "This is a great community for Sales Professionals.  If you want to seek anonymous advice from fellow sales people who live and breath sales and selling, this is the place. Its not the place to \"be an influencer\" (extremely refreshing).  Instead its a place to ask you questions and get real advice from other Sales Savages who have gone through what you are now going through.So if you're in Sales, don't finish reading this review - just go there and get involved!But if you want to finish reading this, now you're done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AntiAskhole",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T14:35:23.000Z",
          "Titre": "A Friendly Opinion",
          "Contenu": "I think overall, Bravado has been doing well with their model. There have been some bugs in the War Room, and most times it is corrected fairly quickly. Communication is accessible and steady with the leadership at the company which allows for less red tape. I think the idea of an anon community for Sales people is genius as it allows us to get gritty and in the dirt without exposing too much. Keep it up. Looking forward to seeing how things develop out over the next 12 months. P.S. we need to bring back awarding WR Lieutenants and WR Officers. Keep the ranks updated."
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "ZVRK",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T13:31:38.000Z",
          "Titre": "An amazing community for sales professionals",
          "Contenu": "It was long overdue that we (sales pros) get to be part of a community like this.The War Room is just a great, no-BS platform where AEs, SDRs, AMs..., from a wide range of industries, share their lessons learned, ask for advice, celebrate wins, and get support during tough times.I'm returning to the room daily and have already benefited from the sharing of knowledge. I feel like we're all learning together, and the sense of belonging to a community like this is just awesome.Kudos to the Bravado team and the community manager - you guys are doing a great job, keep it up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BTQ",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T17:27:34.000Z",
          "Titre": "Supportive Community",
          "Contenu": "I use the WR to get feedback and learn from the group of passionate and seasoned salesmen.In my short time, I've really grown to appreciate their feedback and knowledge. I've gotten great career advice and learned plenty of prospecting lessons.I feel bad for anyone just using it as a job board because it's so much more than that. It's an thriving community of salesmen trying to be the best they can be and helping others. Which is what \"good\" sales really is, helping others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SaaS Sales student",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T18:25:29.000Z",
          "Titre": "Proud War Room member",
          "Contenu": "I've had a positive experience being a member of the War Room having received helpful tips and tricks.  Overall, it serves to get some intel from other sales people (tech in my case) who've been there, done that. Plus, it can be entertaining."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J.D. Higginbotham",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T16:30:51.000Z",
          "Titre": "By the people, for the people",
          "Contenu": "Bravado serves the specific tone and needs of SaaS salespeople.In a world of skin deep communities and recruiting efforts, Bravado has taken risks to change the way us SaaS savages keep it real towards our next step…whatever that may be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Gigliotti",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T07:10:04.000Z",
          "Titre": "Bravado is exceptional…",
          "Contenu": "Bravado has been a huge help for finding advice for career and sales development, job search, tips and tricks of the trade, and keeping up to date on current trends in the sales market and industry. I also have learned a lot about others and how sales touches so many aspects of markets and communities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan H",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T17:06:28.000Z",
          "Titre": "Great Team- Flex Hire",
          "Contenu": "Great Team- Flex HireThis team went above and beyond to ensure I understood the company by setting aside time to dig into the product, culture, and overall expectations of the flex role I was applying for. I was stuck in unemployment for 3 months before I found Bravado, they gave me the boost I needed to show up to interviews more prepared and more sure of what I wanted.I highly recommend working with Bravado to find your next career!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maximus Greenwald",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T04:10:03.000Z",
          "Titre": "flex is the new way to hire sellers",
          "Contenu": "The entire Bravado Flex process has been a breeze.  We went from searching to having our first Flex Rep in seat in no time, and the Bravado team has been super supportive throughout.  As a CEO, I appreciate how Flex de-risks the sales hiring process, allowing me to invest in growth while still managing burn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Noe",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T02:14:09.000Z",
          "Titre": "Highly recommend Bravado",
          "Contenu": "Bravado is a fantastic community of folks in sales to learn and connect with each other. I've certainly learned quite a bit from the discussions. In addition, Bravado does a great job of helping those in sales find the right jobs, and the staff is tremendous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oldcloser",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T18:05:09.000Z",
          "Titre": "The Anti-LinkedIn",
          "Contenu": "This community has become a part of my daily drill. Endless resources for sales strategy. Advice on anything you ask. But keep it real. This ain't a place for fake influencers. Maybe hang our for a week or so and just read the room before dropping your first post. Gotta be a billion years of professional experience in there. The truth will be told. Bonus: It pays commissions. You need this if you sell for a living. Trust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor Clot",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T19:43:12.000Z",
          "Titre": "highly recommend starting with Bravado for your next sales job",
          "Contenu": "Seamless, straightforward process. Filled out my Bravado jobs profile, Ryan reached out the next day and was immediately connected with 3 great organizations for sales roles. Ryan stayed in touch throughout the processes and offered insight into the interview processes/who I'd be meeting with. Sahil even offered to walk me through the job offer and his perspective on the company I would eventually join.If you work in Sales, sign up for Bravado for the community at the very least. If you are searching for your next role (or curious to see what's out there - where my search started) - go to Bravado Jobs you will not be disappointed"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mohammed",
          "Nb_Reviews": 2,
          "Date": "2022-01-16T18:17:26.000Z",
          "Titre": "The best sales professional community",
          "Contenu": "I’ve been a member of Bravado’s War Room for 6 months now and it addresses such a huge gap for sales professionals. The community offers a forum to ask questions about everything from prospecting and closing, to career progression and work life balance. I also worked with Bravado Jobs, which unlocked opportunities for me that I didn’t know existed. This is sales community that everyone should be on."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Daniel Santiago Moreno Waked",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T03:55:43.000Z",
          "Titre": "Bravado is a place for seasoned and…",
          "Contenu": "Bravado is a place for seasoned and newbies sales people willing to take their sales skills to the next level. With a highly engaged and well-moderated platform, Bravado is the best place to nurture your sales understanding, with a wide board of topics including but not exclusive to email templates, best practices, call calling, and so much more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delvis Perez",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T16:31:48.423Z",
          "Titre": "Bravado is the Future",
          "Contenu": "From start to finish, I felt as if I had Bravado in my corner. They made the recruitment process extremely easy, gave me a confidence boost when I needed it most, and instilled the confidence needed to counteroffer. Rebecca is an absolute rockstar and did a fantastic job of keeping me informed and prepped for the next step. In the end, I landed my dream role at a world class company and negotiated a massive pay raise! THANK YOU BRAVADO!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doink",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T23:55:55.000Z",
          "Titre": "Better than Reddit!",
          "Contenu": "I always enjoy a great community of sales people who help each other. It’s also nice in the world of revenue politics to while have the security of remaining anonymous. Great platform, I wish more people I worked with would use it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Morgan Frese",
          "Nb_Reviews": 2,
          "Date": "2022-04-26T19:23:28.009Z",
          "Titre": "What an awesome experience",
          "Contenu": "This was such an easy and collaborative process. From the moment I first engaged with Bravado to the moment I was serious about a new role, every interaction has been positive and valuable. Ryan really listened to me to figure out what I wanted, what my deal breakers are and educate me on companies he was suggesting. He was extremely responsive and even when I was unsure about my offer, he suggested I speak with Sahil to walk through my concerns and make sure I made the right decision. In no way was I ever pressured but I was made to feel like I had a choice with a supportive team behind me. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Salazar",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T22:48:23.000Z",
          "Titre": "No better room than the War Room",
          "Contenu": "This is a great platform for all levels of sales professionals. There's so much real life experience in there and it's been helpful for me in navigating my way through the life of tech sales."
        },
        {
          "Note": 5,
          "Lieu": "HN",
          "Pseudo": "Diego Pineda",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T01:56:24.000Z",
          "Titre": "If you are a sales professional and…",
          "Contenu": "If you are a sales professional and still are not part of Bravado, you are falling behind. This community has it all; experienced veterans with all the knowledge of the world ready to help you out from the goodness of their hearts, a job portal way batter than LinkedIn just for sales, and great material to read in their academy. 10/10 recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max Johns",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T22:17:58.000Z",
          "Titre": "Friendly and Knowledgeable Recruitment Advisors",
          "Contenu": "The company was very surgical in finding the right fit for myself and my employer based on my previous skillset, experience, and network.  They were super helpful in the entire hiring process and were able to be called upon throughout every stage.  Highly recommend their friendly team and I would totally use them again in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NEB",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T16:45:36.000Z",
          "Titre": "Bravado Success Story",
          "Contenu": "I signed up with Bravado and quickly received notice that a company wanted to schedule an interview. Bravado assisted throughout the process making it very easy to get scheduled, debrief, and handle the offer. I'm very happy with my new company and role and can't thank Bravado and Rebecca enough for their help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sophia Bach",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T06:41:11.000Z",
          "Titre": "Honest sales banter",
          "Contenu": "Finally a sales/company review platform without fake reviews, and a place for the sales community to connect and celebrate wins!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Massetti",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T09:24:30.000Z",
          "Titre": "I am so happy with my experience",
          "Contenu": "I am so happy with my experience, I have never had a service help me and support me through such a hard time. The interview process was intensive but Sonia got me through it like a good friend and personal supporter. Sonia sent me a contract temp job before even starting the new one I accepted this week. I had a few different interviews and processes going but the support I got was the make or break for why I not only continued but also got the job I really wanted. I feel very grateful I was able to work with a team that cared about me and my future and not just a job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy L.",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T07:10:39.000Z",
          "Titre": "Not easily impressed, but WOW.",
          "Contenu": "Coming from a recruiting and staffing background myself, I can say that it typically takes a lot to impress me when it comes to professionals in the industry.  Without a doubt, Rebecca at Bravado has absolutely set the BAR for professionalism, empathy, honesty, and all in all just being a phenomenal human being....and she helped me find a true unicorn of an opportunity at my new company!Thank YOU Rebecca, and your whole team at Bravado.  Consider me beyond impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hayley Pogue",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T18:38:56.000Z",
          "Titre": "Bravado changed the trajectory of my life",
          "Contenu": "Bravado helped me find a better job where I can learn and grow! Bravado's CEO, Sahil, reached out to me directly when I signed up for the site and he made it his mission to help me find a place I wanted to work. I was underpaid and over-performing at my then-role. He personally reached out to companies and made introductions and helped me land where I am today. I am thriving in my new role at a rocketship of a company. Bravado honestly changed my life"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rohan",
          "Nb_Reviews": 1,
          "Date": "2022-08-06T02:41:57.000Z",
          "Titre": "Federal AE role via Bravado",
          "Contenu": "I started using Bravado's jobs functionality about a year after I started using the War Room community. Within a couple of days, Bravado matched me with a highly relevant SaaS company with an open role for a Federal AE. My background aligned well with the role and company and I had several interviews over the course of 2-3 weeks before receiving my offer letter. I was impressed with how quickly I got connected and how highly relevant Bravado's job openings were with my experience. Highly recommended to other AE's looking for a great next move."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Madey",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T18:24:58.000Z",
          "Titre": "Impressive Team at Bravado",
          "Contenu": "Made a profile through Bravado and within two weeks was set up for an initial interview. The team at Bravado were great to work with. Communication throughout the entire process was amazing. I am impressed after making the profile the company I was set up with was precisely what I was looking for. Very grateful for Bravado!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AC",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T02:14:23.000Z",
          "Titre": "I can't speak highly enough of Bravado",
          "Contenu": "I can't speak highly enough of Bravado. The job matching experience was seamless and personalized, and ended up pairing me with some incredible companies. Once I submitted my interest, the Bravado team reached out and made sure I was prepared to be successful throughout each step of the interview process. And most importantly, as soon as I received an offer, they were an amazing resource to help me negotiate, feel valued, and feel confident in my decision to eventually accept the position. Thank you for everything Sahil, Nate, and the Bravado team!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Mellott",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T21:25:50.000Z",
          "Titre": "Best in the Business",
          "Contenu": "Where to start with Bravado and team...? From the first experience in getting some of the most top notch roles presented to me, to being set up for some great interviews, all the way to skipping much of the standard interviewing games, the entire experience was amazing.  Rebecca on the team is one of the best I've ever had the pleasure to work with and have been referring Bravado to colleagues as they look for new positions. Absolutely outstanding experience all around!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grafton Potter",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T16:20:38.000Z",
          "Titre": "Great Sales Community",
          "Contenu": "I have loved using the Bravado war room to hear from other Sales people’s experiences, to bounce ideas off of, and to celebrate wins. Truly a great idea with even better execution!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jashandeep Mundi",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T20:10:17.000Z",
          "Titre": "Bravado Is One Of The Best Platform To Be On As A Sales Rep",
          "Contenu": "Bravado was instrumental in helping me find my new BDR role at Commsor. Ryan guided me throughout the entire process and the end result was an amazing offer from an amazing startup. It's exciting times!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T16:29:54.000Z",
          "Titre": "Excellent",
          "Contenu": "Bravado has been an excellent community to be a part of. Its one of the first places I go to look for advice on career progression, looking for a new role, and professional development.Highly recommend it to any sales profressional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kellie Ringler",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T17:22:02.000Z",
          "Titre": "Can’t recommend Bravado enough",
          "Contenu": "Can’t recommend Bravado enough! Not only is it a great sales community to be part of, but I was able to get 1v1 assistance from a bravado employee. They took the time to get to know me and my goals, what I liked about my current job, and what I would be looking for in a future employer. I was immediately connected with direct contacts at companies that most aligned with what I was looking for.I was able to land a new role in the SaaS industry and couldn’t be more excited and happy about the opportunity - all thanks to bravado!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Kunzman",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T19:06:08.000Z",
          "Titre": "Finding a job can be a very stressful…",
          "Contenu": "Finding a job can be a very stressful endeavor, and you often feel like you're banging your head against a wall repeatedly, trying to get interviews with decision makers. Having Bravado on my side changed everything. With very professional and personable employees like Hayley Weik working as an advocate on my behalf, I not only began to get interviews soon after signing up for Bravado, but I received a great job offer from an amazing company within two weeks of interviewing with them. I wouldn't have gotten the interview in the first place had it not been for Hayley. Thank you Hayley, and thank you Bravado!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neal",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T00:37:47.000Z",
          "Titre": "Bravado is overall fantastic",
          "Contenu": "Bravado was a fantastic experience for me. Their service was very personable and tailored to you as an individual. The people who work at Bravado are caring and will do their best to help you get the best position that suits you. Overall, I had no idea a service like Bravado existed and they pleasantly surprised me with a superb experience. I would recommend Bravado to anyone who is in the job market or could use some career counseling and advice."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nairobi",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T16:25:15.000Z",
          "Titre": "Great Sales Community",
          "Contenu": "I wouldn’t have stayed in Sales if it wasn’t for this community. I was two months into my career when I joined Bravado, and I’ve learned most of what I know about the sales space from the community. I joined a lot of sales communities, and the only one that I’m active in is Bravado because it’s the only one that helps me grow/learn."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Morse",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T01:32:44.000Z",
          "Titre": "Great community, you need to be here",
          "Contenu": "Great community. Love the discussion and that it’s focused on people in sales. There’s no outsiders selling stuff or people who are focused on not contributing. I’d recommend joining if you have a career in sales and want to be around like minded professionals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mustafa Salihbegović",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T21:21:30.000Z",
          "Titre": "Bravado was the best resource I have…",
          "Contenu": "Bravado was the best resource I have used in a long time! Super easy process and every company that reached out to me was solid and exactly what I was looking for. I accepted a position with a employer that I’m super excited about and will refer anyone I know to use bravado! Thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emelie Smith",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T22:40:38.000Z",
          "Titre": "I was impressed with Bravado from the…",
          "Contenu": "I was impressed with Bravado from the beginning. They were professional and proactive and took the time to really understand what I was looking for in a new role. I would highly recommend them, and have been placed with a company I am very excited to be joining."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-10-11T16:24:03.000Z",
          "Titre": "Amazing Experience w/Bravado Team",
          "Contenu": "Kristine was amazing! The Bravado team helped me find the perfect job. She was always there to answer any questions I had and provide helpful information regarding the role I was interviewing for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MG",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T18:20:50.473Z",
          "Titre": "Highly recommend if you're looking for a job in customer success!",
          "Contenu": "Bravado introduced me to 3 really interesting companies I wouldn't have found myself. The team prepped me for interviews and gave me some helpful tips for interviewing. I landed a job at one of 3 and I LOVE it here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nick manusos",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T16:38:16.000Z",
          "Titre": "A safe and fun place to interact with other sales professionals",
          "Contenu": "Bravado has been an excellent community to learn about how other sales professionals are successful in their various markets and sectors.  Everyone is always helpful in answering questions or concerns, and it has been a fun place to interact anonymously.  The War Room in particular has been very welcoming since I joined and I have enjoyed spending time there with all the other savages!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Isaiah Hickland",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T17:47:32.000Z",
          "Titre": "Bravado helped me land a new role!",
          "Contenu": "I created a profile on Bravado searching for a new role to take the next step in my career. Within the next two weeks, I’d been contacted by a few companies and began the interview process. Ultimately I ended up receiving an offer and accepting with a company that reached out via Bravado. Ryan from Bravado was extremely helpful and attentive during the process and I’d definitely recommend Bravado to anyone looking to take the next step in their career without dealing with the hassle of recruiting processes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi Vester",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T02:13:58.000Z",
          "Titre": "BRAVO!! Bravado!",
          "Contenu": "Bravado led me on a seamless journey to the job of my dreams. Rebecca was such a dream to work with. Constantly checking in and reassuring me that the position was mine. I couldn'tve asked for a better experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JR",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T22:00:13.000Z",
          "Titre": "Incredible Experience",
          "Contenu": "I was submitting applications online and not hearing back from the employers. I was connected with a Bravado employee on a Wednesday who quickly matched me with 5 companies. On Friday of that same week I was asked to interview with my new company that following Monday. Amazing experience and the highest quality people!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Stanwick",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T15:16:20.000Z",
          "Titre": "Trust Bravado!",
          "Contenu": "Bravado was an awesome service to use while searching for jobs.  They don't bombard you with job opportunities that might not be worth your while, they wait for a great opportunity and make the process super quick and streamlined to getting into the interview process."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Nicholai Bach Christensen",
          "Nb_Reviews": 10,
          "Date": "2022-01-13T20:30:31.000Z",
          "Titre": "Best place for sale pro’s",
          "Contenu": "Absolutely the best sales space I have ever witnessed. If you are having a question, trouble closing customers the whole community is ready to help! 5/5 to the bravado community and the whole team behind!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alexandre",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T21:08:21.000Z",
          "Titre": "Experience with Bravado was wonderful!",
          "Contenu": "Experience with Bravado was wonderful. My contact, Rebecca, was an absolute joy to work with and have nothing but high praise for her. Will definitely be recommending Bravado to others."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Peter Kuperman",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T15:05:46.000Z",
          "Titre": "Ben and Olivia are amazing!",
          "Contenu": "Ben and Olivia are amazing!I signed up for Flex on a Monday. Ben and Olivia worked really hard to get me set up and with high quality candidates to review within days. Within a week, I had found a Flex rep I wanted to work with. After two more weeks, I had another Flex rep. Both people I found through Flex were really sharp, intelligent and ready to build and grow my business.Flex is awesome. Bravado is so well run."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sunbunny",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T00:52:13.000Z",
          "Titre": "Great place to get honest feedback",
          "Contenu": "My experience with Bravado is limited to the War Room forums, but that has been a great experience.  If you're looking for honest assessments and feedback from other sales professionals, you'll receive that.    Since most contributors choose to remain anonymous, you'll find many opinions are more honest than they'd be otherwise.   Contributors don't tolerate spammers and are quick to redirect unhelpful or self-promoting posts, but if you read the rules, read the tone of the forums, you'll be welcome.  Unlike other forums, there are rewards for valuable posts, which leads to more thoughtful engagement.   I'd recommend it to anybody trying to improve their own sales process and to anybody who is willing to receive honest, occasionally blunt, feedback - although a good sense of humor doesn't hurt either."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-10-11T16:17:25.000Z",
          "Titre": "Amazing Service",
          "Contenu": "Kristine was so helpful throughout the process. She was always available to answer my questions and helped with tips on the interview as well as providing information about the company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Conor Chepenik",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T18:42:30.000Z",
          "Titre": "Incentives",
          "Contenu": "I like how the incentives of this social media platform are aligned. Earning commissions for your content is a great model!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mauro Tete",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T01:19:45.000Z",
          "Titre": "My experience with Bravado Jobs was…",
          "Contenu": "My experience with Bravado Jobs was great! Got a call from them and was put in front of a great company that has a great product, leadership and compensation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alida",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T19:10:14.000Z",
          "Titre": "Bravado was amazing to partner with on…",
          "Contenu": "Bravado was amazing to partner with on my job search, in specific, Rebecca Stern was one of the best CSM recruiters I had the chance to work with.Thank you Bravado!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T00:21:30.000Z",
          "Titre": "Amazing!! Bravo!!!",
          "Contenu": "Amazing customer service. Rebecca hooked me up with the job of my dreams. I recommend Bravado to anyone looking for the next sales role!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T19:31:16.000Z",
          "Titre": "Great platform for sales professionals",
          "Contenu": "Easy to use platform that acts as a place for sales professionals to come and exchange ideas and vent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Markham",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T22:02:04.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. They stay with you the whole way and are always available for advice. They make sure you get the best offer possible!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabe",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T21:08:26.000Z",
          "Titre": "Olivia - Bravado Flex",
          "Contenu": "I was contacted regarding a Bravado Flex opportunity the week of October 31st. Olivia reached out and scheduled a time to connect prior to the interview. She did a great job outlining the expectations and what the company was looking for. While I wasn't selected to continue the interview process for the opportunity, Olivia followed up accordingly with applicable feedback for potential future roles. Great experience and look forward to more opportunities from Bravado in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elijah Caldwell",
          "Nb_Reviews": 2,
          "Date": "2022-06-13T19:03:49.000Z",
          "Titre": "A Glowing Review",
          "Contenu": "May this message find you well. My name is Elijah Caldwell and I just wanted to take a moment of my time to reflect on a uniquely tremendous experience I just underwent with Rebecca at your company, Bravado.From the initial call all the way through to signing with the company of my dreams, Rebecca was not only there to offer her support, but also consistently went the extra mile to facilitate the warmest introductions possible as I journeyed into a new endeavor. Personally, I’m not sure what you’re paying her to do her job, but I can assure you it’s not nearly enough because her work is invaluable in every sense and meaning of the word. I’d give her the ultimate raise if I were you, but hey I’m just throwing it out there.I’ll be referring all of my friends to Bravado because of my experience with her. As the Chief Executive, I’m sure that’s something you can appreciate. Know that I am more than thrilled to leave this glowing review for you all on behalf of the experience I had with Rebecca. If only this world had more angels like her, truly we would be in an even better place than we find ourselves in now.Happy to have come across Bravado and even more ecstatic to have had the experience I did with Rebecca. Hopefully everyone is as wonderful as she is. If so, you are definitely doing something right. Great job over there! Keep it up!Thank you for your time and attention to this matter.With appreciation,Elijah CaldwellTimeless®"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elijah Caldwell",
          "Nb_Reviews": 2,
          "Date": "2022-06-04T01:16:55.000Z",
          "Titre": "A Glowing Review about Bravado Greatness",
          "Contenu": "May this message find you well. My name is Elijah Caldwell and I just wanted to take a moment of my time to reflect on a uniquely tremendous experience I just underwent with Rebecca at your company, Bravado. From the initial call all the way through to signing with the company of my dreams, Rebecca was not only there to offer her support, but also consistently went the extra mile to facilitate the warmest introductions possible as I journeyed into a new endeavor. Personally, I’m not sure what you’re paying her to do her job, but I can assure you it’s not nearly enough because her work is invaluable in every sense and meaning of the word. I’d give her the ultimate raise if I were you, but hey I’m just throwing it out there. I’ll be referring all of my friends to Bravado because of my experience with her. As the Chief Executive, I’m sure that’s something you can appreciate. Know that I am more than thrilled to leave this glowing review for you all on behalf of the experience I had with Rebecca. If only this world had more angels like her, truly we would be in an even better place than we find ourselves in now. Happy to have come across Bravado and even more ecstatic to have had the experience I did with Rebecca. Hopefully everyone is as wonderful as she is. If so, you are definitely doing something right. Great job over there! Keep it up!Thank you for your time and attention to this matter. With appreciation,Elijah CaldwellTimeless®"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Woody Milfort",
          "Nb_Reviews": 3,
          "Date": "2022-06-25T01:58:48.000Z",
          "Titre": "Best Recruiting Platform for Sales Pros",
          "Contenu": "I found out about Bravado through a friend and let me tell you...It was the most seamless process for landing a new sales role. If you're a sales pro looking for a new role, make sure to have Bravado as a tool to help you land your next dream job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T12:04:12.000Z",
          "Titre": "I had a great experience with Bravado",
          "Contenu": "I had a great experience with Bravado, certain questions wouldn’t directly apply to the information videos would cover. Such as questions on companies that the student may not be familiar with unless individually researching when answering those questions. I’d suggest incorporating information about those companies in the video content, or removing questions about companies not covered in the videos. Otherwise, a great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Conor Chepenik",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T03:49:20.000Z",
          "Titre": "Chep’s Review",
          "Contenu": "This site is a gold mine of sales individuals eager to laugh and learn from each other🤝"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T17:45:00.000Z",
          "Titre": "Bravo Bravado",
          "Contenu": "The Bravado team was extremely helpful, acting as confidants to match and source an opportunity that was not only a fit with my background and ambitions, but for a role that fit my criteria regarding culture, compensation, and trajectory. They were available as coaches and fiduciaries, ensuring this expirience and ultimate offer were in my best interest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruthie Nissim",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T20:04:45.000Z",
          "Titre": "Bravo to Bravado for landing me my new amazing gig!",
          "Contenu": "Hats off to the incredible Bravado team who worked their magic. I had been interviewing left and right for about four months to get out of a very toxic workplace, and escape it's silo'ed, rigid, ancient ways under arguably the most incompetent leadership. Somehow, even with an average of 5-7 in-mails a day from recruiters as a result of ‘The Great Resignation,’ the incredible team at Bravado matched me with what appears is the perfect fit on both sides. While I always preach \"never say never,\" I look forward to never being employed by a publicly traded company unless they are a rare gem that operates like a startup. Over the last year, I've reflected and asked myself where I've been happiest, where I will thrive and make the biggest mark, and one thing became apparent: Early stage startups that have brilliant, humble, transparent and forward-thinking leadership, a game-changing product that that I can be SO passionate about based on how it solves customers' challenges and creates a better future for them, and allows me the autonomy to get my job done, AND...VALUES MY INPUT! Say what?!?!  I made a top 10 list of those early stage startups after identifying what criteria is critical to assess a startup's likelihood of crazy future growth, and Bravado introduced me to two of those that were on my list!I’m December, I wrapped an awesome and fast process and ecstaticly accepted the offer🙌🙌🙌🙌🙌🙌 with the second startup they introduced me to, and just in time to leave all of the bad of 2021 IN 2021, and crush life in 2022. Coming in as their second Sales hire, the opportunity is incredible. The ability to help build and shape all aspects of the company gives me chills.THANK YOU to the amazing team at Bravado🙌💪👊.To my fellow salespeople, Sahil and his team know which startups to watch, the ones that will explode. If you're even 1/8 as miserable as I was navigating corporate bureaucracy and politics, TAKE THE CHANCE. It will be the best learning experience, and the most fulfilling career move you'll make."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Deason",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T21:03:48.000Z",
          "Titre": "Simple a process! Rebecca was very kind and easy to work",
          "Contenu": "Rebecca was very kind and easy to work. Provided great opportunities."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bhavin",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T03:43:41.000Z",
          "Titre": "All the support and help from learning…",
          "Contenu": "All the support and help from learning tech sales to building relationships is incredible 🙏🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Welther",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T23:48:19.000Z",
          "Titre": "Could no Recommend Highly Enough",
          "Contenu": "Bravado was an amazing experience! Rebecca was so helpful and invested in my process."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jeremy R Unwin",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T02:55:31.000Z",
          "Titre": "Streamlined , focused Superb",
          "Contenu": "Streamlined service and the war room presents interesting opportunities to share challenges and victories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "khari bush",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T22:04:36.000Z",
          "Titre": "Great process",
          "Contenu": "Great process, great team!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bilal Sayed Gol",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T10:57:09.000Z",
          "Titre": "great if your new to sales"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Herstein",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T22:54:12.000Z",
          "Titre": "Great Experience"
        }
      ]
    }
  ]
}