{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "buyontrust.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T18:02:45.000Z",
          "Titre": "This company is full of SH!t !!!!!",
          "Contenu": "This company is full of SH!t!!!!!! And when I mean sh!t I mean human sh!t animal sh!t and thing that lives on this earth and sh!tthis is what this company is!!!!!I find it funny how I got approved for a certain amount placed an order not only did they take my money $40 twice I never got an order number no anything about the agreement been calling them and the financial company for over two weeks n nobody knows nothing! I would definitely be going with anothe lr company and spending my money else where!! N I will write a review on every page I find because this is so unacceptable I still haven’t gotten my money back either. Oh and now they denied me 😂😂😂😂 what A Fnking   JOKE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Levy Photo",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T18:46:09.000Z",
          "Titre": "Careful they will lie and force the lease on returns",
          "Contenu": "This company may be fine if you intend on keeping the product. In my case I returned the item in less than 48hours after pur having and talking to BuyOnTrust Customer service regarding returns.  I asked if there are any additional fee associated with the returns I was told no and more attention was put on giving a review. After returning my item BuyonTrust is attempting to force my lease to stay open to the tune of 1700 because of a return fee. I said no problem the amount of the return fee has been taken out of my account so you guys can use that and disregard a refund. The company wanted an additional 200 via PayPal and said the money paid can't be used....So at this point they are trying to have me pay for nothing at all. Im highly disappointed in the way they do business....and intend of fighting this every step of the way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rudy Cesena Jr.",
          "Nb_Reviews": 3,
          "Date": "2021-04-09T17:08:19.000Z",
          "Titre": "Trash",
          "Contenu": "Trash, third party middleman company.  Nothing but a website which is edited as they need.  Takes no responsibility to help you if your product is defective.  5 trips back to best buy and still not resolved.  Also after 5 times of returning to Best Buy to exchange phone at your direction you are 100% right, I won’t listen to any more bs.  Looking forward to that return shipping label and no, you won’t be keeping any of my money.  Dispute is being processed  with bank and Best Buy management has preserved the video of when i picked up the product.  Making false accusations against a customer is really wrong. Even if you edit your post after the fact. You can point out where they handed me the alleged cash.  Way to expose yourselves.  Nevertheless if you weren’t a trash third party company you would understand the phone case was wrong and because of your poor customer service Best Buy made the discussion to exchange the case for the correct one.  How they processed that was up to them, not me.   You have edited response at least 3 times after you attempted to report my review as fake and failed.  Just waiting for Acima or our company to supply a return shipping label or some court documents.  Oh, and your customer service, both phone and chat, is what got us here.  You should have a record of all my calls, chats etc, I know I do.  Seems like no one in your company really knows whats going on.  lol. Last but not least y'all lucky I can't share screen shots here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Levy Photo",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T16:17:44.000Z",
          "Titre": "Updated 6-29-21",
          "Contenu": "Update 6-21-21: after saying they will refund and waive the \"rental fee\" i was still charged for the camera I don't own and no refund was received yet.... I was told to reapply to get my fee waived (I did and was approved) and no reply from customers service yet. They say that the return fee was explained , yes it was, after the fee was incurred , and it wasnt mentioned by customer service before returning and they don't acknowledge I spoke with customer service before returning anything to confirm whats needed. So far I have been charged 210$ total on an item I don't possess or own.....I will continue to update this review..... all this headache for an item I had in my possession for less than 48hoursWill definitely update my review if the situation is resolved...EDIT: How am I being difficult when I followed you guys instructions to remove the rental fee?....seeing as though I've been charged more than the rental fee up to this point and the slow speed of replies I've been more than agreeable. As a person who works constantly i can't wait around for calls. So perhaps if you can give a time frame or something more reasonable than the attitude and hassle I've been getting that would be far more helpful. I would assume a customer being continually charged for an item they don't have would be a priority...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shuvam",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T22:36:54.000Z",
          "Titre": "Wastage of your time and energy!",
          "Contenu": "They are extremely inefficient and don't value their customers at all. I felt like they are doing some kind of favor by selling products more than 30%-40% more than their original price. Honestly, I don't have any problem with the price but believe me their customer service is so trash you will just lose interest. After 2/3 days of their nonsense, I ended up canceling my order. There are lots of other companies who will treat you better. Highly suggest you avoid this bogus company.Reply of the reply-LoL! Seriously?? I already discussed my travel plan with their agents the very first day! Verified my identity and whatever they asked me for ( That was very very time consuming process by the way). Then after all that they changed the store and the date for their own convenience (Customers has no priority). On the due date I returned from the store for their inefficient process. And on the next day the nonsense agent cancelled the whole order and told me to go back to my place cancelling my whole travel plan?!! Wish I could post the chat history here that I send to trust pilot for the verification of this review.To BuyonTrust-If you think you are doing some kind of favor you are absolutely wrong! And also if you think you are doing enough, trust me others doing way better than you (Already got my things). I'm sure you will get more bad reviews in the future if you keep doing this nonsense with your valued customers.Peace!!Oh! You guys are really something!! Wonder if you are even legit or a fraud company?! Second response:If I am not real I wouldn't have replied you or reviewed your company on the first place! If someone has complain against you it's not like you have to degrade them. You know this a vital difference between you and other companies. You guys are just showing you real face to other people. That's good actually!By the way you verified me two times. Still you could have asked me for more information, which is absolutely not a problem for me. Me and my brother stay at the same house, so it's kind of hilarious how you flag things! Grow up and try to act professional.Now don't waste my time here. Already wasted a loOot!Last message to the general people-Who ever planning to buy things from this company- Do your research first and don't waste time with their craps because they are literally the worst one there. Lateron, you can not even give them a negative review! LoL! And, I don't know who the F is there in their fraud detection team but he/she is dumb as F! Bet he didn't even passed his Bachelor! Low lifes!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kierra-Fort Lauderdale,FL",
          "Nb_Reviews": 2,
          "Date": "2021-12-10T19:56:00.000Z",
          "Titre": "Stole my money then cancel my order",
          "Contenu": "I order two item I sent in all documents including my picture ID they took two payments out my bank account. After they took two payment I received an email saying they cancel my order couldnt verify identity but they still have no return any of my money I called no manager or supervisor told email resolution team i email resolution team 6 times no never email me back they stole my money please stay away they only have positive reviews because they challenged all negative reviews they even email me threaten me with attorney action if I didn't take down my review I wish i could post the screen shot stay away from this companyTrust pilot verify my email address and i could i would post the email screen shot from you guys and my refund has not been return to my account my bank now during fraud charge against buy on trust because i had send email proof to my bank show buy on trust email said they return money never did then got email saying money was never remove from account and did stay away from this company. They are looking trust pilot doesn't allow picture up load because I would post all screen shot of emails from buy on trust team after I posted this review"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T02:28:14.000Z",
          "Titre": "Customer service",
          "Contenu": "Customer service, or lack there of. I am not pleased with this company. Would never recommend this to anyone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian curran",
          "Nb_Reviews": 2,
          "Date": "2020-03-14T15:23:01.000Z",
          "Titre": "They just charged me $50 and the order…bad",
          "Contenu": "They just charged me $50 and the order corresponding isn’t there. Not a good start. Steal my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Freddie",
          "Nb_Reviews": 2,
          "Date": "2020-08-13T21:47:35.000Z",
          "Titre": "Super high interest rate and charges…",
          "Contenu": "Super high interest rate and charges more for the product than Best Buy does!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betty Jeter",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:55:30.000Z",
          "Titre": "It was a pretty good experience",
          "Contenu": "It was a pretty good experience. Only issue I had was the system didnt want to take my bank account info."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "erika terry",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T06:43:13.000Z",
          "Titre": "Everything was smooth",
          "Contenu": "Everything was smooth. I have nothing to complain about. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:01:39.000Z",
          "Titre": "N/A not applicable",
          "Contenu": "N/A this is not applicable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T18:57:39.000Z",
          "Titre": "Other than my order being canceled…",
          "Contenu": "Other than my order being canceled after saying it was ready for pick up, they changed the price anyway once that was all said and done, I'm happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Logan M",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T21:39:06.000Z",
          "Titre": "The price gouge so much but if you're…",
          "Contenu": "The price gouge so much but if you're in need of a credit improvement it's the way to go. I was a quick and easy process. Got approved in seconds and seamlessly pick up at the store with no hiccups."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Jayson Dean",
          "Nb_Reviews": 2,
          "Date": "2022-06-02T16:44:09.000Z",
          "Titre": "I wish there were more stores like…",
          "Contenu": "I wish there were more stores like this! Minimum price, prompt feedback, fast delivery, what more do you need!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gwendoline",
          "Nb_Reviews": 4,
          "Date": "2021-11-30T15:52:37.000Z",
          "Titre": "not same day shipping",
          "Contenu": "bought a bag from my baby's stuff with same day shipping but no one brought. I got it on the next day, the rest was ok, thanks!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adegoke Adebimpe",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T17:00:35.000Z",
          "Titre": "Their customer service is excellence…",
          "Contenu": "Their customer service is excellence and amazing 🤩."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T23:05:35.000Z",
          "Titre": "Customer service was really good"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Divya",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T06:58:43.000Z",
          "Titre": "Amazing baby clothes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T22:59:19.000Z",
          "Titre": "Should be more accessible",
          "Contenu": "Should be more accessible. Customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T20:06:54.000Z",
          "Titre": "Everything went pretty smooth",
          "Contenu": "Everything went pretty smooth. The only issue I have is that my order never appeared on my account in the webpage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kitty",
          "Nb_Reviews": 2,
          "Date": "2020-04-07T21:48:21.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. The person was well prepared to answer all my questions.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Muhammad afzal",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T08:33:40.000Z",
          "Titre": "very great experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T21:47:16.000Z",
          "Titre": "Very responsive and communicative"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nathaniel shields",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:12:41.000Z",
          "Titre": "Frank write was very polite patient and…",
          "Contenu": "Frank write was very polite patient and took time to take care of my issues with in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T02:02:22.000Z",
          "Titre": "Very appreciative and satisfied",
          "Contenu": "Harlem Lexington and Frank were very helpful in answering my concerns pertaining to my loan. Harlem even contacted me to check in on the customer service that I received. They all went above and beyond to ensure that my transaction for my items went through and went over what to expect moving forward. I’ll be picking up my laptop once I get off. Thank you to everyone who made this experience very convenient for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dysean Harper",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T21:41:15.000Z",
          "Titre": "Angie Smith took care of me and the…",
          "Contenu": "Angie Smith took care of me and the customer service was quick and fast she needs to be promoted above her peers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elyria, OH Customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T00:39:18.000Z",
          "Titre": "Easy approval and ordering process!!",
          "Contenu": "Found this company while searching online for lease or rent to own electronics. The application process was easy and I received instant approval. I placed my order and it was a fairly intuitive process. I spoke to Frank Wright about an item on my order that was still not available for pickup at Best Buy and he was very helpful in explaining the ordering and fulfillment processes. I look forward to using this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jazmin Guerra",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:08:02.000Z",
          "Titre": "Great Service",
          "Contenu": "The rep that helped me on 11/30/2023 did an amazing job at informing me of my order status. I spoke with two other reps and neither seemed to care how urgent the matter is of me picking up my computer. I believe the reps name was Patrick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shanna T",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:07:13.000Z",
          "Titre": "Superb Online Customer Service …",
          "Contenu": "You're online customer service was very knowledgeable and professional. The representative answered our questions and based on our conversation was able to help suggest some merchandise that would be to our liking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Harrison",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:23:19.000Z",
          "Titre": "Customer service",
          "Contenu": "I was having issues with identifying myself and Angie Smith quick to help me resolve my issue in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:28:07.000Z",
          "Titre": "Frank was quick and efficient in…",
          "Contenu": "Frank was quick and efficient in getting my order placed after I had an issue getting it placed online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T21:46:35.000Z",
          "Titre": "I was happy to receive such a quick…",
          "Contenu": "I was happy to receive such a quick approval and purchased an Apple laptop however, I was not 100% satisfied with the condition though I understand it it is pre-owned. Frank in your customer service department was very gracious and took the time to explain the return process to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John S",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T01:55:20.000Z",
          "Titre": "Very Easy",
          "Contenu": "Paid my first payment then I got an email that said items were ready the same day I ordered. I went to BestBuy and they grabbed my bag, checked my ID and said have a great day sir. Very easy. Then today I got a courtesy call from Walter who was very helpful and let me know that my other items would be ready in a couple days. Walter is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kcarroll",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:42:57.000Z",
          "Titre": "Everything was wonderful",
          "Contenu": "Everything was wonderful. I have nothing to complain about"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:07:11.000Z",
          "Titre": "Thank you so much for resolving my…",
          "Contenu": "Thank you so much for resolving my concern, especially Angie Smith, she was so patient and kind, she answered all my questions. Thank you so much Angie for your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bishop Patrice  Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:44:30.000Z",
          "Titre": "The Young lady got right on it a…",
          "Contenu": "The Young lady got right on it a Christmas present to my self happy had no tv the other one was broken she kept her word got right on it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID D",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:35:18.000Z",
          "Titre": "Awesome service just got my ps5 today I…",
          "Contenu": "Awesome service just got my ps5 today I would recommend thanks to Angie and Patrick for there help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaleb Locke",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T22:40:18.000Z",
          "Titre": "Frank wright was excellent he went…",
          "Contenu": "Frank wright was excellent he went beyond his duties to ensure I had piece of mind regarding my order. I cannot recommend frank and buy on trust enough."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Kayy Zee",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T17:46:41.000Z",
          "Titre": "had an amazing experience with this…",
          "Contenu": "had an amazing experience with this company. The customer service was outstanding, and the product was exactly what I was looking for.” “I was so pleased with the service I received from this business. They went above and beyond to help me find the perfect item.”"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:51:33.000Z",
          "Titre": "Great customer service.",
          "Contenu": "I liked that Angie called me back to make sure my order was processed correctly. She was nice and I appreciate her patience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Harris",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T03:16:52.000Z",
          "Titre": "Angie Smith went above and beyond in…",
          "Contenu": "Angie Smith went above and beyond in helping me see why my order wasn’t processed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T23:28:57.000Z",
          "Titre": "Maria from customer service not only…",
          "Contenu": "Maria from customer service not only did she answer my questions,  she answered questions I didn’t know I had.  Will definitely use this service in the future and recommend to others.  Thanks for making it possible to purchase a laptop for my child who started college this year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:02:26.000Z",
          "Titre": "Harlem was awesome with assisting me…",
          "Contenu": "Harlem was awesome with assisting me today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iyona",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:32:57.000Z",
          "Titre": "The customer service is well worth it I…",
          "Contenu": "The customer service is well worth it I had assistance from Talia and she reassured me about my purchase I am thankful and will continue my services"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Syed Ali",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T22:08:00.000Z",
          "Titre": "Very good",
          "Contenu": "Was kinda sketched out by the website at first, but everything went smoothly. While you pay a premium to use their service, the friendly customer service and flexible payment options are worthwhile if you need them. I'd like to give a shout out to Lauren, as she helped me within a matter of minutes of requesting support, OUTSIDE of their posted business hours! She promptly resolved my concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belinda B",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T17:00:41.000Z",
          "Titre": "Legit! Great customer service!",
          "Contenu": "I am pleased. I was able to get a return email, reach a human to confirm details, and see all agreement documents before I actually made the final purchase. Great experience! Rate is insanely high, but I didn't get paid until Friday and I wanted the computer for my daughters first day of school. (Crazy things we do for our kids!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael florio",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T22:59:46.000Z",
          "Titre": "Not a scam, helpful customer service",
          "Contenu": "Was kinda sketched out by the website at first, but everything went smoothly. While you pay a premium to use their service, the friendly customer service and flexible payment options are worthwhile if you need them. I'd like to give a shout out to Lauren, as she helped me within a matter of minutes of requesting support, OUTSIDE of their posted business hours! She promptly resolved my concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T01:25:37.000Z",
          "Titre": "My experience was good because the",
          "Contenu": "My experience was good because the gentleman stayed with me on the phone the whole time. Wow ran into issues but we got it all figured out and done gave him 10 stars. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Demone",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T15:06:32.000Z",
          "Titre": "I was skeptical at first....",
          "Contenu": "I was skeptical at first due to a lot of new day scams, but they were on point and legit!! Process was kind of long, but I see why, too many people doing these kind of things and not paying what they owe. Thank you ButOnTrust."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T23:38:33.000Z",
          "Titre": "Agent took the time to listen and dive…",
          "Contenu": "Agent took the time to listen and dive further into my issue rather than just handing me over to other companies as per previous agents. Assisted me to the best of his knowledge allowing me to complete the process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:46:40.000Z",
          "Titre": "Spoke with Angie Smith and she was very…",
          "Contenu": "Spoke with Angie Smith and she was very friendly and helpful getting me to the right department. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:30:01.000Z",
          "Titre": "Well the customer service was 150…",
          "Contenu": "Well the customer service was 150 percent above a d beyond. My order was canceled and the got it returned in 48 hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelby H",
          "Nb_Reviews": 3,
          "Date": "2023-09-15T02:21:45.000Z",
          "Titre": "Great customer service and exceptional…",
          "Contenu": "Great customer service and exceptional management. Patrick was very responsive and knowledgeable and could not have been more helpful! Great experience over all! Thank you Patrick and thank you Buy on Trust!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:26:06.000Z",
          "Titre": "Angie Smith was amazing she helped me…",
          "Contenu": "Angie Smith was amazing she helped me thru the hole process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donnie P",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T15:57:03.000Z",
          "Titre": "Patrick in Customer Service Was…",
          "Contenu": "Patrick in Customer Service Was Amazing.  Walked us thru the very complicated process.  Your Application Has A Lot To Be Desired.  Has You Enter Your Same Info About 5 Times. Very Unnecessary . The Site Kept Throwing Us Off. Had to go back to our e-mail several times and start the process over.   However we made it thru with the patience and help of Mr Patrick.  He was a great help. Appreciate Him Very Much. I hope he can see this. If he can we want to say Thank You Very Much Patrick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SB",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T19:32:08.000Z",
          "Titre": "Excellent Communcation not Often Found in Today's Day and Age",
          "Contenu": "I have thus far been nothing but impressed with my experience I have had with BuyOnTrust. I made my order on an evening last week and immediately received a phone call directly from Dave at BuyOnTrust the following day giving me an update on my order. When I called back today, I had the pleasure of speaking with Dave again and he once again knocked it out of the park answering all my questions in a clear, friendly and concise way. I look forward to receiving my product and doing business again with BuyOnTrust!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T23:32:28.000Z",
          "Titre": "Representative very patience and…",
          "Contenu": "Representative very patience and friendly professional and was able to help me navigate through the process from start to finish. Patrick is very customer Oriented and friendly. Thanks Patrick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loretta Stotler",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T14:53:51.000Z",
          "Titre": "Dave",
          "Contenu": "Dave, the man I spoke with not only helped me with exchanging the laptop I purchased, but he helped me find the better laptop for my needs. Customer Service workers have always been rude and unfriendly in my experience and this man turned my horrible situation concerning this process into a pleasant result! Way to go Dave and thank you for all your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Viadana Carrillo",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T17:50:25.000Z",
          "Titre": "Patrick!",
          "Contenu": "Patrick! Was amazing, very knowledgeable and was able to walk me through completing my order. He stayed on the phone with me throughout the call to ensure  that I had no questions and was able to get through the order with no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Butler",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:06:53.000Z",
          "Titre": "Best costumer service in a long time.  Sorry I forgot his name.  David?  I cannot remember",
          "Contenu": "All of my questions were answered quickly without a bunch of extra talk like \"oh, I'm so sorry your having this problem\".  Just straight forward and very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T08:17:25.000Z",
          "Titre": "Very great experience order next day my…",
          "Contenu": "Very great experience order next day my order ready 😊fast order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Phelps",
          "Nb_Reviews": 2,
          "Date": "2022-09-05T04:34:25.000Z",
          "Titre": "Repeat Buyer!",
          "Contenu": "This is the second time I have used the Buy On Trust program, your application process is super easy, and your partnership with Acima makes the purchasing process super easy as well! Well definitely use it again! Kelly was also very cheerful on the follow up call last night! She definitely made me feel appreciated as a customer!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Niels Larsson",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T14:08:28.000Z",
          "Titre": "Favorite service",
          "Contenu": "Here you can find everything you want either for your baby, or maybe for yourself. I always surf the internet in search of such platforms and companies, where I could order everything I wanted. Idk, maybe I have shopaholism, because I started to notice that I too often want to buy something. Anyway, this service is my favorite one as there are dozens of goods for all kinds of activity and just for yourself. When I first met it I thought that it's just an ordinary company and store like costco maybe, but these days I can't spend a day without searching for something interesting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T20:36:26.000Z",
          "Titre": "Ordering Process",
          "Contenu": "Thank you for making this as smooth as possible. From credit verification to Archie's follow-up phone call - my experience went off without a hitch.Here's to hoping my pickup experiences with Best Buy are just as fabulous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Unlock Pro Services",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T19:29:35.000Z",
          "Titre": "I would recommend Buy On Trust to…",
          "Contenu": "I would recommend Buy On Trust to family/friends because they are easy to work with. Communication is solid whether you call or email, they do respond in a timely manner. All information you receive about your purchase is written to you before hand so you know what to expect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent T",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:51:24.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Todd was above and beyond helpful and answered all my questions and put my mind at ease about an order. I will be recommending Buy on trust to my friends solely from this positive experience! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:31:55.000Z",
          "Titre": "Angie Smith was awesome and very…",
          "Contenu": "Angie Smith was awesome and very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Salmontee Fashion LLC",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T09:14:03.000Z",
          "Titre": "With cotton clothes",
          "Contenu": "With cotton clothes, try by grabbing a piece of fabric in your hand for a few seconds and releasing it. You observe, if the fabric looks like a crumpled piece of paper, it means that the manufacturer has treated the fabric with a special chemical to keep the product's shape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SEAN PENSO",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T19:01:43.000Z",
          "Titre": "The staff was very helpful",
          "Contenu": "The staff was very knowledgeable and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T16:59:06.000Z",
          "Titre": "I was so excited to get my loan but I…",
          "Contenu": "I was so excited to get my loan but I could not figure out how to do it because I am not computer savvy and their customer service is phenomenal so good that I'm writing a review and this is the first review I've ever written in my life but because the customer service I received from Katie she was able to guide me to a loan that was even better than what I was expecting. Extremely knowledgeable patient friendly and because of Katie I was able to get approved and get get everything I needed before my deadline. Thank you so much bye on trust and I hope all of your team members are just like Katie and I'm not even exaggerating on the level of professional courtesy and never once made me feel like I was bothering her with the million questions I asked. Me and my wife thank you Katie and of course we think bye on trust for approving me for my loan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edson",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T19:20:23.000Z",
          "Titre": "Had a few questions about a drone I…",
          "Contenu": "Had a few questions about a drone I ordered, and John answered every question I had! John also educated me on a few features on the drone and other things that will be beneficial to me in the future! Thank You John! Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shropshire",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T11:03:58.000Z",
          "Titre": "I have been using the Buy On Trust…",
          "Contenu": "I have been using the Buy On Trust program for a long time, the application process is very easy and your partnership with Acima makes the buying process very easy. I feel valued as a customer. Trust me, you won't regret it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sione Maumau",
          "Nb_Reviews": 2,
          "Date": "2022-04-16T22:14:53.000Z",
          "Titre": "Amazing Program!!!!!",
          "Contenu": "Thank you so much. This whole process has been bloody awesome, from the beginning till picking up from Best Buy…. Will strive to introduce your program to my family n friends… Once again, a Huge Mahalo’s (Thank You) from my family n I…."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T19:27:24.000Z",
          "Titre": "Customer service rep Tanner was great",
          "Contenu": "Tanner was extremely polite and explained everything I needed to know it hard to find customer service with such a great attitude. I was totally satisfied with my experience today and hope my next call is with tanner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edwin",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T03:00:19.000Z",
          "Titre": "Great Experience",
          "Contenu": "I made an error on my first order and Patrick helped me fix it and place a new one and within an hour I was all set!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T22:01:52.000Z",
          "Titre": "The process was quick and easy",
          "Contenu": "The process was quick and easy. I was literally able to order and pick it up same day !! I will definitely be ordering from them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T18:51:09.000Z",
          "Titre": "Customer service is quick to respond",
          "Contenu": "Customer service is quick to respond. Everything went smoothly and I was able to pick up my device with no issues. Ashley reached out after and made sure everything was good to go on my end and even gave a couple tips too, awesome service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcella Foligno",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T19:21:58.000Z",
          "Titre": "I was able to get a decent e-bike that…",
          "Contenu": "I was able to get a decent e-bike that I wouldn’t otherwise been able to get. I am so grateful for it as I’ve been without a vehicle and stuck in the house since it was repoed during my cancer treatment. Thank you, Buy On Trust for trusting me! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Neal",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:28:51.000Z",
          "Titre": "Great Service",
          "Contenu": "The customer service was great. They was so patient with me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T21:55:19.000Z",
          "Titre": "Dave is amazing person and understood…",
          "Contenu": "Dave is amazing person and understood my disability why I used relay service and gave the two numbers to note on my account to make sure they are all aware of…. Amazing good customer service and good details of everything and information to share with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:01:05.000Z",
          "Titre": "The great Maria",
          "Contenu": "My agent Maria was on the money got me in and out without a problem and for the price a steal. Great customer service all around."
        },
        {
          "Note": 5,
          "Lieu": "TN",
          "Pseudo": "Roua Hm",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T19:58:36.000Z",
          "Titre": "It was super easy good company to go…",
          "Contenu": "It was super easy good company to go through Jarai was super nice checked and made sure I got my item and all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyra K.",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T23:43:00.000Z",
          "Titre": "John was great and I appreciate the…",
          "Contenu": "John was great and I appreciate the update on my order. He basically let me know my item was out of stock with best buy and things will be updated soon. Thank you John!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Thomas",
          "Nb_Reviews": 3,
          "Date": "2023-10-04T23:26:21.000Z",
          "Titre": "It was super easy good company to go…",
          "Contenu": "It was super easy good company to go through Jarai was super nice checked and made sure I got my item and all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T20:06:58.000Z",
          "Titre": "Awesome Lease To Own Shopping and Checkout Experience",
          "Contenu": "Very easy-to-use lease-to-own service. You back your shop online or even in-store and add to your cart the items you would like to purchase using BuyOnTrust credit. Once you do this you agree to the terms of your lease and checkout. Bam! You are done. Love the customer service as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LATASHA HICKMAN",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T19:26:34.000Z",
          "Titre": "I was goin bk and forth with both…",
          "Contenu": "I was goin bk and forth with both company and in one phone call from Jarai he was able to get one of my items straight out...he really came through to help me out for Christmas and my sons birthday...but I hope he can see this review because I received and email with the same thing happening to my second item..plzzz contact me if you do thank you for all ur help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T01:39:43.000Z",
          "Titre": "I always wanted a new Mac computer but…",
          "Contenu": "I always wanted a new Mac computer but could never save up enough money to purchase on seeing that I have a wife and 5 kids. I took a chance with buy on trust thinking it was a scam. boy was I shocked when I got a text message saying I could pick up my Mac computer thanks buyontrust.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Smith",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T15:19:07.000Z",
          "Titre": "Had an issue with Best Buy where they…",
          "Contenu": "Had an issue with Best Buy where they couldn't find our order.  Called customer service and was able to get the order processed and go home with our appliance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karon Lockhart",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T23:12:08.000Z",
          "Titre": "David help me throughout the whole way…",
          "Contenu": "David help me throughout the whole way and the whole process. I really appreciate him. He did amazing job I gave him 100 out of 100  if I could."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "m m",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T16:24:56.000Z",
          "Titre": "Simple, Fast and Great Service!",
          "Contenu": "Simple, fast and really easy to use!  I placed my order, John from customer service gave me a call and explained everything in clear, great fashion. Will definitely use this again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T00:02:07.000Z",
          "Titre": "Dave was wonderful",
          "Contenu": "Dave was wonderful, he took his time and explained everything to me. Help me calm down because he had everything under control. Thanks alot Dave you the GOAT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tennille",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T18:07:06.000Z",
          "Titre": "This was the best customer service I’ve…",
          "Contenu": "This was the best customer service I’ve ever had. Archi was extremely helpful, he was very sweet and he helped me get what I needed done. Definitely recommending to my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candace E",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:00:21.000Z",
          "Titre": "Patrick made sure my order was taken…",
          "Contenu": "Patrick made sure my order was taken care of after a horrible error yesterday"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kontior",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T17:14:25.000Z",
          "Titre": "Great service",
          "Contenu": "Great service!  Kept me informed and product arrived early!  Got to BestBuy and was confused.  Called up BOT and they helped me spoke with the BestBuy representative on site to get my product!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Freddie",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T00:47:48.000Z",
          "Titre": "Taylor was the best ....",
          "Contenu": "Taylor was the best she was able to help me find the Best Buy receipt and I was able to send that to Dell in order to make a claim on my warranty for a gaming monitor I purchased 2 years ago. Taylor ROCKS!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michelle Boyle",
          "Nb_Reviews": 4,
          "Date": "2022-08-05T00:19:23.000Z",
          "Titre": "They always come on the day they text you before they come which is a big help when I am deaf in my right ear stone deaf so Ii want everything to be easier for me to get up and about now with stuff",
          "Contenu": "They always come on time especially with the text or phone call before my delivery is here and then I'm at the door waiting for my appliances I need I've not ever had any delays thank you so much ❤️"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Evelyn Klein",
          "Nb_Reviews": 5,
          "Date": "2022-05-04T07:35:19.000Z",
          "Titre": "Great firm to do business with!",
          "Contenu": "All of the information you will receive regarding your purchase will be written to you in advance so that you are aware of what to expect. I appreciated how easy it was to apply for and how it didn't affect my credit score."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taura",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T21:57:42.000Z",
          "Titre": "During my last call to Buyontrust…",
          "Contenu": "During my last call to Buyontrust customer service, the agent was friendly, knowledgeable of my situation very helpful in resolving my reason for the call. Great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 8,
          "Date": "2023-05-02T16:36:29.000Z",
          "Titre": "Easy appy",
          "Contenu": "This was a very easy experience  decision right away approved for a small amount but have to start somewhere"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T18:24:52.000Z",
          "Titre": "The person I was speaking too best…",
          "Contenu": "The person I was speaking too best customer service ever made me feel like this is a great company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T23:32:39.000Z",
          "Titre": "Archies the man",
          "Contenu": "it was all thanks to one or your associates a mister Archie was his name and he was absolutelyamazing was so professional knowledgeable, and had an amazing personality and he is the sole reason for the 5 stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T21:16:08.000Z",
          "Titre": "Luke was awesome",
          "Contenu": "Luke was awesome! He helped me with verifying my ID and was super cool to talk to. We need more people like Luke in customer service! If I could give him 10 stars I would!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Danley",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:46:30.000Z",
          "Titre": "Exceptional",
          "Contenu": "Excellent, fast, great customer service, no hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Sandy stilwell",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T23:49:06.000Z",
          "Titre": "Thank you you’re wonderful talia"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaitlyn customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:04:14.000Z",
          "Titre": "Five stars",
          "Contenu": "Patrick was fantastic! I’d been given the run around all day, but he answered every question!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Stephens",
          "Nb_Reviews": 3,
          "Date": "2022-06-08T20:36:34.000Z",
          "Titre": "I was really pleased with the…",
          "Contenu": "I was really pleased with the straightforward application and prompt response, as well as the extremely simple method for picking up the item I ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:36:13.000Z",
          "Titre": "Angie smith was so polite and very…",
          "Contenu": "Angie smith was so polite and very patient with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T01:37:39.000Z",
          "Titre": "Took care of every question that I had…",
          "Contenu": "Took care of every question that I had very professional and a way I understood"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Ikner",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:37:56.000Z",
          "Titre": "Patrick did great at answering…",
          "Contenu": "Patrick did great at answering questions and updating me with information I could not find"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T20:34:23.000Z",
          "Titre": "Dave was awesome in following up to…",
          "Contenu": "Dave was awesome in following up to make sure my order was updated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharmon bond",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T22:50:07.000Z",
          "Titre": "April and Taylor were amazing customer…",
          "Contenu": "April and Taylor were amazing customer service reps thank you guys so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MATTHEW J",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T05:04:52.000Z",
          "Titre": "Very happy",
          "Contenu": "I for got the guys name who called. Not a very common name. But it staered with an A. Any way. Very professional. Made me feel like I was talking to family. As a Manger of a shop. This means more to me then you know. At first I struggled with prices. Then realized we have early pay options. This guy just wanted to make sure I was happy and ready for the possible deals to come. Great company to deal with. Regardless of the prices from short to long term payments. Amazing people to deal with. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Demond",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T17:41:10.000Z",
          "Titre": "it was a easy simple process thank you…",
          "Contenu": "it was a easy simple process thank you guys for all the support !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerDoris Ragston",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T22:45:30.000Z",
          "Titre": "I was concern about my package and the…",
          "Contenu": "I was concern about my package and the lady that helped me was so professional and polite I give her a 10 if that can be done. Hats off to her. I don't know her name but Hats Off again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T23:07:26.000Z",
          "Titre": "It was great experience Madisson and…",
          "Contenu": "It was great experience Madisson and Dave helped me to place the order and finished the process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T23:51:24.000Z",
          "Titre": "Kelly did a great job explaining how…",
          "Contenu": "Kelly did a great job explaining how everything works. It was a joyful delight talking to her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taron Mathews",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:47:51.000Z",
          "Titre": "You guys gave a lot of help with…",
          "Contenu": "You guys gave a lot of help with everything I needed to make the process go great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaylan Harris",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T18:35:30.000Z",
          "Titre": "Great buying experience and my guy Eric…",
          "Contenu": "Great buying experience and my guy Eric was amazing helping me with the process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:56:49.000Z",
          "Titre": "Ten stars very polite very experienced"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralon",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:38:34.000Z",
          "Titre": "Maria was very helpful",
          "Contenu": "Maria was very helpful, polite and knowledgeable to my question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T00:26:47.000Z",
          "Titre": "All items came in a timely manner and…",
          "Contenu": "All items came in a timely manner and were as advertised. Excellent customer service. I will definitely be a return customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holland Padilla",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T23:56:43.000Z",
          "Titre": "Very friendly and willingness to help",
          "Contenu": "Very friendly and willingness to help! The 2 foundations of great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Burke, Terri Burke",
          "Nb_Reviews": 7,
          "Date": "2022-07-03T22:36:15.000Z",
          "Titre": "We had tremendous service from Kelly",
          "Contenu": "We had tremendous service from Kelly!  She was welcoming , informative and solved our issue.  Great service !"
        }
      ]
    }
  ]
}