{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "casetify.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henry Pratt",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:45:25.000Z",
          "Titre": "Customer service non-existent",
          "Contenu": "Ordered wrong version of case.  Tried to return using online form.  Twice.  Still no response 5 weeks later.For what these cost, customer service should be  immediate!  Not buying another: ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samantha Kurtz",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T06:12:20.000Z",
          "Titre": "No updates after two months of placing order",
          "Contenu": "Ordered a case on October 15th. Two months later and ZERO updates. Reached out to customer service and no responses. Such a joke I used to recommend Casetify to everyone and now I just want my money back. Already bought a new case elsewhere, but sadly don’t think i’ll ever get my case or my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:36:41.000Z",
          "Titre": "Customer service is horrible",
          "Contenu": "Their customer service is horrible. I reached out on two occasions after my order was past the time frame given for arrival. They didn't respond either time. I finally received my product but never got a response from customer service."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Kwok Hob",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:04:42.000Z",
          "Titre": "I only ordered a transparent case…",
          "Contenu": "I only ordered a transparent case without any custom made is required. However, your company website mentioned that it is still in production after I purchased it in two days ago.I am regret to buy it online but not in shop as I may take it immediately if i buy it in shop."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "DamianC",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:09:33.000Z",
          "Titre": "FRUSTRATION, DISAPPOINTMENT, FOREVER BAN!",
          "Contenu": "Placed my order for this limited edition Mastermind Japan bottle, watchband, and casing on 24th Oct. Nov 8th received my first email, being notified cancellation of my bottle due to an unforeseen inventory error. As a collector myself, it is disheartening to know, since I made my purchase on the same day it launched! Nov 23rd they stated in my email to upgrade express shipping for me, and the other items are on the final quality check, will urge them to ship them ASAP. BUT! On Dec 21st I received an email notifying me, MY WATCHBAND IS OUT OF STOCK!! THIS IS UNACCEPTABLE!!!!! 2 items in the same order, INVENTORY ERROR AGAIN?!?!?! Please, do something! Are you keeping it for your mate to do a resell on your backdoor? Why are all the limited edition items having inventory error. Sorry, but I will never buy from you again, terrible inventory management and shopping experiences."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie D",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T04:19:00.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "I made an order and waited for more than 40 days for fulfillment. Attempted to contact the company 3 times with no response what so ever. Currently status says shipped but USPS is still waiting to receive the package."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:57:09.000Z",
          "Titre": "PEELING AFTER 2 WEEKS!!!!!!!!",
          "Contenu": "I’ve had my case just over 2 weeks and noticed the design has started to peel off. I contacted them thinking my product was faulty seeking a replacement or refund and they told me that it’s general wear and tear and wouldn’t cover it. What an absolute joke. I’ve had cheaper cases last longer. It probably started chipping within their 10 day policy but I never noticed it as it’s not like I’m looking at the back of my phone. Save your money and go elsewhere. I expected a lot more for a case I paid over $100. How they are still in business I don’t know because this is highway robbery."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Unhappy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:07:36.000Z",
          "Titre": "Products are poor quality",
          "Contenu": "Products are poor quality.  Side separated from the back - clearly a design or manufacturing flaw as i've almost never taken the case off.  Casetify refused to replace their faulty product because it was outside the 6 month replacement window.  Buyer beware - Casetify only stands by its products for 6 months.@casetify I went into the physical store and they took a photo of the case. Yasmine from customer service responded to my store visit and follow up email by twice referencing a 6 month limit for replacing the case and suggesting I buy a new one with a 15% discount. Order number is 12900712."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert  Heffley",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T05:53:53.000Z",
          "Titre": "Difficult customization",
          "Contenu": "Two customize a photo, for your phone is not the best application. Hard to adjust. And fix the photo exactly how you want it. Never got my ten percent off for signing up. I want to order two more cases but don't know based off this experience. 😕 Are there any discounts for birthdays. First time buyer hope i'm happy in the end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ana Maria  Castro Rodríguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:56:21.000Z",
          "Titre": "I’ve have not been provided with any…",
          "Contenu": "I’ve have not been provided with any confirmation email or tracking number for my order since the moment I’ve purchased it seems this website is all  over the place. Very frustrating"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colleen  Hemmings",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:23:58.000Z",
          "Titre": "I have had to re-purchase the same…",
          "Contenu": "I have had to re-purchase the same phone case because I was shipped the wrong size and never received the replacement. So I have had to double pay. I would never have done this it the case is what my daughter wanted to Christmas. Horrible customer service.I did reply to your associate and provided the requested information and never received the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael McNutt",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:00:24.000Z",
          "Titre": "Poor Shipping",
          "Contenu": "I ordered a phone case on the 18th of December. Despite having free shipping I paid an additional $15 to make sure it gets here before Christmas. It said it would arrive between 20th and 22nd. Now I get an e-mail from DHL saying it's in transit and is expected on the 27th! That is not acceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gt",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:35:06.000Z",
          "Titre": "I placed my order on November 4",
          "Contenu": "I placed my order on November 4, 2023 but until now December 21, 2023 did not received it. I have been contacting them several times but did not hear from them.  My order is worth $200."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jane Rodgers",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T17:30:23.000Z",
          "Titre": "Great to set of with now l am unable to…",
          "Contenu": "Great to set of with now l am unable to place an order since l became a member payment all correct but will not go through.saying error on checkout Not really happy with this ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LS",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:03:12.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "The company did not tell me that the phone case I had ordered was out of stock/discontinued until I pestered them for weeks, looking for a status update.  Then they told me I could choose a refund or a new case, and the VERY NEXT DAY sent an email informing me that because I had not promptly responded, they were cancelling the order.  This, after I left repeated messages asking for an update (the website said my case was \"in production\" for nearly a month) without any response.  The service rep acted as if I had done something wrong and made no attempt to make me feel better about the interaction.  The design was cute, but it is easier and faster to get a comparable case elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Eileen",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T08:48:14.000Z",
          "Titre": "If ordering from Casetify beware that…",
          "Contenu": "If ordering from Casetify beware that there will be at least 3 weeks from ordering till you get your goods. Orders come from overseas.I have my order - not sure why the ‘generic’ response stated it would be delivered next week? If you can purchase any Casetify good directly from the Casetify store in Sydney’s CBD and I’m sure other locations - wait time is greatly shortened and you can get your goods within a few hours rather than extended periods."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Ms Yu",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:49:42.000Z",
          "Titre": "Disappoint in castify cs, product & technical",
          "Contenu": "My airpod case printing is offset so i applied for exchange, 3 weeks later i dont  hv any update so i went to the shop and ask for assistance. Later on (ard 7 days) i finally hv email fr support team but is not very helpful when i ask to test on a airpod before delivery to me. I suppose professional case maker must hv a airpod prototype fir testing, but this is not the case in castify, disappointed in quality , cs servicing, technical control!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Dunn",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:44:12.000Z",
          "Titre": "I paid for expedited shipment",
          "Contenu": "I paid for expedited shipment, which stated delivery between 12/22-12/24, but just received a note that delivery will not be until 12/27.  I would not have ordered if i couldn't have by 12/25."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Derius",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:37:10.000Z",
          "Titre": "Don’t promote discounts for stuff that…",
          "Contenu": "Don’t promote discounts for stuff that you can’t use it on. They are promoting empty discounts that they know people aren’t can’t to use because they’re buying the Collabs stuff."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Samuel George",
          "Nb_Reviews": 10,
          "Date": "2023-12-20T12:49:21.000Z",
          "Titre": "I requested a return and refund",
          "Contenu": "I requested a return and refund, Casetify, gave me an address to return the item, I did so.A year alter they are claiming they never received the return and are refusing to refund so now im out of the product and the money. Scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:33:15.000Z",
          "Titre": "I have a missing piece to my order for…",
          "Contenu": "I have a missing piece to my order for over a month now and since there’s no actual real person to talk to, I’m going circles with messanger chat and emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenny",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:30:26.000Z",
          "Titre": "Easily cracked screen protector",
          "Contenu": "I bought the anti-blue light screen protector for my iPhone 15 pro max, and I just dropped the phone from under 3 feet from my waist area. It cracked at the bottom of the screen. I was so disappointed for the crazy amount that Casetify charges for a single screen protector. What a major rip off, and they don’t even honor their warranty. No one has responded to my claim. What a huge disappointment for this company."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Henry  Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:51:37.000Z",
          "Titre": "I order a \"CASETiFY Snappy Ring Holder…",
          "Contenu": "I order a \"CASETiFY Snappy Ring Holder Snappy Ring Holder MagSafe Compatible - Spinning Wheel Of Death Snappy Ring Holder \" , I never use this product because it already broken when I got it, I want to find the cusomter services , but only find a report area on web! OK, I drop a message and attached the photo of the broken product, no any reply in few weeks, report  again and again! And I find a 50% refund in my cards! I have no idea what going on , I want to have a \"CASETiFY Snappy Ring Holder Snappy Ring Holder MagSafe Compatible - Spinning Wheel Of Death Snappy Ring Holder \" not the refund!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sadika",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T01:30:43.000Z",
          "Titre": "A heart breaking experience",
          "Contenu": "I like Casetify and I recommend to people all the time but this time it is a horrendous experience. Not the product, cuz I didn’t get it still, it’s on hold. But the customer service. I’ve been contacting them on multiple platforms and multiple times for several days to adjust my order. And I still haven’t gotten a response. The only response was one time and it was to tell me that they put my order on hold. And it’s been dead silent since then. On instagram they literally left me on read."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Gina Toh",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:39:37.000Z",
          "Titre": "Late or never?",
          "Contenu": "I know it can be tricky ordering during Christmas period, but more than 5 weeks is way too long + I've opt for DHL delivery. I received a notification that items been shipped on the 20th nov, DHL advised no item have been picked up yet. And now of course no one is responding to my email. Is this system auto generating updates, I don't know. But likely that's the reason they will provide me if they do reply.Refer to your reply below, 14 dec last corresponding date is not trying to get in touch. No email so far."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darla Arie",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:40:34.000Z",
          "Titre": "I paid $15 for shipping ( 7 business…",
          "Contenu": "I paid $15 for shipping ( 7 business days ago) to have this product WAY before Christmas (3-5 business days) , now telling me (7 days before Christmas), will be delivered AFTER Christmas!! I hope your product is worth the disappointment of NOT arriving on time!  Will not be ordering these expensive covers again."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jal Milne",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:50:02.000Z",
          "Titre": "too many pop ups and bad menus",
          "Contenu": "your website is frustrating and has too many pop ups. the payment page wouldnet accept my amex - and forced me to use teh same card through paypal.  if this wasn't a specific gift - i wouldnt have ordered from you."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Matt",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T00:37:00.000Z",
          "Titre": "Took one month to ship the order and…",
          "Contenu": "Took one month to ship the order and colour scraped off Apple Watch case within hours of wearing it. Terrible shipping times and questionable quality - they used to be great, this is the last time we'll be shopping there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Winders",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:00:22.000Z",
          "Titre": "Beyond disappointed",
          "Contenu": "One item went out of stock so they cancelled my entire order.  I had to re-order, but without the discount that was used on the original order.  Was to be Christmas gifts for the family.  Ordered replacement and paid extra for expedited shipping to arrive on time and tracking shows Dec 28 delivery.  Beyond disappointed.  Sent several emails to support received the \"We sincerely apologize for the inconvenience caused by an error in our inventory. Regrettably, our system automatically canceled your order ##### and initiated a refund as a result of the inventory error. Typically, the funds will be returned to the original bank or card account that you used for payment within 3-7 business days. No offers to help make it right, not even matching the discount from when I placed the original order. Nothing... I sent follow up emails asking for more information and never received a response outside of the seemingly automated order canceled sorry for your luck email."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Parker",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T23:32:08.000Z",
          "Titre": "Not arrived, rubbish support - avoid this company",
          "Contenu": "So far… 3 weeks stuck in pending production - estimated delivery date was 2nd-14th December. Attempted to get support who didn’t really provide any update other than… wait until 14th December.Edit; the fact there is no record of my order or support is even more concerning. Looked like an attempt to get my review taken down. Still no update! Awful. Please avoid.Order number : 18678539"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:44:59.000Z",
          "Titre": "Worst shopping experience ever",
          "Contenu": "I asked for a price match or to cancel my order before it was shipped. My request was rejected by customer service, and I was told to refuse the package delivery from USPS. I did exactly as customer service told me under my complex's camera, but the package got lost. I had to initiate a claim with USPS as the customer service told me, but USPS claimed that the package was lost. It has been almost two months. I wasted a lot of time on this, yet I have not gotten my refund. This is the worst shopping experience I have ever had."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "혜수 주",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:38:53.000Z",
          "Titre": "E-mail feedback is too slow",
          "Contenu": "E-mail feedback is too slow. and It doesn't tell you the exact delivery schedule. The consumer just keeps waiting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Miles",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:13:52.000Z",
          "Titre": "Beautiful case. But mine lasted only a year!",
          "Contenu": "See in your records I bought this same exact case from you about a year ago. And, now it is falling apart. The bumper is coming off all around it. I should not have to pay for such an expensive case twice in a year. A case from the dollar store would have held up better. You should be ashamed of yourselves charging this kind of price for such a poorly constructed product, and only giving a 6 month warranty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alison Kwok",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:18:26.000Z",
          "Titre": "CS not helpful!",
          "Contenu": "Phone case and strip returned for refund and I made a new order as replacement.  CS is not really helpful, and I am not satisfy with the refund process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mari",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:04:32.000Z",
          "Titre": "This is a fraud charge & I have not…",
          "Contenu": "This is a fraud charge & I have not been unsuccessful in contacting you. PTMotMotBaa CHAuTRaAN Stole my card and charged without my knowledge or permission! B"
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "현노 윤",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:33:43.000Z",
          "Titre": "The delivery is too late",
          "Contenu": "The delivery is too late. I only received the item more than a month after I paid.Customer center response is also slow. Product delivery status updates are also sloppy."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jenn Williams",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T20:57:53.000Z",
          "Titre": "Avoid poor quality cases",
          "Contenu": "Ordered a cute cat case for my Samsung Fold 5 and I was super happy until the case snapped after four days of me owning itI spent £54 on this case and I've emailed them quite a few times and all they will offer me is a replacement or store creditI don't want a replacement since the quality is clearly poor and I don't need store credit as I won't ever shop with them againSeems they've taken my money and they don't want to give it back even when I sent clear proof the case snapped and it wasn't due to poor use or dropping itEditOrder number is18679469"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori Turberville",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:05:05.000Z",
          "Titre": "I tried to reach someone after my order…",
          "Contenu": "I tried to reach someone after my order to make a correction and never got a response. I will not recommend to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam Agdipa",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:42:51.000Z",
          "Titre": "Basically got scammed",
          "Contenu": "I bought the case for my Apple Watch that included a screen protector in the item description. When I received it the screen protector wasn’t in the package. I reached out to customer service. I gave them pictures like they asked and all they did was blame the shipping company. They told me the weight of the package reflected that the screen protector was inside. Complete nonsense from customer service! How about verify if the screen protector was inside the package then send it out? Casetify doesn’t take accountability and is a complete red flag for a company. Do yourself a favor and choose someplace else."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Stephanie lau",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:02:16.000Z",
          "Titre": "The delivery date is far from expected…",
          "Contenu": "The delivery date is far from expected , a week after the estimated period . The product was wrong , no detail of refund process , no return form in the parcel"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dyshaun Heslop",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T09:15:00.000Z",
          "Titre": "Promo codes DO NOT WORK",
          "Contenu": "I used my favorite YouTubers elanor neale casetify code, but hers didn’t work, I tried using different promo codes from different YouTubers, and none of them worked on the case I wanted. They even sent me a email saying 10% off your first order and that didn’t even work. Had to use Klarna to pay for my items because i didn’t have enough."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "ceci",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:53:46.000Z",
          "Titre": "I waited for too long and no one…",
          "Contenu": "I waited for too long and no one handled it. When someone handled it, they told me that I had passed the return time, which made me feel very bad! And it’s been almost a month now and they still haven’t let me exchange the product!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janice Zinno",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:57:19.000Z",
          "Titre": "I placed order last week that hasn’t…",
          "Contenu": "I placed order last week that hasn’t arrived. Says still processing. Unhappy if doesn’t get her for my granddaughter."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Carmen Yip",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:23:17.000Z",
          "Titre": "Super Slow Delivery",
          "Contenu": "Super Slow Delivery - Hong KongCASETiFY as an established online seller, I'm shocked by the slow delivery of the screen protector, I made an order of 2x iPhone 14 Pro screen protectors on 28 Nov with delivery to Hong Kong, and the order reached me on 6 Dec (the claim was 4 - 6 days and it's 8 days). And sadly they've sent the wrong model (iPhone 14 Pro Max) which I'll need to wait for the right product. I've asked their CS team for a solution right away on 6 Dec and today is 15 Dec and I'm still waiting and the CS team is not able to advise the estimated delivery date, I need the screen protector urgently to protect my phone and now I've waited for nearly 3 weeks and still not yet sure when I can receive it. As their gold member, I'm disappointed to see the service like this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grace Park",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:56:37.000Z",
          "Titre": "Paid extra express shipping cost of…",
          "Contenu": "Paid extra express shipping cost of $15. Never received my order within promised time frame."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Friend",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:36:33.000Z",
          "Titre": "No overnight shipping option and glitch…",
          "Contenu": "No overnight shipping option and glitch about email being used during checkout"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "wendy jang",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:55:27.000Z",
          "Titre": "Really bad quality",
          "Contenu": "Really bad quality, flimsy and artwork looks better online than in real life"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:56:18.000Z",
          "Titre": "Case never arrived and no resolution offered. AVOID",
          "Contenu": "Case never arrived, I contacted Casetify multiple times over 2 weeks before getting a reply. I was sent on a wild goose chase by Casetify to contact the shipping company to figure out what happened to my parcel. this proved very difficult and I eventually gave up. I was not offered a refund or replacement and was surprised that a company as well known as Casetify would respond like this.EDIT: Order number is 18494951Update: Casetify have still not contacted me about this."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:03:26.000Z",
          "Titre": "Case broke when warrantee expires",
          "Contenu": "Case broke 8 months after buying. Not what I’d expect from £60 phone case - they used the review to try and convince me to buy another. Not the premium, sustainable brand/ product I hoped it would be"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Hober",
          "Nb_Reviews": 4,
          "Date": "2023-12-22T04:03:28.000Z",
          "Titre": "Terrible service Manager requested",
          "Contenu": "Super slow and poor communication skills by the staff they refuse to have a manager help or provide a phone number looks like they will ruin our family's Christmas with late delivery  even though we paid for DHL Express- False statement - Sarah did not reply to my concerns she made up a story claiming that I had canceled my second order (of course she could not find evidence to support this as it did not happen) and then I asked for a manager to get involved (more than once) so we could resolve this before Christmas. No manager contact by email or phone call. My concerns were ignored.Again Casetify has made a false statement and refused to have a manager help me. Very bad service from Sarah - it's like you are talking to a wall and they don't care.Francesco you are talking nonsense and not being helpful at all you are part of the problem. Today a supervisor finally answered after many requests and admitted the truth that I did not cancel two orders and that the current problem belongs to your staff but he did not take responsibility...Francesco again you are making the situation worse with false statements I am starting to wonder if you are can AI Bot? No one is waiting for my email the opposite I emailed back very fast and no response at all..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Susan Irwin",
          "Nb_Reviews": 34,
          "Date": "2023-12-13T23:04:38.000Z",
          "Titre": "Packaging tampered with",
          "Contenu": "Packaging tampered with , resealed with Royal Mail labels! Opened delivery & only 1 out of 4 items in my package. I sent customer service photos & they told me to make a claim with Royal Mail!? They are the sender & since then my emails are being ignored. Having to go via my bank to obtain a refund. Would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Z dalton",
          "Nb_Reviews": 7,
          "Date": "2023-12-15T07:18:28.000Z",
          "Titre": "Poor experience",
          "Contenu": "Poor experience Products are great however if you have on part missing or you need a remedy for something simple forget it- just don’t buy from Caseify , after 24 days , over 22 emails to and fro , the simplest task was actioned. Honestly I wish I purchased at Burga they’re fast they respond and resolve if there’s an issue. Caseify you are so archaic slow and all you did was bounce me around for weeks wasting my time and yours.  Congrats on your marketing but commiseration on where you skimp on the customer experience It’s the worst I have ever had in terms of process . ShockersThey say below on 15 Dec that  they are waiting my reply which is blatant lies as I replied 2 weeks ago and they finally sent the missing item . So I have finally after much time wasting been resolved  The below response shows how out of touch they are 🙄"
        },
        {
          "Note": 1,
          "Lieu": "MO",
          "Pseudo": "Bet",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T04:52:36.000Z",
          "Titre": "bas customer service without fixing any…",
          "Contenu": "bas customer service without fixing any of the problemsAlways read without reply"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jessica",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T01:55:32.000Z",
          "Titre": "My order had a issue I sent you the…",
          "Contenu": "My order had a issue I sent you the link to do the design again and you still said you can’t process my order my old cover broke and I wanted a new one my order number is 19138352 I have sent the new link to your email"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mel",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T16:45:23.000Z",
          "Titre": "Order placed and it took almost 6 weeks…",
          "Contenu": "Order placed and it took almost 6 weeks and a lot of chasing for them to tell me order was being cancelled as no stock of some items. Order had to cancelled as a whole not just unavailable item"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Mariana  Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T05:27:14.000Z",
          "Titre": "La funda se ve HORRIBLE",
          "Contenu": "La funda se ve HORRIBLE. Definitivamente no es lo que esperaba. No lo vale!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shin Jung Yoon",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T06:56:20.000Z",
          "Titre": "The worst customer service I have ever…",
          "Contenu": "The worst customer service I have ever experienced. Forgot half my order and had to show proof of the missing items. And after I accept this stupid request and send the pic, they then ignore my email?!?!"
        },
        {
          "Note": 1,
          "Pseudo": "PRICE MARISOL",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:47:16.000Z",
          "Titre": "Horrible customer service and ridiculously long shipping",
          "Contenu": "I ordered a phone case a month ago and my order is still in production. When I tried to reach out to Casetify to issue a refund, they denied it and said I had to receive my package first in order to get a refund. Do not order from here!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allira Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T08:04:07.000Z",
          "Titre": "The return process was too complicated",
          "Contenu": "The return process was too complicated. Also wasn’t given the opportunity to ask for money back but an exchange."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Danny Burt",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T21:16:06.000Z",
          "Titre": "Gifted a case as a birthday present",
          "Contenu": "Gifted a case as a birthday present, but was purchased the wrong one, attempted to exchange and pay more for the right case and was told no as was outside their 10 day return policy.   Such a silly policy was very happy with the service up to that point but now won't buy from them again or suggest anyone else does."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Azra Sever",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:04:20.000Z",
          "Titre": "The order still is in process how long…",
          "Contenu": "The order still is in process how long is it going to take to ship it it has been days now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Cerda",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:18:21.000Z",
          "Titre": "the cases fall apart after 1 year",
          "Contenu": "the cases fall apart after 1 year, my edges ripped off due to minimal use. WILL NOT be purchacing cases from here again, maybe other options..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:45:15.000Z",
          "Titre": "Case becomes extremely hot when charging",
          "Contenu": "The case becomes extremely hot when charging and it’s never happened with any other cases used. No response from Condenser Support at all."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Imogen Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T05:31:27.000Z",
          "Titre": "my parcel has been pending for 5 days…",
          "Contenu": "my parcel has been pending for 5 days and i have had no other notification"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Minie P",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:50:41.000Z",
          "Titre": "Inflexible and did not meet shipping timeline as promised",
          "Contenu": "Inflexibility to provide refund without having to return item. Did not meet shipping timeline as promised. No email updates on shipping status. Only received email notification that item has been shipped out after I received item. Probably my last time ordering from Casetify."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Grassi",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:59:05.000Z",
          "Titre": "I ordered two cases over a month ago",
          "Contenu": "I ordered two cases over a month ago, and tracking says they are still in production. There is no indication of when they will ship."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T05:20:31.000Z",
          "Titre": "Casetify is absolutely a dishonest…",
          "Contenu": "Casetify is absolutely a dishonest company. I will never do business with them again. They state you can cancel order within 12 hours. Contacted them within a 1/2 an hour….no response from Casetify. I accidentally order wrong color case originally. So I ordered the correct one and figured I would just eat the shipping to return the wrong one when it came in. Received it and emailed Casetify immediately to do a return “10 day no questions asked” BS. Emailed them on their site 3 times. Still haven’t heard back. They have a very bad rating on BBB. Buyer beware!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patty",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T23:36:53.000Z",
          "Titre": "Website would not take my debit and…",
          "Contenu": "Website would not take my debit and another credit card .. luckily I had another credit card I used .. had the gift not been for my daughters Christmas present I would have just forgotten about ordering"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Ms Au",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:10:52.000Z",
          "Titre": "I sent a complaint and 0 response",
          "Contenu": "I sent an complaint via the Contact Us section on the official website.There is no response at all.The design on my personalized case wasn’t printed according to the previewing one on the site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joan Venegas",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:06:29.000Z",
          "Titre": "No way to contact customer service",
          "Contenu": "No way to contact customer service. Ordered wrong case and cannot figure how to cancel within the 22 hours"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Bruce Carbaugh",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T14:35:10.000Z",
          "Titre": "No estimated delivery date when…",
          "Contenu": "No estimated delivery date when purchasing. Just found out it will not arrive in time for the holidays."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "정연 황",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:57:38.000Z",
          "Titre": "The design was pretty but..",
          "Contenu": "The design was pretty, but I bought a stolen design, and it was ridiculous because the consumer had to pay for the exchange and return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:48:34.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service. Had an issue with case and was responded to one time and then was responded again after a week's time. This is unacceptable by your own standards. I have initiated charge back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T18:10:32.000Z",
          "Titre": "Misleading",
          "Contenu": "Your prices are ridiculous, but my daughter asked for a specific card for Christmas. Item is listed as “in stock”, but once paid for, it changed to “production” or something. I need this for Christmas."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Elvis",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T06:12:08.000Z",
          "Titre": "Refund process too slow",
          "Contenu": "Refund process too slow, wrong calculation on the refund amount, no update to customer, no sorry to customer.Iulia, he/she calculated my refund amount incorrectly and that caused my refund took more than a month.I proactively contact the customer service on 07 Dec 2023 to check why my refund took longer than expect. Finally, Valerie confirmed on 08 Dec 2023 that the refunded amount was not correct and had to revise. That is the reason why I rate one star for my recent experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kell",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:51:43.000Z",
          "Titre": "Didn’t even last 6months",
          "Contenu": "Didn’t even last 6months. Should’ve bought another velvet caviar case those last 3 years but castify had more design options so I gave it a chance. Never buying again."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "Yang Zhong xian",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:21:43.000Z",
          "Titre": "I received my goods(Rope Cross-body…",
          "Contenu": "I received my goods(Rope Cross-body Strap-Peach) in December 2.I juct used one day in normal,the product have been broken,I sended two e-mail to your company,but I do not received any reply."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "David Kirwan",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:46:20.000Z",
          "Titre": "Terrible online purchase experience",
          "Contenu": "Terrible online purchase experience. Only buying this product due to a gift however will never shop here again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristofer Meraz",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:49:36.000Z",
          "Titre": "Case hasn’t shipped.",
          "Contenu": "It’s been a week and my case hasn’t even shipped yet. If it takes any longer I’m going to need a refund, I can’t walk around with my brand new phone and no case lol."
        },
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "TATIANA QUESADA GATGENS",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:12:13.000Z",
          "Titre": "I dont have my case",
          "Contenu": "I dont have my case; I asked if is possible sent to Costa Rica and I dont have response. I requested retur my $ 120 and also I dont have responde."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Mauro",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T19:12:20.000Z",
          "Titre": "50 dollars for a case",
          "Contenu": "50 dollars for a case10 dollars for fast deliveryFinal surprise, 30 dollars for custom90 dollars for a case, nevermore!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Wright",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T05:58:39.000Z",
          "Titre": "I got the crome doodle case and then on…",
          "Contenu": "I got the crome doodle case and then on my non hard kitchen floor it broke alot a lot of cracks, The case did not protect my phone AT ALL.. If I could I would return this but I can't."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terribly disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:01:30.000Z",
          "Titre": "HORRIBLE EXPERIENCE",
          "Contenu": "HORRIBLE EXPERIENCE I placed an order for 3 cases, leveraging a special 30% off promotion and free shipping. I received the text and email confirming my order, and my credit card was charged.  Days later,  Castify canceled my order out of the blue. I did not see the email as it went to a junk folder and they did not text me.  When my items never arrived,  I checked on my order.  I sent several messages asking why they canceled my order and the response was always the same,  that they didn't receive my payment.  Which was a lie as Casetify sent a credit to my credit card days after after I was originally charged. I asked for help in placing a new order, since I now lost the 30% promotion which was automatically applied. The responses just told me to apply the discount code, which I don't have. To receive by Christmas my only option was to pay for expedited shipping. I asked if they could do anything to help me,  since they caused the issue in the first place but no help was offered. A horrible experience that could have been made right by supportive customer service."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Candy",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T07:25:26.000Z",
          "Titre": "Absolutely horrifying delay……",
          "Contenu": "Update on 12/18-  Please stop telling me you are waiting for my reply.  Your email from Makayla was simply informing me the item is still pending to be delivered. Below is your extract email. What are you waiting for me to reply? Please enlighten me.“Makayla (CASETiFY)Dec 15, 2023, 04:00 PSTHi Candy, Thank you for getting back to us. We apologize for any inconvenience this may have caused. Please be advised that we are currently arranging the order Tax free for DHL Express. Once the update is done, you order will ship as soon as possible. If there's anything else we can assist you with, please don't hesitate to reach out. Thank you very much and have a nice day!Regards,Makayla | Team CASETiFY”I can’t believe you are now shifting the blame onto me. Absolutely unacceptable.Absolutely horrifying delay in delivery. I ordered the item on Nov 25 and still no sign of it. I had to send in enquiry twice to get a response that it is still in production. I should consider myself lucky if I can receive it in 2023. The one star goes to their attempt to speed up the delivery by offering free upgrade to DHL express delivery which would still take 4 days. I would never buy from them again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Ho",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T13:28:39.000Z",
          "Titre": "Ordering took too long kept denying my…",
          "Contenu": "Ordering took too long kept denying my credit cards until i used them through paypal"
        },
        {
          "Note": 1,
          "Pseudo": "Manuela A",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T15:47:47.000Z",
          "Titre": "THE WORST BRAND EXPERIENCE!",
          "Contenu": "THE WORST BRAND EXPERIENCE!I'm not one for leaving negative reviews, but I feel it's necessary to prevent others from having the same awful experience. My first encounter with this brand was with a MacBook Case, which disappointingly arrived with a broken corner. More recently, I accepted a phone case from the same brand, offered as a gift by the company I work for. I was hesitant, but their claims of superior protection and appealing design convinced me to try again. However, my phone's back cracked yesterday while it was in their case, due to a simple accident. This brand advertises their high prices as a reflection of unmatched protection, but clearly, that's not true. I can provide photos of my damaged phone and the ineffective case. I strongly recommend avoiding this brand – don't waste your money!*As I mentioned, I got this as a gift from the company I worked for so I don't have any order number."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Basel Almutawa",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:28:30.000Z",
          "Titre": "Case type was not what I wanted",
          "Contenu": "Case type was not what I wanted, then ordered the second time and it’s not the model that I wanted, I need to return both."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Man Hong Lo",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:29:11.000Z",
          "Titre": "Worst service never experience before",
          "Contenu": "No goods received after ordered for more than one month. Finally request cancel order and refund.Thanks for your comment. But your investigation is incomplete. I already got the refund weeks ago."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "loi ho",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:41:30.000Z",
          "Titre": "The previous package there is a dent…",
          "Contenu": "The previous package there is a dent and multiple scratches on the case"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexi  Baumgardner",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:02:08.000Z",
          "Titre": "I purchased a phone case and it was not…",
          "Contenu": "I purchased a phone case and it was not the one I wanted. I returned the case and purchased a new one. However, I was never refunded for my case."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "VC",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:54:52.000Z",
          "Titre": "Delivery took almost two weeks",
          "Contenu": "Delivery took almost two weeks, with no updates until I had to reach out to enquire by email;  and the response time is slow.The case itself - very scratch prone and the marks are very obvious. The plastic on the side where the volume buttons are is wobbly. The quality isn’t great overall."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 11,
          "Date": "2023-12-08T09:53:59.000Z",
          "Titre": "Warning: Bad quality",
          "Contenu": "After barely a year of use with no inflicted damage or any falls (we are careful people), my wife’s case simple decided to fall apart. The sides separated from the back cover on both the left and right side, making the case unusable. For a case that I paid €70 for, I expect better.We have Casetify a honest chance to do something about this, but they don’t go further than a 20% discount on the next order. 20% discount on a €70 euro product that only lasts us barely a year is not worth it.I recommend Mous as an alternative. These guys know how to make good cases that last forever (and also keep looking great).Update due to Casetify requestLatest support ticket: 6334695Order confirmation: #11608481Product: iPhone 13, Average Ramen Enjoyer By Catwheezie, White Sand color"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MC",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T11:28:24.000Z",
          "Titre": "Misleading description of case",
          "Contenu": "Misleading description of case. They advertised that it was a glitter case. There was no glitter just a weird design trying to mimic glitter. For the price it costs it was definitely not worth it. And such a hassle to return it too. I will not be ordering from here again. Order number is 18018219"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Carissa Wong",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:54:58.000Z",
          "Titre": "The AirPod case cover is loose",
          "Contenu": "The AirPod case cover is loose. I went to the your shop in causeway bay, the staff ask me to leave contact and said someone will contact me within 3 days. And I never heard from you guys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toni Stultz",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:35:36.000Z",
          "Titre": "We never received this case and I have…",
          "Contenu": "We never received this case and I have reached out to your customer service team with no response. It has been over a month and we are out $70.00"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D. Sanders",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T10:16:00.000Z",
          "Titre": "I Am Not Happy",
          "Contenu": "I cannot get anyone to update me on my emails I’m sending regarding this shipment. It is taking extremely long to get this order. It’s been almost a month and I still don’t have this item, and it looks like I’ll be lucky to get it by Christmas."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Susa",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:18:38.000Z",
          "Titre": "Items not delivered after 7 weeks",
          "Contenu": "Can‘t review anything.  Items ordered almost two months ago but still not delivered."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "Bee Kong",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:51:25.000Z",
          "Titre": "Send the wrong model",
          "Contenu": "Send the wrong modelNo one reply email and resend many timesReply email slowly Hard to contact No hotline"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brooke Baumgartel",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:58:58.000Z",
          "Titre": "I reached out twice about a return for…",
          "Contenu": "I reached out twice about a return for the case I bought and never heard anything and now it’s past the window so I’m stuck with an expensive case that doesn’t fit my phone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Laura Cheshire",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T11:17:09.000Z",
          "Titre": "Casetify case...... Not fit for purpose!!!",
          "Contenu": "I purchased the Cloud Forest Casetify case as a treat to myself. It was expensive at £66 but was tempted by the 100% guarantee satisfaction and products warranty. The case started to peel after just one week.I contacted the company who were not at all helpful and said it was just 'wear and tear' of the case and refused to do anything further.This case is NOT fit for purpose and I am very disappointed with the quality of boh the product and customer service recieced. Do NOT buy from this company!!!!Customer order: 17226102Hi, Sorry but I have not yet received an email from Lauren Could she get in touch again please. Thank you!"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Leonie Seitz",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:17:20.000Z",
          "Titre": "Terrible shipping and customer service + very high prices",
          "Contenu": "I have placed an order on the 22nd of November. The confirmation email states, that the delivery will take 8-13 days (30.11.-05.12.). When I didn't receive any shipping information by the 30th, I asked the customer service what the status of my order was. I didn't receive any further information other than the statement that my order is supposed to arrive between the 2nd and 9th of December. When I didn't hear anything else by the 9th, I messaged the customer service again. After some discussion I was granted a discount of 5% (about 2€) because my order hadn't even been produced yet. In my opinion that is not enough. It is now the 21st of December and my order has just now been delivered - almost a month later.The case is alright, but is not worth the price and the trouble."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Terry Sweeney",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:42:20.000Z",
          "Titre": "Very sketchy response from email",
          "Contenu": "Very sketchy response from email, just asked an honest question whether it is realistic that what I ordered would arrive for Christmas having paid express postage. A simple yes or no would have been helpful, not a problem either way it would just give me a chance to sort another case out for a present. They are posted from HK so not holding breath now, why is it so hard to get a straight answer and an additional answer about how to cancel and refund. The product might be ok but communication not so clever.Thank you for the reply,It’s odd that several polite emails were unable to get a response and still have not heard back from the last, but if I take time to write a review of my experience you are on it straight away Regards Terry"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenny Jeske",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T14:31:15.000Z",
          "Titre": "I never would have ordered the case if…",
          "Contenu": "I never would have ordered the case if I knew it wouldn’t arrive in time for Christmas.  Now I’m scrambling to find a new gift for my daughter because Casetify didn’t come through for us."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T05:21:24.000Z",
          "Titre": "Take so long for production process",
          "Contenu": "Take so long for production process.  It is also happened from all my previous purchase experience here.I mentioned the process above means after u confirmed my order and before it is shipped.  For this time, it took 3days."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diane Deignan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:40:45.000Z",
          "Titre": "Still waiting for it",
          "Contenu": "Still waiting for it! It’s been ten days since they printed the shipping label and it’s still in transit to the post office?! I know it’s a busy time of year, and they responded to my inquiry, but this is ridiculous. Plus the inventory is very low so I couldn’t get the style and color I wanted so had to go more expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ruth Stengel",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:42:14.000Z",
          "Titre": "I am disappointed that I won’t get it…",
          "Contenu": "I am disappointed that I won’t get it in time for Christmas. If I knew in advance that it was in “production “ I would have ordered something else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abigail",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:29:43.000Z",
          "Titre": "False Advertising on 100% Guarantee",
          "Contenu": "I have never had a problem with ordering cases until I needed an exchange. I reported it within the first 2 days and got an immediate response the following day. However, I haven’t gotten anything / heard back for an entire week. The 100% guarantee doesn’t seem to be truthful based on my experience."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kris",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T16:31:45.000Z",
          "Titre": "Like the the look and feel",
          "Contenu": "Like the the look and feel. Unfortunately the clasp does not hold anymore and I’ve only worn it a few weeks. Not recommended as it not wearable. I had not caught it or hit it against anything, but the mechanism just won’t hold together anymore. I figured I would try to bend the metal but it so delicate I’m afraid it would just break off. To bad as it’s a very nice looking and weighted watch band."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Bailey Quinn Dobbs",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T11:34:48.000Z",
          "Titre": "Long wait for shipping and lack of communication",
          "Contenu": "Shipping time significantly longer than I was informed about prior to my order, and communication was poor. However, when addressed, they did upgrade my order to express shipping free of charge and the case is great quality. Would’ve been a much better experience for Casetify to have been up front about there being a month long wait for production time alone rather than me having to chase up the company asking where my order is."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:24:25.000Z",
          "Titre": "Still haven't had any kind of update…",
          "Contenu": "Still haven't had any kind of update from my order that was confirmed Dec. 3. Tracking says \"production.\" No answer to my email."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Dewi",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:46:59.000Z",
          "Titre": "Plan ahead want to save shipping end up still need to pay.",
          "Contenu": "I place an order way before to make it in time as a gift then notice that the customisation can't proceed. Then I need to make it express order which the shipping it self cos SGD30 :("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Nifong",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:02:43.000Z",
          "Titre": "I found it very cumbersome to use",
          "Contenu": "I found it very cumbersome to use. For some reason it did not want to accept my credit card when I was positive the info was correct. Message keep saying error without showing where the error was."
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "승리 이",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:10:27.000Z",
          "Titre": "Coupon are not usable",
          "Contenu": "All the vouchers and coupons always have some kind of limitation. I get advertisement message for a new coupon, and then when I go on and try to purchase the item, EVERYTIME, specific coupon can not be used..."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "云慈 詹",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:58:36.000Z",
          "Titre": "The order placed on November 11th has…",
          "Contenu": "The order placed on November 11th has not been received on 12/21. I asked customer service once on 12/12 and again on 12/20 and they said it was out of stock."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pamela  C Gavin... Kisha",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:12:20.000Z",
          "Titre": "I tried foe a month using my card with ordered everything  from Amazon  great.. this cite would not let me purchase  this si had to use my mother's so my daughter  would  receive  it for Christmas",
          "Contenu": "My daughter will not recieve  this for Christmas  because  the cite wouldn't  take my card .. I tried over & over had to use my mother's.. now she  will get it whenever.."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Lo",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:51:00.000Z",
          "Titre": "Slow online order and delivery",
          "Contenu": "Online order production to delivery process is very slow. No updates after one week. My product does not require customisation"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carrie Gilmore",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T22:13:38.000Z",
          "Titre": "A little annoyed.",
          "Contenu": "A little annoyed.They offer 10% off your order if you sign up for text or emails, I did both and never received a code. The link they sent offering 10% off didn’t work/apply any discounts. Cool products but irritated by the inability to use a discount they promise."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Noname",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:20:10.000Z",
          "Titre": "My gift card is valid",
          "Contenu": "My gift card is valid. But your system did not accept. It upset me because I wanted to get 2 cases but instead only got one Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kaylan Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:15:42.000Z",
          "Titre": "Signed up for the text messages and…",
          "Contenu": "Signed up for the text messages and emails to get the 10% off and would not provide a code for me. I tried just clicking the link it sent and assumed that it would automatically include it in checkout but it did not. I would suggest making that an easier process."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Maddison Palfreman",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:13:54.000Z",
          "Titre": "I ordered nearly £100 worth of stuff",
          "Contenu": "I ordered nearly £100 worth of stuff on the 1st of December, I gave it a week and asked to pay for quicker delivery they sent the link I paid and it still says pending production, so wasn’t worth paying £10 for quicker delivery, the delivery update is on the same thing and has been most of the time. My order has not been despatched still either, everything’s just very slow and not worth the time if you want something fast.Can someone from Casetify please get back to me! I need my order before Christmas and I’ve been messed about for ages, just despatch my order that you told me was ready to despatch over a week ago please!!  (Order #18855210)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matty  Mitchel",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:13:35.000Z",
          "Titre": "My experience was not very good:( I had…",
          "Contenu": "My experience was not very good:( I had to wait weeks to receive my case and my case now has already  broke after 1 month of owning it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Ganske",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:12:38.000Z",
          "Titre": "Website is very hard to navigate and discount wasn’t applied",
          "Contenu": "Your website doesn’t allow me to create a login and then when I was supposed to get 10% off for signing up for texts/email it didn’t process the %10 off after I created a login. It was a $130 order so that would have been a nice discount. Website is hard to navigate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dyanne Frazier",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T18:39:33.000Z",
          "Titre": "When I got confirmation of my order",
          "Contenu": "When I got confirmation of my order. It says order status is pending production. I understand that to mean the product is not available at this time. Since this is intended for a Christmas gift I think availability should have been notified before I placed the order!  I feel this was misleading."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lauren Rucker",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T08:35:58.000Z",
          "Titre": "Does not hold up",
          "Contenu": "I received my case and i loved it. It's not as grippy as I thought it would be on the sides but that's not the problem within 12 days of having it the design started chipping off like bad nail polish. They give a 10 day satisfaction but it specifically states that design and paint wearing doesn't not count toward a warranty regardless of the time frame. I tried to email them and it's been over 3 weeks with no response. I will not be buying from them again."
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "미정 심",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:29:29.000Z",
          "Titre": "It's too expensive and they only give…",
          "Contenu": "It's too expensive and they only give you influencer for free.Is that why it's expensive?It's too late"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Juanita Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:28:38.000Z",
          "Titre": "I purchased the $100 case and honestly…",
          "Contenu": "I purchased the $100 case and honestly will say I should have stuck with boring otterbox. My screen protector on my phone has two cracks in it and I’ve had the phone case for a little more than a month. The case is nice looking and feels good but definitely not worth $100+ and otterbox is only $60. Since my phone is the iPhone 15 pro max, I will be going to otterbox and throwing this case away. Sigh. 😔"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Emma R",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:52:29.000Z",
          "Titre": "Huge wait time to receive the product",
          "Contenu": "Huge wait time to receive the product - still waiting almost 2 months later. Wasn't overly clear when purchasing that it would be weeks until product sent. If it was clearer I wouldn't have purchased."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tee Frazier",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:15:08.000Z",
          "Titre": "Not right now im still waiting on a response email or something concerning my most recent purchase",
          "Contenu": "Still waiting for an email update on my recent purchase"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "YS",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T11:03:59.000Z",
          "Titre": "Disappointed with Casetify… never again!",
          "Contenu": "Disappointed with Casetify... after three months of using a case that I really liked... it started to peel from the back. I of course contacted customer service who was very quick but they said rathe that the shell had been removed voluntarily! So why would I  remove the back of a case costing more than 60 euros??!? Well I asked that I send it back to resolve the problem but no they offered me a $10 voucher for my next purchase... which I'm not going to I was advised to go to a competitor who makes better quality shells that last, that’s what I decided to do in the end. Perhaps we should take a better look at the condition of the cases or print them because I bought 3 cases since August thinking about value for money but hey…🤷🏾‍♀️ one of the three has been a dissapointment… At least the customer service is very fast to answer the question that why I leave one stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:35:16.000Z",
          "Titre": "Ordered a case for my Apple watch and…",
          "Contenu": "Ordered a case for my Apple watch and had the pride print around the border of the case. It looks nothing like what's advertised on their website, it looks like it was printed in the lowest resolution with the cheapest materials. Casetify is expensive so you expect good quality, jokes on me because it's not. You can't even leave a review on their website page easily so they must HEAVILY control that aspect of consumer opinion. I will never buy Casetify products again, there are so many better companies to select from. Edit: Since I can't reply to Casetify, here's my order number 1884635."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mrs D",
          "Nb_Reviews": 12,
          "Date": "2023-12-12T13:34:10.000Z",
          "Titre": "All three purchases split with 11 months. Save your money.",
          "Contenu": "I have purchased three casetify covers for my iPhones because I love their designs. Having said that all three have split on me within 12 month. Warranty is only for 6 months. The last case cost me £38+ postage. For this amount of money I would expect it to last a lot longer and be more sturdy. I will not be purchasing from Casetify again. Order number 14334817"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Golonka",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:51:05.000Z",
          "Titre": "Didn’t like the ordering process",
          "Contenu": "Didn’t like the ordering process. It wasn’t clear how much time is needed for shipping/receiving. Now I may have to cancel the order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shelley Womack",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:49:07.000Z",
          "Titre": "The return process is very vague",
          "Contenu": "The return process is very vague, cumbersome and long drawn out! Too many emails to be sent back and forth and days and weeks until it’s fully processed and the return is issued! Don’t think I will be ordering anything again due to that fact. All other retailers I have purchased from have a very simple one step process that is quick and easy to understand without the 6 plus emails. In this day and age returns should not be this many steps with this many correspondences."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dave w",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:34:25.000Z",
          "Titre": "Search doesn't really work",
          "Contenu": "Search doesn't really work. Had to browse for item.  By design perhaps?    Klunky dated web interface.  Your selling over priced device covers, not fancy trendy works of art."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:30:53.000Z",
          "Titre": "Misleading prices, pay attention",
          "Contenu": "If you buy off the website it says no shipping and the case is $44. When you use the welcome link to get 10% off the case it ends up being more ($45.59). They make up some numbers saying the case is $40 and then puts in account a shipping price. What a scam and very misleading."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:56:44.000Z",
          "Titre": "Customer service??",
          "Contenu": "From ordering to receiving took a long time. After realizing I have the wrong item I've reached out multiple times to address the issue and have not received any response. A little service please!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenn",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:18:04.000Z",
          "Titre": "repurchased but not excited about the results.",
          "Contenu": "I bought a case similar to this for my iPhone 11 and it was so amazing that I decided to purchase almost the exact same one for my iPhone 15. The case seems pretty durable (which I loooooove) but the font for the personalization is different (cursive instead of blackletter font). I wish I had the blackletter font because the thin cursive is starting to rub off. I’ve only had it for a couple weeks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angélica",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T12:07:47.000Z",
          "Titre": "Bad graphics, sturdy case",
          "Contenu": "The graphics look like a poorly printed sticker, not like the pictured image they show you, however the case feels nice and sturdy. I gave it a 2 because although the case is strong the image looks comically bad. It’s like they printed it at home and not professionally"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emma Ziser",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:11:35.000Z",
          "Titre": "it took me four days to be able to…",
          "Contenu": "it took me four days to be able to place my order because the website kept freezing. now i may not get it in time for christmas"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nichole Imhoff",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:28:07.000Z",
          "Titre": "Still hasn’t shipped yet and probably…",
          "Contenu": "Still hasn’t shipped yet and probably won’t arrive by Christmas"
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "Damdma",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:40:11.000Z",
          "Titre": "The officer web site is so hard to use…",
          "Contenu": "The officer web site is so hard to use or to choose the case. After i choose the one case, i can't go the before page. And this brand application need to have oder page when i choose the web site."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Eun kyoung Seong",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:52:19.000Z",
          "Titre": "Just so so",
          "Contenu": "The material of the cell phone case is too hard to absorb external shock. The corner bumper size was also small as shown in the photo. I don't think the quality is worth the price. It's not worth recommending to others at that price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RUBEN GONZALEZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:25:56.000Z",
          "Titre": "Nice to look at but not a good case!",
          "Contenu": "Nice to look at but not a great case. Kept my s23 ultra in the case since I bought it. The case has shown no signs of damage even with a few drops. I took the phone out to clean and noticed the back glass was broken. No damage to the case but the actual phone was damaged! Not a case if you want to protect the phone"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Jeri Raya-Maneze",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T04:34:21.000Z",
          "Titre": "Looks like a printing error",
          "Contenu": "So Casetify is pretty expensive right? I bought the SKY design in the phone case. It's really cute but a part of it looks like there was a printer error. But they covered their bases because the error is on the website. So I can't really complain about it because it's on the website but it bothers me!"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Catherine T",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T09:07:49.000Z",
          "Titre": "Ordered two cases on november 6th, didn’t ship until december 12th",
          "Contenu": "Ordered two cases on november 6th. Almost a month later, they had still not been produced (in the order tracking section it said ‘pending for production’), so I wrote to customer service. They replied quickly, saying that they were quite busy, but they would produce and ship my order within the next week. They then offered me premium shipping for free, which I gladly accepted.Another week later, I checked on my order again because I still hadn’t gotten an email saying that it had been shipped, and what do you know, it still said ‘pending for production’. I was angry. I had ordered one of the cases for myself, but the second one was a christmas gift, and at this point we were barely two weeks before christmas, and, knowing how long shipping can take, especially with casetify (since I had ordered from them twice before), I was starting to get really worried the case wouldn’t arrive in time for christmas. So I wrote to customer service again, and I got a reply the day after stating that one of the cases I ordered was out of stock, so like whoopsies nothing they can do.I was furious. Why tell me that you’re going to ship my order within a week, no problem, and then a week later all of a sudden you’re out of stock? Didn’t make any sense to me.Told them they were either lying to me or just sucked at communicating and to cancel the case that was ‘out of stock’ and just send me the other one. In the reply I got they just said ok, that case is cancelled, bye bye.I’m still angry, probably never ordering from them again.Only reason I’m not giving them one star is because the customer service was fast and I got premium shipping.Very very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hana",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T15:50:48.000Z",
          "Titre": "Casetify Charges You Whether They Know They Can Ship Your Product or Not",
          "Contenu": "I placed order 18709443 three weeks ago.  After almost two weeks—the end of my estimated delivery window— I emailed them because the items still hadn’t shipped. “Kali” emailed me back to say one of the items was out of stock (in spite of still showing in stock on the website) and asked if I wanted to choose a replacement. I responded back within a few hours saying I did, gave the name of the new color I wanted, and asked if the price difference could be refunded. It has been six days since my response and nothing has happened. I have replied to the email daily asking for updates and still nothing. My order still shows as “on hold.” I tried to reach out via the website due to their non response via email. No reply there either. Finally, I tried to connect with them via instagram DM and the two replies I have gotten are both “kindly wait for our teammate to assist you via email to avoid any miscommunication.” Hard to have miscommunication when no one is communicating at all. It feels like a massive scam to have a company charge your card for products before they ship, hold that money for weeks, and fail to address your issue after repeated attempts to contact them. I thought ordering a month before Christmas would be adequate but apparently not. At this rate if the issue is not resolved ASAP I’ll pursue a chargeback with my bank. Update: within an hour of leaving this review, Kali reached out again to say that my emails had been “screened out” and she hadn’t received them. Not sure that feels truthful but whatever at this point. She indicated she updated my order with the new item I had selected and the order shows as in progress again. I leave my review at two stars as there is very little chance it will get here before Christmas in spite of having placed an order for two in stock items nearly a month prior. Casetify never reached out to me to tell me there was an issue—I had to waste two weeks waiting for it to ship, contact them myself, and only then found out. Then another week with no response about fixing the situation. They likewise did not offer to expedite or upgrade shipping due to their error. And in all of this, the item they said held up my order STILL shows in stock in their website. What a disappointment, bordering on what feels like unethical behavior."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Monica Chit",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T10:37:45.000Z",
          "Titre": "How the heck order 18534097 is still…",
          "Contenu": "How the heck order 18534097 is still under prodcution for 1 week after the purchase date?This is ridiculous. If you cannot handle mass production and overseas shippment, please dont advertise in foreign countries.And the arrival date is 3 weeks later? Amazing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Granmymc",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:43:57.000Z",
          "Titre": "Your website is very difficult to use",
          "Contenu": "Your website is very difficult to use. People need to be able to search 🔍 for specific items."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Guzman",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:50:40.000Z",
          "Titre": "I’ve had the case for 6 months and the…",
          "Contenu": "I’ve had the case for 6 months and the edges are coming apart. This happened to my last case from CASETiFY and I thought it was just my fault but this is my 2nd case to do the same thing and I take good care of my phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rachel King",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:00:00.000Z",
          "Titre": "It’s cute and protects my phone but…",
          "Contenu": "It’s cute and protects my phone but it’s been less than 2 months since receiving my case and the print is already peeling away. I work a desk job and my phone spends most of its time on a stand or just laying around, nothing to cause aggressive wear and tear. The warranty says peeling prints are not covered so I’m guessing this is a common issue, especially since I experienced the same thing on my last case from them. The designs a cute so I wanted to give Casetify another go but the cost of the product is too much for something that has such a clear flaw."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jenny",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T14:41:41.000Z",
          "Titre": "Response was fast but didn't have…",
          "Contenu": "Response was fast but didn't have enough information as well, I did receive my product but it was the wrong one now waiting from customer service to get back to me it's been over 3 days"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Lisa Gillman",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:21:56.000Z",
          "Titre": "No receipt received or timescale for…",
          "Contenu": "No receipt received or timescale for arrival of the case"
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "King Tang",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T02:11:36.000Z",
          "Titre": "It's very difficult to navigate the…",
          "Contenu": "It's very difficult to navigate the site.  I'm just trying to search for a very simple phone case, but somehow the search function can never find what I want. This also applied to my watch band.  After having the phone case sorted, somehow the watch band decided to remove itself from the shopping cart.  To add to the madness, while I was searching for the aforementioned watch band, I missed the midnight deadline to use my birthday coupon.  Thanks a lot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lindsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:53:32.000Z",
          "Titre": "Took nearly a month for my case to arrive",
          "Contenu": "I ordered my case on 11/8, it was not customized and did not arrive until 12/4. The shipping time said 7-13 days and continued to be pushed back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LT",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T16:42:00.000Z",
          "Titre": "Poor checkout system",
          "Contenu": "The system kept telling me it couldn't verify my credit card,  to check my shipping and billing address were correct. I checked and then it wanted me to login, which I didn't create an account and didn't want to. Finally got past that, then it gave me the same error several more times until I clicked, save my card for future use.  Finally it told me they don't accept Discover. Took a lot longer to check out than it should have. Would have given up buying the product had it not been a gift for someone."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Lee D",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:35:17.000Z",
          "Titre": "Protective but flaky",
          "Contenu": "Got the case about a month ago. The case itself feels super sturdy and feels like it's gonna protect my phone which is great. But all the decals have started to peel and flake off. For how much I paid I feel like the design should last more than a month"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Bee Choo Tan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:58:36.000Z",
          "Titre": "I was shopping just before the clock…",
          "Contenu": "I was shopping just before the clock strike 12mn. Did not manage pay with 12.12 discount."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "GspiritTO",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T08:42:10.000Z",
          "Titre": "All 4 sides start to peel off after only 1 year of careful use",
          "Contenu": "Only lasted a year, and the side protection started to peel off from the back from all 4 edges, and it is not usable anymore. It is not worth 75 USD considering it only lasted for a year with careful use.Nov 10, 2023 Update:Order number and personal information has been added to the review.I'm looking forward to seeing the solution Casetify will provide.Will be adding more update once Casetify contacts.Order Number: 10189876"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Michael Blight",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T10:02:58.000Z",
          "Titre": "Free delivery or not?",
          "Contenu": "I was unimpressed that the purchase page said free global delivery with no conditions, but then i got charged for delivery. I assume this is why the sale price is $0.01 under the FAQ statement that delivery is free over $62."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:26:33.000Z",
          "Titre": "Need search button with item number",
          "Contenu": "You need an actual search button on your website, So when someone's coming to get a gift that somebody else said they wanted, it's easy to find. I went through 900 something cases and couldn't find the case that my niece wanted."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melissa David",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T07:33:46.000Z",
          "Titre": "Cute case but very expensive",
          "Contenu": "Cute case but very expensive. Also the top doesn’t stay on and I’ve already lost it less than a month after receiving it. Will be calling customer service for rectification."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marilyn Graves",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:15:34.000Z",
          "Titre": "Please improve your search function",
          "Contenu": "Your site does not have good search features. Makes it hard to find anything"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don L.",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T19:02:22.000Z",
          "Titre": "Getting in touch with someone seems to…",
          "Contenu": "Getting in touch with someone seems to be an issue.  I placed an order in October and the wrong product was sent to me.  I understand mistakes happen, however, I twice used the site to contact someone with this and never heard from anyone.  I need the right item sent to me ASAP.  It has been WAY too long.  Look at order 17930133 and contact me please!  NEW - I am not receiving any emails addressing my order issue.  Please resend no later than 11/27 or provide me a phone number that I can call.  This is ridiculous.  This is an error on your end."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NC",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:49:57.000Z",
          "Titre": "Has a chip in less than a week",
          "Contenu": "My case already has a chip in it and I've had it on my phone less than a week. I'm not hard on my cases so I'm surprised this would happen with a case that is supposed to be so durable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley Warren",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T01:37:49.000Z",
          "Titre": "Designs chip off.",
          "Contenu": "Their case designs chip off within weeks and they will not replace/refund because it is \"normal wear and tear\" even though it doesn't happen after months, it happens after weeks. There is no protection over top of the designs and it will just keep chipping even if you are soft with your case/phone. These cases are FAR too expensive for the designs to be such poor quality."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Dr. Sung",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T20:03:43.000Z",
          "Titre": "Ｉcannot find \"sunshine mirrow case\"…",
          "Contenu": "Ｉcannot find \"sunshine mirrow case\" product in casetify website, instead of google it on chrome.I aslo brought the \"sunshine watch band\" to match the case. However, sunshine logo (design) didn't have on IPad cover case nor on protect bag."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teddy Tay",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:40:47.000Z",
          "Titre": "Magnetic portion of the magsafe…",
          "Contenu": "Magnetic portion of the magsafe charging came out within less than 1 month of use"
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T00:18:11.000Z",
          "Titre": "Useless vouchers",
          "Contenu": "Like the products but giving away many awesome vouchers that you can’t apply on half of the assortment is like a great click bait for a boring YouTube video, feels like you’ve been scammed to be honest. Paying the full price in the end to get even more vouchers that will sit there unused, awesome 👍🏼"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Nancy van Batenburg",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:36:04.000Z",
          "Titre": "Edges of the case are detaching after a while",
          "Contenu": "I bought a quite expensive magsafe case and utility strap, because I was prepared to invest in a good quality product. At first I was really impressed by both items, but after 7 months the edges of the phone case started to stretch out a lot to all sides and detach from the case. I think this happens because the case isn’t one piece but a separate edge and back glued together. I tried to glue them back a few times but it keeps separating and my phone drops from the case, making it unusable to this point. Of course this happened right after the 6 month warranty. Very disappointing.Order number: 13299516"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Navodit Ravi",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T04:37:46.000Z",
          "Titre": "Had a torrid time making payment through my Credit card",
          "Contenu": "While I was trying to make payment via my CC or Debit Card I kept getting the error report that my card could not be verified. Tried multiple cards but it didn’t work. Had to then try PayPal which resulted in a high conversion fee. 😕"
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Katie Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:50:21.000Z",
          "Titre": "Disappointed shopping experience",
          "Contenu": "I placed an order with 5 items purchased. I chose a wrong model for one of the items. I sought help from CS and they said they could not change the model for me and asked me to cancel the whole order and get the refund. I wonder it is just a small request and it cannot be fulfilled. Finally I cancelled the old order and make a new one but I can no longer enjoy the discounted price for two items. I am very disappointed with this shopping experience."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Lam Vu",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T00:42:10.000Z",
          "Titre": "Delivery took 3 weeks and a half",
          "Contenu": "Delivery took 3 weeks and a half. Purchased an Impact case that costed $100, phone fell out of pocket and the back of my phone cracked. Not worth at all. May aswell pay $10 for a cheaper case. Don't trust those advertised videos you see online.Order #17461857"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Alan",
          "Nb_Reviews": 8,
          "Date": "2023-11-17T12:32:25.000Z",
          "Titre": "Not worth it",
          "Contenu": "Honestly the iPad Air case was kind of disappointing I ordered the tri-cut fabric case and it wasn’t fabric at all the design was just printed on a thin cover with low resolution and the ridges on the bottom for the stand are weigh to flat so the iPad just collapses with a small nudge and overall weigh to overpriced(#18303045)"
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Sze Wan Wong",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:09:23.000Z",
          "Titre": "Informed to me no stock after order",
          "Contenu": "Informed to me no stock after order, so delivery date delay around 2-3 weeks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Je Won Jung",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:59:05.000Z",
          "Titre": "Meg Safe is too weak.",
          "Contenu": "Meg Safe is too weak.. it won’t attach..+ very overprice"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tina Turner",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:16:15.000Z",
          "Titre": "Iphones are a priority to you",
          "Contenu": "You only offer about half the selection of phone cases to phones that aren't Apple. It's evident that you cater to iphone users, which is a bummer because your cases are durable and practical. That swinging camera frame would be very helpful to an android user."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lauren L",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T15:58:32.000Z",
          "Titre": "Cute Case, Poor Customer Service/Warranty",
          "Contenu": "I wanted to give the review 5 stars, but due to the price of the case and customer service, this is where we are. It’s clear that the picture on my case did not properly adhere to the case due to it already peeling and it hasn’t been a month yet. Customer Service said that was normal which doesn’t seem right especially considering the price point. Very disappointed as I wanted to love the case."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "Onepice",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T05:41:57.000Z",
          "Titre": "OMG IT IS SO FREAKING HARD TO MAKE A…",
          "Contenu": "OMG IT IS SO FREAKING HARD TO MAKE A PAYMENT 😭 such a waste so muche energy. I tried using 4 VISA CARD & 2 MASTERCARD and it still rejected! Until I made payment with paypall. Please make it easier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KMH",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T18:20:48.000Z",
          "Titre": "Ordered a case for my daughter and she…",
          "Contenu": "Ordered a case for my daughter and she loves it!  It started separating at both sides so I submitted a warranty claim, waited and haven’t heard anything so I’ve submitted another and another…I think I’ve submitted 5 with no response from Casetify.  I’ve included my order number, photos and all info."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "Tunyapon",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T08:51:23.000Z",
          "Titre": "Thank you for your service",
          "Contenu": "Thank you for your service, but it would be better if you could update me if my product is being updated or shipped. I don't know what to do.I've been waiting for this product for more than 2 months now and I received it as a gift. Hope you guys understand, I didn't order directly. I can't really check my package. I'm so sorry if I didn't get that gift but thank you for your help.This is my CASETiFY Order Confirmation (#17445770) Please update me Thank You ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kamille",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:20:04.000Z",
          "Titre": "dissappointing impact screen protectors",
          "Contenu": "the case was great. but the screen protector which they claim impact screen protector didn't do the job. Screen protector got shattered easily with just a 12inches height of fall. Ifs not shockproof or whatever. I am very dissappointed of how pricey it is but will shatter easily with just a low height fall."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Ms. Kwok",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T02:22:09.000Z",
          "Titre": "Need to follow up",
          "Contenu": "Long waiting time after ordering online. Bought a 3-hour surprise item with much higher price，suggest to have refund or amend the placed order in this case. Can I change other item for online purchase?"
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "ธนพร สาธุวงษ์",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T18:55:21.000Z",
          "Titre": "Ordered 6.11.2023",
          "Contenu": "Ordered 6.11.2023Now 23.11.2023 not receive & not have any shipment notification!!!While my friend order 11.11.2023 & already have got her order."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Alphonsus",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:51:31.000Z",
          "Titre": "Order Processing Delays",
          "Contenu": "This is my first time purchasing a product from Casetify, for my Apple Watch Ultra 2. Its taking awhile to process my order compared to other competitors. I hope that your company will improve on this."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "意瑄 張",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:53:00.000Z",
          "Titre": "Payment",
          "Contenu": "First of all, your phone case is really fall-proof and beautiful. However, when I placed an order and swiped my card, it kept failing. I sent an email to your customer service to solve the problem. But when I tried to order the mysterious offer again, my card swipe failed again. However, this offer is only for three hours. After sending it to you by email, the offer will be gone. I don’t know how to do..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doyle",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:58:46.000Z",
          "Titre": "The website is so so bad",
          "Contenu": "The website is so so bad. Hard to find what you’re looking for stylistically or search for the artist. Case borders/ MagSafe etc options are confusing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jaime  Barrera",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:06:49.000Z",
          "Titre": "It doesn't let me track my package"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessie M.",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T01:11:34.000Z",
          "Titre": "Expecting More",
          "Contenu": "The case on its self is a great looking case. Nothing to complain about, the issue is with the build quality. I have had this case for maybe a month and when I grab my phone it seems to always make a noise. When I removed the case the MagSafe pieces are off the case and both on the back of my phone. If I don’t re position it back into the case I will hear a squeaky sound on the back. Given the price tag of the case I would have expected a better quality build. When looking at getting it replaced the return was confusing and I just gave up. Really expected more given the price tag and other 5 star reviews."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:39:08.000Z",
          "Titre": "Long and late delivery (25 days)"
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "C.Gem",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:55:45.000Z",
          "Titre": "1110",
          "Contenu": "1. The “print style” in filter & sort was kinda confusing, and took lots of time to load when users add or remove a single tag.2. I could not find a way to quickly go through pages, nor a button to jump the top/end of a page.All in all, I had to spend anunpredictable period of time going through the pages to find the product wanted, which made the experience not so pleasant.I genuinely hope that the page can be more user friendly in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Graceann Ross",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:59:32.000Z",
          "Titre": "cute, but personalization comes off, rubber pulled away",
          "Contenu": "i do love the case and the way i can personalize it.  however, it does not hold up well.  the personalization started to peel away, but more than that, the rubber siding pulled away from the side.  i did reorder it, and they are expensive, but it does not hold up well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erin Carreon Gallegos",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T04:14:53.000Z",
          "Titre": "Untimely",
          "Contenu": "I ordered this product a week ago and have not heard anything about it at all. This case is super expensive and I am slightly frustrated in the untimely manner in which this company functions."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Xue Yee G",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T09:40:05.000Z",
          "Titre": "Too many options and pages for me to…",
          "Contenu": "Too many options and pages for me to choose the product ? Makes me more confuse and tired to even look every pages, hope could be simplify and group it into certain categories"
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "麗珠 藍",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T05:03:14.000Z",
          "Titre": "Very poor shopping experience",
          "Contenu": "The order processing time was very long, and there was no notice of shipping delays. When the goods finally arrived, one of the items was delivered in error, and the customer service on the website would not respond."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Guy fed up with the website",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T17:48:09.000Z",
          "Titre": "The lack of communication is…",
          "Contenu": "The lack of communication is frustrating yet you will send a ton of emails trying to promote your company. Don’t inform the customer at all during the whole process. Customer has to log in online to check the status of their order. Can’t stay signed in online either. Have to log in every time you go to the website. This is very aggravating. Then order says it’s shipped and gives a tracking number. Yet you check the tracking number day after day and for days it will just say the label has been created but the carrier has not received the package yet. Don’t say you shipped the item until you actually ship. That’s false advertisement. It already takes your company weeks to ship. Then an additional week order 2 to actually physically ship the item. Your company just needs to do better. 3rd time I’ve ordered from this company and the 3rd time I’ve had problems with them. My girlfriend even placed an order once and returned the case due to it not working properly and taking nearly a month to get here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Myleah Arthur",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:01:14.000Z",
          "Titre": "The ordering process was cumbersome",
          "Contenu": "The ordering process was cumbersome. Forced me to login and I could t remember my password. Very frustrating. My daughter wants this or I would have quit and ordered somewhere easier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Salvatierra",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:33:17.000Z",
          "Titre": "I don’t receive any updates about my…",
          "Contenu": "I don’t receive any updates about my cellphone case and The email they sent me doesn't work because I can't click on the track !!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T07:43:54.000Z",
          "Titre": "I never got an email with my order…",
          "Contenu": "I never got an email with my order number and tracking link/number and now I have no way to look at my order. The cases are great and this was probably just a simple mistake but it is a bit stressful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T19:11:02.000Z",
          "Titre": "Be weary of the size of your camera hole",
          "Contenu": "I ordered 2 phone cases. 1 for an iPhone 14 pro max. And I love everything about it. The other was for my sons phone. An iPhone 13. The camera hole doesn’t fit like it should. It is too small. And customer service told me that the case isn’t compatible with a camera protector. Seriously?!? His old case, an OtterBox, fits it just fine. But the one from Casetify will not fit it. And no other solution given by Casetify. They did send another case exactly the same to try and make it right. But that’s it. I offered to send the 2 cases that didn’t fit back so maybe I could receive one that actually fit. And no response to that. So I am truly disappointed with this company at this point."
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Filipa  Guerner",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:09:37.000Z",
          "Titre": "I bought the case",
          "Contenu": "I bought the case, it hasn't even been a month yet and it's already yellow… I am unsatisfied with the quality and for the price I paid, this should have better quality."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Dez Marton",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:41:11.000Z",
          "Titre": "Your store has really nice phone cases…",
          "Contenu": "Your store has really nice phone cases and covers for people that are in need for a new one. But the payment checkout is ever difficult you have to reset your page a couple of times and you get kinda annoying but over all it was a good experience"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T20:08:35.000Z",
          "Titre": "Bad customer service",
          "Contenu": "Description of items on the website is not user friendly, it should improve by organizing items better. And the shipping takes too long. In addition, it requires customers to pay for a return!Overall bad service!"
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T04:29:50.000Z",
          "Titre": "The graphic designs were superb &…",
          "Contenu": "The graphic designs were superb & fantastic, however maybe the team can look into the toughness of the product. I purchased a case design which I loved so much however the material that covers the sides/edges of the phone suddenly just slipped off & is not fit for use."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:22:54.000Z",
          "Titre": "These cases are overrated",
          "Contenu": "These cases are overrated. Backing is jusy printed on and scratches off easily. Was starting to peel within first 24hrs of use. I wouldn't bother buying again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Midge",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:29:41.000Z",
          "Titre": "I dislike that it took 4 days for you…",
          "Contenu": "I dislike that it took 4 days for you to tell me that what I ordered had been discontinued. Now that I have ordered a replacement, I trust that you will credit my account for the original order. I also expect the new item to arrive BEFORE Christmas just like the original order was supposed to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Davis",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T06:49:39.000Z",
          "Titre": "NO ACTION BUTTON, BUTTON !!",
          "Contenu": "the case is really nice and protective but for this price point it blows me away that the action button is just a cut out and not a actual button, wont be buying again, seems like a short cut for the most expensive case on the market. They also blast ther logo all over the camera ring, takes away from the art."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:30:49.000Z",
          "Titre": "Changing my Review because I finally got a response. My order number 18942799",
          "Contenu": "I am changing my review because I FINALLY heard from Casetify. I returned my phone case today by mail with their mailing label they emailed me. I now will wait to see if they come through and exchange it for the right size. If all works out I will add stars to my review. I like their phone cases, but their customer service is not very good. I hope the honor Their 100 % Satisfaction guarantee  !!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie  Harris",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T16:10:55.000Z",
          "Titre": "Would like better digital gift certificate presentation option",
          "Contenu": "Love all of the options for cases.  Very much dislike the gift certificate digital format. Very underwhelming to present to someone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beatriz Sutherland",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:50:54.000Z",
          "Titre": "I purchased an iPhone 14 Pro Max…",
          "Contenu": "I purchased an iPhone 14 Pro Max mandalorian case and it is expensive but worth my happiness with it on my phone and I also purchase a lens protector and I highly recommend everyone DO NOT TO PURCHASE a LENS PROTECTOR. Why? Expensive and not worth it.  I only had it for 2 days and the glass cracked better for my phone without a lens protector coz my case protects the lens anyway. A waste of my money for that expensive lens protector .. it’s a NO NO"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "sophie olver",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T01:33:50.000Z",
          "Titre": "Exceptional cases great designs",
          "Contenu": "Exceptional cases great designs, super strong and protective BUT buyer beware there is NO Australian return address. If you need to exchange or return you have to pay the postage to either USA or Hong Kong. On the plus side Casetify will send the exchanged good postage free. Just feel Casetify should be more open about the exchange/return issue BEFORE a purchase is made."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Armon",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T15:34:47.000Z",
          "Titre": "Great product, Awkward experience",
          "Contenu": "I love the product. I purchased one of the collab cases and camera protector and couldn't be happier. My only issue was the order took longer than originally estimated and I had to contact them before anything seemed to happen. It's possible it was a technical error, but at that point, it was fulfilled quickly."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Shin",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:28:25.000Z",
          "Titre": "Terrible customer service system.",
          "Contenu": "Customer service system is so bad. They says \"If there is any problem, contact us within 12 hours\" but after few days, they don't reply. Also there is no actual service system on their website, so mailing is unneccessary."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shirley Christiansen",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:13:05.000Z",
          "Titre": "your ordering system leaves a lot to be…",
          "Contenu": "your ordering system leaves a lot to be desired. You assume the ship to name is the one ordering. Well I am not Shirley Christiansen, I am the bill to person ordering for someone else and having it shipped to Shirley. I have received 3 emails so far all addressed to Shirley. FYI She doesn’t even have email. She just agreed to wrap it as a gift for someone else."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LT",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:29:23.000Z",
          "Titre": "Sadly, bait and switch marketing",
          "Contenu": "I loved the variety of styles but was disappointed in the lack of inventory. The $68 and $88 models all seem to be stocked but not the $52 range. I was also frustrated that I linked accounts for an extra $10 credit that I never received and was shown an opportunity for 15% discount by signing up, but didn’t get that. Feels like a lot of bait and switch marketing. However the styles and quality of the product are good, in my limited experience. I wish I could give a 4 or 5 star review, but you need to stand behind what you offer."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Viola Useini",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:29:26.000Z",
          "Titre": "In the first few weeks the quality…",
          "Contenu": "In the first few weeks the quality seemed to be remarkable, unfortunately a part of the picture on the case flaked of."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Col",
          "Nb_Reviews": 12,
          "Date": "2023-12-18T04:27:57.000Z",
          "Titre": "Not bad but not great",
          "Contenu": "Supposed to be a discount but it never materialised. Didnt get an option to send to a different postal address.  Seems likely will arrive after Christmas.  Expensive for what they are"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jacky",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:51:40.000Z",
          "Titre": "double check your order",
          "Contenu": "I placed my order, it told me the order was confirmed and would arrive in 11 days. I waited 19 days and nothing had arrived so I checked the website and turns out the order didn’t go through (despite being confirmed 11 days ago) and I had to reorder and wait another 11-19 days. While reordering, the website continually made me restart the order saying that something kept going wrong. On the bright side, I will finally have a case and screen protector for an ok price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CC",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:56:32.000Z",
          "Titre": "Good experience, but poor coupon policy",
          "Contenu": "I liked being able to choose various designs. Unfortunately, they don't allow coupons for Co-Lab products. Considering the price, this is very disappointing. I'd also like to see a discount when you buy multiple cases."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "michelle",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T09:18:29.000Z",
          "Titre": "i never received an order confirmation…",
          "Contenu": "i never received an order confirmation or tracking information. i also do not know why everytime I try to log into casetify it asks me to create a password"
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "Robert Keller",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:14:44.000Z",
          "Titre": "Beautiful design but…",
          "Contenu": "Overall beautifully designed cases but the plastic feels flimsy after just about a month of use and sadly that doesn’t really make it worth the price. I am also surprised at how extremely the case catches dust making it kind of like a dust trap and I have to constantly wipe the dust away from the case (I have dealt with many gel like cases and they never trapped dust in the way the Casetify case does)"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Gerald",
          "Nb_Reviews": 7,
          "Date": "2023-12-20T11:16:52.000Z",
          "Titre": "Putting address and card information in a bit labouring",
          "Contenu": "Putting the address and card information in was a little frustrating especially when for some reason the app moved on and when I went back I had to start again!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kris Moyer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:45:54.000Z",
          "Titre": "It offered me 10% off in exchange for…",
          "Contenu": "It offered me 10% off in exchange for my email and phone# both my texts and the email gave me links (which I used and there was no indication (code or otherwise) that I’d been given the discount. Maybe it was already discounted? No way to tell."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "maariiioon",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:01:46.000Z",
          "Titre": "delivery time is too long...",
          "Contenu": "I would make it easily known the delivery time, I ordered something for a rented house that I have had for three weeks and my order was delivered on the time that my flight was departing..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anna Harlan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:32:44.000Z",
          "Titre": "Slow to ship",
          "Contenu": "I’m wondering why it still hasn’t shipped yet? I ordered it more than two weeks before Xmas and it won’t be here in time  for Xmas. Not too happy about that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tori H.",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T06:11:48.000Z",
          "Titre": "Very expensive but satisfactory.",
          "Contenu": "I loved how cute the cases were online. It’s easy to order. But so expensive. Haven’t received the case yet but I’m sure it will be great."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Emcee",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T06:38:00.000Z",
          "Titre": "Don't get me wrong",
          "Contenu": "Don't get me wrong. The product is good, quality and design is great and as what is marketed. However, it took sometime for me to receive it. Longer than what was said to be expected date."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "Hh",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:20:53.000Z",
          "Titre": "Website development",
          "Contenu": "Website Search filters should add “price”.Also website’s ‘Apple accessories’ should add ‘screen protector’or other products you are selling. I need to go to google search ‘casetify xxx’. That is not user friendly.Also some collection can not find it in the website! I need to google and link in your website!"
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "逸凡 林",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:05:50.000Z",
          "Titre": "I don’t like the shopping experience",
          "Contenu": "I don’t like the shopping experience. Even though I’m a gold member, I still can’t automatically purchase co-branded products two days ago. The reservation URL in my mailbox can’t be linked to the reservation purchase website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maya Rutledge",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:51:22.000Z",
          "Titre": "Adhesive doesn't last",
          "Contenu": "I have a zflip 3, so it's really hard to find cute cases. I was really excited about this one because it's supposed to be secure too. However, after the first couple months, the adhesive wore out and the bottom part of the case falls of every time I pick up my phone :("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ella",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:52:25.000Z",
          "Titre": "Very easy to buy but… no order update!",
          "Contenu": "Very easy to buy! Haven’t gotten any Updates on my order! I’m getting very frustrated and worried!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nia D.",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:14:55.000Z",
          "Titre": "Check to make sure Magsafe actually works",
          "Contenu": "The case came in great condition but only after one week my magsafe portable charge would not stay on the case and charge. I purchased another magsafe incase mines was wearing out but the new one would not charge or stay connected to my phone with the case on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "meh whatever",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T13:52:50.000Z",
          "Titre": "the initial 10% discount was deception",
          "Contenu": "the initial 10% discount was deception. lame to play such tricks. cute case that my daughter wants. a bit bummed it will take so long to get here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyle Perry",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:38:16.000Z",
          "Titre": "Could not apply the 10 percent discount…",
          "Contenu": "Could not apply the 10 percent discount in the shopping cart"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Loralyn Dion  Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:06:41.000Z",
          "Titre": "I have visited the newly open casetify…",
          "Contenu": "I have visited the newly open casetify studio in Singapore (Somerset 313). And ordered 2 phone custom phone casing. At first everything was okay until to the point that the team got my orders wrong. I’ve waited for 2 hours for them to rectify the problem to also know that I was overcharged by matching my receipt and my credit card charged receipt. I ended up purchasing more during that day. The staff is polite and helpful in trying to expedite my order and even suggested to revisit the next day for collection. But I didn’t want to so I waited. I mean I don’t blame them for the screw up. I am okay but specifically one girl staff I don’t really like. She is rude, shows no respect to customer and even her colleagues. My friend also visited your store the very next day to place an order on my behalf and was served by her, she brushed off my friend and just tell him off that the design he requested is not available and there is no more stock for the item. In a very rude manner “THIS ONE DONT HAVE, THAT ONE ALSO DONT HAVE”, and just walk away. She’s the lady with a very big glasses and ducked face. I feel that even though it’s very busy at the store and there’s many customers to serve, basic customer service has to apply, talk nicely by all means. By talking nicely with rejection is still acceptable. I do not know why you guys hire such person with such bad attitude and rude customer service. Or maybe she doesn’t like the job. I’m a fan for casetify and I purchased many from Thailand without a membership registration, even though is very busy in Thailand but the politeness is there. Not saying your team is bad in SG. But that girl is rudddeeee to the max. I will not forget her and I won’t want to be served by her ever again. Thank you for your time"
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Jung hwan Shin",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T09:18:31.000Z",
          "Titre": "I had been ordered my iphone and my…",
          "Contenu": "I had been ordered my iphone and my wife’s cases by apple pay payment on 7th Nov. But there was not found my orders in the website and raised issue but not received any reply from company during 1 month. Now contact the CS team and resolved issue but the system need to improve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Penny Skelnik",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:24:34.000Z",
          "Titre": "The website wasn’t as user friendly for…",
          "Contenu": "The website wasn’t as user friendly for someone that is technology challenged. I did manage but it was frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:13:02.000Z",
          "Titre": "False advertising",
          "Contenu": "False advertising. I ordered a case that has artwork on the back. The photo of the case on the website showed a vibrant image on the back of the case. The colors on the actual case look like they could have been printed on my cheap home printer. The back is also exposed, so it feels like a cheap laminate kitchen counter. You receive an order confirmation, but no shipping notification or tracking emails. The case protection feels pretty standard with other less expensive cases. The case also makes my phone feel a lot heavier. For the price they sell their items, I would expect a better product and better communication."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aubrie",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:22:22.000Z",
          "Titre": "The company can improve on shipment…",
          "Contenu": "The company can improve on shipment time, it takes a very long time to arrive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "chaya",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:53:40.000Z",
          "Titre": "Breaks too quick",
          "Contenu": "I like the phone cases, they protect very well, but then the sides start ripping off and for the price that shouldn’t be happening"
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Arnon Sri",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T15:33:07.000Z",
          "Titre": "16 days",
          "Contenu": "I had confirm my ordered on 18 Nov 2023 and when I track my order in the system. They notice my order is ‘Pending production’ and estimated the delivery date is between on 1-13 Dec 2023.By the way, I had track my order but the system isn’t work.So, I sent my message via the facebook messenger. The customer service reply me and  they send mail to me and request me to reply them to confirm my order 5-6 times.Finally, I had received my order on 4 Dec 2023. The products are  very beautiful and well quality also the packaging. But please improve the AI or automatic reply mail system.Thank you the customer service team."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "DyLa QueeN",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:06:26.000Z",
          "Titre": "Any problem in production??i had place…",
          "Contenu": "Any problem in production??i had place order 21 Nov but why when i check on track is still \"PENDING PRODUCTION\"??Now almost more 2 weeks ago i'm waiting for the pricey case??please improve you service of production.i still give the 3⭐️because your CS good to treat me by email.there are said my estimated arrive around 1Dec - 8Dec.i dont think you can only take 2days for shipping up to me in Asia right?please take serious for this.check your email.anyway i'm really feel disspointed with casetify service right now.Order Number : #18631513"
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "佳芸 郭",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T08:41:19.000Z",
          "Titre": "feel bad",
          "Contenu": "I bought it and used it for a month, and the silicone around the shell turned black. The price shouldn't be of this quality, and it can't be wiped off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Argo",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:52:20.000Z",
          "Titre": "I wish they would make mirror cases for…",
          "Contenu": "I wish they would make mirror cases for the Pixel line up. Also the Paypal option does not work which is a bummer. I dislike putting in my credit card info."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:12:00.000Z",
          "Titre": "I don’t know why but it didn’t accept…",
          "Contenu": "I don’t know why but it didn’t accept my discover card nor my paypal. And it was very hard to look for an exact thing. Search tools can be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "April  Frost",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T07:05:40.000Z",
          "Titre": "Frustrated because the order said…",
          "Contenu": "Frustrated because the order said delivery before Christmas and now the only email I have received says a different date possibly after Christmas:("
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "Yan Chak Chong",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T12:16:35.000Z",
          "Titre": "Product availability and time of…",
          "Contenu": "Product availability and time of delivery. Also, the website is not user friendly"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Varsha",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T12:37:39.000Z",
          "Titre": "The phone case itself is amazing in…",
          "Contenu": "The phone case itself is amazing in printed quality but the top and bottom of cover opened up from.wear and tear, I literally bought this phone case last month and it's already coming apart. On the folded part it opened up from both on top and the bottom."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juanita Safi",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:39:31.000Z",
          "Titre": "Prices for your items are ridiculously…",
          "Contenu": "Prices for your items are ridiculously high. I’ve bought one of your cases for my daughter and while the quality is good, it’s not worth the amount you charge for it. I would never buy again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dianne Buckel",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:05:57.000Z",
          "Titre": "It appears that the adhesive for the…",
          "Contenu": "It appears that the adhesive for the pattern on the case wasn’t applied properly. It looks like I could just peel it off. I’m hoping it will last since it was quite expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stefanie Baker",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:05:53.000Z",
          "Titre": "I really would have like to paid for…",
          "Contenu": "I really would have like to paid for shipping to receive by Christmas."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Soo",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T18:17:58.000Z",
          "Titre": "Cool designs but",
          "Contenu": "Cool designsQuite priceyMarketing with influencers contradicts with casetify's external philosophy \"eco friendly\". Feel llike (want to sell more) but still (we want to save earth) don't match up"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Snoopy",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:01:28.000Z",
          "Titre": "Cheap print",
          "Contenu": "The case has the design printed on, it’s not a resin design as expected…so it looks cheap and the print makes the case very slippery to hold. Otherwise, it’s a case that protects the phone, so that’s a positive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karla Renteria",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:38:19.000Z",
          "Titre": "Discount didn’t work",
          "Contenu": "I got to my nerves that I never got the 10% off of subscribing."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "김 민서",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T23:54:20.000Z",
          "Titre": "too much like a mirror",
          "Contenu": "I ordered the mirrored case. The reason why I bought it was to use both as a case and as a mirror. But I didn't want just a mirror but one with some cute design on it so that it's not too obvious that I am carrying a mirror case. However, on this case, the design is so small that the mirror is too obvious and am afraid of getting scratches on the surface."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "Dan Chan",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T06:40:12.000Z",
          "Titre": "Online Payment system has problem!",
          "Contenu": "Case is good quality.But suggest promotions should cover limited versions even smaller discount is also good enough.The online payment system does not work for AE card. It shows \"cannot verify credit card information\" and kept asking me to verify shipping and billing address and retry. But it never works no matter in mobile or pc, forcing me to use master card to pay, but with the exactly same shipping & billing address! It's disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pornrumpa Taluengchit",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T07:41:53.000Z",
          "Titre": "I order 4 times and I have to pay tax…",
          "Contenu": "I order 4 times and I have to pay tax as you sent through thailand post and tax is following original price not discount one I had. Why noy using same courier to avoid this for customer. I ALWAYS thought this included all taxes about shipping. Npw, my 2 new cases are way expensive!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Nikki Zee",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T00:36:06.000Z",
          "Titre": "Sign up failure",
          "Contenu": "In the sign up, the month of birthday calendar is broken, which causes sign up failure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jillian  Knott",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T08:46:24.000Z",
          "Titre": "Just ordered my second case from this…",
          "Contenu": "Just ordered my second case from this company.. it’s super pretty and I like the way it looks however, after just a couple weeks of use it’s is already scratched. I got the mirrored case. The first case I ordered was the mirrored with the snake design on it, that’s phone broke tho and I was forced to get a new phone .. so naturally needed a new case. Love the quality, just wish I would have purchased the mirrored style WITH a design as it helps to minimize the scratches."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mimi T.",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:49:30.000Z",
          "Titre": "Love the design and the ability to prop…",
          "Contenu": "Love the design and the ability to prop my phone; however, the case makes the phone heavier (I’ve had cases that made the phone feel lighter) and the material doesn’t create grip, so easy to slip off my hands."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T22:52:19.000Z",
          "Titre": "I was offered 10% off my first purchase…",
          "Contenu": "I was offered 10% off my first purchase after I made my first purchase. This does not add up to me!"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Guydehandtschutter",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T16:28:10.000Z",
          "Titre": "Pending production",
          "Contenu": "Bought a new Iphone and wanted to protect it with a good quality cover. Found one at Castify and placed my order. Only to find out afterwards that this particular item was \"pending production\". If I had known in advance that this particular cover was out of stock I probably would have bought a different one.Now I still need to find another cover in orde to protect my iPhone while I'm waiting for them to start production again. What a waste of money! They could have let me know this when ordering this item. Not after paying for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wan Ting Tan",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:20:59.000Z",
          "Titre": "The quality of castify was poor.",
          "Contenu": "I really hope I can upload photo for my and my husband castify condition. It only the photos show then you all can understand how bad is the quality are.The quality not what we expected. My husband's iPhone castify case only used for 11 months. And the 2 sided of the case peeling and wearing off.And mine samsung case used for 1years and 7months.It happened the same.Yes,I'm still buying the casetify case ,coz they really nice in design."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CS",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:01:39.000Z",
          "Titre": "Never heard anything after I ordered",
          "Contenu": "Never heard anything after I ordered. It’s been a week. Can’t look up order by order number. Can’t speak to customer service in person. It’s frustrating. You have my money and there’s no communication at all. Giving 3 stars hoping the case itself, whenever it gets here, will be worth the higher rating."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Holly Walker",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:45:35.000Z",
          "Titre": "Hmmm….🤨",
          "Contenu": "You guys didn’t give me the 10% discount 😭 but otherwise very good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cristo Lucero",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:53:36.000Z",
          "Titre": "Can you not sign me out…",
          "Contenu": "Can you have your app not sign me out everytime I get back on. I didn’t get to purchase it on my account when that was the whole purpose."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greenwood",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:30:26.000Z",
          "Titre": "I signed up for a discount and it was…",
          "Contenu": "I signed up for a discount and it was not given at checkout like it said."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Wipawee Apiratanachai",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:54:31.000Z",
          "Titre": "Air tag case looks cute but Iphone case has a little yellowish till the first day of opening",
          "Contenu": "Air tag case looks cute. Iphone case is so suitable to the my night sky iphone(black one) but the plastic looks  a bit yellowish."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shannon Usberghi",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T14:35:23.000Z",
          "Titre": "Be sure before you order, because it's difficult to use the 100% guarantee to return or cancel",
          "Contenu": "Love the design options.Hate the difficulty of returns/exchanges/cancelation. I also wish it were easier to zoom in on the details of the designs."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Vaj Ibay",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T06:47:56.000Z",
          "Titre": "the case was fine except for one thing",
          "Contenu": "the case was fine except for one thing. upon unboxing, there was a bit of whitish discoloration around the camera ring where the branding is. quality checking could still improve."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet  Mendez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:11:40.000Z",
          "Titre": "They changed the date it was supposed…",
          "Contenu": "They changed the date it was supposed to be delivered."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "영애 김",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T08:32:51.000Z",
          "Titre": "I like the case, but I get a problem with the strap every time.",
          "Contenu": "I like the cell phone case, but I get a problem with the strap every time. Last time, the pendant of the strap fell off, so I received a new product.This time, the strap seemed defective, so I left an exchange inquiry. However, I received a reply saying, \"This product is handmade, so it's not defective.\""
        },
        {
          "Note": 3,
          "Lieu": "OM",
          "Pseudo": "Aisha Harthy",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T10:03:23.000Z",
          "Titre": "I thought the shipping would be free…",
          "Contenu": "I thought the shipping would be free since it says free shipping on orders above $40"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Qi Zhang",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:26:39.000Z",
          "Titre": "It takes too long to receive the items…",
          "Contenu": "It takes too long to receive the items i purchase from the website."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "QH",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T10:18:17.000Z",
          "Titre": "You guys need to see this, Seriously",
          "Contenu": "Too high price and limited methods to purchase"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelbey Wright-Penner",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T03:15:45.000Z",
          "Titre": "The website was super difficult to…",
          "Contenu": "The website was super difficult to search on. You have to be too specific and if you misspell or slightly change the name of what you're searching for, chances are it won't show anything at all. I would buy more if the site was intuitive at all in regards to searching."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ms N J Butler",
          "Nb_Reviews": 17,
          "Date": "2023-11-16T22:04:40.000Z",
          "Titre": "Overpriced, subpar printing quality, and misleading descriptions",
          "Contenu": "The products are very overpriced for the quality, especially the print quality. I ordered a watch strap and a phone case; the print on the watch strap was off-centre and misaligned, and the phone case print was described as \"iridescent\" and shown in the image on the website as very bright and sparkly when in fact it was a print made up of a couple of flat colours that have absolutely no iridescence or sparkle to them at all. £61 is an extremely high price to pay for quality this subpar."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Belinda Mcnulty",
          "Nb_Reviews": 13,
          "Date": "2023-11-22T12:41:01.000Z",
          "Titre": "I liked the ease of using the…",
          "Contenu": "I liked the ease of using the purchasing site and the selection of items available, however I’m not liking the amount of time between purchase and shipping as communication is key. I just don’t like not being informed as to when I should expect my purchase to arrive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LilyAnne Leininger",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T23:35:15.000Z",
          "Titre": "Good at phone cases, just okay at other products",
          "Contenu": "This was my first purchase with Casetify. I ordered a phone case, a camera lens protector, and their kickstand wallet. Getting my items to ship took a very long time and then when it did ship, the package was lost for a week. Luckily Casetify helped find my package once I brought up the issue. When trying to contact Casetify for support, their box to describe your problem has a tiny character limit. I loved the case (10/10) I got and if I need a new one I would order again, but I would NOT order any other item. The lens protector (0/10) I received was not sticky enough to adhere to my phone so it was a total waste of money. The kickstand wallet (6/10) works best without any cards in the wallet, and the design does not look as well as it was advertised."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Tahlani Rand",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T13:13:27.000Z",
          "Titre": "No info",
          "Contenu": "All the power banks were sold out. No info on when they’d be restocked.Some phone cases just weren’t available for whatever reason, there’s was nothing to clarify why they weren’t available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "El p",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:20:44.000Z",
          "Titre": "Lil bait n’ switchy",
          "Contenu": "Well polished site. Not offering discounts on “new” product is a little bait and switchy. Price point is higher than the value I personally put in a phone case and if I didn’t have this requested for a gift I wouldn’t have purchased it otherwise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janice Kramer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:47:58.000Z",
          "Titre": "I signed up for 10% off and didn’t get…",
          "Contenu": "I signed up for 10% off and didn’t get it. I didn’t see a code to use. Otherwise OKMaybe you can still give me the discount. I gave you info for thst.Janice Kramer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jean Abuan",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:31:25.000Z",
          "Titre": "Where’s my tracking order",
          "Contenu": "Where’s my tracking order? Did not receive a confirmation email. Been waiting for my package but is it going to the mailbox or coming from a courier. Having difficulty looking it up with my order # too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caché Falls",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T08:53:45.000Z",
          "Titre": "I really like Casetify & I don’t have…",
          "Contenu": "I really like Casetify & I don’t have to many problems with them I just wish we could get a restock on the impact MagSafe iPhone 14 Pro Max case."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Fiorenza Coda",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:31:00.000Z",
          "Titre": "It was supposed to be free the shipping…",
          "Contenu": "It was supposed to be free the shipping since is +40usd, but it charge me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Vander Meer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:03:34.000Z",
          "Titre": "Okay",
          "Contenu": "Tracking the order was bad"
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "YY Shiu",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T06:38:22.000Z",
          "Titre": "The magnet holder lost within a week",
          "Contenu": "The magnet holder lost within a week, I believe it can’t be stick tight and safety on the phone hence it’s loose and dropped somewhere unexpectedly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lee Ann Ng",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T05:49:46.000Z",
          "Titre": "Print is peeling off",
          "Contenu": "Have been using this case for about a month now. However I am noticing that the print on the case is slowly peeling off. I think purchasing a clear case or a print that fully covers the back of the case would be a better option."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jun Park",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T08:59:11.000Z",
          "Titre": "I liked toy story one that I order…",
          "Contenu": "I liked toy story one that I order however dragon and tiger image is not centralized and also printing quality is pretty poor that I feel like there is dust on my case"
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "xu zheng-yi",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:45:38.000Z",
          "Titre": "Delivery time is too long"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danielle U.",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T10:13:09.000Z",
          "Titre": "I expected longevity",
          "Contenu": "I had always seen great reviews and ads for Casetify. Spent $82 on a nice upgraded case with extra protection and a lovely design. Had the case for 8 1/2 months. The edges of the case have broken apart from the back on 2 sides. So just waiting for that accident to happen until I can get another case. Of course I no longer have my OG case bcuz I thought this one would last for as long as I had the phone. Sooo I’m pretty bummed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adrianne  Roletto",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T06:54:52.000Z",
          "Titre": "I was confused",
          "Contenu": "I was confused. I had to enter my charge card info three times, twice for Klarna and once for CASETiFY, and that felt off.  I’m hoping I only receive one case as that’s all I was ordering."
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "Pei Jen Lin",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T09:18:33.000Z",
          "Titre": "Took longer then they said",
          "Contenu": "Good quality, pattern well designed, I love the artist’s work!"
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "상아 강",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:18:56.000Z",
          "Titre": "too expensive",
          "Contenu": "too expensive! and heavy"
        },
        {
          "Note": 3,
          "Lieu": "BN",
          "Pseudo": "MHZA",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T07:59:22.000Z",
          "Titre": "Inside Parts but it’s more like Sticker Back",
          "Contenu": "I bought the Casetify Inside Part for my 11 Pro Max last time, pictured it was looking great but upon received it, I was so dosmay with the quality, it looks cheap & poorly made, just a printed sticker or some sort at the back!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Natalie Le",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T10:07:43.000Z",
          "Titre": "My case is really fragile for the price…",
          "Contenu": "My case is really fragile for the price range. I suggest buying a more reasonable case. It broke in the first month"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Valeria",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T05:17:41.000Z",
          "Titre": "So so",
          "Contenu": "Firstly, I didn't know that standard shipping took a long time. My order took more than a month. To do it well, but the color of the watch strap is not faithful to the image, the color looks different and I don't like that... :/"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Joyce Ho Finance Department",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T08:52:42.000Z",
          "Titre": "Strap Cards not avaiy",
          "Contenu": "strap cards are not available to sell without buying the strap. This made me a bit upset as I usually easily lost the strap cards. Wish CASETiFY sell it separately!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Dionne Lister",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T00:21:54.000Z",
          "Titre": "Product looks good but shipping is ridiculous",
          "Contenu": "The case looks good but the standard shipping is ridiculous 11-18 days to get to Australia unless you want to pay an extra $50. What a rip off. Hopefully I won't drop my phone in between now and when it arrives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adriana  Campos",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:32:53.000Z",
          "Titre": "It was easy but expensive"
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "Dora Dima Panopoulou",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T07:07:53.000Z",
          "Titre": "Simplify the order process it’s a nightmare",
          "Contenu": "The products are good. The website is a mess you can not find something you need even jf your life depends on this. Too complicated for no reason every time i searched iphone 15 case it gave me as a first result one with snakes. Who the f… wants snakes? Randomize the results. The expiring codes every 6 hours it’s a joke and  bad marketing. I had to renew my basket every 6 hours and spent one hour to find what i need. Your support weird last time someone random replied like AI,  this time 2 emails never answered. I am a very old customer. Your cases are good but we bought them like 50€. Believe me when i say your product do not deserve 115€. The last two cases within 2022  fall apart in 8 months the side rubber did not have enough glue."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Pravit Tangsuttivong",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:47:13.000Z",
          "Titre": "I think your customization service is…",
          "Contenu": "I think your customization service is great but I hope in the future you can add more fonts, colors and be able to add emojis or symbols. And most importantly, the various positions in the blank image are not as they should be. I had to edit the image several times to make it match your misplaced box. And I would like to add that Font should be resized. Because if you put in just 1-2 letters, it will be very big. Some people like it small. and can be placed in any position I understand adding these things to the system is not easy. But I hope to gradually improve and perfect it in the future. Thank you. Your product is really great and I like it."
        },
        {
          "Note": 4,
          "Lieu": "MV",
          "Pseudo": "Naina Iqbal",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:57:36.000Z",
          "Titre": "Worth the hype and cost",
          "Contenu": "I've had a couple of Casetify covers, and they've all been great. But particularly one of the ultra-impact cases, I used it continuously without changing for a year. My phone falls all the time (I'm clumsy like that), so it's very important to have a cover that protects my phone well, and it sure does the job. With all its mishaps, it survived for 1 and a half years. I just received my new case. And I intend to use this one for as long or more! It's worth the investment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Hull",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:56:40.000Z",
          "Titre": "Great case, some designs scratch off",
          "Contenu": "I like the product but I have one complaint and one wish. I have previously had two cases, both were “Beautiful Planet” and within a short amount of time the animals would come off in pieces, always the horse ears first. It’s a bit annoying with how pricey the cases are. The wish is that some of the designs came in different colors. Like the new cheetah design is all pink and it would be nice to have other options. I love my case, and it has saved my phone quite a few times."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Therese Chan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:51:50.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, but online navigation not instinctive. There should be an ability to order more or go back to editing an item in the cart."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Mobbs",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T08:50:51.000Z",
          "Titre": "Bounce…forward 👍",
          "Contenu": "Finally settled on a customized Bounce Case; clear. I would have liked a few more font & color choices, which is the only thing keeping you all from getting a solid 5 stars; if I could give you 4.5/5, I would have; overall I am pleased. I am confident I’ve just purchased to best protection for my 15 Pro Max.  That said - just want to mention that my timing for being turned on to your brand, via Flossy Carter, is uncanny -  as I placed this order, knowing that Casetify is responsible for theft of IP/teardown design by a well established YouTuber.  I hope Mgt will take this issue by the horns & absolutely own their f*ckup.  Owning one’s f*ckup is becoming more and more rare.  So by getting ahead of this storm, owning it, apologizing & paying whoever needs to be paid, and moving forward is exactly what I hope you all do….I want to be a loyal customer for years to come….Ron MobbsHouston, TX"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haley Erazmus",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:10:17.000Z",
          "Titre": "I love all the products you offer and…",
          "Contenu": "I love all the products you offer and it’s easy to use your mobile website. The case I got well over two years ago was perfect until the sides started coming off the back. Which is why I now was looking for a new one. My only issue was problems with the Apple Pay at checkout, otherwise the whole process went smoothly once I changed to PayPal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Belly",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:10:40.000Z",
          "Titre": "Email",
          "Contenu": "Everything is amazing. I love that I can make my own phone case but the reason I gave it a 4 was because I couldn't find where to switch my emails because I am trying to switch all the stuff I use that are personal to my personal email."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sidney R",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T01:33:32.000Z",
          "Titre": "I love casetify cases generally",
          "Contenu": "I love casetify cases generally, but the back of their clear cases just scratch SO quickly and it’s really noticeable especially on the dark colour iPhones. That’s the only thing I wish they would work on, otherwise love them."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "CHENG LIN LEE",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:17:57.000Z",
          "Titre": "Took quite a while for them to ship the…",
          "Contenu": "Took quite a while for them to ship the item even with expedited shipping. The packing lacks protection, which leads to some dents and damage to the box. Other that that everything works just fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Villalobos",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T21:42:20.000Z",
          "Titre": "Selection is what keeps me coming back…",
          "Contenu": "Selection is what keeps me coming back to your website. Ease of use on your website has taken me several uses to adjust to. I use the back button a lot and it seemed that using it would take you back to the beginning. When I used it this time, it seemed to take me back to the beginning of the page I was looking at. So, better. I like that Casetify categorizes according to device type and that they show the two types of each product. Prices are high but seem to be based on quality. I recently bought a high priced computer so I was looking for high quality and protectiveness. Both I have found in a previously purchased Casetify Iphone case. Because I have a tendency to drop everything, I am excited about the case with protective corners. I am happy to be able to afford Casetify and am excited to receive my new case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PLM",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:45:39.000Z",
          "Titre": "daughter sent color she wanted",
          "Contenu": "daughter sent color she wanted. Confusing though, with color options.  Was trim color …. Wasn’t clarified anywhere.   Took couple hrs of texting for us to understand ea other.   Blue toile was background.    She sent exact pic of which black trimI thought we were getting black colored case.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Dominik Lis",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T08:52:32.000Z",
          "Titre": "Easy and intuitive ordering system, improve searching",
          "Contenu": "Easy and intuitive ordering system. Minus for messed up search engine - even browsing all case prints I've found later more other offers, had to search entire shop via keywords"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T04:40:37.000Z",
          "Titre": "Love it!",
          "Contenu": "A lot of compliments on the casing and lanyards. The delivery takes a few weeks and very minimal updates given."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Urmila McClure",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:16:09.000Z",
          "Titre": "First time purchasing from Casetify",
          "Contenu": "First time purchasing from Casetify.  I was a little hesitant at first but my daughters were raving about the good reviews and cute phone case prints.  Decided to give a try and purchased 3 cases.  However needed to return one to replace with another since my daughter bought a different phone from what she had originally planned.  Since there was no contact phone number for casetify it was all done through email back and forth.  It went smoothly and now just waiting for case to arrive.Quality of case is top notch and lots of great prints to choose from.  Only reason I took one star off is the shipping time takes rather long.  Also the back and forth email is time consuming rather than being able to speak with someone on phone.  Otherwise I would definitely shop from them again, I love my cases and great quality."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Mel",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:25:41.000Z",
          "Titre": "Product quality is good",
          "Contenu": "Product quality is good. Should improve on delivery time as it takes more than 10 days to receive a Colab casetify case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Chan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:14:56.000Z",
          "Titre": "The site was a bit confusing",
          "Contenu": "The site was a bit confusing, I could’ve swore I was ordering a case for the 15 Pro and I checked my order summary and it ended up being for the 15 Pro Max. I made sure I was in the 15 Pro tab and I guess while I was viewing the item I accidentally selected 15 pro max on the drop down menu. Overall like the products almost too many to choose from."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Henry Lee",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T00:47:08.000Z",
          "Titre": "Cannot use my cash points",
          "Contenu": "The purchasing experience is not bad. However, my cash point cannot be used as the price of the case is not met your requirement. I feel disappointed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "澤達 鄧",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T05:14:28.000Z",
          "Titre": "To buy the Casetify",
          "Contenu": "The product is very good, and the eeling of hand is quite good. However, the price is a little bit high and the process for producing the product is quite long."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Ruby Tseng",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T06:23:15.000Z",
          "Titre": "please keep selling the case for iphone…",
          "Contenu": "please keep selling the case for iphone SE and 8 for these previous versions, if there is still available stock, thanks."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ronan Stephens",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T08:16:53.000Z",
          "Titre": "I dont Know",
          "Contenu": "You had good prices and finding the case that I wanted was easy to find, however choosing the colour of the case was a little dodgy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T23:21:16.000Z",
          "Titre": "Case selection and browsing/filtering…",
          "Contenu": "Case selection and browsing/filtering is great. Shipping speeds are ridiculously slow, why?!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Zachary Alcorn",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:57:32.000Z",
          "Titre": "Great quality.",
          "Contenu": "All out great experience. It was really hard to pick one case I liked, there’s so many cool designs"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "재승 이",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:14:57.000Z",
          "Titre": "co-lab collaborate is good",
          "Contenu": "casetify's collaborate choice is very good. It has very wide range for many targets. but one thing is not good is its high price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T18:37:17.000Z",
          "Titre": "The material and quality of the laptop…",
          "Contenu": "The material and quality of the laptop cover I purchased is worth the price. The only drawback is that the white color of the cover shows my fingerprints. I often find myself learning it a lot. If I could go back and get a dark colored cover, I would do that."
        },
        {
          "Note": 4,
          "Lieu": "MC",
          "Pseudo": "Andrea Gonçalves",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T09:12:25.000Z",
          "Titre": "Black kingsnake iphone case",
          "Contenu": "It's perfect, as beautiful as the picture on the website.I put one star down because I had to pay customs for receiving my package and I wasn't aware of that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:47:07.000Z",
          "Titre": "This is a gift",
          "Contenu": "This is a gift. You did not give options for gifts. Other than that, you did great. What my daughter in law wanted was easily found and purchased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randi Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:44:07.000Z",
          "Titre": "I was unable to apply a promo code for…",
          "Contenu": "I was unable to apply a promo code for first time customer even though I signed up and provided my info.  Never recv’d a code.  Just hoping the item arrives on time!  Thank You!"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:47:06.000Z",
          "Titre": "Overall purchase is easy but delivery…",
          "Contenu": "Overall purchase is easy but delivery abit slow take 2 weeks .."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Kate Cunningham",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T05:48:14.000Z",
          "Titre": "Great customer service",
          "Contenu": "Very quick delivery, did have a problem with the phone case and the design falling off it but they got back to my complaint promptly and sent me a new one free of charge"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mk",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:58:08.000Z",
          "Titre": "I got a email for 10% off a 1st…",
          "Contenu": "I got a email for 10% off a 1st purchase after I made the purchase. That's frustrating! But I like all the choices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gina Bell",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:55:20.000Z",
          "Titre": "My experience was very good",
          "Contenu": "My experience was very good.  The only thing I would have changed was knowing when to expect delivery"
        },
        {
          "Note": 4,
          "Lieu": "MU",
          "Pseudo": "Cynthia Beesoo",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:04:35.000Z",
          "Titre": "Very pleasing to the eye",
          "Contenu": "Love the product very pleasing to the eye and it is made of recycle materials."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Faust",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T07:30:35.000Z",
          "Titre": "Everything was easy to get to except…",
          "Contenu": "Everything was easy to get to except you don’t tell me when to expect delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:04:44.000Z",
          "Titre": "There aren’t many options for the Ultra…",
          "Contenu": "There aren’t many options for the Ultra Impact case for the iPhone 11. When buying one case the Black Friday deal is useless because it just covers shipping, it’d be nicer if you got free shipping based off the subtotal."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "湘淳 陳",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:29:16.000Z",
          "Titre": "The back of the case is too smooth",
          "Contenu": "The back of the case is too smooth, sometimes it will slide down from the chair or table (where isn't flat)"
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Ciupu Rebeca",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:45:36.000Z",
          "Titre": "The experience was very pleasant but I…",
          "Contenu": "The experience was very pleasant but I would loved to see some photos of the products in the reviews."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynda Cross",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:54:53.000Z",
          "Titre": "Wrist Strap",
          "Contenu": "The only reason I gave 5 stats is because of the price. It's expensive for what it.is."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "YEOH CK",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:11:51.000Z",
          "Titre": "Alot of case not available to select."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "GM",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T13:03:33.000Z",
          "Titre": "Good design",
          "Contenu": "Good design. Fits phone perfectly. Buttons feel sturdy, durable and easy to use. Easy access to the side mute button."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "찬 박",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:35:45.000Z",
          "Titre": "services are good",
          "Contenu": "I had a faulty airpod case but Casetify found out it was faulty and sent me a fixed one. Quick and good service from them."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Ai",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T03:56:10.000Z",
          "Titre": "The packaging should be improved",
          "Contenu": "My parcels looked like compression. Luckily that products were safe but it couldn’t be a gift for anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter S",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:56:43.000Z",
          "Titre": "Pleasantly surprised",
          "Contenu": "Pleasantly surprised, wasn’t exactly sure what to expect. Purchasing was very easy. Shipping was quick. I’d would prefer a little more grippy on the sides but overall very happy with the purchase looks great. Fits very well. The clear version definitely complements the look of the new iPhone titanium. would definitely consider purchasing another one when I get another phone in the future."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Steve Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T13:34:26.000Z",
          "Titre": "Very happy with the product offerings",
          "Contenu": "Very happy with the product offerings, the sale prices are great too. I’ve deducted one star because for some reason all green cases appear to be unavailable at sale prices :-( green was what I came for but choose orange do get the financial benefit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fidel",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T17:17:12.000Z",
          "Titre": "The four stars are",
          "Contenu": "I like the product selections also the bundling, and the dynamic updates that you see in real-time of what exactly you're purchasing. I like that the order selection boxes at check are filled with suggestions of other items you may need along with your main purchase.The four stars are not because I think the website or services rendered are subpar, it was actually the opposite, the experience was excellent. Straight to the product, point and click, and you're ready to check out. What that said, there's always room for improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alissa B",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T10:24:21.000Z",
          "Titre": "Good Quality!",
          "Contenu": "Everything arrived perfectly. My screen protector cracked quickly and I'm not thrilled about needing to buy another one at that price already, so I will probably buy from another brand. But it did do its job and kept my screen from cracking. I'm worried that the case detail being on the outside will lead to it wearing off but so far so good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wei",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T19:31:54.000Z",
          "Titre": "Nice, expensive, and slow shipping",
          "Contenu": "Nice but expensive, not entirely sure if it's worth the price...shipping was super slow"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sonia Caruso",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:02:34.000Z",
          "Titre": "I really like the case it's nice",
          "Contenu": "I really like the case it's nice. I do wish that the back was the same sort of translucent color as the front. I think it would've been nicer. I also do think that the cost of cases are pretty expensive. I can't imagine it cost all that much to make the cases so I do think the price is a little. I was willing to pay for protection of my phone so hopefully it does its job well. I do wish they had different stand options on the phone cases as only some of them have stands while others don't. And again for the price they should all have a stand."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Sheng",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:43:27.000Z",
          "Titre": "It costs a while from overseas than I…",
          "Contenu": "It costs a while from overseas than I expected."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:34:28.000Z",
          "Titre": "Respond quickly and really can solve problems",
          "Contenu": "I found not perfect of my case, and request for new one. Casetify solve it for me"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Sabina Glas",
          "Nb_Reviews": 7,
          "Date": "2023-12-16T07:25:43.000Z",
          "Titre": "Our whole family loves your product.",
          "Contenu": "Our whole family loves your product.Your website can sometimes be a hazzle."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "동휘 김",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:30:22.000Z",
          "Titre": "Collaborating with who interesting designer",
          "Contenu": "Collaborating with designerbut i want 1. Set the bumper(side of case)'s color to black2. Also i want 'no transparent background designbut almost developer think that iPhone Users want transparent..and slim casebut i'm not.I prefer ultra Impact bumper case and matte black but there isn't exist"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Uliea",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T03:36:42.000Z",
          "Titre": "There are certainly many choices",
          "Contenu": "There are certainly many choices, but now I have a phone on the way and it says my case order is “pending production”.  With a 14 day window to return my old phone, that is a bit scary because I want to put the screen protector and case on when the phone is new. Also when looking at the website on my iPhone, I’d rather have more load at one time because the “next screen” button didn’t always work. And when I clicked on one for a closer look, it would take me back to the top of the page."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "nathawut",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:47:25.000Z",
          "Titre": "The printed layer chipped out a bit…",
          "Contenu": "The printed layer chipped out a bit after few day of use maybe due to some scratch. Good quality tho."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "ppoq",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T04:26:16.000Z",
          "Titre": "I love but problem to cancel my order",
          "Contenu": "I love it.But i have the only one uncomfortable thing that there is no customer service number.I had ordered few things but i forgot something. At that time i needed to cancel my order and re-order the things but i couldn’t because you didn’t have any customer sevice which is contacting immediately.Your text/email conversation method takes too much time to cancel my order immediately."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Shan",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T05:32:53.000Z",
          "Titre": "this was my 2nd purchase",
          "Contenu": "this was my 2nd purchase from their website. i dont know why, but my oder took almost 10 days to finally be shipped. But their customer service quickly offer refund of the shipping cost as compensation of such inconvenience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "鏗 陳",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:55:36.000Z",
          "Titre": "The product design is really nice",
          "Contenu": "The product design is really nice, but the frames of the last few purchases have quickly come off."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Orapan K.",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T08:46:25.000Z",
          "Titre": "Your case is so unique and I love it so…",
          "Contenu": "Your case is so unique and I love it so much. For the custom option is so wonderful but I give 4 stars because some Co-Lab none for Iphone 15 plus example bounce case Co-Lab with The PowerPub Girl. My main purpose is I hope there will be the same patterns and products in every model."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Casetify fan",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T13:49:54.000Z",
          "Titre": "Love the selections….",
          "Contenu": "Love the selections but don’t like it when I added something into my shopping cart and wanted to go back to the previous page I was on and the system didn’t allow me to do so. Would be much more convenient if you could add a ‘continue shopping’ button on the shopping cart page. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Archuleta",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:48:38.000Z",
          "Titre": "It said there was stock until I placed…",
          "Contenu": "I used the promo code I was supposed to and it gave me nothing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amy C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T22:16:33.000Z",
          "Titre": "I’m pretty excited but frustrated",
          "Contenu": "I’m pretty excited for my order, but just confused about the whole tracking system. I read the reviews and I guess I need to write a reviews. A little bit frustrated but hopefully my orders comes soon. Overall, just excited for my new case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reagan",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:02:39.000Z",
          "Titre": "Casetify",
          "Contenu": "I really like this phone case, but I had to order a new one because the old one I had broke on the sides after about a year of use, which is pretty good. I think the designs are really cute and well made :) just a little bit hard to navigate the website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Persephone",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T15:48:24.000Z",
          "Titre": "Always great cases",
          "Contenu": "Always great cases. Customer service could probably use some work, my experience was not super helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arianna",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:15:37.000Z",
          "Titre": "Easy selection",
          "Contenu": "Easy selection! Wish the standard shipping was faster!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARILEE",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:02:08.000Z",
          "Titre": "We LOVE these cases!",
          "Contenu": "We LOVE these cases and the selection is so vast it’s hard to choose! The price lines up with the protection my phone has from accidental falls. It just takes so darned long from order to shipment that I give 4 stars. Cases are highly recommended though, good things take time, right?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T06:57:37.000Z",
          "Titre": "Not bad",
          "Contenu": "The packaging was very nice, good for giving gifts. The strap was good quality, and it looked nice. The phone case was just okay, seems to be sturdy but the snakes mouth is hidden. The website shows it realistically, but in person I realized the design itself is not as nice when the full animal is not shown."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Bartosz",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T08:53:30.000Z",
          "Titre": "Took ages to deliver",
          "Contenu": "Delivery time is outrageous, product is pricey but of great quality (clear MagSafe case) buttons are a delight and great to hold. Also doesn’t yellow!"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Nakarnda  Panusittikorn",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T06:33:40.000Z",
          "Titre": "The Branding is great, but the price is too high.",
          "Contenu": "The Branding is great, from Conceptual Ideas to Visuals to Packaging to Products. Everything seems coherent.Anyhow, the quality of product is below standards compared to the price."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "이 소라",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T06:30:51.000Z",
          "Titre": "Well made products",
          "Contenu": "Well made productsDesigns can be satisfactory but nothing outstanding for my personal tasteSo it feels somewhat pricy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Iliana",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:13:02.000Z",
          "Titre": "Great!",
          "Contenu": "Took a while to come in but other than that I’m not ever disappointed with Casetify!"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Ingrid",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T11:13:14.000Z",
          "Titre": "The case is so nice and protective",
          "Contenu": "The case is so nice and protective, but too expensive."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T05:03:42.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, there’s a great selection to choose from. It would be much more user friendly if there was a function to filter out all “Sold Out” items rather than going through pages of them. A sort by price would be a good addition too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tadsikar Khousavath",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T00:43:39.000Z",
          "Titre": "It is expensive, but I like the design",
          "Contenu": "It is expensive, but well worth it. It’s just hard to figure out what does and doesn’t apply, I remember that some of the Co-Lab in the past was eligible? Maybe that’s my own memory, hahaha. But either way, I do like Casetify."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joyce  Lyons",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:26:02.000Z",
          "Titre": "Phone case durability.",
          "Contenu": "Offering a variety of products for phones etc. that last a long time."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jade Doucette",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T19:57:09.000Z",
          "Titre": "So far.. so good :)",
          "Contenu": "So far, the website was easy to use,I really liked the designs and cannot wait for my order! I have ordered a few years ago and was really happy with the quality and last. I’m hoping for the same good experience. I’m in Canada and experienced no bs from this company and happily order from them."
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "유민 임",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:36:12.000Z",
          "Titre": "First of all",
          "Contenu": "First of all, I like the design. But it doesn't seem to be competitive in price in terms of accessibility. Promotions are frequent, but barriers still exist to approach them easily."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Camilla",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T13:07:56.000Z",
          "Titre": "Beautiful case",
          "Contenu": "Deeply satisfied with the results and the case"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Eve",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T10:54:32.000Z",
          "Titre": "Very helpful",
          "Contenu": "Quick and helpful assistance with my phone case"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "So Jung  Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:58:10.000Z",
          "Titre": "Sturdy case cute design",
          "Contenu": "I got the Esther Kim case and I love it. Wish there was more texture variations to the case like puffer phone case."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "PL",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T08:49:33.000Z",
          "Titre": "Made a purchase, but site experience can be improved on mobile.",
          "Contenu": "When I got to the checkout page, I couldn’t use Apple Pay, but had to input my card info, which was a wee bit troublesome as I usually step out wallet-less.Also, it will be good to include a keyword search function. Not sure if you have it or that I couldn’t find it in mobile mode. You have a lot of designs and it really took me days to go through all your designs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana Murguia",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T10:09:24.000Z",
          "Titre": "i love the designs and how protective…",
          "Contenu": "i love the designs and how protective the cars are. they’re protective and sleek. after the while the case does get kind of warped around the corners and the sides start to detach. this is probably just wear and tear and can be fixed with a bit of super glue. other than that the cases are really well made and i love every case i’ve gotten."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Chris_C",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T13:13:24.000Z",
          "Titre": "great experience, would continue to buy",
          "Contenu": "Easy to navigate and search for preferred cases. Would love if there were more designs geared towards men who prefer subtle but not overdone patterns."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlotte Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:55:39.000Z",
          "Titre": "It’s a very nice case and very durable…",
          "Contenu": "It’s a very nice case and very durable but expensive"
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "謝蕙如",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:46:22.000Z",
          "Titre": "good",
          "Contenu": "good service"
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "eddie rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:54:58.000Z",
          "Titre": "Super slow shipping but every else…",
          "Contenu": "Super slow shipping but every else what’s great"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "CAROL MAK",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T11:15:31.000Z",
          "Titre": "Good quality but the price had a little…",
          "Contenu": "Good quality but the price had a little expensive. If can offer more discount is the best."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Ja",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T11:34:05.000Z",
          "Titre": "Fast and seamless purchase process…",
          "Contenu": "Fast and seamless purchase process without need to register an account. Prefer if the iPhone 15 Pro Max clear case did not show the white circle for Mag Safe so clearly."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "寶倫 蔡 Pao Lun Tsai",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:31:40.000Z",
          "Titre": "I ordered three products on 9/25…",
          "Contenu": "I ordered three products on 9/25 (ordered twice on the same day, so 6 products). The first order number: #17526646, but there is one product USB-C TO USC-C CABLE (cotton candy ) was not sent to me. I found it too late, so I didn’t notify you at the time. Can you resend it to me now?"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Jenny Mitchell",
          "Nb_Reviews": 4,
          "Date": "2023-11-23T16:47:45.000Z",
          "Titre": "A lot of variety for newer phone covers…",
          "Contenu": "A lot of variety for newer phone covers and not much for iPhone 11 in different colours or no clear covers"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Juliet Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:25:19.000Z",
          "Titre": "Ordering was but no idea when it will be delivered",
          "Contenu": "Ordering was ok but disappointed not to receive any notification of when the item might be delivered. How do I find out?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mackenzie Dierker",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T02:32:56.000Z",
          "Titre": "Easy experience but wish I the coupon worked with my case too",
          "Contenu": "Didn’t like how coupons only applied to specific phones but didn’t not make it clear that the case I bough was not included"
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "翰霖 葉",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T11:35:20.000Z",
          "Titre": "Website tour experience",
          "Contenu": "Website tour experience was very well. Youths products category was very clear and easy for selected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cole",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:54:44.000Z",
          "Titre": "It was good I want to know where it is…",
          "Contenu": "It was good I want to know where it is thank you"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kylie",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:42:19.000Z",
          "Titre": "Is there an option of faster shipping",
          "Contenu": "Is there an option of faster shipping? I didn’t see it?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Weeks",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:17:18.000Z",
          "Titre": "The case is awesome",
          "Contenu": "The case is awesome, but the screen protector doesn’t fit right with the case. Need to see about getting a replacement.  I’ve already dropped this $1500 phone and the case gave it great protection,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liv Pionzio",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T03:01:30.000Z",
          "Titre": "I made the photo grid case",
          "Contenu": "I made the photo grid case. I have ordered one before, but my images were showing up blurry. But in the end, I finished the design, uploaded it, and it was perfect! Very easy on a computer to design the case, wouldn’t recommend on a phone. Great cases too!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James H.",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T20:01:05.000Z",
          "Titre": "Solid low profile case",
          "Contenu": "Solid low profile case, took a long time to arrive and a bit expensive compared to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:09:05.000Z",
          "Titre": "Beautiful Cases/Easy to Use",
          "Contenu": "Love these cases! I wish the customization was a bit easier to see, a lot of refreshing between picks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claudia Warren",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T19:51:06.000Z",
          "Titre": "Loved all the choices that I had!",
          "Contenu": "Loved all the choices that I had to order from but it was difficult to figure it out at first. So excited to get my new case. I hope it makes it to me before I move."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy William",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T10:32:25.000Z",
          "Titre": "Okay",
          "Contenu": "Design is ok, delivery quite slow, quality okay so-so"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "의진 이",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:37:23.000Z",
          "Titre": "Design was good but duration of the…",
          "Contenu": "Design was good but duration of the sipment took so long"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "E. C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:48:06.000Z",
          "Titre": "Customer Service is awesome!",
          "Contenu": "Customer Service is awesome!For some reason, I had two different accounts on Casetify. When I messaged support about it, they were able to resolve it pretty quickly.Second, I received the wrong order. When I messages support about it. They replied pretty quickly to settle the delivery of the correct product."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nykita Smolarchuk",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T09:43:53.000Z",
          "Titre": "CASETiFY for the win",
          "Contenu": "I gave CASETiFY a chance two years ago and I don’t regret it. The products are amazing and customizable. And offer amazing protection. I have gone back to get stuff from my updated phone and even when I had an issue the support team was very understanding and helpful. and their products and offered to help in anyway they could!!!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Katt B",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T02:52:38.000Z",
          "Titre": "The replaced my damaged case!",
          "Contenu": "I bought the Mirror Case in their physical store in Shibuya, Tokyo last November 3. And all is well until a month later, I dropped it and it incurred a deep scratch on the mirror! So I contacted Casetify and asked if they could replace or have a discount on my next purchase. And they emailed me immediately saying they’ll be replacing my case! I was so happy and almost two weeks had past and my replacement case has arrived!! Thank you Casetify for the excellent customer service! I’ll be sure to order again if I upgrade my phone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gary Tanner",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:21:21.000Z",
          "Titre": "I contacted Casefity to help me with warranty issue",
          "Contenu": "I contacted Casefity to help me with a liquid glitter case that lost all of its liquid. I had it for about 1.5 years and for sure it was out of the warranty period. Even though out of warranty they offered me a new case of my choosing at no cost. It was a bit difficult to find another case that had a pattern I liked, fit my phone and was also in stock. Many back and forth emails later we found one for me. They are shipping it to me now and I have to thank the customer support team for all their patience and time in helping me. Great support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Qin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:31:24.000Z",
          "Titre": "Great case",
          "Contenu": "My first time purchasing a non-Apple iPhone case and it went beyond my expectations! The quality is great, love the design, especially with the flat camera cutout. I will definitely purchase more Casefity cases in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eden Volk",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T02:49:05.000Z",
          "Titre": "These cases are absolutely fantastic in…",
          "Contenu": "These cases are absolutely fantastic in quality and appearance. Worth every penny because they protect your phone while keeping it looking fabulous! Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah-louise Grainger",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:23:07.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "The help was amazing I didn’t think anything would come of my case MagSafe not working but they are replacing the case entirely. I felt very herd, it was fast easy communication and and I would recommend casify to anyone after this experience with customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:25:13.000Z",
          "Titre": "Best cases ever!",
          "Contenu": "These cases are my favorite! I’m extremely clumsy and drop my phone often; I’ve broken/done serious damage to almost every single phone I’ve ever had. I’ve dropped my phone so many times with these cases on and not a single issue. Finally sturdy reliable phone cases that are still so cute!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Turnmyre",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:53:07.000Z",
          "Titre": "My first order was simple!",
          "Contenu": "My first order was simple. Hope my granddaughter is happy. It won't arrive till after Christmas so it will be a surprise when she returns from her other grandmother's home in Georgia."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Georgia Bridge",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:48:11.000Z",
          "Titre": "Effortless",
          "Contenu": "Going through with the purchase of the products was effortless. I knew what I was in for with how long until I see the product and when items got sent received the tracking email and was easy to keep track of items for when they would be delivered to my house."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wenhao Leow",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:39:25.000Z",
          "Titre": "Excellent choice!",
          "Contenu": "Like the case and the strap that I've bought! Definitely like how it really protects my new phone as well as instructions are quite clear when detaching the from wrist strap to body strap. Definitely will purchase soon!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Wanrawee Wiboonsin",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T13:11:10.000Z",
          "Titre": "In love with it",
          "Contenu": "I bought the product from you guys for long time and I never ever had any issues with it. In love with all the product that I received. Thank you for hard work and improving quality all the time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jane Rodgers",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T18:11:52.000Z",
          "Titre": "Just had trouble creating an account…",
          "Contenu": "Just had trouble creating an account but sorted now but apart from that you’re designed and website is brilliant"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Kitti Aphinyanaphong",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:00:27.000Z",
          "Titre": "THE case is beautiful and flexible",
          "Contenu": "THE case is beautiful and flexible. The size is suitable for the iphone, the material is good, the service from the store is good. There is always notification of where the product has arrived."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "wyeth aficial",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T12:59:14.000Z",
          "Titre": "I think i have my full trust when it…",
          "Contenu": "I think i have my full trust when it comes to phone accessories for my iphones, for my peace of mind as well, and i do love the designs as well, i just hope they have blackpink designs and collectibles and more limited edition products soon"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay Dutton",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:22:55.000Z",
          "Titre": "The products never disappoint and are…",
          "Contenu": "The products never disappoint and are such high quality on top of really cool designs. I have purchased a ton of cases and always been very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica  Dunnett",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:52:50.000Z",
          "Titre": "Great quality products and awesome designs",
          "Contenu": "I bought my first case and it lasted so long and through so much haha. So I bought two more impact cases. Had to come back and buy the 2in1 grip stands cause I can’t find anything that’s like it. I bought a cheaper version and it didn’t last a day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emelio Mascarinas",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:06:41.000Z",
          "Titre": "Shopping & maneuvering through the…",
          "Contenu": "Shopping & maneuvering through the website was very easy. Lots of options to choose from & check out easy for me, using Apple Pay option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Panfi Bohlmann",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:48:44.000Z",
          "Titre": "I wanted something to represent my love…",
          "Contenu": "I wanted something to represent my love for the animals, so I founded this lovely phone case with a cat and dog, showing love and peace to each other. Perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaelyn  Neighbors",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:33:00.000Z",
          "Titre": "I have loved the experience with y’all…",
          "Contenu": "I have loved the experience with y’all from the start and today Thank you for being the best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joann",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:05:58.000Z",
          "Titre": "I highly recommend Casetify",
          "Contenu": "I highly recommend Casetify. They are dependable phone covers. I have been using them for years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Bellville",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:42:15.000Z",
          "Titre": "Love CASETiFY",
          "Contenu": "I purchase all my family’s cases from CASETiFY. They protect our phones and have something to fit all our different styles and personalities."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "m.",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:17:01.000Z",
          "Titre": "soooo many to choose from",
          "Contenu": "soooo many to choose from, and even options on the material and color for each case. also the fact that cases are categorized by phone type."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "SIU FAN,NICOLE  LEE",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:57:47.000Z",
          "Titre": "outstanding work",
          "Contenu": "I didn't have credit card , and I got paid with payme, that really surprised me for this buying experience,  that's awesome 👏"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sarah Brigham",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:06:57.000Z",
          "Titre": "Awesome quality!!!",
          "Contenu": "Awesome quality case! Beautiful artwork on it and fast delivery too. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel Orellana",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:15:02.000Z",
          "Titre": "it was so great!",
          "Contenu": "it was so great!! no complications while ordering my case! IM SO EXCITED!!! <3"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Teresa Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T11:36:14.000Z",
          "Titre": "Excellent products and service !",
          "Contenu": "Very effective and excellent service. I'd really like the design for all products. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ET",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T15:56:17.000Z",
          "Titre": "Amazing Cases / Maximum Protection",
          "Contenu": "I love the cases so much. I've be ordering for 5-6 years. Fully protect my phone through every drop (and i do drop it often). They are a bit pricey but i think it's worth it if your phone gets 0 damage. It's also a great gift to friends + family :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathleen Fugatt",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T03:28:19.000Z",
          "Titre": "Best customer service",
          "Contenu": "I love how easy it was to cancel an order when I ordered the wrong model phone case. I love the rewards and the collaborations."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Jaeling Vivian",
          "Nb_Reviews": 4,
          "Date": "2023-12-22T02:04:00.000Z",
          "Titre": "CASTIFY always good",
          "Contenu": "CASTIFY always the only choice brand for my phones. It is sturdy and really protect my phone well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Foreman",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:19:20.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, easy website to choose from, fast delivery and excellent product. Colours on the mermaid design are amazing."
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "S.Joy",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:57:05.000Z",
          "Titre": "Nice product and service",
          "Contenu": "Nice design over the other brands.It is understandable to delivery slower than the others since they are not made ready product. The product is nice and the service is nice too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lenda Ulrich",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T20:40:45.000Z",
          "Titre": "Great selection and was pleasantly…",
          "Contenu": "Great selection and was pleasantly surprised to find Mickey and the gang?"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "soeun  choi",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:15:06.000Z",
          "Titre": "i accidentally ordered the wrong…",
          "Contenu": "i accidentally ordered the wrong phonecase and they fixed it right away no needing to wait thank you"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Zoe",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:23:28.000Z",
          "Titre": "The after service is great",
          "Contenu": "The after service is great! CS is responsiveness for the case exchange."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel Olvera",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:59:48.000Z",
          "Titre": "Amazing selection!",
          "Contenu": "Amazing selection. Precise customization and easy steps to checkout. I liked being able to compare other features from other cases."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "El Kim",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:14:11.000Z",
          "Titre": "The design of illustration is really…",
          "Contenu": "The design of illustration is really good. I love it! The long strap is really convenient and pretty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Simon",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T04:17:47.000Z",
          "Titre": "Sustainability-",
          "Contenu": "Sustainability-More collection bins. Love the program. More green, go for net-zero"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lily Landau",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:32:06.000Z",
          "Titre": "I love my new phone case",
          "Contenu": "I love my new phone case! The colors are vibrant and I’ve gotten tons of compliments already."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "상언 박",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T12:24:17.000Z",
          "Titre": "many colaboration and improved quality.",
          "Contenu": "many colaboration and improved quality.all of these things are good"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tom Pang",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T03:19:22.000Z",
          "Titre": "Very quick and helpful response",
          "Contenu": "Very quick and helpful response. Problem solve very quick and effective. Very happy with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie White",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T01:17:05.000Z",
          "Titre": "Very Easy!",
          "Contenu": "Very Easy!! This site was very easy to use and I liked the way the options were available to sort. There are also so very many options and great variety"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Joanna Chew",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T15:39:26.000Z",
          "Titre": "There are many variety to choose from",
          "Contenu": "There are many variety to choose from. The website is user friendly and easy to navigate."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "DT QinWeii",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:35:08.000Z",
          "Titre": "Really Love the \"Wish You A Good Life\"…",
          "Contenu": "Really Love the \"Wish You A Good Life\" Collection. It just simply captures my heart😍😍😍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Js",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:31:42.000Z",
          "Titre": "Website was easy to navigate",
          "Contenu": "Website was easy to navigate and I love the sales!!"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Jone Wong",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:24:54.000Z",
          "Titre": "I am still waiting for the product",
          "Contenu": "I am still waiting for the product. I will comment upon receipt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Alston",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:29:01.000Z",
          "Titre": "Amazing phones cases love the product…",
          "Contenu": "Amazing phones cases love the product everyone should have one of these"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Friend of Ted",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T22:29:20.000Z",
          "Titre": "Love it",
          "Contenu": "Love it. Fast shipping. Great graphic that is unique and feels personal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "abby",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:59:53.000Z",
          "Titre": "Shopping experience",
          "Contenu": "Website is super easy to navigate and products have great variety and quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sofia Licea",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:05:31.000Z",
          "Titre": "The design I got was really really cute…",
          "Contenu": "The design I got was really really cute and original. I just wished it wouldn't be as scratchable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zoie  Canapo",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T19:13:50.000Z",
          "Titre": "Quality product. So cute.",
          "Contenu": "Easy to create collage and love the result product from previous order!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C D F",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:36:16.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, great products available, and full inventory"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tia  Allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:14:58.000Z",
          "Titre": "Great case keeps my phone secure",
          "Contenu": "Great case keeps my phone secure. There are so many designs to choose from it’s amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Quinn",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:09:39.000Z",
          "Titre": "The site was very streamlined and the…",
          "Contenu": "The site was very streamlined and the use of Klarna is a huge reason why I made the purchase."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Todor Boyadzhiev",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T07:59:23.000Z",
          "Titre": "Perfect",
          "Contenu": "Perfect! The only thing is the timing. Too long for delivery.But everything else is perfect.Thank you 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren Aliceburg",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:49:23.000Z",
          "Titre": "So many choices",
          "Contenu": "So many choices. A bit overwhelming. Loved they do student discounts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa R",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:12:06.000Z",
          "Titre": "Ordering was quick and easy",
          "Contenu": "It was a quick and easy process to place a personalized order."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Mevr. Anneleen Pacquets",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T10:07:16.000Z",
          "Titre": "Always the best!",
          "Contenu": "Always the best!Original cases and do what they promise to do!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tarsha Rodley",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:57:56.000Z",
          "Titre": "Cases arrived earlier than expected.",
          "Contenu": "Cases arrived earlier than expected.Great quality Very happy"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "희진 최",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:19:00.000Z",
          "Titre": "i like they care about environment",
          "Contenu": "i like they care about environmentand easy to order"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "SJ Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:14:51.000Z",
          "Titre": "There are too many combinations",
          "Contenu": "There are too many combinations. It was Asome experience. I enjoyed my experience not a just purchasing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dilligas",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T21:53:55.000Z",
          "Titre": "Good quality",
          "Contenu": "Came fast and it has protected my phone from one drop already"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Noh Dina",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:00:18.000Z",
          "Titre": "She responded quickly to the mail and…",
          "Contenu": "She responded quickly to the mail and explained it kindly"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sandra from Germany",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:05:18.000Z",
          "Titre": "Quality + Customer Care",
          "Contenu": "Quality awesome and very friendly and fast customer care"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Mauldin",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:33:54.000Z",
          "Titre": "It was quick and easy to order can’t…",
          "Contenu": "It was quick and easy to order can’t wait to see if it is worth it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "oskar sartino",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T19:57:43.000Z",
          "Titre": "FANTASTIC Customer Service",
          "Contenu": "The customer service easily fulfilled the 6 month warranty on a Co-Lab case.Phenomenal service from the CASETiFY."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Elaine",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T08:05:01.000Z",
          "Titre": "It’s a Good procduct!",
          "Contenu": "Good product with good quality.Although it took a long time from order to receive the product."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "月璇 程",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T03:35:40.000Z",
          "Titre": "I love the texture of the product",
          "Contenu": "The quality is very good but the price is a bit expensive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen M",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:53:49.000Z",
          "Titre": "Sustainable cans",
          "Contenu": "I like the phone case is made from recycled materials"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "sunny",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T04:06:44.000Z",
          "Titre": "Very excellent service and good products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naomi",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:00:58.000Z",
          "Titre": "good experience",
          "Contenu": "no problems and an easy purchase for a gift."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:45:21.000Z",
          "Titre": "Easy order",
          "Contenu": "Easy order, accept Apple Pay, beautiful product."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Fabi",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:03:12.000Z",
          "Titre": "Good case to protect your phone",
          "Contenu": "Good case to protect your phone! The design is awesome as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devamalar Balasundar",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:25:35.000Z",
          "Titre": "Best case ever",
          "Contenu": "Best casing that I hav using..very protective casing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeka",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:36:59.000Z",
          "Titre": "Too many options",
          "Contenu": "Easy to find what I was looking for, hard to decide what design to get."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Abby King",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T04:13:59.000Z",
          "Titre": "Great website",
          "Contenu": "Website was very easy to navigate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Leninha Aguiar",
          "Nb_Reviews": 11,
          "Date": "2023-12-18T15:47:35.000Z",
          "Titre": "personalized phone case",
          "Contenu": "Love my personalized phone case. It’s just great"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Vivian",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:49:05.000Z",
          "Titre": "good but gets more more expensive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T07:34:42.000Z",
          "Titre": "Amazing service and awesome cases",
          "Contenu": "Amazing service and awesome cases. Casetify never lets me down!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "PSoler",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:12:37.000Z",
          "Titre": "Casetify Love",
          "Contenu": "Online store is easy to use or navigate. Great products and great design."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Charlene  Lew",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:34:52.000Z",
          "Titre": "Perfect case",
          "Contenu": "Love it , clear and solid. Perfect choice"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Jaewoong Jeon",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:27:42.000Z",
          "Titre": "gooood",
          "Contenu": "Not arrived yet, But trust castify"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "timothy ford",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T07:29:20.000Z",
          "Titre": "looking for specific merch",
          "Contenu": "easy user experiences found what I want and more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arborlon",
          "Nb_Reviews": 16,
          "Date": "2023-12-20T04:41:44.000Z",
          "Titre": "Excellent fit and feels very solid"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grandpa",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:22:14.000Z",
          "Titre": "Easy use and great customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberta McHugh",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:35:02.000Z",
          "Titre": "Was able to ship via DSL for faster…",
          "Contenu": "Was able to ship via DSL for faster delivery! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre H Lo",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:12:32.000Z",
          "Titre": "Good quality",
          "Contenu": "This Cassidy case is so cute and adorable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex Torres",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:40:05.000Z",
          "Titre": "Quality Phone Case",
          "Contenu": "They are durable / quality phone cases that stand out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy McCormick",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:59:32.000Z",
          "Titre": "Cool pics",
          "Contenu": "I like the cute creative covers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maddie Schaffert",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:34:55.000Z",
          "Titre": "Amazing case",
          "Contenu": "Amazing case, and didn't take long to get here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ferdinand Chandra",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T13:11:09.000Z",
          "Titre": "Great quality of case and uniq",
          "Contenu": "Great quality of case and uniq and personal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexandria Cannon",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:57:29.000Z",
          "Titre": "Lots of options and it's all…",
          "Contenu": "Lots of options and it's all customizable."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "병건 조",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:13:00.000Z",
          "Titre": "always good!",
          "Contenu": "Got a perfect answer with quick as."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "煒文 陳",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T07:52:18.000Z",
          "Titre": "I made it with the pictures my son drew…",
          "Contenu": "I made it with the pictures my son drew when he was a child. I’m really happy. The only one in the world.You all made a good job. Thank you all❤️❤️"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "君豪 張",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T05:01:46.000Z",
          "Titre": "the buying process",
          "Contenu": "the buying process is easy and comfortable"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Chi Kit Alex Chung",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T01:10:15.000Z",
          "Titre": "Fast respond n promising service.."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Wing Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:56:57.000Z",
          "Titre": "SMOOTH",
          "Contenu": "Easy shopping experience...and GREAT product"
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "FIORELLA VARGAS",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T14:03:29.000Z",
          "Titre": "Excelent product",
          "Contenu": "Excelent productSo good protection"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "vpnUser",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T11:45:46.000Z",
          "Titre": "Great case protecting my phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerard  Henson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:31:54.000Z",
          "Titre": "Very quick and efficient"
        }
      ]
    }
  ]
}