{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "cellhelmet.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Delaughter",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:29:16.000Z",
          "Titre": "Don't buy, save yourself the heartache",
          "Contenu": "Yeah, really, just save your money and go with a better brand. Customer service tries,  but lacks the human empathy trait and the sense to see that the product was applied 24 hours before registering, but my card was swiped the day after the repairs were done, thus, I guess voids the \"warranty\". Even though it clearly states,  \"may void warranty\" simply means they have the means to be compassionate and understanding, However, they lack that. I guess with most companies anything to keep a buck right? Told you I'd keep up my original review but, my human empathetic and human understanding have in to change it. So you see, that's how it works in life. This company has not and is not willing to take care of their warranty. You do you, but warning, read the fine print, they'll do anything to get out of it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Baxter",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:20:12.000Z",
          "Titre": "I purchased cellhemlmet liquid glass…",
          "Contenu": "I purchased cellhemlmet liquid glass pro+ for my phone.  When the screen broke, I reached out to them multiple time with no communication, come to find out you have to email your claim in (almost impossible to get an actual human on the phone). After 2 weeks I finally received an email backing saying the $100 dollar purchase of liquid glass pro+  was expired.  Long story short this product is garbage, and you should really just pay for phone insurance which is by far superior to this SCAM!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Roberts",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T14:17:24.000Z",
          "Titre": "customer service non responsive",
          "Contenu": "customer service non responsive when I had issues trying to register product.  Can't imagine what would happen if I had to file a claim. Returned our phones to Verizon. Purchased new phones, applied screen savers purchased online which we were able to apply easily. Have dropped phone many times and have had no problems Also purchased cell helmut wireless charger, also a failure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SusanS",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T21:06:23.000Z",
          "Titre": "Purchased a liquid screen protector for iPhone 11",
          "Contenu": "Purchased a liquid screen protector for a perfectly good iphone from cellhelmet. The app to register the product did not complete the registration. Within 48 hours the screen was cracked beyond repair. With pictures to prove the phone was in excellent condition when the product was applied, and the store manager vouching for the truth of that, cellhelmet still refused to honor their warranty. I would not recommend this company to anyone.THE APP DID NOT WORK TO REGISTER THE PRODUCT SO THE COMPANY REFUSES TO HONOR THE WARRANTY. MY REVIEW STANDS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Korty Church",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:14:32.000Z",
          "Titre": "After downloading registration",
          "Contenu": "After downloading registration app to receive warranty coverage I was asked to make a choice between cell helmet managing my phone calls to allow or not allow. When I chose not allow the application stopped and I was not able to finish registering for warranty coverage. Please help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug Timmons",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T15:48:13.000Z",
          "Titre": "On my second cellhelmet screen…",
          "Contenu": "On my second cellhelmet screen protector product. First one a week after install it cracked. Phone wasn't dropped spend good money to buy the first one. The had to pay more to get a replacement. Now that one cracked also phone wasn't dropped or abused. The product is not what it is represented to be. Very displeased and will not purchase again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "deep sai Vemulapalli",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T20:22:33.000Z",
          "Titre": "By using their liquid screen protector",
          "Contenu": "By using their liquid screen protector, My phone screen got shiny spot scratches. They charged more than 50$, but not worth it than tempered glass. I recommend use tempered glass to protect screen than regret later."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Horne",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T20:39:44.000Z",
          "Titre": "Deceptive business practices - don't fall for it.",
          "Contenu": "When you're sitting in the repair shop, this looks like a great product.  Lifetime warranty!  AFTER they take your money, you learn that you have to register your phone with the company and even then you don't see the fine print that you have to register by putting their app on your phone!  Absurd, I'm not putting your app on my phone.  Then on top of that, you subsequently learn that the lifetime warranty is only for 1 year.  Absolute waste of time and money.Edit:  My response to your response is that your business practice is deceptive because you don't disclose in advance what's required to take advantage of the warranty.  It should be clearly stated in the advertising, not hidden in the fine print you get AFTER you pay your money and they paint your screen with the chemical."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margaret Elisabeth Batten",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T21:42:50.000Z",
          "Titre": "Not worth it",
          "Contenu": "Not worth it. Screen cracked on two separate phones with this. AND  the “lifetime, money back guarantee?”  Not so much. My claim was denied for “excessive damage to device screen.” $10 tempered glass screen protectors from amazon (or wherever) are the way to go. They actually protect the screen and cheaper. I bought the cellhelmet liquid glass and had a verizon representative apply it to my iPhone screen a while back because of the lifetime warranty and it’s so-called “shatterproof”-ness.  The screen still managed to crack from a short drop, but since I had not registered it, no warranty (I had my screen replaced).  When I bought a new phone recently, I was hesitant to buy it beciase of the poor results, but the Verizon person convinced me it was the best, so I got it and registered it. And my screen cracked again. This time, I filed a claim. It was denied due to “excessive damage to device screen.”"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T22:54:15.000Z",
          "Titre": "Warranty Not Honored",
          "Contenu": "If zero stars were an option that what my rating would be for both product performance and customer service.  I bought the $300 liquid glass warranty product, which was applied on site before I left the store.  2 months later I dropped my phone, and it broke.  I returned to the store receipt in hand and was told I must contact cell helmet directly.  Upon calling cell helmet they would not honor the warranty, because the application was never registered. They said it was my responsibility not the stores.  Now I seem to be stuck between the store and cell helmet with both implying I am at fault.  No way to prove otherwise, so I am out of luck.....Don't waste your money..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Conner Blanton",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T18:56:51.000Z",
          "Titre": "Having not registered in a 30 day \"may\"…",
          "Contenu": "Having not registered in a 30 day \"may\" voids the warranty. I contacted customer support having receipts of my phone fixed then applied cellhelmet after on my new screen in the different time of receipts show bc I got it after thought. Having a year to claim this warranty shouldn't leave issue if I have proof of purchase. Also may is discretional meaning up to the person who's in charge which is very vague. Also told me I have to take pictures before and after of my phone screen before registering and this is from the manager who doesn't wanna transfer me to talk to the higher ups. Aron the rep was no help either the manager was not wanting to help or do anything besides dodge my statements with the screen statement saying he will send the terms to me but won't highlight where it states that. One big scam the product and business is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Reid",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T19:39:24.000Z",
          "Titre": "Complete rip off",
          "Contenu": "Complete rip off!  I bought the case and liquid glass treatment for my Samsung S22 Ultra.  Screen cracked after a few months, and it wasn't even a hard/high fall.  It was on a hardwood floor.  If you have to file a claim you have to deal with their 3rd party insurance company who is outside the US and has odd hours.  They will find every excuse under the sun to reject your claim.Updated: This is how bad the customer service is at Cell Helmet.  They replied to my post here to let me know my dispute of the rejected claim was rejected instead of letting me know through the original service ticket.  Didn't know until 5 days later that they even replied to this.   Complete joke of a company, and I did submit a request before getting a repair, it just took 3 days to hear back from them.  What a joke!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Rauch",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T19:59:32.000Z",
          "Titre": "Phone cover quality and replacement",
          "Contenu": "I bought a cellhelmet \"Fortitude\" iPhone cover at Batteries Plus for $39.99 on 12/15/22. My dissatisfaction is both with the product quality and the handling of the replacement. It was installed by the salesperson. About one week later I discovered the case was cracked (no misuse or \"impacts\"). I went back to Batteries Plus and was told cellhelmet fully guarantees their product and to go to their website for a replacement. I did so and was informed by email the replacement would be sent upon receipt of my payment of $10.98. Of that amount $9.99 is a \"processing fee\" and $.99 is \"shipping guarantee\".So my $39.99 \"fully guaranteed\" case will now cost $50.97. When I emailed cellhelmet about the fees, the reply was \"that has always been stated on our website\".To me, having to pay what amounts to a 27% surcharge to get a \"fully guaranteed\" defective product replaced this just seems like a poor way to do business. I certainly won't be buying any more of their stuff or recommending their products to others."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Sandiford",
          "Nb_Reviews": 3,
          "Date": "2023-01-13T16:09:31.000Z",
          "Titre": "LICENSE TO STEAL",
          "Contenu": "PURCHASED TWICE. SCREWED TWICE. (Insert middle finger) My first purchase of the product was at a repair store; I purposely paid extra for the \"Screen Repair Guarantee\" and to have it professionally applied. I was not told that I needed to register my purchase. When I went to make a claim a few months later (because the product does not hold up as advertised)  I was denied because I did not do their mystery registration; ALL OF MY RECEIPTS FROM THE PROFESSIONAL STORE AND APPLICATION DID NOT MATTER. So okay I played their stupid game and bought another kit with $300 coverage they gave me a discount on (NOT WORTH IT). When I received the kit and tried to register it said my device was ineligible after several attempts I conceded. A couple weeks later my screen was cracked and I needed to purchase a new device. I received the new device excited I can actually apply the hardener and get the coverage I PAID FOR (twice over now). NOPE DENIED! My PIN was no longer valid. Who runs this company, Charles Ponzi!? Their reply below further shows they care not, just trying to pass blame and they are just greedy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tory",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T21:00:10.000Z",
          "Titre": "Horrible Customer Service.",
          "Contenu": "Horrible customer service. I bought their liquid screen protector from Cricket, for $54+ (including tax). While selling, the guy said it has life time warranty and replacement. Within a month my phone screen got a dent. But when i went to the store, they said they know nothing about any warranty! I contacted through email to cellhelmet customer care. They said just sorry for that and said that they are not able to police employees which are not theirs. My question is then why you are selling your items without any authentic dealer, and with such huge price!!!!!!Reply to the customer service: What i purchased, costs me $54(including tax). If it doesn't under your warranty, you should accuse the seller and the store which is selling your products by telling lies to the customers. I have already mailed your customer service with the picture of the receipt, which clearly shows the name of the store and sales person. If customer satisfaction and trust really matters to you, you should take action. Its your reputation which is harmed by the lie of those stores."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Mann",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T01:10:38.000Z",
          "Titre": "UPS screwed up delivery",
          "Contenu": "UPS screwed up the delivery of this product. I have still not received it. But it will probably be delivered by the time I get another new mobile phone in the next 2 to 3 years.FYI UPS left me a note, at the front door, saying it could not drop off my order because nobody was there to sign for it. The note said the Postal Service would make the delivery in about 5 days. The product never reached me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BUYER BEWARE",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T07:06:15.000Z",
          "Titre": "BUYER BEWARE - SCAM/DECEPTIVE PRACTICE",
          "Contenu": "Purchased liquid glass for my phone with the confidence it would be protected. Well, I could not be more wrong. The company cellhelmet aka Kane and McHenry Enterprises, LLC put in very fine print on the box nowhere else, not even in their ads or recordings that the warranty is only for one (1) year and I had a year a few days ago. Conveniently for this deceptive company they would not inform you when you purchase it or when you register it or call in, the recording goes over everything except that fact. They send you a registration confirmation with all the information except that very important detail so they would not have to honor the warranty or cover the claim. If you don't register it right away, they deny your claim. Too many shady, deceptive practices by this company. If their policy has always been a yewr then why not make it clear. What's the point if it is good a year and it's disguise in fine print that consumers are not aware? If they had any decency they would have put it on the receipt so consumers would be aware but as they have proven, they are not to be trusted and their sole goal is to not cover claims or honor warranty. BUYER BEWARE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hayden McMillan",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T15:53:56.000Z",
          "Titre": "Waste of time and money",
          "Contenu": "Phone broke first time I dropped it with cellhellmet on. Filed a refund and waited 2 weeks for my check. After weeks went by I asked where my check was and they said they forgot to mail it out and would do so next week. ARE YOU KIDDING ME?! 4 weeks after my claim and still waiting even for a confirmation that it was sent. Will never use cellhellmet again, big mistake"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Leddy",
          "Nb_Reviews": 3,
          "Date": "2023-04-08T23:10:23.000Z",
          "Titre": "Sloppy Service",
          "Contenu": "I paid $9.99 to buy the warranty for a PowerBank, that I used to charge my android phone, that broke. Cellhelmet shipped me a cheap powerbank that couldn't have cost more than $9.99 to make. The replacement is for an iPhone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Betty Miligan",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T19:07:56.000Z",
          "Titre": "Poor product performance high cost of free replacement",
          "Contenu": "First one cracked with in 2 months of having it. phone was not dropped has the strongest otter box on Did not have anything dropped on it 10$  to replace I had the 2 and one put on by the store staff to make sure it was put on correctly. With a few days it was already coming off my phone. Product not preforming up to my expectations. And cost of replacement ie free ie. 10$"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy Dupey",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T17:35:58.000Z",
          "Titre": "Eli told me to sent back the wrong size…",
          "Contenu": "Eli told me to sent back the wrong size screen protector that I ordered by mistake. I had to pay almost 8.00 on postage. I tracked the package and your company already got it but I HAVE NOT RECEIVED MY REFUND"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darwin Covington",
          "Nb_Reviews": 4,
          "Date": "2022-12-05T23:05:14.000Z",
          "Titre": "Don't waste your money",
          "Contenu": "Don't waste your money! First time I needed the screen protected it shattered. I had registered the product, which was a pain yet even though my claim was in the warranty period there was a fine print loop hole that gave them an out. Very poor product and warranty! I would have given a lower review if possible.  Grrr."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T00:20:53.000Z",
          "Titre": "Very very hard to figure out the site",
          "Contenu": "Very very hard to figure out the site. Was trying to use the lifetime guarantee on the screen protector and took forever to figure out how to do it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "cheryl Michener",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T22:02:58.000Z",
          "Titre": "THIS COMPANY IS AWFUL",
          "Contenu": "THIS COMPANY IS AWFUL. If there was a lower rating i would do it I had broke the glass on my cell phone took it in to I break you fix they were awesome they put on a new glass but they didn't have a regular screen protector the recommendation was try sell helmet if anything happens they'll replace your glass did it so they mentioned something about taking a picture of the phone and I tried to do this but I'm an older woman and not very computer literate so now I've broke my phone I have my original receipts I went out to file a claim and was denied I have my original receipts this company sucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim O'Leary",
          "Nb_Reviews": 3,
          "Date": "2022-09-26T05:37:21.000Z",
          "Titre": "I feel the process was 5 star.",
          "Contenu": "I feel the process was 5 star.Me having to replace a charger after less than a few months is a one star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "carlos botero",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T21:43:24.000Z",
          "Titre": "Does not work",
          "Contenu": "Does not work. This product is a scam. The screen broke and they did not honored the warranty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brendan Lettrich",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T16:47:24.000Z",
          "Titre": "The new screen protector already…",
          "Contenu": "The new screen protector already cracked again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzy Taylor",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T23:10:16.000Z",
          "Titre": "Will not get back me to refund my…",
          "Contenu": "Will not get back me to refund my money. 400.00 out for a horrible product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Gillmer",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T20:37:48.000Z",
          "Titre": "Rotten",
          "Contenu": "Rotten. I had it 2 days and it broke. It is way too sensitive of a product. I just put the cord in the charger and was told I must have done it too hard. I have had many portable chargers and never had this problem. Biggest piece of junk.  I received another one due to lifetime warranry.I will have to possible use lifetimewarranty again I hope not.You people should be ashamed of yourselves. I could not even get a black one either time since white gets dirtier easier."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheila",
          "Nb_Reviews": 1,
          "Date": "2022-06-25T17:14:11.000Z",
          "Titre": "Horrible",
          "Contenu": "Absolutely horrible! My IPad needed work and it took longer than 30 days to get it back and therefore was unable to register product. Once I did get it I immediately tried to register and there was no understanding of why it wasn't done earlier. Had to buy another cellhelmet & registered again and when I put in a claim they said the picture I took of the iPad wasn't good enough so I was denied again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Doll",
          "Nb_Reviews": 3,
          "Date": "2022-12-10T01:47:30.000Z",
          "Titre": "I was told I had a lifetime warranty.I…",
          "Contenu": "I was told I had a lifetime warranty.I had to pay for the new one.Why did I buy it in the first place?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Judie Berg",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T19:07:11.000Z",
          "Titre": "DO NOT BUY CELLHELMET",
          "Contenu": "DO NOT BUY CELLHELMET. Not only did my screen crack within a week of having the liquid applied by an authorized seller of this product who does screen repairs, CELLMELMET denied the claim since I did not realize I had to register the product immediately after purchase (although it was registered within 30 days of purchase which is also a requirement). I have proof of purchase of their and the company still denied the claim."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ann Lynch",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T19:15:46.000Z",
          "Titre": "This is the worst screen protector I…",
          "Contenu": "This is the worst screen protector I have ever purchased! Waste of money! Cracked two of them in two weeks. They charge ten dollars to replace it they did give me the third one for free. I’m sure it won’t last a week. It’s not like I abuse my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Georgia Hatzidakis",
          "Nb_Reviews": 2,
          "Date": "2022-06-15T18:28:44.000Z",
          "Titre": "Just lost a customer",
          "Contenu": "I travel a lot for work, and while I was traveling I purchased the cellhelmet glass protector for my new phone.  I subsequently lost the receipt but had all the other info.  I could not register for warranty.  I found my receipt 3 days after the initial 30 days and asked to please let me register my product - nope.  It is pretty lame for something that it touted to be a lifetime product to not honor the warranty just 3 days after the 30 days is over.  Better customer service or understanding is needed for real life situations. Will not be purchasing any other products from this company.  Thanks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Crotty",
          "Nb_Reviews": 1,
          "Date": "2022-02-13T20:01:09.000Z",
          "Titre": "Poor product. Poor customer service.",
          "Contenu": "Had their certified installer put it on.  It didn’t last 90 days. The third part warranty company wouldn’t stand behind their product because it wasn’t registered in a timely fashion.Multiple issues with app registration.Registration had to be done manually with the warranty company. That took several days.Still have the receipt. Their person installed it.It was registered.If there is a paperwork issue on their end they are not going to cover it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2022-01-14T12:27:58.000Z",
          "Titre": "If I could give a zero I would",
          "Contenu": "If I could give a zero I would. It took 8 months for a reply!!!!!! That’s not service at all. Your USB cable is awful, it lasted about 3 months and after 8 months you want a 5 star review???? On top of that you don’t offer to replace my cable, you offer a 25% discount on my next purchase!!!!!! Slap me in the face!!!!!! I won’t be purchasing anything from your company again!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 2,
          "Date": "2022-03-17T12:12:33.000Z",
          "Titre": "I paid $20 dollars for what was…",
          "Contenu": "I paid $20 dollars for what was supposed to be a durable cellhelmet charger cord with a lifetime warranty. Within a month, the cord no longer worked. When I returned the cord to the store, I was told that the \"lifetime warranty\" required that I send $10 and the cord would be mailed to me. After sending the money, I never received the cord. When I notified cellhelmet that I did not receive the cord, cellhelmet directed me to contact UPS. This was a disappointing purchase and I will not use cellhelmet again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Funte",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T00:05:36.000Z",
          "Titre": "I am not happy with the product that I…",
          "Contenu": "I am not happy with the product that I received. Top left-hand corner of the glass protector Kurt has a little crack in it. I feel you should send me a new one while you cover the charges for shipping and handling. I say that because I paid for a cracked shield. Thank you Pam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stickman",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T02:51:29.000Z",
          "Titre": "If you like dropping your phone due to…",
          "Contenu": "If you like dropping your phone due to a slippery case, which requires you to have a phone case, this one is for you. Dropped my phone more with this frictionless case than with any other case or when the phone is bareback. Don’t buy it. On the bright side, my phone isn’t cracked or shattered….yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheri Wirth",
          "Nb_Reviews": 2,
          "Date": "2021-09-17T22:00:46.000Z",
          "Titre": "THIS IS A TOTAL BOGUS COMPANY AND PRODUCT",
          "Contenu": "THIS IS A TOTAL BOGUS, RIP OFF PRODUCT AND COMPANY. DO NOT BUY PRODUCT. Their instructions at registration were not clear and at the bottom of their return email it states that \"This email is not confirmation of your submission. Your phone and receipt submission will be validated at the time of claim\". You do don't find out your photos sent at registration are not acceptable until they deny your claim."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Bulitt",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T17:44:31.000Z",
          "Titre": "And I was happy with the response to…",
          "Contenu": "And I was happy with the response to sending out the new screen protector. I was not happy with paying 999. Also the new one cracked within a week. I will not be getting a replacement for 999. I will buy something off of Amazon for that price they gives me more screen protectors. Your product is not superior to what they sell on Amazon for much cheaper"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Farmar",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T19:11:10.000Z",
          "Titre": "Cell Helmet is a SCAM",
          "Contenu": "Purchased this product and applied to my cell phone.  Forgot to register and did so 31 days after purchase.  Uploaded image incorrectly.  Even with both of these mistakes, their app allowed me to think I was registered correctly.  Phone screen cracks 3 months later.  File a claim and I am denied. Asked for a review considering these circumstances, denied.  Don't get fooled, stay away from this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan Parker",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T13:28:43.000Z",
          "Titre": "I purchased this product at UBREAKIFIX",
          "Contenu": "I purchased this product at UBREAKIFIX. When my screen cracked 1 year, 1 month and 3 days later, I tried to file a claim, I was informed the warranty was only good for 1 year. This was not communicated to me when purchased. UBREAKIFIX installed it so I never saw the packaging. Now I am out the $69.99 purchase price plus $262.00 for the screen replacement.  Beware of this before purchasing. Would not do it again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeremy clegg",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T17:29:04.000Z",
          "Titre": "Paid for the $300 coverage to cover my …",
          "Contenu": "Paid for the $300 coverage to cover my   Screen  repair I went out And called for hours and finally spoke with someone after hours and hours trying to get them to answer the phone they told me I need  to have my phone screen replaced 1st then they would Remembers me meWhen and had my screen repaired then they said my warranty was not valid due to a technical glitchWorse company ever will never use this company again for anything!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taiwo Adenekan",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T12:47:01.000Z",
          "Titre": "I've a bad experience with cellhelmet",
          "Contenu": "I've a bad experience with cellhelmet. I purchased a liquid protection for my phone but when my screen crashed I file a claim and I was denied as a result of wrong pictures upload. The pictures was not rejected when i registered my phone ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Corey H",
          "Nb_Reviews": 3,
          "Date": "2021-06-07T15:08:27.000Z",
          "Titre": "Claim denied",
          "Contenu": "Claim denied. They have a program to line your phone up to a mirror to make sure you are not registering a cracked phone. It is their software guiding you to take a proper picture to file a claim. I had to retake several times until the right pic was taken. What they are really doing is getting records of the most ridiculous possible pics they can use to later deny your claim. The picture I took was perfect, and you at cellhelmet well know it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DTuck",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T17:50:20.000Z",
          "Titre": "Buyer beware. No support",
          "Contenu": "Product MAY work as advertised but I have 4 devices that their algorithm will NOT let me register for the warranty.  Appears another company that likes to sell but doesn't want to back their product. Tired of this.  Gonna go back to the \"old fashioned\" way."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2021-04-03T16:57:00.000Z",
          "Titre": "I have used this product for years",
          "Contenu": "I have used this product for years!  Never again!  The warranty process requires you to install a 3rd party app that wants to take over making phones calls, location, contacts and to be installed forever to monitor your phone.  I will not support a socialist company stealing all my data. It is a privacy violation.  I didn't complete the warranty.  I will never buy this for my company phones any longer.  Good bye!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Lynn",
          "Nb_Reviews": 2,
          "Date": "2021-04-26T19:30:34.000Z",
          "Titre": "Avoid this company",
          "Contenu": "Avoid this company! This company offers zero support and will only contact you via email whenever they get around to it. Not to mention I was talked down to by an employee who told me the instructions \"were clear\" regarding registering my device, yet again through email! If you are a person who likes their questions answered and desires support when you need it, save yourself a massive headache and do NOT use this company or its products!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melissa B",
          "Nb_Reviews": 2,
          "Date": "2021-07-14T14:35:39.000Z",
          "Titre": "If I could give this product no stars I…",
          "Contenu": "If I could give this product no stars I would.  I have bought this product from my cell phone provider several times and my phones have all cracked after simply dropping of my phones.  So, not worth the money and the aggravation of having to get my phone fixed privately and wait for check in the mail from Cellhelmet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2021-03-01T16:47:18.000Z",
          "Titre": "Worst experience ever",
          "Contenu": "Worst experience ever.  Had cellhelmet liquid glass done on my phone.  Warranty said if the screen breaks they pay up to 300.  8 months later screen gets a chip.  Turn it in for Warranty.  Claim denied.  Company had no intention of fixing the phone.   Just offered me new cellhelmet liquid glass. For the new screen replacement I paid for.  Definitely do not recommend this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Arthur",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T15:16:14.000Z",
          "Titre": "Asfalis is a joke of a company.",
          "Contenu": "Asfalis is a joke of a company.. worst experience of any registration process... I will not recommend cell helmet although the cell helmet product is the best I've seen... and it is because of Asfails warranty.  They are horrible to work with and whoever decided to use their Mickey Mouse terrible service should be fired or questioned as to how they got to their position"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Dalpe",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T20:55:46.000Z",
          "Titre": "Do not buy do not do not do not",
          "Contenu": "Purchased to sell helmets for two separate phones. Both had issues both had to be replaced within six months of having them. Absolutely horrible product would never recommend nor buy again.  Worst case in order to replace their crappy product you actually have to spend $10 for shipping. Absolutely ridiculous wish I had done research before buying this horrible product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry-Luz Cruz",
          "Nb_Reviews": 1,
          "Date": "2021-11-13T01:35:20.000Z",
          "Titre": "Will never use or recommend this…",
          "Contenu": "Will never use or recommend this service .   I filed a claim and was denied because my initial registration  which was accepted  was not good enough  for claim approval.     Makes no sense.  I have invested  in thr past six phones and thr ONE time I file claim. It was denied."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teresa Olivares O",
          "Nb_Reviews": 1,
          "Date": "2021-04-15T03:36:13.000Z",
          "Titre": "Don’t buy this product. Worst product ever.",
          "Contenu": "Don’t buy this product, please listen to me, it is a fraud. They don’t repair anything or cover anything. The liquid glass product Isn’t working. You have to register the product on their own app, Asking so many questions  and at the end you can’t be registered. They said you have 30 days to register the product  but they don’t respect anything they promise. Even the product it doesn’t work. Money to the trash. Buy a better case instead or another better product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brianna Haga",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T15:57:16.000Z",
          "Titre": "My order was not received even though…",
          "Contenu": "My order was not received even though tracking stated it was. I reached out and customer service was not helpful - so here I sit without product I paid for and no one willing to help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gina Mclane",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T17:25:19.000Z",
          "Titre": "They told me the product would last a…",
          "Contenu": "They told me the product would last a lifetime. It had a lifetime guarantee. I purchased the charger from my iPhone two months later it broke. I returned it. I had to send in $9.99 for shipping. They sent me the wrong charger. They will not send me the correct charger until I send them $9.99 AGAIN!!I shouldn’t have to pay for your mistake! There is no customer service phone number to call either! There’s obviously a reason for that because you guys are  hiding behind an email!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dani",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T16:32:27.000Z",
          "Titre": "I bought a screen protector for my new…",
          "Contenu": "I bought a screen protector for my new Samsung s21 5G. It doesn't work with the cellhelmet phone case. The screen pops off when I put the phone in the case, even after I waited 3 days to put the case on. I would not recommend the screen if you also want to use a case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gina Cable Clower",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T22:00:56.000Z",
          "Titre": "Fake Warranty",
          "Contenu": "I purchased this product through a cell phone screen replacement store.  They replaced a broken screen and applied the liquid glass to the new screen.  Six weeks later, I drop my phone and the screen breaks and the lifetime warranty won't cover the damage.  I did not know that I had to register the warranty, I never opened the box, the store did.  I clearly had it applied to a new screen, I have receipts to prove it, Aron in customer service says they won't cover it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Pelto",
          "Nb_Reviews": 5,
          "Date": "2021-09-29T15:20:56.000Z",
          "Titre": "Make sure you damage your item within one year",
          "Contenu": "As long as you damage your product after having it applied within one year. You are covered but they will not let you know that you need to purchase the product again to keep your item protected. My screen cracked after 2 months but I decided to not make a warranty claim due to it was a minor crack. Now that I want to use the warranty, they tell me I need to repurchase the product to use the claim after one year. I thought this would protect my device. But this is why I don't trust warranty products. They always find a way to screw you over."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ray Hughes",
          "Nb_Reviews": 2,
          "Date": "2021-01-10T17:26:07.000Z",
          "Titre": "A waist of money",
          "Contenu": "A waist of money, do not buy cellhelmet. At least with a normal tempered glass screen protector if you scratch it you can take it off and put a new 1 on. Cellhelmet will not honor any warranty and they will just jerk you around. It was a waist of $80 for the 2 phones I have. Their customer service is terrible. I personally don't want to give any business my money if their just out to get over on people when given the opportunity."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Southern Seller",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T21:38:26.000Z",
          "Titre": "SOMEONE PLEASE HELP!!!",
          "Contenu": "SOMEONE PLEASE HELP!!!! So I paid $70 for this dang Altitude pro-x MOCHA CHOKA ….. BS cover!! I registered my case May 2020 when I purchased my current iPhone 11 PRO Max. Just 3 days ago…. I dropped my phone at total of 12 inches: it landed face down and when I flipped it over … BAM… cracked at the bottom with hairline cracks running everywhere!! Now I thought … despite being out of 1 YEAR warranty … that screen repairs were free for the life of case????? Can someone please help!!! This is a damn scam … FOR REAL??!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Gonzales",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T17:04:03.000Z",
          "Titre": "DO NOT PURCHASE THIS PRODUCT",
          "Contenu": "DO NOT PURCHASE THIS PRODUCT! As a company, they do not honor ANY claims if you provide the slightest incorrect info when you register the product for warranty. Should you have a type-o or upload the wrong photo, they do not inform you of that mistake, allowing you to remedy the issue. Instead, when you try to file a claim for repairs, they inform you at the time of filing the claim that you incorrectly registered and therefore they will not honor the warranty. m"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sandra varo",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T18:29:07.000Z",
          "Titre": "Don't waste your money!",
          "Contenu": "I spent $60 to get this crap installed on my $1400 phone. Not even 2 months passed and my phone had a broken screen. I don't even recall dropping it. Their warranty is no better than their product. They look for any excuse to denie your claim. A $10 protector from Amazon would of been better. Don't waste your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "margiecamp",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T22:30:40.000Z",
          "Titre": "Filed claim in nov.been turned down…",
          "Contenu": "Filed claim in nov.been turned down with different excuses every time. First it was behind due to covid,then flat out said I bought warranty on same day as repair.not true.I sent both warranty because I bought a new warranty for repaired screen.Ashley at cell helmet refused to look at all the receipts or she would have understood."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry S",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T14:43:33.000Z",
          "Titre": "Will not use Cell helmet again",
          "Contenu": "Got a scratch on the screen of a new phone only a month after applying the product.  First time I ever got a scratch on any of my phones.  I try to be very careful with my phone.  I do not recall dropping it or putting it with anything that could scratch a screen.  Will be sticking with tempered glass screen protectors."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Not worth it",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T15:04:07.000Z",
          "Titre": "Not worth the effort",
          "Contenu": "Expensive and registering the warranty is a lengthy and inconvenient process. No thanks to another useless app on my phone. Definitely one of those 'let's make this as difficult as possible, so we can decline the maximum number of claims' type of things."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Luse",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T23:12:54.000Z",
          "Titre": "This product took so long to claim",
          "Contenu": "This product took so long to claim, I missed my window for activating the new Cell Helmet glass, AND the edge of the replacement Cell Helmet screen protector Spider-Webbed just a week after the registration window living inside of an Otterbox 24/7. $80 down the drain."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeanine Velasquez",
          "Nb_Reviews": 1,
          "Date": "2022-05-22T13:24:30.000Z",
          "Titre": "I purchased a $24.99 Cellhelmet charger…",
          "Contenu": "I purchased a $24.99 Cellhelmet charger cord on the advice of a clerk at the mobile store. Never again. Cord stopped working within 4 months. I could have gotten a better cord for a third of the price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Rutherford Williams",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T01:36:37.000Z",
          "Titre": "I would give it a 0 if i could",
          "Contenu": "I would give it a 0 if i could. Worst customer service ever. Will not be recommending that is for sure. You pay 60.00 and download the app on the phone it is used on. Phone gets a crack, have it repaired and they say its not registered to the phone the app is on, but it is registered and the app is useless. Can't even put a claim in threw the app. And have emailed mutilpe times and one email they say it's not registered then another they describe the phone and number. Then tell them yes thats it and i need to make a claim. Come back and say again wrong number, app is not on the right phone but it is. And the app will not let us re-register another liquid glass, which had we known we would not have wasted our money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Obrien",
          "Nb_Reviews": 8,
          "Date": "2021-01-19T12:12:21.000Z",
          "Titre": "Abysmal customer service",
          "Contenu": "The product seems fine so far, but the company has the worst customer service ever! I can't register my product because their google search shows that I have an iPhone 12, but I actually have an 11. I sent them a screen shot proving it, but they still believe google over reality. They have been rude and unwillingly to help me register my product. If I need to activate my warranty it will be no good because the product and the registration won't match. They drove this customer away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NINA MATTEI",
          "Nb_Reviews": 5,
          "Date": "2021-03-08T18:32:08.000Z",
          "Titre": "I made a mistake on a return and a tep…",
          "Contenu": "I made a mistake on a return and a tep sent a new link and said I could return the items and pick again, super cool. But, I really need to talk to someone. This is expensive with the $10 per item fee. I understand that cost. I just don't want to make another mistake and I can't get anyone to call me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aimee Saltzman",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T16:11:40.000Z",
          "Titre": "DON'T BUY",
          "Contenu": "Decided to purchase the liquid glass protector for my new phone even though it was quite expensive. What a mistake! I have been waiting for weeks for someone to help me with the technical issue to help with my registration and NO ONE helped me! Now in the process of waiting for help and contacting them constantly a have a minor little nick in the liquid glass and now they won't even help me complete my registration nor fix it or anything!!! Are you kidding me? What kind of customer service is this! DO NOT BUY!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nameless in Humtsville",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T17:59:36.000Z",
          "Titre": "Installed by pro tech",
          "Contenu": "Installed by pro tech, first good drop screen shattered. Cellhelmet accidentally deleted from my phone. No app, no record, NO coverage. Read warranty carefully, they leave themselves many outs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dicj hertz",
          "Nb_Reviews": 3,
          "Date": "2021-01-19T20:19:48.000Z",
          "Titre": "Cellhelmet is a rip-off don't use them",
          "Contenu": "I tried to submit a claim but they told me my contract was only good for one year and I was never told that when I purchased the policy they are a complete rip-off. And as you can see from their lame reply, how was I supposed to know before I bought it if the salesman never told me it was only good for a year"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T20:42:42.000Z",
          "Titre": "Not so great Replacement",
          "Contenu": "There was no reason for UPS to not deliver my package to my parents home where it was being sent. Instead now you cancelled my order. I think your company is not so great if they cant keep their word for lifetime replacements and they charge you to replace something that was broken."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl Myers Wise",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T13:24:43.000Z",
          "Titre": "Poor customer service with regards to…",
          "Contenu": "Poor customer service with regards to the warranty. I registered my product.  Kept my card, box and receipt. They are telling me they emailed me a PIN and that I did not respond with 30 days..so no warranty.  When you buy this product, you are buying a warranty for repair.  Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T21:41:27.000Z",
          "Titre": "Wireless charger doesn't work half the…",
          "Contenu": "Wireless charger doesn't work half the time and also bought a mount that works with a magnet that you can't use with a wireless charger and the company told me to pay shipping to return it. Funny if I bought it from Amazon I could just go drop it off at ups. Lesson learned use Amazon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T03:19:23.000Z",
          "Titre": "Your company really is garbage",
          "Contenu": "Your company really is garbage. Full of cheaters and liars. You don't honor your guarantees at all. I tried to make a claim to get my screen paid for and all I got was excuses as to why you won't honor your guarantee. You're all fake! I have referred so many of my customers to you and your products thinking that it really was a great company to work with, but now I know that I have let don't those customers. I have received my one and only warning sign. I will never buy your stuff again and I will never sell your products again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cynthia Herrera",
          "Nb_Reviews": 1,
          "Date": "2021-05-07T05:59:52.000Z",
          "Titre": "Had cellhelmet put on by retailer",
          "Contenu": "Had cellhelmet put on by retailer, who also registered my phone with them. Months later my phone screen cracked. They refused to pay the claim because the screen shot that retailer took was of the ceiling.  Don't bother making a claim. They don't live up to thier warranty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shar",
          "Nb_Reviews": 1,
          "Date": "2021-01-06T15:21:47.000Z",
          "Titre": "Cellhelmut is a waste. Product didn't work",
          "Contenu": "I am a disabled veteran with a  tbi. I tend to drop things alot. I dropped my phone on my living room floor Christmas Day and it cracked after a month. I didn't know I had to register within 30days (purchased 17Nov with an initial repair) had it repaired again 26Dec. Cellhelmut said sorry, can't do anything but offer a discount on another purchase.  I refuse to ever buy this product again, it didn't work the first time.  In the past I've used Zaggs Invisible Shield and never had an issue or used a claim."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Reed",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T21:14:07.000Z",
          "Titre": "Purchased product from dealer and phone…",
          "Contenu": "Purchased product from dealer and phone screen Cracked 6 months laterSuppose to recieve 300 for repair but they said they wouldn't because verification picture in app wasn't as clear as they wanted, asked dealer about this and showed him information that ashley sent in email and he said that's bull ans is not carrying them anymore.  Replying to your reply picture was clear and the owner of the store even said that within 5 seconds while looking at the picture.  Your response is to save face Goodluck screwing over others"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca Flint",
          "Nb_Reviews": 1,
          "Date": "2021-01-05T11:39:21.000Z",
          "Titre": "This company is a Joke",
          "Contenu": "This company is a Joke, I advise you not to buy this product. My call phone was repaired one day after the warranty expired. NYS has been hit hard by the Covid and repairing my phone was not on the top of my priority list. Firstly, the denied the claim because of the time line. Secondly, they denied saying the picture sent was not adequate. So in essence they knew all along that after paying for this product they had no intention of honoring the warranty. Stay away !! Tell your Verizon store to rid themselves of this rip off.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CellUser",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T01:14:59.000Z",
          "Titre": "shipped totally different case then what I ordered",
          "Contenu": "Ordered 13 Pro case-got a random 6.7 case that says 2021 on it so now cant even use it. Emailed the company and still haven't heard back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JESSICA",
          "Nb_Reviews": 2,
          "Date": "2022-03-18T21:05:22.000Z",
          "Titre": "Love the case hate the tempered glass",
          "Contenu": "Love the case.  The tempered glass for the camera on the other hand sucks.  Put it on and fell off in less then 24 hrs. Would not recommend it at all.  Paid 20 for something that will probaly not even stay on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Jones",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T12:46:47.000Z",
          "Titre": "Product didn’t work on first drop",
          "Contenu": "Product didn’t work on first drop, less than 3 weeks from purchase. Claim was denied because picture wasn’t “clear” enough when I registered product, which appears to be just a way for them to flippantly deny claims. Stay away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NILE LLC",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T15:31:39.000Z",
          "Titre": "Do not buy this product they make the…",
          "Contenu": "Do not buy this product they make the registration not user friendly, only not to have to pay out claims. Please save your money they only care about getting your money not the satisfaction of their customers. This is one of the worst things I have ever bought. its not a streamline process and their communications/customer service is as bad as the claim being paid. I hate when companies abuse people like this and take advantage. People work hard for their money its not right to scheme people out of it. Find ways to help people instead of trying to get over and make a couple bucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marlo Cook",
          "Nb_Reviews": 1,
          "Date": "2021-05-23T21:30:29.000Z",
          "Titre": "Not worth the money- warranty is B.S.",
          "Contenu": "I purchased a cord for 24.99 and it stopped working. I was able to get another under warranty for 9.99. Within a few months it stopped working so I contacted to company get another but I didnt want to pay 9.99. At this point the cord would now cost 44.99. They gave me 5.00 off and I received the wrong cord and had to order another one and it didn’t accept the discount so I paid another 9.99. I contacted the company and they wouldn’t credit my card the difference. SoFor 1 cord the total cost 49.99. TheWarranty is just words. You can buy a cord anywhere for 9.99 and replace it every 3 or 4 months."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jayzel Torres",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T13:18:11.000Z",
          "Titre": "I’ve purchased the liquid glass and my…",
          "Contenu": "I’ve purchased the liquid glass and my phone still broke! I’ve had to pay out of pocket for the repairs and have had no luck getting in contact with representatives. I’ve called, filed a claim, emailed and attempted live support. EXTREMELY Unsatisfied!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tammy Levent",
          "Nb_Reviews": 3,
          "Date": "2021-01-27T03:32:03.000Z",
          "Titre": "Cellhelmet is a complete joke",
          "Contenu": "This company is a complete joke.  Submitted a claim and in error took a photo of myself than in the mirror.  They would not allow me to resubmit the claim. THEY ARE NOT HUMAN. THEY MAKE NO MISTAKES. As a customer that received no customer support. I went off. Instead of helping the situation they called my boss and threatened her with liable actions.  To put her company in social media, and more threats.   A letter was sent and they basically denied the claim WITHOUT a legit reason.  Because they can. BBB is next. As well as the Pennsylvania consumer Department of Agriculture. Stay far away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Betzelos",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T14:13:03.000Z",
          "Titre": "This is the worst company I have ever…",
          "Contenu": "This is the worst company I have ever dealt with. The do not respond to claims, keep sending me to different numbers and email addresses. Trying to speak with someone that has knowledge of how to complete a claim is impossible. Do not use this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Stump",
          "Nb_Reviews": 2,
          "Date": "2021-06-05T12:45:30.000Z",
          "Titre": "obviously doesnt work",
          "Contenu": "obviously doesnt work when my phone fell from my pocket and shattered on the parking lot asphalt. that was barely 3 feet. and then of course, the company fails to honor their $300 repair guarantee. uselss junk and liars/theives that sell it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kattia Villegas",
          "Nb_Reviews": 5,
          "Date": "2021-02-07T01:09:16.000Z",
          "Titre": "SCREEN SCRATCHED.The warranty expires in 30 days.",
          "Contenu": "The warranty expires in 30 days. There is not contact information in their site either. NO CUSTOMER SERVICE AT ALL. To use the warranty you must register the product.I bought the liquid glass screen protector but I kept using the 3 in one case (it has screen protector). After a month (warranty is expired) I dropped the phone and the screen protector broke. I did not buy another one (too sad). Only a week after the phone screen got scratched some  lights and a couple deep. Money to the garbage and the screen with scratches. Fortunately the screen is not broken. The liquid glass protector is totally USELESS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J. Arthur Mitchell",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T23:19:04.000Z",
          "Titre": "Cell Helmet is a terrible company",
          "Contenu": "Cell Helmet is a terrible company. Read the REAL reviews, not the ones they pay for. They do anything not to pay a claim. Go to BBB and see all the complaints. UBreakifix should be ashamed of themselves for selling this useless product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer Stosz",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T01:09:10.000Z",
          "Titre": "Insurance is not guaranteed",
          "Contenu": "I only paid for the liquid screen protector because of the guaranteed insurance. The insurance is not guaranteed after 30 days but that’s only listed inside the box, if I knew that I would have actually registered on time. Waste of money and time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-06-30T20:49:07.000Z",
          "Titre": "I had a phone repaired got the cell…",
          "Contenu": "I had a phone repaired got the cell helmet and the warranty. On the warranty it said I had 30 days to set it up. We were also told that we couldn’t set it up within the first 24 hours actually the place told us two days so we waited. They apparently needed the time to have the soul helmet set. Within two weeks well within the 30 day period that they allowed us my daughter dropped her phone and it broke. I paid for the insurance and I was in the 30 day window they denied the insurance. This company is not only not on the Better Business Bureau it doesn’t back its work by saying yes we will honor it it also thinks that every client is lying to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anton Mayers",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T15:06:52.000Z",
          "Titre": "I will never buy their Products again!!!",
          "Contenu": "I purchased the screen protector when I broke my phone and the registration process failed for some reason. The screen broke a second time so I had to pay for it myself at which time I bought another screen protector and register it successfully when I got home. A few months later the screen broke again using their protector so I filed a claim. They denied my claim stating that I registered the screen protector the same day it was purchased and I should have waited 24  hours to register it. I am out $140 for their products and almost $600 in repairs. I will NEVER buy NOR recommend their products ever again. They refuse to make this right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ted Cray",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T15:40:29.000Z",
          "Titre": "I was robbed by Cellhelmet of my $300…",
          "Contenu": "I was robbed by Cellhelmet of my $300 liquid screen protector coverage.  I registered online, jumped through all the hoops.  24 hour countdown timer started with app. Downloaded to phone.  Have original receipts, pin numbers.Apparently there is another layer of information you must register within 30 days.  Cellhelmet says they have no records of my information.    Now, 8 months later I have cracked screen on my Samsung Note 9.  Very disappointed with $50 Cellhelmet Liquid Screen protector.      Good news is the Vendor that sold me on Cellhelmet Liquid screen protector is willing to give me $50 credit towards  screen replacement. Still will cost me close to $200 out of pocket."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Robles",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T11:30:55.000Z",
          "Titre": "Dishonest an scammers",
          "Contenu": "SCAMMERSDo not use them more than once ever!I purchased their item for a second time in a different state and the pin code on the card was the same AS A PIN CODE THAT I USE IN GA compared to Florida.  They accused me of making a mistake and used the old pin twice.  I told them I never kept the old pin card I threw it away once I registered. Why would I use an old card I used the card that I purchased and registered that day. I spent $60 on it. Do you guys know the odds of getting the same pin twice mixing 10 digits and letters together is like in the millions. They do this on purpose so they can deny your claim. Honestly felt so betrayed and hurt because I trusted them. Don't use them believe me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Wagner",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T23:59:06.000Z",
          "Titre": "I was sent the wrong screen protectors…",
          "Contenu": "I was sent the wrong screen protectors I need iPhone 11 I was sent iPhone 7/8 I sent an email to get the correct ones sent and still haven’t heard back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MITCH F.",
          "Nb_Reviews": 4,
          "Date": "2023-01-13T01:16:03.000Z",
          "Titre": "ON HOLD FOR 30 MINS!!",
          "Contenu": "I was on hold for almost 30 minutes and I finally gave up. I decided to call another time. If the same occurs a second time, I will CANCEL my account altogether!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie Livesay",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T02:56:46.000Z",
          "Titre": "Uhhh there’s other companies and products that do better",
          "Contenu": "Warranty was not easy to use.  The store I purchased it at threw away the original info I needed when they installed the cover.  Contacted your help desk- they were pleasant- but a code they provided, still didn’t work due to the new iPhone 14 pro  did not have a warranty option (per your rep) The cover only lasted 8 s days before there was a scratch that caused distorted photos."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sue Bulger",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T23:26:55.000Z",
          "Titre": "the screen seems to crack very easily",
          "Contenu": "the screen seems to crack very easily:  this is my first time with this product and it does not seem to be durable at all.  Also disappointed that I have to pay 9.99 for the replacement when it is free lifetime warranty. This was not the case with my last product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Dion",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T00:08:21.000Z",
          "Titre": "Broke jus as fast as any other !",
          "Contenu": "Broke jus as fast as any other !! And was more cost for it so do the math"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Blair",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T02:12:45.000Z",
          "Titre": "This is the 3rd one on this phone",
          "Contenu": "This is the 3rd one on this phone. I bought the phone in August It makes me laugh when it said military tested. My guess is you had the Air Force test it. It sure doesn't live up to a U.S. Marine lifestyle."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darrell Zook",
          "Nb_Reviews": 9,
          "Date": "2022-10-06T19:04:52.000Z",
          "Titre": "Very hard to use hard to register and…",
          "Contenu": "Very hard to use hard to register and never sending responses"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leta Stanfley",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T18:27:50.000Z",
          "Titre": "I got into the website to order a new…",
          "Contenu": "I got into the website to order a new charger that was under warranty.  I felt the site was difficult to find the warranty section and called the number listed.  They referred me to a website that was the exact same thing and I felt I was going in circles.  I found another number to call and they gave me an email address, who gave me different directions to find the warranty section.  I ordered a new charger and was sent the wrong one.  I finally just gave up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bethany Swanson",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T20:49:19.000Z",
          "Titre": "The process to return the item was very…complicated, expensive, and time consuming",
          "Contenu": "The process to return the item was very complex, I also had to buy another one without the discount I had on the original offer, I just wanted a replacement and instead had to pay to return to the product and spent more for the same item. I love the product but the response time/ customer service is not very good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Toy",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T19:50:48.000Z",
          "Titre": "The phone glass screen cracked within a month",
          "Contenu": "The phone glass screen cracked within a months time, from dropping my phone, (but I never had a problem with my phone cracking with the original screen )that was July 27, 2021. As of today, 9/22/21, I am just being reimburse although my receipt was downloaded on Aug 9, 2021. Be prepared to wait on your reimbursement check."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tameika Jackson",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T20:12:18.000Z",
          "Titre": "My phone is protected by Cell Helmet…",
          "Contenu": "My phone is protected by Cell Helmet and has worked well, until this past weekend. I dropped my phone, and yes...It cracked. Now I'm in the process of getting the warranty I paid for. I'm waiting to see what will come of my cracked screen. Im being honest- Its not looking good. I cant simply call customer service; Its only available online. This is not a good situation to be in, so I hope the process is simple...I'll keep you all updated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darlene",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T16:49:40.000Z",
          "Titre": "Tried to get help with a claim",
          "Contenu": "Tried to get help through the chat with a claim. The customer service chat agent couldn’t find my registration. Did not help.I called cell helmet and they were able to find my registration that the chat agent couldn’t find. So, I’m editing my review to show why I gave two stars to chat assistance agent who failed to find that I indeed had registered my cellhelmet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam Lowrey",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T19:19:55.000Z",
          "Titre": "I waisted $60",
          "Contenu": "If you believe in the value of your product, you should send a free second application of your product via mail. To only reimburse the cost of the repair without reimbursing the cost of the cell helmet liquid itself is an oversight. Since I realize that I waisted $60 on the purchase of the original cell helmet application, I will no longer purchase anymore products from you. Thank you for your time. Adam Lowrey"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NIKKI STEVENSON",
          "Nb_Reviews": 1,
          "Date": "2020-03-15T01:37:06.000Z",
          "Titre": "Registering the product feels shady",
          "Contenu": "The steps you need to go through to register this product just to insure you can make a claim if the need arises is RIDICULOUS ! The process really gives the impression that they are trying to do everything they can to make sure loopholes exists should a claim be denied. I haven't had to make a claim but I will never buy another product from this company. Just feels really shady."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peter K",
          "Nb_Reviews": 6,
          "Date": "2020-02-05T06:28:09.000Z",
          "Titre": "i broke the lifetime warranty tempered…",
          "Contenu": "i broke the lifetime warranty tempered glass on my phone. when i replied to them asking how i get the earranty initiated i was basically blown off, instead being pointed to buying a new init instead. i opted in purchasing their liquid glass after fetting fed up with their round and round that goes no where warranty page. i will not ever buy the tempered glass replacement for a phone from thos company ever again. its not woryh it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Perry Thompson",
          "Nb_Reviews": 2,
          "Date": "2019-11-04T15:43:01.000Z",
          "Titre": "it works well but the fine print will…",
          "Contenu": "it works well but the fine print will get you it should be made very clear the warranty is only for one year with the cost of it. I will not buy it again for the money ill go with another product i let them up sale me to the 300 dollar one so now im out 240 bucks to fix my phone and the cost of the useless screen protector only reason i bought it was for the  warranty.So in all decent product not worth the cost unless you break your screen frequently."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2019-11-22T19:27:06.000Z",
          "Titre": "Jolan was somewhat helpful",
          "Contenu": "Jolan was somewhat helpful. They did answer two of my questions, what an IMEI was, and why I couldnt send them a picture through the IM. My plan was to send a picture of my device to them so they can confirm that's what was needed. When i asked if there was a data cap in the IM window they did not answer and reiterated that the photo has to be send to the customer service email. This was insulting as i was just trying confirm I took the correct picture."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Damian Kondrotas",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T16:46:08.000Z",
          "Titre": "Poor fit on warranty replacement",
          "Contenu": "Everything was great with the initial product. However, I just requested a warranty replacement for the screen protector because it cracked (thereby doing its job and saving the screen). The replacement that arrived is a very poor fit which leaves fairly large gaps around the edges. I sent CellHelmet a message through their website about the problem but have not received a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MINDY WILLSON",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T18:52:33.000Z",
          "Titre": "They were quick to ship a replacement",
          "Contenu": "They were quick to ship a replacement.   Unfortunately, the new screen protector looks horrible and never properly adhered to the screen, so half of the screen has a bubble on it.  We even took it to the cell phone retailer to make sure it was installed properly.   I will not buy this product again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Louis Bottegal",
          "Nb_Reviews": 3,
          "Date": "2019-04-25T15:12:00.000Z",
          "Titre": "Not Sticking!",
          "Contenu": "I cleaned my cell phone case very well and waited until I knew it was dry. The magnet did not stick well and came off after only one day of use. Also, the tape for the base was not very effective and I had to use another piece, that was provided with my order, to get it to stick to my dash. Overall not very satisfied for the price. I have not had a chance to contact the company about this yet however. Hope they will make it right."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "daniel",
          "Nb_Reviews": 4,
          "Date": "2019-03-04T21:44:04.000Z",
          "Titre": "this product did not last more than 2…",
          "Contenu": "this product did not last more than 2 months and i got scratchs on the glass deep scratchs ......then you must come out of pocket for repairs and the time consuming process of that then your money is held during the claim process and finally re-imbursed.......my opinion is if they say this product can support glass damage and come to find out i didnt ......we the customer shouldnt have to come out of pocket for the repair"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Smith",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T20:31:20.000Z",
          "Titre": "When I purchased this item",
          "Contenu": "When I purchased this item, was told item was life time replacement. When I went to replace it, was told item not in stock, could only replace it though manufacturer for a fee, $10.00 sounds like a bait and switch, not happy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Meddock",
          "Nb_Reviews": 2,
          "Date": "2021-05-07T21:04:20.000Z",
          "Titre": "Registration app had a shutter delay in…",
          "Contenu": "Registration app had a shutter delay in the required picture step which would only take a picture of a white screen. I can only imagine that if I ever have to file a claim this will be a reason for them to decline my claim. Support is non-existent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kashon",
          "Nb_Reviews": 1,
          "Date": "2018-05-15T23:03:54.000Z",
          "Titre": "Found out that my screen replacement…",
          "Contenu": "Found out that my screen replacement could not be done due an issue with 3rd party screen repair compatibility and the repair could only be done by Apple. I was not notified prior to the purchasing of the product and the voucher for screen repair did not apply to any repairs done by Apple. Was told that I have to wait for Apple to patch the issue with 3rd party screen repairs upon contacting one of the 3rd party screen repair services"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy Gould",
          "Nb_Reviews": 1,
          "Date": "2019-12-30T18:45:27.000Z",
          "Titre": "Liquid glass and scratch remover",
          "Contenu": "I followed all the instructions to a T. I also watched the videos to make sure I was doing it all correctly and I saw zero results on the scratches to my screen. I also did the same thing for the liquid glass screen saver and I’m not sure there is anything at all on my phone as a protective layer. Over all the small scratches I did have honestly are now slightly more visible are buffing them and I have no idea if the screen saver is there or not. These have not been my favorite products sorry to say. 😕"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Matthews",
          "Nb_Reviews": 1,
          "Date": "2019-06-26T23:24:31.000Z",
          "Titre": "Smoke and mirrors",
          "Contenu": "Smoke and mirrors. I was conned into buying the gold plus liquid at my local Sprint store when I picked up my note nine. After a drop from my nightstand (in a case as well) the screen not only cracked, and CellHelmate is clearly not interested in honoring the $300 guarantee. Never falling for this $60 cash grab again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T20:42:28.000Z",
          "Titre": "I should not have had to pay anything…",
          "Contenu": "I should not have had to pay anything for a replacement for lifetime guaranteed product...charge 9.00 on a product that is lifetime guarantee is bogus...the original cord only cost 23.00 you should absorb the cost of shipping since your product did not live up to its gaurantee."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eddy",
          "Nb_Reviews": 1,
          "Date": "2019-08-03T16:53:39.000Z",
          "Titre": "Not the savior you are looking for",
          "Contenu": "Well it did get rid of some scratches I think, but the majority of them stayed. I don't know if I did something wrong, but I ended up being disappointed in the product I did exactly how it read and the results were okay.I have contacted customer support but to no avail have gotten a response. 8/03/19"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cammie Melius",
          "Nb_Reviews": 2,
          "Date": "2019-10-18T16:01:09.000Z",
          "Titre": "Good product... poor customer service.",
          "Contenu": "Great product, however, buyer beware!!!!! After you purchase this product You NEED to fill out a form and download their app. I've had the product on my phone for a year and they WILL NOT cover their promised screen coverage, even though I purchased the Liquid Glass PRO+ Screen Protector - Phone/Watch - $69.99 - no card doesn't matter what level you buy they DO NOT cover you. Unfortunately, I will never use this product again as they don't really mean their coverage. So sad customer service is poor at best."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bonnie",
          "Nb_Reviews": 1,
          "Date": "2018-05-15T15:49:40.000Z",
          "Titre": "I bought my cable from a Verizon store…",
          "Contenu": "I bought my cable from a Verizon store and 3 days later it quit charging my phone. I took it back they said I had to go online and get a replacement. I did that and was charged 9.99! I only had the 1st one for 3 days and ps over $30 for it and then had to pay another $10 for a replacement? Sounds like a scam. NOT HAPPY"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SSShadow Wolf",
          "Nb_Reviews": 1,
          "Date": "2019-05-16T14:21:57.000Z",
          "Titre": "The glass protector is useless in…",
          "Contenu": "The glass protector is useless in protecting your glass. We've had 4 screens replaced already. Only good side is it's like an insurance plan that does cover getting the screen replaced. It's good for that but this time around I'll be getting a 2nd screen protector for back up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KYLE",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T22:37:12.000Z",
          "Titre": "My 20 watt plug and cord only lasted 4…",
          "Contenu": "My 20 watt plug and cord only lasted 4 months. Then I had to pay 21 dollars for a handling fee even though it's a lifetime warranty. I'll buy another brand next time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GDennis",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T15:06:20.000Z",
          "Titre": "Your registration process is cumbersome…",
          "Contenu": "Your registration process is cumbersome and inefficient.  During the registration process I tried multiple times to put in my ten digit serial number to no avail.  Out of frustration, I’ve chosen to not try again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cynthia bernabe",
          "Nb_Reviews": 1,
          "Date": "2019-08-22T03:40:24.000Z",
          "Titre": "It said it can last long 4 months later…",
          "Contenu": "It said it can last long 4 months later and I have to play with the cord to get it to charge.. at that point I'm like yes there is warranty. But it cost 10 dollars. Really I should have just bought a better one. Only good thing is that it's a really long charger"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2019-04-04T16:05:03.000Z",
          "Titre": "Cellhelmet has crappy product and customer service.",
          "Contenu": "I cracked my screen the end of March I called in a claim it was like an act of congress to get a claim number a week later it broke again I called to claims and now you have to pay for the repairs out of your pocket and then file a claim and it can take between 2 to 6 weeks to get your money back. I will never put Cellhelmet on any of my phones again it is crap it don't hold up for crap. They make you feel like you are trying to screw them when you have to show that you purchased there product.I did register my Cellhelmet but you guys make it hard to do a claim."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KATHY DONOHOE",
          "Nb_Reviews": 4,
          "Date": "2019-11-26T03:01:23.000Z",
          "Titre": "I got a new iPhone XR",
          "Contenu": "I got a new iPhone XR. The coating cracked - causing me to get the iPhone screen replaced. Corner cracked - so not sure if it was the person applying the CellHelmet. Question for those that have received their warranty check - which company issues the check?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mary bodner",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T13:39:44.000Z",
          "Titre": "replacement",
          "Contenu": "customer service was ok ,I really did not expect such an expensive product to crack after only 3 months of use and no know droppage .To have to pay to have a new one shipped to me with a lifetime warranty I though was  very poor business practice"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jgc326",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T14:01:51.000Z",
          "Titre": "False Advertisement",
          "Contenu": "I had to pay $9.99 for \"processing\" for a glass screen protector for my phone that has a lifetime warranty on it.  I had to pay a 1/4 of the original price of the item to receive a replacement.  This appears to be false advertising. When I tried to get an explanation for the fee, I called numerous listed numbers and they all redirected me back to the website to file a claim and the only way to file a claim was by paying the processing fee. It was very frustrating and felt like the system was created to force me to pay the fee. I will not be purchasing other items from cellhelmet in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Ryan",
          "Nb_Reviews": 1,
          "Date": "2019-08-06T15:05:20.000Z",
          "Titre": "I followed the instructions, but...",
          "Contenu": "After I followed the instructions it removed the scratches but added some in it's place, so I'm back to square one. The scratches are the tiniest they can possibly be but I bought your product because I can be OCD about having a scratch free screen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2018-05-22T16:07:41.000Z",
          "Titre": "The 1st one I  got for my s8 Galaxy…",
          "Contenu": "The 1st one I  got for my s8 Galaxy broke in my pocket. I went through the process and it was replaced for $9. The 2nd one I got did not stay on even though I followed all the recommendations for installing it. It kept coming off, and in addition, I could not swipe down from the top(a problem with both the first and second one)because the top of the cell helmet was not sensitive enough to pull down the settings menu. I ended up not using it at all and it is back in the Box. Just don't think it was designed very well for the S8 Galaxy phone. Wish I could get my money back for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Madison Reeves",
          "Nb_Reviews": 3,
          "Date": "2018-05-22T15:40:21.000Z",
          "Titre": "My first QI charger broke with hardly…",
          "Contenu": "My first QI charger broke with hardly any use within months, completely refused to charge. Cellhelmet gets 2 stars for shipping me a new charger for free with the warranty replacement program, but ive used this new charger 3 times and its not charging anymore."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbie Kellington",
          "Nb_Reviews": 2,
          "Date": "2021-02-17T19:37:10.000Z",
          "Titre": "I had my cell helmet installed on my iPhone  12",
          "Contenu": "I had my cell helmet installed on my iPhone 12 at Verizon. I was told it was a lifetime warranty. I would have to pay only for the glass  of 9.99.  When it was defective and chipped all around the edges, I went in to my store where I had it installed and was told I had to go online to get a new glass sent to me. I would have never bought it if I had known what a pain it would be to get a new one. I reached out to cell helmet and it was terribly difficult to figure out what to do. Finally during a chat online I was able to get help. I still had to pay the 9.99 even though it was defective. The only positive was the nice guy I talked to in the chat. I feel it’s to difficult to get a new one, the store should have them to replace."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Todd Gregg",
          "Nb_Reviews": 3,
          "Date": "2020-08-18T00:24:48.000Z",
          "Titre": "Bought one 2 mths ago",
          "Contenu": "Bought one 2 mths ago. It already started to peel away from facing. Received a new one for free, but, had to pay shipping & handling. I’ll wait to see how this one performs and hopefully give a better review"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arina K",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T19:56:29.000Z",
          "Titre": "2 cracks within 3 weeks of use",
          "Contenu": "2 cracks within 3 weeks of use. The 2 starts is on quality of the product only. My claim was rejected due uploading wrong photo, which was my fault. Please make sure upload correct photo."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Inman",
          "Nb_Reviews": 1,
          "Date": "2020-10-14T15:04:43.000Z",
          "Titre": "The screen protecter did protect my…",
          "Contenu": "The screen protecter did protect my phone but it didnt even last a week and it had a chip in it.  I had to pay another $10 for a free replacement.  Obviously someone does not understand the concept of free!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Schofield",
          "Nb_Reviews": 2,
          "Date": "2020-03-30T20:54:46.000Z",
          "Titre": "No returns!",
          "Contenu": "I bought two charger cables for $45.00 total. They weren’t the right size for my charger base but I couldn’t return them. Never heard of any business not allowing returns especially when they are undamaged, etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean Murray",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T20:24:37.000Z",
          "Titre": "DO NOT BUY!",
          "Contenu": "The scratch remover did very little to remove the scratch on my screen. The very obvious removal of the oleophobic coating on my screen is much more noticeable. My phone is now in worse condition than before."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robin Barfoot",
          "Nb_Reviews": 2,
          "Date": "2019-07-06T20:44:06.000Z",
          "Titre": "I might come back and change this…",
          "Contenu": "I might come back and change this review but at this point I am not a happy camper.  I bought and installed the product and was told I had 30 days to register it so I could get replacment coverage.  When I installed the app, to continue it is asking me to allow the app to \"make and manage' calls on my cell.  That bothers me.  When I called customer service I was given a song and dance answer that it just would allow the app to access my phones serial number.  If I wanted I could instead go to the cellhelmet web site and register there.  But I went there and I *can't* register anything there.  So she lied to me.  I am very unhappy with this treatment and would not recommend this product to anyone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kristen Marrie",
          "Nb_Reviews": 1,
          "Date": "2018-11-29T18:40:22.000Z",
          "Titre": "Frustrating waste of money and time.",
          "Contenu": "Purchased this with recommendation from the sales agent. Bought it for two new phones. Went online, registered two phones and on we went. Two months later - one of the phones was dropped and the screen cracked all the way through. Later the screen no longer work. Now it's a nightmare trying to process the claim. One, you cannot talk to a person - it's all over e-mail and two, they're saying my phone was never registered in time. But, the kicker - I called earlier and they didn't show it - but told me to just register and it'd be fine. (since one of the phones on the receipt was in fact registered and showing in that 30 day window).So frustrating and I will not recommend it to anyone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicole Angle-Tupin",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T13:32:07.000Z",
          "Titre": "Cracked screen",
          "Contenu": "I’ve used Speck cases for years, and this is the first time with a Speck case that I’ve ended up with a cracked screen, and with a short drop.   Disappointed in what I thought would be a great product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2019-12-16T17:08:44.000Z",
          "Titre": "I got my screen replaced on 12/13/19…",
          "Contenu": "I got my screen replaced on 12/13/19 and got a screen protector put on and a cell helmet case.  Everything was fine.  I didn't get a chance to register my device until 12/16/19.  On 12/16/19, I had to swerve to avoid someone who cut me off and my bag went across the car.  As a result, my screen protector was cracked. Its one of those screen protectors that has a UV adhesive.  I tried to file a claim, but during the chat, it sounded like whoever I was chatting with did not believe me.  Eventually, he just stopped responding.  I'm not super happy right now.  I know the process is a reimbursement process, and I have no issue with that, but when you're chatting with an agent and not getting anywhere, that's where my problem lies."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jo-Anne Blum",
          "Nb_Reviews": 1,
          "Date": "2020-04-08T21:29:43.000Z",
          "Titre": "Product- good Claims-very poor",
          "Contenu": "I am happy with the product. My child has dropped her phone countless times with no shatter. I have 5 products protected. HOWEVER, when my daughter broke her phone, I called the number and put in a claim. Since I have so many products, it was against the wrong item. Now the claim is denied. I've been trying to speak to a person. Sent chat requests. One day I did get a call, I asked for a call back in 15 min. Like many, I am working from home. No return call. It has been a week. Worse than that, the product code that I did use has now dropped the warranty because it was the wrong device. They can tell that by the picture- it is a watch. Why couldn't you tell me I had the wrong claim number when I called. I hope you don't ever have to make a claim."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose C",
          "Nb_Reviews": 1,
          "Date": "2021-06-26T06:55:49.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Cellhelmet’s website is easy to use and navigate. I liked the simplicity of it and how everything was laid out. I will be by more products from them. Thanks Cellhelmet!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T02:14:58.000Z",
          "Titre": "At first the product seemed amazing",
          "Contenu": "At first the product seemed amazing. The screen looked and felt awesome. About a week after installing I had the phone in my pocket, when I pulled the phone out the screen was cracked and spider webbing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela .",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T21:51:13.000Z",
          "Titre": "Quite the Hassel",
          "Contenu": "Almost got denied my claim because even though I had a receipt with the repairs being done before the warranty expired, I didn't email it to the company immediately and therefore was 'out of warranty.' Also, I work a lot and am not available to talk to representatives on the phone. If you file a claim, they will try to tell you to make yourself available all day so that they can assist you.Not worth the money.Edit 6/26/20 to cellhelmets 'rssponse' - So they need my receipts again, even though yesterday the representative I talked to online told me I shouldn't be receiving any calls because my claim was already approved and a refund was supposed to be sent out soon. Apparently the people at this company don't know how to communicate with each other either."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Haydee Linares",
          "Nb_Reviews": 2,
          "Date": "2019-10-03T16:51:52.000Z",
          "Titre": "I paid $ 30.00 the first time for the…",
          "Contenu": "I paid $ 30.00 the first time for the product. I simply don’t understand why I still have to pay again to get another one. It doesn’t cost $10 to ship such a small item. I’m not satisfied."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sir/Ma'am",
          "Nb_Reviews": 1,
          "Date": "2019-03-21T18:53:44.000Z",
          "Titre": "It was a short contact",
          "Contenu": "It was a short contact. I asked about the process of my claim and an update. The person I spoke to did not see any information and told me to call back Friday or Saturday to get an update."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Connie Patterson",
          "Nb_Reviews": 2,
          "Date": "2020-10-16T22:47:26.000Z",
          "Titre": "I have had this screen protector on my…",
          "Contenu": "I have had this screen protector on my phone for less than a week and it already has a chip on the edge. That is what happened to the last one as well. I expected more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 4,
          "Date": "2018-05-22T17:35:31.000Z",
          "Titre": "Might be just me",
          "Contenu": "Might be just me, I do drop my phone a lot, but this is why I bought it. Both times, it only lasted a week before I broke it. On the bright side, my phone screen isn’t cracked, but..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janet Wells",
          "Nb_Reviews": 2,
          "Date": "2019-12-02T17:57:50.000Z",
          "Titre": "Tempered Glass is fine, liquid glass is another story",
          "Contenu": "Tempered Glass is fine, they stand behind that product.  They have problems w/ their liquid glass registration process and dont stand behind it if you dont get it registered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Quinton",
          "Nb_Reviews": 2,
          "Date": "2021-03-31T15:00:38.000Z",
          "Titre": "Great product, Warranty process not so much..",
          "Contenu": "The company has a great pitch to lure you in, and for the most part, the product is well designed. The reason for the low score is more to do with the warranty and registration issues. The warranty is handled by an app and third party in the case of the phone case I bought. The app generated a random IMEI number, and if you do not catch the mistake within 48 hours, you are out of luck. Needless to say, it keeps them from having to pay out in the instance you filed a claim and did not catch it.Update: As predicted I am now three weeks into disputes on the validity of my claim and guess what the issue is; the IMEI. They have stated the 48-hour policy and claimed the app gets the information from the phone so there is no reason for it to be wrong, however, they admit it could make a mistake and that's why they have 48 hours for correction. I will update again once a resolution is made."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-03-26T22:25:58.000Z",
          "Titre": "From the pictures I thought it was…",
          "Contenu": "From the pictures I thought it was textured grips. It was just a piece of smooth plastic. The pics are very deceiving."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "b nox",
          "Nb_Reviews": 2,
          "Date": "2018-12-07T22:37:23.000Z",
          "Titre": "Bought a wireless charger a little over…",
          "Contenu": "Bought a wireless charger a little over a year ago. The charger is extremely inconsistent, and that would be an under statement. The charger works maybe 30% of the time, the other 70% of the time it shows that it's charging but doesn't. Of course the only time I notice the problem is when I am severely low on battery (luckily my other chargers, not from cell helmet, work well enough to keep my phone decently charged) I attempted to return/replace it under the manufacturer's warranty. The cost to do so was roughly half the replacement cost. I've finally disposed of the piece of trash and will buy a replacement from another company. With return/replacement policies like that, on a product that works under 50% of the time, I can't see why anyone would choose to buy again. I know I won't."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Garry Ricard",
          "Nb_Reviews": 3,
          "Date": "2021-08-23T22:59:49.000Z",
          "Titre": "Great customer service",
          "Contenu": "I want to thank the customer service for taking care of the issue I had with a charger, they corrected my issue and made a happy camper out of me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tami Brandner",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T13:26:31.000Z",
          "Titre": "WE received the wrong replacement…",
          "Contenu": "WE received the wrong replacement cords.  When we finally got the right cords, they quit working within two weeks.  These cost too much money to break so quickly!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Colleen Atwood",
          "Nb_Reviews": 1,
          "Date": "2019-05-10T12:23:22.000Z",
          "Titre": "Online order",
          "Contenu": "I ordereplaced an order online, I thought I was ordering a charging cord for my phone, turned out it is for an iPhone.  There are no instructions on how to return it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kina",
          "Nb_Reviews": 2,
          "Date": "2019-10-17T16:13:34.000Z",
          "Titre": "They do not send confirmation emails",
          "Contenu": "They do not send confirmation emails. I’ve ordered from them twice both times no confirmation emails just tracking a few days later. That’s a bit nerve wrecking!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tomas Almonte",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T17:02:21.000Z",
          "Titre": "Very Disappointed",
          "Contenu": "I'm writing this here hoping that more people come forward with similar situations. I followed every one of the requirements to be covered under the warranty. However, since I contacted cellhelmet representatives seeking reimbursement they have only provided excuses (e.g., they are having issues with the server, holidays, etc.) At this moment, it has been over a month since I submitted everything that was requested, including the receipt after completing the repair, and they have failed to inform me the status of this claim or why they are not paying it. They only keep referring to an email that they allegedly sent requesting the receipt that I sent 3 times to them. Please share through this avenue if this is happening to more people or if this is just my case.**UPDATE 12/29/20: After continuous follow up they did pay the claim. This process could have been a lot easier but in the end they honored their commitment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T00:46:29.000Z",
          "Titre": "While the scuffs look much better",
          "Contenu": "While the scuffs look much better, the whole screen feels different now and the deeper marks are more visible when using the device than they were previously"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laie",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T15:40:02.000Z",
          "Titre": "Hit and many misses",
          "Contenu": "This product was easy to register...the first time.  Once I broke the screen, got it repaired and repurchased the cell helmet product, it was challenging to reregister my device.  If you are interested in speaking to a live person, that isn't part of the outsourced warranty department, good luck. I called their \"Customer service\" line only to find that I there was not a live person to speak with there.  I bet if I was a wholesaler, there would have been someone for me to talk to.  I had to \"chat\" with someone in which I found it difficult to explain my predicament.  To the credit of the person I chatted with, I was able to finally accomplish my goal.  However, it should be a much more streamlined process for the repeat customers out there.  I hope I don't have any challenges getting my reimbursement check, for if I do, I will be back here to write another review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Hill",
          "Nb_Reviews": 1,
          "Date": "2019-11-18T21:42:56.000Z",
          "Titre": "Terrible Claim Experience",
          "Contenu": "Terrible Claim ExperienceThe people were nice, but the system and process for trying to place a claim were very difficult.  When you select \"file a claim\" on the app, it makes you call them. Depending on when or where you bought it, they may tell you to call a different number.I sent an email to the claims department with the requested information, only to get a denial back, with a reference to the wrong purchase and warranty date.  They are telling me it's not covered.  But their app on my phone says I have 57 days left.  So now I'm trying to get it processed by calling them, getting transferred, asked to email again....still getting the run around.  Bottom line, don't bother with Cell Helmet, as they seem to be an evasive insurance company, making it hard to make a claim.  Next time, I'll go with a Zagg liquid glass warranty product, since they are the leader in the industry."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MAURA",
          "Nb_Reviews": 3,
          "Date": "2022-02-11T14:19:25.000Z",
          "Titre": "Very fragile",
          "Contenu": "Very fragile, new one broke immediately, and I was VERY GENTLE trying to put the new one on.  Now I’m out $9.99"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2018-05-22T18:58:58.000Z",
          "Titre": "Could be better",
          "Contenu": "The product comes quickly ,which is a nice feature.But the quality of the product is poor.very thin and cracks easily.I guess you get what you pay for....."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roseanne  Moreland",
          "Nb_Reviews": 1,
          "Date": "2021-06-20T00:52:19.000Z",
          "Titre": "Prompt service sadly the new product…",
          "Contenu": "Prompt service sadly the new product flips from charging to not charging like a yo-yo therefore it is defective. Unusable 😥"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph Reis",
          "Nb_Reviews": 1,
          "Date": "2019-06-14T15:38:29.000Z",
          "Titre": "Seem to have issues with privacy glass…",
          "Contenu": "Seem to have issues with privacy glass cracking and paying $10 each time for replacement seems excessive for a product with lifetime warranty."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim Blabaum",
          "Nb_Reviews": 1,
          "Date": "2019-02-26T23:59:36.000Z",
          "Titre": "Unhappy with the charge that I had to…",
          "Contenu": "Unhappy with the charge that I had to for a warranty replacementIf I new that there was a charge for shipping I would have a different brand"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Traver Lentz",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T12:28:27.000Z",
          "Titre": "The $19 fee if kinda BS cause I could…",
          "Contenu": "The $19 fee if kinda BS cause I could just go and get another charger at TJ Max’s for that price that will last as long"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Harris",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T13:25:48.000Z",
          "Titre": "Can't Say That I'm Surprised, Bummer",
          "Contenu": "A couple days after getting my Pixel 4 XL I accidentally slid my phone into the same pocket as my keys and I've been dealing with a couple  scratches/scuffs as a result. I was heartbroken.I bought cellhelmet after doing some research on scratch removers and they had great reviews. The product was cost effective and shipping was decently quick given the current world climate. So far so good.Unfortunately that's where the good news stopped. After receiving the product I followed the directions meticulously as I did not want to make things any worse by using the product incorrectly. I even verified my phone was not on the list of unsupported devices.The three or four scratches on my phone were very minor so I had high hopes that the product would eliminate them all together. To my surprise, after using the buffing compound and wiping all of the excess product off the screen, the scratches and scuffs were still there with what looked to be no change at all.I couldn't in good conscience recommend this product to anyone else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Martin",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T16:19:50.000Z",
          "Titre": "I dropped my phone after applying the…",
          "Contenu": "I dropped my phone after applying the 2nd screen protector and it again cracked in 2 places.  Not happy with the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2019-04-29T19:09:47.000Z",
          "Titre": "Hardly did anything and followed the…",
          "Contenu": "Hardly did anything and followed the directions exactly. Added more scuffs to the screen which is very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roberta",
          "Nb_Reviews": 1,
          "Date": "2018-12-29T15:21:44.000Z",
          "Titre": "not impressed",
          "Contenu": "bought for all our phones 4 // the one with no warranty phone droppd and screen cracked within 4 days of application."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sheila Knight",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T04:20:10.000Z",
          "Titre": "Because I never got any confirmation…",
          "Contenu": "Because I never got any confirmation that my registration was completed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike F",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T12:58:50.000Z",
          "Titre": "Decent product but broke pretty easy…",
          "Contenu": "Decent product but broke pretty easy didn't know it was $10 to replace every time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Sapp",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T15:02:43.000Z",
          "Titre": "Still waiting",
          "Contenu": "Still waiting to register the 2 products that I bought a week ago. unable to enter 16 digit code"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Hynes",
          "Nb_Reviews": 1,
          "Date": "2019-07-04T17:15:22.000Z",
          "Titre": "Emailed about issues with the case",
          "Contenu": "Emailed about issues with the case and have not heard a reply or a way to fix the problem. Nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Autumn Watson",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T18:56:57.000Z",
          "Titre": "I use to LOVE this company when they…",
          "Contenu": "I use to LOVE this company when they first started out. Great product, great customer service,  and easy hassle free warranty process. But now....Ugh! They make a little bit of money and they make everything so difficult.  You send the \"3rd party\" the information needed to file a claim. It'll take almost a week to hear anything back. Customer service is not too bad. Depends on if you can get a rep to even answer you on the chat.The warranty process is such a pain in the rear. Come on Cellhelmet fix this! I have bought a many of accessories from you for my family and myself. I'm talking mother,  sister,  cousin, aunt, uncle, niece, nephew, husband and daughter. This was my go to birthday Christmas presents. I mean liquid glass pro+, the cellhelmet gel case with the $300 warranty, and chargers. Not any more. Now as long as I have to pull teeth to even get my screen fixed. I refuse to buy anything else from you. You advertise hassel free warranty process.  That false advertising. It's a HUGE HASSLE.  Fix it before you lose a lot of customers over careless employees you choose to employ.Thank you,Once was a huge supporter.  Now I'm switching to the basic tempered glass and insurance.  Less BS."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Garrett",
          "Nb_Reviews": 1,
          "Date": "2019-06-03T22:28:14.000Z",
          "Titre": "Bought the scratch remover and it did…",
          "Contenu": "Bought the scratch remover and it did absolutely nothing don’t waste your money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rebecca Wells",
          "Nb_Reviews": 2,
          "Date": "2022-05-08T20:14:24.000Z",
          "Titre": "Ordered for my iPhone 13 Pro and it…",
          "Contenu": "Ordered for my iPhone 13 Pro and it doesn’t fit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phillip Bell",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T15:40:17.000Z",
          "Titre": "It made my Scratch actually turn into a…",
          "Contenu": "It made my Scratch actually turn into a crack very bad product does not work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Florida Thomas",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T07:58:23.000Z",
          "Titre": "Still waiting Resolution to my specific…",
          "Contenu": "Still waiting Resolution to my specific cell helmet product malfunction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T17:00:00.000Z",
          "Titre": "First off let me start by saying I like…",
          "Contenu": "First off let me start by saying I like their product.  I bought my first cellhelmet accessory when I was on a business trip and I stopped by an authorized reseller to buy a charging cable for my phone because I was having problems with the cables I had.  I ended up buying one of their fast chargers with a cable for 3 reasons: 1) I needed a replacement for the fast charger that came with my phone that stopped working, 2) the charging cable worked well with my phone, and 3) the sales rep sold me on the lifetime warranty that came with the product.  After I got home from my trip, I decided to buy an additional charger with a charging cable and 2 additional longer length charging cables.  Everything arrived as expected and everything was good until one of my items stopped working.  At first I thought it was just my phone, but it didn't work with any device and remembering there was a lifetime warranty on the product, I decided to look into it.  So using my cell phone, I went to their site to figure out how the warranty worked and all I could see was a $9.99 processing and handling fee.  I was a little surprised and figured I must be missing something on my small screen so I decided to call them.  The representative I spoke with confirmed the $9.99 fee and when I asked why it was so much she didn't really have a good answer for me.  I personally think this is way too much especially when you consider most of the \"As seen on TV\" products charge $3.99 for processing.  I could say more but I'll leave it as that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marsh Christmas",
          "Nb_Reviews": 5,
          "Date": "2019-04-11T00:32:24.000Z",
          "Titre": "Did not work for me...",
          "Contenu": "Did not work for me.... Followed the instructions TO A T!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Queen Rinda",
          "Nb_Reviews": 11,
          "Date": "2019-08-07T18:10:13.000Z",
          "Titre": "The process of filing a claim is…HECTIC",
          "Contenu": "The process of filing a claim is absolutely nuts! I was told I couldn't be reimbursed because I filed the claim with the wrong company, which is absolutely crazy because I used the Cell Helmet app to obtain the number to process the claim! Than somehow they filed a claim on my new liquid glass rather than my old. Than someone called me saying we need proof of the original liquid glass purchase. I sent that and called the number in the app again, only to get some company called Fortegra , and was told because it was now after the one-year mark it wouldn't be accepted. I was completely confused on who Fortegra even was and advised of my claim number to be told, \"oh that's Cell Helmet's claim number, not ours\" (WELL DUH I don't who Fortegra is as I have a Cell Helmet product and app!!). So I asked for a supervisor and was told one wasn't available. Kenya at Fortegra was rude AND unhelpful, and left me at that. So I reached back out to Cell Helmet and explained the matter. I filed the claim within the one year and sent all supporting documents. I was told they would honor the claim as I had the original email with Cell Helmet claim number on it, along with proof of the date that was within the parameters. The very next day I get an email saying we need document of your insurance claim. Mind you at this point I had emailed the original claim & all supporting documents (proof of purchase of the liquid glass, the insurance claim & deductible proof AND the packaging slip for when I received the replacement device) to 4 different emails including both Cell Helmet AND Fortegra. This process has been nothing but confusion, long and misleading in more ways than one!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T23:01:15.000Z",
          "Titre": "I still got scratches on my screen…",
          "Contenu": "I still got scratches on my screen after using product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "keith rogers",
          "Nb_Reviews": 4,
          "Date": "2019-06-21T22:31:35.000Z",
          "Titre": "Screen broke the first time I dropped…",
          "Contenu": "Screen broke the first time I dropped my phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Foreman",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T16:01:49.000Z",
          "Titre": "My product came on cracked sad"
        },
        {
          "Note": 2,
          "Lieu": "AW",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2018-05-16T13:45:01.000Z",
          "Titre": "Don’t like the Shipping Charges"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jill Daly",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T22:31:14.000Z",
          "Titre": "Crack to easily when dropped"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Crissy",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T03:20:21.000Z",
          "Titre": "Fast and simple!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monica Rivera",
          "Nb_Reviews": 2,
          "Date": "2018-11-25T16:35:13.000Z",
          "Titre": "So far love it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T23:55:42.000Z",
          "Titre": "Replaced after 4 months of use",
          "Contenu": "I purchased the 6 foot cable with lightening adapter (for use with apple play in a Subaru crosstrek) from our wireless provider.  When it failed, the point of purchase wouldn’t help me but referred me to the warranty replacement program through cell helmet.  I was able to replace the $30 cable for just $10.  Cellhelmet customer service was helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Candy Varner",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T16:44:42.000Z",
          "Titre": "As for the service it was great",
          "Contenu": "As for the service it was great, as for the lifetime replacement it's a lie!  Cost for lifetime replacement you don't say it cost $9.99@ time you have to replace.  The \"Glass\" screen protector sucks, this is the third replacement in 8 months, Verizon replaced the others.  If you put your phone in your pocket it cracks the \"Glass\" protector.   Samsung A12 phone with case. Not replacing any more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T18:40:29.000Z",
          "Titre": "This is the second time I had to…",
          "Contenu": "This is the second time I had to replace my cell helmet screens protector and they don’t seem very solid and this one there are tiny bubbles that aren’t coming out and quite annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T23:08:32.000Z",
          "Titre": "Product is good website is very unclear…",
          "Contenu": "Product is good website is very unclear shipping of replacement products is high"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rosemary",
          "Nb_Reviews": 3,
          "Date": "2023-02-03T20:37:49.000Z",
          "Titre": "Cracked Very Easily not happy that is…",
          "Contenu": "Cracked Very Easily not happy that is didn’t hit anything but cracked"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tara Dotson",
          "Nb_Reviews": 3,
          "Date": "2022-08-08T23:27:12.000Z",
          "Titre": "NOT A HAPPY CAMPER!! 😡😡😡",
          "Contenu": "I purchased your product & DID NOT get the warranty as I was convinced by the seller I wouldn't need it. Less than 1 week later my screen SHATTERED!! After having a \"repair\" done I bought the $300 warranty However my phone has not worked properly since putting the product on my phone. I can barely hardly use my screen now as it's not responsive in the center of the screen & when I'm typing it acts as if I'm touching the TOP of the screen & goes haywire. This review has now taken me 36 minutes to complete. SERIOUSLY NOT HAPPY!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melvin Davis",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T11:16:29.000Z",
          "Titre": "Everything associated with the iPhone…",
          "Contenu": "Everything associated with the iPhone is associated with seperating the customer from his or her money after the spend a fair some to purchase the phone.I think it ia a real American tragedy! Consumer lustful affair!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T06:18:42.000Z",
          "Titre": "I thought what i ordered was a phone",
          "Contenu": "I thought what i ordered was a phone. It was just a phone tempered glass screen protector. A helpful tip: it would probably be better and helpful if when you title the item, you type that its the phone tempered glass screen protector for (brand of the phone)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Powers",
          "Nb_Reviews": 1,
          "Date": "2021-10-16T15:32:25.000Z",
          "Titre": "Nothing Special",
          "Contenu": "Material is not easily gripped, constantly feels like its going to slide out of my hand or off my lap. Feels sturdy yet flimsy if that makes any sense.  I have bought hard cases before for half the price that feel the exact same.  The free customization option is nice. I understand companies are trying to reduce their waste; the packaging in a single ULINE envelope with a receipt stuffed inside your case is underwhelming for the price point"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Stelzer",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T19:51:49.000Z",
          "Titre": "I want to put 5 stars but I never…",
          "Contenu": "I want to put 5 stars but I never received my charger since it was sent to my old address. I never got an opportunity to change my address when I put in the order for the replacement charger and now im out a charger and $10. I wish someone would help me because I'm using a darn 3 ft tablet charger that is like being on a leash when using. Please help and let me give a 5 star review after this is corrected 🙏 😅"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Clark",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T18:17:36.000Z",
          "Titre": "Hi there,",
          "Contenu": "Hi there,I was quite impressed with your efficient shipping time and the easy accessibility of your website. The only thing that went wrong was that I had a privacy screen protector when I first bought my phone, and the one that I received from cell helmet was not a privacy screen protector and just a standard.  I thought that this would have been noted from the receipt which I attached.  Other than that, my experience was great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deidre Emerson",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T03:13:12.000Z",
          "Titre": "Great product, repair guarantee not so much",
          "Contenu": "I liked the product a lot, feels very solid for the price, but the repair guarantee is a bit of a bait and switch, and if I had known I couldn't register the product because I didn't buy their screen protection, I wouldn't have paid the extra for the repair guarantee, and just gotten the case itself. The repair guarantee needs to either be an easier process, or advertised more accurately."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2022-03-31T22:47:26.000Z",
          "Titre": "Smells toxic",
          "Contenu": "While it looks greats the smell coming off it is toxic smelling. We have washed it with soap and have it setting outside on patio to see if the smell goes away. Hoping it does if not we will be returning it. Disappointing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Lamb",
          "Nb_Reviews": 2,
          "Date": "2022-04-26T21:42:26.712Z",
          "Titre": "Registration process is a mess",
          "Contenu": "The registration process is anything but seamless and the product does not seem to work that well in that I have had more damaged screens with the product than without it and using a cheap screen protector."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda Berard",
          "Nb_Reviews": 2,
          "Date": "2020-10-14T14:12:10.000Z",
          "Titre": "Unfortunately disappointed",
          "Contenu": "I have used cell helmet screen protectors in the past and they have been great.  Which is why I went to them to purchase a screen protector for my new Samsung S20+.  However, this screen protector did not apply to my phone very well and I was unable to use the fingerprint to unlock my phone.  It was also very difficult to use the keyboard towards the edge of the phone.  I ended up taking it off after 3 days of having it on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vinny",
          "Nb_Reviews": 2,
          "Date": "2021-10-16T14:58:23.000Z",
          "Titre": "Paid extra for two day fedex shipping…",
          "Contenu": "Paid extra for two day fedex shipping for replacement magnets and ten days later still haven't received product.  My road trip came it went and I couldn't use my cell helmet.  Haven't heard a thing from the company and fedex says the magnets are in Tennesse.  The shipping cost more than the magnets.....That all being said, Cell Helmet customer service was excellent when I reached out to them.  I believe the mistake was on fedex and Cell Helmet was prompt to refund me.  I would try again to order when I need to. I used the product in the past and it is very innovative and good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hannah Martel",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T16:29:40.000Z",
          "Titre": "Good customer support",
          "Contenu": "I had issues with the first time I bought this product. They would not honor my claim, but once I realized that it was really my fault, I bought a new screen and liquid pro from cellhelmet and they were really helpful to make sure I registered it correctly. They do respond quickly and were really helpful. If I ever need to file a claim again and it goes smooth, I'll improve the rating to a 5 start."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn Mercier",
          "Nb_Reviews": 1,
          "Date": "2020-11-28T12:53:13.000Z",
          "Titre": "this product MOSTLY protected my phone in the past",
          "Contenu": "I did find that this product MOSTLY protected my phone in the past. That is why I purchased it again. I found that it did NOT protect against scratches so an additional layer is probably required for that purpose. My old phone did get cracked in the upper corner but it survived MULTIPLE drops while using this product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "keith Westrick",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T18:22:11.000Z",
          "Titre": "Product is good",
          "Contenu": "Product is good.  The store that sold the phone misrepresented it.  They said lifetime replacement, if you need help just come back and we'll put on a new one.  But when I went back they were very little assistance.  It took a long time to find out how to get it replaced, even through your website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Traci",
          "Nb_Reviews": 2,
          "Date": "2019-12-12T13:15:04.000Z",
          "Titre": "Good customer service but not impressed with screen protectors",
          "Contenu": "The customer service department is very helpful, but I've had my phone less than a year and am on my 3rd screen protector. I have to pay $10 each time to get a replacement.  I can't recall ever having to replace a screen cover before. So, while I am happy that my phone screen has not been damaged, it is frustrating that the protectors don't hold up better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Van de Vroedt",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T20:26:41.000Z",
          "Titre": "my phone dropped",
          "Contenu": "my phone dropped out of my pocket and the screen cracked. I have the app on the phone from when I purchased the phone and cellhelmet less than a year ago.I don`t want the same thing to happen again once I get the screen replaced so I requested a packet of the liquid protector again. Ashley said she could not find my info based on my credentials provided for some reason.I provided all I had regarding my phone.She provided me with a discount code to order a new packet of protectant .I ordered it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 3,
          "Date": "2021-11-25T23:59:16.000Z",
          "Titre": "I ordered the wrong phone cable and…",
          "Contenu": "I ordered the wrong phone cable and emailed cellhelmet to arrange a return for the right one. They informed me that there was no need to return the wrong one and that I could just reorder the right one! Yes and pay an additional $9.99!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patsy",
          "Nb_Reviews": 2,
          "Date": "2020-01-28T21:03:36.000Z",
          "Titre": "After two months",
          "Contenu": "After two months, the cord to charge my phone wasn't working any longer and I had to buy a new one.  I did contact cellhelmet and was sent a new one in a few days, but in the meantime, I had to purchase one that day because otherwise I wouldn't have been able to use my phone.  I felt that it should have lasted much longer than that?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "john  sabourin",
          "Nb_Reviews": 1,
          "Date": "2020-10-05T14:49:02.000Z",
          "Titre": "The product is excellent",
          "Contenu": "The product is excellent, however the replacement screen protector would not properly adhere to my iphone and I brought it too an iphone professional to apply screen protector for me  - maybe it was a bad batch, regardless the company stood up for their product !!! It’s a strong protector regardless"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rusty Davis",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T16:59:10.000Z",
          "Titre": "I emailed and asked about warranty…",
          "Contenu": "I emailed and asked about warranty coverage and after a few days I was contacted back and they apologized for not being as prompt but are getting to emails in the order received. I am still awaiting on further clarification but they seem to be getting answering questions as fast as they can."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dawn Farrell",
          "Nb_Reviews": 3,
          "Date": "2019-12-17T20:07:05.000Z",
          "Titre": "unhappy with quality and service",
          "Contenu": "I got my screen protector on Black Friday and it was chipped 2 days later.  Hoping the second one holds up better.  The guy at Verizon led me to believe I would just have to go to the store and it would be replaced for $5... well that didn’t happen. Then I had to deal with the shipping issue where it went from your company to 2 different states then to Indianapolis Indiana then back to the first 2 states then back to Indianapolis then to me finally.  Too much confusion"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MWR",
          "Nb_Reviews": 4,
          "Date": "2021-08-29T00:50:13.000Z",
          "Titre": "Not so sure",
          "Contenu": "Customer service has been great, product not so sure.  I started with Liquid Glass/Cell Helmet and once the warranty expired I tried their glass screen protector, paying much more than I have historically for similar products, I’m thinking maybe you get what you pay for…Unfortunately, I have now paid $40 for the original glass protector and had to replace it twice for chips/cracks and/or bubbling. Each “lifetime warranty” replacement costs $10 for processing/handling, so I’m now in for $60…pretty sure I would be better off purchasing 12 $5 glass screen protectors from TJ Maxx/ Marshall’s and still have at least 8 left."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robin Ragans",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T20:34:48.000Z",
          "Titre": "not 💯 guaranteed",
          "Contenu": "Bought 1st cord and charger from Verizon store thinking I was getting a top notch product. Lady told me they had 💯 percent guarantee. 3 was later charger wasn’t working. Went back to store with receipt and box. They said they couldn’t return it. Had to go through cell helmet directly. Then I had to pay 10 shipping...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelli K.",
          "Nb_Reviews": 1,
          "Date": "2018-05-24T01:52:18.000Z",
          "Titre": "Cellhelmet changed my address",
          "Contenu": "For some reason Cellhelmet entered an alternate address for me with a house number of 901. My house number is 932. My package was delivered to 901, they sent it back with the carrier who, for some reason, re-delivered it to 901... and they claim not to have it. So I do not have my most recent order. Cellhelmet provided a tracking number - which helped, but doesn’t get the merchandise delivered to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RazorRW",
          "Nb_Reviews": 3,
          "Date": "2021-01-23T22:55:58.000Z",
          "Titre": "The product is a great product and I…",
          "Contenu": "The product is a great product and I would’ve given it a 5* review if the registration process wasn’t so tedious. A customer should be able to register multiple products on 1 phone app as opposed to having to register the product on the phone it was applied to.   Also a copy of the receipt should be enough for proof of purchase (a code on the receipt would be even better). It is ridiculous to require a copy of the receipt & picture of the item the product was applied to.  For this reason, I will probably go with a different product for our next set of phones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dustin Clark",
          "Nb_Reviews": 1,
          "Date": "2019-11-24T13:49:07.000Z",
          "Titre": "not Totally convinced",
          "Contenu": "I sell this product but after being someone who decided to try it I haven’t been fully convinced this product works. I have watched many videos on cell helmet. My issues is that even after applying the protection to my phone my phone is still getting scratched just from normal use. Doesn’t seem very strong."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Martinez",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T15:46:59.000Z",
          "Titre": "Product didn't meet my expectations",
          "Contenu": "Product didn't meet my expectations. First temper glass lasted 1 month or less and the second one lasted less than a week. Cracks real easy. It's my second time warranting. It's costing me $10 each time when I paid almost $50 for it 😒"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stacey",
          "Nb_Reviews": 1,
          "Date": "2019-11-03T19:02:28.000Z",
          "Titre": "should disclose length of warranty on packaging",
          "Contenu": "This review is not about the product itself, but it should be disclosed on the packaging that the warranty is only covered for a year.  Most people keep their phones for a minimum of two years.  You don’t learn until the end of the registration you only have 365.  I’m glad I didn’t buy the $300 coverage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T14:15:43.000Z",
          "Titre": "New company needs to review some of the practices.",
          "Contenu": "I think it is great that they have a lifetime warranty. I think the free shipping is awesome. The $9.99 for handling for a defective item is a bit much when it is a 1/3 of the cost of the item. I will not be purchasing any future products from your company due to this. I thankfully purchased my items from a Verizon store and was able to get a new receipt from them, I ponder how they honor their warranty if someone had lost their receipt and could not re-visit the location of purchase to obtain a new receipt?!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NR",
          "Nb_Reviews": 1,
          "Date": "2020-08-26T12:41:09.000Z",
          "Titre": "I gave 3 stars overall because of the Poor product",
          "Contenu": "I gave 3 stars overall because of the product. The charger cord is very poorly constructed, no wonder there is such an extended warranty. I replaced the cord and the new one is now not working after 1 week. On the upside, Your customer service was prompt and thorough."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MT",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T13:16:24.000Z",
          "Titre": "The cell helmet tempered glass already…",
          "Contenu": "The cell helmet tempered glass already cracked after one week. Not happy at all with this product. First one was great lasted a few years. Maybe they have changed the product. I gave it a 3 star only because lady was nice helping me order product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JASON",
          "Nb_Reviews": 1,
          "Date": "2019-04-05T18:58:02.000Z",
          "Titre": "Product is great for about a month and…",
          "Contenu": "Product is great for about a month and then starts separating from the screen.  I have been overly attentive with the cleaning, dust removal and application and repeatedly get about 1 month out of the product.  Customer service is great but still costs me $10 to get the replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marsha",
          "Nb_Reviews": 1,
          "Date": "2019-03-20T14:20:41.000Z",
          "Titre": "Inconsistency",
          "Contenu": "Good products; however, not easy to work with when errors made in ordering.  I ordered a Samsung Galaxy 8 + rather than Samsung Galaxy 8 cell helmet.  I did not realize I had done this until I had opened the box.  The product was untouched and in perfect condition; but still could not be returned per cellhelmet policy.  I was told they would send the correct item at no cost.  Several weeks later, I still have not received the product promised.  My order mistake, but cellhelmet does not seem to be following through with what they said they would do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "kara Hanson",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T21:58:13.000Z",
          "Titre": "Do you need my old screen cover as proof?",
          "Contenu": "Not sure if I needed to send in my broken screen cover or not. The versizon franchise store told me I would need to but it was not stated in any communication I received. Also, if my new one breaks over time... how do I get that fixed? Just keep the original receipt?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CAROL S",
          "Nb_Reviews": 2,
          "Date": "2020-02-19T14:15:34.000Z",
          "Titre": "I purchased this online because the one…",
          "Contenu": "I purchased this online because the one I bought in the store 6 weeks ago cracked. They have a replacement warranty but you have to pay $9.99 for it. I've had other brands that have lasted me for years. I'm hoping the replacement does better then 6 weeks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darlene Smith",
          "Nb_Reviews": 2,
          "Date": "2019-10-21T10:46:17.000Z",
          "Titre": "I'm giving the website a 4 because it…",
          "Contenu": "I'm giving the website a 4 because it keeps saying I dont have a account and let me sign in. When I do and I receive emails . I have to fill out new guest every time I go on there. I would give 300 dollar liquid glass a five star I haven't had any issues to make a claim on the liquid glass 300 dollar screen repair. I do drop phone on accident all the time and it has held up for over a year. So that's a good sign thank you for a great product. The hundred dollar  screen repair liquid glass the screen broke in 48 hours. I didn't put claim on it. I bought a new phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2018-06-10T20:27:45.000Z",
          "Titre": "I purchased 2 6ft Apple Lightening…",
          "Contenu": "I purchased 2 6ft Apple Lightening cords. Unfortunately 1 has stopped working on my daughters I-phone 8 and the other will only work on an I-phone 7 and not an Ipad! I was hoping to never buy a cord again for my Iphones. Unfortunately I may have to. Disappointed at this time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 1,
          "Date": "2018-05-22T16:12:40.000Z",
          "Titre": "Satisfied with product, not customer service.",
          "Contenu": "The product itself is phenomenal. The customer service and contact is horrible. They do not keep you informed via email about your order as their page says they do. When you email them your questions and concerns there is no professionalism in the response you get in return."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 3,
          "Date": "2019-06-25T21:50:00.000Z",
          "Titre": "The quality of the screen protector is…",
          "Contenu": "The quality of the screen protector is great and I’ve replaced them several times after dropping my phone or getting a cracked screen. My issue is more with the ATT provider that sold me the “free lifetime warranty” for the screen protector, I bought the first one for a high price since i was told it came with free replacement warranty but soon after I order my first replacement protector I found out I’m still paying $10 every time I need it replaced. If I had known that I wouldn’t have paid $40 then additional $10 for every screen protector I order now. There are much cheaper options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle Hamilton",
          "Nb_Reviews": 1,
          "Date": "2019-10-25T15:18:02.000Z",
          "Titre": "I have to be honest the cell helmet…",
          "Contenu": "I have to be honest the cell helmet itself is good and it saved my phone from breakage.The problem is is when my screen broke the cell helmet they sent me the wrong replacementso while the item itself is good customer service is somewhat lacking"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Grubb",
          "Nb_Reviews": 2,
          "Date": "2022-06-20T21:42:33.000Z",
          "Titre": "Returns are easy exchanges are not",
          "Contenu": "Very strange that the company will not do an exchange for a product. You have to return it and then re-order the correct item. Lots of extra steps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret Magyar",
          "Nb_Reviews": 1,
          "Date": "2019-05-09T21:29:26.000Z",
          "Titre": "Make sure you’re clear on your warranty",
          "Contenu": "When I bought my cell helmet the clerk who sold it to me and installed it told me “there is a lifetime guarantee as long as you own your phone”.  Well, about a year later I noticed the screen was cracked.  My phone seemed fine, thank you so much.I took it back to the store where I bought it and was informed by the salesman that the replacement screen would COST ME $9.95.That is NOT  the way it was represented when I bought it.  Free replacement for the life of my phone was what I expected.  $9.95 is NOT FREE.If I had known I would have to PAY for the replacement I probably would not have bought it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T17:13:58.000Z",
          "Titre": "I find the correspondence lacking and…",
          "Contenu": "I find the correspondence lacking and not very timely with cellhelmet. I had a hard time trying to figure out how to submit a claim and then I waited a few days for a reply. The reply was satisfactory and helpful. I was able to fix my phone screen. I am now struggling to register the new screen for coverage protection. I keep getting an error message. Thank you for the 25% online discount but the repair shop sells the liquid glass so \"begging\" for a 5 star review would not be a honest review from a true customer. I have had issues in the past with my phone and I feel the other company was more timely and on top of it.Addendum: I recently received an email from the company with very clear instructions on how to register again with the company. It's like theybread my mind. They explained their hours, they are not available on weekends which I was not aware of which would make sense to my Friday email and ni response til Monday. Thank you cell helmet for the assistance!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kranda",
          "Nb_Reviews": 1,
          "Date": "2019-05-31T19:06:01.000Z",
          "Titre": "I did not like the new way to get a…",
          "Contenu": "I did not like the new way to get a replacement. It seems the process is designed to discourage warranty replacements. I had to order the replacement. Then return to the purchase venue to get the screen protector installed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2020-03-10T13:51:15.000Z",
          "Titre": "I wish the coverage wasn't just \"A year…",
          "Contenu": "I wish the coverage wasn't just \"A year from purchase date\". I bought my cell helmet kit when I preordered my new phone and I am missing out on the better part of a month of coverage because of this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Morgan Phipps",
          "Nb_Reviews": 2,
          "Date": "2020-12-03T15:17:05.000Z",
          "Titre": "Case does not fit and difficult return",
          "Contenu": "The case I bought does not fit my phone. When I put in on it pushes down the buttons in such a way that it forces my phone into automatic restart, over and over again. I was hoping to exchange it for a case that fit better, but found that exchanges are not possible. When I attempted to return it I could not find any way to do that on the website. I attempted to call using the number provided in the emails and was unable to get assistance. I attempted to use the chat feature on the website and was unable to get any assistance. I finally reached out using instagram direct message and finally got a reply, but was still unclear about what I was supposed to do. I am hopeful that this situation can get resolved, because I was really excited about this product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pankaj Jani",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T14:14:16.000Z",
          "Titre": "You say that you have a lifetime…",
          "Contenu": "You say that you have a lifetime guarantee for the screen but when we want to replace it for it getting broken, you still charge $10. What’s the point of saying a lifetime guarantee?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dianna",
          "Nb_Reviews": 1,
          "Date": "2018-05-15T16:10:22.000Z",
          "Titre": "I have had 2 glass shields",
          "Contenu": "I have had 2 glass shields, both have chipped on edges, split across middle & lifted on sides & corners.  Trying warranty for third time & hopefully have better luck.  Customer service is good though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TP",
          "Nb_Reviews": 1,
          "Date": "2020-11-22T20:13:41.000Z",
          "Titre": "Bubble Issues",
          "Contenu": "I’ve used cell helmet and zagg quite often and always have problems and bubbles with the cell hemet and only once did I have it with the zagg and that was a very tiny one.  Very annoying!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith Lacourciere",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T04:46:53.000Z",
          "Titre": "Scratch Remover",
          "Contenu": "Had a scratch on my new Pixel 4XL, when I got the scratch I was very upset as it was a new phone. When I found cellhelmet I was relieved as their scratch remover gave me hope - I immediately ordered it. I followed all the instructions and read all the warnings. I double checked if my phone was on the \"do not use on these devices\" list and after it wasn't I figured I would give it a try. I followed the instructions down to the letter, and even tried it a second time (still had compound left). I did not get results, perhaps I misused the product - like not pressing hard enough.Cellhelmet has already reached out to me in efforts to resolve.While I didn't get results, I am very satisfied with Cellhelmet's customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca Mitchell cupp",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T22:18:42.000Z",
          "Titre": "Don’t waste your money",
          "Contenu": "Edit: After my last review, Cell Helmet sent me a 6 ft. flat cable free of charge to replace the 10 ft. round cable I was having so many problems with. I’m happy to say the 6 footer has held up much better and still works 3 plus months later. Thank you to Cell Helmet for correcting my issue. While I cannot recommend the 10 foot cable, I’m happy with the 6 footer so far, as well as the customer service at this company. My most recent charging cord didn’t even last two months. I’ve gone through 4 chargers in less than 15 months, and I think I’m finished with this company. A crappy charger bought at a drug store would last longer, and it isn’t a real lifetime warranty since I’ve paid $40 now for my replacements. I’m so disappointed that Verizon recommended this."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich Bradley",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T22:05:31.000Z",
          "Titre": "Replacement received was defective",
          "Contenu": "Replacement received was defective. Wireless Zone was kind enough to take one off the shelf and replace defective received. Quality control should be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gale",
          "Nb_Reviews": 2,
          "Date": "2021-04-11T17:15:34.000Z",
          "Titre": "Was not as easy to put on and so was…",
          "Contenu": "Was not as easy to put on and so was not able to use it. Fingerprints ends up all over. Next time I gues I could go to the store but I didn’t think I’d have to do this"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T15:37:00.000Z",
          "Titre": "The bumpers are too bulky",
          "Contenu": "The bumpers are too bulky, don't like the company label on the case(prefer no lettering) and the edges come up higher than I prefer. Other than that, it works fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rod McClure",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T19:14:31.000Z",
          "Titre": "I love the magnet but the metal plate…",
          "Contenu": "I love the magnet but the metal plate needed some assistance in holding my phone. i hade to use gorilla glue to make sure that the plate wouldn't fall off. works great now"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clint Colomb",
          "Nb_Reviews": 1,
          "Date": "2019-07-13T14:23:33.000Z",
          "Titre": "I feel it a bit over priced for the…",
          "Contenu": "I feel it a bit over priced for the quality and fit and all. Then having trouble registering it for the warranty and guaranty being I ordered directly from Cellhelmet's website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Polly Foster",
          "Nb_Reviews": 1,
          "Date": "2019-12-05T12:24:06.000Z",
          "Titre": "Service would have been enhanced if I…",
          "Contenu": "Service would have been enhanced if I received an email verifying my order and one when it was shipped. I had no idea that the order was received or when to expect the product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christian",
          "Nb_Reviews": 2,
          "Date": "2020-09-22T21:06:44.000Z",
          "Titre": "Customer service rep was highly…",
          "Contenu": "Customer service rep was highly misinformed about product information. However, cellhelmet did issue a full refund, no questions asked, which was much appreciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christy Hume",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T22:25:15.000Z",
          "Titre": "Product came quickly",
          "Contenu": "Product came quickly, but it already has a cracked in it after 2 days of being on the phone. Phone did not get dropped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trish",
          "Nb_Reviews": 1,
          "Date": "2018-05-22T18:24:04.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service, but unfortunately the product seems to break consistently.  Although it breaks, I have not had the screen of my phone break at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T16:03:02.000Z",
          "Titre": "I was unable to register in the 30 days…",
          "Contenu": "I was unable to register in the 30 days due to unexpected work trips. Can I still register now?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Stearns",
          "Nb_Reviews": 2,
          "Date": "2019-07-15T17:44:29.000Z",
          "Titre": "Not a big deal.",
          "Contenu": "eh. it works somewhat. I really didn’t have a bad scratch on my screen. i can see a difference but really not a big deal or worth $20 to get rid of."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tully Corbett",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T20:30:45.000Z",
          "Titre": "I completed the registration and then…",
          "Contenu": "I completed the registration and then when filing a claim they can not find it. I have a copy of the receipt showing I purchased it. Still, they will not honor the warranty. Great business model very profitable I am sure. I will make sure anyone I know does not ever buy this product.Update - Several hours after my chat session and after I placed a 1-star review I received an email saying they had magically found my registration! I have gone through the process and gotten my repair voucher. While ultimately I received the warranty as sold I think the expectation of someone keeping up with a registration code to get the service paid for is a little extreme. Their system should be able to track cell phone number and the person's name because those things seldom change! So would I recommend them? No, I would not. But I bumped them to 3 stars for the follow up in finding my registration I just found it coincidental they found it after I posted a negative review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathan W.",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T01:29:06.000Z",
          "Titre": "Love the Guy Harvey design",
          "Contenu": "Love the Guy Harvey design, but very slippery compared to Otterbox. Afraid I’m going to drop it constantly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 3,
          "Date": "2019-05-28T16:40:38.000Z",
          "Titre": "While I have this protection on my…",
          "Contenu": "While I have this protection on my phone I was a bit surprised that I had to pay to repair my glass first then see if they will pay me back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Dicus",
          "Nb_Reviews": 2,
          "Date": "2020-08-30T15:22:12.000Z",
          "Titre": "These work for a few years but I've had…",
          "Contenu": "These work for a few years but I've had a replacement twice but with a lifetime warranty I guess itll always be replaced if broke"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kaylie",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T23:31:42.000Z",
          "Titre": "Product ok...service good overall",
          "Contenu": "I got the liquid glass on my new iPhone the day after I got it, not being told that I should get additional screen protector on phone because it would still allow scratches to happen, my phone screen now has scratches on it not and I take very good care of my phone. I contacted cell helmet about this issue and they no longer carry the scratch remover kit, which was upsetting, and they told me the only way to fix was to put in claim and get screen replaced...these r very small and minor scratches but I would have gotten a regular screen protector as well if I would have known it could still get scratches just from simple use. I also feel like it took a while to get emailed back with a solution. I will say that I was pleased with the customer service when I did get ahold of someone and they were nice to give me a discount on tempered glass screen protector to prevent more scratches from occurring. I will not be replacing screen as of yet but if it gets worse I will most definitely be putting in a claim."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Omartin",
          "Nb_Reviews": 6,
          "Date": "2019-10-02T14:15:13.000Z",
          "Titre": "the scratches on my phone we're minor… doesn't work",
          "Contenu": "the scratches on my phone we're minor at best your product did absolutely nothing to improve them I would not recommend this product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KM Kelley",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T21:31:56.000Z",
          "Titre": "I have tried to register my device…",
          "Contenu": "I have tried to register my device several times over the last ten days using the app without success.  It does not work.  I tried to register the device on the Cellhelmet website and was unable to do so, as it won't work for phones.  Something is fishy.  I have emailed the company, but no response as of yet.  The product may work, but it seems that there is a scam in registering the device, which would make the warranty invalid if not completed. My experience is very similar to the other user rating who purchased the liquid glass at uBreakIFix one day ago.  Update:  I emailed Cellhelmet on Thursday, December 26th as suggested in the comment from Cellhelmet, but as of December 31, 2019, I have yet to receive any response.  Something is not right and I am cancelling two additional   liquid glass pro plus that I had set aside for me at UBreakiFix.January 2, 2019:  I am updating the rating based on my contact from Cellhelmet today.  They did process the registration, so I should be all set.  It took too long, but I am confident that they followed through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T14:25:54.000Z",
          "Titre": "Slow reimbursement  process with Olive Bridge.",
          "Contenu": "The reimbursement  process with Olive Bridge so cumbersome and slow. I still have not received my check......"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ricky Kinney",
          "Nb_Reviews": 2,
          "Date": "2020-02-25T23:35:59.000Z",
          "Titre": "Kind of confusing I get a lifetime…",
          "Contenu": "Kind of confusing I get a lifetime warranty on their product and then told they don't stock it anymore?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JF",
          "Nb_Reviews": 1,
          "Date": "2019-04-12T20:56:13.000Z",
          "Titre": "I had to wait a while day to get live…",
          "Contenu": "I had to wait a while day to get live chat. Constant communication through emails was difficult and slow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr. Joshua Smith",
          "Nb_Reviews": 1,
          "Date": "2019-06-14T19:56:15.000Z",
          "Titre": "Claims processing has been difficult…",
          "Contenu": "Claims processing has been difficult and tedious. The product is ok.  Customer support is terrible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2018-05-15T18:02:56.000Z",
          "Titre": "I have broken two now",
          "Contenu": "I have broken two now. I am a little rough on my phone. On the bright side, the warranty seems great!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis S",
          "Nb_Reviews": 2,
          "Date": "2019-09-28T15:36:59.000Z",
          "Titre": "Very slow to ship the order",
          "Contenu": "Very slow to ship the order, several days went by instead of shipping the same day or next day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GizmoGuy Entertainment",
          "Nb_Reviews": 3,
          "Date": "2019-08-20T20:48:49.000Z",
          "Titre": "Great app",
          "Contenu": "Great app. Wish some of the videos would load a little fast but for the most part a great app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gregory Lersch",
          "Nb_Reviews": 3,
          "Date": "2019-04-04T12:56:07.000Z",
          "Titre": "I don't think it should cost 9.99 to…",
          "Contenu": "I don't think it should cost 9.99 to ship a cable that has a lifetime warranty on it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Colby Nez",
          "Nb_Reviews": 1,
          "Date": "2019-03-19T15:09:19.000Z",
          "Titre": "Service was good",
          "Contenu": "Service was good, received scratch remover and polish on time. Price was reasonable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 2,
          "Date": "2018-11-05T18:20:29.000Z",
          "Titre": "Great contest for a great product",
          "Contenu": "Great contest for a great product. But sometimes the app has small glitches."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Ricketson",
          "Nb_Reviews": 1,
          "Date": "2019-10-24T17:13:08.000Z",
          "Titre": "Already had to send for a replacement…",
          "Contenu": "Already had to send for a replacement the connection piece to phone broke."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2019-06-24T21:55:02.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Super fast shipping, but it was a replacement and it doesn’t fit my phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RPR",
          "Nb_Reviews": 1,
          "Date": "2019-04-09T20:59:24.000Z",
          "Titre": "**Review Edited** No Customer Service for an exchange",
          "Contenu": "My Verizon store sent in my warranty claim for me to replace the glass shield for an iPhone 8+.  They downloaded the proper receipt for that item but accidentally marked the wrong product in the drop down menu.  \"Honest mistake\" on their part.  So, the wrong item was shipped to me, an iPad4 screen instead of iPhone 8+.  Cellhelmet never even checked that their was an mistake in the Warranty Claim paperwork.  Contacted Cellhelmet and explained everything to them.  The operator who was very pleasant said that the store did send the correct receipt but marked the wrong product in the drop down menu. I offered to return the wrong product in an exchange, which to me makes PERFECT SENSE ..  The operator said they would not make the exchange and I would have to purchase another screen and apologized for the inconvenience.  Now I'm stuck with a screen I have no use for and have to pay \"again\" for another iPhone 8+ screen replacement.  NO CUSTOMER SERVICE FOR SUCH AN EASY EXCHANGE TO HAPPEN.  VERY DISSATISFIED WITH THE WHOLE EXPERIENCE....**** \"Judy\" from Customer Support contacted me and apologized for the lack of options that were initially given to me. She gave me a few options and I ended up getting a full refund from my order. My replacement glass for my phone is on the way.  Judy seemed very sincere and offered me any assistance in the future.  I am grateful that this \"bad\" experience did turn out for the best.  Thank you.........******"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 7,
          "Date": "2019-05-17T17:22:35.000Z",
          "Titre": "Adhesive does not stick to Leather",
          "Contenu": "Love the device but the adhesive does not stick to a leather dashboard."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle Dawn Owens",
          "Nb_Reviews": 3,
          "Date": "2019-04-11T20:12:57.000Z",
          "Titre": "I bought a new Nokia 3.1 plus on Feb",
          "Contenu": "I bought a new Nokia 3.1 plus on Feb. 21, 2019. Bought the $40 liquid glass screen protector on Feb. 23, 2019 from^he Cricket store, and had the girl working there put it on my phone. I thought well this will be good if I  drop it, at least it shouldn't break. Fast forward to about the middle of March. I suddenly had a huge scratch come up. Note I don't keep this in my pocket or purse. I only carry it in my hand, with a popsocket on. I went to Cricket and asked, they said that it doesn't stop scratches, just keeps from breaking. A bit disappointing but ok. Fast forward to today, April 11, 2019. I get out of the car, it fell 2.5 feet if even that far and shattered the screen, not just cracks but hard busted spots that will cut you, busted! I called he Celkhelmet and the girl said I wasn't registered... I had the email  and app to prove I was indeed registered. But they said hat regardless I would have to pay for repairs submit the receipt and then they would verify it and make a decision! Uhm, no! It should not  be have to make a decision as the claid was made less than 2 months after purchasing! I paid Nokia to repair my phone, then submitted my claim to cellh3lmet. Hopefully they will stand behind their product and send me my payment back. I am disappointed that my screen busted when their tests say they dropped a phone on concrete and it didn't bust until it hit 21 feet high and mine fell from less than 3 and shattered. Will buy a screen protector or case from now on!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Edmonds",
          "Nb_Reviews": 1,
          "Date": "2021-10-24T19:18:10.000Z",
          "Titre": "I think you should notify the customer…",
          "Contenu": "I think you should notify the customer when product ships."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JK",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T11:55:50.000Z",
          "Titre": "I think you should make a model with a…",
          "Contenu": "I think you should make a model with a belt clip or a card holder."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tami",
          "Nb_Reviews": 3,
          "Date": "2020-04-08T17:46:57.000Z",
          "Titre": "Have had to replace cords 3x not very…",
          "Contenu": "Have had to replace cords 3x not very durable as said when sold"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith F.",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T17:12:33.000Z",
          "Titre": "Too much money for a mediocre product",
          "Contenu": "Too much money for a mediocre product. Never buy again!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Powers",
          "Nb_Reviews": 2,
          "Date": "2022-05-07T13:43:09.000Z",
          "Titre": "Your glass breaks too often",
          "Contenu": "Your glass breaks too often, too easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JEFF Cosnotti",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T16:50:11.000Z",
          "Titre": "1234",
          "Contenu": "CHAT WAS EASY."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Wright",
          "Nb_Reviews": 2,
          "Date": "2019-04-19T00:13:03.000Z",
          "Titre": "Seems to start separating after 2…",
          "Contenu": "Seems to start separating after 2 months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2018-05-15T17:26:39.000Z",
          "Titre": "They crack too easily when dropped."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2018-05-15T15:34:08.000Z",
          "Titre": "Costs too much and cracks too easy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danielle",
          "Nb_Reviews": 7,
          "Date": "2020-02-04T16:12:40.000Z",
          "Titre": "Thanks",
          "Contenu": "Was anOkay experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Lee Azor",
          "Nb_Reviews": 3,
          "Date": "2018-11-29T05:16:41.000Z",
          "Titre": "Great screen protection"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Hamilton",
          "Nb_Reviews": 3,
          "Date": "2023-10-13T00:07:55.000Z",
          "Titre": "Got it right the second time",
          "Contenu": "Got it right the second time.  I ordered case for my new iPhone 15 Pro.  I liked the styling of this case so I chose it over the Apple brand case.  The caase arrived but only the volume buttons worked - not the main button or the ringer button.I worked with customer support and they finally to which they responded \"We can send out a new replacement free of charge as a one-time courtesy ...\".  One-time Courtesy?The replacement arrived a week after my initial contact over the issue.  I bought an Apple case in the interim to protect my investment.The replacement is fully functional.  So now I have two working cases.  I am grateful the replacement one is fully functional, since I am out of 'courtesy' resolutions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Gleeson",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T06:04:58.000Z",
          "Titre": "Great product",
          "Contenu": "Works great, just wish there was more per vial so that you can be sure to cover all the glass evenly. Otherwise you apply it and can't really tell until it starts to dry if you got it coated evenly, and if not be able to apply to areas not hit properly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NMP",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T17:55:15.000Z",
          "Titre": "Happy with one exception",
          "Contenu": "Prompt and courteous service.  The only thing that I didn't like was the 9.99 fee.  In my experience, I have never been charged for shipping, handling or otherwise for (warrantied replacement) item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda B.",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T20:05:22.000Z",
          "Titre": "Eli was very helpful over chat on the…",
          "Contenu": "Eli was very helpful over chat on the website. I love the look of my products... however my iPhone 14 camera cover popped off on the first drop of the phone, and there is already a scratch in the liquid glass. I put both on and let them sit overnight untouched. A little disappointing. BUT my custom printed case looks amazing!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VICTORIA REINHOLD",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T22:22:50.000Z",
          "Titre": "Was very helpful resolving my problem",
          "Contenu": "Was very helpful resolving my problem. Thought the replacement lens was covered completely under warranty, but still paid $10.99 plus shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abby Owens",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T18:36:36.000Z",
          "Titre": "My case did not come with a PIN",
          "Contenu": "The iPhone case I ordered and received did not come with a PIN number to activate the warranty. I emailed customer service twice with my order number to see if it could be provided to me. I didn’t hear back. However, once I completed a review on this site I immediately received a call from the company. They explained they previously did email me, but for some reason I didn’t receive them. They explain to me that the case I ordered did not come with a warranty and therefore it did not come with a pin card. Because their cases with warranties are called “Pro” it can be confusing when ordering for the iPhone Pro. After checking my order, I had incorrectly ordered the case without a warranty. They offered exchanges and replacements to meet my needs but, I ultimately decided just to keep what I purchased. Customer service team was friendly and accommodating to try to improve my experience. My previous case purchases had good customer service and I appreciate them reaching out this time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Moe",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T20:55:14.000Z",
          "Titre": "Rockstar",
          "Contenu": "Aaron was great. Clear communication. I gave 4 b/c I believe there is always room for improvement no matter what we do."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Athena VanDyke",
          "Nb_Reviews": 4,
          "Date": "2022-12-13T22:17:55.000Z",
          "Titre": "altitude case",
          "Contenu": "for the most part he liked the case but he did say that the case could have a bigger lip on it so if it hit the ground then the face of the cell won't crack but as of now it only has a small lip and feels that if it accidently gets dropped it will crack the face of the cell"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristen McNamara",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T23:16:35.000Z",
          "Titre": "I wish we could get a replacement in…",
          "Contenu": "I wish we could get a replacement in store instead of the current process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim D",
          "Nb_Reviews": 4,
          "Date": "2022-12-16T02:23:15.000Z",
          "Titre": "Excellent customer service and quick…",
          "Contenu": "Excellent customer service and quick turn time.  Unfortunately the screen protector cracked in 2 days I need another one already"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn Mckee",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T19:38:13.000Z",
          "Titre": "Quick replacement",
          "Contenu": "I’m not sure why the first cord only lasted a few months but replacement went quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret Timmerman",
          "Nb_Reviews": 2,
          "Date": "2022-08-30T20:43:34.000Z",
          "Titre": "Good protection!",
          "Contenu": "My phone slipped out of my pocket when I was mowing and I unknowingly ran over it with my tractor.  The tempered glass screen saver was trashed and the phone protector was askew, but the phone was just fine!  Glad the protector had the company name on it as I was able to order a replacement quickly online. (My local cellular store no longer had the right size for my oldish phone.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Whitson",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T14:53:15.000Z",
          "Titre": "Wassup",
          "Contenu": "Wish they would get cases for my phone but i love liquid glass"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 6,
          "Date": "2022-07-06T23:54:48.000Z",
          "Titre": "Started off a little rocky but I’m…",
          "Contenu": "Started off a little rocky but I’m happy at the end. I had an issue with one of your products that was defective. Seems Verizon wouldn’t stand behind it and your company after going back and forth sent a new one to me. Where I work the company we make the customer happy immediately and we deal with the vendor. More convenient for the customer rather than the vendor. I would think you’d like to know if one of your products is defective. A complaint is a gift because then you can fix it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clem Bouchard",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T13:52:10.000Z",
          "Titre": "Process was relatively easy once I…",
          "Contenu": "Process was relatively easy once I connected with a customer service person but that took a few tries. I did not know I had to props receipt, since the original product was applied by a tech at the cell service provider I think the associated charge, offset a large portion of the replacement cost.  It was a free replacement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susie Kom",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T00:57:56.000Z",
          "Titre": "Store denied me, but website was quick to replace.",
          "Contenu": "I bought charger because of warranty, when I took it back to the store I did get discouraged because they sent me to the cell helmet website. But when I took photos of the damaged charger, no questions asked they sent me a new one. Very fast response time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah Karns",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T01:25:29.000Z",
          "Titre": "Customer service was good",
          "Contenu": "Customer service was good. I emailed that my new charger wasn’t working. They emailed me back requesting a picture of the receipt. I sent it to them. It did take them about a week to get back to me, but I got the result I needed. I had to fill out a request for a new charger and I received it in a few days. I am so pleased that they stood behind their product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tomislav Ivic",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T15:04:01.000Z",
          "Titre": "Cellmets",
          "Contenu": "Got our original helmets through a cell company when bought our phones. They got damaged and was referred here to get replacements. Had a hard time finding the warranty link so I waited for someone to purchase one while on the site and clicked on that little window. After that, process was easy. Got our helmets within a few days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Ott",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T22:28:28.000Z",
          "Titre": "First purchase of lightning cable…",
          "Contenu": "First purchase of lightning cable stopped working pretty quickly, and I was surprised at first to see 9.99 for replacement. However, I contacted customer service via chat and they quickly waived the fee and I had a brand new one in two days! Verizon wireless advertised lifetime warranty but failed to mention the 9.99 fee. I’d buy again...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Rivera",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T02:36:17.000Z",
          "Titre": "Awesome product",
          "Contenu": "Awesome product! It’s sturdy and yet smooth. The grip is great! My only comment is that pressing the power button twice for Apple Pay is hard cause the case is pretty thick. Other than that, amazing case!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T19:31:28.000Z",
          "Titre": "cellhelmet reached out to fix my problem",
          "Contenu": "UPDATE:  cellhelmet reviewed my comments and offered me a free replacement cord since the original one failed so soon.  Thank you for backing your product. I'm happy with the follow-up!My lightning charger cord failed after 4 weeks of use.  Now I need to pay $9.99 for a warranty replacement.  It seems like you could have in-store exchange for something like this which was obviously defective."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T20:48:15.000Z",
          "Titre": "Chat Issues",
          "Contenu": "I understand the efficiency of using the online chat feature but the icon should not be visible if some on is not available to chat. I didn’t  receive notifications when someone did respond so we played phone tag for a while. (Not sure if that was my phone or the program). Also it would be nice to talk to someone when chat isn’t available. However Ashley was very quick to resolve the issue and very respectful. She gets two thumbs up!!ThanksJosh"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blain Perkins",
          "Nb_Reviews": 1,
          "Date": "2020-08-07T20:36:13.000Z",
          "Titre": "Pretty good but theres cheaper",
          "Contenu": "The screen protector looks great and does not distort imaging, but its pretty brittle.  Mine cracked while it was sitting in my truck.  I guess it got hot and cracked.  Customer service acted very quickly and sent out a new one very fast, but I feel like I shouldn't have to pay 10 bucks for a new one when mine only lasted a couple weeks and wasn't even dropped or anything."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BrenA",
          "Nb_Reviews": 3,
          "Date": "2020-11-30T01:01:19.000Z",
          "Titre": "Great Customer Service but...",
          "Contenu": "The product (lightening cable) lasted about a year before the end cracked, HOWEVER, it was covered by the lifetime warranty. The customer service in getting a replacement cable was second to none. It was simple, fast and courteous. I had my new cable within two days. Would I recommend Cell Helmet? Absolutely! I love my lightening cable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann Bonds",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T13:57:38.000Z",
          "Titre": "Get link from support chat to file warranty claim",
          "Contenu": "My cellhelmet tempered glass on my iPhone 12 Pro cracked after 5 months.  I used the SUPPORT CHAT on their website and was given a link to file a warranty claim.  Sent them a picture of the box & receipt along with $9.99 to cover shipping and processing.  Hope this one lasts longer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BrenA",
          "Nb_Reviews": 3,
          "Date": "2021-09-03T12:42:58.000Z",
          "Titre": "Getting my replacement cords was smooth…p",
          "Contenu": "Getting my replacement cords was smooth and quick. Very impressive. The only reason I didn’t give 5 stars is due to the fact that I have contacted Cell Helmet twice via email from the Contact section on the web page and they have not responded after three weeks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LouieLouie",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T11:05:24.000Z",
          "Titre": "Confusing website, otherwise good service",
          "Contenu": "Figuring out how to access the warranty on my screen protector was not easy from the cell helmet website. This required emailing the customer service people and waiting for them to respond. After that, it was very smooth. The cell helmet screen protector flawlessly prevented damage to my new phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 1,
          "Date": "2019-10-04T14:18:16.000Z",
          "Titre": "Liquid cell helmet",
          "Contenu": "Purchased the best cell helmet first/liquid, that cracked. The iphone face was replaced, and covered by cell helmet. I then purchased the \"hard\" cell helmet,  which cracked. I just received the replacement for $9.99, but have not taken it to Verizon store to have it put on yet.Even though I'm  a little upset with the quality of the cell helmet,  I'm impressed with the follow up for replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jenn Smith",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T01:15:54.000Z",
          "Titre": "At no point in my transaction was I…",
          "Contenu": "At no point in my transaction was I notified that my item wouldn't be shipped for 2 weeks.  Although the website brags fast shipping.  I had to contact company when it would be shipped after waiting one week from when payment was debited from my account. I never recieved an email that it was shipped.  It just showed up in my mailbox."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Bucaria",
          "Nb_Reviews": 4,
          "Date": "2019-04-30T19:07:37.000Z",
          "Titre": "After buying 3 cheap portable charges…",
          "Contenu": "After buying 3 cheap portable charges and breaking within 45 days i decided to invest a little more money and bought the 10200 mAh for $60 at the Cricket store. Well first the cable broke off in my phone after 40 days and on day 45 (yes just like the cheapies) the unit would no longer charge and was useless. Thank goodness for the lifetime warranty. I received a new one in 4 days. So I'm giving it a try once again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damian Wosick",
          "Nb_Reviews": 1,
          "Date": "2019-07-18T00:27:03.000Z",
          "Titre": "Very happy with warranty lens protector…",
          "Contenu": "Very happy with warranty lens protector replacement. Was easy to order and shipped the same day. Only gripe I have from given a 5 star rating was the $9.99/ea shipping and handling fee. I don't have issue with shipping fee which was shipped normal USPS delivery costing you maybe $1.50 - $2.00 tops. So I feel it's not truly a lifetime warranty if I'm paying extra $8 roughly. I feel we are paying probably your cost to make one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kai Pras",
          "Nb_Reviews": 1,
          "Date": "2021-02-20T04:05:13.000Z",
          "Titre": "Good deal but buttons don’t work.",
          "Contenu": "Though I got it for a good deal it would be a waste of time to even mail it back but the up and down button on the case does not even work. Maybe it’s the design for the particular case.Update:::I got it replaced and it works now. Thanks for the customer service. 1 star to 4 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet Luff",
          "Nb_Reviews": 2,
          "Date": "2019-10-04T23:29:16.000Z",
          "Titre": "I like that the screen cover protects…",
          "Contenu": "I like that the screen cover protects by phone screen, because I gone through a few of the protectors, and haven’t damaged my phone. I had a privacy protector last time, but that makes it hard to show Grandbaby photos to a group of friends. So this replacement is a regular one. Happy about the service, and replacement ease. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damon Depew",
          "Nb_Reviews": 2,
          "Date": "2020-02-27T21:37:58.000Z",
          "Titre": "It works very well",
          "Contenu": "It works very well. It is not perfect or indestructible but I would have shattered the glass about 6 times already without it. I have a case on it and it fell about 7 times and didn't crack. this last time it did and as stated they will pay the repair cost so all in all very good investment for the money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T14:08:23.000Z",
          "Titre": "Very good product with only a couple…",
          "Contenu": "Very good product with only a couple problems. First one is that when my protector arrived in the mail it was already cracked. Another problem I have is they crack very easily. One foot drop was able to crack my protector in 3 different places. Other than the manufacturing problem and easy to break problem I'd say it's a really good protector to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cassie Wilson",
          "Nb_Reviews": 1,
          "Date": "2020-11-09T16:57:58.000Z",
          "Titre": "Customer Service - Filing Claim",
          "Contenu": "While trying to file a claim there were some difficulties in trying to reach someone via phone, however, I would highly recommend using the live chat feature on the website, someone responded to me in less than a minute and was very helpful and directed me to exactly what I needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Nagel",
          "Nb_Reviews": 3,
          "Date": "2022-11-29T20:09:18.000Z",
          "Titre": "The warranty replacement website is less…",
          "Contenu": "The warranty replacement website is less than easily accessible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marie Dalpe",
          "Nb_Reviews": 10,
          "Date": "2021-02-25T19:35:03.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "I originally left a bad review as these expensive products cracked x2 on us.  CellHellmet contacted me and made it right.  I appreciate customer service that cares!  Give them a chance and try their product.  Reach out with concerns and they will do their best to work with you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SNiles",
          "Nb_Reviews": 8,
          "Date": "2021-08-02T13:08:43.000Z",
          "Titre": "After one more crack",
          "Contenu": "After one more crack, I felt I needed to replace the tempered glass cover for my aging, but well-loved and perfectly functioning iPhone SE. A local cellphone store had every other size imaginable, but none for the SE; told me they could not order one, either. I ordered online directly, received in about 2 days. My careful application of the new glass left one small edge not perfectly adhered, but I think it's fine. BTW, The Cellhelmet warranty never seems to actually work (I have numerous Cellhelmet products) but I will say that - in spite of cracks in the protective glass, the phone underneath was protected perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kellie Kaiser",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T05:03:21.000Z",
          "Titre": "Liquid Glass has been on phone 3 months-no issues",
          "Contenu": "Seems to be a great product. Only issue is their warranty is not as long as some of their competitors and they don’t offer a reapply option. I like that their product comes in a vial so I can see that it is actually going into my phone. So far so good. I’ve had it on my phone and watch for about 3’months now with no issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Os Flo",
          "Nb_Reviews": 2,
          "Date": "2019-03-02T07:12:39.000Z",
          "Titre": "Product is nice but not certain it…",
          "Contenu": "Product is nice but not certain it lived up to the expectations I had for it. It did cover up those itsy bitsy superficial scratches but nothing for those moderate superficial ones and those are the ones I hoped the product would help with. Overall it's a good concealer for those tiny scratches on your screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Carlson",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T04:54:31.000Z",
          "Titre": "I like your product and am very…",
          "Contenu": "I like your product and am very thankful for the lifetime replacement warranty. The customer service rep was very helpful in directing me  thru the process for having my cellhelmet replaced and I received my replacement within a few days. The entire process was quick & painless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MCO",
          "Nb_Reviews": 1,
          "Date": "2019-02-15T21:42:37.000Z",
          "Titre": "Great customer service",
          "Contenu": "First, customer service (Lucy) was excellent!  I told her my glass screen saver was chipped, that I didn't have the receipt, and she was extremely helpful in giving me the information needed to order a replacement.  She even gave me a code so that I would not have to pay for shipping-wonderful!  Second, I am a bit bummed that my expensive tempered glass screen saver (on a new phone with a hard case) chipped less than a month after purchase.  Happy for the free replacement, but not happy with the product.  Hopefully, just a freak defect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Holly A. Mishkin",
          "Nb_Reviews": 2,
          "Date": "2021-11-02T18:42:01.000Z",
          "Titre": "It is taking too long to resolve an…",
          "Contenu": "It is taking too long to resolve an order issue. It would be helpful to speak via telephone rather than delayed emails.Update: customer service rep called me to resolve issue and follow-up experience was excellent!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wally Johnson",
          "Nb_Reviews": 3,
          "Date": "2020-12-19T20:15:32.000Z",
          "Titre": "It s a good deal",
          "Contenu": "It s a good deal ,for life. Sent all the info that they needed,got the new cover in about a week.Thhe only thing I didnt like is that it was 10.00 shipping.A item that was 40.00 anyway should have been alittle cheaper in the shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Hoch",
          "Nb_Reviews": 2,
          "Date": "2021-04-30T00:37:21.000Z",
          "Titre": "Bare wires",
          "Contenu": "This the second charging cable i have had to have replaced for the same reason. Bare wires became exposed at the iPhone end of the cable. I believe the cable had very easy use, nothing that should be considered hard use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luvtek",
          "Nb_Reviews": 1,
          "Date": "2019-06-10T18:14:31.000Z",
          "Titre": "Purchased a wall charger from Verizon",
          "Contenu": "Purchased a wall charger from Verizon, worked fine for about 1.5 months then would no longer turbo-charge and was sending sparks out of every outlet I plugged it into. Verizon would not do anything for me because of CellHelmet's warranty. Went online and was disappointed to see a replacement fee since I only had it for a short time. Ordered anyway but called customer service the next day and they told me they'd credit the fee. Did have to call back a week later bc the refund never went through, but after the 2nd call I received the replacement fee refund in a couple days. Pretty good service IMO."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Burton",
          "Nb_Reviews": 2,
          "Date": "2019-06-05T20:59:25.000Z",
          "Titre": "Seems great so far",
          "Contenu": "Seems great so far, and I love the guarantee. It is not tested though, so I can't comfortably give the product 5 stars. If I wasn't asked to review the product so quickly, it probably would have gotten 5 stars a couple of months down the road."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2019-10-02T20:42:11.000Z",
          "Titre": "Phone cases are great",
          "Contenu": "Phone cases are great. Paid for 2 day shipping. After a week contacted them and they said sorry new iPhone launch got them backed up. Really? However they did refund the 2 day shipping fee. Nice product but not sure on priority of the customer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Schmidt",
          "Nb_Reviews": 1,
          "Date": "2019-05-26T02:23:46.000Z",
          "Titre": "They are good about replacing the…",
          "Contenu": "They are good about replacing the screen protectors for my phone but I don’t believe the screen  protectors themselves are all that good the first one on this transaction that they sent me was broken in the mail which is no fault of their‘s and the one that I have on my phone has only been on there a week and it already has a small crack in it and I’ve only had it  on the phone for about a week so it will cost me another $10 or should I say 995 to get another replacement one I don’t know what to say  I just wish there was a solution to this Problem the screen protector is cracked in the same place as the last one was"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Lonneville",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T17:57:57.000Z",
          "Titre": "The first product I received was a welcome replacement",
          "Contenu": "The first product I received did not adhere well to the phone. However, when I contacted the company they readily provided a replacement for which I am grateful – both for their speedy concern for a customer as well as for a replacement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harshad",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T15:19:47.000Z",
          "Titre": "Never got my product - but they fixed that later",
          "Contenu": "Update: Tl;dr - I would definitely buy cell helmet for every phone I have IF I can be sure I won't need to deal with the support teamLonger review -  After posting my original review, the cell helmet team got in touch with me and sent me a new cover. The initial response from customer service was a little...pushy. But once the product actually got delivered they were patient and did not bother me.The product itself - I LOVED the cover. It's light, has good grip and takes a pock socket very nicely.I dropped it a couple of times and while the case has markings and some damage from that - my phone is absolutely A OK. Have been using it for almost 3 months now with ZERO COMPLAINTSOriginal Review:I haven’t received my product. And even after raising a complaint with both USPS and cell helmet, the response was just to wait. In the mean time I have a new phone that’s been accumulating scratches. I can’t say anything about the product though - because I’ve never seen or used it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexandra Franklin",
          "Nb_Reviews": 1,
          "Date": "2018-11-12T23:47:18.000Z",
          "Titre": "Works well",
          "Contenu": "Works well. Application is harder than other competitors. Not as smooth. Seems as if there isnt enough liquid in vial to spread over front and back of phone. Even so, once product is applied it absorbs rapidly leaving a LOT of streaks to buff out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim O'Leary",
          "Nb_Reviews": 3,
          "Date": "2022-02-07T02:37:12.000Z",
          "Titre": "It is ridiculous in my judgement that I…",
          "Contenu": "It is ridiculous in my judgement that I had to pay shipping twice for one package containing two chargers.These chargers break easily.For the price they are not worth the value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vic L",
          "Nb_Reviews": 3,
          "Date": "2019-11-24T18:56:46.000Z",
          "Titre": "Feels nice.  Tough? Registration is difficult via the app but good via email after a chat.",
          "Contenu": "After application the screen felt exceptionally smooth and responsive as well as very clear.  Streaking was not there at all.  Fingerprints and smears were rare and when they did happen they wiped off easily.  I can't really tell how tough it is as a week later I dropped my phone on a tile floor breaking the screen.  Registration with the app leaves much to be desired as I tried a dozen times over 3 weeks and all failed.  That said I chatted online with the company and was able to register via email, a little clumsy but it works.  Now to get my phone fixed and submit the claim, hoping it all goes well but so far I have a good feeling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Holly Haberman",
          "Nb_Reviews": 1,
          "Date": "2021-01-08T19:26:14.000Z",
          "Titre": "I couldn't figure out how to get a…",
          "Contenu": "I couldn't figure out how to get a replacement screen cover for my phone, when I already bought the lifetime subscription of them when I bought my first one. I had to email customer service to help figure this out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julianna Collett",
          "Nb_Reviews": 1,
          "Date": "2019-11-15T16:05:10.000Z",
          "Titre": "Warranty Replacement",
          "Contenu": "Overall, I really like the cellhelmet products. However, the shipping for warranty replacements was very long. When my cellhelmet charger broke, I was disappointed to pay $10 for shipping for a replacement that took 10 days to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 4,
          "Date": "2018-05-18T13:46:37.000Z",
          "Titre": "Could be a 5",
          "Contenu": "Could be a 5, Just not had enough experience with the company.  I definitely love the products I have used so far. Cellhelmet Screen protector and the cleaner.  Shipping was fast, product securely packaged. and follow up e-m ail was was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaun Moore",
          "Nb_Reviews": 1,
          "Date": "2019-11-21T01:18:13.000Z",
          "Titre": "Too many hoops",
          "Contenu": "Way too many hoops to jump through. Updated 11-11-19. I did complete the registration process. I was told about 3 weeks ago my reimbursement check. I have yet to receive the check. Update. I have received my reimbursement check. So"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonelle Carlson",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T03:29:03.000Z",
          "Titre": "Bought 2 recharging cables (at…",
          "Contenu": "Bought 2 recharging cables (at different times); both only worked for about three months. Had trouble navigating website to get replacements. Used live chat with Eli was very helpful in getting the replacements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "vf",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T15:14:26.000Z",
          "Titre": "The lifetime warranty is disappointing…",
          "Contenu": "The lifetime warranty is disappointing in that the size I needed had been discontinued at my local store. The replacement was available directly from cellhelmet and arrived quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Waldene Drake",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T15:10:46.000Z",
          "Titre": "Eli went the extra mile",
          "Contenu": "Polite but told me I wasn’t registered, despite my registration number. Finally, Eli went the extra mile, recognized the older type code and validated my registration. Thank you Eli!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherri Peterson",
          "Nb_Reviews": 1,
          "Date": "2019-10-17T16:23:08.000Z",
          "Titre": "Product is GREAT",
          "Contenu": "Product is GREAT, Customer Service is GREAT, but the cost of shipping a warrantied item seems pretty high... for a screen saver that weighs little to nothing, it was shipping in a box and cost $9.99 for shipping..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Fagler",
          "Nb_Reviews": 1,
          "Date": "2020-10-05T19:48:33.000Z",
          "Titre": "Good Agent / Bummer on repair",
          "Contenu": "Agent was very responsive. Found out I have to pay up front to get phone repaired then I have to wait and see if I get my money back. would be a 5 star if I got the money up front to fix my phone first."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amore",
          "Nb_Reviews": 2,
          "Date": "2019-09-27T13:45:32.000Z",
          "Titre": "This is my first time having to file a…",
          "Contenu": "This is my first time having to file a claim with this company, I will say that the service itself is nice and they stand behind their product. However the process is rather cumbersome, and for the purpose it's not very efficient. The wait time for reimbursement is a little long seeing that the reimbursement is to repair your damaged phone. I'm currently 2 weeks in on a process I thought would take 10 days in total. Never the less the associate Lucy that assisted me today was exceptionally helpful! She was able to pull up my account and verify that I had done everything right and in order she also helped me register my new product. Regardless of the wait time for reimbursement customer service is superb."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Loyd",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T18:46:34.000Z",
          "Titre": "I wish that I could have reached out by…",
          "Contenu": "I wish that I could have reached out by a phone call and talked to a person to make the replacement process more convenient for me. Love your product and your guarantee."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jayne Walworth",
          "Nb_Reviews": 2,
          "Date": "2021-09-10T13:31:25.000Z",
          "Titre": "Works like a charm!",
          "Contenu": "Works like a charm, but it will probably wear out just like all the rest did. No change in design that I see. Others lasted about two years. Are my expectations too high?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Burns",
          "Nb_Reviews": 1,
          "Date": "2020-01-09T19:52:07.000Z",
          "Titre": "The process was incredibly easy and the…",
          "Contenu": "The process was incredibly easy and the replacement glass was delivered in a timely manner.  Only reason it is not a 5 star is I had to pay $10 for something I thought was completely guaranteed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "vassilis",
          "Nb_Reviews": 5,
          "Date": "2021-02-11T23:47:13.000Z",
          "Titre": "Great Product!!! Lousy servicr",
          "Contenu": "Great Product!!!Lousy one of the worst customer service!!!!Still trying to register my product even though i sent numerous e mails!!Phone number service non existed for help!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B. Vaughan",
          "Nb_Reviews": 1,
          "Date": "2019-06-22T12:44:41.000Z",
          "Titre": "Great so far!!",
          "Contenu": "Ordering was very easy and received my product within a couple of days.  Love not having the icky glass screen protector on my phone!!!! Easy to apply and it feels natural!!! So far I love it!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael G",
          "Nb_Reviews": 1,
          "Date": "2021-01-30T01:16:51.000Z",
          "Titre": "Customer service email correspondence…",
          "Contenu": "Customer service email correspondence could be faster and it needs to be easier to get somebody on the phone to talk to like it use to be In previous years. Once I found the chat feature that was nice. Only reason for the 4 instead of 5 stars was that once my package said it shipped it took 3 or 4 days of the tracking information saying that only a label has been created and usps hasn't received the item yet. Had to contact customer service again and they contacted the wharehouse manager to get the hold up fixed.  All in all, it was a pretty good process especially for a warranty item. Only other thing I can think of is you need to have more of your screen covers in stock. Saw a lot of out of stock privacy screens. Maybe that's because of covid and stuff i don't know but just something to note. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Stankovics",
          "Nb_Reviews": 2,
          "Date": "2019-12-11T18:36:33.000Z",
          "Titre": "It took a little while to resolve my…",
          "Contenu": "It took a little while to resolve my issue, but it was eventually handled (why 4 starts and not 5).  Another plus with cellhelmet is there was no need to return the damage screen saver."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GeekForLife",
          "Nb_Reviews": 2,
          "Date": "2018-05-15T18:56:12.000Z",
          "Titre": "Warranty is only for one year.",
          "Contenu": "Hard to know how well it protects, but it applied easily with no negative impacts (i.e., screen is still as clear as new). BUT WARNING: the warrant is only for one year, so I ding them a star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole Fox",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T19:18:23.000Z",
          "Titre": "It didnt work all that well to protect…",
          "Contenu": "It didnt work all that well to protect my screen but I didnt get my 300$ back from repairing the broken screen without having to jump thru too many hoops which was pleasantly unexpected:)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meinecke",
          "Nb_Reviews": 2,
          "Date": "2020-03-20T17:12:28.000Z",
          "Titre": "Product delivered on time and in good…",
          "Contenu": "Product delivered on time and in good condition but no confirmation email after purchase was sent.  Plus side when I sent an email to cellhelmet they did respond with 48-72 hours"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anna Chamberlayne",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T19:41:37.000Z",
          "Titre": "Your replacement system is wonderful…",
          "Contenu": "Your replacement system is wonderful and really easy to use. The fact that my screen broke within 2 weeks of having it with your liquid glass protector dissapoints me though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alyssa S",
          "Nb_Reviews": 5,
          "Date": "2021-04-02T14:11:39.000Z",
          "Titre": "4 star product",
          "Contenu": "Reasons: Being forced to rate and haven't had it long enough. Also dropped it once and the case was scratched, so that's concerning. Cool case design though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacey Ryan",
          "Nb_Reviews": 1,
          "Date": "2019-07-21T13:25:43.000Z",
          "Titre": "Screen Proctection",
          "Contenu": "This is the second time I have had to order a new screen protector from Cellhelmet.  Delivery is super fast and the $10 replacement is a great way to keep your phone protected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Schmidt",
          "Nb_Reviews": 3,
          "Date": "2020-07-31T15:06:45.000Z",
          "Titre": "Great customer service",
          "Contenu": "I'm gonna share my experience with cellhelmet.  I bought the liquid, applied it on my cellphone and registered the warranty.. The cellhelmet product is good. My phone was used without the screen protector.. Approximately 8 months later my cellphone screen developed a slight scratch, that same scratch got bigger over time.. I payed to fix the screen and applied for the warranty.. Cell brokers who apparently handle the insurance side denied my claim telling that the front camera picture was not done correctly.. I was furious.. Called them many times tried to resolve the issues, but to no avail.. After posting a negative review representative from cellhelmet reopened the case for me and got me reimbursed.. I HONESTLY DO LIKE THE PRODUCT and definitely buy it again.. I hope the company does better job of picking the insurance company that handles the claims."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Vaughan",
          "Nb_Reviews": 2,
          "Date": "2022-02-13T23:34:33.000Z",
          "Titre": "I just purchased 2 cellhelmets  in…",
          "Contenu": "I just purchased 2 cellhelmets  in november and they both had to be replacedand I had to pay $10 each for $20 and just purchased"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Jenks",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T14:09:43.000Z",
          "Titre": "Case is great price and seems to be…",
          "Contenu": "Case is great price and seems to be strong. Only thing I would change is making it a little more grippy. Its hard plastic so its kinda slick in your hands."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2020-11-24T07:37:00.000Z",
          "Titre": "Very glad you offer replacement…",
          "Contenu": "Very glad you offer replacement warranty for glass screen protector. My old one was cracked. You honored your request replacement warranty. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Toi",
          "Nb_Reviews": 2,
          "Date": "2019-10-24T12:42:42.000Z",
          "Titre": "It’s great product but should be free",
          "Contenu": "It’s great however I wish it was cheaper! It says you have a lifetime warranty but doesn’t say you pay each time yours cracks. That’s not in the fine print!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Celley",
          "Nb_Reviews": 1,
          "Date": "2019-04-12T01:32:04.000Z",
          "Titre": "I like the phone case and like that",
          "Contenu": "I like the phone case and like that, however we also bought the screen covering at the Wireless store and my daughter says she has 2 scratches on her screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Etchison",
          "Nb_Reviews": 2,
          "Date": "2020-12-02T21:05:19.000Z",
          "Titre": "Offers very good protection",
          "Contenu": "Offers very good protection, but has issues with adhering to the full face of the phone.  Will not stay in full contact with the upper left corner"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Schmitt",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T20:58:25.000Z",
          "Titre": "They forgot to process the invoice and…",
          "Contenu": "They forgot to process the invoice and it took 3 weeks to get here and they sent the wrong size . They did end up reimbursing me about a month later"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Voss",
          "Nb_Reviews": 2,
          "Date": "2022-04-13T14:05:30.000Z",
          "Titre": "Eventually got it right (2 “customer…",
          "Contenu": "Eventually got it right (2 “customer service” calls before the 3rd one sent the right product) Very confusing…."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Mousseau",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T13:36:20.000Z",
          "Titre": "Can’t register for iPhone",
          "Contenu": "Having a hard time finishing registration of the cell helmet altitude case for my iphone12. The directions were not clear for an iPhone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jb308060",
          "Nb_Reviews": 2,
          "Date": "2020-08-07T04:39:16.000Z",
          "Titre": "No hassle life time warranty",
          "Contenu": "No hassle life time warranty, cords are great, but nothing last forever. So for a fraction of the original cost. You get a replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Didier A. Vasco Negrón",
          "Nb_Reviews": 1,
          "Date": "2019-05-29T15:10:50.000Z",
          "Titre": "Cable not that strong.",
          "Contenu": "I like it, the cable it’s pretty strong but no more than a month and just like any regular cable and the wire connector brakes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Dennis",
          "Nb_Reviews": 2,
          "Date": "2019-07-15T20:26:33.000Z",
          "Titre": "Good Product, Horrible Tech",
          "Contenu": "Product is great, except for registering the product for the warranty. I'm not able to register it, the app keeps crashing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gold's Gym",
          "Nb_Reviews": 2,
          "Date": "2019-10-28T17:18:19.000Z",
          "Titre": "Was easy to order but wish I received…",
          "Contenu": "Was easy to order but wish I received confirmation email and or tracking so I knew the order was placed and went through ok."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GARY VAN WERT",
          "Nb_Reviews": 2,
          "Date": "2022-02-09T15:57:21.000Z",
          "Titre": "First replacement necessary after three…",
          "Contenu": "First replacement necessary after three weeks. The replacement came quickly and all is well. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KA",
          "Nb_Reviews": 1,
          "Date": "2019-08-21T19:57:18.000Z",
          "Titre": "good warranty",
          "Contenu": "The tempered glass was damaged by a hand that hit the phone while gesturing. It cost $5 shipping to replace. Good warranty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 3,
          "Date": "2022-09-18T22:23:37.000Z",
          "Titre": "My phone screen saver came quickly and…",
          "Contenu": "My phone screen saver came quickly and was easy to put on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr. Elizabeth Dillon-Marable",
          "Nb_Reviews": 2,
          "Date": "2019-04-25T15:11:59.000Z",
          "Titre": "Calling customer service was not a good…",
          "Contenu": "Calling customer service was not a good experience. If you don't have good internet connection, forget getting help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Narina",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T18:04:36.000Z",
          "Titre": "Satisfied experience",
          "Contenu": "I used the chat option on the Cell Helmet web page. My questions were answered promptly and the staff was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Fish",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T21:12:31.000Z",
          "Titre": "It took a little bit to figure out how…",
          "Contenu": "It took a little bit to figure out how to order my replacement glass online.  However, shipping was lightning fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-26T16:15:30.000Z",
          "Titre": "Had an issue with the sticky plate not…",
          "Contenu": "Had an issue with the sticky plate not holding to the phone at the first use. They are sending me a new one no charge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Schmidt",
          "Nb_Reviews": 2,
          "Date": "2022-07-10T16:44:36.000Z",
          "Titre": "Seem to work well",
          "Contenu": "Seem to work well.  Only been on the phone for a few days.  Time will tell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Daniel-Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:05:57.000Z",
          "Titre": "I would like to say that I have never…",
          "Contenu": "I would like to say that I have never had such incredible customer support like the gentleman that helped me. I was having difficulty registering my product and not only did he reach out to me and called me; he also sent me an email and walked me through the process. I told him that he could give classes on businesses giving great customer service because it’s rare these days to find someone that wants to be helpful. I would rate him 100 out of 5 if I could. Fantastic and much appreciated!! Kim Daniel-Richardson"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:45:06.000Z",
          "Titre": "I love my charger",
          "Contenu": "I love my charger! It folds beautifully and it’s a great for traveling!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Pagano",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:43:31.000Z",
          "Titre": "Cellhemet made shopping online easy and…",
          "Contenu": "Cellhemet made shopping online easy and their price was better than when I went into a local store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FREDDIE ARMOND",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T23:43:52.000Z",
          "Titre": "I had purchased a liquid glass…",
          "Contenu": "I had purchased a liquid glass protection last year around this time under the impression that it was a lifetime warranty. Not to go into all the details I had to replace my device thinking the liquid glass would carry over to the new device which it doesn't after explaining my situation the company gave me a coupon for 50% off  towards a new liquid glass."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Most",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T18:59:12.000Z",
          "Titre": "Prompt lifetime warranty as stated",
          "Contenu": "When I purchased my cell helmet tempered glass screen saver last year, I was told to save my receipt and it came with a lifetime warranty.It was so easy to go to the website and complete the procedure. I promptly received confirmation and shipping notices. When I received the wrong size - I chatted my problem and was notified that I will receive the correct one soon .I am happy and highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike & Maggie",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T07:12:06.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, great communication all the way to delivery. Excellent cell case design, fit like a glove. Artwork on back very precise. Good display protection, comfortable grip. Way to go Cellhelmet. Mike"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C/o Linda DePonte",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T11:45:50.000Z",
          "Titre": "Customer service was great",
          "Contenu": "What made my experience great was customer service   Aaron put together a 35% discount at Checkout for me as a return customer.   I ordered replacement liquid glass and a Turquoise hard cover for my Samsung 20S Note Ultra.  shipping to UBreakIFix at 501 Westport Ave, Norwalk CT 06851. I   need an appointment for either Monday 2/27 or Tuesday 2/28.Linda DePonte"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T21:04:34.000Z",
          "Titre": "Prompt and helpful service",
          "Contenu": "Aaron replied promptly to my query re: whether or not I should open the replacement tempered glass I ordered.  The picture on the package didn't match the description of the product and I was concerned if I opened the pkg could it be returned if not the correct one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T16:29:40.000Z",
          "Titre": "Amazing customer service!!",
          "Contenu": "I am amazed at how wonderful the customer service I received was. I had accidentally ordered the wrong case and promptly contacted customer service. They made sure to cancel my order and I was able to order the correct case. It was all done through email and the response time was so quick and they were so helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Wiesman",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T03:18:00.000Z",
          "Titre": "Had a charging block with a short and…",
          "Contenu": "Had a charging block with a short and is under cell helmet lifetime guarantee. Went to US Cellular and they filed the claim for the replacement immediately only paying for the shipping charges. Got immediate notification the product was being shipped by cell helmet. Couldn’t be more pleased since this product lasted almost 7 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Dubina",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T21:04:23.000Z",
          "Titre": "I chatted with Eli",
          "Contenu": "I chatted with Eli. He was quite helpful in the problem I had. I accidentally requested and received the wrong phone charger cables when I put in a claim. He saw the original receipt and automatically put the new order in to send the correct cables to me. And I didn’t have to worry about sending the incorrect cables back. In a world full of so many problems, issues and headaches… Eli made this easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T22:02:28.000Z",
          "Titre": "Damaged USB Cord",
          "Contenu": "I purchased a USB cord from a local Verizon store in my neighborhood.  After using it for about three weeks it broke. Instead of simply giving me a new USB cord, I was told I would have to contact the vendor Cellhelmet. They were quick to respond and after looking at pictures of the damaged USB cord and my receipt they agreed to send me a new one and waived the shipping charges.  Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evelynn Dynes",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T22:45:45.000Z",
          "Titre": "Customer service is very responsive",
          "Contenu": "Customer service is very responsive I couldn’t be more appreciative of all the help I received in deciding what to purchase. My only complaint would be there isn’t enough options for coverage for the back of a phone. I wish they made a liquid glass for the back screen but I was happy to find out that the case would cover the back. Overall love this company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "darleen",
          "Nb_Reviews": 4,
          "Date": "2023-03-02T01:27:18.000Z",
          "Titre": "Great service",
          "Contenu": "Aron and Eli were very helpful and very professional:I had a bad experience with glass developing a huge bubble within 6 months due to the way it was put on iPhone. At the retailers ,I reached out to cell helmet ,the maker of the product,They helped me with replacement I. In A timely manner they were both very friendly . Premier cust service .thank you cell helmet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruthanne Remark",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T13:44:59.000Z",
          "Titre": "Cell helmet has AWESOME customer…",
          "Contenu": "Cell helmet has AWESOME customer service!!  The photo case I received was not great but before I even contacted them, they reached out to re do with better picture placement etc.Received new one ….BEAUTIFUL!!My husband will LOVE the photo phone case!!THANKS SO MUCH!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lena Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T22:22:36.000Z",
          "Titre": "Outstanding customer service with Aron",
          "Contenu": "Aron your rep helped me in purchasing the right product I needed I seemed to have made  an error when ordering.. i really appreciated his help I am a  senior and he was so patient with me and understood what I needed. and ordered what I needed and gave me a discount.. Aron definitely needs a raise or promotion. we need more gentlemen like him. Thanks againLena Anderson"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUSAN S",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T18:23:08.000Z",
          "Titre": "trusted and reliable brand",
          "Contenu": "Every phone and tablet I have purchased I have protected with Cell Helmet.  It is a reliable, trusted brand.  The previous phone I purchased included a defective charger and the retailer replaced it with a Cell Helmet charger.  Has never failed me.  Purchasing new phones and wouldn't protect with anything else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April S.",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T00:38:58.000Z",
          "Titre": "Cellhelmet is the most useful and easy to install",
          "Contenu": "Cellhelmet is the only cell phone holder I have ever used. Recently I had to replace my original one. The glue became loose. I ordered a replacement during a Black Friday sale at half price. I am very happy to have a new one at half price. Their customer service is excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T19:03:13.000Z",
          "Titre": "Pleasantly surprised, great customer support",
          "Contenu": "I was pleasantly surprised to find out that cellhelmet actually warranties a product that is meant to break in order to protect your phone.  I cracked mine, and cellhelmet replaced it with only a shipping charge.  And the representative Eli was friendly and super-helpful in helping me choose the right cover for my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T20:23:07.000Z",
          "Titre": "Couldn't find the page with the screen…",
          "Contenu": "Couldn't find the page with the screen protector I wanted. chat answered right away so I could order. Super appreciative as no Verizon had mine in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Collin Miles",
          "Nb_Reviews": 3,
          "Date": "2022-11-06T01:06:03.000Z",
          "Titre": "Any phone I purchase",
          "Contenu": "Any phone I purchase, my immediate next purchase is a cellhelmet liquid glass purchase. So amazing. I have never even looked at other companies. They’ve always been superior so I haven’t needed to go elsewhere"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T22:43:02.000Z",
          "Titre": "I reached out to just tell the company…",
          "Contenu": "I reached out to just tell the company how great their cell phone case was since it saved my son’s iPhone from a mower fan belt. Someone got back to me and told me about the lifetime warranty, which I was unaware of. I was able to get a new phone case with a small processing fee. Great product and awesome customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherri Lorenzen",
          "Nb_Reviews": 3,
          "Date": "2023-02-17T18:12:20.000Z",
          "Titre": "After contacting cellhelmet they sent…",
          "Contenu": "After contacting cellhelmet they sent me a link to replace my currently cracked screen protector, then it took me less than a minute to order a replacement. Thanx"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew K.",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T19:01:39.000Z",
          "Titre": "Repeat customer here",
          "Contenu": "Repeat customer here! Not only is the product that CellHelmet puts out top notch, so is their customer service!  I’ve used their products on my last 3 phones and will continue to do so! Thanks CellHelmet!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly G",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T04:23:29.000Z",
          "Titre": "Excellent customer service from Aron!",
          "Contenu": "I had narrowed down my choices for a new phone case but I needed extra info to make a decision. Cellhelmet Chat was quick & easy to use. Aron was very patient & stuck w/me answering every question I had. He uses the products & was very knowledgeable in details. I just wanted to say THANK YOU for ALL your time and help!! I REALLY appreciate it! I feel very confident in my choices now. I'll have better protection and coverage on my phones, and in the long run, save some money too! I received my cases and the quality is exactly as expected.Only issue: I avoid made in China at all costs!! Based on cellhelmet’s FB video, 48% of their revenue comes from products Made in the USA. That made me happy to support them. Unfortunately, the cases I need are from China *bummer*."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jasper Kim",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T00:36:26.000Z",
          "Titre": "Great customer service. Very patient and communicative",
          "Contenu": "Great customer service. Very patient and communicative. Glad they were able to be more transparent and explain to me the process a little further especially the last step which requires taking a closeup of your own phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Schulz",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T01:59:38.000Z",
          "Titre": "When I had an issue with delivery due…",
          "Contenu": "When I had an issue with delivery due to a driver taking out my mailbox, customer service was by far 5 stars. They issued a replacement tight away. I am so happy with my new case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cari S",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T05:46:27.000Z",
          "Titre": "I’m very pleased with the customer…",
          "Contenu": "I’m very pleased with the customer service at Cellhelmet. Aron was quick to help me with the warranty replacement of my clear glass mobile phone cover AND he made it super easy.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis K.",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T18:20:41.000Z",
          "Titre": "Great Product by a Great Company",
          "Contenu": "I have always supported CellHelmet and their customer service has always been on point. I believe I even had spoken to their Founder and the entire company is just well made like their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gina B",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T04:59:49.000Z",
          "Titre": "I purchased Liquid Glass for my IPhone…",
          "Contenu": "I purchased Liquid Glass for my IPhone that will arrive in December. I used Liquid Glass for my current cell phone and I am very satisfied with this product. I was able to navigate website easily to choose the product that I wanted. I would not have a phone without the protection of Cell Helmet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Keene",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T00:26:28.000Z",
          "Titre": "Ordering a case for my new iPhone 14…",
          "Contenu": "Ordering a case for my new iPhone 14 Pro was simple and quick. Having used cellhelmet for the last few years as covers for my iPhones, I like the product since the cover is simple, easy to put on, doesn't add weight or bulk, and keeps the iPhone safe. Tried some others and was not impressed. Great product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A.J.",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T20:29:39.000Z",
          "Titre": "Cellhelmet rocks!",
          "Contenu": "Purchased a case for my girlfriends phone and loved it so much I wanted one for myself!  Customer service is top notch. I dealt with Aaron and Eli and they couldn't be more helpful.  Awesome company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T23:50:33.000Z",
          "Titre": "My new cell helmet was ordered on…",
          "Contenu": "My new cell helmet was ordered on 2/17/2023 as I purchased a new phone that same day. I received the helmet in the mail on 2/23/2023. I visited my USCELLULAR store yesterday, Sunday, 2/26 to have the helmet put on my phone. This is not an issue with cell helmet, but I want you to be aware that sometimes there’s a “hiccup” when installing: It has 3 spots which look like air bubbles that the employee could not get out. 2 are at the very top of the screen & are hardly noticeable. The 3rd is on the bottom left corner. It is bigger, but is not interfering with what I see. You sent the product in a timely manner. It arrived undamaged. All is well on your end. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter demarest",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T22:25:08.000Z",
          "Titre": "Cellhelmet is the best screen protector…",
          "Contenu": "Cellhelmet is the best screen protector on the market. I been using CH for years now and I broke my screen 3X and each time CH PAID $300 towards the repair. Not to mention I love the feel of real glass on my phone VS a plastic screen protector. Not one scratch on my screen.  10 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynn Crytzer",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T07:28:45.000Z",
          "Titre": "Superior product",
          "Contenu": "The touch screen on my phone not only looks better, it functions much faster! The process of applying the product was easy, no problems whatsoever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Fowler",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T18:12:33.000Z",
          "Titre": "The screensaver is a great product",
          "Contenu": "The screensaver is a great product and extremely durable. After 2+ years of use a replacement was needed, and the request was fulfilled without hesitation. Excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joey Crum",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T00:54:03.000Z",
          "Titre": "It was great that yall gave me another…",
          "Contenu": "It was great that yall gave me another cellhelmet because mine broke. But why u would not let them give it to me in-store was beyond me. And charge me $10 to ship something so little and light…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Klegstad",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T16:21:14.000Z",
          "Titre": "Awesome customer service!",
          "Contenu": "The customer service that I received was second to none in getting my screen saver replaced! The person that I worked with made my day! You people deserve a big Thank you for the great customer service!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lise",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T13:26:32.000Z",
          "Titre": "They shipped the product that I ordered…",
          "Contenu": "They shipped the product that I ordered in a timely fashion.  When I discovered that I didn't need the product after all, they quickly provided directions for returning it for a refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl Lundgren",
          "Nb_Reviews": 3,
          "Date": "2023-01-04T05:06:28.000Z",
          "Titre": "Ordered a replacement screen protector…",
          "Contenu": "Ordered a replacement screen protector for my phone. Original cost $40. Replacement $10 took 2 minutes to order it no questions no bs, great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Girard",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T04:41:29.000Z",
          "Titre": "It was easy to order what I needed and…",
          "Contenu": "It was easy to order what I needed and that was an iPhone 12 case and screen protector. This company was recommended to me by the mobile cell repair company. I have been happy with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Forton Remington",
          "Nb_Reviews": 3,
          "Date": "2023-02-07T04:03:56.000Z",
          "Titre": "Protect your electronics",
          "Contenu": "Getting a Galaxy S23 Ultra when it comes out.  I've used cellhelmet on my three previous phones and my tablet.  Never had an issue with the screens.  A small price to pay for the peace of mind it gives me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexius Smith",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T23:20:50.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "I am truly amazed with how quick of a response I had, and all the help I received! Costumer service was fantastic, understanding, and patient! Truly satisfied with my experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Sherr",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T23:53:25.000Z",
          "Titre": "I ordered a case was a personalized…",
          "Contenu": "I ordered a case was a personalized print on the back.  It came out awesome.  better than expected.  Grerat product that rivals the otterbox"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia M",
          "Nb_Reviews": 3,
          "Date": "2023-02-01T21:11:55.000Z",
          "Titre": "Great customer service in Chat online…",
          "Contenu": "Great customer service in the Chat option online. Chatted with Eli, who was most helpful and courteous, understood my question immediately, and sent me the link I needed to complete my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April McKee",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:33:44.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Very helpful to my needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maureen",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T17:51:48.000Z",
          "Titre": "Lost Cable",
          "Contenu": "Aaron was very helpful with how I can replace my lost cable.  He was knowledgeable about the type of cable I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Breanna Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T20:17:03.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, website easy to navigate, and product ( cell phone case and screen dip) exactly as described"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Wiorek",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T15:44:20.000Z",
          "Titre": "Awesome product",
          "Contenu": "They stand by their products and follow through on screen replacement if you do end up with any cracks. They are a stand-up company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darcie Velez",
          "Nb_Reviews": 1,
          "Date": "2022-11-06T19:03:19.000Z",
          "Titre": "I have used this product on 3 different…",
          "Contenu": "I have used this product on 3 different phones and love how easy it is to apply and it keeps the phone protected with all the extra layers"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T07:49:47.000Z",
          "Titre": "I'm a believer in these products",
          "Contenu": "I'm a believer in these products, as I've been using them for years.  The folks are very helpful, quick, and stand behind their products.  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T22:20:25.000Z",
          "Titre": "After being confused for a day someone…",
          "Contenu": "After being confused for a day someone very nicely understood what I was looking for and what I was asking and they sent me the appropriate link"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Portcha",
          "Nb_Reviews": 2,
          "Date": "2022-11-14T01:38:48.000Z",
          "Titre": "Being able to get my warranty…",
          "Contenu": "Being able to get my warranty replacement cable to charge my I-pad after mine went dead was fabulous. Quick turn around as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teena Craft",
          "Nb_Reviews": 3,
          "Date": "2022-12-16T21:59:24.000Z",
          "Titre": "This website was so easy to find what I…",
          "Contenu": "This website was so easy to find what I wanted and not have to spend a lot of time searching. I have gotten my screen fixed many times unfortunately, and you guys have made that easy too! And the refund comes quick☺️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla",
          "Nb_Reviews": 3,
          "Date": "2022-12-10T01:57:08.000Z",
          "Titre": "Great customer service and very fast…",
          "Contenu": "Great customer service and very fast shipping! Also great quality product! Local and love it. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reverse Health Member",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T20:45:20.000Z",
          "Titre": "Warranty filing was easy",
          "Contenu": "Warranty filing was easy.  Now waiting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sugarbay",
          "Nb_Reviews": 3,
          "Date": "2023-02-10T07:53:25.000Z",
          "Titre": "A good company",
          "Contenu": "A good company. I haven't had any bad experience with this company. Cellhelmet has a good quality or merchandise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V Georgia",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T19:02:25.000Z",
          "Titre": "Registration question",
          "Contenu": "I had a question about registering a tempered glass protector and the chat response was very quick and right to the point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BRYAN DIXON",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T22:18:00.000Z",
          "Titre": "Customer service was very helpful and…",
          "Contenu": "Customer service was very helpful and friendly. We got exactly what we needed in a very timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Salema",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T01:33:50.000Z",
          "Titre": "Exceptional Customer Service",
          "Contenu": "Finally a company that understands what Customer Service is all about! They are a great company with an exceptional product and they back it up with fantastic Customer Service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaShone",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T00:31:56.000Z",
          "Titre": "Prompt Responsiveness & deliverance",
          "Contenu": "Prompt Responsiveness is part of great customer service & I received my replacement in just a few days after I made my claim."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Linkem",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T21:10:05.000Z",
          "Titre": "Very good product and their warranty…",
          "Contenu": "Very good product and their warranty replacement is the best there is thank you so much for being so accommodating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucille",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T15:02:15.000Z",
          "Titre": "I had a great experience when I needed…",
          "Contenu": "I had a great experience when I needed a replacement glass. I received it very fast. $11 dollars to replace."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ York",
          "Nb_Reviews": 8,
          "Date": "2023-02-02T16:42:32.000Z",
          "Titre": "Great warranty program",
          "Contenu": "Their warranty program is terrific.   My order shipped very quickly and arrived in 2 days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 7,
          "Date": "2022-12-18T20:23:36.000Z",
          "Titre": "Second order",
          "Contenu": "Second order. First one was here in two days. Easy order on their website.  From PA so appreciate that they are also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Kiggins",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T19:23:11.000Z",
          "Titre": "Came quick like it better when I could…",
          "Contenu": "Came quick like it better when I could just go to Verizon and have them swap them when they broke."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Kolakoski",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T14:42:29.000Z",
          "Titre": "Service online was easy and quick",
          "Contenu": "Service online was easy and quick. Relieved my product in just a couple of days.only thing is Under warranty shipping should be free and not $9.99."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 4,
          "Date": "2023-07-16T23:23:02.000Z",
          "Titre": "replacement lanyard for Lander phone case",
          "Contenu": "I needed a replacement lanyard for my Lander phone case. Was very pleased with the price, shipment time & quality of the item. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TerrilK",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T21:27:29.000Z",
          "Titre": "I uploaded the sales receipt from the…",
          "Contenu": "I uploaded the sales receipt from the glass protector and got the replacement. Easy and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T02:57:49.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! This is my 4th purchase-one for each phone. Easy to order. Great communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caden Kopp",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T02:36:11.000Z",
          "Titre": "Customer service was amazing and so…",
          "Contenu": "Customer service was amazing and so helpful. Quick response and cared for my concerns! Company diligent in customer service. Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Hoeck",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T23:57:07.000Z",
          "Titre": "Quick Fix",
          "Contenu": "I explained the issue. Tech said ok we will send a replacement. Quick and easy no hassle guarantee. ☺️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti Nienberg",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T17:01:34.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, easy, no questions asked screen protector replacement! And fast shipping! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T03:45:24.000Z",
          "Titre": "Customer service was excellent",
          "Contenu": "Customer service was excellent, the agent was very helpful and courteous and got my issue resolved & helped me through it quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane baez",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T16:34:02.000Z",
          "Titre": "Thank you so much your customer service…",
          "Contenu": "Thank you so much your customer service is EXCELLENT!!! Diane Baez"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "thomas  worrell",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T15:50:45.000Z",
          "Titre": "Very helpful in processing my claim."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer P",
          "Nb_Reviews": 4,
          "Date": "2022-12-05T06:34:06.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Awesome protective cases! What else could you want?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Mulder",
          "Nb_Reviews": 3,
          "Date": "2022-12-05T19:08:15.000Z",
          "Titre": "Best Customer Service with Aaron",
          "Contenu": "Aaron was a big help.  He immediately understood my issue and was able to fix it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 7,
          "Date": "2023-02-10T00:30:16.000Z",
          "Titre": "The service rep was professional and…",
          "Contenu": "The service rep was professional and courteous. Replaced a produce that failed. Great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Sluzevich",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T23:13:47.000Z",
          "Titre": "You were true to your warranty and…",
          "Contenu": "You were true to your warranty and replaced our cracked glass screen protectors. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T00:30:14.000Z",
          "Titre": "Great customer service and very prompt…",
          "Contenu": "Great customer service and very prompt in sending out a new cable for my IPhone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keela Eggleston",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T16:40:59.000Z",
          "Titre": "Aaron the customer service rep was…",
          "Contenu": "Aaron the customer service rep was helpful and professional and stayed on the line with me until my issue was resolved!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betsy",
          "Nb_Reviews": 4,
          "Date": "2022-11-21T21:37:28.000Z",
          "Titre": "Extremely helpful",
          "Contenu": "Extremely helpful. Someone took the time to talk me through the ordering process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Wolfe",
          "Nb_Reviews": 5,
          "Date": "2023-10-03T03:18:43.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, great prices. Above and beyond customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne Marie Shetz",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T22:42:33.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great product! Definitely need the screen protector when kids handle your phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chandy Jones",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T19:38:43.000Z",
          "Titre": "Aaron was great to work with and helped…",
          "Contenu": "Aaron was great to work with and helped me resolve my issue quickly.  I appreciate it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikita",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T18:59:50.000Z",
          "Titre": "Order was delivered on time",
          "Contenu": "Order was delivered on time. The cases are great. We love everything about them: color, slim, and they do what they say, protect your phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delores Prondzinski",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:48:27.000Z",
          "Titre": "Totally right",
          "Contenu": "Everything about it, Aaron was very understanding while I made mistakes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T15:24:54.000Z",
          "Titre": "Aron was super responsive and made the…",
          "Contenu": "Aron was super responsive and made the entire replacement process so easy for me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ron williams",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T13:52:11.000Z",
          "Titre": "Actually fulfilled the agreement",
          "Contenu": "Actually fulfilled the agreement. Most insurance companies of all sorts are a rip off but cellhelmet is really legitimate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathryn Stewart Groth",
          "Nb_Reviews": 2,
          "Date": "2023-01-16T21:33:21.000Z",
          "Titre": "Quick Response back & helped take care…",
          "Contenu": "Quick Response back & helped take care of my situation. Excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Onativia",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T22:01:16.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service.   I received a response right away.   I can't thank them enough for excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Teague",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T00:19:09.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, their customer service is very good. I would recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kalle Riner",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T20:34:23.000Z",
          "Titre": "Super helpful",
          "Contenu": "Super helpful! Will always be a customer!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Dodge",
          "Nb_Reviews": 3,
          "Date": "2022-12-01T19:55:26.000Z",
          "Titre": "Easy Screen Replacement",
          "Contenu": "A very easy experience to secure my replacement iPhone screen. A very happy customer!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jane",
          "Nb_Reviews": 8,
          "Date": "2023-01-27T16:42:52.000Z",
          "Titre": "Aaron resolved my issue with ease and…",
          "Contenu": "Aaron resolved my issue with ease and immediately!  He was awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alethea Olinger",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T00:13:27.000Z",
          "Titre": "My return was easy",
          "Contenu": "My return was easy, and the associate helped me purchase the cord I actually needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kara Stetnish",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T19:30:46.000Z",
          "Titre": "Easy warranty replacements",
          "Contenu": "Replacing a cracked screen protector using the Screen protector lifetime replacement warranty for $9.99 was easy and timely!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T18:42:50.000Z",
          "Titre": "High quality product!",
          "Contenu": "My son is very satisfied with the production of his case as is my older son. Very much worth the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wills Elliman",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T19:25:34.000Z",
          "Titre": "Great brand to consider.",
          "Contenu": "Cellhelmet offers high-quality phone covers, screen protectors, and accessories that provide additional protection. Overall, cellhelmet is a great brand to consider if you need solid phone protection."
        }
      ]
    }
  ]
}