{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "dekoniaudio.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T17:26:03.000Z",
          "Titre": "Very cheaply made",
          "Contenu": "Very cheaply made, when I️ was trying the sample pack the buds foam just ripped off making them nonfunctional. I️ highly recommend the original apple buds."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Vlycop",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T19:30:56.000Z",
          "Titre": "After lying about compatibility, they ghosted me and only Amazon pay allowed me to get my money back",
          "Contenu": "I was looking for a replacement ear-pad for my Momentum first gen. I didn't want to order some cheap china stuff so when i found this brand i was willing to pay import duties and vat to get some stock. Product description and the YouTube. presentation video said that it was compatible, but the product received was at least a 1CM to big and didn't hold.I sent a first mail asking for information and how to resolve this with them on the official support address... Waited a week, no reply.I sent a follow-up, waited another week, still no reply.Because i was to lazy, i payed using Amazon paid. I used the A-to-Z amazon page to send another message... Still no reply.I ended up making a warranty claim on it and since they apparently didn't reply either, got my money back.Sadly i won't be able to get VAT and duties back because that fight is impossible here, but at least i have this. To resume. The product description is wrong, they either don't check any of their support contact or deliberately ghost their client, and if you don't pay using a third party you have no change of ever getting you money back... Would not recommend weirdly !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LM",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T17:39:59.000Z",
          "Titre": "I have emailed multiple times trying to…",
          "Contenu": "I have emailed multiple times trying to return my product and have still received no response"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Yannis",
          "Nb_Reviews": 8,
          "Date": "2022-10-12T20:30:57.000Z",
          "Titre": "sub-par product; sub-par customer service",
          "Contenu": "The product I got from them was the \"Elite Sheepskin Replacement Ear Pads for the HD800\" -- they worked OK for ~18months, before starting to come apart (leather coming undone // unglued at both the inside & outside seams)... the leather pads came with a 2-year warranty, but I never managed to get the Dekoni team to honour it (after a month of constant follow ups // constant back & forth, I finally gave up & bought something else off Amazon...) All in all, a bad experience, never to be repeated again."
        },
        {
          "Note": 1,
          "Lieu": "QA",
          "Pseudo": "Mohammed Abdulrahman",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T01:33:25.000Z",
          "Titre": "Scammers and irresponsible company",
          "Contenu": "Scammers. Horrible people. Scammers. They never reply to emails and they are purely a bunch of sick people who don't help their customers. I've been trying to contact them for 8 months with different emails and these refuse to fix the problem in hand to help future customers. This is regarding the Arya ear cups simply not being compatible with the older generation and these people don't even have the ability to correct their false advertising. I even tried to contact their teams directly and these people are nothing but Garbage garbage and more garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 7,
          "Date": "2022-12-14T19:01:54.000Z",
          "Titre": "They don't stay on",
          "Contenu": "I'll be honest, the earpads were B-Stock and they fall off the headphones.  Note they were for the exact headphone that they said.     I'd wear them gently and boom they'd fall off.   I can't recommend them unless you want to glue them on, but for premium earpads, you should get a premium experience not a 5 dollar experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Mercado",
          "Nb_Reviews": 9,
          "Date": "2023-05-08T16:58:27.000Z",
          "Titre": "I purchased these from the Dekoni…",
          "Contenu": "I purchased these from the Dekoni website as B-Stock pads but when I try to write the review on Dekoni's website it says error and won't post so im posting here for B-Stock pads from Dekoni. The pads I was sent are turned about 1/4 turn to the left on right earpad so it does not provide a good seal since it is mounted crooked and the pads rubs up against my ear. I had to keep messing with the position of the headphones to get it to sound even. I know Dekoni does not offer refunds on B-Stock but I sent an email to try and work something out and no reply at all. Stay away from B-Stock because you don't know what you will get. If you have an issue with Dekoni, hopefully your experience will be better than mine. Tossed the pads in the trash."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Jorge",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T20:23:44.000Z",
          "Titre": "it never arrived",
          "Contenu": "it never arrived. Dekoni should give international buyers another choice for shipping besides USPS, don't know if that is to hard, but some people would be fine paying a little more to ensure that the product arrives."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Inagé George Mazaferro",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T23:15:21.000Z",
          "Titre": "Faq are saying internacional ships will…",
          "Contenu": "Faq are saying internacional ships will take 5x7 days, I bought and its on brazil customs stoped... I was thinking that is a corrier service but is just one cheap usps package! Too much money for this Kind of transport."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victor Cummings",
          "Nb_Reviews": 10,
          "Date": "2023-05-05T20:55:21.000Z",
          "Titre": "Unlistenable Grado Pads",
          "Contenu": "Destroyed sound of excellent Grado RX1 Plus really hard to put on.  Increased but distorted base, muffled highs."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Alberto",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T06:57:35.000Z",
          "Titre": "Dont order from italy",
          "Contenu": "Dont order from italy, they use ups.They fee me 80 dollars of taxes for a 60 dollar pads...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T07:41:03.000Z",
          "Titre": "Stay away from B-Stock ear pads",
          "Contenu": "I ordered some B-Stock ear pads for the WH1000Xm3 and was ok with a blemish or a scuff or what not to save a decent chunk of change but was disgusted with what I was sent. There was some white crystaline substance and flaky white stuff which I assume is sweat and dandruff. The worst part was the smell. They smelled like they were taken off of a rotting corpse. I have left them in a bag with baking soda for about a year because I haven’t wanted to touch them. I understand that B-Stock means no returns but I was sent F-stock…those should have been killed with fire. I washed my old set of Dakoni ear pads and lived with the old ones but I haven’t been tempted to buy new ones because I made the mistake of trying to save a buck. If I ever buy a new set, I’ll have to eat the cost of the B-Stocks and have wasted a money instead of saving any. I will NEVER buy B-Stock again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:23:20.000Z",
          "Titre": "Sold a product that did not fit as…",
          "Contenu": "Sold a product that did not fit as advertised and unable to return, exchange, or get my money back. Wasted about $100 for something I cannot use."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Christoph",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:23:57.000Z",
          "Titre": "Never shipped to the right address",
          "Contenu": "The package was ship to the wrong UPS Center so I couldn't pick it up. ten days later the package was obviously send back to the seller.No chargeback, nothing."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Herve Rigoulot",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T19:46:10.000Z",
          "Titre": "No delivery !",
          "Contenu": "No delivery !I’m still waiting for my product No delivery bu DHLNo mail no sms….Thank you for refunding my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T06:30:13.000Z",
          "Titre": "never got it, getting emails",
          "Contenu": "I never received the product and 2 years later I am getting emails asking me to write a review. Here's your damn review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 4,
          "Date": "2022-09-10T01:49:59.000Z",
          "Titre": "One of the earpads literally cracked…",
          "Contenu": "One of the earpads literally cracked while installing on a Sennheiser HD 800S."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Lynn Gottschalk Roberts",
          "Nb_Reviews": 3,
          "Date": "2023-01-03T18:09:02.000Z",
          "Titre": "You have something attached to your…",
          "Contenu": "You have something attached to your website that took out $90 for an $80 item. Of course your company also took out the $80 so I was charged $170 for an $80 item. Will not shop your site again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T20:11:40.000Z",
          "Titre": "It completely alters the sound…",
          "Contenu": "It completely alters the sound signature and makes it sound worse."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Andrij",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T11:35:26.000Z",
          "Titre": "the goods have not been delivered",
          "Contenu": "the goods have not been delivered, the seller does not respond. Give me my money back!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Eichler",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T12:50:18.000Z",
          "Titre": "Stop spamming me with review requests"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "some random person",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T20:21:24.000Z",
          "Titre": "Sucky product",
          "Contenu": "Sucky product. Low quality."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Grigsby",
          "Nb_Reviews": 9,
          "Date": "2022-10-14T00:05:03.000Z",
          "Titre": "My replacement Ananda pads fell apart inside of a week, they were poorly constructed and not worth $90.00. I will never order from Dekoni again.",
          "Contenu": "My replacem,ent pads fell"
        },
        {
          "Note": 1,
          "Lieu": "KW",
          "Pseudo": "Tariq",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T20:18:24.000Z",
          "Titre": "I never got my product 😅"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eliott James",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T18:11:10.000Z",
          "Titre": "Adds too much bass to sound."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rockabilly Guy Ned",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:00:04.000Z",
          "Titre": "I purchased the XL Apple Air-Pods Pro…",
          "Contenu": "I purchased the XL Apple Air-Pods Pro (2 generation) replacement tips hoping that they would fit my larger than normal ear canal. Sadly, these replacement tips were great fit for about 1 week. After one week, the foam compressed to the point that they no longer maintain a tight fit in my ear canals. I am disappointed in the fit and finish."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alexander Moore",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T23:21:27.000Z",
          "Titre": "Site OK, AirPod Tips Too Small",
          "Contenu": "Site was ok, but Large Dekoni Audio Premium Memory Foam Earphone Tips for the Apple Airpods Pro didn’t fit as well as the stock silicone tips.  They fell out more, and didn’t isolate sound as well as the reviews would lead you to believe.  Consider ordering a size up if your current tips are on the looser side."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-15T23:40:00.000Z",
          "Titre": "Ordered a pair of pads",
          "Contenu": "Ordered a pair of pads, paid 35$ for international shipping, they never showed up.I can't blame Dekoni for the fact that my package was lost, but they've yet to answer me from support.So since I've paid in full, waited, contacted support and still haven't heard a word I can't recommend anyone to buy from them.Edit: Dekoni have reached out and are working to solve the issue."
        },
        {
          "Note": 2,
          "Lieu": "KE",
          "Pseudo": "He TianGang",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T20:05:58.000Z",
          "Titre": "The pads are very comfy",
          "Contenu": "The pads are very comfy, terrible noise cancellation. Which defeats the purpose of getting a noise cancelling headphone in the first place.Not worth it. Hope they can make the pads have better noise cancellation."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "M. David E.",
          "Nb_Reviews": 5,
          "Date": "2022-10-20T15:04:53.000Z",
          "Titre": "Some quality checks problems",
          "Contenu": "On my last order, I bought a pair  of Elite Velour and a pair of Elite Fenestrated for my DT1990. The Elite Velour pair was perfect and I am still using it to this day.One of my Elite Fenestrated was also perfect not the other who was badly sewed and ripped apart when I tried to put them on my headphones.I live in France and ordered from Dekoni US thinking I would get quality goods even if I had to pay heavy taxes.Well... I paid the taxes and the Fenestrated pair finished in the trash can.I didn't bother contacting Dekoni after paying such heavy taxes on my order."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Ton Brinkel",
          "Nb_Reviews": 6,
          "Date": "2023-06-16T21:54:33.000Z",
          "Titre": "Beware!!",
          "Contenu": "Beware! 25 euro's on top of the order price! Import taxes!!Way too expensive"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Daniel Halachmi",
          "Nb_Reviews": 3,
          "Date": "2022-10-20T22:26:44.000Z",
          "Titre": "The item arrived quickly and was of top…",
          "Contenu": "The item arrived quickly and was of top quality, yet It made the headphones sound terrible..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SPENCER Moore",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T20:28:52.000Z",
          "Titre": "Product didn’t fit as advertised and…",
          "Contenu": "Product didn’t fit as advertised and wanted to charge me to return the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anilkumar .",
          "Nb_Reviews": 3,
          "Date": "2022-11-24T10:12:30.000Z",
          "Titre": "Quality is not that great."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "george",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T17:23:56.000Z",
          "Titre": "Soundstage disappeared",
          "Contenu": "Soundstage disappeared, highs attenuated,sound overall less transparent"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Michael J Hazdra",
          "Nb_Reviews": 5,
          "Date": "2023-10-21T08:32:25.000Z",
          "Titre": "Very Comfortable.",
          "Contenu": "These new ear pads changed the sound of my Grado headphones when I am wearing my hearing aids. They cause a sort of Munson curve effect. I am hoping I just need to break them in. They are very very comfortable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Popp",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T20:43:46.000Z",
          "Titre": "Good product when you get a good set",
          "Contenu": "Second set I bought in the past 2-3 years or so. First set purchased were amazing and only replaced them because I let them get too dirty. The second set the inner plastic that locks them in place broke while walking letting my AirPod hit the ground and the bullet stayed in my ear. Definitely a good product when you get a good one though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Hyman",
          "Nb_Reviews": 8,
          "Date": "2023-05-10T19:26:18.000Z",
          "Titre": "Good products, but lack of process or caring",
          "Contenu": "Okay, I understand it was a pre-sell but the lack of communication about shipping dates was terrible. Worse still, was the completely unengaged response received when I sent an inquiry about the order status. Their products are very nice, but their C/S would benefit from an outside consultant, someone not inside their cultural bubble."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Why me",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T16:13:19.000Z",
          "Titre": "a mixed bag of experiences",
          "Contenu": "As a company Dekoni makes decent to good products. Usually you will be satisfied with your purchase and won't have any real complaints. It works as advertised in most cases.What unfortunately is the case is the company it self is very poor on the customer support and QC on their products. you can expect stitching to tear and glue to fall off before it should. Unfortunately the warranty and customer service is a lot to ask for as well. it's unfortunate because they make decent products but often have a lot of issues with the smaller parts such as stitching and or glue issues. this should not degrade due to wear as fast as they do and unfortunately i've had a lot of products have this exact issue.Overal id say give them a try but dont get your hopes up for the product to last."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 7,
          "Date": "2022-12-14T19:08:10.000Z",
          "Titre": "No returns on B stock.",
          "Contenu": "This pad was fine, but the overall customer experience was poor.  I asked a question on Black Friday and it was responded to for five days.  I have the pad sitting in my pad-swapping bin, and can't really use them.  I get if the pads are damaged or whatever, I asked to return them within two or three days and was denied without a follow up question or concern in the world.  Slow service, and not premium customer service.  I feel I'd be better off with Brainwaivz or Wicked Cushions as those seem to fit better, and are easier to install and actually stay on without glue!  If you want premium pads for a Audeze or highfiman Dekoni is a strong option, but for an ath,  or AKG style... never again.  Total waste of money and a poor customer support option over those holidays."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathan Richmond",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T17:03:55.000Z",
          "Titre": "The pads are an improvement in comfort…",
          "Contenu": "The pads are an improvement in comfort over the stock pads. However, I did not like the way they alter the sound signature of the headset. It's hard to describe since I'm not up on all the audiophile terms, but the sound is very claustrophobic with the Dekoni pads. I have no doubt that these will appeal to some people but they weren't for me."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Terry Jeffery  LEE",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T11:20:58.000Z",
          "Titre": "I find the velvet finish makes my head hot & uncomfortable.",
          "Contenu": "I found the velvet finish makes my ears hot and uncomfortable. I would suggest the leather finish (as was the original finish) was way better and worth paying the extra. If I had known this before purchasing I would have bought the leather pads."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Nuno Carneiro",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T21:30:59.000Z",
          "Titre": "The fostex earpads are somehow diferent",
          "Contenu": "The fostex earpads are somehow diferent, they should be more alike. Nevertheless the headphones sound better than before"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Shane  Delaney",
          "Nb_Reviews": 4,
          "Date": "2023-01-23T03:27:41.000Z",
          "Titre": "UPS made a mess of the delivery and…",
          "Contenu": "UPS made a mess of the delivery and took an extra week plus getting my order to me. They never called or emailed to discuss my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T05:21:52.000Z",
          "Titre": "Product did not fit properly.",
          "Contenu": "Product did not fit properly.Can't modify without destroying it.Glue will fail over time.Bummer about qaqc"
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "Emil",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:40:08.000Z",
          "Titre": "Great product, so-so support",
          "Contenu": "Product was exceptionally good, soft and very insulating ear pads. Unfortunately I had trouble communicating with support about a return because I've ordered a different sized ear pad."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Matt Dimma",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T19:52:23.000Z",
          "Titre": "Customer service experience",
          "Contenu": "Initially my customer service experience was great but I have now been waiting for a response regarding an exchange for a week now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carrasco Jose A",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T22:38:35.000Z",
          "Titre": "The ear pad had hair and box had grease…",
          "Contenu": "The ear pad had hair and box had grease at the bottom"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex the Great",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T19:57:33.000Z",
          "Titre": "Not an optimal fit",
          "Contenu": "Not an optimal fit. More positive engagement would be appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Bruce",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T22:47:31.000Z",
          "Titre": "Tips are great",
          "Contenu": "Tips are great, they seal in my weird large ears. The rubber part that holds them on the item stretched out and left the tips stuck in my ear why trying to remove my iems but otherwise love them."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kyle",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T02:11:13.000Z",
          "Titre": "Fantastic Materials and sound quality",
          "Contenu": "Fantastic Materials and the sound graphs shown feel quite accurate with how they sound now. The Elite sheepskin pads makes everything sound more lively. The only reason for removing a star is because the plastic interior frame is about 1-2mm too large all around. so the pads dont quite fit into the frame of the headphones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Multi-year User",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T13:20:28.000Z",
          "Titre": "Always a good experience",
          "Contenu": "Always a good experience. Shipping a little slower than I experienced in the past. Comfortable- I wear my EarPods for at least 6, often longer, a day so they do eventually wear out. The little membrane that keeps debris from getting through the hole falls out, so I guess they could be improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pendel",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T22:40:40.000Z",
          "Titre": "The velour pads for Aryas are thinner…",
          "Contenu": "The velour pads for Aryas are thinner than stock, and even though they use a type of memory foam, my ears were touching the driver cages. I ended up scavenging their foam and mounting rings, and used these in conjunction with another aftermarket brand to build  thicker pads."
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Narudol Rachartirach",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T01:09:11.000Z",
          "Titre": "it good but just some area that not…",
          "Contenu": "it good but just some area that not stick with glue (not much maybe it because weather etc.) other than that are fine. hope it can last longer than 3 months because the one I buy from Amzazon japan (Elite Hybrid ) just barely 3 month before pad get tear (maybe it weather and my sweat because it really hot here )I use with Radiance sound change be like Elite Hybrid - Vocal > guitar, drum > bass  Elite Sheepskin - Vocal = Bass > guitar ,drumI don't know much words to describe but yep something like that thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "taiiat",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T02:03:02.000Z",
          "Titre": "almost everything was fine.",
          "Contenu": "almost everything was fine - only strangeness was the Tracking information literally never did anything. the Tracking just didn't work, period.but the Service itself was fine, Product arrived in a reasonable time frame as it was described."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kurt",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:39:18.000Z",
          "Titre": "Premium build quality",
          "Contenu": "I purchased the elite hybrid pads for my Sundara, and the change in sound from the stock Pali pads is an increase in low bass quantity, but a small decrease in control thereof, along with a little smoother upper-mids. Not really better or worse overall, just different. W/r/t comfort, they are not quite as soft as the stock pads, but they are firmer and deeper, making it less likely for one's ears to contact the surface of the cloth over the drivers. The increased depth/thickness also increases marginally the clamping force on the head, but not to the detriment of comfort, though I have never been very sensitive to clamp, so ymmv. The biggest difference is the increased apparent durability over the stock pads, which start to self-destruct seemingly immediately, while the Elite hybrids seem very stout in build-quality."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kim Yew Lee",
          "Nb_Reviews": 3,
          "Date": "2023-04-18T00:55:08.000Z",
          "Titre": "Amazing product and ship fast",
          "Contenu": "Amazing product and ship fast. The only downside is the shipping cost, its ridiculously expensive. Its cost half of the product price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris N",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T18:40:29.000Z",
          "Titre": "Very good very good",
          "Contenu": "Very good very good, but do not get too satisfied with yourself. Keep pushing for improvements and innovations and you will continue to lead the industry."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tyler Markle",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T10:48:42.000Z",
          "Titre": "Great pads",
          "Contenu": "Great pads, mediocre quality cables. I'll be buying pads in the future if they still have them but I'll be getting my cables elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hong Ang",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T19:03:09.000Z",
          "Titre": "Quality seem to be very good but when I…",
          "Contenu": "Quality seem to be very good but when I install the pad to the headphone, a couple of stitches came apart.I guess that's B grade products when they go on sale."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "FROGIER",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T20:29:54.000Z",
          "Titre": "AUDIO TECHNICA MSR7B PAD",
          "Contenu": "Products are good.Fitting guide well documented. Informations are easy to find.I like the \"find your Pad\" tool.Real international delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dennis",
          "Nb_Reviews": 4,
          "Date": "2022-10-20T14:58:11.000Z",
          "Titre": "Sennheiser ear pads provided a greater…",
          "Contenu": "Sennheiser ear pads provided a greater base, while the new balanced cable made sound generally clearer"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Merlion W",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T16:07:48.000Z",
          "Titre": "Easy to place order online",
          "Contenu": "Easy to place order online, delivery on time, fast response when contact support to obtain tracking number, it’s a nice experience, however hope the website can give clearer instruction that the tracking number will be email so that buyer know that can wait for the email instead of contacting support ."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T08:14:31.000Z",
          "Titre": "Nice Ear Pad",
          "Contenu": "Would have been better if the ear pads arrived sooner."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Shenlong",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T06:54:07.000Z",
          "Titre": "The replacement cushion fit is good for…",
          "Contenu": "The replacement cushion fit is good for my mdr-1000xCheers!"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Stas Vainer",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T16:29:42.000Z",
          "Titre": "Really like the pads but why no inner…",
          "Contenu": "Really like the pads but why no inner foam?Do I really need to buy 20 dollar kit for that?"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Adrian Østensen",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T03:19:26.000Z",
          "Titre": "You failed to inform the buyer they…",
          "Contenu": "You failed to inform the buyer they have to pay toll and such"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "adriel",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T08:33:52.000Z",
          "Titre": "Great",
          "Contenu": "Great But bit expensive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas Spangler",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T18:51:11.000Z",
          "Titre": "Nice, deep cups",
          "Contenu": "After wearing out the padding on my Mk4s, I ordered these and boy am I satisfied. The suede is nice and comfortable, the cup wells are nice and deep, and the noise cancelling is preserved fine. The deeper wells I appreciate, the stock pads sat the drivers just a hair too close to be fully comfortable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Hyman",
          "Nb_Reviews": 8,
          "Date": "2023-11-03T17:02:24.000Z",
          "Titre": "Dakoni provides exceptional replacement…",
          "Contenu": "Dakoni provides exceptional replacement headphone earcups. Whenever I purchase a new-to-me (AKA used) set of cans I purchase the new Dakoni earcups moments later. They are often better than the OEM ones (new or used) and their mounting instructions are up top date and simple to follow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don SPENARD",
          "Nb_Reviews": 6,
          "Date": "2023-12-04T20:27:19.000Z",
          "Titre": "always great high quality hard to find products!",
          "Contenu": "always great products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T17:37:00.000Z",
          "Titre": "This is a massive upgrade",
          "Contenu": "This is a massive upgrade over the stock pads.  I listen to my headphones several hours a day and the stock headphones were never comfortable.  When looking for replacement pads, I stumbled onto these and ordered them hoping they would be worth the money.  To say they are is an understatement.  I can now listen for several hours without discomfort and the improved sound isolation makes the headphones sound even better.  Considering what the headphones cost in the first place, they should have come with something like this, at least now I have headphones I enjoy listening to"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim M",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:39:51.000Z",
          "Titre": "3 MMM... Good",
          "Contenu": "I recently changed pads on my LCD X to some lightly used fenestrated pads I had stashed away. So I needed these rings for installation. They quickly arrived, and were easy to position on the headphone. Love the Dekoni pads, and they are held securely in position by these 3M rings."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FF",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T22:00:39.000Z",
          "Titre": "Great quality",
          "Contenu": "Great quality, fast shipping. Old headphone pads were worn out and these are a great replacement, just as good as the original."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:19:04.000Z",
          "Titre": "B-stock without problem delivered quickly",
          "Contenu": "B-stock arrived quickly and I couldn't find anything that looked like a flaw or deficiency. Great product so far, and easy to install.The real question with these artificial leather products is how they fare in the long term (e.g., peeling), but the quality looks good at this early stage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Stone",
          "Nb_Reviews": 3,
          "Date": "2022-11-10T17:35:41.000Z",
          "Titre": "The Elite Hybrid pads for my Sundara’s…",
          "Contenu": "The Elite Hybrid pads for my Sundara’s are an upgrade in several areas. The deep bass is better focused. Midrange and highs are also enhanced with added balance. The look and feel is pure quality too.It’s a luxury product. Dekoni even goes the extra step by including pre-installed attachment rings, which make changing the pads simplified."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T23:05:15.000Z",
          "Titre": "Perfect solution",
          "Contenu": "I bought a beyerdynamic T5 last month.  While I liked the sound, the original pads were very uncomfortable.  I started looking at other headphones. I, however, your sales department and they recommended the elite hybrid ear cups.  I bought them, put them on and found they were a perfect solution.  I am now able to wear them in complete."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tetsu Noguchi",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T20:42:46.000Z",
          "Titre": "Dekoni is an amazing company",
          "Contenu": "Dekoni is an amazing company.  The replacement ear pads for my venerable HD800 breathed new life into them, and the thicker padding makes the headset look more like a headphone and less like I'm a cyborg, lol.They feel great, and the sound is impressive."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Pierre Provost Montréal, Québe",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T16:39:53.000Z",
          "Titre": "Dekoni Limited Edition Focal  ear pads",
          "Contenu": "Stellia ear pads Limited EditionFirst its very comfortable and it does what is stated by Dekoni. I have ben an audiophile for over 50 years, and it takes a lot to impress me because i am old school and to my surprise that you did with these pads. It betters the original pads with a larger soundstage, depth, bass is deep and tight, and with the little nuggets its makes the experience an exceptional listening session for hours without any fatigue. Its not cheap but worth every penny.Bravo DekoniI tip my hat to your designing and engineering team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawren",
          "Nb_Reviews": 3,
          "Date": "2023-08-24T16:07:48.000Z",
          "Titre": "These are a great substitute for the…",
          "Contenu": "These are a great substitute for the original ear cups. They are soft to the touch, but the foam provides enough structure that they don't feel too mushy. The installation is also surprisingly easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T02:08:36.000Z",
          "Titre": "Elite Sheep Skin Pads for Focal Elegia",
          "Contenu": "Bought these pads because the stock pads on the Elegia were giving out after 2 years of nearly daily use. I've been using these pads for about a month now and they've been great. They remain comfortable over extended periods of use, and so far I haven't noticed any changes to the Elegia's sound signature, which was a concern given that these headphones are supposed to be very pad dependent. Bottom line: I wanted solid, comfortable pads that wouldn't change the sound signature, and these pads delivered. No complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Comic fan from NM",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T06:40:47.000Z",
          "Titre": "Replacement pads for LCD-4",
          "Contenu": "I was worried when my Audeze LCD-4 ear pads started falling apart. But the Dekoni pads are even more comfortable! These headphones are heavy and need comfortable breathable ear pads. Dekoni definitely came through. Fast shipping, unbeatable prices and quality products. 100% recommended."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "kunde",
          "Nb_Reviews": 4,
          "Date": "2022-10-18T14:28:20.000Z",
          "Titre": "Supreme Customer service",
          "Contenu": "Never recieved my first package. After writing a short minded review here blaming dekoni for USPS mistake, i was contacted by Dekoni Staff. After a short talk they arranged for me a new package free of cost. Customer service above and beyond what I would expect from a company in this day and age.Wholeheartedly recommend Dekoni Audio."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chase G",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T22:18:08.000Z",
          "Titre": "\"B\" stock should be more like \"A-\" stock",
          "Contenu": "The earpads are a great replacement from the original ones that are >7yrs old. I could not even tell they were the \"B\" stock if there wasn't a card noting it from the inspector, but for someone like me getting into Audiophile stuff I can't tell a major difference. They are flawless to me. I guess the only complaint I would have is they are too \"fluffy\" as in they seem bigger than original part, but love them more at this point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Palazzo",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T06:39:22.000Z",
          "Titre": "Breath of new life to my old Sennheiser HD1s!",
          "Contenu": "Replaced the very-worn, smelly earcups of my 5-year-old Sennheiser HD1s. They're fantastic! Softer fitting than the originals, but they sound just as good and have better isolation. Installation was a breeze. Would buy again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 12,
          "Date": "2022-06-08T21:43:30.000Z",
          "Titre": "I recently purchased a pair of Elite…",
          "Contenu": "I recently purchased a pair of Elite Sheepskin pads for my HiFiMan Sundara after first purchasing the Fenestrated version of the same.  I much prefer the non-fenestrated.  This newest pair attached as easily as the rest of them (the secret is to use a credit card to slide under the pad and push the last clip in) and brought the bass thump back to them which disappeared when I replaced the stock pads.  Dekoni makes some high quality pads.  They are well constructed, very comfortable and just overall very nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Blankenship",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T16:29:16.000Z",
          "Titre": "Dropped the sibilance and upped the…",
          "Contenu": "Dropped the sibilance and upped the bass of my DT-1990 Pro's. Was actually shocked how much of a difference it made over the factory ear cups from Beyerdynamic. These Dekoni ear cups make music listening an even better experience. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 4,
          "Date": "2023-08-21T18:44:16.000Z",
          "Titre": "Very fast experience",
          "Contenu": "Second time ordering and order was shipped and received faster than I expected. Haven't had any issues to need customer support yet either to speak to that."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Павел Мастрюков",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T19:39:18.000Z",
          "Titre": "Yep. good.",
          "Contenu": "Ordered several (Got 4 in total) replacement ear pad pairs. Quality's good but the service was even better. There was a shipment issue on the last order as I haven't received any notifications regarding the shipment status from the responsible parties.Dekoni, being bros that they are, just refunded me the full amount upon bringing the issue up.Later it turned out that the pads did quietly arrive in a local post office, I've received them and offered to pay the amount. They've sent me an invoice and the deal was done.The way how they readily took my side in the issue left a very positive lasting impression and I won't hesitate to recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Stewart Chapman",
          "Nb_Reviews": 7,
          "Date": "2022-12-06T04:48:43.000Z",
          "Titre": "I love this company",
          "Contenu": "I love this company. I buy more headphones than I probably should (according to my wife) and each time i do I always replace the pads with Dekoni pads. I've owned everything from Audio Technicas to some Grados I paid WAY too much money for. And Dekoni's replacement pads are ALWAYS a vast improvement and reasonably priced."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jacob Hefferman",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T19:51:54.000Z",
          "Titre": "Dekoni Rocks!",
          "Contenu": "Recently ordered my sixth set of pads from Dekoni. I've always received my orders in a reasonable time frame, undamaged, and as expected. If you're looking to vastly improve the comfort and soundstage of your headphones, don't overlook Dekoni. Their customer support is absolutely fantastic as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oleh Bazel",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T17:42:34.000Z",
          "Titre": "High quality, reasonable prices.",
          "Contenu": "Those are hight quality pads and accessories you guys making.I like everything I bought this far, no complaints, pure enjoyment.The only thing you should keep in mind before buying earpads is that they tend to alter sound of the headphones, so you may get not exactly what you had with stock earpads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T01:54:12.000Z",
          "Titre": "These are great earpads",
          "Contenu": "These are great earpads.  I purchased replacements for my Sennheiser HD820 which has so light a clamping pressure that the original pads weren't sealing properly and most of the bass is lost.  These new pads are a bit thicker as advertised.  They seal and feel better than the OEM pads."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sergey",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T20:59:55.000Z",
          "Titre": "First class experience",
          "Contenu": "Summer 2021 I was looking for the replacement ear cushions for my Sony XM3. Back then I was on a student budget and cancelled my order because I found the original spare parts, cheaper and local (I’m in Germany). The cancellation was very smooth. Now I’m back to make eventually the purchase as I was impressed by the product and the way the firm treats its customers. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Melillo",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T01:44:13.000Z",
          "Titre": "replaced stock pads on a Senn",
          "Contenu": "replaced stock pads on a Senn. HD650 and an AKG 701/702 with your synthetic leather pads. Quality of your pads is outstanding. Don't ask me why, but combining your pads and removing the foam screen totally transforms these cans into world class. Prefer listening to them instead of my top notch Stax rig. Which begs the question, of course. How about replacement pads for Stax earphones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2022-10-23T08:52:28.000Z",
          "Titre": "Pros - sound upgrade. Cons - poor durability",
          "Contenu": "Compared to the original apple silicone tips, they sound better. The vibrations from the ear buds translate to your head are just bigger. They also rip and tear easier and gave me more ear fatigue. A specialized product with pros and cons."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Mladen Mijatov",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T13:42:37.000Z",
          "Titre": "Took longer to arrive than expected but…",
          "Contenu": "Took longer to arrive than expected but the wait was worth it. Pads are much more comfortable than original ones which are not bad by any stretch but they start cooking your ears with prolonged use. These are great and my headphones are now easier to use on meetings since I can hear myself better. All in all very happy with the purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 4,
          "Date": "2022-06-09T19:55:02.000Z",
          "Titre": "Dekoni is just the best...",
          "Contenu": "Every product I've purchase from Dekoni is high quality. Their headphone replacement pads are the best in the business - from fit to materials they use - and they have a replacement for just about every headphone made. I purchased a Dekoni Blue headphone from them and it's one of my favorite headphones in my collection - truly one of the best Fostex T50 mods available. Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "YONG",
          "Nb_Reviews": 4,
          "Date": "2023-03-27T23:42:26.000Z",
          "Titre": "Hifiman Jade earpads replacement",
          "Contenu": "I bought a pair of leather earpads for Hifiman Jade 2 headphones. The original earpads made noise when the foam was squeezed. The replacement certainly resolved the problem. Leather earpads are also more durable and easier for maintenance. I wasn't sure if the earpads of Jade were the same as other Hifiman headphones. Dekoni is the only place that I found had support of the Jade."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jared W.",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T16:17:49.000Z",
          "Titre": "An improvement on the original product",
          "Contenu": "My replacement ear pads for my Focal Clear headphones have been excellent so far! The original padding on the Clear's seemed to get dirty extremely quickly, while the replacement pads from Dekoni have held up great and haven't altered the original sound (to my ears)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T02:01:16.000Z",
          "Titre": "Great company and products",
          "Contenu": "Got great quality pads that fit my headphones perfectly. Really appreciate that Dekoni offers alternatives to OEM earpads that are higher quality and often at a lower price. Shipped quickly, no complaints!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Suzanne",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T00:08:09.000Z",
          "Titre": "Better than original.",
          "Contenu": "I like that Dekoni gives you some decent choices for aftermarket earpads. I enjoy the fenestrated lambskin, now on my Focals and Hifiman headphones, and the price is very affordable. I will continue to shop Dekoni for earpads."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike K.",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T00:52:54.000Z",
          "Titre": "Well packaged product, more comfort, great sound.",
          "Contenu": "Well packaged product.  Pads come in a nice box to save old pads, adapters, etc.  Super thick pads for the Grado headphones are way more comfortable than stock, but they do increase clamping pressure on your head.  Sound quality is just as good or better.  With the old pads my ears needed a break after 30 minutes, I can keep listening to the Dekoni for more than an hour."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Aarno",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T20:37:27.000Z",
          "Titre": "I bought some earpads for my headphone",
          "Contenu": "I bought some earpads for my headphone. I have been using them for about two years now almost every day and they are still in a very good condition. Only drawback I would say is the expensive price of. However considering the good durability and quality of the product I would purchase earpads again from here if I ever needed them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T23:30:51.000Z",
          "Titre": "Fenestrated Elite Sheepskin Replacement Ear Pads for Beyerdynamic DT Headphones",
          "Contenu": "Been wearing the Fenestrated Elite Sheepskin Replacement Ear Pads for Beyerdynamic DT Headphones for 5 months now:they are breathable and quite comfortableeasy to swap onto my headphonesI wear my headphones around 10 hours a day with no issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C.J",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T00:46:28.000Z",
          "Titre": "Great product",
          "Contenu": "I got the fenestrated Sheepskin pads for a Sennheiser 650 right before covid and all was well. After a few months of heavy use (during and after covid) they started to show their wear. Some of the stitching had started to come undone, and the foam was poking out. After a simple email exchange they agreed to replace the, given that I pay for shipping. All has been well since. Love the pads, good quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "yamwt",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T20:48:22.000Z",
          "Titre": "Excellent ear pads",
          "Contenu": "I bought the \"Elite Fenestrated Sheepskin Replacement Ear Pads for HiFiMan Arya\" to replace the factory earpads on my HiFiMan Ananda.  I am super pleased with the result.  Sound quality is improved with the new pads and comfort is better too."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "H Scheerooren",
          "Nb_Reviews": 20,
          "Date": "2022-10-20T09:04:51.000Z",
          "Titre": "Dekoni if you want quality",
          "Contenu": "Ok, i wish they were round the corner in my favorite store.Fortunately the webshop is a good shopping experience and i can always get the headphone accesoires i need.Support on facebook is also very good when short questions come to mind."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "A guy from Finland",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T09:34:14.000Z",
          "Titre": "Suede pads for Beyer DT1990s",
          "Contenu": "I found out about Dekoni headphone pads in youtube through reviewers. Decided to buy some suede pads for my DT1990 set and the pads are incredible. Super build quality and comfort. Great durability, easy to maintain too. Absolutely killer product. 5/5Used the pads for over a year now and no problems.I ordered the pads to Finland and the whole process was super easy too. No complaints from me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T21:58:08.000Z",
          "Titre": "Dekoni's pads for the Beyerdynamic DT…",
          "Contenu": "Dekoni's pads for the Beyerdynamic DT series are the gold standard. And their holiday special tartan patterned pads are awesome if you want to bring a bit of the levity to your office."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T23:59:50.000Z",
          "Titre": "Great Pads and Service",
          "Contenu": "Got some B stock pads for Sony wh1000xm2s, I've got mine ordered and shipped all within 2 days. The pads themselves are nice and soft, looks clean, and fits well. It is thicker/deeper than the original Sony pads so the sound is slightly different, but not in any way bad. No obvious signs of wear from daily use after 3 weeks which is great. Would defiantly buy Dekoni pads again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dusty",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T15:09:39.000Z",
          "Titre": "WORKS BETTER than the ORIGINAL",
          "Contenu": "The ear bud tips are the best I've come across. Better than the Original that came with my earbuds. Always passes the fit test, extremely comfortable, and my buds feel like they are really secure while in my ear. No more fear of popping out. YAY! Thank you for your OUTSTANDING product. I will definitely recommend it to friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike O",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T21:00:32.000Z",
          "Titre": "Replacement Ear Cushions & Headband are Awesome!",
          "Contenu": "The replacement ear cushions and headband pad made my Beyerdynamic DT 770 headphones look and feel like new. I'm very pleased with the quality of the material, perfect fit and fast shipping furnished by the Dekoni Audio store."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Antonino",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T21:18:15.000Z",
          "Titre": "Experience with fenestrated Dekoni ear pads",
          "Contenu": "The product is extremely well made, much more comfortable than the original audeze ear pads."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Piotr",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T22:55:05.000Z",
          "Titre": "Purchased custom earpads for Sony…",
          "Contenu": "Purchased custom earpads for Sony WH-1000XM3. Literally couldn't use original earpads because I have a rare allergy. Used the custom ones ever since, never had any issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don SPENARD",
          "Nb_Reviews": 6,
          "Date": "2022-10-03T18:27:16.000Z",
          "Titre": "Dekoni never fails to develop and…",
          "Contenu": "Dekoni never fails to develop and deliver an excellent product. I have used their products for several years, and their products have always exceeded expectations. Although higher priced than some other replacement pads their products are worth the extra for the high quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T19:23:35.000Z",
          "Titre": "Comfortable upgrade",
          "Contenu": "Comfortable upgrade. Also nice change in the bass 120 hz and below. I estimate a 3 db self, but I am old. I am about to start binaural/ atmos remixing as a learning project. I think with the new pads I can hear some good results."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Paulo coelho",
          "Nb_Reviews": 6,
          "Date": "2022-10-18T18:56:36.000Z",
          "Titre": "I got my elite fenestrated last week…",
          "Contenu": "I got my elite fenestrated last week for my he1000 v1...wow..look good! And far better quality then originalSound is now wider and more powerful..Am satisfiedBut pls: there is no protection for the drivers now..please correct that..make a version with some kind of cloth to protect the sensitve drivers of my he1000..now its unprotected..Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T18:27:52.000Z",
          "Titre": "All round awesome fun to deal with - love Dekoni",
          "Contenu": "First, Dekoni make a beautiful product. This was the second set of sheepskin replacement pads I've ordered from them. That tells you I loved the first pair! They aren't cheap - but they're worth every penny. Ultra comfortable. And even more - the improvement in sound quality on my Grado 'phones is scarcely believable. In every dimension: bass, clarity, soundstage, the whole works. Amazing. Plus they're quick. And even the packaging is cool. All round just awesome fun to buy from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Tauscher",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T18:42:05.000Z",
          "Titre": "Crazy good pads.",
          "Contenu": "Experience from start to finish was great easy to maneuver the website and easy to find what I needed to find. Once I received the pads quality was great packaging was great and no issues at all with using the pads. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T20:36:37.000Z",
          "Titre": "Beautiful products from a proud supplier.",
          "Contenu": "Beautiful products. I got the lambskin for my AKGs. True pride in what they make and sell. Family feel - enjoyed the transaction, packaging, even before I unboxed the gorgeous pads. Recommend highly. Not cheap, but you totally get what you pay for. Nice work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Almando",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T01:43:58.000Z",
          "Titre": "Dekoniaudio EarPads are top Notch",
          "Contenu": "Dekoniaudio products are top of the line items. I have always been satisfied with their products, support, and pricing. The ear pads are highly recommended without any hesitation. The material, fit, and comfort are exceptional; they are much better that competitors earpads that I have tried before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T20:32:03.000Z",
          "Titre": "When a change of earpads on my LCD-X…",
          "Contenu": "When a change of earpads on my LCD-X cans was needed, I decided to give Dekoni hybrid pads a chance. I am glad I did, since I prefer then to the stock pads, after the style change. They are all I expected and more. They are comfortable for long sessions and add to the experience greatly. I would definitely recommend them if you need pads for any headphones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan P",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:18:14.000Z",
          "Titre": "The best.",
          "Contenu": "2nd purchase from this company and it is outstanding. I will never buy any other brand of pads again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BobS",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T00:32:37.000Z",
          "Titre": "Great on Sennheiser and Grado headphones.",
          "Contenu": "I'm using Dekoni pads on Sennheiser (3) and Grado (1) headphones and absolutely love them.  They're more comfortable than the original pads and the sound is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "unBALAnced-10",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T14:56:03.000Z",
          "Titre": "I received my order in a timely manner",
          "Contenu": "I received my order in a timely manner. Shipping was free and I received email updates with tracking information. My order was packaged well no damage and the items were exactly what I expected."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andreas",
          "Nb_Reviews": 3,
          "Date": "2022-10-13T03:22:37.000Z",
          "Titre": "Top Quality products!",
          "Contenu": "All products I received from Dekoni are of top quality! They keep what they promise.I have several pads for different headphones and the excellent carrying case with integrated headphone stand…."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Murray McMaster",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T02:13:06.000Z",
          "Titre": "Audio Elite Velour",
          "Contenu": "I bought B Stock – Dekoni Audio Elite Velour Replacement Ear Pads for Philips Fidelio X2 Headphones. They were shipped promptly and as described. I cannot tell why they were b stock. Very comfy and sound great"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "BISHOP",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T09:52:55.000Z",
          "Titre": "Excellent so far!",
          "Contenu": "These have been excellent so far. I would definitely recommend over the stock Beyerdynamic. One slight issue, that is more to do with these DT 1770 Pro's is that it increases the clamp strength to my head. Can start to give a headache after a while. I bought these for the very reason that these DT's are tough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Porter",
          "Nb_Reviews": 2,
          "Date": "2022-10-22T17:33:13.000Z",
          "Titre": "These ear pads fit my ATH-x50bt…",
          "Contenu": "These ear pads fit my ATH-x50bt headphones very well.  They also improved the sound quality.  The only issue I had, which doesn’t affect my rating, was that the ear holes were slightly too small for my ears and caused discomfort after 1/2 hour of use,  it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BTD",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T18:01:04.000Z",
          "Titre": "Excellent pads! Great experience",
          "Contenu": "The ordering process was easy They've got a great selection of products. They came quickly with tracking and the pads were of outstanding quality. They fit perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T22:54:40.000Z",
          "Titre": "Couldn't recommend these more for all day use",
          "Contenu": "As a software developer I needed cushions I could wear for 8+ hours at a time and these absolutely delivered. These are the most comfortable cushions I have ever used and I recommend them to all of my friends."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T18:51:23.000Z",
          "Titre": "More comfortable than stock cushions",
          "Contenu": "There was a response to an inquiry within hours giving me a link to the correct cushions on your website.  The checkout experience was good.  And the product arrived in the estimated time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Burke",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T18:38:01.000Z",
          "Titre": "Love the earpads",
          "Contenu": "Love the earpads. Also got a suede strap from amazon. both products are very well made and super comfortable. Big upgrade over the flat stock pads, better seal around the ears.Only gripe would be price, but quality isn't cheap so I can't complain!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clareta A. Scott",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T22:34:17.000Z",
          "Titre": "The replacements appear of good quality…",
          "Contenu": "The replacements appear of good quality and arrived on time. My only suggestion is to enclose brief instructions on replacement or offer the web link to do that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gnawme",
          "Nb_Reviews": 5,
          "Date": "2022-10-12T20:27:29.000Z",
          "Titre": "Great balanced cable for Sennheiser HD650",
          "Contenu": "Fast shipping, excellent product. The Dekoni balanced cable is ideal for mating my Sennheiser HD650 headphones to my Walkman NW-WM1AM2."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T16:11:55.000Z",
          "Titre": "Choice Suede Earpads",
          "Contenu": "I bought the choice suede earpads because the stock ones didn't breathe much, which made it hard to wear them for more than an hour. The dekoni earpads enable me to wear them for several hours at a time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jancarlo Cordero",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T22:38:58.000Z",
          "Titre": "A must for comfort~",
          "Contenu": "Absolutely an incredible improvement over the factory option. The noise isolation remains incredible but the driver no longer rests on the ear increasing the comfort exponentially. Not a suggestion, but an absolute must if you are having comfort issues on the XM5."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T06:41:28.000Z",
          "Titre": "The only place I'll go to for earpad replacement",
          "Contenu": "I needed replacement ear pads for 3 separate brand of earphone and they were able to provide more than adequate replacements for all three."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T22:59:35.000Z",
          "Titre": "Great first experience",
          "Contenu": "No issues with purchase or shipping, tracking was a bit weird but worked nonetheless. Product came fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esco",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T06:21:38.000Z",
          "Titre": "Earpadz Buttery Soft",
          "Contenu": "I love love, love how comfortable headphone earpadz is and its ease of removal to swap out (leather/velour-microfiber). It improves wearability, comfort, and sound profile. Best after market replacements out there; hopping to continue purchasing from this company again 😀  Definitely worth the 5-star ratings 🌟 🌟🌟🌟🌟"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Mercado",
          "Nb_Reviews": 9,
          "Date": "2023-03-21T19:27:21.000Z",
          "Titre": "Great earpads",
          "Contenu": "Super fast shipping, earpads made my headphones sound better. They were also super comfy and easy to install as well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Richard Levine",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T20:30:37.000Z",
          "Titre": "Mandatory headphone upgrade IMO",
          "Contenu": "Dekoni pads elevate headphone comfort to the highest possible level.  They make my HD800s completely disappear on my head."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Bay",
          "Nb_Reviews": 5,
          "Date": "2022-10-20T16:43:26.000Z",
          "Titre": "AKG K712PRO fenestrated pads are…",
          "Contenu": "AKG K712PRO fenestrated pads are awesome. Cooler and more comfortable than stock and sound digs deeper into the details."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonard Gemar",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T02:01:41.000Z",
          "Titre": "It's a great product with the perfect…feel",
          "Contenu": "It's a great product with the perfect feel I was seeking to replace my headphone ear pads.  Thanks for making these."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Hylkon",
          "Nb_Reviews": 6,
          "Date": "2022-10-13T22:21:10.000Z",
          "Titre": "Quality products and support",
          "Contenu": "Great products that last long. And the customer support are fast to follow up on any problems. They sent me another pair of headphone ear pads"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Liu",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T18:32:30.000Z",
          "Titre": "Great replacement pads",
          "Contenu": "Great replacement pads, although, being as pricey as this purchase was the pads fit well with my headphones and performed very much as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "robert",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:15:32.000Z",
          "Titre": "Great service and a massive improvement in sound",
          "Contenu": "Received my order of pads for my Koss headphones. Amazed at the quality and how the improved the already amazing sound of my Koss Utility headphones."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "NICk",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T07:40:27.000Z",
          "Titre": "Love my hearpads!",
          "Contenu": "Bought some hearpads for my Beyer Dynamics headset. Been wearing them daily and love them. Highly, highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaka",
          "Nb_Reviews": 7,
          "Date": "2022-10-21T01:12:54.000Z",
          "Titre": "Great Products and Good Prices",
          "Contenu": "They have great products and good pricing. Their customer service went above and beyond. I couldn't want anything more from a company."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Simon Bird",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T23:50:08.000Z",
          "Titre": "I've bought a number of Dekoni…",
          "Contenu": "I've bought a number of Dekoni products, and they've all been well designed and well made. Good service and fast shipping as well. Their earpads are the best aftermarket ones I've tried."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Abrams",
          "Nb_Reviews": 4,
          "Date": "2023-03-21T18:42:55.000Z",
          "Titre": "Easy to find the right products on the…",
          "Contenu": "Easy to find the right products on the website and the products perform and look as advertised. There are helpful instructions and videos."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Doug Bannard",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T22:37:44.000Z",
          "Titre": "New Pads for Grado SR125 and SR225",
          "Contenu": "Delivery was very quick and courteous.  The new velour pads are wonderful...easy to install on both the 125s and 225s...and the headphones I think sound better than they ever have.  Thanks very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isaac",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T22:06:45.000Z",
          "Titre": "Great quality pad, excellent fit. Does change the sound signature but this is what I wanted.",
          "Contenu": "Build quality:Excellent build quality, the fit is perfect for the HD800S. Pads feel very good, it adds some clamp in a good way, since they feel loose with the og pads.Sound wise:I got them with the intention of lowering the treble peak. It achieved that. Detail goes down, but its well worth if you find these sharp.It also made the headphone quieter so you will need more power to reach the same level of volumes (from 72% to 77% on my amp)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Hernandez",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T03:15:52.000Z",
          "Titre": "Luxury that’s worth the price",
          "Contenu": "The ear pads are soft, comfortable, and don’t overheat. As a guy with bigger ears, they fit much better than the original ear pads from the PC30X.Love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Glenn",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T20:11:36.000Z",
          "Titre": "One of the few companies I actually trust.",
          "Contenu": "Had a few purchases through Dekoni, never had an issue and they are always quick with inquiry responses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jay",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T18:23:09.000Z",
          "Titre": "Most Comfortable Pads Ever",
          "Contenu": "most comfortable pads (velour) i've ever worn! fast shipping, great product, at a good price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GREGORY",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T16:51:29.000Z",
          "Titre": "Alternate pads for Noire",
          "Contenu": "Got these as an optional set of pads for my Noire.  They fit perfectly and give a bit more separation in the high end"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:17:08.000Z",
          "Titre": "Fanatic products",
          "Contenu": "Fanatic products, and quick shipping. Can’t go wrong with anything they sell. Highly recccomended"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "greenmilk",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T17:20:43.000Z",
          "Titre": "Great first purchase experience",
          "Contenu": "Item was B-stock but genuinely great quality and packaged well. Shipping was a little slow but that's not Dekoni's fault. Pleased with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Ville Välimaa",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T17:30:49.000Z",
          "Titre": "Not cheap but excellent products",
          "Contenu": "They are not cheap, but Dekoni makes hands down the most comfortable earcups I’ve ever used. They also made my HiFiMan Arya sound slightly better."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Arnt-Joakim",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T14:25:08.000Z",
          "Titre": "100% happy with my purchase",
          "Contenu": "Really happy with the pads, amazing packaging and amazing pads. You get what you pay for that's for sure, so I'll most likely purchase again from you when the time comes."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Richard",
          "Nb_Reviews": 4,
          "Date": "2023-08-16T21:19:13.000Z",
          "Titre": "It’s easy to find the right product you…",
          "Contenu": "It’s easy to find the right product you need at Dekoni’s. Every time I need another pair of headphones, my first stop is here. Great quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T00:03:41.000Z",
          "Titre": "These earpads are life changing",
          "Contenu": "These earpads are life changing. I can wear my grados all day. Prior I could only go 30 minutes before being in pain."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Włodzimierz Podkański",
          "Nb_Reviews": 5,
          "Date": "2023-09-11T14:24:55.000Z",
          "Titre": "Dekoniaudio pads.",
          "Contenu": "The Dekoniaudio pads are the best. Grado headphones got a new life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Jennings",
          "Nb_Reviews": 2,
          "Date": "2022-10-12T20:23:18.000Z",
          "Titre": "Dekoni makes fantastic replacement pads…",
          "Contenu": "Dekoni makes fantastic replacement pads and I've bought them for several headphones where they either needed replacement due to age or Dekoni made a pad that improved comfort compared to the factory supplied pads."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T06:03:02.000Z",
          "Titre": "Worth the effort,",
          "Contenu": "Needed new pads for my over the ear headphones, Dekoni delivered, not only price but fit, comfort and style."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Nodell",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T20:20:08.000Z",
          "Titre": "I bought two sets of the Dekoni DoTs",
          "Contenu": "I bought two sets of the Dekoni DoTs. They made a pair of slightly oversized headphones fit comfortably and with very little effort."
        }
      ]
    }
  ]
}