{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "dijifi.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T00:17:20.000Z",
          "Titre": "Several of the prints were blasted and…",
          "Contenu": "Several of the prints were blasted and it's hard to distinguish facial features."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T18:52:44.000Z",
          "Titre": "Go somewhere else!",
          "Contenu": "slow, overpriced, constantly adding new fees and charges and overexposed my film (almost white result. Charged 10$ for audio, film has no audio. Said will investigate why the video was just white and never got back with answers. Super 8 film was old but kept in a dry and dark place. I believe this was a film development error. Just go somewhere else. And I can answer their reply even before this review gets one:Sure, I can remove this review for a small fee of 200$ and 20$ for audio that you will not receive plus 30$ for flash drive that you also will not receive. I might also come up with some more fees if you want me to remove this review faster. Sorry I actually can't remove it but I can overexpose it for a small fee. Sounds familiar?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandy Brown",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T12:37:56.000Z",
          "Titre": "I have yet to actually receive my…",
          "Contenu": "I have yet to actually receive my photos!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T06:17:38.000Z",
          "Titre": "My photo was not properly protected…",
          "Contenu": "My photo was not properly protected when it was shipped to me. It was damaged during shipping. The company offered to re-print for me but wanted me to pay for shipping costs. I do not feel this is fair, since I did not do anything wrong. I used to work at an art gallery and have packed up lots of art. The photo I received was not properly packed. I am hoping that DiJiFi changes its mind"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Johnson",
          "Nb_Reviews": 1,
          "Date": "2018-02-13T19:20:37.000Z",
          "Titre": "Crazy people. AVOID.",
          "Contenu": "Are you kidding me? I can't even believe I was asked to review this company. They tried to hold our materials hostage after we pulled our job from them. Crazy people. AVOID.I should add that the quality of their transfers may be sufficient for home movies, etc., but in terms of professional, preservation-quality transfers, their work was not very good, and they were *extremely* disorganized. Highly recommend BB Optics instead."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T00:32:59.000Z",
          "Titre": "Very poor service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T03:35:10.000Z",
          "Titre": "The quality was mediocre",
          "Contenu": "The quality was mediocre. This is the second time I used this place for a transfer. The first time I went to another facility and had much better results. So I will be deleting this file and taking my business elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ltp",
          "Nb_Reviews": 2,
          "Date": "2021-07-03T00:09:17.000Z",
          "Titre": "First time- A bit sloppy",
          "Contenu": "I called to make sure everyone knew this is my first film I’m dropping off of many many more to come and that I was testing to see how it came out.  the film came out OK but they didn’t put my role back in the original package and the white leader was hanging out. my son rolled it back up and wasn’t too impressed and neither was I. These are my precious belongings - all I have left of some of my loved ones. The handling was a bit sloppy even though I received an apology that shouldn’t happen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-02T17:16:39.000Z",
          "Titre": "A very simple task that takes less than…",
          "Contenu": "A very simple task that takes less than 5 minutes was charged a ridiculous amount. I think you all should consider waiving the file upload fee for jobs that are ONE scan. The estimate you gave me over the phone was not accurate and the manager did not do much about it. This was the first time I've used your services and I had really high hopes. So sorry to see how disappointing your customer service is."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-05T12:48:21.000Z",
          "Titre": "Disappointed in every aspect",
          "Contenu": "Disappointed in every aspect: - 7 weeks of wait to process a 6-minute 16 mm film, - overpriced (more than $100), - no call or e-mail to tell me it is ready, - attempt to overcharge me  by 25% at the time of payment of the balance - instructions not followed in the formatting of the film, resulting in a 30 minute wait at the time of pick-up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-09-11T20:32:32.000Z",
          "Titre": "Services rendered",
          "Contenu": "The rates seemed expensive, everything was handled in a timely fashion, however when I received my usb it only had audio files on it, none of the film. After emailing I was sent an email with the video files to transfer. All in all I was underwhelmed with this experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2018-08-13T22:47:48.000Z",
          "Titre": "$24 in surprise fees",
          "Contenu": "The work was completed to a good quality, but the quote provided was not transparent.  When I received my invoice, I was surprised to be charged $19 for the removal of my photos from the storage sheets I had placed them in and another $15 to receive the files online.  I would have picked a different packing method if I had known about the charge.  I also did not know there was any alternative to receiving the files electronically.  Neither of these fees were in the estimate provided to me, and we also not communicated in an email conversation that I had."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "fenton lawless",
          "Nb_Reviews": 2,
          "Date": "2018-10-19T22:46:01.000Z",
          "Titre": "Not great",
          "Contenu": "Not great . . . I wanted an old 1/4\" audio tape on a pancake reel digitized and put on a 7\" plastic spool. 16 minutes of content. I paid $78 for the wave file plus an added $15 to return the tape which I got tangled on the same pancake reel minus the 7\" plastic spool that was specified on the invoice. I expected to pay premium prices but the imperious attitude when I questioned why they would send a tape back loose on a pancake reel when obviously I took the trek to Greenpoint to come out with a playable tape was an unwelcome bonus. Life is too short . . ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T14:14:24.000Z",
          "Titre": "It  took over a month to get my order…",
          "Contenu": "It  took over a month to get my order processed, way too long! 50% surcharge that would process the order just a week earlier is unreasonable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cindy Nyitray",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T18:44:36.000Z",
          "Titre": "The charges are exorbitant!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-05-22T16:20:03.000Z",
          "Titre": "Great job thanks for making vhs…",
          "Contenu": "Great job thanks for making vhs memories into dvds. Thanks sean will definitely be using Dijifi again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Sheldon",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T20:04:21.000Z",
          "Titre": "Good job on most of the tapes",
          "Contenu": "Good job on most of the tapes, but two of them were not transferred on to the flash drive.I have not been credited for another tape, which you were not able to transfer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T04:21:20.000Z",
          "Titre": "Sweet staff",
          "Contenu": "Sweet staffOverpriced Would be nice if there were some way to qc and monitor before transferring material"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T00:53:39.000Z",
          "Titre": "Everyone was super nice but…",
          "Contenu": "Everyone was super nice. But it took forever. Forever to complete and was way too expensive."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "a customer",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T14:32:28.000Z",
          "Titre": "GREAT JOB ON TRANSFERS, BUT...",
          "Contenu": "Did a great job with the transfers I needed... however, could work on their customer treatment.  Person at the front desk was  not very friendly.  When I asked her to leave a message for one of the staffers, she just looked at me blankly and said, Anything else?  She didn't even write down the message, probably didn't relay the message either.  She was colder than the rain that drenched me that day.Other than that, everyone else on the staff was friendly and helpful and its been great.  I would've given 5 stars, but it does take one bad egg to ruin the pot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BELIER PRESS",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T22:15:02.000Z",
          "Titre": "CARELESSLY DONE",
          "Contenu": "TWO OF THE CASSETTES WERE NOT PLACED CORRECTLY INTO THEIR SLEEVES BEFORE BEING RETURNED.  ANOTHER OF THE CASSETTES WAS NOT REWOUND.  ALTHOUGH THE TRANSFER OF THE 8MM FILM WAS SUPERIOR TO WHAT WE HAD AVAILABLE BEFORE, THE ATTEMPTED CHARGE FOR THE 'TITLING' OF THE FILE WAS PETTY."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elliott",
          "Nb_Reviews": 1,
          "Date": "2019-06-24T17:27:18.000Z",
          "Titre": "I was not happy with the sequence",
          "Contenu": "I was not happy with the sequence. Each reel transferred from Super 8 to digital should have been saved to its own file on the hard drive that I purchased from them, rather than make me do it and determine if  all the reels i gave them were, in fact, scanned and digitized. I paid top dollar for hi resolution and, frankly, it lacked, in the overall, that quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T23:53:36.000Z",
          "Titre": "Not Successful",
          "Contenu": "I needed to find out if a specific file was on old floppy disks. It wasn't, yet I paid $100 for \"recovery\" of all other files I didn't need. (Would have been better to have DiJiFy just search for the specific file first to see if it was a) on it b) recoverable)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-25T01:11:15.000Z",
          "Titre": "I'm disappointed",
          "Contenu": "I'm disappointed. I have been recommending clients to this company for years but have never dealt with them directly. The prices are very steep for cassette conversion. There are a ton of add-on charges too which you can mitigate by picking up and sending your own flash drive. When I received the flash drive it was formatted for Mac only and my client has a PC. I was never asked, they just assumed. Thank goodness my husband is tech savvy and we did a workaround. I will say they were very responsive in their correspondence."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Susan Easley",
          "Nb_Reviews": 4,
          "Date": "2018-02-23T12:32:47.000Z",
          "Titre": "They did a great job with the transfers…",
          "Contenu": "They did a great job with the transfers but wow, really slow service! They changed the finish date twice (weeks later!). A bit snippy in their reply when I would finally contact them after THEIR ending dates came and went. Would use them again but with much lower expectations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda  Biron",
          "Nb_Reviews": 3,
          "Date": "2019-06-11T22:04:17.000Z",
          "Titre": "Cassette to CD",
          "Contenu": "Very good customer service.  Frequent email contact. Service was quick.  Unfortunately the quality of the CD was not what I expected.  The volume went from high to low with  lot of background noise.  Honestly, the quality of the original cassette was better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerStephen Vaughan",
          "Nb_Reviews": 1,
          "Date": "2018-05-05T13:03:17.000Z",
          "Titre": "DISAPOINMENT",
          "Contenu": "Disappointed that I have to pay to remake Cd's ] no one explained, would have to pay extra to play various tracks 2, 3 etc. ] never seen a cd that you could track jump!!!! knew nothing of  track listing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2018-06-02T13:42:40.000Z",
          "Titre": "The digitization service is good",
          "Contenu": "The digitization service is good, but I feel as if the finished work sat on DiJiFi's shelf until I contacted them about it, asking if the project was finished. Only then did DiJiFi ship the work to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-02-16T19:29:54.000Z",
          "Titre": "I have tended to use dijifi to convert…",
          "Contenu": "I have tended to use dijifi to convert videos and audio tapes to archival formats, as that is clearly what they specialize in and it's preferable to sending it out of state or a local camera shop.  However while their service is friendly and cheerful, it leaves a bit to be desired in other ways.  EG, I was handed a box of archival DVD's in flimsy sheets with no sort of box the right size to store them so they don't wobble and also stay upright, and when I asked for advice on how to find the right-size container I got a shrug.  Also, they take the materials and don;t give you a receipt or even an accurate quote- that cones by email later.  In my case it was double what I was originally quoted because that quote did not include an extra charge for retrieving the audio tapes from dropbox, or a fee for paying by credit card.  So if one balks at the actual quote one has to make an additional trip to Greenpoint after work (they have no weekend hours) to retrieve the materials, all for nothing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2021-01-02T15:05:13.000Z",
          "Titre": "The service was excellent, the costs quoted were misleading and kept rising throughout the discussion.",
          "Contenu": "The service was excellent. The costs quoted were misleading."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Albert Hasan",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T21:50:20.000Z",
          "Titre": "Great but could communicate more",
          "Contenu": "Great ServiceI wish there were more updates along the way because the process does take a bit and I would forget sometimes that I sent something in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T20:31:15.000Z",
          "Titre": "I looked everywhere to find a way to…",
          "Contenu": "I looked everywhere to find a way to digitize Sony mini discs and you were the only place that even wanted to give it a shot! I'm just a bit frustrated about the charges considering there was so little audio on them and the extra fee to get my discs back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wendy Washburn",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T03:02:15.000Z",
          "Titre": "Good communication and customer service",
          "Contenu": "The audio files were nice and clear that I received. I had asked for and expected CDs but they were not sent. After notifying them the error was quickly rectified. It was a case of miscommunication that was resolved to my satisfaction. They are good folks to do business with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loraleah Skinkle",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T17:25:58.000Z",
          "Titre": "came out great!!!",
          "Contenu": "Film came out great! Gave 4 star because it did take awhile to get back but it was worth the wait. I came to DiJiFi because I have gotten a few blank films back from Pro8mm and it could be due to them rushing the process. I would rather go to a place who takes their time and gives me product then a place who's quick and doesn't always deliver. I will defiantly be using DiJiFi again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MSB",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:37:55.000Z",
          "Titre": "I had a pleasant experience",
          "Contenu": "I had a pleasant experience.  They even worked out a delivery to return my my photos to my home so I didn’t need to make a trip back to Brooklyn from Queens. I would definitely recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PJP",
          "Nb_Reviews": 7,
          "Date": "2023-08-08T03:11:22.000Z",
          "Titre": "Costly Blank Microcassette",
          "Contenu": "I sent an old micro cassette to be moved to a listenable format. After paying a deposit, then the final amount due, I received a DropBox link. For days I attempted to listen to files. Then gave up and contacted the company. Turns out the cassette was blank so there were no sound files to open. However, I wasn’t notified of that and also paid to have the tape shipped back to me. They did refund me that shipping cost, but I paid a lot of money for what turned out to be a blank tape. They could have told me the tape was blank instead of sending a blank file to me for no apparent reason, which I then wasted days trying to listen to files that weren’t there. It was my mistake to send a blank tape, I take the blame for that, but disappointed the communication was so poor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T16:39:39.000Z",
          "Titre": "Generally good, with reservations",
          "Contenu": "Good, but the individual files were first returned in stereo rather than separate .wavs as requested. Tech seemed to make that decision. Separate long .wavs were supplied for each side, but individual song breakdowns were still stereo, which is not correct. I easily did my own split on the longer .wavs that were done right, so I can mix them as properly as possible - each song has a different set of mic placements, so the stere tracks were a waste, and I paid for them. Otherwise, great transfers. After the fact DiJiFi offered to do the individual song splits, but they are already done. We all did extra work, so this seems all fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Orbin",
          "Nb_Reviews": 5,
          "Date": "2022-08-03T00:30:20.000Z",
          "Titre": "Communication saved a bad review.",
          "Contenu": "After sending a negative to dijifi and priced for 2 5x7 of my grandmother, I mwas sent aan email stating almost edouble then the quote plus shipping. Well I askerd for the negative back . within 2 weeks and no negative I called. finally someone with common sense answered and we worked a more than fair deal. Extremely happy and the work was very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T18:29:11.000Z",
          "Titre": "Excellent product",
          "Contenu": "I was amazed at the high quality product I received (converting a 1964 home video into digital format), I honestly never expected such clarity and sharp colors. AND they delivered before they said they would. Would recommend, and will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T20:55:11.000Z",
          "Titre": "Prompt, Competent and Friendly Service",
          "Contenu": "Prompt, competent and friendly service - I had a 1994 VHS with about 2 hours of content digitized.  This would have been a 5-star rating, except for the final part where my materials were to be returned to me.  DiJiFi initially wanted to add another $61 to the $17 that I had already paid due to shipping costs to Hawaii being higher than anticipated.  I directed them to use the USPS flat rate service, which came in under $17 with tracking provided, and the issue was resolved thereafter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Noland",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T19:10:21.000Z",
          "Titre": "Good prompt service as I had a rush…",
          "Contenu": "Good prompt service as I had a rush order. Responsive to my questions. My only comment is that some of my images were a bit on the dark side. A generally good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neighborhood Friend",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T19:35:14.000Z",
          "Titre": "Dijifi did great work!",
          "Contenu": "Dijifi was very personable, quick and the work was great!  Not to mention that I had to search high and low to find a company to convert an 80's VHS to a digital file/DVD, many seem to have closed during covid.   I will use them over and over for other projects.    I love the area in Greenpoint they are in also.   Way to go Dijifi."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-19T01:02:44.000Z",
          "Titre": "They communicated with me promptly",
          "Contenu": "They communicated with me promptly; they attempted to correct a problem although it was not completely resolved; I was most impressed with the quick response to my emails."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "caterina borelli",
          "Nb_Reviews": 3,
          "Date": "2022-05-16T15:47:04.000Z",
          "Titre": "always reliable",
          "Contenu": "Dijifi is always reliable for the quality of the work they do. Count on them!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gordon Landwirth",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T19:07:23.000Z",
          "Titre": "Excellent responsiveness and…",
          "Contenu": "Excellent responsiveness and communication. Digitization seems well done. Accommodated a special request of mine regarding picking up my materials. Some billing errors were the only problem but overall I’m satisfied and appreciative of the customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mark boccuzi",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T18:09:00.000Z",
          "Titre": "I do not have the finished product back…",
          "Contenu": "I do not have the finished product back yet, but the set up was very easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T19:56:23.000Z",
          "Titre": "everything fine",
          "Contenu": "everything fine, a bit pricey i thought.that being said, do plan to use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Mason",
          "Nb_Reviews": 5,
          "Date": "2021-07-29T12:59:01.000Z",
          "Titre": "I had some issue with how my completed…",
          "Contenu": "I had some issue with how my completed items was packaged.  It was not packaged properly for traveling without the possibility of being damaged.  I asked several times to have it fixed and the final outcome was still unsatisfactory.  I am not always driving when I pick up items and traveling on public transportation with newly paid for items not properly secured is quite annoying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-25T10:48:08.000Z",
          "Titre": "Great end result",
          "Contenu": "Great end result. I converted a negative from 18 years ago to a digital format and it looks great!The process took longer than expected with delays in communication back and forth.  Also the purchase process was archaic. I couldn’t pay online; I had to fill out a form and then had to mail it(something I rarely do) and then was charged a fee for using my credit card which seems crazy in this day and age. I received my original negative back safely and all is well. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2021-05-20T15:38:35.000Z",
          "Titre": "Good Scans",
          "Contenu": "The scans were done very well, which is the main point.  The turnaround was slow, the requested CD was not initially included in the return mailing, and the original mailing envelope was lined internally with a lot of dust and debris, which I didn't want on my material.  Very good customer service and response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry L Caldwell",
          "Nb_Reviews": 2,
          "Date": "2021-03-26T13:48:47.000Z",
          "Titre": "Very Professional",
          "Contenu": "I had some old reel to reel air checks from the 70’s, I was unsure about the quality. These pros were able to convert them to digital in a timely manner. At one point we mis-communicated, they quickly resolved that issue. I would recommend them to anyone, very pleased with the results and the price was reasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug LeClaire",
          "Nb_Reviews": 2,
          "Date": "2021-03-03T22:13:59.000Z",
          "Titre": "Was happy to find DiJiFi and the small…",
          "Contenu": "Was happy to find DiJiFi and the small project we submitted for transfer and other work was done professionally and successfully.  The communication with the staff members, which is hugely important to me, was timely, courteous and informative.  We hope to have more work submitted soon.  Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2019-09-02T22:42:20.000Z",
          "Titre": "DiJiFi completed exactly the services I…",
          "Contenu": "DiJiFi completed exactly the services I asked for in the best quality they could manage and were quite transparent about pricing. They were also quick to respond to any concerns that I had. I'm giving 4 stars instead of 5 because it is a bit overpriced for the services provided. Automatic upload to a server would be far less of a hassle than just being provided with a hard copy and I would've been much happier to pay the price that I did."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2019-05-13T10:25:57.000Z",
          "Titre": "Dijifi is great with one…",
          "Contenu": "Dijifi is great with one complaint--they are a little slow. I was not in a hurry to get my scanned images, and they told me it would take a few weeks, but it took even longer than they said and they were not especially proactive about keeping me informed on the timeline. But they were highly personalized and very custom and flexible and quite reasonable price wise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-03-20T20:45:03.000Z",
          "Titre": "Love working with Kareem at Dijifi and…",
          "Contenu": "Love working with Kareem at Dijifi and Sandra  - had PAL DVDs done recently and it was pain-free and efficient - Kareem went the extra yard to help me out.  When i transferred films (16mm and 8mm) it took a really LONG time - you can pay extra to get it done more quickly - maybe it's better now not sure - just DO NOT go to Rafik they are the worst.  Mr. Rafik is dead and someone bought his name and it's terrible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elena",
          "Nb_Reviews": 1,
          "Date": "2018-02-01T18:48:46.000Z",
          "Titre": "DIJIFI -Great group",
          "Contenu": "Great group. Only giving 4 stars because my delivery date was several weeks passed the projected due date and they did not update me. To be fair, it was the Holiday Season and they said they get slammed. Otherwise -it would be 5 Stars. They did a good job converting 8mm to .mov files and are really nice people! Glad they exist."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T03:39:53.000Z",
          "Titre": "very fine work product",
          "Contenu": "very fine work product, just a little too pricey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CUSTOMER",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T21:53:42.000Z",
          "Titre": "Y'all did great",
          "Contenu": "Y'all did great, however the service took much longer than stated with no compensation. Along with this... after searching further, I discovered the price I payed was far more than I should have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T20:12:43.000Z",
          "Titre": "Great product, small customer service confusion",
          "Contenu": "The product quality and transfer process was simple and easy - . Had a small customer service confusion come up about the turnaround time on the order but the issue was addressed and corrected as soon as I brought it up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-30T17:18:58.000Z",
          "Titre": "This place was great and the quality…",
          "Contenu": "This place was great and the quality and attention were exceptional. The only reason it's not 5 stars, is the price point. It's pricey, but to get videos of my recently passed father, it was totally worth it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Gardner",
          "Nb_Reviews": 3,
          "Date": "2022-09-20T23:46:48.000Z",
          "Titre": "It's great product if you can afford it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John E.",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T14:43:45.000Z",
          "Titre": "Although my 60 year old 3” tape reels…",
          "Contenu": "Although my 60 year old 3” tape reels didn’t reveal any family treasures, they were quickly and excellently digitized into .wav files - I’d certainly use DiJiFi again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T16:59:15.000Z",
          "Titre": "generally I would give 5 starts",
          "Contenu": "generally I would give 5 starts, I've been very happy with your services for almost 7 years, however there were too many mix ups with the return delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-09T21:15:41.000Z",
          "Titre": "Pretty great",
          "Contenu": "Pretty great! Would have liked to know ahead of time how the clips were spread out. The file ordering of the ripped video feels kinda random. But overall good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helene Awad",
          "Nb_Reviews": 1,
          "Date": "2018-02-02T00:49:44.000Z",
          "Titre": "Yvonne was articulate and welcoming as …",
          "Contenu": "Yvonne was articulate and welcoming as she patiently explained the different services possible.  The order has not yet been done so I cannot as yet review the work at hand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Merrill Clark",
          "Nb_Reviews": 1,
          "Date": "2019-02-04T22:10:23.000Z",
          "Titre": "Two complaints",
          "Contenu": "Two complaints. One-directions online were not updated and made the place difficult to find.Two-the transfer sounded like the right noise reduction wasn't used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-15T16:01:51.000Z",
          "Titre": "Quality of work is great",
          "Contenu": "Quality of work is great. I would have appreciated more of an opportunity to speak with the technician to understand what steps were taken to restore my photo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T14:10:46.000Z",
          "Titre": "Good communication with the team via…",
          "Contenu": "Good communication with the team via email regarding orders and payment. A bit long wait time for completing the project. Would use DiJiFi again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhonda Herberger",
          "Nb_Reviews": 2,
          "Date": "2021-11-10T23:21:22.000Z",
          "Titre": "Had to go across country, but it worked out great!",
          "Contenu": "Super nice, returned calls, did a great job.  There were a few delays, but all and all a great company to work with.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George S.",
          "Nb_Reviews": 3,
          "Date": "2021-04-15T17:50:19.000Z",
          "Titre": "Quality work and great customer service",
          "Contenu": "I’m new to DijiFi and so far no complaints, and I’m a complainer! Just quality work and great Customer service. So happy I found them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T00:55:11.000Z",
          "Titre": "Scanning results turned out well",
          "Contenu": "Scanning results turned out well. My only complaint is the prices which were higher than other service providers."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-16T16:16:49.000Z",
          "Titre": "Slow delivery",
          "Contenu": "Things were fine except it took 6 days and a phone call to get my materials delivered to ups. Your video guy must have forgotten about my order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Catrina Genovese",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T10:04:51.000Z",
          "Titre": "I was pleased but found them a bit…",
          "Contenu": "I was pleased but found them a bit pricey. The salesperson did not completely disclose all fees in my preliminary conversation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2018-03-04T08:13:09.000Z",
          "Titre": "The people were straight forward and…",
          "Contenu": "The people were straight forward and the quality was also good.  The delivery time went over by 4 days otherwise I could have made it 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Dietz",
          "Nb_Reviews": 9,
          "Date": "2018-08-07T14:21:41.000Z",
          "Titre": "They do good work",
          "Contenu": "They do good work, but their billing dept needs to be improved.  They also seem to be backlogged as the work takes quite some time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Mariette Pathy Allen",
          "Nb_Reviews": 2,
          "Date": "2020-01-07T22:46:09.000Z",
          "Titre": "My only negative comment is that it…",
          "Contenu": "My only negative comment is that it took longer to get the scans made than we thought. Other than that, the work was fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T15:57:55.000Z",
          "Titre": "Very happy with the options provided…",
          "Contenu": "Very happy with the options provided for digitizing an over-sized, aerial photo.  Quick and efficient turnaround, too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PETER",
          "Nb_Reviews": 4,
          "Date": "2018-03-17T01:46:57.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, professional and friendly service. Their location is a bit out of the way but I’d still recommend them"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 1,
          "Date": "2018-08-22T19:10:22.000Z",
          "Titre": "the cost and turnaround was wonderful",
          "Contenu": "the cost and turnaround was wonderful.  Happy for the most part with the result of the CD.Thank youCathy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2018-02-03T19:04:22.000Z",
          "Titre": "Overall Good Experience and Quality VHS Transfer",
          "Contenu": "Overall a good experience and I would give them my business again. Deducted one star because of the confusion and lack of response to my question regarding the differences in transferring VHS over to DVD or Blu Ray. When I dropped my VHS off I was told the technician who could answer my question specifically was not available but he would contact me regarding my question about Blu Ray quality compared to DVD for a VHS transfer and the cost difference. A week went by without a response and I emailed them. The reply I received back was the same as when I dropped the VHS off...the technician was not around but I would receive a response shortly. Not long thereafter I was notified the VHS transfer was completed and done on DVD. I was very happy with the final product and the quality was good for a 33 year old VHS source. I just didn't understand why I couldn't get a straight answer to a simple question and why they went ahead and completed the transfer without answering me first...I was willing to spend more on the Blu Ray if in fact it would have been a noticeable difference in quality. Not a big deal, like I said I would use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danielle Havens",
          "Nb_Reviews": 2,
          "Date": "2020-10-19T15:29:54.000Z",
          "Titre": "Customer Service and Transfer Completion Date",
          "Contenu": "Customer Service was very friendly and you completed the transfer on the date that you projected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CN",
          "Nb_Reviews": 1,
          "Date": "2020-03-07T15:41:32.000Z",
          "Titre": "I was very happy with the service",
          "Contenu": "I was very happy with the service. Professional and delivered on time.Will use again or recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 4,
          "Date": "2018-02-22T18:06:27.000Z",
          "Titre": "Strong customer service",
          "Contenu": "Strong customer service. Need to check on scanning for completeness. They missed 3 out of 1,000 photos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer  Elise Goodman",
          "Nb_Reviews": 1,
          "Date": "2018-11-04T17:11:40.000Z",
          "Titre": "I marked four stars because it took so…",
          "Contenu": "I marked four stars because it took so long to fget al lthis done.But Dan was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T19:13:57.000Z",
          "Titre": "Excellent service good communication",
          "Contenu": "Excellent service good communication. Felt very safe entrusting priceless memories to them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Raphael Magnes",
          "Nb_Reviews": 4,
          "Date": "2019-08-10T09:57:04.000Z",
          "Titre": "Work was delivered on time.",
          "Contenu": "Work was delivered on time.Films were cleaned before scan.over all I gave it 4 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mga",
          "Nb_Reviews": 1,
          "Date": "2018-02-17T18:15:07.000Z",
          "Titre": "videos had some interlacing that could have been prevented",
          "Contenu": "videos had some interlacing that could have been prevented. service is good in general."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara Hartley",
          "Nb_Reviews": 5,
          "Date": "2022-12-20T20:41:34.000Z",
          "Titre": "Good service slightly slow communication"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-07-11T08:10:06.000Z",
          "Titre": "The guys are straight forward and…",
          "Contenu": "The guys are straight forward and honest they do excellent work would recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles R.",
          "Nb_Reviews": 3,
          "Date": "2022-05-02T17:29:50.000Z",
          "Titre": "Work well done but slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-29T18:01:58.000Z",
          "Titre": "Review",
          "Contenu": "They have great customer service, very helpful when you call."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-23T14:04:40.000Z",
          "Titre": "great quality",
          "Contenu": "great quality, great service and reasonable prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-02T00:35:01.000Z",
          "Titre": "Good company but long wait time for…",
          "Contenu": "Good company but long wait time for dupes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T22:18:50.000Z",
          "Titre": "Very professional  and helpful"
        },
        {
          "Note": 4,
          "Lieu": "JO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T17:28:37.000Z",
          "Titre": "Thank you team",
          "Contenu": "Great work. Thank you team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DON",
          "Nb_Reviews": 1,
          "Date": "2018-08-07T16:10:24.000Z",
          "Titre": "Was very happy with their service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philadelphia 76ers",
          "Nb_Reviews": 1,
          "Date": "2018-02-09T20:31:09.000Z",
          "Titre": "DiJiFi",
          "Contenu": "Fine work and communication."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul & Atina",
          "Nb_Reviews": 2,
          "Date": "2020-01-21T17:46:54.000Z",
          "Titre": "Very efficient service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-02-23T01:35:43.000Z",
          "Titre": "Helpful and courteous"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T00:41:54.000Z",
          "Titre": "good",
          "Contenu": "good. high quality"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yassi Irvine",
          "Nb_Reviews": 19,
          "Date": "2021-09-17T05:36:18.000Z",
          "Titre": "Photo is real"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-08-17T18:46:54.000Z",
          "Titre": "Great to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:42:24.000Z",
          "Titre": "their customer communications was timely and informative.",
          "Contenu": "First of all this company does both the digitizing and the printing. many companies would only do one or the other."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T14:06:39.000Z",
          "Titre": "I recently discovered some old cassette…",
          "Contenu": "I recently discovered some old cassette tapes that my parents had, after my dad recently passed. You preserved them onto CDs for me and I was also able to share the additional copies with family. The whole process, from my original inquiry to delivery, was seamless. Thank you so much for preserving the memories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:56:37.000Z",
          "Titre": "getting quick answers to all my…",
          "Contenu": "getting quick answers to all my questions with phone calls and I didn't have to wait on hold for these answers . the quality of the output from the digitizing process of the reel to reel tape was clear and audible"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dann Baker",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:34:46.000Z",
          "Titre": "ARNOLD",
          "Contenu": "Customer service people were professional but also warm. Job was done in a timely fashion. Emails were informative."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "WEBCLIENT",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T19:08:14.000Z",
          "Titre": "I love DiJiFi",
          "Contenu": "I love DiJiFi. The staff is exceptional and the product speaks for itself. I trust them with my very precious moments. I've been going to them for years because they are the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen, San Francisco",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:35:23.000Z",
          "Titre": "Everything as promised!",
          "Contenu": "I was given a quote, a timeline, and directions.  Everything was as promised.  The recording is clear and wonderful.  I am very grateful.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Lahey",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:41:36.000Z",
          "Titre": "Who You Choose to Transfer your memories matters!",
          "Contenu": "we sent our tapes out to Legacy Box, they had our tapes for months, no communication on progress and when we finally received back 4 short files, not even an hour in length from  40 tapes from our home library that was started back in 1981 at our wedding! These tapes are my life work, the kids growing up, family gatherings, kids sports etc. Legacy Box was horrendous. We were so fortunate to find DiJiFi, they notified us the moment they received our 40 tapes, the organized them, they discovered that they did need lots of expertise to restore and transfer and they did so with incredible results. We now have our entire library on a hard drive that was provided by DiJiFi. They did an amazing job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Bruno",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T15:31:39.000Z",
          "Titre": "Precious Memories Preserved",
          "Contenu": "Shipping my grandfather's tapes from Georgia to NYC was a little frightening. I had never heard his voice before and I didn't want anything to happen to them. The staff at DiJiFi was so helpful and communicative throughout the process. They turned around the final product quickly and with great quality! My entire family loved being able to hear Grandpa's voice, some for the first time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T15:21:53.000Z",
          "Titre": "Transferring Old Film Reels",
          "Contenu": "DiJiFi transferred six reels of old film for me. They delivered before their estimated completion date and the quality was fantastic. Prices were reasonable, and upon payment I received an easy to use link to the video via Dropbox. Never-before-seen footage was brought back to life - our family can now enjoy for years to come. Thank you DiJiFi!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T02:27:58.000Z",
          "Titre": "Far exceeded my expectations!",
          "Contenu": "The end product far exceeded my expectations!  The clarity of the images was terrific!  A couple of my large format images were scanned backwards, but easily remedied with editing.  I'll be back with more negatives!  Excellent customer service as well.  Always prompt in responding to email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T21:14:40.000Z",
          "Titre": "Super easy to work with!",
          "Contenu": "Super easy to work with! Very communicative, great product, and fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Sandoval",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T19:00:07.000Z",
          "Titre": "My experience with DiJiFi was Excellent!",
          "Contenu": "My experience with DiJiFi was excellent!  The process was easy and I was kept current every step of the way.  I am very pleased with the result and intend to send additional orders ...as soon as can get organized."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Dotson",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T22:42:12.000Z",
          "Titre": "They digitized my 2-1/4\" slides just as…",
          "Contenu": "They digitized my 2-1/4\" slides just as they said they would, and returned them by mail, while putting the resulting files on a cloud source for me to download. In short, they did what they said they would, on time, and the quality was very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Smith, Puppetworks",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T18:06:44.000Z",
          "Titre": "Terrific service",
          "Contenu": "Very professional.  I wanted a direct transfer from my 15-inch reel-2-reel to CD; it was mixed into 2 monaural tracks instead.  My intention was to be able to edit the 2 tracks separately.However, upon calling, the original direct transfer had been saved and I was sent a link to retrieve it.  Thanks very much for terrific service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T04:15:55.000Z",
          "Titre": "Perfection",
          "Contenu": "I provided a five inch reel to reel from the early sixties. The enhancements, added leader and finished product was exceptional. Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T00:46:45.000Z",
          "Titre": "Return Customer",
          "Contenu": "DiJiFi helped archive my family film reels several years ago.  They did an excellent job, so I came back to have the last bit of film transferred after my father died in July.  The staff was kind and courteous.  They digitized and returned everything very quickly.  My relatives have enjoyed seeing images from the past, images that would disappear if not for this type of invaluable service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresita Silverberg-Urian",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T15:03:05.000Z",
          "Titre": "Very professional, exceeded expectations!",
          "Contenu": "My project was completed in one week, three weeks before promised. The audio recording and sound quality was professionally done and delivered via dropbox as agreed. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T02:20:16.000Z",
          "Titre": "I am so pleased",
          "Contenu": "I am so pleased! I sent them an old Olympus digital voice recorder to remove voice files of my deceased husband and not only did they find that for me, but there was also a voice message birthday wish to me from my deceased brother. The price was better than quoted. Now I can’t wait to send them another project. They said they could take some Betamax video and put it in DVD for me. I’d love that! I’ll be doing that soon(One happy customer here)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel A.",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T14:37:54.000Z",
          "Titre": "Outstanding professionalism and results",
          "Contenu": "Deeply grateful for the services provided by DiJiFi. Had been wanting to digitize old family videos for years, finally took the plunge and could not be happier with the results. They provided a fair, honest quote, kept in clear communication throughout and the quality of the digitized videos are *outstanding*. They even labeled the files according to what was on them, so we knew which family event was on each one. I cannot recommend them enough - thank you Jim and the whole DiJiFi team!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rowan",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T23:40:02.000Z",
          "Titre": "20 Year Old DV Tapes Successfully Transferred",
          "Contenu": "DiJiFi created clips from 20 year old DV tapes that I'd been trying to get encoded because they were of my wedding!! I'd tried many places but Jay and the gang at DiJiFi got the videos off these aging tapes and confirmed conclusively which tapes were blank as well. I surprised my wife with these movies and can finally breath a sigh of relief."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T17:09:58.000Z",
          "Titre": "Well done!",
          "Contenu": "Nowadays, personal customer service is rare.  Apart from a job well done, which this was, I was happy to speak with a human who responded quickly and efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerrie",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T14:33:30.000Z",
          "Titre": "All my childhood and teen memories of…",
          "Contenu": "All my childhood and teen memories of what I took for granted until viewing them all over again. Lost a few family members and these were wonderful precious memories to relive. You guys did a great job. We are having a family viewing party for some of the holiday ones. Thanks again. Ill be back bc I have alot more of those little cassettes of memories to \"dijifi\" Sorry for late review as life happened and more memories were being made."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:25:13.000Z",
          "Titre": "Fostex 4-track Cassettes > WAV files project",
          "Contenu": "They converted 4 Fostex 4-track cassette recordings of mine from the 80s/90s to wav files for upload to Bandcamp and YouTube. Very clear communication, easy to work with, estimated a turnaround time of 4-6 weeks, but actually finished the project in 2 weeks. Quality of work was good. Attentive to detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marguerite",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T16:55:13.000Z",
          "Titre": "DiJiFi did an exceptionally fine job…",
          "Contenu": "DiJiFi did an exceptionally fine job creating an updated digital reel for me. Part of the task required older DVD clips to be edited, digitized and added to a previous reel. Everything I requested was done perfectly and then some. It took a bit over three weeks to complete, which seemed sort of excessive, but proved to be worth the wait. Also, the price was very reasonable. Thank You for your professionalism!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly",
          "Nb_Reviews": 5,
          "Date": "2023-07-21T21:36:18.000Z",
          "Titre": "Almost a decade of DiJiFi",
          "Contenu": "Over 8 years and thousands of photos, slides, and reels of films, DiJiFi has handled my projects with skill and attention to detail. They have always been transparent about pricing. On the very rare occasions when there has been a minor issue with a project, the staff at DiJiFi have worked with me to fix the issue right away. DiJiFi is the only place I turn for preserving the images that mean the most to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Berrian Puma",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T17:18:32.000Z",
          "Titre": "Loved working with DiJifi",
          "Contenu": "Loved working with DiJifi.  They set clear expectations on what I would receive and when my project would be complete.  They delivered against these.  In fact they deliver ahead of schedule.  They were very easy to reach.  Their customer service was fantastic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:54:32.000Z",
          "Titre": "Customer service is great and…",
          "Contenu": "Customer service is great and informative. The turn around was about 4 weeks shorter than originally stated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 5,
          "Date": "2023-11-08T21:38:47.000Z",
          "Titre": "the simple fact that if you have a…",
          "Contenu": "the simple fact that if you have a question about a project you contact me before moving forward..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T23:11:30.000Z",
          "Titre": "The Gold Standard",
          "Contenu": "I'm a documentary TV producer, and I've been using DiJiFi for years to digitize my personal collection of old 8mm and 16mm film footage. The results have always been amazing. The people there are extremely knowledgeable and easy to talk to. My most recent job required digitizing an old VHS cassette that had a stretch of creased tape at the head. Other companies might have begged off. DiJiFi handled the problem smoothly and flawlessly, and the video and audio quality of the digital file they created was astonishingly good.  Their prices are reasonable and their shipping and billing systems are very easy to use. They are a pleasure to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy Egerer",
          "Nb_Reviews": 5,
          "Date": "2023-10-19T19:18:59.000Z",
          "Titre": "DiJiFi's high ratings are well deserved",
          "Contenu": "We selected DiJiFi based on their outstanding reviews, and we're please to say those reviews were absolutely accurate. DiJiFi worked with us to digitize old audio and film recordings from the 1940s - 1960s, and the results are excellent. This is priceless archival footage for our organization and we were leery of shipping it across the country, but DiJiFi took excellent care of the materials and we couldn't be more pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T23:57:53.000Z",
          "Titre": "So blessed to have found DiJiFi",
          "Contenu": "So blessed to have found DiJiFi! They were beyond helpful, in my particular case of my film unraveling in my videocamera, they were able to remove the unraveled tape and digitize as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D & J",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T04:14:42.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "We have used DiJiFi in the past for voice recordings & movie reels from 1950's-60's with great results. Contaced Jim thru email & he repsonded same day with info.  We sent 12 more reels.  Turn around estimate was reasonable since it was holiday time.  However, we inquired about a sooner date and rate.  We received several options. The price was in accordance with how soon we wanted them.  Transferred to thumb drive & delivered as promised.(original reels returned)  Spoke with Luke, Customer Service a few times, answered all questions & concerns, thorough, knowledgeable, easy to communicate with.  We are very pleased with the results.   Having all these movies on a thumb drive & sharing with family is priceless!  Highly recommend DiJiFi"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T02:22:22.000Z",
          "Titre": "Buy Cheap, Pay Twice",
          "Contenu": "I don't know how they manage this but every time I visit Dijifi, the weather is always absolutely perfect. Today was no exception, unseasonably mild for mid-January. Sometimes, after concluding my business here, I'll relax in the little park by the Gowanus Canal. But today I was hungry, so I strolled up Manhattan Avenue for a lunch of avocado toast and coffee at Sweetleaf. I think I'm supposed to say something about their service. It is excellent. Worth every penny. Do not be gulled into thinking you can get work of this caliber for less. When we buy cheap, we invariably pay twice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Grant",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:24:41.000Z",
          "Titre": "I gave you all a five stars",
          "Contenu": "I gave you all a five stars, because of the professional assistance that I received from Mr. Cason and also from J while I visited your office. I was treated with respect and everything was explained very clearly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T00:51:03.000Z",
          "Titre": "A problem with prior discs was…",
          "Contenu": "A problem with prior discs was voluntarily and promptly corrected. They did an outstanding job to make thiscustomer happy and they indeed succeeded. kudos for a job well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T16:50:09.000Z",
          "Titre": "A cherished gift",
          "Contenu": "#1: They did what I wanted done. They did NOT tell me to fit into one of their boxes like their competitor.#2: Their attention to detail. #3: Although there were some \"burps\" in a couple of the songs, the audio was otherwise incredibly good considering it came from 30-40-year old cassette tapes!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Goings",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T18:00:21.000Z",
          "Titre": "My film transfers were beautiful",
          "Contenu": "My film transfers were beautiful. The picture quality was excellent, no ugly frame blending or interlacing, and the color was gorgeous. I also really appreciate that DijiFi offers pickup and delivery service to and from my home. Everyone there was very helpful, answered all my questions and super nice people to work with. Turnaround time was faster than expected too. Definitely planning to use DijiFi for all future film and video transfers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Dao",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T00:31:52.000Z",
          "Titre": "Old Family Photos restored",
          "Contenu": "I sent my family photos, some were 60 years old, to be digitized.DiJiFi off an outstanding job by “cleaning up” all the pictures so that the faces and the decor became all clear. I just sent another set of older photos to go through process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PrimeLight Creative",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T18:57:50.000Z",
          "Titre": "Very responsive/Deliver as Promised",
          "Contenu": "Very responsive with info and procedure. I have tried them twice. Once for video two different formats and one for two chrome formats. Both times great results. On time, kept informed each step, highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "WEBCLIENT",
          "Nb_Reviews": 5,
          "Date": "2023-02-17T23:52:14.000Z",
          "Titre": "One of a kind",
          "Contenu": "I have worked with DiJiFi for more than 10 years (maybe even longer) when I started converting old photos and slides to digital. I'm always so impressed with the results. They are attentive and caring with my precious memories and deliver exactly when they promise. And they are a pleasure to interact with from the phone to in person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Clarke",
          "Nb_Reviews": 6,
          "Date": "2023-08-02T23:46:39.000Z",
          "Titre": "More than scans - art!!",
          "Contenu": "The quality of the scans are pure artistic. Not just your run of the mill scan house. They actually take each individual negative and get the most from the original.Could not have done a better job myself if I had their equipment. Thanks. A++++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abby",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T01:43:14.000Z",
          "Titre": "Super reliable",
          "Contenu": "Super convenient location, great price and they completed the job fast. I'm glad they have a location I can physically go to. I needed an hold home video (VHS) from the 80's converted to digital and was so worried about it being damaged or getting lost in the mail. These guys did a great job and I'm so happy."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:55:10.000Z",
          "Titre": "Excellent  service",
          "Contenu": "Excellent  service, very good  people, very  andestending  they're  doing great  work  very pleasant and  happy  experience I've 😀  thanks 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane",
          "Nb_Reviews": 2,
          "Date": "2023-06-24T20:40:16.000Z",
          "Titre": "Easy but very expensive",
          "Contenu": "Pleasant to work with; easy to set up. $150 for 30 seconds of audio seems a bit excessive, however.UPDATE: I have changed my experience from 2 to 5 stars. They have identified the overcharge and are sending me the appropriate refund.  I would not be hesitant to use them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annie College Archivist",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:21:08.000Z",
          "Titre": "I’ve used Dijifi several times",
          "Contenu": "I’ve used Dijifi several times. They are always professional and friendly and do a great job with the digital transfers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vida",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T23:07:25.000Z",
          "Titre": "Don’t trust anyone else with your irreplaceable family history",
          "Contenu": "When a family member found a box of 8mm tapes containing the only footage in existence of my father and my mom’s father, I knew they were too precious to send to some mail-in company. I reached out to DiJiFi with some questions and between their quick response and reassuring answers, I knew I could trust this family history to them. They were extremely kind and understanding throughout the process - even when one of the tapes contained some very unexpected footage! - and I was blown away by the quality of the files they provided. To top it all off, they ended up finishing the project several weeks early! DiJiFi is the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerJessica Weber",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T02:43:28.000Z",
          "Titre": "Incredible Experience Converting VHS",
          "Contenu": "This is my second time working with DijiFi to digitize old home movies. I found 48 VHS cassettes at my parents home and DijiFi not only picked up everything from my apartment but created a seamless, chronicle digital libary of the videos on a USB drive.  They provide incredible, friendly and efficient service and couldn't recommend them more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T23:00:56.000Z",
          "Titre": "Scans worked well for website.",
          "Contenu": "DiJiFi communicates well and the scans were delivered ahead of the scheduled time. The scans were big enough that I could manipulate each one to get a good image for my website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dianne Richardson",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T00:48:46.000Z",
          "Titre": "Exceptional work.",
          "Contenu": "Exceptional service!!!  Thanks for taking my 50+ year old movies and converting them into MP4 files which I send to my children. You have save wonderful memories for our family.  Excellent communication with the site. Clear explanation of what their services were and they were exactly what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jojosavoy",
          "Nb_Reviews": 5,
          "Date": "2023-10-11T12:19:57.000Z",
          "Titre": "Folks were great.",
          "Contenu": "Folks were helpful about answering all my questions before I ever went in.  Great service.  I'm using them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T08:26:46.000Z",
          "Titre": "The representatives were professional",
          "Contenu": "The representatives were professional, personable and patient. The delivery on services were efficient and precise.The representatives followed through on personal requests.Thank you for the opportunity to to provide feedback."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T17:26:20.000Z",
          "Titre": "Five Stars!",
          "Contenu": "Couldn't be more pleased with the service I received from DiJiFi! They were so nice and helped me preserve over 300 photos and documents from my family's history. Everything looks so high quality, and I can't wait to share this new archive with generations to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neal G.",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T11:53:05.000Z",
          "Titre": "This is my second time using DiJiFi",
          "Contenu": "This is my second time using DiJiFi.  They set my expectations correctly, communicated clearly, and were able to transfer a variety of legacy media to modern files.  I'll absolutely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda B",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T16:52:50.000Z",
          "Titre": "Digitizing old movies",
          "Contenu": "I had some old CDs that contained valuable photo shows I had created for my family as well as a eulogy for my mother. But I had no way to play them given the new technology. DigiFi changed that. They gave me digital files and a BluRay disc that I can now play anywhere. Thank you for the excellent work and for giving back these memories."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T23:34:31.000Z",
          "Titre": "I needed vhs restored and digitized",
          "Contenu": "I needed vhs restored and digitized.  Customer service was excellent!  They restored the tape!  I was so impressed with their service!  If you are in the NY/NJ area…They have a pick up and delivery service!!!!!!  I wish I can give them more than a 5 star review!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce J. Averbook, MD, FACS",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T01:42:23.000Z",
          "Titre": "Great explanation of services and superb product outcome",
          "Contenu": "Great explanation of services and DiJiFi went out of their way to make the transfer and recording the best it could be. They responded to my needs and did superb work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T16:20:06.000Z",
          "Titre": "Thank you so much for redigitizing my…",
          "Contenu": "Thank you so much for redigitizing my old Beta tape. An earlier digital copy messed up the color, but your version is perfect. Wonderful job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "randall Nelson",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T02:28:58.000Z",
          "Titre": "All good here",
          "Contenu": "Everything was as promised on an old cassette tape that had been sitting around since 1983. Expensive but worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T13:51:32.000Z",
          "Titre": "Prompt and professional service",
          "Contenu": "Prompt and professional service. DiJiFi handled my 20-25 year video to digital old tape formats professionally and efficiently. Not a memory was lost. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daryl H.",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T13:51:12.000Z",
          "Titre": "Top Shelf Communication",
          "Contenu": "From my inquiry to the final product, communication was top shelf.  When I did receive the recovered audio it needed a tweak.  DJF had the tweak back to me in day and brought Mom's voice back perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael M.",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T17:30:50.000Z",
          "Titre": "Excellent Video Transfers",
          "Contenu": "Easy process, friendly and accessible staff, and excellent quality transfers from old Hi-8 and MiniDV tapes.  This order was my fourth batch of tapes to be transferred by Dijifi."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T00:42:07.000Z",
          "Titre": "Highly recommend",
          "Contenu": "I had both cassette tapes and old photographs digitized at DiJiFi. They did a terrific job and I would highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Wayne",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T16:15:29.000Z",
          "Titre": "DiJiFi gets the job done!",
          "Contenu": "DiJiFi provided great customer service, a reasonable price for their work, and theycompleted the work in the time they promised.  It was a wonderful experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dani",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T20:09:48.000Z",
          "Titre": "I had a DVD that froze when played",
          "Contenu": "I had a DVD that froze when played. It was old and DiJiFi did everything they could to fix it. It was too corrupted. I will recommend them because of their professional and conscientious work ethic."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Donnelly",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T20:20:13.000Z",
          "Titre": "Everyone appreciates honesty",
          "Contenu": "You reassessed the effort that was required for the job, once you received the negatives and adjusted the balance to reflect the  level of effort. Honesty is much appreciated in these times. Thank You."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen88",
          "Nb_Reviews": 12,
          "Date": "2023-11-03T19:48:51.000Z",
          "Titre": "Very good scans at a resonable price",
          "Contenu": "Very good scans at a resonable price. Wush it was a bit faster but the wait times just means you are successful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T00:20:18.000Z",
          "Titre": "Amazing service",
          "Contenu": "Great service and courteous employees! My project was done ahead of the quoted time and everything turned out great. I will be returning in the future for additional services. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted Cowan",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T21:29:45.000Z",
          "Titre": "Fast response to initial inquiry",
          "Contenu": "Fast response to initial inquiry, clear expectations were set, and quick completion of the project. They made it easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 16,
          "Date": "2023-12-05T14:51:20.000Z",
          "Titre": "Always gives great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T20:24:36.000Z",
          "Titre": "Great service",
          "Contenu": "This is my second time using this company and I think they do a very good job digitizing old videos and audio"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Cloutier",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T16:53:45.000Z",
          "Titre": "DiJiFi does excellent work in audio and…",
          "Contenu": "DiJiFi does excellent work in audio and visual tranfers and has excellent customer service. Very friendly and smart people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura Splan",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T01:38:33.000Z",
          "Titre": "great service. great people.",
          "Contenu": "such a great experience digitizing my vhs, 8mm, umatic, and beta sp tapes here. will def come back with more. patient staff answered all my questions. 💗"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChrisB",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T00:22:20.000Z",
          "Titre": "Good communication",
          "Contenu": "Good communication, followed my directions and finished the project well and on time. If I have to nit pick you guys went a little heavy on noise reduction on my cassettes but that’s ok. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T03:39:39.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service!  Helpful and present on the phone. Nice office space and personable people manning the operation.  I’ve used this place a few times and it’s always been 4 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JKC",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T19:20:01.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service.  Prompt response to inquiries, even after business hours.  Excellent results for digital conversion of 70 year old film and a  photo that was almost invisible due to sun exposure.  Everything was completed as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T16:24:51.000Z",
          "Titre": "Five Star Service",
          "Contenu": "Kind, professional, and very helpful service. Answered all questions we had and completed the project exactly as hoped for. Could not recommend more!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sil",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T19:20:28.000Z",
          "Titre": "Simple process",
          "Contenu": "They walked me through every step of the process and were readily available whenever I had any questions.  The delivery of my items was seamless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabrielle Di Bianco",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:02:47.000Z",
          "Titre": "Dijifi always delivers",
          "Contenu": "Dijifi always delivers. Everyone is so nice and professional. Transfers turn out great. Fun to go to Brooklyn to drop everything off."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Gulhaugen",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T16:32:56.000Z",
          "Titre": "Transferred old r2r tapes",
          "Contenu": "Transferred a bunch of old r2r tapes to digital. Gave good advice about exactly what I did and didn't need, so I feel I got good value. Final product is excellent."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jack Wilson",
          "Nb_Reviews": 3,
          "Date": "2023-02-26T20:51:05.000Z",
          "Titre": "Professional",
          "Contenu": "ProfessionalProfessional, quality and timely work. Highly recommend them. I come from NJ , major drive but will not settle for any other business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DK",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T16:46:22.000Z",
          "Titre": "Very friendly staff",
          "Contenu": "Very friendly staff, fair prices. Turnaround time was about 4 weeks for 24 priceless old family video tapes. All look and sound beautiful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Constance",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T21:26:30.000Z",
          "Titre": "They took such care with the old VHS…",
          "Contenu": "They took such care with the old VHS tapes and made terrific MP4 versions. Downloading was a breeze. Absolutely will use them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Sandoval",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T01:33:14.000Z",
          "Titre": "Memories Saved For the Ages",
          "Contenu": "We are very happy with both of the \"projects\" that we sent to DiJiFi!   Photos and many DHS videos have been saved for the ages."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K.Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T16:18:14.000Z",
          "Titre": "Old Sony 1978 videotapes brought back from the dead",
          "Contenu": "I had tried to have 4 of my 1978 old videotapes transferred by several other companies, who all disappointed me and were not able to accomplish it.  However, your company was able to do it and remarkably well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T22:37:01.000Z",
          "Titre": "Great job",
          "Contenu": "Great job, as always. Quick and professional audio tape repair. Great customer service. Will definitely be back again for next project"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lydia Theys",
          "Nb_Reviews": 6,
          "Date": "2023-01-03T23:12:31.000Z",
          "Titre": "Outstanding!",
          "Contenu": "This company was just great. Talk about above and beyond! I sent them a precious audio tape from 1971. Or I thought I did and that's where the trouble started. Jim had been in touch with me from my first contact, and when the tape did not arrive, he leaped into detective mode. He didn't give up, finally discovering that I had interchanged two digits and sent it to the wrong address. He visited that building multiple times trying to track the tape down but he had no luck. We both finally gave up. That was in March '22. In December, someone called me and told me the package had been left outside her door and she brought it inside. I told Jim and he called her and arranged to pick up the tape. He did that, and within a matter of days, an excellent digital version of my precious tape arrived. DiJiFi was far more patient than they needed to be since the whole mess was my fault. All that and a great job, too! I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Elberfeld",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T23:08:19.000Z",
          "Titre": "The did what they said they would do.",
          "Contenu": "The did what they said they would do. They charged the amount we agreed to. They completed the job in a reasonable amount of time. They returned everything safely to me. (The job dealt with 60 year old reel-to-reel tapes of my grandfather talking about his life.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Read",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T21:36:04.000Z",
          "Titre": "The best",
          "Contenu": "The best! Reliable, beautiful work, pleasant staff and friendly service!!! Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T15:43:36.000Z",
          "Titre": "Quality and Customer Care",
          "Contenu": "I spent a lot of time sourcing the best place to digitize my old films. DiJiFi provided the highest quality at the best price. The customer service and care was top notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Clarke",
          "Nb_Reviews": 6,
          "Date": "2023-05-24T21:58:14.000Z",
          "Titre": "Great customer service and quality workmanship!",
          "Contenu": "Great customer service and communication. Work was perfect with NOT one dust speck on any scans. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Rich T",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:11:39.000Z",
          "Titre": "Friendly staff",
          "Contenu": "Friendly staff. Work was nicely done. Prices seem reasonable. What are could you want. ?Go for it-Rich T"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Grubb",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T16:53:13.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, great value, great quality.  Thank you.  You guys go the extra mile to satisfy your customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-01T00:13:15.000Z",
          "Titre": "Great service and good results",
          "Contenu": "Great service and good results. The 35 mm slides I brought in for scanning were delivered to me in great definition and in an easy manner to download."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T01:09:12.000Z",
          "Titre": "Fantastic",
          "Contenu": "Jim and the gang at dijifilm made the process so easy. And all my old videos turned out beautifully. I can’t wait to dig up more old film and photos for them to digitize for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T23:38:36.000Z",
          "Titre": "Excellent work delivered with professionalism and kindness",
          "Contenu": "Dijifi took several hundred family photos of different sizes and vintages (from the 1930s to the present day) and transformed them into a meaningful slideshow. They were professional, kind and understood that the project was of enormous sentimental value to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Cashman",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T00:11:18.000Z",
          "Titre": "Deliver what they Promise",
          "Contenu": "Friendly professional service that is upfront about what they can and can’t do. Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T20:39:38.000Z",
          "Titre": "I've worked with Dijifi for many years",
          "Contenu": "I've worked with Dijifi for many years.  They always exceed my expectations.  Also they are a pleasure to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T20:08:30.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product, great customer service, very good price point! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T18:16:41.000Z",
          "Titre": "Highly recommend.",
          "Contenu": "Lovely bunch of people, converted my recordings from the 1970s! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T00:26:35.000Z",
          "Titre": "They did what they said they would do…",
          "Contenu": "They did what they said they would do and the product was what I needed.  There was a problem with the address they used to return the product. They worked with me until we got it right."
        }
      ]
    }
  ]
}