{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "direct-brand.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric P",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:50:26.000Z",
          "Titre": "Did not keep shipping promise.",
          "Contenu": "I placed my order on November 24th around 12:30pm EST and paid for 2-day shipping. It says in the email that all orders placed before 2pm EST will ship same day. My order did not ship until November 27th and arrived November 29th. I emailed and asked if I could receive a refund on the shipping cost since I paid for 2-day shipping and ordered early enough for it to be shipped same day, but it was not, and I have not received any communication back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T22:44:08.000Z",
          "Titre": "Totally crummy experience!",
          "Contenu": "It was impossible to contact anyone by phone... none of the options either picked up or returned my messages. Therefore my husband was unable to determine if the fan we ordered would fit the way he thought it would. We purchased it based on the limited information on the website. AFTER we returned it, I received an email letting me know that that fan would not work in an Enviro stove.  Iwas told I could return it, but I would be out the cost of shipping. I was given no return instructions or return label, so I simply sent it to the return address on the box.  As of yet I  have not heard that you've received it.  That was a crummy experience costing me time, frustration, and forty dollars!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Spencer Williams",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T20:00:57.000Z",
          "Titre": "Payed for 2 day shipping and no product",
          "Contenu": "Payed for 2 day shipping for furnace parts that I desperately need and I still have not received it. Probably won't order anything from you again and will avoid fedex at all cost. They have been here several times in the past so I'm not sure if it's your business or fedex but someone royally screwed me over!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Jerabek",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T13:37:37.000Z",
          "Titre": "Item purchased was faulty and wired…",
          "Contenu": "Item purchased was faulty and wired backwards.  When installed is ruined my appliance and they are not doing anything about it.  BEWARE BEWARE DO NOT BUY ANYTHING FROM THIS COMPANY!!!!!!!!!!!!!!!!!!!!Installed by plumber and water heater was damaged beyond repair. Plumber did the electrical check after damage was done to determine that the smart valve was no longer functional. SO who is going to pay for the damages because of the faulty wiring on the part?!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnny Erwin",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T03:06:42.000Z",
          "Titre": "I paid extra for my package to get here…",
          "Contenu": "I paid extra for my package to get here fed air  I gave  instructions for the package to be placed in the black box on the front porch. proof of delivery picture showed the package on the ground with a dog by the package.  This was unacceptable"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "steven",
          "Nb_Reviews": 2,
          "Date": "2023-01-08T05:18:17.000Z",
          "Titre": "You guys sent me the wrong motor",
          "Contenu": "You guys sent me the wrong motor 1.the mounting bolts are not the same . 2 the motor spins the wrong direction when correctly wired.  3 even the label on the motor does not say 32330 like your website advertised it does"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Hall",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T23:59:28.000Z",
          "Titre": "The product we purchased is not what…",
          "Contenu": "The product we purchased is not what they claim it to be. It doesn’t match the discrimination as to what it will fit. Also we can not get an authorization to return it nor can we get anyone to respond to our phone calls and emails."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Agustin Montejano",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T20:32:15.000Z",
          "Titre": "Charg for a next day delivery and…",
          "Contenu": "Charg for a next day delivery and arrive  seven days after. Request for refund no answer."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T20:41:49.000Z",
          "Titre": "Ordered a part that I verified with the…",
          "Contenu": "Ordered a part that I verified with the company they had in stock.  One hour later the order is cancelled by the company advising the item is not expected to arrive at their facility for another 7 weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael j banks",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T17:56:25.000Z",
          "Titre": "Junk....both of the purchased igniters…",
          "Contenu": "Junk....both of the purchased igniters failed after the first light.  Would not purchased these again.  As per the sellers description, these igniters were installed in a Napolean NPS45 pullet stove."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 1,
          "Date": "2020-01-23T18:25:16.000Z",
          "Titre": "The part we ordered is defective and…",
          "Contenu": "The part we ordered is defective and must be returnedWe are unable to contact customer service at 1-833-829-4121, the number listed on our receipt. No answer, no voicemail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Lewis",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T12:53:03.000Z",
          "Titre": "Customer support",
          "Contenu": "The part I ordered did not work for me and I am trying to return it. When I called customer support I was sent to a que and left a message. I am still waiting 5 days later so I called again and was again sent to the que. Now I am not sure how I can return this part and get a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Lucio",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T03:57:54.000Z",
          "Titre": "All because they didn't send me a label…",
          "Contenu": "All because they didn't send me a label to return the burner cause the 1 they sent wasn't the right 1"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dunkly DeCew",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T21:57:04.000Z",
          "Titre": "Youi are asking for a review when I…",
          "Contenu": "Youi are asking for a review when I haven't recieived it yet!  It has been a week since you said it was shipped.  Come on!  I have a furnace that is not working..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darlene",
          "Nb_Reviews": 2,
          "Date": "2020-04-20T16:32:30.000Z",
          "Titre": "The day I received the part and I…",
          "Contenu": "The day I received the part and I realized it didn't fit. I called to see about returning it and still haven't received a call back. It's been 3 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAVID CLARE",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T16:56:09.000Z",
          "Titre": "only received 1 of 2 motors i ordered…",
          "Contenu": "only received 1 of 2 motors i ordered no one is returning my calls"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T01:16:56.000Z",
          "Titre": "You sent the wrong part or had the…",
          "Contenu": "You sent the wrong part or had the wrong picture on your website,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Myesha Taylor",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T17:30:52.000Z",
          "Titre": "I STILL HAVE NOT RECEIVED THE ITEM",
          "Contenu": "I STILL HAVE NOT RECEIVED THE ITEM, I E-MAILED THE COMPANY AND HAVE NOT RECEIVED A RESPONSE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clark Luck",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T16:29:23.000Z",
          "Titre": "The part I got was broken",
          "Contenu": "The part I got was broken!  I had to go to a local place and pick one up, that was more expensive.  Had to have it for Easter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Watercolor Stan",
          "Nb_Reviews": 2,
          "Date": "2020-09-08T13:33:49.000Z",
          "Titre": "This company took my money ...never…",
          "Contenu": "This company took my money ...never sent the item and will not return my calls"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ralph Ellis",
          "Nb_Reviews": 1,
          "Date": "2019-12-26T05:31:17.000Z",
          "Titre": "Never received product-will never order…",
          "Contenu": "Never received product-will never order from them again-canceled cc transaction"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine Slocum",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T16:13:52.000Z",
          "Titre": "The igniter is not a Laars  OEM and…",
          "Contenu": "The igniter is not a Laars  OEM and can't be used."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan Flores",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T04:56:02.000Z",
          "Titre": "Shipping took forever!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark John",
          "Nb_Reviews": 2,
          "Date": "2021-08-27T22:30:32.000Z",
          "Titre": "It’s pricey should drop it to 100…",
          "Contenu": "It’s pricey should drop it to 100 dollar’s"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Reza",
          "Nb_Reviews": 4,
          "Date": "2019-09-27T17:42:30.000Z",
          "Titre": "Not happy",
          "Contenu": "Not happy. I placed the order on September 13th. Part shipped 7 days later on September 20th. I have the tracking number but no delivery still."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Gioia",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T13:50:45.000Z",
          "Titre": "I received the wrong part!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BARAK SCHMIDT",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T01:07:23.000Z",
          "Titre": "They sent me the wrong part and will…",
          "Contenu": "They sent me the wrong part and will not let me return it. So I just lost $62.00."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesse Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T20:59:36.000Z",
          "Titre": "This wasn’t a direct replacement",
          "Contenu": "This wasn’t a direct replacement. I had to purchase new piping from the valve to the burner assembly because the outlet was threaded for fit pipe instead of the pilot tube fitting. There were no options for mounting the valve. That being said. It does work after a few hours of installation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2021-02-05T16:50:56.000Z",
          "Titre": "After purchasing a part for my elderly…",
          "Contenu": "After purchasing a part for my elderly father's home heating unit, we were shocked to see that a part that is a bit fragile was put into a soft baggie to be shipped.  It was not in a well protected box.  We had a terrible snow storm and this part was shoved in my mailbox along with the other mail.  Had it been sealed in a box and properly insulated/packaged it wouldn't have been showed around.  Very disappointed in the packaging.  I guess we will see if it works once installed."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sonu Bains",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T02:23:12.000Z",
          "Titre": "In stock but not really",
          "Contenu": "You accepted  my purchase  only to refund me two days later due to no stock. This is terrible due to the fact I must spend time to search again, delay a part that my customers rely on, and also keep an eye on my credit bill to be sure  the refund was made."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Hughes",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T19:47:21.000Z",
          "Titre": "They leave it totally up to you to…",
          "Contenu": "They leave it totally up to you to order the right part so if you happen to not get the right part it's your fault"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Marassa",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T17:35:53.000Z",
          "Titre": "Shipping is terrible you send me a…",
          "Contenu": "Shipping is terrible you send me a questionnaire and I did not receive the product yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tarun Desai",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T18:59:02.000Z",
          "Titre": "Item shipped to wrong address",
          "Contenu": "Item was shipped to wrong address and it was not an OEM(Samsung Brand) item as listed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy Ewing",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T22:37:13.000Z",
          "Titre": "Good price but the fan won't get out of…",
          "Contenu": "Good price but the fan won't get out of low speed.  If we weren't getting a blizzard this week I would send it back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trey",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T14:49:03.000Z",
          "Titre": "It's all bent up",
          "Contenu": "It's all bent up. Hopefully when I go to install it,it works"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B McN",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:22:04.000Z",
          "Titre": "Correct part number, but wrong mounting flange.",
          "Contenu": "I ordered the exact part number that is listed in the Lopi Deerfield manual which apparently is the same as the Lopi AGP; however, the mounting brackets are apparently different and so I had to use an angle grinder to cut it to fit.   Since I wasn’t home I couldn’t verify that the part looked different when I ordered.   Besides that, part works as it should and my pellet stove is back up and running.  Easy fix if you have the correct tools, but I shouldn’t have had to do that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carrie Carpenter",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T01:50:19.000Z",
          "Titre": "Customer service lacking.",
          "Contenu": "I have been trying to reach direct brand for weeks. Every time I try to send an email, it comes back as undeliverable. The customer service is lacking hugely.Update. I did receive a return label, returned the item. And received a refund. BUT, the email address they give you is still not valid. Thankfully I DID receive my refund. But I was never able to actually speak to someone in customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Macon Wilson",
          "Nb_Reviews": 2,
          "Date": "2020-05-11T16:23:13.000Z",
          "Titre": "I guess it is more my fault for not…",
          "Contenu": "I guess it is more my fault for not looking closer before ordering. Doesnt work for my grill at all. Not for pit boss memphis ultimate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Belinda Strickland",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T07:13:16.000Z",
          "Titre": "Item came when expected unfortunately…",
          "Contenu": "Item came when expected unfortunately the items that go with it have not arrived yet so I cannot rate how well the item functions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leo Hudon",
          "Nb_Reviews": 1,
          "Date": "2019-08-28T17:19:36.000Z",
          "Titre": "Order was processed and shipped in a…",
          "Contenu": "Order was processed and shipped in a timely manner from Grafton, MA. My disappointment comes from being charged foreign transaction fees on my credit card as the charge was \"processed\" in the UK. I could not find any warning of this on the website. Not a good business practice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Colin Knudtson",
          "Nb_Reviews": 1,
          "Date": "2019-08-28T17:32:27.000Z",
          "Titre": "No complaints on the website or the…",
          "Contenu": "No complaints on the website or the ordering process.  The stove knobs on the other hand aren’t worth the word “junk”.  I would rather spend twice as much and get a quality product.  These are going right into the garbage!Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry David",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T22:25:31.000Z",
          "Titre": "Fan runs good but has vibration and…",
          "Contenu": "Fan runs good but has vibration and loud on speeds 3,4,5"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tuesday gelo",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:36:22.000Z",
          "Titre": "the part fit ok would of liked a email…",
          "Contenu": "the part fit ok would of liked a email when it would be delivered not knowing seems like it took alittle bit to come but over all happy with the part"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yadira Wells",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T17:54:57.000Z",
          "Titre": "Absolutely love the tall baseboard heat…",
          "Contenu": "Absolutely love the tall baseboard heat covers, just wish they had the cover for the connecting boards and the corner cover.  Went back to order more and they have the corner cover but it says it’s a left end cover, called and left msg regarding that as I need two corner covers for now but so far no one has called me back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Beres",
          "Nb_Reviews": 2,
          "Date": "2020-08-14T12:31:00.000Z",
          "Titre": "Igniter",
          "Contenu": "The igniter was received in excellent condition at a good price. The new part corrected the problem. I was a little disappointed in the delivery time it took a week but with the pandemic I guess that can be expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ji-Ye Yang",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T14:24:59.000Z",
          "Titre": "Customer service",
          "Contenu": "Extremely poor customer service. No response from email, no response from calls. I emailed twice with no response.Edit: i was reached out after this review. I appreciate the response to my concern."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nenad",
          "Nb_Reviews": 2,
          "Date": "2019-12-10T01:54:11.000Z",
          "Titre": "Great prices, customer service OK.",
          "Contenu": "i like the price, i like the customer service.What I didn't like is that I didn't get confirmation email for about two-three days as the part I ordered was backordered. However, a quick phone call and everything is OK"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Ramlow",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T20:53:24.000Z",
          "Titre": "Decent service",
          "Contenu": "Decent service. Only had one of the item I ordered. Called and refunded  Quickly for unfulfilled part of order. Basically what you want in service. No surprises"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2020-04-08T20:16:49.000Z",
          "Titre": "Oven rack came as described",
          "Contenu": "Oven rack came as described, reasonably quickly.  Feels a tiny bit flimsy, but I am happy with the item considering the price paid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D kozik",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T14:44:06.000Z",
          "Titre": "Part now arrived",
          "Contenu": "I have updated my review as at the time I was asked to review, the part did not arrive.   It is working finePrevious: Part never arrived"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Geisler",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T04:27:17.000Z",
          "Titre": "I am looking for a pellet stove blower…",
          "Contenu": "I am looking for a pellet stove blower motor exhast for the model 6041 but cant seem to get it to find it thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin l Jedlicka",
          "Nb_Reviews": 3,
          "Date": "2021-04-08T12:02:51.000Z",
          "Titre": "Paid for expedited shipping",
          "Contenu": "Paid for expedited shipping, but still did not receive it on time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Wells",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T02:45:22.000Z",
          "Titre": "I purchase the igniter",
          "Contenu": "I purchase the igniter, it arrived on time and it works, that's all I can say"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terrance Berg",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T00:48:31.000Z",
          "Titre": "Easy to install.",
          "Contenu": "Received within a week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Irish",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T02:02:05.000Z",
          "Titre": "Pretty quick",
          "Contenu": "As described. Arrived before eta"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paul Adair",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T17:50:02.000Z",
          "Titre": "Very good communication,Delivery was…",
          "Contenu": "Very good communication,Delivery was Slow,Received on Nov 13th"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lakesha Deming",
          "Nb_Reviews": 1,
          "Date": "2020-04-07T20:01:05.000Z",
          "Titre": "Product came quickly",
          "Contenu": "Product came quickly, it wasn't the length but we made it work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guest Steven M",
          "Nb_Reviews": 2,
          "Date": "2019-12-06T17:05:49.000Z",
          "Titre": "I was mostly satisfied with the…",
          "Contenu": "I was mostly satisfied with the transaction.  It was fast and complete. Only minor problem was the wheels were put on the rack with such force it bent the prongs supporting them.  It took time, effort and purchase of some flex seal to finish repair satisfactorily."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "JImmy",
          "Nb_Reviews": 1,
          "Date": "2020-10-18T22:48:02.000Z",
          "Titre": "Too many emails",
          "Contenu": "I didnt want to rate your products"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT STRAYER",
          "Nb_Reviews": 1,
          "Date": "2019-11-08T02:18:17.000Z",
          "Titre": "good response",
          "Contenu": "good response.  i only wish it would have been sent a day earlier so that an 86 year-old woman would not have to continue freezing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Burns",
          "Nb_Reviews": 2,
          "Date": "2019-09-04T16:05:05.000Z",
          "Titre": "Part fit and worked fine",
          "Contenu": "Part fit and worked fine. Very slow shipping. Took almost 2 weeks for part to arrive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BVVFarm PA",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:39:56.000Z",
          "Titre": "Found exactly what I was looking for…",
          "Contenu": "Found exactly what I was looking for easy. Arrive when it was to be delivered.  This was very important cause this part goes a grain drier operation where down time has to be minimized."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ  Turner",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T13:17:29.000Z",
          "Titre": "great service",
          "Contenu": "fast delivery. fair prices always a winner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cornelio Suriel",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T00:40:30.000Z",
          "Titre": "Good product and quick service",
          "Contenu": "Quick service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Pfeiffer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T18:37:44.000Z",
          "Titre": "Received part on time",
          "Contenu": "Received part on time, part was much less than competitors. FED EX delivered next door though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAMES JACQUES",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T14:49:23.000Z",
          "Titre": "Great parts better customer service",
          "Contenu": "I needed the part overnight, but FedEx failed to accomplish this goal. I called direct brand and they were quick to resolve my problems by refunding my shipping costs. When the part arrived it was much more robust than the original part I pulled out and my water heater fired right up. Shop with these guys with confidence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph D'Andrea",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T15:18:25.000Z",
          "Titre": "I had a technical issue and the owner…",
          "Contenu": "I had a technical issue and the owner Matthew returned my call and found an immediate solution!  Amazing old fashioned and honest service without any headache. Matthew and his team shipped my order immediately and I am very pleased to use this business and recommend to others. Joseph Outer Cape Home WatchProvincetown MA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Oates",
          "Nb_Reviews": 3,
          "Date": "2022-06-02T21:58:42.000Z",
          "Titre": "I want to thank you for your quick…",
          "Contenu": "I want to thank you for your quick response and shipping. Received my Booster pressure pump in 2days. Awesome service. Other suppliers required several weeks delivery even if it was in stock.I highly recommend your company, product and service.Thanks again so much for your quick response.Larry"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Alexander",
          "Nb_Reviews": 2,
          "Date": "2020-06-14T01:07:19.000Z",
          "Titre": "Best price on a replacement igniter …",
          "Contenu": "Best price on a replacement water heater flame sensor/igniter combo. Shipping was a little high and slow through USPS but it arrived in excellent condition and was still less expensive than the previous one I purchased from Home Depot. Lasted about 1-1/2 years before I needed to clean off the oxidation. Hoping it lasts a while longer before using this replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SHELTON OBERRY",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T15:13:17.000Z",
          "Titre": "After looking back through my Emails",
          "Contenu": "After looking back through my Emails, I did see the you sent me a tracking number.  Even though the part is not at the front door as where it says it was delivered, that is not your company’s fault. I will file a claim with UPS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "brian whicker",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T12:19:34.000Z",
          "Titre": "Affordable quality parts;friendly and helpful staff",
          "Contenu": "We've owned the same pellet stove since 2007,so when parts started wearing out,I was surprised at the price of replacements locally and online.When the distribution motor went,I was lucky to find Direct Brand had what I needed at a price much lower than other places.I was pleasantly surprised at the quality of said unit.Very pleasant folks to work with to boot.Now I can keep the house warm without breaking the bank or settling for lower quality parts as I have done in the past...'shopping here for all my pellet stove parts from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Peiffer",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T02:34:34.000Z",
          "Titre": "The ignited/flame sensor was exactly as…",
          "Contenu": "The ignited/flame sensor was exactly as promised.  It fit perfect installed easily.  The price was about 60 percent of what other companies were asking.  Shipping was reasonable and it arrived very quickly. I will purchase from DB again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pharaoh Johnson",
          "Nb_Reviews": 2,
          "Date": "2022-03-16T17:05:57.000Z",
          "Titre": "I fixed my pressure smoker with the 250 watt igniter.",
          "Contenu": "I ordered a 250 watt igniter to fix my Gourmia electric pressure smoker. I received it in a timely manner. 📦 I popped it into the smoker and put it back together and smoked a rack of ribs and two pork tenderloins. 🥩🍖I took one bite and my mouth was filled with that instant smoky flavor that everyone craves. 😆🤪 It works as advertised. I should order another one and keep it as a backup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rusty",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T19:52:32.000Z",
          "Titre": "Right on service",
          "Contenu": "Service was fast and easy. The part was slightly ill fitting though it was an exact model match number match.  Did some minor widening mod of the opening for part to fit through…easy for me but not so for folks without proper tools This is the manufacturer fault though."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andres Rosas",
          "Nb_Reviews": 1,
          "Date": "2020-08-15T21:42:34.000Z",
          "Titre": "Shipping Problems",
          "Contenu": "The form to order was made easy and fast.  unfortunately I paid an extra $ 14.88 for my order to arrive in 2 days.  this did not happen.  My order was from August 4 and I received my order until August 11.  I understand that these are difficult times due to the pandemic.  But they should not offer the 2-day express service if you are having shipping problems.Thanks to customer service for sending a refund for the extra shipping charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T13:05:10.000Z",
          "Titre": "Direct brand had the part I needed at a…",
          "Contenu": "Direct brand had the part I needed at a great price. I did have to purchase the part locally because I needed it right away and shipping took a longer than anticipated, so I will keep this for a spare."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Bennett",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T08:17:15.000Z",
          "Titre": "Satisfied",
          "Contenu": "I received the part in a timely manner, unfortunately it was not the part we needed and the one I do was out of stock. Just hoping to get one before winter. A year without hot water is disheartening but I'm keeping the faith with direct brand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance Riley",
          "Nb_Reviews": 1,
          "Date": "2021-07-04T05:07:13.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Got the oem number off my failed blower and they had the exact replacement at about half the price of some other places.  Needed it asap so went with the next day option and it arrived just as planned.  Installed and running again made easy with the right part"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "brett",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T21:20:24.000Z",
          "Titre": "I was expecting to pay an arm and leg…",
          "Contenu": "I was expecting to pay an arm and leg for OEM parts but was pleasantly surprised to find them here for less and delivered fast. I was able to get my customers stove up and running for far less than replacing the stove."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Stringer",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T05:48:40.000Z",
          "Titre": "Direct Brand takes care of any problems",
          "Contenu": "I like most folks are on a very tight budget. Direct Brand's products and prices grabbed my attention. I ordered 2 room blowers and an exhaust blower that matched up perfectly to my 3 King pellet stoves. They sent to me an incorrect room blower from what I ordered. I called the phone number given and left many messages but nobody ever called me back. I got through to them by the e-mail I found on the BBB website, they then promptly e-mailed me back. They then sent me the correct part and covered all charges for sending back the incorrect part. Some may say not to give 5 stars due to this however working in retail most my life I know accidents do happen and they fixed the problem and even refunded the UPS charges back to me of which I paid for the initial order. So folks please lighten up, I know I will be ordering from them again and know that if a situation arises they will take care of the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Charles",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T18:56:12.000Z",
          "Titre": "My experience was great because the…",
          "Contenu": "My experience was great because the prices are good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Madlem",
          "Nb_Reviews": 1,
          "Date": "2020-08-14T16:17:06.000Z",
          "Titre": "Very pleased w/ Direct Brand",
          "Contenu": "Very pleased w/ Direct Brand.  Pricing was much cheaper than other suppliers. Shipping was very quick.I plan on placing another order this weekend.Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Fawcett",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T17:50:03.000Z",
          "Titre": "Great follow-up customer service",
          "Contenu": "Great follow-up customer service! Unfortunately the unit we purchased didn't work with our electronics, and the rep was very quick in replying to our concerns, trying to help, and ultimately taking care of the return in a courteous and prompt way. Our electronic device was old so maybe that was the problem, and I appreciate her taking care of us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JLB",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T20:58:28.000Z",
          "Titre": "The product was delivered on time as…",
          "Contenu": "The product was delivered on time as estimated and it was a direct fit to the water heater."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Davis",
          "Nb_Reviews": 3,
          "Date": "2021-02-05T20:10:02.000Z",
          "Titre": "I bought a Sylvania tv remote and it…",
          "Contenu": "I bought a Sylvania tv remote and it would not program. Name Brand Direct was  1) very responsive and got back with me quickly  2)  refunded my money  3)  made it easy. VERY  IMPRESSED  AND  HAPPY!  Thank you namebranddirect.  Pat Davis, Seattle WA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Dog",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T20:40:09.000Z",
          "Titre": "Searched for obsolete ignitor part#...",
          "Contenu": "Searched for obsolete ignitor part# and replacement part came up in search. Cheapest price and fast shipping. Good communication too! Works like a champ!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Lee",
          "Nb_Reviews": 1,
          "Date": "2020-01-30T21:31:39.000Z",
          "Titre": "Part fo an old Wolf",
          "Contenu": "found seals for my ancient Wolf stove....easy/peasy.Got new oven door seals sorted and calibrated the oven temperature....so maybe some chocolate chip cookies (not burned!!) will be coming my way from my bride...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denny Hampton",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T22:45:13.000Z",
          "Titre": "Working great",
          "Contenu": "My furnace motor went out and on a Holiday weekend. If that's not bad enough it also runs my AC unit. Ordered a new motor from Direct Brand and it was here overnight, after the weekend and Holiday was over. I had it up and running in about 45 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T04:35:01.000Z",
          "Titre": "My order came much faster than I had…",
          "Contenu": "My order came much faster than I had expected and was packed with care. If something else breaks I will definitely order through here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brock Morgan",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T17:27:43.000Z",
          "Titre": "I have had lots of problems with…",
          "Contenu": "I have had lots of problems with ignitors on my timber wolf pellet stove.  This one has worked great for 2 months now. Compared to other cheap ignitors, 2 months is a good record!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark John",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T15:06:57.000Z",
          "Titre": "Order",
          "Contenu": "I never received my item and I spent 250Edit: never mind my order was shipped today but I did wait for a week and I believe I wasn’t notified on why it was getting delayed but now I know"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Carbone",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T00:54:51.000Z",
          "Titre": "Best prices for Enviro Pellet Stove…",
          "Contenu": "Best prices for Enviro Pellet Stove parts. Fast shipping, well packaged, i will be doing business with Direct Brand again, thank you…."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 5,
          "Date": "2023-05-31T17:53:55.000Z",
          "Titre": "Great price & quality!",
          "Contenu": "Needed replacement pilot assemblies for my Southbend Oven.   Price, shipping speed and quality of parts were great.   Would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April Marquez",
          "Nb_Reviews": 1,
          "Date": "2021-03-13T22:39:14.000Z",
          "Titre": "We have an Osburn pellett stove and…",
          "Contenu": "We have an Osburn pellett stove and this igniter was different then original but we made it work. It is working perfectly no complaints!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim  M.",
          "Nb_Reviews": 1,
          "Date": "2020-06-09T17:02:16.000Z",
          "Titre": "40 year old 20” Brown stove oven control worked like A charm",
          "Contenu": "Had a 40 year old Brown 20” stove on a property. The oven control finally went out. Looked up the part number here and they had the exact same part. Just took the old one out and plugged up the new one and off we went. They were several dollars less than competitors too. Over a week to arrive but the part was worth it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brad Kruger",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T23:05:27.000Z",
          "Titre": "The part I needed was discontinued so I…",
          "Contenu": "The part I needed was discontinued so I was skeptical about getting a replacement. Direct Brand had it for a reasonable price and it was shipped out very quickly. And the part worked. My oven lit right up. Direct Brand has been a five star service up to this point. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dolores",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T00:31:30.000Z",
          "Titre": "I have a great experience I two…",
          "Contenu": "I have a great experience I two transactions first one delivery was super fast the only bad thing was the piece was a little dented but nothing crazy second time   everything was perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe in Oregon",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T21:13:31.000Z",
          "Titre": "I needed the blower motor quickly",
          "Contenu": "I needed the blower motor quickly, and I paid for the overnight service to make this happen. It arrived the next day, as promised. I installed it with no problems and it's been running like a champ since."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Carro",
          "Nb_Reviews": 2,
          "Date": "2021-08-13T15:03:56.000Z",
          "Titre": "Received product quickly",
          "Contenu": "Received product quickly.  Ceramic igniter fired up nicely.  Wish they had more replacement parts for my Yoder smoker but I rehabbed it with this part"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "maricruz arocho",
          "Nb_Reviews": 1,
          "Date": "2020-03-25T15:03:28.000Z",
          "Titre": "Great price",
          "Contenu": "This is the third one I have purchased, the plastic on the wires keep melting off don't know why but at least this one was cheaper price wise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Childs",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T21:47:24.000Z",
          "Titre": "Outstanding service…",
          "Contenu": "Waiting for the status of my RMA before I upgrade tour reviewJust received the refund, Great place to work with, couldn't be happier!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark muscia",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T20:49:21.000Z",
          "Titre": "I was skeptical at first being half the…",
          "Contenu": "I was skeptical at first being half the price of the ignitor for my pool heater. It's working like any other that I paid double for! Thank you! Heater is back to working!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Burcher",
          "Nb_Reviews": 2,
          "Date": "2020-10-22T14:52:06.000Z",
          "Titre": "Great service from the company",
          "Contenu": "Great service from the company.  I ordered two items, one of which was out of stock, and they suggested that I wait the few days for it to get to them to save the additional shipping cost.  Saved me quite a few dollars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael murphy",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T22:09:45.000Z",
          "Titre": "Your technical support department help…",
          "Contenu": "Your technical support department help me find the right part because my manual was an old ones and the parts 4 for the older models"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "robert logue",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T00:05:34.000Z",
          "Titre": "I worked with Louise",
          "Contenu": "I worked with Louise. I had found the motor I wanted and thought I had checked the box for NEXT DAY DELIVERY but I had not. Louise took care of the issue. When I had a question the day of delivery she responded back quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Miles",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T20:55:10.000Z",
          "Titre": "Product was exactly as described",
          "Contenu": "Product was exactly as described. Fit well in my application and works great. Product was packaged and shipped quickly and for a reasonable price. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Towsley",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T00:06:17.000Z",
          "Titre": "Excellent  price fast processing and…",
          "Contenu": "Excellent  price fast processing and shipped within 24hrs  definitely  will buy from them again if needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyra",
          "Nb_Reviews": 2,
          "Date": "2022-05-14T12:56:29.000Z",
          "Titre": "Needed parts for my boiler and they had…",
          "Contenu": "Needed parts for my boiler and they had exactly what I needed. Shipping was very fast. Came before the estimated date. Also I found the website was easy to navigate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Campbell",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T11:08:08.000Z",
          "Titre": "The igniter got here sooner than first…",
          "Contenu": "The igniter got here sooner than first posted.it was Pit Boss brand and not some after market.Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Silvers",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T16:41:09.000Z",
          "Titre": "I ordered a thermostat for my apartment…",
          "Contenu": "I ordered a thermostat for my apartment sized range and it fit and worked properly. I do wish I had gotten a new knob with it because I broke the old one taking it off, it was rusty.  All in all though I would use this site again and I will order a knob. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BRIDGET",
          "Nb_Reviews": 3,
          "Date": "2020-05-15T22:53:55.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you, as this product was hard to find. You had the best pricing, didn’t over charge on shipping and I received the order in the matter of days. Greatly appreciated"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T03:13:26.000Z",
          "Titre": "awesome",
          "Contenu": "awesome.    we had a bad motor and they took care of it lightning fast.   can’t say enough good about this company.  will buy again and recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Laird",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T21:49:43.000Z",
          "Titre": "Your person on the phone was very…",
          "Contenu": "Your person on the phone was very helpful. In my opinion he went above by verifying that the part I was calling about was correct and then called me back. The part works perfectly. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mark davies",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T14:00:43.000Z",
          "Titre": "first time ive ordered from…",
          "Contenu": "first time ive ordered from DirectBrand, part showed up sooner than expected and it was the correct part. what more can i ask for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather B",
          "Nb_Reviews": 2,
          "Date": "2020-01-13T19:46:26.000Z",
          "Titre": "Ordering online was easy",
          "Contenu": "Ordering online was easy. There was a mistake in my shipping so I called and they fixed it right away and I got my product on time. Great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monika",
          "Nb_Reviews": 3,
          "Date": "2023-09-09T18:00:32.000Z",
          "Titre": "Quality products",
          "Contenu": "Quality products! Good timing on shipping with fair pricing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guy Voight",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T20:15:41.000Z",
          "Titre": "My order was shipped right away and…",
          "Contenu": "My order was shipped right away and received on time as promised.Order was packaged well and every thing was in the box. I will useDirect Brand again and would recommend them to any one who needsto buy the products they sell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Guest",
          "Nb_Reviews": 1,
          "Date": "2020-03-04T11:22:40.000Z",
          "Titre": "Found Direct Brand looking for a part…",
          "Contenu": "Found Direct Brand looking for a part for my 40 year old oven. Their site was a little hard to use finding a part. I found it finally and they had by far the best price and the best shipping price. Much lower than any other site I had looked at.  Best of all they shipped within about 3 hours!. That's amazing. My oven works again.  I'll shop at Direct Brand again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hector p",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T17:52:45.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery. Came next day everything was great. Customer service is local as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "arthur benoit",
          "Nb_Reviews": 2,
          "Date": "2020-12-04T18:58:22.000Z",
          "Titre": "Perfect replacement door gasket for my…",
          "Contenu": "Perfect replacement door gasket for my englander stove. Exact fit and all i needed to restore my stove to perfect operating condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HEIDI VANDERLINDE",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T18:47:18.000Z",
          "Titre": "This product was great",
          "Contenu": "This product was great,  it came fast and great customer service.  Would recommend this company to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fernando Balam",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T08:29:37.000Z",
          "Titre": "I am very happy with my purchase and I…",
          "Contenu": "I am very happy with my purchase and I recommend them and I would buy other products thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NAILA Herbert",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T00:12:17.000Z",
          "Titre": "Everything works fine easily to install…",
          "Contenu": "Everything works fine easily to install It’s summer so we can’t turn on the pellet stove full time yet but we tested it !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2020-04-20T14:27:48.000Z",
          "Titre": "Great experience with Direct Brand",
          "Contenu": "Great experience with Direct Brand. The part was shipped quickly and at a great price. Packaged very securely as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew DelPivo",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T14:51:00.000Z",
          "Titre": "The part arrived on time and worked…",
          "Contenu": "The part arrived on time and worked great! Thanks for providing quality parts at very reasonable prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "blair mancuso",
          "Nb_Reviews": 1,
          "Date": "2021-03-07T23:28:21.000Z",
          "Titre": "first time i've dealt with this co",
          "Contenu": "first time i've dealt with this co. Prompt service was nice,small part, shipped easilywould use them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Charter",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T00:21:08.000Z",
          "Titre": "The product was exactly what was…",
          "Contenu": "The product was exactly what was advertised the price was right and it was here when promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila Reynolds",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T22:21:05.000Z",
          "Titre": "Easy to order fast delivery in prefect…",
          "Contenu": "Easy to order fast delivery in prefect shape when delivered thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Frosland",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T18:22:57.000Z",
          "Titre": "The product was as expected and I…",
          "Contenu": "The product was as expected and I received it very fast. I will definitely order from the them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frist Baptist Church",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T16:08:50.000Z",
          "Titre": "Item was received in good condition and…",
          "Contenu": "Item was received in good condition and installed and works well.  Only issue was no communication from order notice until delivery.  Suggest you send shipping notice and expected delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T15:20:56.000Z",
          "Titre": "Excellent selection and quick shipping…",
          "Contenu": "Excellent selection and quick shipping and at about 1/3 of the cost of my local supply house."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry D.",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T12:56:34.000Z",
          "Titre": "Item as displayed",
          "Contenu": "Item as displayed. Shipped and received earlier than normally expected. Arrived in perfect condition. Installed and working perfect.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Kliff",
          "Nb_Reviews": 2,
          "Date": "2021-08-09T14:25:36.000Z",
          "Titre": "Easy to place order",
          "Contenu": "Easy to place order, fulfilled accurately and shipped on a timely basis, great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Buschman",
          "Nb_Reviews": 1,
          "Date": "2020-11-15T16:06:10.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent - Quick response - Fast shipping - No issue's - Will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia Schnabel",
          "Nb_Reviews": 1,
          "Date": "2021-07-18T19:09:50.000Z",
          "Titre": "Prompt Shipping",
          "Contenu": "We received the item promptly and it worked perfectly upon installation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2020-02-10T22:23:06.000Z",
          "Titre": "Got exactly what was promised",
          "Contenu": "Got exactly what was promised, fast, and at an excellent price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOE RUDOLPH",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T16:15:29.000Z",
          "Titre": "Great service product fit perfect"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Estes",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T21:19:42.000Z",
          "Titre": "I received my order quickly and it was…",
          "Contenu": "I received my order quickly and it was the right part, worked out nicely..very satisfied"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gerard Lebrun",
          "Nb_Reviews": 2,
          "Date": "2021-05-04T20:43:10.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, right part and shipping was fast. I recommend Direct Brand."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jean Desrosiers",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T17:41:20.000Z",
          "Titre": "Exactly what was needed to replace my…",
          "Contenu": "Exactly what was needed to replace my ingniter on my patriot mosquito magnet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T13:35:11.000Z",
          "Titre": "OEM parts...fast shipping.",
          "Contenu": "OEM parts that got to me very fast.I used standard shipping and got the part in 3 days...very efficient!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Munck",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:34:24.000Z",
          "Titre": "Price and delivery everything went just…",
          "Contenu": "Price and delivery everything went just fine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Review_at_par",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T19:52:04.000Z",
          "Titre": "Product was perfect replacement",
          "Contenu": "Product was perfect replacement. Will order more in future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis P",
          "Nb_Reviews": 2,
          "Date": "2020-02-14T14:49:15.000Z",
          "Titre": "Parts were perfect fit",
          "Contenu": "Parts were perfect fit, good quality, with fast shipping !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Farner",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T16:04:48.000Z",
          "Titre": "Direct replacement",
          "Contenu": "Direct replacement, fast shipping for a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK OWENS",
          "Nb_Reviews": 2,
          "Date": "2020-06-20T02:03:19.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. The part was exactly what I needed and was shipped promptly"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Richard Longtin",
          "Nb_Reviews": 1,
          "Date": "2021-02-17T22:58:12.000Z",
          "Titre": "We haven’t used it yet",
          "Contenu": "We haven’t used it yet, however, will update soon. Price was right, and shipping was very quick! Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Mers",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T12:06:58.000Z",
          "Titre": "They quoted the correct shipping time",
          "Contenu": "They quoted the correct shipping time. Part came new and securely wrapped with bubble wrap. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T20:31:16.000Z",
          "Titre": "Arrived fast and works as it should!",
          "Contenu": "Arrived fast and works as it should!! Will order again if I ever need an auger motor again!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Guest",
          "Nb_Reviews": 1,
          "Date": "2020-02-05T21:30:39.000Z",
          "Titre": "Did not like the 2 different shipping…",
          "Contenu": "Did not like the 2 different shipping dates the prices are good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Simms",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T23:25:40.000Z",
          "Titre": "Had what I needed $ was right received…",
          "Contenu": "Had what I needed $ was right received in timely manner good job !!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Hottell",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T00:08:19.000Z",
          "Titre": "Part was correct and delivered on time…",
          "Contenu": "Part was correct and delivered on time can’t ask for much more then that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashawn Rivera.",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T20:41:33.000Z",
          "Titre": "Excellent shipping speed",
          "Contenu": "Excellent shipping speed. The part was compatible and works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Ayers",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T20:14:41.000Z",
          "Titre": "Excellent service and very fast",
          "Contenu": "Excellent service and very fast. Would highly recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 2,
          "Date": "2021-09-08T19:20:01.000Z",
          "Titre": "good prices great service and fast…",
          "Contenu": "good prices great service and fast reasonable shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T20:25:11.000Z",
          "Titre": "Oven door seal.",
          "Contenu": "Very fast shipping, item as advertised very good price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T17:25:28.000Z",
          "Titre": "fast and easy",
          "Contenu": "Needed microwave paint and it was shipped and delivered within 2 days. Thank you for that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T18:30:08.000Z",
          "Titre": "Easy ordering prices are great and…",
          "Contenu": "Easy ordering prices are great and product came in two days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Ellis",
          "Nb_Reviews": 1,
          "Date": "2020-07-10T23:24:58.000Z",
          "Titre": "Saved me $75 from having to use oem…",
          "Contenu": "Saved me $75 from having to use oem thermostat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Sebranek",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T23:36:23.000Z",
          "Titre": "I have no complaints it came in a short…",
          "Contenu": "I have no complaints it came in a short time. The only trouble was a old guy on this end. Trying to find the partThank you for the good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Clark",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T21:36:36.000Z",
          "Titre": "the mounting bracket was not far enough…",
          "Contenu": "the mounting bracket was not far enough back.  I had to get my dremell out to break the spot weld to move it back.  Now it works just fine.Frank"
        }
      ]
    }
  ]
}