{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "earnhaus.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:58:28.000Z",
          "Titre": "Don't waste your time...",
          "Contenu": "Don't waste your time. If you aren't key demographic they are looking for, you get blocked by every survey even the terrible ones (ie- $0.15 for a 20minute survey)I guess I should've lied about my age, race, job, etc so I could actually take a survey. That's what I get for being honest."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea Sarandes",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T04:21:22.000Z",
          "Titre": "Not impressed with this survey site at…",
          "Contenu": "Not impressed with this survey site at all. never took so many surveys and wasted so much time to only be told, not a good fit. I know how survey sites should work and I use another one very successfully. I just wanted to try this one and see how it went. Tremendous waste of time. Spent over a week on surveys and tried to cash out at $5 only to find out you take a $1 fee. So I took another 2 weeks to try to get to $10 to no avail. I have 3 outstanding surveys where I am told I have to wait over a month to find out if i get paid. I got tired of trying to get to 10 and just ate the ridiculous fee and cashed out. Meanwhile the other site I used I can get 10/day. And I don't want to hear the excuse I was given it's because they are dup surveys. They are not. So overall, this site is a big fat no from me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacy Trejo",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T16:38:45.000Z",
          "Titre": "At first I thought this was a great…",
          "Contenu": "At first I thought this was a great deal to earn a little extra cash, the experience was great. However, here lately it hasn't been so great. I receive notifications for surveys and when I go take the survey I get denied after answering my gender or my age. One thing I don't get is when I get asked my D.O.B. then very next question what is my age. Another thing that I thing is bogus is the evaluation deal. On some of them I have to purchase or subscribe to something in order to receive payment and the pay out is less than the subscription. I don't know what to think this survey deal anymore because it seems I get the run around more than getting to participate in any survey. I didn't want to even give this review one star but I did just for the fact that my experience in the beginning was great and after a few months have past it has slowly began to change in a negative way ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Catherine K",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T01:47:56.000Z",
          "Titre": "Okay so here it is December first",
          "Contenu": "Okay so here it is December first. I waited on this site since they said survey owners have the right to review all the surveys until the end of the next month. Funny that everyone of the 22 surveys I had under review were not credited. This means that Earn Haus got paid for every survey that I took however I didn't receive not one cent for my time. Good luck to you if you do this site. Peace."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Bush",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T12:45:30.000Z",
          "Titre": "I can’t add my bank info for pay out so…",
          "Contenu": "I can’t add my bank info for pay out so I basically wasted 3 to 5 hours of my time for no payment I will be leaving a formal review. (Reply to ur comment) actually no I have not received any funds to my account if says it went through I guess on your end but no money has hit my account from ur company thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Cola",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T01:25:18.000Z",
          "Titre": "Pennies paid for surveys",
          "Contenu": "Pennies paid for surveys. I wasted over an hour and got $5. Then they charge you $1 to get your money if it’s under $10. Needed ID and photo verification.  Was insane."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T04:24:55.000Z",
          "Titre": "Complete fraud marketing app",
          "Contenu": "Complete fraud marketing app. Once you complete a survey it's programmed to reject it and renders no compensation. This company just trying to get rich off of other people's sweat. Do not participate!! They'll rip off your time and suck the energy out of you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 27,
          "Date": "2023-11-22T20:46:34.000Z",
          "Titre": "Waste of time.",
          "Contenu": "Do not waste your time just like Qmee you will waste a ton of time doing surveys to constantly get told you do not qualify."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paymemyworth",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:12:27.000Z",
          "Titre": "EARN HAUS IS JUST TAKEN OUR DATA",
          "Contenu": "I've been signed up for earn haus for 2 weeks now, and every time they send me a survey, I spend 10 min. doing the pre survey, just to be told I'm not a fit and given .10 after you guys have siphoned my data which is worth $1,000's of dollars, all these survey sites are ripping us off to use  our data if you stay on a site more then 5 min, everyone should be paid at least $1.00 cause they're still gonna use our data and make money. (You did answer some questions)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Vestal",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T04:09:45.000Z",
          "Titre": "Over a dozen surveys left forever under…",
          "Contenu": "Over a dozen surveys left forever under review and dozens of times within a couple minutes of being told, \"Aw, shucks!\" when looking for new surveys that are supposedly available."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Otto",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T23:37:34.000Z",
          "Titre": "Excellent way to waste your time to feel completely unappreciated",
          "Contenu": "I don't appreciate spending 15 hours to earn 5 bucks then have you take a dollar to transfer the money...Seriously?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T08:39:38.000Z",
          "Titre": "It would not load  trustpilot wouldn't…",
          "Contenu": "It would not load  trustpilot wouldn't load from your website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Billy Votaw",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T19:56:17.000Z",
          "Titre": "It’s a scam",
          "Contenu": "It’s a scam. You do hours of work for Pennie’s just to have them sell your info repeatedly. Question anything and they ban you. It’s a criminal organization and I have filed complaints with the attorney general. DO NOT FALL FOR THIS CRAP.I’m glad you see that. Now tell people about the numerous surveys I took that I didn’t get paid for. Or the laws you break. How bout that? You stupid crooks. I’m glad to see you are all f-ing  liars and thieves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 4,
          "Date": "2023-10-16T21:01:10.000Z",
          "Titre": "This site used to be great and pay me…",
          "Contenu": "This site used to be great and pay me for completing surveys. I went close an entire year before I could get another pay out because everything was \"UNDER REVIEW\". This site uses the same partners as Qmee and Drumo and I have NEVER been \"under review\" with them. In fact, they pay me if they feel I was treated unfairly. RUN from this site. Fake reviews."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikki Plumb",
          "Nb_Reviews": 5,
          "Date": "2023-09-02T00:21:40.000Z",
          "Titre": "Don't be fooled, and don't waste your time",
          "Contenu": "Don't trust any of these Survey gigs. I have tried them all, (like a fool) and I foolishly thought I safetly found a real paying Survey gig when I looked up the reviews for this one before beginning. The reviews stated this one actually paid, so I gave it a shot. Once again, my precious time was wasted and Earn Haus went from advertising these high paying surveys, to offering me a dollar per servey, to me completing a survey, starting another with the same questions, round and round we went, then the thing kicked me off and I was paid NOTHING!! These \"PAYING SURVEYS\" will ALWAYS be a scam. Don't be fooled, and don't waste your time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shantay",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T23:40:54.000Z",
          "Titre": "the response i receive is not…",
          "Contenu": "the response i receive is not sufficient the surveys were not reviewed or even touched the sight is a scam and you are there insure your participants are credited for their time, you put all of this in fine print but guarantee in big print payment for time fDO NO WASTE YOUR TIME ON THIS SITE !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2023-11-02T18:13:27.000Z",
          "Titre": "I was redirected over 5 times or not…",
          "Contenu": "I was redirected over 5 times or not accepted for surveys. Apparantly, white 39 to 50 yr old women who are employed in healthcare is not the demographic they are looking for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tanya da Graca",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T06:22:22.000Z",
          "Titre": "Difficult start up",
          "Contenu": "I signed up and was forced to begin with some survey that said it would take 1 minute.  I didn’t have a choice, this was what was on the page and I couldn’t X off.  Somehow it rolled into more questions that said this will take 15 more minutes.  At that point, I closed my screen.  Did I do something wrong?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angie Benedek",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T16:37:58.000Z",
          "Titre": "It's a Scam!! Don't waste your time.",
          "Contenu": "I made it to $3.72, it won't let me cash out until I reach $5. But it's not letting me match to anymore surveys. And wasting time pre-screen questions and 30 minutes at that, just to say sorry no match, no payment for wasted time either! JUST 50 Cents surveys for 40 minutes? Please.. your not Serious!! ONCE I REACH $5 THEN IM CASHING OUT AND DELETING MY ACCOUNT! (Reading others comments they want your ID for cashing out?? It's even worse than I thought! THey won't pay you unless you comply! P.S. They also send you surveys trying to just sell you stuff..)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Buettner",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T23:41:55.000Z",
          "Titre": "It's a lot of work to have to verify my…",
          "Contenu": "It's a lot of work to have to verify my identity, no one else makes me do that. Rethink your process pleaseAfter my review I get a terse response about the ID verification being in the terms and conditions. Making someone send their ID is something no other remote work site requires. I'll pass on this site going forward."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marjorie Gleaton",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T11:05:20.000Z",
          "Titre": "Payments",
          "Contenu": "Three of my surveys is under review  so the money has not been deposited  into venmo"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danette Taylor",
          "Nb_Reviews": 7,
          "Date": "2023-07-28T18:30:53.000Z",
          "Titre": "TRUST PILOT kick EARN HAUS OUT! They are illegitimate!! And always have been!",
          "Contenu": "TRUST PILOT, PLEASE REMOVE THIS FAKE COMPANY FROM EXISTING ON YOUR SITE! I WILL BE COPYING THE REPORT I AM FILING WITH THE FEDERAL TRADE COMMISSION, AND DEPT OF FRAUD ON HERE, HOPEFULLY THIS WILL DETER ANY AMERICANS IN THE UNITED STATES FROM GETTING INVOLVED! THEY ARE NOT LEGITIMATE AND ILLEGALLY USING PEOPLES IDENTIFICATION DOCUMENTS TO USE FOR IDENTIFYING DOCUMENTS FOR THEIR PEOPLE TO GET INTO THIS COUNTRY!  AND ITS LINKED DIRECTLY TO EARN HAUS! ALERT ALERT ALERT, ... ANYONE THAT WAS \"SKIDDISH\"IN THEIR REVIEWS WERE VERY RIGHT TO BE IT WAS YOUR INTUITION!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Kurutz",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T21:12:06.000Z",
          "Titre": "This has to be a bad joke at best",
          "Contenu": "This has to be a bad joke at best. My wife and I have filled out prequalifers for the better part of a week and have not been accepted for any of them.  This is not quick money or any money for that matter.  It's just a scam to get as much personal information as possible before getting AW SHUCKS!!! Don't waste your time and if you actually think you'll make money then the value of your time must be $0.00."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerome Russell",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T07:28:43.000Z",
          "Titre": "Please don't waste your time here when…",
          "Contenu": "Please don't waste your time here when there are other better option out there, I have never seen a survey site that ask for a sensitive information like ID Card and taking a selfie just to redeem $5, there is more to that, they are selling your information to third party company. How can you ask for ID Card verification that's very extreme. Please guys don't waste your time with this scammers. There are other better survey website and survey apps out there. Earn Haus are scammers with a hidden agenda they are not telling us. Scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel Mcathy",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T16:35:52.000Z",
          "Titre": "I registered and finished all the…",
          "Contenu": "I registered and finished all the steps. On starting the tutorial survey, it keeps on looping around the 'next' button.I cleared the cookies and logged in again, still loops around the 'begin' and 'next' button.Can I get past this and start earning?or is it a waste of time?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 4,
          "Date": "2023-10-17T22:37:20.000Z",
          "Titre": "Earn Haus AI Bot Reviews Don't Believe Them",
          "Contenu": "I think their AI program is pulling all kinds of BS because it did not even address what the issue was. Also my rant is true and their replies are all pure BS. So it is AI answering these responses. Stay away from these clowns. I did NOT cash out 6 times this months, I was lucky to cash out 6 times since I signed up because of \"BEING IN REVIEW\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lupita",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T03:48:56.000Z",
          "Titre": "Pointless",
          "Contenu": "As a preschool teacher I thought this would be an easy way to get extra cash. I just deleted my account for this survey site. It was a waist of time. My first hour I made 2 dollars that's the catch, they do that to get you interested and think it will work. The following days I completed about a total of 10/15 surveys never did earn .20c nothing. The page would just freeze, they took my surveys and ran with them. Tried many times again after and half way with other surveys they booted me out saying I don't qualify. Waist of time!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julianne Stephens",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:03:41.000Z",
          "Titre": "There are several surveys that I did…",
          "Contenu": "There are several surveys that I did the last of sept that are STILL in review.  So I’m assuming I might not get paid for doing them which would be a waste of my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D welch",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T11:06:28.000Z",
          "Titre": "Well you asked for it im about the most…",
          "Contenu": "Well you asked for it im about the most bruttaly honest dude on this earth so yall stepped in it .  So lets just get the good out now the one star positive is the pay is almost instant . Now with that being said ive been on tonight about a hour and a half roughly 15 min into each and its at 7-8 surveys they all say i dont fit or qaulify . Now the the couple answers that dont change every survey is im white , make 90,000 a year , and speak 247 english oh and im republican , so really feels pretty biased because i did not climb wall or float the rio grande told ya brutally honest have a good evening ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Buckman VII",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T22:30:07.000Z",
          "Titre": "Half the day for five bucks (revised after your rebuttal bot)",
          "Contenu": "Half the day for five bucks? Not really beneficial to the consumer.P.S. Don't condescend me. You would think since I'm wasting time on these things, you wouldn't have to try to make it as hard as possible to achieve the bare minimum goal. It's cliche bait at its worst. You are not concerned at all with the persons you actually need. It's not hard to have a AI crush you. Since artificial intelligence has surpassed your own. Hope the truth sets something right. I doubt it though. God bless"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Red",
          "Nb_Reviews": 4,
          "Date": "2023-07-03T01:23:36.000Z",
          "Titre": "I signed up for a new account and I…",
          "Contenu": "I signed up for a new account and I have achieved enough for the cash out request and they will not let me cash out because they require a valid, not expired, drivers license and mine is expired and they kept my money, scammed!!!  There should be another way to get a whole 5dollars, it's not like you are giving me a few thousand dollars"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cj Sexton",
          "Nb_Reviews": 3,
          "Date": "2023-07-19T13:43:25.000Z",
          "Titre": "Fix the nonsense.",
          "Contenu": "Same questions constantly over & over.    Dont pay right or what it says.  Answer buncha questions just for it to say that Not applicable or watever sodont have payout.    Just everything needs a real good fixing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BBT",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T05:33:51.000Z",
          "Titre": "Long payout wait",
          "Contenu": "I have to wait over a week for the deposit to hit my bank account. Extremely dissapointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T23:48:30.000Z",
          "Titre": "Pocketing survey funds",
          "Contenu": "Did so many surveys and they claimed the company was waiting to look over everyone to make sure there weren't inconsistencies. Wasted all that time for none of them to pay. I think the company is keeping the money. There's no excuses for this. I do surveys regularly and they're the only company pocketing my earnings. Literally the only one.And it's strange that you would act like I didn't email you guys before it even got to this point"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WholeGang_WeUsNotThem “JustDuc",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T16:14:01.000Z",
          "Titre": "It would not let take any surveys after…",
          "Contenu": "It would not let take any surveys after reaching 6 dollars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Riddell",
          "Nb_Reviews": 5,
          "Date": "2022-12-28T20:28:36.000Z",
          "Titre": "It says you earn $5 every 3 surveys…",
          "Contenu": "It says you earn $5 every 3 surveys completed, and that used to be the case. Now I finish surveys and instead of being credited they are going under review. AND I'M NOT BEING PAID FOR THEM. It says upon completion, not complete the whole survey and if we like your answers you might get paid. I have completed 9 surveys that I did not receive credit for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Antonio Massey",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T14:33:09.000Z",
          "Titre": "2 days to get $5.00",
          "Contenu": "These people put you through hell to get $5.00 The closer you get The less the money for surveys get then you can go through a whole survey AND get to the end and all of a sudden the survey freezes and don't get accouted for it. They got some tricks with them and because of this it took almost a day and a half just to get $5.00"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lilli",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T17:07:09.000Z",
          "Titre": "Absolutely awful!",
          "Contenu": "This survey site is the absolute worst! I completed many surveys but over half of them wound up being under review for over a month, and then NONE of them were paid out! I use several of these types of sites and none of the others do this! This one is a scam and I recommend to stay far away from it. I was able to cash out the surveys that immediately registered as completed, but still had to jump through hoops to verify my identity. This one is a waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elisa Cranmer",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T11:10:45.000Z",
          "Titre": "I tried this for several hours",
          "Contenu": "I tried this for several hours.  Most of the surveys I did not qualify for, but read enough positive reviews that said once you got going it was easier.  This is definitely not the case.  My biggest problem is it does not deny you right away so you waste 5-10 minutes bouncing between sites just answering qualifying questions.  However, I just started letting the site direct me thinking that would solve the problem.  I just spent 10-15 minutes on a survey and mid survey it just sent me to a different site to start a whole new survey (progress bar reset to zero - different company name).  I did not get paid for the first survey nor it tell me why it just switched to a different survey but I wasn't going to waste my time jumping around for no reward. No idea how people say they make money.  I literally spent at least two hours and couldn't get over $2.60.  Seems like a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron Douglas",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T06:52:03.000Z",
          "Titre": "The incentive for surveys is not enough…",
          "Contenu": "The incentive for surveys is not enough for what’s asked of participants."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SAM",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T09:14:24.000Z",
          "Titre": "IS THIS A SCAM OR NOT. DO NOT WASTE PEOPLE TIME",
          "Contenu": "I HAVE 64 SURVEYS UNDER REVIEW SINCE OCTOBER 8 AND HAVE NOT EARN NO CREDIT WHAT IS GOING ON I NEED TO BE CREDITED FOR MY TIME.I FEEL LIKE I WASTING MY TIME FOR NO REASON YALL REALLY NEED TO FIX THAT PROBLEM AND SOMEDAYS WHEN IM CLOSE TO GET 5 DOLLARS THERE IS NO SURVEY FOE 2 DAYS. YALL NEED TO PAY PEOPLE FOR THERE TIME AND NOT ALMOST 2 MONTHS LATER.ITS TO THE POINT IM A BE DONE WITH THIS SITE AND TELL PEOPLE DO NOT GO TO THIS SITE ITS A SCAM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Prevost",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T00:24:24.000Z",
          "Titre": "Service is amazing, but the rest......",
          "Contenu": "The service you provide is amazing. I am trying to do more surveys that I know I should qualify for. Every time I click on a survey it takes me, instantly, to the survey summary page w/o me being able to answer a single question"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T00:28:25.000Z",
          "Titre": "Waste Of Time With Survey Take Certain…",
          "Contenu": "Waste Of Time With Survey Take Certain Surveys To Find Out It's UNDER REVIEW AND THE WAIT TIME"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deuce Fireblood",
          "Nb_Reviews": 5,
          "Date": "2023-09-15T17:14:10.000Z",
          "Titre": "I didn't get paid for 3 surveys I…",
          "Contenu": "I didn't get paid for 3 surveys I completed, an 2 of them my son answered for nothing, and when I first started there where al9t if 2 dollar surveys, after I did one, it's all low surveys for another of time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T11:27:26.000Z",
          "Titre": "This Website is a SCAM",
          "Contenu": "I forgot my password and made a new account. Earn Haus let’s me complete 5 surveys and I actually Earn $5. But right when it’s time to redeem my money… I get a message that my account has been disabled because I have 2 accounts. But that was not a problem when I was completing 5 surveys,… only was a problem when it was time for them to pay!!!!!! This Website is a SCAM!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T11:10:45.000Z",
          "Titre": "They first get you good when you get…",
          "Contenu": "They first get you good when you get the five dollar sign up fee for dinner today start watching and doing surveys for so many hours are in so many days that you don’t even have points anymore"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M. Christine",
          "Nb_Reviews": 2,
          "Date": "2022-10-30T04:45:57.000Z",
          "Titre": "THE ABSOLUTE WORST",
          "Contenu": "This is the worst survey website out of all the websites combined. It should be shut down. You go through hoops to qualify for a survey, some of them take more than a half hour to complete, you hit submit to end the survey (this is after you are confirmed that you are qualified of course), you finally reach the last page of the survey, and bam once you hit that button you receive a response that you didnt qualify. Additionally, i have over 45 surveys being reviewed since September 14, 2022, which was the first day i joined, so they havent even began to review any of them. What a mess and a scam. Do not use this site. Waste of time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer L",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T10:04:27.000Z",
          "Titre": "Scammers",
          "Contenu": "This site is an absolute joke. I'm thankful after reaching the $5 cash out minimum, I decided to see if it was really legit. As soon as I clicked on redeem, I got a message stating I did not verify my identity. Then I was asked to take a picture of my driver's license along with a selfie of myself 🤔. Yes, it is a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "yogibur kingslife",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T21:38:45.000Z",
          "Titre": "So majority of the surveys you have to…you have to pay",
          "Contenu": "So majority of the surveys you have to pay somebody else just to get the money from the survey. Such as one survey was going to pay me $10 but I had to buy a 3 month subscription at $15 a price a month. How does that make sense?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Buddy Taylor",
          "Nb_Reviews": 3,
          "Date": "2023-03-03T00:12:50.000Z",
          "Titre": "Cheated by Earn Haus…",
          "Contenu": "Just cause they don't certified the survey I don't get my points this is on 5 survey. If  you ask me I think Earn haus should have to be investigated. Waist of time I recommend survey junkie at least you get points for not qualifying."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Parsons",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T10:54:13.000Z",
          "Titre": "It's a scam for sure I'm at $4.50 then you do all the surveys they get all the answers they need for ten min then tell you not on this survey perfectly normal 5 in a row for 2 hours scam don't waste y",
          "Contenu": "Money says 5 dollars on sign up never happened gives you surveys from email for a quarter sends you to other sights did surveys for well over an hour yhrn goes on to tell me won't pay for about 6 weeks if and when it does 5 days not 5 dollars yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dddddddd",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T20:08:58.000Z",
          "Titre": "I've done alot of surveys and have not…",
          "Contenu": "I've done alot of surveys and have not been co.pensated for them samplicious is crap have u complete a survey just to say u don't answer 50 questions an get an error code smh it's unreal"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Streamz N Dreamz",
          "Nb_Reviews": 15,
          "Date": "2023-10-19T05:57:57.000Z",
          "Titre": "Scam and all these fake reviews",
          "Contenu": "Scam and all these fake reviews. These guys act like you can make good money. There isn't even surveys. They want you to sign up with the other scam sites that will spam your email and they want your credit card info to buy a product and say then we will pay you. Bs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Russell March",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T00:06:36.000Z",
          "Titre": "Does not actually send any money.",
          "Contenu": "No communication. Provided my banking information and the status says complete regarding payment.No money.No word.Nothing.Grrrrr."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Durham",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T23:40:28.000Z",
          "Titre": "Received a gift card but I am unable to…",
          "Contenu": "Received a gift card but I am unable to use from this site. Also they only seem to give you one gift card and then you don't qualify for any more surveys I do not believe this is legitimate site I think it should be reported to the better Business bureau"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharita Stinson",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T19:53:02.000Z",
          "Titre": "Zero stars, don't recommend this platform",
          "Contenu": "Earn haus is NOT where it's at. They are not helpful when it comes to reporting mishaps with surveys. Moreover, instead of taking ownership for the difficult platform, it'll place blame on the survey. I think that Earn haus needs to vet the surveys better. It makes it impossible to earn a measly $15.00"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blake Harris",
          "Nb_Reviews": 3,
          "Date": "2022-10-24T01:48:45.000Z",
          "Titre": "This survey app is a total waste!",
          "Contenu": "This survey app is a total waste of time, effort, storage on a device and just a total waste in every way imaginable. I truly regret having ever taken a single survey using this app, even though I have been awarded $10.00 altogether. But that was too long ago to even think about. Now it's just a piece of crap that wastes time, effort, and everything else!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "meh",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T15:49:19.000Z",
          "Titre": "they tell you a price then change it…",
          "Contenu": "they tell you a price then change it they tell you how long it should take it takes longer they make making any money almost impossible i would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "teresa mcclain",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T17:02:45.000Z",
          "Titre": "your website is awful",
          "Contenu": "your website is awful. i have completed so many surveys and at the end of the long amount of time, it does not credit me for my time. i am reporting you guys to the better business bureau, this should be illegal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Do",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T11:53:33.000Z",
          "Titre": "Cheated me out my money",
          "Contenu": "I did most 12 surveys and Everytime I do another one they put all of them under review not to pay me I work hard and I got to wait to be paid"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Syed Ishtiaq",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T18:14:36.000Z",
          "Titre": "I completed over twelve surveys that…",
          "Contenu": "I completed over twelve surveys that were sent in for review and not paid. I also completed all of the required steps for six of the multi-part surveys and did not receive payment for those."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Naudia Lunardi",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T15:11:51.000Z",
          "Titre": "All bad",
          "Contenu": "This site was perfect at first! You can earn the 5$ minimum to get the cash through PayPal quick and they send it almost instantly. But the second time around is when they start messing with you. You been earn up to almost enough to cash out again and then your screwed then basically. I have been at 4.42 for almost a month with every single survey I complete now going into review that will be done by the end of the next month. I'm good. Thanks allot"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dleon.airbnbgmail.com",
          "Nb_Reviews": 3,
          "Date": "2023-04-20T06:06:11.000Z",
          "Titre": "So sorry to say that this company was a waste of time",
          "Contenu": "I completed over twelve surveys that were sent in for review and not paid.  I also completed all of the required steps for six of the multi-part surveys and did not receive payment for those."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chelsey",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T03:34:17.000Z",
          "Titre": "Just watched an entire pilot episode of…",
          "Contenu": "Just watched an entire pilot episode of a show and then got almost all the way through the questions and BOOM. Nothing. No credit. Not even a pending reward lol Survey Junkie is the best survey platform by far!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paradise",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T09:01:24.000Z",
          "Titre": "I have completed more than 10 surveys…",
          "Contenu": "I have completed more than 10 surveys and they all claim, I don't qualify. I have only received credit for 2 surveys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KnifePhD",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T05:13:55.000Z",
          "Titre": "This is the worst place that I have…",
          "Contenu": "This is the woirst place that I have ever seen.  I had at least 20 surveys that were finished 100% but were 'under review'.  After waiting a whole month I received credit for ONE of them.  What kind of BS is that?  I am sure this is the kind of operation RICO laws were written for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Sory",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T04:54:55.000Z",
          "Titre": "Scam",
          "Contenu": "You are a scam let me take four surveys in the fifth one I'm denied every time it's not even online this service is no good I wasted all day on you guys thanks a lot"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayla J",
          "Nb_Reviews": 3,
          "Date": "2023-06-18T18:22:19.000Z",
          "Titre": "company doesn’t pay out all surveys",
          "Contenu": "This company has 6 surveys that I put time and effort sitting “in review” for a month. It don’t take a month to complete so waiting this long for compensation is ridiculous and disgusting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Yulonda Duncan",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T13:50:34.000Z",
          "Titre": "Earn Haus has 11 of my surveys in…",
          "Contenu": "Earn Haus has 11 of my surveys in review! Why? Can't tell ya. They owe me $15 they refuse to pay me I completed 11 surveys that were not credited I got the first $5 and that was it I answered all questions honestly into the best of my knowledge and I still have not received payment I've been waiting over 3 weeks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ahayahis Wisdom",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T01:31:53.000Z",
          "Titre": "I have been doing surveys for decades and never have I ever come across any who had asked me for personal document.",
          "Contenu": "I have been doing surveys for decades and never have I ever come across any who had asked me for personal document. Just to redeem $5 you want me to scan my ID and take a self? Are you kidding me? Keep that money if that's how you guys are scamming people in the name of Identity verification. If I knew I will be asked to scan my ID's I was not going to waste my time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Montice Robinson",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T11:34:02.000Z",
          "Titre": "Ridiculous 30 day wait for a 20…",
          "Contenu": "Ridiculous 30 day wait for a 20 question survey review.they probably do this cause otherwise I would have been cashed out 3 times in 1hr absolute crap.shame on you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T14:46:56.000Z",
          "Titre": "SCAM !!",
          "Contenu": "SCAM !!! Be Aware ... Like previous users have stated before that they have NOT been rewarded for the surveys they have completed, I been scammed out of hours and hours of my time. Oh it seems okay at first then boom you been had. Not a site that you should trust at all. Run Run away try Attpoll they are so much better never using Earn Haus again..Updated: it a scam for sure their address 2803 Philadelphia Pike, Suite B #403. 19703. Claymont. United States is an address for digital mailbox....smh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "guerrier jaslin",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:59:35.000Z",
          "Titre": "This is completely a big sam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josie",
          "Nb_Reviews": 8,
          "Date": "2023-06-19T10:36:18.000Z",
          "Titre": "Disqualifications from surveys",
          "Contenu": "A lot of disqualifications from surveys and not enough getting the points from surveys which is ridiculous. Hiw are you supposed to cash out when all you get is disqualified 80-90% of the time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jok Starkey",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T02:52:32.000Z",
          "Titre": "Why do I need to provide my…",
          "Contenu": "Why do I need to provide my identification?I did enough surveys to earn $5, and while trying to cash out, it asked for a picture of my ID.This seems like an invasion of privacy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T15:38:31.000Z",
          "Titre": "Very wasted time",
          "Contenu": "Very wasted time! I have about $70 in surveys that were under review for 2 months and they've all been denied. Do not trust this survey site, I should have listened to other people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 4,
          "Date": "2022-09-30T08:38:19.000Z",
          "Titre": "This is one of the BIGGEST SCAM SITES…",
          "Contenu": "This is one of the BIGGEST SCAM SITES out there, should be avoided AND permanently removed IMMEDIATELY REMOVE. They enjoy ripping off their own clients"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel bash",
          "Nb_Reviews": 9,
          "Date": "2023-02-01T17:44:35.000Z",
          "Titre": "THE WORST SURVEY SITE EVER!",
          "Contenu": "Do not waste your time! I had to take so many surveys just to cash out $5.10. And the last two surveys to get me to the threshold they kept disqualifying me.  So frustrating. But even worse sometimes you’ll take a survey, and they have to review it through a third party. This happened to me with 3 at the same time. Of course they were higher paying. The first one came back within a couple of days and I got $2 credit BUT THE OTHER TWO took a full month 31 days and today I go to see the amount in my account and the two pending simply disappeared! Apparently they didn’t accept them. I’m always truthful thid compamy really stinks surveys pay low and god forbid two surveys ask the same thing but just a tad different that makes of forces you to anwser differently you’ll start being disqualified right away. THERE ARE SO MANY BETTER SURVEY COMPANYS SND I HOPE EARN HOUSE SSES THIS. SLSO THERES NO WAY TO CONTACT THEM!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kara",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T00:29:25.000Z",
          "Titre": "I just finished taking the fifth survey…",
          "Contenu": "I just finished taking the fifth survey which were completed and said \"you did it\" at the end of each one. And I have received absolutely nothing. Not even in my survey history. I though the was a legit site. Had I known this I would have stuck with qmee or attapoll at least they actually pay when I take a survey."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Langham",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T00:15:39.000Z",
          "Titre": "It is hard to even do a survey",
          "Contenu": "It is hard to even do a survey. 9 times out of 10 you spend more time trying to get a survey than actually doing one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nate Hagood",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T07:15:27.000Z",
          "Titre": "Absolutely horrible",
          "Contenu": "Absolutely horrible. The worst survey app out there. You'll never get to redeem. You'll answer questions only to get rejected. Complete scam..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Mulford",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T16:58:53.000Z",
          "Titre": "This company is the biggest scam….I had…",
          "Contenu": "This company is the biggest scam….I had 5 surveys in reviews and according to their FAQ page, it will take a few days to review and you receive payment but they have been reviewing mine for a month and said some will be completed by October 31 and here it is November 1 and two of the surveys that is supposed to be finished by October 31 has disappeared and no explanation of why or where it is…..I got 3 more in review but I’m not wasting my precious time on that garbage…..all the other surveys will let you know right away if you qualify or don’t….all of us who is retired or disabled or even have to stay home with kids could use that extra money even though it’s not much, every little bit helps…..this company is crooked and they will make excuses why you haven’t received payment but at least they should let you know in timely manner why you didn’t qualify for the survey instead of saying it’s in review and then they disappear without an explanation..GOOD GRIEF!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juanito",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T11:03:26.000Z",
          "Titre": "Really Disappointed ☹️",
          "Contenu": "I am really struggling to complete any surveys it’s not fair the moment I try to feel it up it tends to kick me out it does not pre-send new surveys there the same and it’s wasting my time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T02:55:50.000Z",
          "Titre": "The payouts are super low for how much…",
          "Contenu": "The payouts are super low for how much time you spend doing surveys. The other half of the time, you don’t even qualify."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Bridges",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T10:27:49.000Z",
          "Titre": "It's a joke cashed out one time took…",
          "Contenu": "It's a joke cashed out one time took four more surveys get to the last one and guess what no surveys available or you don't qualify don't wast your time"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RANDY JAMES",
          "Nb_Reviews": 3,
          "Date": "2023-07-23T07:18:41.000Z",
          "Titre": "Been filling out surveys for a little…",
          "Contenu": "Been filling out surveys for a little over a week, making pennies a shot. Can't wait until I get to $ 5 so I can cash out and quit.                     Couldn't take it anymore, finally quit. They can keep their pennies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Buddy Taylor",
          "Nb_Reviews": 3,
          "Date": "2023-01-20T16:12:10.000Z",
          "Titre": "I have 4 surveys in review I just did…",
          "Contenu": "I have 4 surveys in review I just did one that was suppose to take 20 minutes they drug it out for an hour and 20 minutes than went in review for less than 60 cent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SCOTT",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T03:36:05.000Z",
          "Titre": "Earn haus pays survey  takers cheap and…",
          "Contenu": "Earn haus pays survey  takers cheap and  they make the profits through selling your internet browsers private imfo  B S Site Scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Rakoski",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:49:02.000Z",
          "Titre": "They offered to pay you a certain…",
          "Contenu": "They offered to pay you a certain amount per survey. However the survey that they send you to will also automatically with no other way out if you're going to get paid will send you to several several other surveys then after you complete not just one but all of the surveys taking much more time than it says it would when you get back to their website they don't pay you what they said they were going to instead they give you 10 cents and say that you didn't complete the survey because the survey sent you back because you didn't answer properly I didn't think there was a wrong answer in a survey that's the point of a survey is to have an opinion it's garbage and it doesn't pay $20 an hour either after the first couple that gets you hooked every one of them are only 20 cents for a 30 minute survey"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Fontaine",
          "Nb_Reviews": 5,
          "Date": "2023-09-11T05:27:41.000Z",
          "Titre": "They don't pay",
          "Contenu": "As soon as I tried to cash out I was kicked off the site. Try and go back in says wrong password, try and reset password, tells me the link expired. Just another scam!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shantay",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T08:31:27.000Z",
          "Titre": "this site is absolutely horrible i…",
          "Contenu": "this site is absolutely horrible i completed seven surveys and recieved no credit, I contact support multiple times and each time they stated that the sponsor of the survey had to give credit after 30 days i should have automatically received credit instead they have all disappeared without any explanation or reason. DO NOT WASTE YOUR VALUABLE TIME, i am filing complaints with the BBB as well as my state treasury office"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara Mulford",
          "Nb_Reviews": 3,
          "Date": "2022-09-16T00:49:15.000Z",
          "Titre": "I'm having trouble getting surveys",
          "Contenu": "I'm having trouble getting surveys. Every one I've tried, I don't qualify for. I have been very honest on all of my answers. This is very frustrating. I like one more to redeem 5 dollars. As soon as I get that one, I’m bailing out of this survey. I don’t want to lose that 5 since I worked so hard to get this far."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shirley Ward",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T15:23:10.000Z",
          "Titre": "Surveys are to long for the amount of…",
          "Contenu": "Surveys are to long for the amount of money offered. And I'm tired of being told you don't qualify."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Suelzer",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T16:50:11.000Z",
          "Titre": "Why is Norton showing an unsafe warning…",
          "Contenu": "Why is Norton showing an unsafe warning whenever I pull up Earn Haus?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James W",
          "Nb_Reviews": 4,
          "Date": "2023-04-18T00:09:19.000Z",
          "Titre": "After I earned 5 dollars easily",
          "Contenu": "I earned 5 dollars easily.  After that It was all survey matches and quality questions! Boo! My response, oh yeah. I just went to your site and spent 10 minutes answering the same dam questions and I never even saw a survey. Or earned a penny! Again BOOOOOO!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Moore",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T02:34:47.000Z",
          "Titre": "Scam Artists- they don't pay up",
          "Contenu": "The first set of surveys went great. I got paid and all was good. Since then I have completed 8 surveys and didn't get credited for NONE OF THEM! It says some of them may take a while to be credited well it's been several days and I haven't received anything no credit no nothing no way to reach customer service even. Seems like a scam. Beware.... UPDATE!! Nov 26, 2022- so I've been waiting for a couple of months now for them to review the surveys I had already done. I wasn't optimistic on getting credit for them just from what I've seen from the site but it turns out they just deleted my account so they don't have to pay me. What a scam. Trust me do your surveys elsewhere. You won't get credit for 90% of the surveys you take."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sharon Smith",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T09:07:04.000Z",
          "Titre": "Dissatisfied",
          "Contenu": "I have been trying to get survey for the past few weeks and I'm not able to get any.I'm not sure why but it seems racistBecause when I said I am black it won't give me anymore.But when I started a new profile and said I am white it paid me instantly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherri Brown",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T17:34:25.000Z",
          "Titre": "Does not pay. Surveys always under review",
          "Contenu": "I take surveys and they say they are under review.  I’m honest and take my time threw each one and at the end I don’t get the credit I get under review. I do the whole survey I should get the credit"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C.J. Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T03:57:08.000Z",
          "Titre": "I do not recommend this survey site to…",
          "Contenu": "I do not recommend this survey site to anyone. Every survey is so long and repetitive it's ridiculous I spent two hours on three surveys one of which they told me that they need to review and they'll get back to me later but I should receive credit for it soon. Soon? They say that you do three surveys and you get $5 well I did three surveys it took me over 2 hours and I got nothing except for an invitation to take more surveys and them telling me that they'll give me credit for the ones I've already taken soon they do not pay the same day because you cannot earn enough credits the same day to even cash out you would not have enough hours in the day to do the surveys like I said the surveys are so long and repetitive it's ridiculous one hour for one survey and no credit!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colleen Trommer",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T17:47:43.000Z",
          "Titre": "Finish a survey after 30 minutes only it's in review  with no credit",
          "Contenu": "They used to pay me for the surveys and the time I  spent. Cashed out quite a few times. But last few months I am in \"review\". Took me 2 months to  cash out again. I  have another list of surveys \"in review\". I play by the rules. Run as fast as you can. QMEE Actually pays you if you get disqualified. At least they appreciate the time wasted."
        },
        {
          "Note": 2,
          "Lieu": "TZ",
          "Pseudo": "Brian Mpembeni",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T21:19:40.000Z",
          "Titre": "I'm just disappointed that earn hause…",
          "Contenu": "I'm just disappointed that earn hause is only special for people in the united states"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jimmy neutron",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T02:06:17.000Z",
          "Titre": "So many of the surveys that are new…",
          "Contenu": "So many of the surveys that are new they automatically go to the aww shucks page obviously they are not vallidated"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesse Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T00:11:29.000Z",
          "Titre": "Payouts on weekends and surveys don't seam to work well or get attention they blame on the actual survey company for problems  need put more attention to the folks taking these surveys",
          "Contenu": "I been waiting more 3 hrs for my payout I need that money And you tell me it's up to 3 party survivors your the one selling us on making $25 per day so far not even close and now we have sit and wait for something that takes seconds weekends are no excuse  if you can't operate proper during weekends then shut down till weekday folks need their money not excuses"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Minerva Mendoza",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T17:28:53.000Z",
          "Titre": "WRONG REDEEM OPTION!",
          "Contenu": "I chose the option to redeem to my debit card and it sent me to redeem to my bank account?? Now I have to wait 4-5 days!👎🏼😠"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C Hall",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T23:13:39.000Z",
          "Titre": "I don't appreciate the vendor taking or…",
          "Contenu": "I don't appreciate the vendor taking or being allowed to take any part of what I'm able to redeem . It's a meager amount already."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerrilynn Bullard",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:15:34.000Z",
          "Titre": "They make it very hard for you to earn…",
          "Contenu": "They make it very hard for you to earn extra cash on these surveys that barely pay. Then have nerve to charge a dollar to cash out your money. Also, I didn't like the fact that they have pay pal but wouldn't allow to transfer my money to my Pay Pal, very misleading."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan Williams",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T03:06:04.000Z",
          "Titre": "Earn Haus",
          "Contenu": "The site seems like a good Idea. But my expirence is that you end up selecting a survey only to go thru a 5 or 10 minute exercise with each survey to find out that 70 percent or better don't select you. It's not even wrong that most of the surveys I was shown were 75 cents or less and were between 10 to 20 minutes to take. Again this is my expirence! So just beware. You'll probably will find this out yourself in the first cpuple of hours."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mandy Sanford",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T01:04:08.000Z",
          "Titre": "I have started several surveys that I…",
          "Contenu": "I have started several surveys that I am not qualified for which I understand. If it happens occasionally, no big deal. However I've answered a few questions on 8 or 9 surveys today and didn't get anything for any of them except the offer of another survey. I am trying to earn money doing this and only wasted time here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Leyva",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T13:59:24.000Z",
          "Titre": "Feels like a scam",
          "Contenu": "First I responded to a marketing email where earn haus offered $25 surveys which is NOT the case. Then I decided to try it out anyways n kept getting surveys that after I passed the qualifying survey into the actual survey they kicked me out right before getting credit for it. THEN after it taking forever doing $1.00 - .50 cent surveys to earn enough to total $5, it took 25 mins of TRYING to verify my identity (I took the picture of my license but blocked off my license number because they don't need it to prove I am who I say I am) to redeem it. Next they prompted me to scan the barcode on the back of my license, again INSISTING on getting my license number. I verified my identity, I just wont give them that. Seems scammy to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Melinda",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T22:15:36.000Z",
          "Titre": "When I got very close to my \"Redeem\"…",
          "Contenu": "When I got very close to my \"Redeem\" amount, the surveys starting disqualifying me. When I finally reached my $5, it took me another 20 minutes of answering the same questions over and over. After that, then I had to verify my PayPal and then my identity!! After 35 minutes I'm down to $0 again and my reward isn't available.  I doubt I continue to use this survet sight."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen J.",
          "Nb_Reviews": 5,
          "Date": "2023-10-07T13:46:53.000Z",
          "Titre": "The first two surveys rewarded at least…",
          "Contenu": "The first two surveys rewarded at least a dollar. Thereafter the surveys required signing up for benefits or paying to join a site. The rewarded surveys only paid a small token of twenty cents or so. And we're lengthy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jojo",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T00:18:39.000Z",
          "Titre": "It’s ok they do pay quickly but surveys…",
          "Contenu": "It’s ok they do pay quickly but surveys are to low paying they should be double it’s a shame how they pay us so little and make a fortune off us"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracey West",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T06:23:01.000Z",
          "Titre": "Too much hassle",
          "Contenu": "One thing that I don't like about this company is the excessive number  of spam/telemarketer calls I received after taking surveys. Another think that I don't like is having to answer questions to see if you qualify, and then having to answer them again as part of the survey. I also don't like all of the recommended partner sites that you are routed to.Lastly, I do not like that you cannot receive your payout, without uploading your ID, and taking a picture on the webcam. I guess I won't be getting paid for my time and opinion, as I am not comfortable uploading my ID"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Godric H",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T16:43:20.000Z",
          "Titre": "a bit of a bait and switch",
          "Contenu": "In order to take a survey, you have to agree to sign up for a free trial of whatever product is listed.  Seems to be just a sales pitch.EDIT> I was contacted about my experience and they explained more of the process in detail.  I will be glad to update my original review if things workout better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Billy Votaw",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T12:39:54.000Z",
          "Titre": "Lots of scam surveys that take your…",
          "Contenu": "Lots of scam surveys that take your info and after you answer the questions find a way to not pay you. So far this is a waste of time.Edit: yes I did cash out the 6 dollars it took me over four hours to get after getting ripped off for work I’ve done.  You fail to mention that in your response. I did email.  I didn’t get help, I got excuses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Jarmon",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T01:26:30.000Z",
          "Titre": "Not what they say it is",
          "Contenu": "Basically I've been doing surveys for a couple of weeks and like others, after spending 30 minutes of answering the same questions over and over, then it goes into review. I've read the companies responses about that being an industry wide way of doing things but I beg to differ. Been retired for a year and have been doing this for several other survey companies and I've never ran into that. Seems like a way for some companies to get free opinions. Pretty much done with this survey site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Keeney",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T04:24:05.000Z",
          "Titre": "Takes about 15 minutes to find a survey…",
          "Contenu": "Takes about 15 minutes to find a survey and if you find one your lucky to collect any money for completing. i SAY ABOUT 50% of the time your cut off. No good site. Waste of time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "April",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T06:25:39.000Z",
          "Titre": "Everytime I get close to the cash out…",
          "Contenu": "Everytime I get close to the cash out limit every survey recirculates showing that ...\"AH SHUCKS \" ITS SET UP TO SLOW OUR CREDITS. I MEAN IN ALL REALITY IVE ALREADY DONE COMPLETED VARIOUS SURVEYS AND THEN THE VERY LAST QUESTION IT STATES THE SURVEY WASNT A MATCH ...WHAT A CROCK !!! FALSE ADVERTISING IS A FAD THESE DAYS!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Evan",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T00:31:18.000Z",
          "Titre": "GREAT CONCEPT, NEEDS A LIL MORE WORK..",
          "Contenu": "A lot of the surveys weren't available and I had to contact customer support numerous times to see what was going on. I had to provide proof although they're supposed to have access to everything we do via their site. A lot of the surveys had me answering the same question multiple times and taking a lot longer than the survey said it would, then after all that, I was kicked off the survey without any compensation. They did, however, send what I did accumulate to my Paypal account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Kellum",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T10:26:13.000Z",
          "Titre": "FRUSTRATING",
          "Contenu": "WAY too many times I do nearly an entire survey (and I ACTUALLY do them) just to suddenly get my own opinion wrong (??!?) and get redirected to the \"Aw, shucks\" screen. Most recently I completed approximately 12 minutes of a 17-minute survey. And because I answered one question APPARENTLY wrong, regarding my influence in the decision-making at my current job, then I am disqualified and get ZERO credit. And this happens 80% of the time. I am not qualified to answer 80% of the surveys on this site REGARDING MY OWN PERSONAL OPINION.I have yet to reach the $5 minimum to cash out, so the legitimacy of this site is still undetermined."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Tiffany Parris",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:56:31.000Z",
          "Titre": "I don't really know why I'm not getting…",
          "Contenu": "I don't really know why I'm not getting access to any surveys"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bettyjo Deslauries",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T00:26:41.000Z",
          "Titre": "Im Quite upset that I have done 27…",
          "Contenu": "Im Quite upset that I have done 27 other surveys n I have not yet got any payment for them, I guess u have to review them but it's been a long time for them to be reviewed n I still haven't got anything from doing them n I am upset that I keep getting kicked off or out of the ones that I almost finish n it sends me to starting over but not receiving anything for the ones I did almost complete before kicking me out. Not right when I have been so very honest"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ilana",
          "Nb_Reviews": 8,
          "Date": "2022-10-31T01:46:58.000Z",
          "Titre": "Disgraceful the advantage this company…",
          "Contenu": "Disgraceful the advantage this company is taking over us. I currently have 12 completed surveys in review and nothing to show for it. I know this is not acceptable because no other company like this that I work with does the type of \"review process\" that's done at Earn Haus and they use the same survey providers as the other companies I work with.  Despicable way to treat people. Customer service is non responsive. They do not even follow their own written policies. I give 2 stars for the payment of completed surveys I did get and the way in which it is done. But after a few $5 payments all went straight downhill."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keno Brooks",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T17:11:03.000Z",
          "Titre": "Site is ok",
          "Contenu": "Site is ok, but on alot of survey's it lets you complete the whole survey to tell you didnt qualify. Currently i have 16 under review, are they put under review to keep from payin out?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dwayne Jones",
          "Nb_Reviews": 2,
          "Date": "2022-10-30T12:58:41.000Z",
          "Titre": "The surveys are wayyy too long",
          "Contenu": "The surveys are wayyy too long, why dont they at least give us an estimate of how long the survey will be. I’ve sat here and spent, literally, 2 hours on ONE survey. Thats inexcusable. How much information do you guys need?!?!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ilana",
          "Nb_Reviews": 8,
          "Date": "2022-10-30T23:52:18.000Z",
          "Titre": "Immediate payout",
          "Contenu": "I like the website design. It's easy to navigate. Not a lot of unnecessary information. But in the end the are not on our side. I'm not too sure what scam they are pulling here but something isn't right. My advice is do not waste your time here. They will inappropriately place your payment on hold for complete surveys. And never respond to your feedback."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T18:49:05.000Z",
          "Titre": "Took forever to make $5 and then was…",
          "Contenu": "Took forever to make $5 and then was charged a dollar vendor fee for under $10."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan T Schmit",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T04:41:46.000Z",
          "Titre": "2 of my surveys are under review and it…",
          "Contenu": "2 of my surveys are under review and it said very clearly that by February 28 they would resolve the issue. Here we are nearly February 29 and nothing has been resolved. That is a downright lie and lies are no fkn good!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bernadette Monetude",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T15:17:40.000Z",
          "Titre": "…Surveys continue to end frequently",
          "Contenu": "The surveys are not completing through the end.  Its too many kick backs after I spend 20 minutes of my time to find out im kicked out.  I understand it happening some time but back to back becomes frustrating and I feel I am wasting my time.  Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "vernon Alexander",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T17:56:16.000Z",
          "Titre": "I keep taking surveys and then they…",
          "Contenu": "I keep taking surveys and then they goes oh shucks what’s going on. I thought the whole opposite of this website for me to be able to take several days and are in some type of revenue from it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin Centeno",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T17:38:10.000Z",
          "Titre": "It seems as though every survey is…",
          "Contenu": "It seems as though every survey is either full or I didn't make the requirements.Tried over 10 surveys and not but 1 was I able to actually complete."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dell McCarroll",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T09:30:31.000Z",
          "Titre": "Verification…",
          "Contenu": "I wasn't able to cashout and getting support from your team was not normal it was task just to find out where your support team could be found?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tanner",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T03:55:45.000Z",
          "Titre": "More bs",
          "Contenu": "More bs. I click on a ten minute survey and end up getting redirected to 4 different surveys that total 30 mins plus"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aline Selph",
          "Nb_Reviews": 5,
          "Date": "2022-10-06T17:13:14.000Z",
          "Titre": "First joined three days ago",
          "Contenu": "First joined three days ago, got the first three surveys pretty fast. Took couple hours for fourth survey to complete. It's been three days and cannot get another survey. Try constantly, is this normal?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T06:37:06.000Z",
          "Titre": "Why would I PAY YOU?!",
          "Contenu": "They have entirely too many options that require a person to order and PAY for a product, the whole point of doing this is to MAKE money, not pay out!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael van Vuuren",
          "Nb_Reviews": 10,
          "Date": "2023-05-11T03:32:46.000Z",
          "Titre": "started out strong now generally it stinks",
          "Contenu": "At first, it was easy. the surveys went along fineNow, it's like every survey never gets past screeningor worse I get 90% through and it kicks me out which means I have wasted 20 -30 minutes for absolutely nothing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julian",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T15:05:20.000Z",
          "Titre": "I still have survey's under review",
          "Contenu": "I still have survey's under review, And a lot of these high payout survey's it seems I can never qualify for when I fill in my personal info."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Rodriguez Jr",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T05:44:30.000Z",
          "Titre": "I processed a reward for 6 dollars to…",
          "Contenu": "I processed a reward for 6 dollars to my Venmo but when I clicked link to verify the money never showed up when after I verified my identity"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teresa Culpepper",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T11:12:48.000Z",
          "Titre": "Surveys are ridiculous and over half of…",
          "Contenu": "Surveys are ridiculous and over half of them don't payout it started out great but turned sour"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clayton Waters",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T17:14:56.000Z",
          "Titre": "All the surveys keep rejecting me them…",
          "Contenu": "All the surveys keep rejecting me them I have over 2 months of surveys do not process yet ridiculous."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EBONY Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T05:06:05.000Z",
          "Titre": "I am very displeased with this service and the survey reviewers",
          "Contenu": "I'm very displeased with this service or company to the point where I am seconds from just deleting/unsubscribing from it all together. I have a problem with the fact that they will sucker you in to doing a survey for a particular price and then all of a sudden it kicks you out of that specific survey and boots you to a survey that is much longer and gives you way less pay. Or how about when they don't pay you immediately after taking a survey and they say they are reviewing it further, then nothing else is ever heard about the survey or that money so I count that as my time being wasted and it aggravates me terribly. I have never received any money from a survey that has went to review and I have at the least 30+ surveys in review right now so like I said that is a big waste of my time. I believe there needs to be a better understanding of how money is earned and the way the surveys are reviewed also a reason as to why exactly the surveys were not accepted to receive the aloted pay."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "The Surgeon",
          "Nb_Reviews": 3,
          "Date": "2023-04-10T00:27:22.000Z",
          "Titre": "I've been trying to earn some cash but…",
          "Contenu": "I've been trying to earn some cash but this site will let you start a survey then send you to another and then another and by the time you finish you're 3 sites away and there is no accountability for earn haus to pay anymore."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T01:26:07.000Z",
          "Titre": "Qualification process sucks especially…",
          "Contenu": "Qualification process sucks especially when its a long one without any compensation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Buddy Taylor",
          "Nb_Reviews": 3,
          "Date": "2023-02-28T13:45:59.000Z",
          "Titre": "My surveys that are under review are…",
          "Contenu": "My surveys that are under review are pass time . If you don't mind working for nothing have at it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T06:55:56.000Z",
          "Titre": "You waste most of your time answering…",
          "Contenu": "You waste most of your time answering questions just to be told you don't qualify for the survey. Big waste of time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brenda Moses",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T22:13:58.000Z",
          "Titre": "I didn't get paid for 3 surveys and it…",
          "Contenu": "I didn't get paid for 3 surveys and it took to long for me to cash out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ynottaking Shitt",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T07:05:42.000Z",
          "Titre": "I'm not getting credit for the surveys…",
          "Contenu": "I'm not getting credit for the surveys I'm doing nor is it popping"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T18:00:32.000Z",
          "Titre": "Redeem",
          "Contenu": "Had to wait till got 5.00 to redeem and not a lot of surveys available to get to 5.00 then not sure when will be in my account"
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T16:32:20.000Z",
          "Titre": "I lost my balance in redemption",
          "Contenu": "I lost my balance in redemption. Supposed to go to PayPal. I got 0"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Montrice Brandley",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T04:31:08.000Z",
          "Titre": "I have been doing survey for earn haus…and then almost all the surveys I have done are in review if it ain't the review it's I don't qualify go to review, then",
          "Contenu": "I have been doing survey for earn haus for almost 2 months and I only got 5 or 6 paid surveys and I haven't gotten any more I love these surveys and I love earn haus but I think I'm just going to unsubscribe from it because it doesn't do as the ad/advertising and then the other surveys or still under review and they been under the review since around the 13 of February. I referred this app to my family but I don't think this is a good idea because you can't get through a survey and if you do it goes in review can you please help me understand"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "andy mathis",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T23:11:39.000Z",
          "Titre": "Every survey I've took has declined me…",
          "Contenu": "Every survey I've took has declined me I've been 100% honest with the questions"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicole Hall",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T04:02:07.000Z",
          "Titre": "I received an email stating that $5.57…",
          "Contenu": "I received an email stating that $5.57 had been sent but I never received it and it has been well over 15 minutes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yip Sena",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T08:23:51.000Z",
          "Titre": "attention , ''support'' , ''president''  and large partners of ''Earn Haus''",
          "Contenu": "Everything seems fine to me, except for the idea that I have to give my ID to be able to redeem, I don't trust the internet to use my personal data such as ID, passport or driver's license, our identities are always leaked, and we end up losing more for less, to be honest in my personal idea, I invite you to the support of **Earn Haus** to pay attention and evaluate my opinion, for users who have the same opinion do not remain silent the more you talk about your ideas, the more attention we have , thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dmicheal Couvson",
          "Nb_Reviews": 7,
          "Date": "2023-05-28T22:51:30.000Z",
          "Titre": "Kept getting denied from surveys and…",
          "Contenu": "Kept getting denied from surveys and surveys ran out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "IamIbe Kim Meonly",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T21:53:45.000Z",
          "Titre": "This process",
          "Contenu": "Well so far I have six pending but the two three hours that I have spent doing several others just to be told that I do not qualify for them and I have already answered many questions I don't like that I think there should be some type of payment if I go through the process not just be told that I've spent 2 hours doing certain surveys and at the end of them they tell me I do not qualify but I have answered all of them"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "April",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T17:07:36.000Z",
          "Titre": "Misleading",
          "Contenu": "They gave me my first payout pretty quickly but after that I have received nothing. I have one survey left to complete to get $10. After completing surveys it’ll say they have to be verified or that I wasn’t selected for that survey. There is no way to track verification on completed surveys so I have no way of keeping up with what I’ve completed but haven’t been rewarded for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "The One",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T23:54:08.000Z",
          "Titre": "ITS TRASH",
          "Contenu": "ITS TRASH Ya it worked but it takes forever for you to be able to cashout because most of the surveys just say you dont wualify...DUMBEST  CRAP IVE EVER HEARD. They are surveys ANYONE and EVERYONE should be able to apply for ANY surveys and they shouldnt have to take a whole 20 minutes to do them. THATS WHY NOBODY EVER DOES THEM! They take to long and for to low of a price"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim Osborn",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T03:21:56.000Z",
          "Titre": "I am not getting to many surveys."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna Wheeler",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T05:05:30.000Z",
          "Titre": "getting about halfway through a survey…",
          "Contenu": "getting about halfway through a survey then get booted out. I understand that some surveys they want certain participates but it is literally like I get to do 1 survey out of like 10 will probably be deleting this survey app the only thing i have gotten from it so far is frustrated"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cathleen Addison Addison",
          "Nb_Reviews": 5,
          "Date": "2022-08-31T17:42:35.000Z",
          "Titre": "Well,another update,keep having…",
          "Contenu": "Well,another update,keep having problems with the surveys stopping in the middle, not getting credit for finished surveys,still going thru about 25,before qualified,when brought to Earn Haus attention, with screen shots,was basically told,not their problem! WOW!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Milton jr",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T17:39:22.000Z",
          "Titre": "Some survey take way to long to be…",
          "Contenu": "Some survey take way to long to be reviewed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "April Mosley",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T22:33:55.000Z",
          "Titre": "I never got paid",
          "Contenu": "I never got paid. It would be a lot nice if some are easy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 3,
          "Date": "2022-07-12T20:51:54.000Z",
          "Titre": "I once started a survey at 10:30am and…",
          "Contenu": "I once started a survey at 10:30am and didn't complete it until 9:41pm just to complete 3 surveys if survey's are to match my profile why does it take almost 12 hours to complete 3 surveys on your platform especially if there supposed to match my profile?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Derrick L. Hawkins",
          "Nb_Reviews": 6,
          "Date": "2022-06-15T18:23:46.000Z",
          "Titre": "An ok place except in surveys they word…",
          "Contenu": "An ok place except in surveys they word questions differently so you might be self employed on one an on others you are working full-time.  Some surveys will flag that and suddenly you don't qualify for many surveys or are disqualified after completing the survey for 'code of conduct' issues. Sometimes for completing sooner than they think you should. Most of us read faster than ten words a minute.UPDATE: I do not know what account you are looking at but i have only redeemed 41.87 so far!UPDATE: interesting response. thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Riddell",
          "Nb_Reviews": 5,
          "Date": "2022-09-04T13:53:44.000Z",
          "Titre": "Last night I used the site for the…",
          "Contenu": "Last night I used the site for the first time in several weeks. I completed 3 surveys and was only created for one. Now it won't let me do another survey. Nothing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charysse",
          "Nb_Reviews": 5,
          "Date": "2022-08-21T19:48:16.000Z",
          "Titre": "I have only been on this site for a few…",
          "Contenu": "I have only been on this site for a few days, managed to reach 5 dollars only to be temporary block for a code error, whatever that is.  Going back to my regular survey sites."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C Howard",
          "Nb_Reviews": 2,
          "Date": "2022-03-07T20:22:47.000Z",
          "Titre": "DID NOT RECEIVE REWARD",
          "Contenu": "For the most part I like this survey site, and I use it just about every day.  What I do not like is when I complete a survey for almost 30 minutes or so and do not get my reward.  I just completed this survey that required me to sign up for this website, \"My Financial Path Community\".  If I did not sign up for that website I would probably not get the reward.  Well I did sign up and I did NOT get the reward.  It was the 2nd time today that I have had to sign up for something.  Last time I did get the reward, but this time I did not.  It is not FAIR at all, you ll really need to check this!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leah Preston",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T21:37:55.000Z",
          "Titre": "Well I loved the fact that I got thru…",
          "Contenu": "Well I loved the fact that I got thru the 5 surveys, somewhat easily, only after being \"disqualified\" for about 15-20 surveys, I finally reached my $10 goal. Yes, it's true I received the $10 within 1-2 minutes to my paypal. GREAT, that made me happy. Well now I want to continue doing surveys on this site, and everytime I get halfway thru one, a screen pops up saying answers are being looked thru??? Whatever that's supposed to mean. I am as honest as I can be doing these surveys, I received a measly $10 and now can't do or get thru any surveys. I guess my opinion doesn't matter, and now I believe that this site is a joke! Since I've home from the grocery store, I've been trying to complete just ONE survey and I can't.  So not only have I wasted A LOT of time, I don't get any compensation for doing so, like the other survey sites."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Riddell",
          "Nb_Reviews": 4,
          "Date": "2022-04-26T19:36:29.106Z",
          "Titre": "I just completed a survey but it didn't…",
          "Contenu": "I just completed a survey but it didn't direct me back to my account and when I logged back in I didn't receive credit. This is the third time that I haven't received credit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Evelyn Gaston",
          "Nb_Reviews": 8,
          "Date": "2022-07-25T22:22:30.000Z",
          "Titre": "Funny how i was able to cash out once…",
          "Contenu": "Funny how i was able to cash out once but lately i have been trying to do more surveys and i cant redeem any so whats going on?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T00:07:57.000Z",
          "Titre": "I was very excited to sign up for this…",
          "Contenu": "I was very excited to sign up for this site. Surveys were easy to answer and were relevant to me. After cashing out $10. I noticed a huge decline in surveys! And the ones I did do, I would get all the way to the end and hit submit, and instead of getting a reward it said it wasn’t a good fit. How?? I completed the whole long survey!!! I can see why others are frustrated as well. I thought this was going to be a good site to earn a little pocket change because believe me no one gets rich doing surveys but the little bit does help out. Hopefully they will correct this issue or a lot of people will be leaving their site for others where they can actually get rewarded for their time. Do better Earn Haus!!! Make your site as great as we all know it can be. Don’t get peoples hopes up of actually finding a good site, only to be let down!! Once I see a change, I will be very glad to change my review!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher D. Spurling",
          "Nb_Reviews": 8,
          "Date": "2022-01-17T18:43:55.000Z",
          "Titre": "Had to rewrite my review for this…",
          "Contenu": "Had to rewrite my review for this company, at first they seemed ok, I'd do their surveys and yes get paid for them.  But now all of a sudden I'm doing their I'll do surveys answer 75 to 100 or more questions and the survey will end sometimes saying succeeded and then it'll bring me back to the earn haus page and they will say this survey wasn't a great match after answering close to a 100 questions, kinda feels like they are having you complete 3rd party surveys then not paying you, 2ndly I get 1 away  from cashing out and they say they have no more surveys available for you at this time, yet they just sent an email saying they have over 100+ surveys just added which comes after multiple emails saying they added surveys some of these emails saying upto 454 new surveys.  It seems to me they are trying to get paid and not pay the people actually doing all the hard work for them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris engen",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T17:37:48.000Z",
          "Titre": "I just  cash out  5 dollars 2 hours ago…",
          "Contenu": "I just  cash out  5 dollars 2 hours ago and I  haven't gotten it used to be instantly what happened??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 3,
          "Date": "2022-03-29T02:54:32.000Z",
          "Titre": "Some of their surveys keep kicking me…",
          "Contenu": "Some of their surveys keep kicking me out, and it's getting very annoying. They need to get their house in order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Jones",
          "Nb_Reviews": 2,
          "Date": "2022-02-19T23:54:52.000Z",
          "Titre": "I’ve done 200 surveys that on the last…",
          "Contenu": "I’ve done 200 surveys that on the last page they disqualified me as I clicked finish button, I’m done with this. Bulls**T"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Courtney Wohner",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T04:04:33.000Z",
          "Titre": "Temporary satisfaction and fulfillment of promises...",
          "Contenu": "The idea of quick, accurate, and painless redemption of participants willingness to provide their time, energy, and honest feedback is honorable. My experience started off with promising momentum. As I continue to participate in taking timely surveys I am experiencing increased efforts to stall or \"review\" my answers rather than maintaining consist redemption of rewards. After my first redemption I am getting a lot of messages that read along the lines of \"We are reviewing your answers. This is perfectly normal\". I have no way to gage my progress toward redemption all while my answers/valuable data have already benefited the 3rd party. This all happened AFTER my first redemption. Stalling and reviewing to me seems more of a way to maintain collection of data without paying out the promised rewards. In turn, thus equals to the exact same hassle of every other \"legit\" survey site exhibits. It would be most impressive if the reviewing of data would stop.There is nothing to review...if there were indiscretions in my answers then the survey should've (like most) kicked me out or disqualified me. If a survey is completed then the immediate award should reflect. I have provided valuable data as a show of good faith that the company will honor them rather than pulling stunts that only conform this company to be like every other that offers false pretense and empty promises."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "L Gomez",
          "Nb_Reviews": 2,
          "Date": "2022-07-04T12:52:15.000Z",
          "Titre": "App makes it impossible to get any…",
          "Contenu": "App makes it impossible to get any surveys so that I can make money. Big disappointment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna Tyree",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T13:33:24.330Z",
          "Titre": "Have been cheated out of almost…",
          "Contenu": "Have been cheated out of almost COMPLETE SURVEYS and then no credit for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Jines sr",
          "Nb_Reviews": 6,
          "Date": "2023-07-15T20:05:17.000Z",
          "Titre": "dsff ff ff fff ff"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley Meadows",
          "Nb_Reviews": 3,
          "Date": "2022-04-21T09:40:15.239Z",
          "Titre": "Finish a survey just to find out your…",
          "Contenu": "Finish a survey just to find out your not match"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mmg",
          "Nb_Reviews": 3,
          "Date": "2022-07-30T17:48:33.000Z",
          "Titre": "Took a long time to accumulate"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandrea McCrea",
          "Nb_Reviews": 21,
          "Date": "2022-04-04T00:53:41.000Z",
          "Titre": "Spent over an hour or two surveys and was never paid",
          "Contenu": "This site is normally a good site when you need to get quick money fast because they pay out immediately which is good. Early this morning this morning I did two surveys the first survey was on electronics and I wasn't provided with the survey number because after I was not qualified for one survey it automatically directed me to that survey it was supposed to take 40 minutes so I don't know what the pay was but I figured 40 minutes while it probably pays about $2 the survey had some kind of glitches where the server was slow and it took a while to get to the next question after it would get to the next question it would do it again some questions went through smoothly at the end of the surveying it said could not be connected to server I waited I refreshed and I sent it on again and it says your answers have already been sent but I was never compensated for that survey which took an hour the next survey I did with on alcoholic beverages it was supposed to take 14 minutes 10 to 12 minutes into the survey it booted me out and said that I did not qualify for the survey thing that's not the first time it happened but it's the last time that it would happen for me I would like to be compensated for those two surveys and from now on I believe that this site should let you know at least 1/4 of the way into the survey whether or not you qualify don't get all of my answers and then right before the survey is to end in Pay tell me that I don't qualify like I said I am generally happy with this site but not today. Later on today I went back to the site to try to complete some more surveys as times are hard these days I just spent 10 minutes completing a 10-minute survey that got to the point where it ask me what my race was to verify my income for my family they only paid $0.60 I guess what happened after I completed the survey it said this survey is not a good thing I don't know what is wrong with this website but they are getting people's opinions for free paying them either cents on the dollar a Pang of nothing at all which is been my experience with the last three so I thought maybe the first two times was just a glitch but now I know they are basically stealing from people"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Browning",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:08:08.000Z",
          "Titre": "This site is okay...nothing phenomenal",
          "Contenu": "This site is okay...nothing phenomenal.  What really makea me mad is the fact that not only does it take forever to hit the 5$ minimum cash out fee, they now charge you a 1$ processing fee on top of it.   Ridiculous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lauren Clark",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:01:07.000Z",
          "Titre": "Speed Of CashOut",
          "Contenu": "So, for the first cash out, I did not receive the payment in my Venmo account, which is why I switched to Direct Deposit, which shouldn't take 2-4 days to pull through."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Mack",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:10:05.000Z",
          "Titre": "They pay fairly well and fast but their…",
          "Contenu": "They pay fairly well and fast but their site needs work. Even if you're not accepted for a survey it remains in the list and you will accidentally click it again. There are several surveys that have asked things like what water company I use and there's not even one listed for my state. You can refresh the page and nothing changes, all of the same surveys are there even the ones you have been disqualified for. It's not a bad sign but as mentioned it needs some work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kasey Brough",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T05:59:09.000Z",
          "Titre": "It took a while to get the money and…",
          "Contenu": "It took a while to get the money and also you took a whole $1 over my total was less than $10?!?! Especially after I literally fought with your site all damn day just to be able to complete 1survey?! Like seriously I absolutely made nothing today because y’all couldn’t get it together."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T03:33:28.000Z",
          "Titre": "I do not like that I am offered surveys and then not compensated for my time or answers",
          "Contenu": "I do not like that I am offered surveys and when I click them and take time with them just to be denied. My time is just as important as yours and should be compensated for the time and information I provide."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Still Want To Fuck With Me",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T12:02:40.000Z",
          "Titre": "Huge Problem With Survey Links",
          "Contenu": "The problem with this app is after 3 payouts, it gets hard to get any surveys at all... almost every survey you click on, sends you to a dead link...you could spend hours just trying to get a survey!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg Collins",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T03:56:41.000Z",
          "Titre": "Willing but Frustrated!",
          "Contenu": "I enjoyed taking the surveys but what I didn't like the fact that it took forever to earn the money. Over and over I would start a survey only to get into it and then kicked off..try another survey...this went on for hours. I just don't understand what the problem is."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Gomes",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:47:48.000Z",
          "Titre": "Not sure if it’s worth my time",
          "Contenu": "I didn’t like that you never said in the beginning you needed to have at least $5 to cash out then when I got to $5.24 another condition was charging me a $1 fee if less than $10.  Also I spent hours doing surveys and made $10.24 not sure if it’s worth my time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jo Milholen",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T22:11:19.000Z",
          "Titre": "I didn't really care for the identity verification process.",
          "Contenu": "I didn't really care for the identity verification process. But if it is necessary for whatever laws or guidelines surround online survey cash outs, then fine. I prefer the way the online gaming apps that pay cash operate, such as playtime or rewarded play."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Kertes",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T20:23:53.000Z",
          "Titre": "Earn Haus review",
          "Contenu": "Cashing out is quick and easy. Only downside I have experienced is that lately I have been getting kicked out of a lot of the surveys I have started. I'm not sure why this is and it's starting to get really aggravating!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T07:03:02.000Z",
          "Titre": "I made money doing surveys on earnhaus.com",
          "Contenu": "Second update: Just got through taking a survey that took a bit to finish (a survey on specific brand cookies, flavors, and pricing) and was not paid. Update: Took off one star, since after earning a little over $5, and cashing out, the other Surveys are being held for review or you go through the surveys and then don’t qualify for the review. I don’t want to spend a lot of time completing surveys and getting nothing. I made money doing surveys on earnhaus.com.  I've tried getting money answering surveys on Inbox Dollars and Swagbucks, but got nowhere.  Earnhaus.com is different.  I was able to cash out over $5 today pretty quickly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T00:53:04.000Z",
          "Titre": "It would be nice if I could do more…",
          "Contenu": "It would be nice if I could do more studies. The screening process often is redundent, asking the same questions 3 or 4 times. The information should be able to be populated onward to save some time to decide if someones eligible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Erica Bauman",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T01:45:11.000Z",
          "Titre": "Surveys are great but what I'm running…",
          "Contenu": "Surveys are great but what I'm running into is after doing a few there will be a lot that say I don't qualify. Almost hard to get the bigger paying ones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S. Washington",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T14:31:48.000Z",
          "Titre": "I have 8 surveys I have done being…",
          "Contenu": "I have 8 surveys I have done being reviewed, which I don't mind but if I'm taking my time to do these surveys, I think they should pick up the pace in reviewing my surveys. I have one survey I did 17 days ago and it's still being reviewed, other than that it's been okay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Naz",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T08:36:30.000Z",
          "Titre": "After you work so hard on a survey for…",
          "Contenu": "After you work so hard on a survey for you not received any credit for it. That really sucks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T09:13:52.000Z",
          "Titre": "I get email telling me there are all…",
          "Contenu": "I get email telling me there are all these new surveys and can't even take any as it goes to aw shucks let's take another survey without even getting to first page to see if I qualify.Also quite often I click on a survey and all it does is refresh the page.Cannot earn money that is important to me at this time as my income is very limited."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Mcmaster",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:39:51.000Z",
          "Titre": "Your surveys were veeexperiery repetitive",
          "Contenu": "Your surveys were very repetitive. I did not qualify for more then I did qualify for. The pay is reasonable for the time spent on surveys but I found it difficult to redeem funds the first time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ruth Baumgardner",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T04:49:40.000Z",
          "Titre": "This site is a lot more professional…",
          "Contenu": "This site is a lot more professional than most others. There are always surveys to take providing you are honest and genuine with your answers. You should take them serious as the data collected is for a real company. The prices aren't always fair as far as the length and difficulty of the surveys though. Also it seems you get disqualified if you dont spend a predetermined amount of time on one question before answering. That's unreasonable bc not everyone reads at the same pace and finishing quickly shouldn't discredit your answers. I also find it unfair that sometimes you won't get a reward bc you are under review. Only to never get an answer as to why they let you finish but then didnt keep up their end of the deal so to speak. Not all of the companies they work with dk this but quite a few. I feel like that's what gives the negative aspects to the site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elect Lady Toi Gray",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T21:50:49.000Z",
          "Titre": "I love this app",
          "Contenu": "I love this app! I finally found an app who pays actual money that can be cashed out at just $5. REVISED: I’m quickly finding that after the first payment I can’t find surveys that I qualify for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tiffany Smith",
          "Nb_Reviews": 4,
          "Date": "2023-09-10T20:02:10.000Z",
          "Titre": "They really do payout",
          "Contenu": "They really do payout. I've redeemed to paypal a few times since signing up a few months back. I wish the surveys didn't disqualify you so much. Also some of the surveys are extremely timely"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abigail Hicks",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T00:21:42.000Z",
          "Titre": "I can get into some surveys but mostly can't",
          "Contenu": "I can get into some surveys. However more often than not I keep getting the message that they couldn't find one I was qualified for . This gets frustrating as I'm just trying to make a few extra bucks a week so I can afford to live"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Eggers",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T06:26:42.000Z",
          "Titre": "You pay way too little on surveys",
          "Contenu": "You pay way too little on surveys. I click on an email and get asked all these questions before the survey and then the survey I take is not the one in the email.When you pay less than a dollar for 10 minutes I don't think you want my opinion. Time and answers are valuable and should be paid appropriately."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kay Wills",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T22:00:36.000Z",
          "Titre": "The survey's do payout once you get…",
          "Contenu": "The survey's do payout once you get one! Once you get a survey its worth about .20 so just guess how many of those you get between 80% being immediate turn downs. If you've got infinite patience & absolutely no life this is for you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcus",
          "Nb_Reviews": 4,
          "Date": "2022-09-12T23:40:53.000Z",
          "Titre": "Earnhaus so what can I do when I…",
          "Contenu": "Earnhaus so what can I do when I complete a survey and get a survey under review text even though it'll be like 3 weeks without getting credited. Because about 6 of my surveys have been under review in the past week and I haven't heard or received anything!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristy Willis",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T19:17:11.000Z",
          "Titre": "A little frustrated",
          "Contenu": "The first day I was able to take surveys and I even got to cash out to my PayPal, but the second time I went on there to take surveys wasn’t as promising! Every survey I try to take tells me I’m not a good fit try a different one & it keeps telling me that! Plus I have 5 surveys under review and it says if I get paid for them it won’t be until the end of may!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Winter Brown",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T13:27:29.000Z",
          "Titre": "Problems I experienced",
          "Contenu": "I has trouble with verifying my ID it took a whole and once I reached 4.99 the surveys started to let me complete them but then I wasn't receiving credit for them and that took over 6 hours at least to complete a survey without it starting then closing out with the credit to get one to complete and give me tye credit for it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dorothy Blue",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T18:42:45.000Z",
          "Titre": "What I dislike is the fact that you…",
          "Contenu": "What I dislike is the fact that you don’t get paid for surveys that you have spent time completing 75%to 90% because one question towards the end doesn’t pertain to you. You should get paid for all time spent completing a survey."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:18:57.000Z",
          "Titre": "It took me three day to earn just $5…",
          "Contenu": "It took me three day to earn just $5 dollars. From 09/18 through 09/20/2023. The company should not say you can earn X amount in a week it is unattainable. I do however love having my opinion heard and my mind engaged."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T16:11:24.000Z",
          "Titre": "I was able to cash out the first time…",
          "Contenu": "I was able to cash out the first time at 5 dollars but now that I've earned another 5 dollars it won't let me cash out....I keep pushing the redeem button and it does nothing. If they can fix this I would give the 5 stars for sure because the surveys are easy and convienient"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:18:22.000Z",
          "Titre": "I did not care for all the surveys that…",
          "Contenu": "I did not care for all the surveys that were large amount sums, could not be completed or I was not qualified to finished."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doritos",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T02:01:04.000Z",
          "Titre": "First time completing three surveys",
          "Contenu": "First time completing three surveys, I get $5 transferred into account. Second time around, either surveys are still pending for being reviewed or surveys was not a good match for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "tawnya keller",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T17:45:13.000Z",
          "Titre": "I decided to try this site because I…",
          "Contenu": "I decided to try this site because I heard good things until I kept getting disqualified from surveys. They give a list of things but if you don't choose \"the right one\" they disqualify you. They just don't want to pay out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly Garner",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:36:34.000Z",
          "Titre": "Might be a waste of time",
          "Contenu": "Seems like I never qualify for any surveys not matter what I try to do. This might be a huge waste of time but I’m not giving up just yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gemma Gendreau",
          "Nb_Reviews": 7,
          "Date": "2023-08-13T07:34:22.000Z",
          "Titre": "This program needs more surveys that…",
          "Contenu": "This program needs more surveys that you don't have to purchase anything or download anything. The receipt department doesn't work either"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Loretta Jeznach Lynn Lay",
          "Nb_Reviews": 30,
          "Date": "2023-05-18T07:01:39.000Z",
          "Titre": "It's not true when it says that if you…",
          "Contenu": "It's not true when it says that if you take 3 surveys you will have$5 . That's a lie. I've completed numerous surveys and can't get to $5 so don't believe  everything you see people. That's misinformation and should be taken down ...I would love to show you my survey history but chrome won't allow it. I've been signed up with them for more then 3 months and can't make it to $5 so it's all lies"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T13:48:57.000Z",
          "Titre": "Too many times I spend 10-15 minutes…",
          "Contenu": "Too many times I spend 10-15 minutes filling out information to do a 7min surveys for 70 cents"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nanette",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T04:07:00.000Z",
          "Titre": "Needs some work",
          "Contenu": "I really enjoy this site and most surveys, but lately I get to the end of a survey and click to submit, it goes to error page, so all the time I put into a survey and finish it only to get an error page is really aggravating,  so I'm out of those points,  please fix, and the time it takes to review surveys for credit is to long. I still have alot under review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T12:40:49.000Z",
          "Titre": "I dislike how you always get kicked off…",
          "Contenu": "I dislike how you always get kicked off the survey after answering questions for 5 minutes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mr. smile",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:12:08.000Z",
          "Titre": "Started off wonderfully",
          "Contenu": "Started off wonderfully. Now I get kicked out of 7 out the 10 surveys I start, and the payouts seem to have decreased"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T23:56:45.000Z",
          "Titre": "I didn't like the fact that I kept…",
          "Contenu": "I didn't like the fact that I kept being suggested and sent to surveys that I couldn't take I'd sit there and take a 15 minute survey to take a survey and then not get paid for it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marvin Hancock",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T23:20:25.000Z",
          "Titre": "Be Careful a lot of the review to be paid don't pay;",
          "Contenu": "You can make a little money but the problem is the review to get paid survey's is shadyI had over 50 reviews that I took the time and did them honestly the survey's and patiently some was 30 to 45 mins long and didn't get paid that was over a 2 month period sense I didn't get paid for over 50 surveys I stop taking the survey's because I can not confirm if my information was reviewed or the answers to the survey's was taken and not paid. To me that's to many I had that didn't get paid and after the 30 to 45 days to give who ever to review you guys delete the ones that was in review that didn't get paid so you can not see them no more🤷Luckily I took a snap shot on my phone on the ones that was in the review status and the money owed to me was over 60.00 for December January and some of February I stop taking the survey's in January due to my time was not being compensated to many survey's did not get paid.Sorry Im done!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benjamin Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T03:14:06.000Z",
          "Titre": "Survey Frustration",
          "Contenu": "The surveys frustrated me, because I would often be disqualified after spending 5 minutes doing the polls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Catherine K",
          "Nb_Reviews": 5,
          "Date": "2023-11-03T02:49:47.000Z",
          "Titre": "Earn Haus. Just don't.",
          "Contenu": "The surveys are good ones and the reward is higher, however they do not pay every survey instantly. I had 18 surveys in a 'hold' til they were reviewed by someone, then they conveniently just disappeared. Reported this yet they still have not responded. Now they want to charge 1$ for a payout of 5$, so you only receive 4$. I don't know what else to say except-'enter at your own risk!         *edit. I finally got a response from Earn Haus. You can see it below. I emailed them twice for this problem. And what is up with charging people a dollar to cash out 5$. You get rejected so many times. Guess they took my review to heart because now I have 23 surveys 'under review'. Kicker here!!!! My first surveys were fine. They do have good surveys. It will take you 2 months to get a good payout. So to add, I did start in October. I have been paid twice. First time it took me 3 days to receive my 5$ payout. The 2nd time, I cashed out 5.19$ then was told that I would be charged 1$. Do you have any idea what 1$ means?? I'm sure that you don't. 1$ can be the equivalent of 3 surveys because you have to do all the surveys that are 22 cents, 50 cents, 35 cents. That's up to 3 surveys I did and you wanna take that away from me. BTW I cashed out the first time in October then cashed out the day of my review. 16 days apart."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kwindolyn Hall",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T05:33:27.000Z",
          "Titre": "I am trying to do a survey and my…",
          "Contenu": "I am trying to do a survey and my banking has changed. My bank name is not on it and it doesn't give me the option to write it in and I can't go no further with the survey. You all need to have a customer service number and a person to chat with."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amber Dartt",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T05:36:58.000Z",
          "Titre": "I accidentally put in the wrong day for…",
          "Contenu": "I accidentally put in the wrong day for my birthday and it won't let me change it but I can't redeem anything if my birthday on there and my ID don't match"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Victoria Winters",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T10:27:01.000Z",
          "Titre": "I like that you pay your rewards right…",
          "Contenu": "I like that you pay your rewards right away. The problem that I have is that I still got 12 surveys under review. Some them go as far back as the beginning of March. My question is am I going to get my rewards for those surveys? The it really takes long this is April I took some of those in March. I love  doing the surveys but you have got to get better with rewarding people their money for doing surveys. And also there are a lot of glitches. And most of the time I say what nationality I am or my age which is 59 or that I don't work it says I'm not qualified to take the survey. And they ask what nationality you are over, over, over again. Why???"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Price",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T05:55:05.000Z",
          "Titre": "The site has its good and it’s bad",
          "Contenu": "The site has its good and it’s bad. The simple fact that you can But the fact that they just won’t allow you to complete the last survey you need to cash out. It’s tells you a survey is ready file you then as soon as you senior attempt it , it doesn’t even allow you to start it. Almost as if it was done by design."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristin Barry",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T17:08:37.000Z",
          "Titre": "Better than most",
          "Contenu": "I think there are plenty of options for surveys and that's great, but some of the longer and higher paying surveys take time to \"Review\" before cashing out, which can take up to a month and then you may not even get paid after all of that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Infamouz Wishez",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T20:43:03.000Z",
          "Titre": "cash out was quick didnt take long to…",
          "Contenu": "cash out was quick didnt take long to reach 5$ but keep getting aw shucks surveys its annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TINA",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T05:28:48.000Z",
          "Titre": "Don't like that I be so far into a…",
          "Contenu": "Don't like that I be so far into a survey then told I don't qualify"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacob Salinas",
          "Nb_Reviews": 2,
          "Date": "2022-10-24T08:20:25.000Z",
          "Titre": "Every survey I do goes to review like…",
          "Contenu": "Every survey I do goes to review like literally every one I currently have 3 in review and one of them is from 10/01/22 and it states that by 11/30 I'll have a response two months to get $5 yeah be cautious on hear ppl!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "tanya brus",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T05:43:11.000Z",
          "Titre": "Yes you get paid the same day but…",
          "Contenu": "Yes you get paid the same day but whenever i click on the high paying surveys like the $4 ones i automatically get told aww shucks you dont qualify lets try another one and not just those alot of the cheaper ones as well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Buford barnett",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T01:18:39.000Z",
          "Titre": "The surveys were ok it took me about 2…",
          "Contenu": "The surveys were ok it took me about 2 hours to get to 5 bucks but eventually i got there. If you use paypal it takes about 10 minutes to deposit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samantha Klingaman",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T20:28:44.000Z",
          "Titre": "Several surveys got me to end or…",
          "Contenu": "Several surveys got me to end or halfway through before it said it didn't need/couldn't use me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Letesha Patt",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T01:37:47.000Z",
          "Titre": "Surveys was kinda cheap but long then…",
          "Contenu": "Surveys was kinda cheap but long then some you have to pay for a trail overall it was fun and I will do it again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Wiggins",
          "Nb_Reviews": 6,
          "Date": "2023-08-21T04:08:33.000Z",
          "Titre": "im glad that this survey company pays…",
          "Contenu": "im glad that this survey company pays out...i do get screened out at alot of surveys but this survey app is still pretty good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicole Strohm",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T23:56:23.000Z",
          "Titre": "It seems like a good and legit site",
          "Contenu": "It seems like a good and legit site, however my year of birth is incorrect on their site and I am trying to fix that but I am finding no way what so ever to contact any type of customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Taja Green",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T04:53:23.000Z",
          "Titre": "Payouts are fast but qualifying for a…",
          "Contenu": "Payouts are fast but qualifying for a survey can be hard one time it took me a month to complete 3 surveys"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Manuel Federico",
          "Nb_Reviews": 14,
          "Date": "2023-11-08T05:24:54.000Z",
          "Titre": "You can make money doing surveys but I…",
          "Contenu": "You can make money doing surveys but I have problems with it because I finish a survey and it takes me straight to another one and I don't get paid for the one that I finished so this needs to be worked on I'm still willing to try but it's a little bit difficult why do you charge $1 too put it on PayPal because nobody else does this so you can't tell me PayPal is charging it because it doesn't happen with anybody else have a nice day"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mocha Hogany",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T13:48:17.000Z",
          "Titre": "The surveys weren't so bad and not too…",
          "Contenu": "The surveys weren't so bad and not too long and I was able to cash out $5 immediately but my only \"Gripe\" thus far is even though I picked the $10 survey payout it gave me credit for only 3 completed surveys not the 6 or 7 I completed and just like many other online survey apps they reject you right before completion and after they've collected your personal information... But the payout was fast with PayPal..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Richards",
          "Nb_Reviews": 3,
          "Date": "2023-02-26T17:47:23.000Z",
          "Titre": "So far it's been a good experience I wish I could make it a 5 star experience on account of 4 surveys not credited and being reviewed for the last 45days I cannot",
          "Contenu": "So far it's been a good experience the surveys are different than your typical run of the mill surveys. Honestly I want to give this a full 5 star rating the only issue j have is I have 4 surveys that are being reviewed and have been since mid January my only notification of possible credit is sometime before February 28th in 2 days if credit is given I will come back with a 5star review"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrice Richardson",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T15:28:00.000Z",
          "Titre": "I love the surveys that pay instantly",
          "Contenu": "I love the surveys that pay instantly. I don't like the surveys that have to go under review,  i don't think they will ever pay off for my time and input."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Star",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T23:57:57.000Z",
          "Titre": "I been doing surveys all day I complete…",
          "Contenu": "I been doing surveys all day I complete some get done with them it say not qualified now you'll got 1.36 2.00 which I can't even do"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T05:28:08.000Z",
          "Titre": "Too many disqualified surveys",
          "Contenu": "Well I was disqualified for too many surveys. It took forever just to get a few cents from one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dankk",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T22:27:40.000Z",
          "Titre": "I’m giving this 3 stars because after a…",
          "Contenu": "I’m giving this 3 stars because after a while it just won’t let me complete a survey. I’ll click on it and every single one will say I can’t do it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mario Colandrea",
          "Nb_Reviews": 5,
          "Date": "2023-08-24T01:03:55.000Z",
          "Titre": "The cash out process is really bad",
          "Contenu": "The cash out process is really bad. There is no need to put all that info. to you for 5.00? You make it very hard to earn money. I will not continue with you. You must make things easier for the others."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy P",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T07:47:45.000Z",
          "Titre": "The process of obtaining the goal of $5…",
          "Contenu": "The process of obtaining the goal of $5 was an extremely long process and a lot of the surveys would ask you multiple questions and then tell you you don't qualify it was basically like trying to take two surveys and then told that you were not eligible for compensation for the surveys"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mari's Corner",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T01:27:49.000Z",
          "Titre": "I am still waiting  on my credits"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "geo",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T05:55:33.000Z",
          "Titre": "They have many surveys but alot of them…",
          "Contenu": "They have many surveys but alot of them are not allowing me to complete them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "#TheFoePoet byron",
          "Nb_Reviews": 5,
          "Date": "2023-04-18T18:33:12.000Z",
          "Titre": "I have to wait 30 + days..",
          "Contenu": "I don't like that I have to wait over 30 for my surveys get reviwed..I like that the amount they say your gonna get it's tile correct amount."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kao Saetern",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T02:32:17.000Z",
          "Titre": "I like that the money is transfer to…",
          "Contenu": "I like that the money is transfer to your account in minutes.only thing i have a problem with is not getting credit for some of the survey. Good app"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marie Mccullough",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T00:58:44.000Z",
          "Titre": "What are my other options if I don't…",
          "Contenu": "What are my other options if I don't have aID?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica Wiggs",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T02:11:42.000Z",
          "Titre": "Still have not received first payment",
          "Contenu": "Still have not received first payment. However 2nd payment was instant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelley Lane Sharp",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T20:07:47.000Z",
          "Titre": "I feel the surveys are too long for the…",
          "Contenu": "I feel the surveys are too long for the fee in which your paid"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alicia Butler",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T01:42:00.000Z",
          "Titre": "Great website overall",
          "Contenu": "Great website overall, did 3 surveys they didn't pay me for. But all and all its pretty good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T19:54:57.000Z",
          "Titre": "Not complaining about the payouts…",
          "Contenu": "Not complaining about the payouts however I have been taking surveys daily and it seems like a lot of things are glitching and I have devoted time to surveys that accepted me then boot me out half way or even more into taking the survey also I have several surveys in review with not enough feedback or information on the results"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danielle Stockdale",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T22:56:27.000Z",
          "Titre": "Mostly good",
          "Contenu": "The surveys are easy but sometimes it's hard to qualify for any"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Latoya Williamson",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T22:48:34.000Z",
          "Titre": "It is not easy to find surveys",
          "Contenu": "It is not easy to find surveys and some disqualify you towards the end"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P Sherman",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T02:59:14.000Z",
          "Titre": "Rarely qualify for surveys",
          "Contenu": "Rarely qualify for surveys. The extra money is nice but not really worth it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angie Ressler",
          "Nb_Reviews": 3,
          "Date": "2022-10-31T03:31:10.000Z",
          "Titre": "I've done about 20 surveys",
          "Contenu": "I've done about 20 surveys, 13-14 haven't been paid out as far back as 10-15-22. Said to hear by today. Still nothing. Time is money, I don't have time to wait this is too long"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda M Newman",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T20:00:15.000Z",
          "Titre": "I dislike",
          "Contenu": "I dislike, I don't care for this survey it takes long for cash."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kareena Poulson",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:04:12.000Z",
          "Titre": "At first I was not 100% it would work…",
          "Contenu": "At first I was not 100% it would work for me . But surprisingly it’s been useful ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S Millslagle",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T05:11:37.000Z",
          "Titre": "Life",
          "Contenu": "Ti like everything easy convenient for me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ReShaka Person",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T03:56:12.000Z",
          "Titre": "I don't like when I'm considered for a…",
          "Contenu": "I don't like when I'm considered for a survey and after it takes all these answers from me my personal information they tell me that I don't qualify for the survey and I don't like that or it will take me through the whole survey and then tell me that my answers are in review I don't like that either I mean people are expecting to get paid so after they do a whole survey for a 30 45 minutes to hear that their surveys and reviews really sucks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hugh Mixon",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T22:28:02.000Z",
          "Titre": "I cannot find any surveys to complete."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "viclou",
          "Nb_Reviews": 3,
          "Date": "2022-09-02T21:18:13.000Z",
          "Titre": "I am giving this site 3 stars because…",
          "Contenu": "I am giving this site 3 stars because they really do pay you. It easy to get 3 surveys done but when it comes to the 4 or 5 survey it's almost impossible. Plus you will complete surveys then when you get back to their page it says it's under review which I have never got credit for any of those. To me it's a waste of time. For me it takes days to get 5 surveys done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcus",
          "Nb_Reviews": 4,
          "Date": "2022-09-11T06:14:08.000Z",
          "Titre": "Frustration.",
          "Contenu": "Ok.. I have completed a handful of servers via \"earnhaus\" and while I have had a VERY good experience, it annoys me how often I either complete a survey and receive a \"survey under review\" notification which I NEVER receive credit for, or how I can complete an ENTIRE survey full thing and at the VERY END I'll receive a \"Unfortunately you did not qualify...\" After taking all of my information!!! Earn Haus please do better than this... And yes I know it is the survey providers fault but just annoying all the same."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seth Cook",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T12:01:38.000Z",
          "Titre": "Great for 1 day!",
          "Contenu": "Just heard of earnhaus thru another site 2 weeks ago. Came and did 3 surveys almost immediately and got paid 5 bucks very quickly! Great! Fast forward 2 weeks and I've only been able to get 2 surveys at all in the last 12 days!!! (need 3 to get paid) Everyday I go to their site multiple times and all I get anymore is \"Aw Shucks\" instead of surveys... so probably just be deleting my account soon. It was awesome for a quick 5 bucks, that's the only reason it gets 2 stars, otherwise it'd be 1 star.EDIT: Raised my review 1 star due to company reply...thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "aweau",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T02:18:40.000Z",
          "Titre": "I have been able to do redeem",
          "Contenu": "I have been able to do redeem. There is a lack of surveys available to do a bit of surveys for the day. So you won’t be able to do surveys daily. It does take up time to complete when there is barely any surveys to complete. HOWEVER, I just completed a fourth survey to redeem my second and it is not showing me that I am able to redeem. It took me to complete a second survey for another redeem! I tried looking for customer support to contact in regards to the matter. But I am unable to do so, because there is no contact information for support. Please help me resolve this matter. Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nunya Bidness",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T02:00:02.000Z",
          "Titre": "I had a hard time verifying my account",
          "Contenu": "I had a hard time verifying my account, had to purchase a new 50 dollar i.d. card just to redeem a 15 dollar reward...byt the redemption process was easy as pie. I received my rewards in an hour in my PayPal account. I look forward to giving more opinions on future surveys.  The surveys were easy to complete, not too time consuming but you get disqualified alot more than you'll qualify to complete surveys. You're even rewarded for partial completion. I see me making good side money from earn haus. Good luck to the rest of you, 8 times out of ten I would recommend just because redemption payment came as quick as it did."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nina Galvan",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T06:15:20.000Z",
          "Titre": "The surveys suck",
          "Contenu": "The survey suck"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hawkins",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T11:42:55.000Z",
          "Titre": "On the road to making more money",
          "Contenu": "On the road to making more money, all of a sudden I was informed that there were no more surveys for my demographic. I was told to come back in an hour, that was 6 or 7 hours ago and there still aren't any new surveys. Other times you can spend 10 minutes on a survey just to be told that you didn't qualify"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heidi Ann",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T06:58:04.000Z",
          "Titre": "I'm not sure if I can trust y'all",
          "Contenu": "I'm not sure if I can trust y'all. I have points to add up but I'm not getting surveys and a pop up message came saying basically that I'm in trouble? Don't quite understand that. I'm being honest. Y'all are getting my personal answers and life questions and then it says no surveys. Hoping this isn't a scam. I checked out a few of these paid sights and wrote yours down in a book to keep track. Can't get my funds added to my PayPal?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cathleen Addison Addison",
          "Nb_Reviews": 5,
          "Date": "2022-08-17T15:34:06.000Z",
          "Titre": "All the work,and no rewards",
          "Contenu": "Got thru couple surveys,till almost the end,then told I don't qualify! I've done the work,but no reward! And now,it just keeps saying,I don't qualify to any,you would think out of about 40,I would qualify for at least one or two,geez!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Majia Prince",
          "Nb_Reviews": 3,
          "Date": "2022-06-30T08:34:19.000Z",
          "Titre": "Was disqualified from too many surveys…",
          "Contenu": "Was disqualified from too many surveys after taking the pre-qualifier which is a waste of time and I don't have a lot of patience for that some surveys are entirely too long as in over an hour not interested in that at all although the cash out is very quick and efficient I do however wish that they would cash out to cash App instead of PayPal"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard N Harris",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:29:17.000Z",
          "Titre": "The truth",
          "Contenu": "Ehhf u see cay why owe you? pay me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Corteville",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T04:57:44.000Z",
          "Titre": "Completes survey, finishes, then not qualified",
          "Contenu": "I don't like that they allow survey creators to create a survery that requires you to go through the entire thing and when finishing up doibg the demographic questions then it denied you because they've reached the quite for your group."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will Risley",
          "Nb_Reviews": 3,
          "Date": "2022-05-31T01:20:44.000Z",
          "Titre": "This site is cool for daily money but needs work",
          "Contenu": "It's cool to make $10 a day but I would be able to make $30 if the surveys were not allowed to let me almost finish a survey then disqualify me and make me do another new survey, sometimes it happens 4-6 times in a row. It sucks. So this is a ok site but it needs a lot of work to better serve the survey taker, but you can tell they only care about the companies paying them not us!!!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Zeman",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T01:19:32.000Z",
          "Titre": "Got the $5 quickly but then I didn’t…",
          "Contenu": "Got the $5 quickly but then I didn’t qualify for many surveys after that. I am trying to make $15 today and have spent time to take surveys only to find out halfway through that I’m not qualified for that survey."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Georgette Joubran",
          "Nb_Reviews": 2,
          "Date": "2022-05-19T00:36:35.000Z",
          "Titre": "Very good experience with this website…",
          "Contenu": "Very good experience with this website the first time using in March, not sou much this time. Prompted by the website to watch a 50 minute show and I think I was only compensated very little less than a dollar and I don't understand why I watched it I did everything that the video asked.... I'm not very impressed with this...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike siener",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T07:53:12.000Z",
          "Titre": "Earn Haus was far and away the best…",
          "Contenu": "Earn Haus was far and away the best company for payable surveys I’ve used to date!Next I’ll address some issues they could fix to enhance their rating - up a star….- for some reason they kept turning down my credit card to withdraw direct to my bank. Secondly, my suggestion would be a way their customers- US could rate their survey partners!! Lastly, I had to set up a Venmo account to receive my funds… But, alls well that ends well, I guess ,- Mike s."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:25:31.000Z",
          "Titre": "The variety of reviews are good",
          "Contenu": "The variety of reviews are good. More payout options then other survey site. I have run across."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larie Cox",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:59:31.000Z",
          "Titre": "Bitter sweet",
          "Contenu": "The 1st couple of days offer surveys with decent pay outs. After that, only 20 or 30 cent offers are available. Surveys also let you get half way through before kicking you out.One plus, payout is quick!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:27:38.000Z",
          "Titre": "Easy Bank Transfers",
          "Contenu": "I really appreciate that you can cash out quickly to my bank. That's why I'll stay with Earn Haus ONLY, to do any surveys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole Stillman",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:13:44.000Z",
          "Titre": "I had an issue with the acct excepting…",
          "Contenu": "I had an issue with the acct excepting my license and it was handled in less then 1hr. I was very happy and excited about this cuz I needed my funds asap. And it was a great surprise to have a company actually respond in less then 48hrs or more or sometimes never at all. My only problem is I am not happy about some of my surveys I am completing were saying by end of November I would receive and that has now come and gone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:10:34.000Z",
          "Titre": "Great surveys..",
          "Contenu": "Great surveys... needs to be more available!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jordancrothersyahoo.com",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:45:32.000Z",
          "Titre": "Some you can't get matched with but you…",
          "Contenu": "Some you can't get matched with but you still spend 5 minutes filling things out. Overall a good experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Em D",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T02:05:04.000Z",
          "Titre": "Really pays out!!",
          "Contenu": "Great site, easy surveys, real money. I did dock a star because sometimes it’s hard to qualify for a survey. While they’re “unlimited” sometimes I only qualify for 1-2 in a day while other days it’s 5-6. Also, they don’t pay much but take quite a bit of time sometimes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tam Gabbard",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T21:48:47.000Z",
          "Titre": "Great app!",
          "Contenu": "I have had a great experience with this app. I always get paid when I should and I can do it on my own time. There are always opportunities available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T08:54:39.000Z",
          "Titre": "A little disappointed I didn’t qualify…",
          "Contenu": "A little disappointed I didn’t qualify for most surveys but when it came to cashing out the process was easy and instant."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Bull-Haga",
          "Nb_Reviews": 4,
          "Date": "2023-09-25T08:25:59.000Z",
          "Titre": "Earn Haus is a great survey app",
          "Contenu": "The experience I had with Earn Haus was good. The app was easy to use and the surveys weren't too hard or too long. You could pick specific surveys with shorter or longer timetables. I had one issue which is why I gave it four stars, it was kind of difficult to verify my identity because you are not able to see when you were taking a picture of your ID or the selfie. So I had to take several pictures to get it right. If they made the redeeming process and the verification process a little easier as far as taking pictures I would give it five stars. Definitely recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rashida Miller",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T03:30:48.000Z",
          "Titre": "So far Earn Haus has been consistent…",
          "Contenu": "So far Earn Haus has been consistent and maybe one of the best survey sites so far.  The payout was smooth.  Although, they take you through a verification process which usually last a few minutes, not days and they send the payment via many options at no cost.  The only reason I gave it four stars is because I was turned down for some surveys that I spent maybe 30 or more minutes on just to be turned down with no payment for effort.  I know this is typical with many sites so I expected it.  Overall this is good site where you can give feedback on products you shop for everyday butit’s easy to lose interest if the surveys are long and boring."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T05:05:51.000Z",
          "Titre": "Overall good survey site.",
          "Contenu": "Overall the site is good does exactly what it says it's going to do except you have to reach $5 to cash out and they charge a $1 fee if it's under $10 Qumee is the better survey site for instant cash out with no fees"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelly Mcnutt",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T23:24:55.000Z",
          "Titre": "Earn Haus really pays out for surveys. Although we don't get credit for all",
          "Contenu": "Earn Haus really pays out for surveys. The only setback is all the surveys that you start may not be surveys you qualify for and therefore there ia no compensation for time wasted. You have to keep going and trying to add up earnings bit by bit."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Favour Okpokpo",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T15:08:06.000Z",
          "Titre": "I'm so happy I know this site",
          "Contenu": "I'm so happy I know this site, they do great job and I also make money from it I love you (Earnhaus.com)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittany",
          "Nb_Reviews": 10,
          "Date": "2023-11-14T09:25:10.000Z",
          "Titre": "This truly has been a great little…",
          "Contenu": "This truly has been a great little survey site to hop on in my free time to make. Few extra bucks. The surveys aren't too lengthy and I qualify or most of them. My favorite part....no glitches!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andre",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T03:49:55.000Z",
          "Titre": "It was a good survey website",
          "Contenu": "It was a really good survey website. My only problem is it is quite difficult to get up to the five dollar minimum cashout as each survey only pays a couple cents per survey.It also denied me my payouts after completing certain surveys multiple times until you can finally find a survey that will pay you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dovah Ken",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:13:30.000Z",
          "Titre": "Not without its flaws but the ONLY survey site that is STRAIGHTFORWARD.",
          "Contenu": "This is the only survey site I have ever encountered where I didn't have to jump through any hoops or get bamboozled with false payouts or lies. I have cashed out at least 4 times already and within 10mins of hitting the redeem button. No support tickets, no rip offs. Kudos to Earn Haus for that! On the other hand, the surveys take too long for an extremely low yield sometimes. Researchers should not be allowed to deny payment if you complete the survey and they don't like the answers. This doesn't happen often because I read the details before I start now and I just don't do surveys that don't credit immediately anymore. Problem solved. Also $0.17 for 19mins is ridiculous. Other than that.. Earn Haus is legit. If they increase the pay for these surveys, they would put all the other \"survey\" sites out of business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Dery",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T05:35:13.000Z",
          "Titre": "Put what your accustomed to making and not pandemic amounts",
          "Contenu": "I like the experience, however, the system seems to glitch when it’s time to put in your income. If you are low income and put in an honest amount, you will get rejected if it’s not up to the processors standards. I suggest that maybe people not put in, in real time financial information because it can change at any time and just put in what they are accustomed to making. Otherwise, you don’t seem to get the credits. Also, the “under review process” takes forever."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Nash",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T06:36:47.000Z",
          "Titre": "Relatively easy surveys.",
          "Contenu": "Relatively easy surveys. Could pay better but fairly easy to get to the point of cash out. No problems cashing out, l liked the verification process, it's safer that way. I did get turned down by quite a few surveys while on site but I know that not all surveys are right for everyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ollie Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T02:37:01.000Z",
          "Titre": "Overall not bad if you wanna make a few…",
          "Contenu": "Overall not bad if you wanna make a few bucks here and there. Cash out to venmo is instant which i like. There is a fee of $1.00 to cash out anything under $10.00. Most surveys are under a dollar which sucks but it adds up and there are a ton to choose from. Just a heads up you will need a valid ID of some kind to be able to cash out for anything under $50.00 which i was not aware of until i tried to cash out the first time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Duncan",
          "Nb_Reviews": 3,
          "Date": "2022-09-19T23:16:58.000Z",
          "Titre": "Very impressed the first run through…",
          "Contenu": "Very impressed the first run through the surveys weren't overly tedious. Will come back and give a full give stars if the next couple times I run through 3 surveys it doesn't take 2 hours of getting rejected 15 min into a survey. I believe overall it is a wonderful thing and I'm sure they'll work to make the demographics not so restrictive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Morrison",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T22:16:20.000Z",
          "Titre": "I Have A Problem!",
          "Contenu": "So far it has been ok, but after a few $1-$2 the surveys dropped to $Cents...But I have a problem, I without thinking accidentally put my Brothers Birthday as my own because I was doing his paperwork all day. I saw this problem when I was trying to redeem points, and verify my information. I tried to change the date but it is locked in and I have already did the verification. I can not find a contact or customer service number for Earn Haus...Anyone know how to contact them, or how to change and edit Birth date information?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krista Bobb",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T02:17:22.000Z",
          "Titre": "Pretty easy app to use",
          "Contenu": "Pretty easy app to use. Let them send me notifications and those are easy payouts. Sometimes searching is not easy, to get surveys still have pending surveys from a week ago they have not posted to my account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deloris Agbesse",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T02:30:01.000Z",
          "Titre": "The survey pays the same day which I…",
          "Contenu": "The survey pays the same day which I love. The survey is completed and I immediately get my credit. The surveys are interesting. I do not like to spend time completing a survey and than it goes under review for weeks without awarding me my credit due. That review process needs to be restructured and reward credit in a timely manner after the review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beebs",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:57:32.000Z",
          "Titre": "Rack up on cash",
          "Contenu": "There are times where surveys will redirect you but there is a variety list of surveys available"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T22:45:39.000Z",
          "Titre": "Earn Haus Can Improve",
          "Contenu": "Some surveys are interesting. However, Earn Haus does not provide the easiest survey process.  I spend too much time answering questions to find out if I am suitable for certain surveys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alec Mulligan",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T02:06:28.000Z",
          "Titre": "The company that handles the service does a really great job, mostly.",
          "Contenu": "The company is awesome, they even cash out funds at $5 and it's in your account in minutes, my only reason for 4 stars is the evaluation surveys require a paid sponsorship of sorts from whatever company, the other surveys which are completely free sometimes reroute you more than once and it feels like you're doing multiple surveys for free. Other than that this is way better than inbox dollars or drumo, as well as paid viewpoint."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Casey Lowe",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T15:30:51.000Z",
          "Titre": "Legit fast Cash-out!!!",
          "Contenu": "This is a good survey site I made $5 with in 2 hours an it was on my PayPal in 5 minutes this is a godd one an I've tried alot of survey an apps."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Enid Ewen",
          "Nb_Reviews": 4,
          "Date": "2023-10-24T04:28:48.000Z",
          "Titre": "The surveys are good",
          "Contenu": "The surveys are good.  But earn haus, unlike any other survey company, keeps $1.00 every time you redeem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Belinda B. FerretGal",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T06:12:58.000Z",
          "Titre": "I hung in there and it got better...",
          "Contenu": "The first payment was quick but at the second payment I kept getting turned down for almost every survey & began to grow frustrated. I hung in there & it got much better. If you are being turned down perhaps take a short break when a bulk of new surveys come out. For me it was like a day & a half before It improved. Overall it's not bad but the process is both fast & sometimes very slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew W Morris",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:37:36.000Z",
          "Titre": "It was fine and well done",
          "Contenu": "It was fine and well done. I will continue to utilize EarnHaus in the future. They have very good surveys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward L",
          "Nb_Reviews": 4,
          "Date": "2023-04-07T12:09:26.000Z",
          "Titre": "Fairly quick payoff",
          "Contenu": "I love that it didn't take me all that long to get to $5.26 and cash out. Got my PayPal money immediately. The only issue I have is that there's a lot of page redirecting during surveys. You don't end up completing the survey that you started with but with some perseverance, you you'll get some reward."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Natalie Mesa",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T01:28:07.000Z",
          "Titre": "Hard time redeeming my funds",
          "Contenu": "I was trying to redeem money and it took me over a week. I do like the way Earn Haus was very quick to respond and did try to rectify the issue. Thank you for your time ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T02:44:49.000Z",
          "Titre": "So far this app is better than most as…",
          "Contenu": "So far this app is better than most as far as earning potential.i started yesterday and already cashed out $5 to my paypal. It is still still little early to tell and some of the survey links are broken and so far I have taken a few surveys that are under review but they haven't added them to my completed tasks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T01:18:09.000Z",
          "Titre": "This has been an amazing experience",
          "Contenu": "This has been an amazing experience. This company has did exactly what I needed. This is like the first real site that actually gives you surveys much less actually pays you. This site is awesome!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bree H",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T02:22:57.000Z",
          "Titre": "My experience…",
          "Contenu": "I love the surveys and the fact that you actually pay promptly, however I don't like  when I'm doing a survey and just about to finish and get told the survey isn't for me. I do 18 min of a 20 min survey and get kicked off with no payment at all for my time. If it weren't for that I'd definitely rate 5 stars!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Cordon",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T12:29:12.000Z",
          "Titre": "The camera is too shakey but I received…",
          "Contenu": "The camera is too shakey but I received my first payment within minutes. This survey panel pays very little and requires several minutes of your time. But they do pay you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gina Angel",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T04:41:20.000Z",
          "Titre": "My experience was great but hoping that…",
          "Contenu": "My experience was great but hoping that I still get paid forThe ones being review. They take a lot effort ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Peavy",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T10:29:52.000Z",
          "Titre": "Yes after finally getting $5 worth of…",
          "Contenu": "Yes after finally getting $5 worth of surveys completed i was able to send redeem to venmo but there was a mix up in phone numbers. I figured this out and sent support an email saying they needed to change my number so it would be sent to my venmo. They responded to email really fast reversed the payment and let me put another number in on my account and within 5 minutes or so the money was sent to my venmo. I also was able to get up to $5 and redeem today no problem. Only issue i have it the consistency of taking the surveys. Yes some have big difference in pay or time but alot of the surveys you click on will take you to more than one place asking you questions and after 10 to 15 minutes of answering stuff they just suddenly say oh sorry and you back to looking for another survey"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lavette Everhart",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T02:36:12.000Z",
          "Titre": "First I think the long wait in… the",
          "Contenu": "First I think the long wait in receiving  points in relation  to the survey is sad also I think it shouldn't  take as long as it does to review the Surveys. And finally  it sometimes  with all the wait and doing the survey not receiving  at least 2 points for trying can become discouraged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lindsey Krehbiel",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T16:36:09.000Z",
          "Titre": "This is a great site if you need a few…",
          "Contenu": "This is a great site if you need a few quick bucks. The payouts are real and fast but it's hard to get surveys that are compatible with my personal demographic. I wish the surveys selected were more inclusive and didn't deny me so much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh Ramey",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T01:26:02.000Z",
          "Titre": "The pay out is great but I don't like…",
          "Contenu": "The pay out is great but I don't like when they review my survey I never get credit for the survey or my time I wasted taking it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob Roberts",
          "Nb_Reviews": 4,
          "Date": "2023-07-19T00:18:34.000Z",
          "Titre": "Fast pay out and legit",
          "Contenu": "Fast pay out and legit, I just wish there were more high paying offers that didn't require so much info or purchases."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Keller",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T04:43:18.000Z",
          "Titre": "Fast and easy way to make a few bucks",
          "Contenu": "Fast and easy way to make a few bucks.  I do not like the review process they have.  It does not make sense to me, and hopefully they do choose to pay me for the 5 surveys in there review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T22:23:44.000Z",
          "Titre": "The setting up of my account was a bit difficult with…",
          "Contenu": "The setting up of my account with verification was quite difficult, we could not use Google to do it and had to download Firefox to do the verification. I had to ask a computer expert to help, cost me more than the money I earned."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peggy Sue Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T06:16:56.000Z",
          "Titre": "Easy Peasy set up",
          "Contenu": "Day two of enjoying the app. Setting up an account was easy peasy and then it was off to my dashboard to start taking my first survey. I have earned $4.53 in just a few hours and now I seem to be stuck in an endless loop. My dashboard shows I have a whole lot of surveys that are available and yet all of them that I have tried to access go out and then immediately come back which means that I haven't been accepted and that is unacceptable to me! Why are the surveys on my dashboard if they are not going to allow me to take them? So the question prevails as to whether or not I'm actually going to be able to pay out on this app. That's the reason for the four stars which can immediately be changed to five stars if I could start getting surveys to actually take. I love the site and I would certainly stay here, but there's got to be some give and take care so that I can continue to earn money. Thanks for listening😉"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fresia Onate",
          "Nb_Reviews": 3,
          "Date": "2023-07-15T20:04:30.000Z",
          "Titre": "Survey review",
          "Contenu": "In many ocassions I don't qualify for the surveys and it takes many questions before they say that I don't qualify.. plus we don't get a few points at least for trying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becky G",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T03:22:16.000Z",
          "Titre": "I like doing surveys but I didn't like…",
          "Contenu": "I like doing surveys but I didn't like when I cashed out on PayPal it charged me a $1.00 to cash out $5.00 and had to verify my identity"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phillip Punter",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T04:48:35.000Z",
          "Titre": "Truth of advertisement as described…",
          "Contenu": "The simple fact that it is as described in the advertisement,  you will get paid for honestly answering the surveys. If other entities conducted themselves in such a business manner, all will walk away satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ezra Troche",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T22:49:15.000Z",
          "Titre": "Quick Surveys and Quicker Returns",
          "Contenu": "Many of these survey sites have a minimum of over $20 to cash out. I love that it is only $5 so its quick if I need something simple like sides for dinner. The redeeming of credits was very quick and in the account within minutes. Survey are quick for the most part and are often not as long as the time says."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maisie Perry",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T16:20:51.000Z",
          "Titre": "I love this company",
          "Contenu": "I love this company. The rewards are real and as soon as you hit 5 dollars you can cash out. The only thing is how many questions you have to go through before the actual survey. I get some don't get accepted. But overall not bad"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meredith",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T14:46:40.000Z",
          "Titre": "Well great customer service after I…",
          "Contenu": "Well great customer service after I thought everything was going to be a mess so thank you so much for your help and taking care of my payment awesome thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kirk Carter",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T13:39:10.000Z",
          "Titre": "Clear cut and pays",
          "Contenu": "The surveys are easy to understand and keep me engaged. I've cashed out once so far and was pleased that I actually received payment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ti",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T11:26:02.000Z",
          "Titre": "Understandable",
          "Contenu": "I am just waiting for the deposit to get to my bank but the transaction seem to be legit so I feel that people should give it a try I just hope that the finds transfer as soon as possible"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Douglas Martin",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T22:36:30.000Z",
          "Titre": "Fastest Payment but High % Flagged then Not Paid",
          "Contenu": "Pay r̳e̳c̳e̳i̳v̳e̳d̳ within 15 minutes after only $5 earned which by far is the fastest I've seen.Of my first 96 surveys taken, over 38% were pended for review by the sponsoring client. Of the 37 pended for review, 2 were paid a day later but those 2 were the first paid after a review and after 93 surveys. Per EarnHaus support, industry standard is to reconcile by the end of the following month, but again, none of my reviewed surveys were paid later for April or May. 14 are still pending review but odds are not in my favor that they'll pay. When contacted, support at EarnHaus paid on 5 where extended time was committed only to find quotas full 𝙖𝙛𝙩𝙚𝙧 the survey was completed instead of at the beginning.Very regularly the time expectation is grossly underestimated by the sponsor. I am using a tablet to speed up clicking that a mouse would be slower for. I had one survey that was expected to pay $0.65 for 15-18 min. The 100+ questions took me over 30min and resulted in a review (which so far means very low chance of payment) For fun, I tried a 3min survey for $0.10 and it took over 20min and went to review (which again most likely means no payment.) Each survey has an option to provide feedback or concerns, but none of mine were responded to when using that option. However, support when directly contact has been super fast and cordial and very thorough.If the percentage of surveys that pend for review drops significantly or if more of the reviewed surveys pay later, I'll definitely update this review..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Benny Sain jr",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T00:36:14.000Z",
          "Titre": "Its really a lot more then…",
          "Contenu": "Its really a lot more then surveys....having to sign up for qutoes, trials, subscriptions and so on. I hAD NO IDEAL. SOME EVEN COST MORE THAN U GET PAID FOR DOING THEM. GREAT THING WAS I DID GET TO CASHOUT AND PAYMENT WAS SUPER FAST THX 😊"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Amo",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T03:10:08.000Z",
          "Titre": "I like that the surveys weren't that…",
          "Contenu": "I like that the surveys weren't that long. The only thing I don't like is some of the surveys you finish go to review and it seems to take forever for them to review it I've had some in review for 3 weeks now"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Day",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T11:30:40.000Z",
          "Titre": "The simplicity of the site is what I…",
          "Contenu": "The simplicity of the site is what I enjoy the most. It would be great if the payouts were higher and the surveys were shorter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T05:52:54.000Z",
          "Titre": "One of the best I've found to get paid…",
          "Contenu": "One of the best I've found to get paid for surveys. They try to match you with the best fit for the time and money. One of the only ones that pay out to venmo and it only takes about 5 minutes to get paid. The only gripe I have is there sometimes is a lot of surveys that don't work for you, but if you keep trying you'll get the few that will pay out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becca Canfield",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T09:42:47.000Z",
          "Titre": "Need more survey money",
          "Contenu": "Surveys r long and never get enuff money or earn nearly anything for the surveys I take need more money on the surveys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christian Finneran",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T19:31:15.000Z",
          "Titre": "Very good deal",
          "Contenu": "Very good deal, sometimes I gettes booted off surveys for what I think are irrational reasons but otherwise it's rather sound"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer White",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T11:09:16.000Z",
          "Titre": "Great app",
          "Contenu": "Great app. payout very quick with PayPal. It does take sometime to reach the 5.00 redeem threshold. Also, the payout on some surveys is to low for the amount of time it took to complete."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabby Barnes",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T02:53:18.000Z",
          "Titre": "Really great way to make extra cash and…",
          "Contenu": "Really great way to make extra cash and is an instant cash out! Amazing but the only thing i don't like is that i do not qualify for some of the surveys which slows me down."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danette Taylor",
          "Nb_Reviews": 7,
          "Date": "2023-05-21T01:06:07.000Z",
          "Titre": "Completing surveys and cash out are…",
          "Contenu": "Completing surveys and cash out are extremely easy! Wish there were more survey's available however!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marlon Mitchell Renazance'",
          "Nb_Reviews": 6,
          "Date": "2023-11-19T19:01:13.000Z",
          "Titre": "Truth Pays",
          "Contenu": "The surveys were reasonable and an opportunity to gain from replying truthfully."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elisha Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T19:54:06.000Z",
          "Titre": "Fast payouts",
          "Contenu": "Few surveys and cash out of only 5$ can have sent to your account, paypal,or paper check. Surveys are easy and that is it. Doesn't take time to earn."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathaniel Jones",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T04:27:27.000Z",
          "Titre": "Pretty easy to make 5 dollars but I…",
          "Contenu": "Pretty easy to make 5 dollars but I noticed the offers got smaller after I earned some."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley Scott",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T15:51:14.000Z",
          "Titre": "I have enjoyed all the surveys that…",
          "Contenu": "I have enjoyed all the surveys that have be given to me. The benefit of being able to cash out when I get some is nice also."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie Stabler",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T06:00:30.000Z",
          "Titre": "It’s an OK say it but I didn’t several…",
          "Contenu": "It’s an OK say it but I didn’t several surveys and I don’t qualify for any more"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T21:45:37.000Z",
          "Titre": "Fast redeeming",
          "Contenu": "Fast redeeming. Low priced surveys for a long amount of time but redeeming payment was easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Frye",
          "Nb_Reviews": 8,
          "Date": "2023-05-17T21:22:13.000Z",
          "Titre": "I had some trouble with the varification process…but I eventually got it",
          "Contenu": "I had some trouble with the verification process so I just used my driver's license and selfie. it seemed like it was easier"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DJ",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T10:06:33.000Z",
          "Titre": "Didnt think it worked like that",
          "Contenu": "I didnt think that i would be able to actually redeem any money. I was able to do so. Just after completing a few surveys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christina Stinson",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T09:41:34.000Z",
          "Titre": "Earn Haus is an honest paying company that will help yu earn extra cash.. a",
          "Contenu": "There plenty options and if yu don't get tat survey they will provide another one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bernadette Solorzano",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T02:21:12.000Z",
          "Titre": "This is a pretty good website it does…",
          "Contenu": "This is a pretty good website it does pay you real money and you can cash out right away the only thing I don't like is that I've cashed out one time and now I can barely pass the little questions to do the service to qualify for the survey other than that it's just fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bonnie Trionfo",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T20:38:40.000Z",
          "Titre": "Great Payouts !!!",
          "Contenu": "The payouts were much better than other survey sites. I like the assortment of surveys."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy Hall",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T06:51:44.000Z",
          "Titre": "They mostly pay out when asked",
          "Contenu": "They mostly pay out when asked. The $5 limit is kind of crap, and suddenly surveys disappear when you've used them for a few days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gemma Gendreau",
          "Nb_Reviews": 7,
          "Date": "2023-09-10T21:54:51.000Z",
          "Titre": "Pretty smooth set up on this app",
          "Contenu": "Pretty smooth set up on this app. Still hard to get into the actual surveys though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corneluis Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:52:00.000Z",
          "Titre": "Excellent job transferring my winnings…",
          "Contenu": "Excellent job transferring my winnings to my PayPal account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T23:28:35.000Z",
          "Titre": "Very easy to earn and cashout as well…",
          "Contenu": "Very easy to earn and cashout as well as being able to have my opinion help companies. I recomend Earn Haus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Schowengerdt",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T20:36:03.000Z",
          "Titre": "does not allow me to qualify",
          "Contenu": "I have been able to redeem 2 times,  now it takes me through most of a survey and then did does not give credit"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal Johnson",
          "Nb_Reviews": 4,
          "Date": "2023-08-20T15:08:05.000Z",
          "Titre": "True to word",
          "Contenu": "True to word. Very relaxing and fun. Payout was almost instant. Thanks so much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trent McBryde",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T08:45:09.000Z",
          "Titre": "Real money some didn’t pay after completion…",
          "Contenu": "Real money but some surveys didn’t pay out for me I even submitted video responses for one; wasting my time but payouts are quick and surveys are easy, a bit tedious due to the redundant verification process to make sure your replies are genuine but the surveys are definitely easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cassie Panter",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T19:01:54.000Z",
          "Titre": "Fast and Easy transactions",
          "Contenu": "The transfer was fast and simple to navigate. For someone like me, that's saying alot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evelyn Peterson",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T01:21:14.000Z",
          "Titre": "I like the app but I don’t like how you…",
          "Contenu": "I like the app but I don’t like how you doing long story and watching videos , and they only willing to pay .83 cent. But if you have time you can get up to $25 a day😊🤷🏽‍♀️lil gas money"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessie Lyle",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T06:52:35.000Z",
          "Titre": "Super fast and easy withdraw but took a…",
          "Contenu": "Super fast and easy withdraw but took a day to earn the last . 75 together to min $5 limit"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan T Schmit",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T07:21:36.000Z",
          "Titre": "Great site",
          "Contenu": "Great site, surveys in review for awhile is one bad thing but everyone thing else is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tamra Starnes",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T08:39:00.000Z",
          "Titre": "The cash out is super quick",
          "Contenu": "The cash out is super quick. The only drawback is sometimes the surveys disqualify you continuously."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judy Francis",
          "Nb_Reviews": 3,
          "Date": "2023-05-25T09:57:55.000Z",
          "Titre": "Easy cash out took a minute to earn the…",
          "Contenu": "Easy cash out took a minute to earn the 5 dollars I have to say about a dollar an hour or so."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Dorsey",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T01:35:08.000Z",
          "Titre": "It pays more for surveys",
          "Contenu": "It pays more for surveys. Guaranteed to succeed my opinion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larrisa Mauermann",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T22:23:04.000Z",
          "Titre": "Probably the most legit out there",
          "Contenu": "I like this company alot although the surveys are kinda long they really do pay you quick and the cash out us 5$ they have different levels it takes to get there lvl 1 =5syrveys 5$  2= 3 surveys 10$ I don't recall lvl 3 but I've not been qualified for many if the lvl 2 surveys they have a referral bonus too 3$"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Smith",
          "Nb_Reviews": 27,
          "Date": "2023-05-15T02:05:27.000Z",
          "Titre": "I was glad to finally get a payout",
          "Contenu": "I was glad to finally get a payout.  The process was a little tedious, but I got thru it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosita Johns",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T01:35:28.000Z",
          "Titre": "I have just made my first withdrawal so…",
          "Contenu": "I have just made my first withdrawal so let's see how smooth this goes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-05-11T18:40:17.000Z",
          "Titre": "I decided to try this and your service…",
          "Contenu": "I decided to try this and your service is the best thus far. Great surveys and I was paid in the most timely manner!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T01:34:40.000Z",
          "Titre": "All surveys are to my liking for the…",
          "Contenu": "All surveys are to my liking for the most part. I have alot of time on my hands and I'm glad this site is so useful for me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janice Knight",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T04:15:25.000Z",
          "Titre": "The fast payment",
          "Contenu": "The fast payment and the ease of finding a survey."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 3,
          "Date": "2023-06-11T20:45:03.000Z",
          "Titre": "The company is Earn Haus and they have great customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Schneider",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T20:08:54.000Z",
          "Titre": "They pay out fast",
          "Contenu": "They pay out fast. But it's hard to get a survey you qualify for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carrie Howard",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T05:52:12.000Z",
          "Titre": "The rewards added up quickly and the…",
          "Contenu": "The rewards added up quickly and the cash-out process went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rena J",
          "Nb_Reviews": 15,
          "Date": "2023-05-08T23:49:39.000Z",
          "Titre": "I enjoy doing surveys with this company…",
          "Contenu": "I enjoy doing surveys with this company it's a great experience and the payout is fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gil Trotman",
          "Nb_Reviews": 9,
          "Date": "2023-12-21T09:59:38.000Z",
          "Titre": "Survey site with excellent matchmaking",
          "Contenu": "Survey site with excellent survey matchmaking. I get very few bad survey matches, and payouts are quick, easy, and straightforward. I highly recommend this site if you like doing surveys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larissa Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T01:07:26.000Z",
          "Titre": "No Longer Skeptical",
          "Contenu": "I didn't trust any survey site but this one is legit! I have definitely gotten paid and promptly! 10 out of 10, I recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat Hamilton",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T02:15:51.000Z",
          "Titre": "I love to give my opinion in the…",
          "Contenu": "I love to give my opinion in the surveys  I do to help make products better , or things that my need to be changed and when new products come out. Or on any other subject that Earn Haus surveys send me. I just have fun , give my opinion and get paid. Thank you Earn Haus. Come and join."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Turpen",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T09:54:02.000Z",
          "Titre": "I've tried many online survey sites",
          "Contenu": "I've tried many online survey sites. Some were okay, some were completely full of crap but this is the first survey site I've written a review about because it's pretty awesome. You ain't gonna make a fortune but they link directly with your PayPal account which makes cashing out easy breezy. The minimum amount you can redeem is $5 so it's not as frustrating and monotonous as other survey sites I walked out in. I give it my stamp of approval so give it a shot and find out what I'm talking about."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Thermitus",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:01:59.000Z",
          "Titre": "\"Earn Haus has truly revolutionized the…",
          "Contenu": "\"Earn Haus has truly revolutionized the way I approach online surveys and payments. I've been using their service for a while now, and I couldn't be more satisfied. The platform is incredibly user-friendly, making it effortless to navigate through various surveys and opportunities.What sets Earn Haus apart is their prompt and secure payment system. Unlike many other similar services, I've never encountered delays in receiving my rewards. The transparency and reliability in their payment process are commendable, instilling a sense of trust and credibility."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Codi Moore",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:48:40.000Z",
          "Titre": "The surveys where not that long and…",
          "Contenu": "The surveys where not that long and questions i can answer also got the noney in my accout the same day. Thats a plus ill take many more surveys as long as they let me and  im eligibility."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle Hutchison",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T18:47:25.000Z",
          "Titre": "The surveys were interesting and…",
          "Contenu": "The surveys were interesting and relevant. But best of all they connected to my paypal account and delivered prompt redemption of earnings and the minimum to cash out is very low. I earned higher on another survey site and they have never paid me, when i redeem my earnings it just says processing and goes back to dashboard. Earn haus is honest, easy, and reliable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Beaucond",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:32:46.000Z",
          "Titre": "Honest & Straightforward",
          "Contenu": "Very upfront. Take surveys, get paid. No shady requirements.  Great company. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri Lynn Miller",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T23:08:08.000Z",
          "Titre": "They offer many surveys and pay higher…",
          "Contenu": "They offer many surveys and pay higher than most sites that I use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T17:18:59.000Z",
          "Titre": "Problem, No Worries",
          "Contenu": "I had a bit of a problem and contacted support.  They were friendly and helpful.  They made sure I was in the loop.  Problem taken care of."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DaeShanae Davis Dupree",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T01:22:06.000Z",
          "Titre": "Excellent redemption fast and fun",
          "Contenu": "Excellent redemption fast and fun. I got disqualified for one survey but the other surveys I was approved for. Redemption same day it took about 5 min to verify my ID and another 5 min to receive the payment to my Paypal. There are so many ways to cash out including Venmo gift cards and bank and you can change from Paypal at anytime. You can redeem at 5 and it's the quickest 5 I got more than other surveys. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Reese",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:58:24.000Z",
          "Titre": "Great survey",
          "Contenu": "Great survey, have they paid their allow you to complete the surveys and your thorough?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bethany Dow",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:10:19.000Z",
          "Titre": "Earning money quickly",
          "Contenu": "Earning money quickly with the surveys, qualify better than most.  Cash out is quick as well.  I used PayPal and money was in my account within a few hours. Verify identity is a must to get paid."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyionnea",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:04:52.000Z",
          "Titre": "Great app",
          "Contenu": "I feel like the surveys were great and you get paid instantly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee Vorbach",
          "Nb_Reviews": 11,
          "Date": "2023-12-02T06:35:31.000Z",
          "Titre": "VERY Pleased...",
          "Contenu": "I was just answering surveys and didn't realize how much I had in my account. EarnHaus sent me an email asking if I wouldn't like to redeem!! I was surprised that I had so much so I redeemed for an Amazon egiftcard and I had it instantly!!! Awesome..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Howard",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T05:01:31.000Z",
          "Titre": "Easy Money",
          "Contenu": "After completing the requirements in order to cash out, I received payment in under 5 minutes, to my pay out preference.I enjoy the surveys and will recommend Earn Haus to friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:16:15.000Z",
          "Titre": "This app is one of the best",
          "Contenu": "This app is one of the best. It helps pass time by. It's not a get rich scam they actually do pay out. Thank you for finally putting a true and honest app out there and payments are quick! I received in my acct within 19 minutes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darrell McCrary",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T18:22:05.000Z",
          "Titre": "Authentic reviewe",
          "Contenu": "Doing all the different types of surveys in the lengthy questions sometimes personal but it's fun to me I like reading and it's all genuine. I almost forgot it is not fake they do pay and you have options on excepting your payment (s)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T04:57:35.000Z",
          "Titre": "Finally something I can trust to use my…",
          "Contenu": "Finally something I can trust to use my time with and they actually pay and I don't have to complete other tasks. I just want to do as many surveys as I can now that I trust them and it's worth the time. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Yohee",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T09:29:27.000Z",
          "Titre": "I like the surveys some are a bit…",
          "Contenu": "I like the surveys some are a bit lengthy but overall great. I do wish your payment would come sooner then 2 to 4 days. I do enjoy it though easy and fun way to make a few extra dollars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hannah Perry",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T14:03:23.000Z",
          "Titre": "Got paid for voicing my opinions",
          "Contenu": "They have lots of surveys available to take. I like that when I don't qualify for a survey, the site immediately searches for another that would be a better fit. If the survey owner rejects my responses, I still get a participation fee. There's a process for identity verification before you can redeem your payment but the process is quick and easy. This isn't going to replace your income at your job but it's  a good side hustle for extra money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Wallace",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T12:15:54.000Z",
          "Titre": "High paying surveys",
          "Contenu": "I like earn haus it's great affordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacqueline Catalina",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:16:12.000Z",
          "Titre": "This is one of the best sites for…",
          "Contenu": "This is one of the best sites for surveys.  The surveys are not too long, they are fun and it doesn't take long to earn enough to cash out.  They pay the quickest, too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Davis",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T09:03:09.000Z",
          "Titre": "They make several survey opportunities…",
          "Contenu": "They make several survey opportunities for you to take. On each survey choice they tell you how long the survey will take and tell you how much you will be rewarded. There's no guessing how much you'll make or how long your survey will last. If for some reason you're not able to take the survey you've chosen then you have plenty more to choose from. I think the money they offer on each survey is fair and when you decide to withdraw you don't have to wait long at all. I received my money on my PayPal account really quick. They also notify me often about new surveys. It's been a great experience for me so far. I've made some extra money just here and there in my spare time and it adds up quicker than you might think. I would recommend Earn Haus to people that want to make some extra spending money in their spare time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica G.",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:50:33.000Z",
          "Titre": "I enjoy the surveys",
          "Contenu": "I enjoy the surveys. The ones I get to do anyhow. My overall experience has been fairly pleasant. I haven't run into any real issues so far. The only think I would say makes it hard to stick with it is after so much time trying to get into a survey and taking the time to do it, then to just get pays of $0.20-$0.60 is disheartening. Hopefully the surveys experience gets better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noes",
          "Nb_Reviews": 15,
          "Date": "2023-12-21T16:58:51.000Z",
          "Titre": "I love earn haus",
          "Contenu": "I love earn haus. easy to redeem rewards. easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya McClain",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T14:58:57.000Z",
          "Titre": "I had a Great experience voicing my…",
          "Contenu": "I had a Great experience voicing my Opinion on Earn Haus. I recommend this Survey App."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cora Tott",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:24:30.000Z",
          "Titre": "I've been qualified for more surveys on…",
          "Contenu": "I've been qualified for more surveys on this site than any other site. It's easy to redeem rewards after verification."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Edmunds",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T04:04:18.000Z",
          "Titre": "This is a great site to earn extra…",
          "Contenu": "This is a great site to earn extra cash.  It's not like the other survey sites where you have to wait to see if you are a fit to take a survey.  Earn Haus does not have that feature and lets you choose which survey you want to participate within and go from there with no problems at all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:51:57.000Z",
          "Titre": "New experience that pays",
          "Contenu": "It was a learning experience taking surveys and earning monie. Everything seems to ruin smoothly and I'm looking forward to continuing with these surveys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BROKEDAMOLD",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T01:53:23.000Z",
          "Titre": "I wish to begin by stating the fact…",
          "Contenu": "I wish to begin by stating the fact that I do not normally choose to write Reviews...With that being said,I was pleasantly surprised and also impressed by the simple/no nonsense process of withdrawing,as well as receiving my rewards!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katrina Joy Bonnell",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T06:18:43.000Z",
          "Titre": "I didn't qualify for a lot of the surveys.",
          "Contenu": "It was easy to cash out but I wasn't expecting it to take 3 days to get my money. When it said it was Going to be immediate"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rock",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T20:12:37.000Z",
          "Titre": "Awesome Love"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Bowes",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T22:58:26.000Z",
          "Titre": "Just logged in today and already got…",
          "Contenu": "Just logged in today and already got paid. So far first impression is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T00:39:15.000Z",
          "Titre": "It was quick and no problems…",
          "Contenu": "It was quick and no problems transferring my reward to PayPal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Willis",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T14:14:11.000Z",
          "Titre": "I like it so far wish the surveys was…",
          "Contenu": "I like it so far wish the surveys was shorter with alittle more to win. But it’s alright and actually pays out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 13,
          "Date": "2023-11-15T02:44:31.000Z",
          "Titre": "Everything is good except the $1 off under 10 withdrawal",
          "Contenu": "Everything is going good except the whole taking a dollar if you cash out from under $10 that's bull scat they need to take that off the game"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pansey",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T04:15:58.000Z",
          "Titre": "Rewarding experience",
          "Contenu": "I received my reward much faster than expected. All in all, I would recommend this site to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Chittum",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T02:48:26.000Z",
          "Titre": "Great site!",
          "Contenu": "So far it has been an awesome experience. Fast surveys, I'm put directly into surveys that are compatible with me. Only issue is that I thought the payout would be instant. Other than that, you're doing great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lashawn Washington",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T05:31:15.000Z",
          "Titre": "My experience has been great because I…",
          "Contenu": "My experience has been great because I have been getting some information that I did not already know. I’ve been needing away to make some extra cash so it really helps. I really enjoy doing the surveys. It’s something I could do a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiyandrea S",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T17:38:17.000Z",
          "Titre": "It’s a legit website",
          "Contenu": "It’s a legit website, with easy to do surveys that can be relatively easy to take and compensation is fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trincell Shelvin",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T16:27:15.000Z",
          "Titre": "Awesome platform for doing paid surveys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PDC",
          "Nb_Reviews": 12,
          "Date": "2023-11-18T23:08:32.000Z",
          "Titre": "Very interesting surveys and they…",
          "Contenu": "Very interesting surveys and they deliver on their promises and are a prompt when sending Amazon gift cards. I love this site!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Seymour",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T23:06:55.000Z",
          "Titre": "It was not hard to get paid!",
          "Contenu": "It was not hard to get paid, and that meant alot.  Surveys are good, and appropriate for the subject matter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roxie Young",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:41:35.000Z",
          "Titre": "It was super easy to earn doing these…",
          "Contenu": "It was super easy to earn doing these surveys and super fast to cash out the earning"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lukas D",
          "Nb_Reviews": 6,
          "Date": "2023-10-17T19:03:35.000Z",
          "Titre": "Easy & reliable",
          "Contenu": "Easy to verify ID with a postcard and payment went through within a few hours after requesting it. There are regularly good surveys available and they pay decently well for my time. Thanks for the extra cash Earnhouse"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Star Bain",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:33:23.000Z",
          "Titre": "I love it!",
          "Contenu": "I love it!! I was iffy at first but omg got the money literally 5 -10 min later!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Davis",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T20:24:59.000Z",
          "Titre": "Great customer service",
          "Contenu": "I like the survey selection I've been given.When it came to fixing a problem I had with redeeming earn haus was on top of it right away.Thank you earn haus for your professional and timely execution of my problem.Great job!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christal",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T15:40:28.000Z",
          "Titre": "The surveys are very interesting and I…",
          "Contenu": "The surveys are very interesting and I learned a lot from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frances Nicklas",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T07:36:33.000Z",
          "Titre": "Pay out outstanding!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T20:25:14.000Z",
          "Titre": "Grate way to make money",
          "Contenu": "I like the surveys available I made my first 5$ in no time an was able to cash out at $5 but I did another survey for $5 I was asked to subcribe to a 3month membership to a music app and I have not got my credit for it it’s been 2days now and it has not given it to meUPDATE!!!!!I finally got my $5 for the survey this is a legit survey app sometimes it does take up to 15days to apply the credit to your account but only takes about 5-10mins to get your money when you withdraw the amount"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Kent",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T17:45:35.000Z",
          "Titre": "Very good service and the surveys are…",
          "Contenu": "Very good service and the surveys are easy to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "andrew Barker",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:46:15.000Z",
          "Titre": "Very quick payment process",
          "Contenu": "Very quick payment process. Just wish polls payed a bit more given that some of them take quite a bit more time then they say"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:53:00.000Z",
          "Titre": "I love it and the survey help people…",
          "Contenu": "I love it and the survey help people get easy money and learn more about our city and county and good for them to know more about yo self and other to and help with care for other people to much love"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Granberry",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T17:04:48.000Z",
          "Titre": "Love this site",
          "Contenu": "Surveys are easy and redeeming my rewards was very quick and easy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristine Helms",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T16:18:47.000Z",
          "Titre": "Verification was super easy",
          "Contenu": "Verification was super easy. Cashing out was even easier. I got it with in seconds. Thank you I will continue to do surveys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Eaddy",
          "Nb_Reviews": 8,
          "Date": "2023-11-15T17:43:55.000Z",
          "Titre": "I was able to cash out relatively…",
          "Contenu": "I was able to cash out relatively quickly. I was trying the site to see if it's worthwhile, and was pleased with the experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:43:14.000Z",
          "Titre": "It's fun and entertaining",
          "Contenu": "It's fun and entertaining,  I love the different variety of ways to make some extra cash. It's very easy to understand and use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 11,
          "Date": "2023-10-21T00:55:21.000Z",
          "Titre": "This is the Best ever…",
          "Contenu": "I had a problem trying to verify through the selfie, so I had them mail me a postcard with an id number and pin to verify my address. It took a second to verify and then I redeemed $10.55. It was only a matter of seconds and the funds were in my PayPal account! I highly recommend Earn Haus. They are also great at returning your email message! You have to live in the United States, so this is good to know for everyone that lives outside the US. Thanks Earn Haus you are absolutely awesome 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marlon Tate",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T12:30:13.000Z",
          "Titre": "The process was easy simple and secure"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Russell",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T09:47:55.000Z",
          "Titre": "Extremely satisfied!",
          "Contenu": "It didn’t take very long at all to accumulate 5.00. When I cashed out, it took 9 minutes to hit my PayPal account. EXTREMELY SATISFIED! Thanks Earn Haus!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Keller",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:34:19.000Z",
          "Titre": "Earn haus cash out awesome",
          "Contenu": "It was great an only took about 5 minutes to cash out I just hope I get great surveys in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Weitzel",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T05:27:29.000Z",
          "Titre": "It's legit and payment in in ur account…",
          "Contenu": "It's legit and payment in in ur account in mins."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Evelyn Blanco",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:28:40.000Z",
          "Titre": "Pays out quick within 15 mins I love…",
          "Contenu": "Pays out quick within 15 mins I love this app. 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara Chipps",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T05:59:50.000Z",
          "Titre": "Most surveys can't do …",
          "Contenu": "It was very nice except that most of the surveys for some reason can't do them other than that it went great. Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felicia Bell",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:35:51.000Z",
          "Titre": "They kept their word on how they…",
          "Contenu": "They kept their word on how they operate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T16:17:13.000Z",
          "Titre": "It’s a great service",
          "Contenu": "I love the service the only thing I don’t like is having to take a picture of my ID and taking a picture of myself to have to cash out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Collins",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T12:43:10.000Z",
          "Titre": "Earn Haus is awesome!",
          "Contenu": "This site made the surveys easy and the cashing out process even easier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sparkle",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T11:01:47.000Z",
          "Titre": "Earn Haus",
          "Contenu": "Earn Haus has great benefits and great customer service. I'd definitely recommend to everyone I know and don't know!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassidy Wilberg",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:15:06.000Z",
          "Titre": "Took a while to make enough but the…",
          "Contenu": "Took a while to make enough but the cash out process was easy and  the payment came within minutes nice site I will definitely continue to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph Fraley",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T04:40:09.000Z",
          "Titre": "What made my experience great is I…",
          "Contenu": "What made my experience great is I didn't have to go through channels to credit my reward with PayPal, Earn Haus team did it for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonda Dean",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:49:03.000Z",
          "Titre": "The survey were easy and fun",
          "Contenu": "The survey were easy and fun. And the withdrawal process could not have been easier. And it was fast. I just started taking surveys today and got the money in my PayPal account all ready. It was easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Uncle Scar",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:18:49.000Z",
          "Titre": "Come share the same experience with me",
          "Contenu": "Being true allowing me to give my opinion on surveys and get rewarded from it ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "joseph lupyak",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T05:52:22.000Z",
          "Titre": "Absolutely the best experience I've…",
          "Contenu": "Absolutely the best experience I've encountered with a survey cash app. And when they say pay same day they mean it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Perez",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:45:16.000Z",
          "Titre": "It is good place to take surveys for my…",
          "Contenu": "It is good place to take surveys for my payout realy fast and yea verry happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felicia Lee",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T11:33:12.000Z",
          "Titre": "I took the surveys and really got paid",
          "Contenu": "I took the surveys and really got paid. A great app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Crews",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:04:55.000Z",
          "Titre": "The entire process was quick with…",
          "Contenu": "The entire process was quick with absolutely no issues. Thank You so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah Bowie",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:26:09.000Z",
          "Titre": "Earn Haus helps me make money,and have…",
          "Contenu": "Earn Haus helps me make money,and have fun while I do it! Thank you Earn Haus! You have been,and continue, to be a blessing to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DC",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T00:51:37.000Z",
          "Titre": "Great surveys",
          "Contenu": "Great surveys easy verification quick redeem process with lots of choices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Towns",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:50:33.000Z",
          "Titre": "I love this platform",
          "Contenu": "I love this platform. Really pays . Not fake at all.. go guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shemica Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T08:00:33.000Z",
          "Titre": "Reliable and easy to cash out my reward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T18:14:32.000Z",
          "Titre": "Great place",
          "Contenu": "Great place, great surveys.  A great escape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Stanley",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T10:27:21.000Z",
          "Titre": "Always great to work with",
          "Contenu": "Always great to work with. Love the speed of surveys and love the quick compensation"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 9,
          "Date": "2023-11-07T23:23:45.000Z",
          "Titre": "Happy surveys",
          "Contenu": "The surveys are fun and interesting. Gives people a chance to give their opinions. I enjoy them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "w Williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:42:05.000Z",
          "Titre": "It was great I love you guys keep up…",
          "Contenu": "It was great I love you guys keep up the great work 💕💕💕"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa P",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T19:47:59.000Z",
          "Titre": "I like it!",
          "Contenu": "I like it!! once they verify who you are then it’s ago and a good way to save"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maribel Savas",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T07:54:48.000Z",
          "Titre": "Wow it’s my first time here",
          "Contenu": "Wow it’s my first time here. Just redeem my earnings to try the transaction and I received it in just a minutes thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trace Carter",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T17:27:32.000Z",
          "Titre": "Interesting and I can make money doing…",
          "Contenu": "Interesting and I can make money doing the surveys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryason Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T08:19:12.000Z",
          "Titre": "Heck yeah It actually works",
          "Contenu": "Heck yeah It actually works. I earned $ by simply doing surveys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Latasha Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:03:53.000Z",
          "Titre": "It was fast easy and the payout process…",
          "Contenu": "It was fast easy and the payout process was also easy and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Blackford",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:17:09.000Z",
          "Titre": "The Swagbucks killer is here",
          "Contenu": "Nice, easy, and much faster than Swagbucks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eulalia Woods",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T04:53:18.000Z",
          "Titre": "So much better than other survey sites",
          "Contenu": "So much better than other survey sites. Easy to navigate, lots of ways to earn. Payout was fast. I'm in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "blake mcknight",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T17:35:51.000Z",
          "Titre": "Great job keeping me up with surveys an…",
          "Contenu": "Great job keeping me up with surveys an making sure it’s worth it keep it up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison Poland",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:13:55.000Z",
          "Titre": "Easy to take",
          "Contenu": "Easy to take surveys hard to qualify and get to the cash out amount of $5"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geoffrey Richard",
          "Nb_Reviews": 3,
          "Date": "2023-10-18T20:46:30.000Z",
          "Titre": "Fairly easy to verify identity and then…",
          "Contenu": "Fairly easy to verify identity and then claim my reward. Paypal is my preferred reward and it was quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T18:44:13.000Z",
          "Titre": "Smooth and simple",
          "Contenu": "Smooth and simple! No problems using site or receiving payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seda Ward",
          "Nb_Reviews": 5,
          "Date": "2023-11-17T01:32:45.000Z",
          "Titre": "happy with the help, timely responses and overall customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Bass",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T15:21:42.000Z",
          "Titre": "I have had a good experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruby",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T04:29:48.000Z",
          "Titre": "Fun and easy",
          "Contenu": "The servays are interesting fun and easy I enjoy this app very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martine Charles",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T05:38:29.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I appreciate that the payouts are quick"
        }
      ]
    }
  ]
}