{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "electronicexpress.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Shaginaw",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:43:49.000Z",
          "Titre": "Didn’t tell me order was cancelled…",
          "Contenu": "Didn’t tell me order was cancelled until 10 days later and the only way I found out was because the charge dropped off my credit card. Don’t say you have something , take payment, then not have it in the first place and not even notify the customer of the cancelation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rose",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:09:56.000Z",
          "Titre": "Got overcharged because the online system is screwy",
          "Contenu": "Placed my order on the website and got overcharged due to what appears to be a backend programming issue in their online system. I selected a $130 delivery+installation service and during checkout it added and then later removed an additional $75 delivery fee. My final receipt didn't reflect this fee so I thought it was all good and sorted, but my credit card did. I was overcharged by $75. This made sense because when the delivery day arrived, the delivery crew's work order showed delivery -only- which caused them to refuse to install the washer and dryer I ordered until during delivery, their app updated and showed a separate work order for delivery+installation, like I paid for. I am still trying to get this matter resolved. I called EE customer support and they said their side only showed what was on my receipt, so I'd need to contact Synchrony and have them resolve the matter which I did, and they told me it will take upwards of 65 business days. Unreal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Wells",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:50:04.000Z",
          "Titre": "Supervisor, Rebecca, & Shipping are subpar!",
          "Contenu": "The shipping company you used is horrible.  Eleven days and it did not arrive.  Alex, from Electronic Express, had the shipment returned.  I called regarding a refund and your horrible Supervisor, Rebecca, has the most condescending tone.  After her speaking to me like I was a child, I unleashed.  I will never do business with your company again.  I will also take this to social media."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan Giles",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:13:30.000Z",
          "Titre": "Recieved Broken TV, No Replacement Offered",
          "Contenu": "Bought a Samsung Frame TV on a Black Friday deal, roughly $500 off of normal retail. When I received the TV it was broken with visible damage to the screen and the unit flashed light without ever turning on. When we asked for a replacement Electronic Express stated that we would need to return the unit in all of it's original packaging to process a refund (the TV at this point is on the wall with the box and packaging in the garage and the garbage), then purchase a new TV from them at the current (non Black Friday) price. The customer service rep was rude as well. Thanks for costing me $500. Ill never purchase from a 2nd tier electronics retailer again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mahbubur Rahman",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:25:01.000Z",
          "Titre": "I bought in stock keyboard stand",
          "Contenu": "I bought one in stock keyboard stand.  Later received cancellation email referring out of stock. Have been waiting for refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Concerned Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T02:33:54.000Z",
          "Titre": "Purchased a TV and there was no update…",
          "Contenu": "Purchased a TV and there was no update for some days until I emailed them. Now, they confirmed it was shipped but no expected date of arrival. Quite disappointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Mulholland",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:41:28.000Z",
          "Titre": "Ordered a MSI Codex Gaming Desktop",
          "Contenu": "Ordered a MSI Codex Gaming Desktop - i5 13400F, was sent a MSI Codex Gaming Desktop - i5 12400F?They told me that they don't sell that computer and that the manufacture must have sent the wrong one.Then they tell me that I can return it...I use it for work, and it took them a week to ship it from Nashville, I told the that I can't go 2-3 weeks without a computer with the back and forth.Just be careful dealing with this company, their reply to me was well, we tried to help you? How about they send me another computer and I'll send this back when I get the right one???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edwin/Or/Geary Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:36:59.000Z",
          "Titre": "I went to buy a new refrigerator with…",
          "Contenu": "I went to buy a new refrigerator with my father. I had just got out of prison a few months earlier and needed to establish credit so I had my father cosign, but the fact that I had had a criminal record. I was unable to get financed even with my father‘s excellent credit, they turned me down on account of my felony, I wished I could sue that finance company. Thanks for a second chance America. never to return to your store again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:31:25.000Z",
          "Titre": "Scam Company",
          "Contenu": "I placed an order which was supposed to be delivered on a Saturday, there was an attempted delivery on Friday and they refused to deliver on the weekend. Electronic Express made restrictions on the shipment so the package could not be picked up, and I had to be there for the delivery. The problem is I work a normal 9-5 job and I can't take off of work for a sound bar delivery. Okay, no big deal, let's just cancel the order and refund me... except they will charge me $40 for cancelling my order. This same exact problem is happening with the TV I ordered from this company except with $300 instead of $40 and I wholeheartedly suggest you look at any other company to buy your electronics. This company is full of scam artists and the assistant manager I spoke with had an attitude from the minute she took over the call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Muller",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:07:21.000Z",
          "Titre": "Don’t mess up your address, you’ll get scammed",
          "Contenu": "Don’t mess up your address. Forgot to put my apartment number and once the order is placed you can’t edit your address. Got to my apartment complex and they returned it for not having the apartment number. Shipping was 100$ so now I’m out a tv and 100$. Complete waste of time and money. Will never be using this scam again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:00:45.000Z",
          "Titre": "I received the wrong item",
          "Contenu": "I received the wrong item, Hannah emailed me strict rules to return which I took to fed ex and the shipping is over $100 which she is refusing to print out the shipping label for. Will be reporting this and hopefully someone comes to their senses and emails me the return label. I have never seen a company refuse this in 20+ years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C Edward Lutchey",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:18:46.000Z",
          "Titre": "Worst service ever",
          "Contenu": "Worst service ever. Paid for a Washer Dryer set in September. Pilot delivered the washer but lost the dryer. A week later they found a dryer. Delivered it on a broken pallet and when I opened the box 📦 the dryer was damaged on the side. Spoke with Rebecca in customer service which they returned the money for the washer and dryer. I called them and said hey, you gave me a credit for a washer that I still have. So they rebilled my card. So i asked about getting a new dryer to complete the set. I've called them several times and have just refused to take care of the issue. I spoken with the Sales manager JD who said he was working on it 3 weeks ago. I asked them to have a district manager speak with me and they never returned my call..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T07:49:35.000Z",
          "Titre": "Never got the shipment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Um",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T06:04:36.000Z",
          "Titre": "Ordered a $99 item and shipping was…",
          "Contenu": "Ordered a $99 item and shipping was $99. I chatted with customer service and asked why shipping was so much and they said it was what it actually costs them to ship the item. When I received the item, it was a super light, super flat box that was barely taped together. It could not have cost more than $20 to ship."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Richmond",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:18:08.000Z",
          "Titre": "Customer service was totally lacking",
          "Contenu": "Customer service was totally lacking.  My order had the wrong shipping address and I was told that the order label had already been printed and it had shipped, even though UPS a had not yet scanned it into their system.  As a result, there was nothing that they could do.  When I asked about reordering when I didn’t receive my TV they were able to cancel my order and have it returned.  They did not inform me of the cancellation.  I found out when PayPal notified me my shipment “might be delayed”.  I have had good customer service in the stores in the past, but the online service, or lack there of is why I’ve shopped my last at Electronic Express.  I bought the same TV at Best Buy and it works great!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew K",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T17:25:37.000Z",
          "Titre": "Poor customer service",
          "Contenu": "All was well until the delivery time. Waited two entire days at home waiting while being told the delivery is on the way. Store blamed it on a third party delivery service but was it was the store that recommended that service. Calls to store or delivery service were  not returned. A complete waste of our time. We finally cancelled the order and got our money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael frame",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T17:18:06.000Z",
          "Titre": "Item delivered to a different address…",
          "Contenu": "Item delivered to a different address that is not mine and I’m not getting my product or credit to my credit card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philda",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T13:43:46.000Z",
          "Titre": "Terrible Service I ordered a refrigerator online on a…",
          "Contenu": "I ordered a refrigerator online on a Thursday. Earliest deliver was scheduled for Monday window of 3-6 pm. By 8 pm no one had shown up OR called!  I called Tuesday morning and got a service rep who said I’ll call you back before noon. No call ever came. That afternoon I called and got a different service rep and demanded a refund. I’m still waiting for it to go back onto my charge card. I may have to dispute it with my credit card company to get my refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FEI LIU",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:18:37.000Z",
          "Titre": "I didn't get my TV",
          "Contenu": "I didn't get my TV. The shipping status is not updated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Baker",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T12:33:55.000Z",
          "Titre": "Dryer arrived damaged (or was sold & shipped damaged, hard to judge)",
          "Contenu": "Electronic Express asked for a phone number so their shipper could call ahead and schedule delivery.  There was no call and the shipper dropped in in our driveway while we were out of town for the weekend. More problematic, the dryer arrived on a pallet, unprotected and severely damaged. It was clear something heavy got stacked on it during shipment as it was not protected or labeled against stacking in transit. The retailer has been stubborn in response to the damage and we are stuck with an unusable appliance, in spite of our emailing a photo of the damaged shipment the day we arrived home to find it in our driveway. In hindsight it was unwise to purchase an appliance from out of state, but this specific model wasn’t available locally.  Steer clear: the deal was simply too good to be true, and they don’t stand by their (unreliable) shipping methods."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T16:44:31.000Z",
          "Titre": "Purchased a new 65” LG TV and LG sound…",
          "Contenu": "Purchased a new 65” LG TV and LG sound bar.   It was to be installed on wall with sound bar attached below tv with bracket mounted to tv.  Electronic express does not carry a bracket to do this.  I spent 2 hours with store staff trying to figure out a solution to no avail.  Received my $2,800 back before leaving store.   We to Best Buy and bought same equipment with the bracket to hold sound bar.  It took 32 minutes.  Frustrated to say the least."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cherryln Parker",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T18:51:51.000Z",
          "Titre": "Received a used, broken toy.",
          "Contenu": "I received a toy that had been previously used. The box was torn, the screw to the battery compartment was stripped and the electronic components of toy did not function."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TT",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T14:06:09.000Z",
          "Titre": "i don't trust this company they took my…",
          "Contenu": "i don't trust this company they took my money and the UPS company had a field day with package then i heard package was requested return by me still having gotten my money back. i do not recommend using to get electronics they will rip you off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jorge Gil",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:53:04.000Z",
          "Titre": "Order was canceled and was never…",
          "Contenu": "Order was canceled and was never notified."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN NEVINS",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T17:43:34.000Z",
          "Titre": "Currently having an issue with pc where…",
          "Contenu": "Currently having an issue with pc where it stop codes. I would not expect this for the price tag… I should have no issue’s if the pc was quality and stress tested before shipment! It has all the parts to be able to run every title out without flaw but seems to crash constantly!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elisabeth",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T13:57:58.000Z",
          "Titre": "Dishonest",
          "Contenu": "I called about a MacBook and the employee told me he would sell me the display for a discounted price. When the man assisting me in store checked out the computer, I asked if the laptop was at the discounted price. He reassured me that it was. I leave and look at the receipt and he did not give me the price promised. I immediately walked back in and the man working the register gave me the money back I was overcharged. The manager put in his code without an apology or even looking me in the eye, which makes me believe they wanted to get away with it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:31:11.000Z",
          "Titre": "Appliance Installers do not follow Installation Instructions",
          "Contenu": "Sales experience was good although installation was extremely poor resulting in not only shattered wall oven door but also damaged kitchen cabinet door. Installation team failed to follow basic installation instructions found in manual: (1) did not remove both wall oven doors to reduce weight and (2) did not install spacer feet resulting in improper fit. One of the installers told my wife we needed a trim piece to correct poor fit caused by spacer feet not installed consistent with installation instructions. We are still searching for a solution to resolve our damaged cabinet door as stain color match is a challenge. Very disappointing experience!"
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Wilfredo",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T19:56:51.000Z",
          "Titre": "Over seas shipment orders",
          "Contenu": "For starters. You can start by  allowing shipment to territories of the US and not only the continental USA. My order was sent to PA, and then for them to ship the package to Puerto Rico for which I had to pay double  shipment altogether, (your shipment to PA plus the shipment  to PR.) That's why I gave you 1 star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "j bangs salon",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T20:11:41.000Z",
          "Titre": "BAD experience with instal of dishwasher",
          "Contenu": "The 2 guys who delivered were definitely inexperienced.  They had no idea how to turn off power or instal new dish washer.  I asked them to leave without completing the instal.  \"we have never installed a dishwasher when there is not a garbage disposal\".Completely unacceptable to pay for installation and have someone this inexperienced to show up. They refused to unhook the old machine and haul if off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Waiting for Appliances",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T14:06:43.000Z",
          "Titre": "The Truck broke down in Alabama.",
          "Contenu": "Truck broke down and I have not receive my appliances as of yet.  I did wait for 2 hours after the initial window period of several hours which was a waste of an entire day.  I received nothing but a sorry and then a rescheduling at 7AM.  Oh yeah did I mention that I am an hour away.  Now I know better and told them to give me an hour notice....I guess they will have to wait if that don't follow give me notice.  Also, I am writing this before I have received my appliances and that's why they have the worst rating.  I guess the auto-robot that sends out the review didn't get the message either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mykal Cress",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T18:36:31.000Z",
          "Titre": "ZERO communication skills from this…",
          "Contenu": "ZERO communication skills from this company. I still haven’t received my TV and have asked 4 separate times of when it will arrive. I get the same “we’re checking and will get back with you” response. It said the TV would arrive Tuesday. It is now Wednesday and now says I confirmed Friday as the delivery date. I work on Friday and never made an appointment and brought this to the company’s attention Monday morning. Still no reply even though I’ve messaged multiple times after. This is the most unprofessional transaction I’ve had and I will never order another item from this place. I spent way too much money to be ignored."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ruth Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:29:25.000Z",
          "Titre": "Electronics Express sells garbage",
          "Contenu": "They sent me an obviously defective item. When I inquired about returning it, Electronics Express sent me a form letter full of contradictory requirements that make it very difficult to return."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 4,
          "Date": "2023-06-01T22:40:36.000Z",
          "Titre": "Miserable experience with no customer support",
          "Contenu": "Ordered in-store. Item wasn't ready when promised so I tried to cancel over the phone. Store manager insisted an in-store visit was a requirement to cancelling an order and told me \"oh, that's tough\" when I explained it was almost a two hour round trip. Called my credit card company to dispute the charge and failed to do that until I exhaust all options with Electronics Express. Almost five months later, multiple cold drops to voicemail, not a single employee with an answer available, and still have a $500+ charge I can't get anyone to drop. I recommend shopping with literally ANY store other than Electronics Express."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Eads",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T19:06:34.000Z",
          "Titre": "False  advertising",
          "Contenu": "The product detatils of bone induction headphones listed the output frequency as 20hz/20000hz! The product box details was 150hz/20000 hz. Meaning the BASS frequency from 20 to 150hz did not exist.  Falsely advertised. Return shipping was not included! William Jackson Eads"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M L",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T13:11:16.000Z",
          "Titre": "Customer service was horrible",
          "Contenu": "Customer service was horrible. They were rude. The items I purchase. Didn’t work. They wouldn’t let me return them and exchanged them. I will never use this company again. Worst customer service ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dea",
          "Nb_Reviews": 4,
          "Date": "2023-06-14T00:04:22.000Z",
          "Titre": "Find out issues before that Lil warranty expires!",
          "Contenu": "Your business is good with ordering, delivery etc. Unfortunately I got the “lemon”, and currently have to pay a monthly subscription to HP to constantly jump on board to “fix” the issue. Of course I had all the issues begin after the warranty. So you guys told me, too bad. I literally had to purchase a brand new system just to continue running my business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Fuqua",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T23:51:37.000Z",
          "Titre": "Highly disappointed",
          "Contenu": "Honestly, I'm getting a refund. I waited for the 1st delivery from 5 till almost 9:30pm. The stove was installed in the house. The refrigerator was damaged per installer. I went into the Oakridge store because they up a delivery and said someone would call. I finally called and was rescheduled for the 1st. Guys was pulling off when I got there. I wanted a call because no one is living there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ss",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T23:27:08.000Z",
          "Titre": "Every appliance I had malfunctioned",
          "Contenu": "Every appliance I had malfunctioned. I attempted to contact the local store and corporate numerous times over the coarse of 6 months ,only to get No assistance. I spoke with the corporate assistant who always would say she would return my call and never did .The warranty on appliances was no help … they would send technicians to the home and they would leave without doing anything only to reschedule another appointment 8 weeks out…we eventually paid ourselves to have them serviced privately. Poor service at its finest. Nothing short of a nightmare, I will never shop there again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Rizzo",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T15:17:06.000Z",
          "Titre": "Cancelled Order with zero explanation",
          "Contenu": "Called ahead of time to make sure that item I wanted to purchase was being sold properly at the price on website. Was assured this was the correct price. Made the purchase. Two days later my Paypal was refunded the money. No email, no explanation, no nothing. So insanely unprofessional. Really at a loss for words over how this was handled. I'm assuming they chose not to sell it at this price, but I'm not sure as I've receied nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marty",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T13:33:05.000Z",
          "Titre": "Very poor Customer Service",
          "Contenu": "Very poor Customer Service!  Delivery department worst l have ever dealt with, told we could setup delivery time but they refused to work with us.  Then made no attempt to right the wrong.  Will NOT use this business again!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TONIA OSIECZANEK",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:44:15.000Z",
          "Titre": "Insurance program sucks",
          "Contenu": "I turned my laptop in at the Jones Valley location approximately 3 months ago to be looked at under warranty purchased. I have yet to hear back from anyone regarding status, even after calling the store 4 times now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marty",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T16:22:12.000Z",
          "Titre": "We’ve complained about our experience…",
          "Contenu": "We’ve complained about our experience more than once and customer service argues with us. I’m not going to go over all of it again but nothing was done. And no one tried to make anything right. We do not recommend this store."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANDREW WELENKEN",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:58:43.000Z",
          "Titre": "I waited so long for the Samsung…",
          "Contenu": "I waited so long for the Samsung refrigerator panels that I couldn’t wait anymore so I bit the bullet and took what they had stocked. … I hate the colors that I received. So I emailed corporate and told them about my experience. Months have passed and I haven’t heard a thing from them. Too bad because I had a pretty good experience other than having to wait for panels that never came in. I don’t see how you expect someone to wait so long with an incomplete fridge in a brand new home. You should have a better policy set up from the beginning to let the customer know when they order something and it takes almost a year to receive the full product. I will be purchasing new panels and it won’t be from electronic express!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lindsey",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T19:40:01.000Z",
          "Titre": "First they broke my cabinet installing",
          "Contenu": "First they broke my cabinet installing, second the oven hasn't worked since day 1.  I tried submitting a ticket to  GE and they want me to pay to fix it.  WOW just amazing.  The dishwasher was delivered but they couldn't install it because they didn't know how so we had to send it back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ti Dallas",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T16:24:44.000Z",
          "Titre": "Shipped Damaged!!!",
          "Contenu": "I purchased a set of Cuisinart Elite flatware as a gift for someone and was shipped a ripped box of flatware not suitable to give as a gift. When I contacted customer NO service, I was told that I would have to pay for shipping to return it!!! The manager was suppose to look in to it but apparently did not!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debra Weisgable",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T18:55:04.000Z",
          "Titre": "What went wrong???Placed and used…",
          "Contenu": "What went wrong???Placed and used credit card for order #EE`62185.9/25 Received email item backed ordered. 9/30 followed up on order.10/2 received email order was shipped 9/23 and by the way it's lost and it's going to take 7-14 business days to find out what happened to my order.  Is this some sort of scam you're running??????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jorge T",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T07:56:19.000Z",
          "Titre": "Terrible delivery department",
          "Contenu": "Purchase a washer and dryer set with shipping and installation on July 28. I was not present the day of the installation (August 4) and my 13-year-old son received the technicians. The technicians did not verify the work and the dryer did not work. I contacted the delivery department and they had to come on Tuesday, August 7 to change the dryer. They called me to tell me that they couldn't go and they changed the date to Friday, August 11. They also did not arrive on Friday August 11th and I canceled the purchase, They came to pick up the washer and dryer on August 18th.Terrible service, they do not meet delivery deadlines and delay in scheduling visits due to having many orders.If you don't have staff to serve customers, hire more technicians."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LORRAINE CARRILLO",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T03:39:13.000Z",
          "Titre": "The dishwasher I bought at the outlet…",
          "Contenu": "The dishwasher I bought at the outlet store in Murfreesboro was sold to another customer! I purchased the dishwasher from John the general manager 4 weeks prior but he failed to label it as sold. This was very upsetting to me. He did refund me the money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ziara Beckham",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T02:40:27.000Z",
          "Titre": "Shady company that takes your money.",
          "Contenu": "On June 4th, I bought a gaming laptop and they waited till the day after I spent $619 to tell me that the item wasn’t in stock and that it was coming to their warehouse “next week”. At least they gave me the option to get a refund but the company is so sketchy and based on the reviews I don’t even know if I WILL get my money back. I don’t recommend buying anything from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T16:15:38.000Z",
          "Titre": "Two guys came took water dispenser…",
          "Contenu": "Two guys came took water dispenser apart said it needs a light bulb but didn’t have one said you guys would send someone with a light bulb haven’t heard a word yet?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rouchan",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T13:28:40.000Z",
          "Titre": "Apparently the truck broke down and the…",
          "Contenu": "Apparently the truck broke down and the product could not be delivered at the designated time. The product was delivered at 9:30 pm. Not acceptable. Too late . Should have rescheduled. Would not recommend"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "B.W.",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T13:20:38.000Z",
          "Titre": "Not Honest",
          "Contenu": "I ordered a dryer that said 1 in stock. The company called me and said “they just shipped the dryer, it just left their warehouse and would be to a freight terminal in our town in 6 to 10 days” the next day they emailed to say that the dryer is out of stock, but “they have several already on order and they will be to their warehouse in 4 to 6 weeks”. Strange since they told me they already shipped the one I ordered to us. Then I get an email that says the dryer is no longer manufactured and they can’t order anymore so they are canceling my order, also strange considering they said they had already ordered several and they would be in stock and 4 to 6 weeks. I already knew the dryer in my color was no longer manufactured, but some stores still had some in stock. I was looking for my exact color to match my washer, and because they are no longer manufacturing that color the ones that are left are really really expensive. It bothers me that a company said that it had already shipped something and even called me to tell me, but that was a lie and then it said that it had already ordered more to be coming in stock, when in fact, that was a complete lie too. In the meantime, I have to wait for them to reimburse our money before we can buy another dryer…Still waiting btw. Honesty is the most important thing to me. If your company cannot be honest with me, they cannot get my service now or in the future I would have been fine being told the dryer was out of stock and they were going to try and order more and then find out they weren’t able to, but instead I got lied to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Cribbs",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T20:39:20.000Z",
          "Titre": "if you order online make sure and let…",
          "Contenu": "if you order online make sure and let them install the appliance. they will not back up the product they are selling if you don't. I will NEVER buy anything from them again and would protest outside their store if I had time. as to your reply, only one way to wire it in without reverse polarity..... I'm not a moron..also you are right here in Chattanooga Tennessee not several states away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Agustin Gonzalez",
          "Nb_Reviews": 7,
          "Date": "2023-08-23T18:54:32.000Z",
          "Titre": "The packaging was poor they threw all…",
          "Contenu": "The packaging was poor they threw all my transformers together instead of wrapping them individually to avoid damaging the boxes if you are collecting think twice about ordering multiple items at once some will be damaged for sure. Individually you may have better luck"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ti Dallas",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T16:11:03.000Z",
          "Titre": "SHIPPED DAMAGED MERCHANDISE",
          "Contenu": "I purchased a set of Cuisinart Elite flatware as a gift for someone and was shipped a ripped box of flatware not suitable to give as a gift. When I contacted customer NO service, I was told that I would have to pay for shipping to return it!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Goulet",
          "Nb_Reviews": 1,
          "Date": "2021-08-22T22:12:32.000Z",
          "Titre": "Used product shipped as a new product",
          "Contenu": "I ordered new Sony WF-SP800N Earbuds. I received a product that was very clearly opened. The charging cable sent was not a USB-C. All of the different sized silicon rubber parts (for different sized ears) were missing. You can even see someone else's skin cells and fingerprints on the earbuds.I received a return authorization listing the product as defective. The product was not defective. Electronic Express shipped a used product with incorrect and missing parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Pratt",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:38:59.000Z",
          "Titre": "Many Errors I can forgive but too much communication with a requested apology.",
          "Contenu": "I did not receive the product and I had to fight to get a refund.  I am assuming the refund was completed at this point. After many errors on 2 orders I finally received an apology after requesting the apology."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DEBORAH HUBER",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T23:16:03.000Z",
          "Titre": "I think it was more about the Sale than…",
          "Contenu": "I think it was more about the Sale than customer experience!!I cautioned the salesperson that several times I’ve had bad service and delivery from other range retailers.He assured me that wouldn’t happen, with that we ordered over $5000 worth of appliances.  When it came time 3-4 weeks later for the cooktop and range to arrive, cooktop was only thing received.  When I called about the range, the salesman never returned my call.  Do I drive to Franklin and walked in showroom.  Salesman confessed he didn’t order it!!! Once again, no range. He did admit it was his fault , said it would be another 2-3 weeks.  After : weeks I began calling.  No clear direct answer and Manager didn’t apologize.2 weeks later my range arrived, after I threatened to cancel the order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T13:10:58.000Z",
          "Titre": "I came in looking for help on a $10…",
          "Contenu": "I came in looking for help on a $10 piece of hardware and the First Gentleman tried to upswell me on a $1800 computer, rather than understand the problem. This store is only good for purchasing goods. Not getting help with your products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T21:04:01.000Z",
          "Titre": "Did not purchase upsell install…",
          "Contenu": "Did not purchase upsell install package.  Instead, only purchased the necessary cord for the appliance.  It was clear that they wanted me to purchase the higher priced install and the cord was not included with the order.Edit;To the electronicexpress response, I purchased the dryer cord separately, as I said I did in the original review,and it still wasn't included."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANTHONY RUSSELL",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T16:27:12.000Z",
          "Titre": "DON'T BUY APPLIANCE PACKAGE DEALS",
          "Contenu": "Purchased a Whirlpool Kitchen appliance package. Did not like the refrigerator. Extremely loud. Returned for refund. Turns out that we could have purchased every item separate for less cost that the \"package deal\". Charged for an additional delivery fee for picking up the junk refrigerator."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mom",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T00:56:05.000Z",
          "Titre": "Fix your order form and policies",
          "Contenu": "I gave a PO box address which was accepted. Then I get notice that UPS has it and wont deliver without address change. You refused to change the address with them and product has to be returned by UPS and I have to wait til then for refund and then order again. Nope.Update: just received my refund and its $35.15 less than the original charge. The experience just gets better and better. Further update: After they refused to contact  UPS and requiring UPS to return the item to them they have charged a $35.15 restocking fee and take no responsibility at all for their system accepting an address they cant use and no it does not state no PO boxes on their order form. They refuse to return the $35.15. Bad policies, bad customer service. Never again with this Company. I will be filing proper complaints with the proper agencies. Avoid the hassle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ron slaughter",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T14:49:38.000Z",
          "Titre": "Don't be afraid to ask questions",
          "Contenu": "Personally I have a lot of experience installing kitchen and appliances. Purchasing a freezer from E E has made me have serious questions as to if they are selling factory seconds or not. The first freezer was delivered with one corner crushed and the packaging rag tag put together.  The second one (replacement) looks pretty good but with a hinge cover missing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julia E.",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T00:40:43.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "Terrible Customer Service - We ordered a TV from Electronic Express that arrived weeks late. When it finally got to our house, we opened the box and it was the wrong television - a cheaper version worth hundreds less than we paid. When we asked how they would correct this, they offered no apologies or solutions to the problem. We still don't have the TV we ordered. Save your time and money and go to a more reputable company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kassy",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T13:15:57.000Z",
          "Titre": "Order a light saber was told it would…",
          "Contenu": "Order a light saber was told it would be delivered to the store to be picked up in like 5 days , still has not been delivered"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T13:30:30.000Z",
          "Titre": "Once I told them I was here for a mouse…",
          "Contenu": "Once I told them I was here for a mouse pad they had no interest to help (guess they thought I wasn't worth their time). I bought my computer there a year before so it was not like I didn't already spend alot."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Stirmell",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T14:09:00.000Z",
          "Titre": "Terrible delivery and customer service…",
          "Contenu": "Terrible delivery and customer service for delivery. I was supposed to get my delivery by 6:45pm and it was delivered after 9pm!!! No one has contacted me from the company at all to discuss the issues and I will be taking my business elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "DM",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T16:24:36.000Z",
          "Titre": "No accurate UPS Tracking",
          "Contenu": "I purchased a $1,800 Samsung two weeks ago, and ever since, they have been sending me UPS Tracking numbers that are no accurate. Cancelled, Label created but never arrived to UPS, etc., and absolutely no answer. I'm really afraid I will loose my money. Worst Customer service I have ever dealt with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mason Lacey",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T21:13:02.000Z",
          "Titre": "They do not even deserve one star",
          "Contenu": "They do not even deserve one star. They sold an OLD model turntable, have refused to let me return it or give me a refund, told me to contact the brand that made it because they have a 1 year warranty. Turns out it is only a 90 day warranty. I contacted Electronic Express multiple times today and they just keep replying with nope, too bad, have a nice day. Horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "VICKI POLK",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:08:19.000Z",
          "Titre": "NOT HAPPY!",
          "Contenu": "I purchased a microwave that was too big for my counter and asked if I could return it for a smaller and even more expensive one. Since my husband through the box away they wouldn't take it back or exchange it!!!!!! It was the very next day and after promises to get back with me after talking to the manager they still said NO. So I will not buy anything else from you and also my neighbor had intended on buying her new appliances there. Not Now!! That's as Honest as I can be!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Con_Ed",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T07:19:42.000Z",
          "Titre": "STAY AWAY FROM USING AMAZON PAY",
          "Contenu": "12/28 I was on ElecExp's website, browsing for a potential gift, saw a link for payment method option AMAZON PAY. I've been a Prime member ~ 15 yrs & never heard of AMAZON PAY & simply wanted to see if my Prime benefits applied, if I could I utilize my AMAZON gift card balance, etc., just wanted to learn more. Clicked CONTINUE & immediately recv'd \"THANK YOU FOR YOUR SALE\" popup message. 4 things failed in this transaction. 1) I never authorized transaction. I called ElecExp cust svc immediately to CANCEL order but was told no (thought this was very odd) due to the order already in process & they APOLOGIZED 2) stated they're aware of their website system “bug” problem & 3) they could still resolve the situation by statusing the order as UPS REQ SIGNATURE delivery, so I could decline signing, refuse delivery & get an auto credit, but I confirmed w/ UPS they didn't flag the order as such, thus UPS simply left at my door. 4) they're refusing to send me a prepaid shipping label and want me to double box the item (didn’t recv that way?) and pay out of my own pocket to ship enormous box & pay restock fees. NOT ETHICAL OR FAIR."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Lazar",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T15:46:36.000Z",
          "Titre": "Poor support don’t respond to messages"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Gober",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:25:50.000Z",
          "Titre": "Very Bad employees",
          "Contenu": "Very Bad employees, needs to be reported and investigated by corporate and the police as well as the FBI. ty, John Alan gober"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LOUIS SNOWDEN",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T00:43:23.000Z",
          "Titre": "I have spent 5k over the past year and…",
          "Contenu": "I have spent 5k over the past year and I have trouble receiving shipments. They ship only UPS and for a person like me that works, I am missing out on a package that I desperately need because I am not home to accept it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tereza Sarkisyan",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T16:10:34.000Z",
          "Titre": "Horrible service delivering the…",
          "Contenu": "Horrible service delivering the appliances. Fridge had to be unboxed by delivery guys to bring it up into my apartment. when I returned home, fridge was scratched and dented."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 5,
          "Date": "2023-07-27T14:36:09.000Z",
          "Titre": "Horrible experience - don’t waste your time or money here",
          "Contenu": "I went to the store to buy a tv shown as in stock on the website. Well, the tv was not in stock but a similar one was available in the warehouse. I paid for it and it was to arrive at the store for me to pick up four days later. When I went to pick it up, there was no tv and I was told it was sold out. No notification that my tv didn’t ever arrive, no effort to make things right. I suppose Electronic Express was just going to keep my money and hope I never showed up to get my tv? And what did the associate suggest I do now that I had waited all week for a non-existent tv? She said I could go to WalMart. Horrible, horrible service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony W.",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T23:22:15.000Z",
          "Titre": "My item was returned by UPS",
          "Contenu": "For some reason. UPS returned the item. Saying it didn’t have an apartment number on it. But it did! I thought well I will just pick it up in store, but if paying through Affirm, that’s not an option."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RONALD WAYNE",
          "Nb_Reviews": 3,
          "Date": "2022-10-03T11:26:47.000Z",
          "Titre": "Lies on top of lies.",
          "Contenu": "They lied for 3 straight days about my HDTV order. Said they were waiting for payment from finance company. Then after lying to me said they canceled and deleted order. I did chat for 3 straight days and at least one or two of those days they were egregiously rude. I have almost if the emails and transcripts so there would be no real denial. Hey there us a lot of legitimate places that sell appliances without lying."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Erik  Zarkowsky",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T17:09:24.000Z",
          "Titre": "Delivered damaged goods",
          "Contenu": "Delivered damaged goods.  Would not pick up to return.  Said I needed to send it back at an ups store.  I live in the suburbs and don’t have a car, so going to the ups store is a $20 Uber ride.  Disputed charge through my credit card instead of paying to fix your error"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Orlando",
          "Nb_Reviews": 72,
          "Date": "2022-06-02T20:41:15.000Z",
          "Titre": "Lousy customer service.",
          "Contenu": "Newegg had a listing for a Sony TV sold by Electronic Express for $200.  They accepted the order and charged my credit card and status was in progress with expected delivery date 6/3.  Then I get an email saying it was cancelled.  They should have honored their mistake. Lousy way to run a business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allen Bryant",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T23:32:44.000Z",
          "Titre": "Don’t buy tv’s from these people for…",
          "Contenu": "Don’t buy tv’s from these people for sure, we bought a lg from them a few days after there return policy ended which is 30 days we called refused to help said we would have to call the manufacturer about it. They acted like they didn’t give a crap they got our money so they were done with us. We have called the manufacturer twice now still have a useless tv. It will be a cold day in hell before I buy anything from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Dodson",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T23:25:21.000Z",
          "Titre": "This is a shoddy company selling shoddy…",
          "Contenu": "This is a shoddy company selling shoddy devices. They will not stand by their guarantees nor are they interested in making the customer happy or at least meeting halfway. My advice... Go elsewhere. Trust the reviews. And don't ever buy an MSI product because they will not stand by a recently purchased item. They may have good prices, but you get what you pay for. And in this case, you get nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SCOTT LACY",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:17:30.000Z",
          "Titre": "Find a Different store",
          "Contenu": "Well, I wanted to buy a nice monitor for my son.  Website said it was in stock at a store 3 hours away from my house.  I bought it and next morning I got up to drive out there and pick it up.  When I got there not only was it not in stock, all they had was a used model that actually ended up costing me more than I paid on the website.  They couldn't refund my money, they wouldn't give me any sort of a discount and generally didn't care.  I will never be shopping there again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T16:11:59.000Z",
          "Titre": "I bought a PS4 1TB and received a 500GB…",
          "Contenu": "I bought a PS4 1TB and received a 500GB PS4 system. Emailed them 3 times to ask why it was taking so long to ship and when I said a refund was going to happen they took my money right then and made me wait another 10 days.  Now they said I would get a partial refund but it’s already been 2 weeks. DONT TRUST ELECTRONICS EXPRESS OR YOU WILL GET GOT LIKE THE REST OF US!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T13:13:40.000Z",
          "Titre": "My experience was fine however I…",
          "Contenu": "My experience was fine however I already ignored this email about the survey and it has consistently sent it to me everyday since I shopped there and it’s been over a month …stop sending this fuckingg review my experience was great jeez v"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole James",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T15:07:53.000Z",
          "Titre": "Excuses, excuses.",
          "Contenu": "I never got my order!! I called ups, they said the sender didn't fill out my address completely and they had a restriction in place where they couldn't modify it. Ups told me to call the company and they could fix it. So I did. I was told that the only thing they can do is wait for the computer to be sent back to them and issue a refund because...get this... they give their customers information to a 3rd party to address the labels. Ridiculous.  Regardless, it doesn't matter who they blame it on, the fact remains that they are responsible to fulfill the orders. Then I was treated like I should be grateful that they would give me a refund!! Thats just a given considering I didn't get the product!! It also doesn't solve the fact that I needed that computer for a project that I had to put on hold because I was waiting foolishly on a computer required to do it that never came. I do not recommend them and I will never TRY to use them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DEBRA WILLIAMS",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:10:49.000Z",
          "Titre": "3 times they failured to give 30 minute…",
          "Contenu": "3 times they failured to give 30 minute call and text as stated in their email. Therefore 2 times they left property before I could get there. The 3 delivery attempt the truck was about to leave when I got there. I had spoke with the caller that called to tell me tell they told her no one was home and they weren’t going to wait. I told her they had failure to call me they lied and said they did. They went ahead and installed the dishwasher incorrectly. I took pictures to the sales person to show him the installation. He scheduled to have it installed correctly. Again no call from installers so they didn’t wait on me again. I paid to have someone to install correctly and was told they would refund my installation fees. Howeve r that hasn’t happened either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANDERSON BROWN",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:15:20.000Z",
          "Titre": "I tried to return the item I purchased…",
          "Contenu": "I tried to return the item I purchased the week after the date of purchase with the receipt in hand and was told I was unable to return it. Will never be purchasing anything from electronic express again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marlon",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T20:58:30.000Z",
          "Titre": "My surround system doesn’t work",
          "Contenu": "My surround system doesn’t work. Spent a lot money for equipment and installation. Need a refund asap Thanks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John and Sharon",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T01:07:52.000Z",
          "Titre": "Well the first time they tried to…",
          "Contenu": "Well the first time they tried to deliver, the refrigerator was broken. Second time the men did not know how to install the ice maker also sent a message to the company, (which I saw the message) telling them will need a longer ice maker line and someone to install the ice maker since theydid not know how. The third time no call to let me know they were close. When they showed up, earlier than scheduled and I was surprised. It was the dame guys that did not know how to install the week before and they did not bring a longer ice maker line that would fit. When the guy called to find out about the line not being sent they said they do not carry any longer than 8 foot long. Why were we not informed of this or the guys coming out not informed of this??????? I have had to give up 3 Saturdays and still the problem is not solved. My time is money and should be refunded money since you have cost me money and still do not have our ice maker installed and told we would have to spend money to go get a ice maker line and valve that they do not have. Why werewe not told any of this when we bought the refrigerator or why did someone not call us when they knew all of this from the delivery guys telling them??? A manager needs to contact us and make this right!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael f",
          "Nb_Reviews": 3,
          "Date": "2021-06-05T14:13:02.000Z",
          "Titre": "This company takes orders online and…",
          "Contenu": "This company takes orders online and charges peoples credit cards for items they don't have in stock or may not be able to get for weeks without contacting the customer! They are holding peoples money across the board. They wait for you to call in and when you finally do they lie to you about your order and its processing time. They don't offer you any remedy except your money back. It's a scam!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T04:18:24.000Z",
          "Titre": "Not happy",
          "Contenu": "My product still isn’t here when I was told it would take 2 weeks to receive and after week 3 plus it’s not here"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Franklin jr",
          "Nb_Reviews": 3,
          "Date": "2021-12-03T19:45:42.000Z",
          "Titre": "I ordered my son a Nintendo Switch,when…",
          "Contenu": "I ordered my son a Nintendo Switch,when it came someone had took the console out of the box ,all I got was accessories for $500.They told me they didn't have anymore in the warehouse so they couldn't send me one or for me to send it back for a refund.Its only 3 was until Christmas.Ì can understand why no one is never in their store.They have very poor Customer Service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T17:57:39.000Z",
          "Titre": "My TV has still not been delivered.",
          "Contenu": "My TV has still not been delivered and according to the tracking with Shop and Ups,  it's at the Ups office in Mobridge for the past 4 days......what's the deal ???Mobridge is only 17 miles from my house.....You need to do something immediately!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "STEPHEN DAVIS",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T01:33:48.000Z",
          "Titre": "I bought a set of speakers for my…",
          "Contenu": "I bought a set of speakers for my vehicle and the sound quality was very bad. When I talk to the manager he told me there is a no refund or exchange policy on call audio that has been installed. He was not able to help me resolve the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANDREA MARTIN",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T00:35:15.000Z",
          "Titre": "My item arrived with no battery",
          "Contenu": "My item arrived with no battery. I called and asked to have a replacement battery sent to me and was told that wasn’t possible. I asked to return the item and was told that wasn’t possible either. What a terrible experience and an awful waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MIGUEL BARAJASRICO",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T16:13:07.000Z",
          "Titre": "You guys are rude when i had called to…",
          "Contenu": "You guys are rude when i had called to ask about my order and after my call you guys canceled my order n didnt give a reason"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JK",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T21:20:40.000Z",
          "Titre": "Both items were shipped in a box…",
          "Contenu": "Both items were shipped in a box shorter than the item being shipped.  There was also no shipping protection inside.  Not surprisingly, both items were damaged.  Both items were returned and i won't try them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jeff posey",
          "Nb_Reviews": 3,
          "Date": "2022-04-09T17:43:30.000Z",
          "Titre": "bought a bed and adjustable frame they…",
          "Contenu": "bought a bed and adjustable frame they brought just the mattress not the frame .they said they didnt have one ,they did when i bought it.Getting my money back  also has been a experience paid some cash the rest on card.If they have cash when I get there I can get cash if not they will send off for a check takes 2 weeks .Everything is blamed on corporate. Never will buy anything else from there again and I will tell all my friends about my experience also on social media."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JAYMY PARRICK",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T10:12:42.000Z",
          "Titre": "Poor leadership",
          "Contenu": "They are supposed to do a match price, but when I asked, they said it was an online only price unto which I new what the price was and I went and took a picture of the price to prove them wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jordan Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:32:03.000Z",
          "Titre": "The online ordering experience was fine but shipping is slow",
          "Contenu": "The online ordering experience was fine but I've been pretty unhappy with the timeliness of shipping and lack of updates with tracking my order. I ordered a TV nearly two weeks ago and haven't been given any updates. I was originally told shipping would take 6-10 days. Makes me wonder if saving some money was worth it when I could have the delivery much sooner with Amazon prime. I'll attempt to update this review once I receive my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Boswell",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:10:46.000Z",
          "Titre": "I went through a finance company",
          "Contenu": "I went through a finance company.   Then didn’t send the order and when I questioned it they said finance company deemed fraud.  Then finance company said it was never processed so it could never be fraud.  They had no record of this company applying under it for me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Devin Mosher",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T04:49:07.000Z",
          "Titre": "Super slow shipping",
          "Contenu": "Super slow shipping . Nearly two weeks and I haven’t received my package"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valued Member",
          "Nb_Reviews": 5,
          "Date": "2023-11-04T18:21:51.000Z",
          "Titre": "The team could have paid more attention…",
          "Contenu": "The team could have paid more attention to packing. Electronic items should be packaged in a corrugated box that can with stand movement impact during transit. The product itself has one drawback - Foam padding - generates too much heat when the head phones are worn over 30 minutes. Not good for prolong use"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SHARQUENTA BUNCH",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:20:08.000Z",
          "Titre": "Ordered Call of Duty Xbox bundle",
          "Contenu": "Ordered Call of Duty Xbox bundle. Received xbox with no Call of Duty. I have yet to receive any correspondence on what happened with the game."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monica Durfee",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T14:49:33.000Z",
          "Titre": "Be willing to exchange thr damage…",
          "Contenu": "Be willing to exchange the damage goods. Just not simply offer a refund,  because some people buy the items for a reason. Not to be left out of having the item, but also waiting for the refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Randy Eppinger",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T05:05:05.000Z",
          "Titre": "No ship date",
          "Contenu": "No ship date, no expected ship date, no response to my email."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T13:51:27.000Z",
          "Titre": "It is really bad to make a purchase and…",
          "Contenu": "It is really bad to make a purchase and hear/ read that the delivery will not occur for two weeks. It was in stock at their warehouse in town, so two weeks is way too far out to deliver and install a large TV. At the price we paid for it, I wish I had gone elsewhere, but surgery kept me from shopping around. We also spent a fair amount of time there while the salesman corrected the purchase in their system."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T22:15:39.000Z",
          "Titre": "delivery and set up were under par",
          "Contenu": "delivery and set up were under par. Shipping protection was removed at warehouse potentially damage washer .Shipping protector should be given to consumer for future appliance moves.  Was charged for two new water hose and dryer vent hose that was not provided.  Rubber feet were missing and not provided or installed. Appliance were not leveled which is part of the installation.  Hot and cold water were hooked up reversed.  Called to discuss and was on hold for over 20 minutes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T17:10:21.000Z",
          "Titre": "The sales lady was great very…",
          "Contenu": "The sales lady was great very knowledgeable and very helpful. I'd give her 5 stars. The delivery people brought the furniture in 2 heavy boxes we are elderly people and had to unbox and put it together. I don't recommend this type of delivery to senior people."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eloise Fomby Denson",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T13:30:16.000Z",
          "Titre": "Untimely receipt of items in a damaged…",
          "Contenu": "Untimely receipt of items in a damaged crushed box"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PV",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T16:11:25.000Z",
          "Titre": "Item box arrived with some damage but…",
          "Contenu": "Item box arrived with some damage but also appeared to have been opened and re-taped closed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "So",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T13:51:05.000Z",
          "Titre": "The manager that assisted me was…",
          "Contenu": "The manager that assisted me was incredibly rude and the worker that brought it out to us sat it down and went in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MARY THOMPSON",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T22:43:04.000Z",
          "Titre": "Samsung Panels Never Arrived",
          "Contenu": "We bought our new Samsung 28.8 Cu. Ft. Panel Ready Bespoke Smart 4-Door French Door Refrigerator (Panels required) in March. We were given our bottom freezer drawer panel and promised the others will be ordered, but they are currently on backorder. We still do not have our panels. I have gone by the store every month without any results or follow-up from the Hixson management staff. We were last in early July and were told we would be told that we were they were scheduled to arrive in mid-July. Today, July 27th, I have not heard from anyone with an update."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T04:25:03.000Z",
          "Titre": "Delivery partner is the worst ever",
          "Contenu": "Delivery partner is the worst ever! After multiple calls and text from me to their logistics delivery partner (total joke James Buchanan the 3rd) this outfit is the bottom of the barrel! No call backs no text and totally disengaged from priorities."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DONALD DILLARD",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T07:41:52.000Z",
          "Titre": "The two delivery personnel were not…",
          "Contenu": "The two delivery personnel were not proficient in the job.  1.  Left necessary tools at previous job.   2. Did not tighten water supply line and it leaked. 3. could not get the dishwasher installed into the cabinet as they left the left side protruding further out than the left.  4.  Could not attached the mounting brackets.  5. Left with only one side of the unit secured with a screw and left the right side for me to secure.  NOTE:  Service Manager did a good job in getting above corrected with a more experienced technician."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J. HOOVEN",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T02:17:18.000Z",
          "Titre": "Stole my Credit card information",
          "Contenu": "I went in to purchase a Bosch dishwasher. a Salesman came up and helped us let us know that the model we wanted was in their warehouse. He was friendly and asked for my ID and credit card. I asked to use the payment plan. Long story short I saw him write my card down thinking it was for my application. Within a couple days (without using my card anywhere else) there were tow fraudulent charges. I gave 2 stars only because to give props to the delivery person that delivered it the day before Thanksgiving and installed it is an icy downpour."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T07:41:14.000Z",
          "Titre": "Delivery team not well trained.",
          "Contenu": "Shopping/buying experience was fine. The delivery/install team were polite, but ultimately left a mess they covered up and didn’t tell me about when they left. Dishwasher install required drilling in a cabinet wall and the team not only left the sawdust, but put the contents of my cabinet back and didn’t mention anything needed to be cleaned. That’s sloppy delivery."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allison Gilbert",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T13:52:12.000Z",
          "Titre": "There were two employees smoking at the…",
          "Contenu": "There were two employees smoking at the front door at the Hixson store. They were within feet of the front door with smoke going all over me. I complained to the employees and to Scott inside Scott was a great sales person and very knowledgeable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T00:25:50.000Z",
          "Titre": "The associate we purchase our item from…",
          "Contenu": "The associate we purchase our item from seemed very rushed and out of sorts. We still have yet to receive a receipt or any of the extended warranty paperwork we purchased"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T14:04:40.000Z",
          "Titre": "They brought the wrong appliances out…",
          "Contenu": "They brought the wrong appliances out to my house on a Monday. Then said they would bring the correct ones out on Wednesday, two days later. They never showed up never called so I called them, they told me to bring the appliances back that they delivered, they took the appliances back with them after I refused to accept them because they were not the ones I ordered. Make a long story short I ended up driving 50 miles away to pick up my own stuff. I will never do business with this company again. Bunch of idio"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BRENDA OESER",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T16:38:05.000Z",
          "Titre": "We were told at the store our pedestal…",
          "Contenu": "We were told at the store our pedestal would fit our new dryer. The unfriendly delivery men said no. They refused to take  off the pedestal on my broke dryer n leave it. They said they had to take both or would not take either one. I don’t remember the exact date of delivery."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debi",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T16:02:31.000Z",
          "Titre": "LG Laundry pair. Worst purchase ever",
          "Contenu": "I was not aware that the washer I bought, top loader, had a water level sensor, therefore only using enough water to dampen the clothes and not wash them. That was my entire reason for switching back to a top loader from a front loader. More water being pulled through the clothes gets the clothes cleaner. I have to add water to every load both on the wash cycle and the rinse cycle taking up a lot on time checking the machine for the timing of these cycles.  I hate these machines. Also the dryer does not get the clothes dry on the auto setting. I have to use the times dry setting.  SO basically I screwed myself over!  And the delivery guy didn't hook up the dryer vent and I took me a few loads to figure that out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SHAHZAD SHAH",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T04:49:06.000Z",
          "Titre": "the day of buying the stove top was…",
          "Contenu": "the day of buying the stove top was excellent, the cashier and manager were very helpful and informative. The day of delivery was a nightmare! I had a bought the installation package at the amount I was told. The installer stated that was the wrong package and did not go with my stovetop. I called the store and spoke with manager who was extremely unhelpful and wanted the installer to leave and come back a different day while we had been using a temporary stove for days since ours was broken. It was insane, instead of accepting that it was entirely the store fault including the manager who sold me the wrong product and that they will fix it right away, he wanted m to come to store pay the difference and then reschedule the visit. Not an experience I will go through again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PSK",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T20:19:36.000Z",
          "Titre": "I ordered for a Washer and Dryer…",
          "Contenu": "I ordered for a Washer and Dryer through Electronic Express. I was trying to do the installation myself and realized the power cord delivered for the dryer was a little shorter in length to connect to the plug and so I had requested for letting me know the procedure to see if this can be returned and get a refund as I couldn't go to a near by Electronic Express store to exchange. I was informed someone will reach out to help with the return request, but no one called me back. I ended up buying another power card from home depot to complete the installation.This is my second purchase from Electronic express and on my first order of a refrigerator, I had experienced some issues with an internal tray damaged during their installation process and the replacement part was never sent back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mitchell",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T01:56:14.000Z",
          "Titre": "they sold me a used xbox elite…",
          "Contenu": "they sold me a used xbox elite controller as a new one, then when it was sent back to them and they shipped its replacement it was again a used one still with the last users profile set"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DONNA AMOS",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T20:13:15.000Z",
          "Titre": "Very unsatisfied",
          "Contenu": "Sales was good, repair on new GE refrigerator nightmare. Married 54yrs never had one that we didn't NJ ave for many yrs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T13:24:54.000Z",
          "Titre": "Did not have the tv in store",
          "Contenu": "Did not have the tv in store.  I had to drive 40 minutes after paying for the tv to pick it up.  Sales man told me with the sound bar all I had to do was hook up coax and after messing around with it for two hours and many YouTube videos I discovered this was not true and sound bar is Bluetooth only.  Sales man did not know his product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bespoke Samsung",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T13:08:55.000Z",
          "Titre": "Line of credit and very frustrated",
          "Contenu": "I opened a line of credit through Electronic Express to purchase a Samsung Bespoke refrigerator. The price was better than Costco and the man told me I would get two sets of panels free. One comes with the refrigerator and then I submit one for rebate. He said stainless steel was unavailable and he didn’t know when it would be back in stock. So I choose colors that they had in stock thinking I’d get stainless when they’re back. Well, after purchasing through a line of credit that I opened just for this purchase, I found out the man told me incorrect. After talking with two other electronic express sales man neither felt the need to make it right. One told me I could pay the difference and purchase an extra set of panels. Super frustrating since I was told they were free when I made my purchase (through a line of credit!!!!!!!!). When I finally decided to just cancel the order and shop somewhere else the man said ok like it was no big deal I was canceling my order. I went to Lowe’s instead and bought a refrigerator and dishwasher from them. So much easier! Very frustrated I opened a line of credit through y’all. Feel free to contact me to make it right!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "THOMAS COLLINS",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:42:13.000Z",
          "Titre": "Well I bought it with 12 months no…",
          "Contenu": "Well I bought it with 12 months no interest but I don’t ever get a bill or a statement I don’t have this credit card any more so it’s hard to pay it sometimes with knowing what the card number is"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SHIRLEY Hill",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T01:39:20.000Z",
          "Titre": "Unfortunately the sales person never…",
          "Contenu": "Unfortunately the sales person never followed up on my purchase. I never knew when it was delivered to the store. A week later I went into store asking for my item. Not happy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KEITH MORRISON",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T20:39:58.000Z",
          "Titre": "Was disappointed (VERY) with the way…",
          "Contenu": "Was disappointed (VERY) with the way problems were resolved with the new furniture we bought!!!!  I go in that store maybe once a year! I actually bought insurance with it and have a couple of issues that actually popped up shortly after the purchase. Hey, I have trained quite a few people in my time and I know that we have to start somewhere. But I think a lot of the problems that we had was you had children working there it seems like it didn’t look like they were over 16 years old. That being said, probably just not enough experience on solving problems yet. I guess it’s all for the best though. It save me a lot of money, hindsight of not going in the store! Because I have a bad habit of spending a lot of money in electronic stores!!! Maybe you’ll get the problem, resolved sometime in the future! Love the furniture ( $5,000 )! That I found out later same furniture for $3,000 was being sold at different companies. Sorry, we’re Done!😵‍💫"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David T",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T03:36:41.000Z",
          "Titre": "Knew TV was reconditioned",
          "Contenu": "Knew TV was reconditioned.  I expected that meant fully tested and fully functional.  Sound did not work through speakers.  Could not get a replacement.  Had to return TV for refund and reorder.  Guess I was lucky they had one in stock..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CHUCK YATES",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T01:40:34.000Z",
          "Titre": "Doors were dented and scratched",
          "Contenu": "Doors were dented and scratched. They made a note and said they would get replaced.  I bought 4 grand worth of appliances in December.   I just received my handles. June 1st I still don't have doors yet.  There were 2 promotions going on. I received 1 about 1 month after I filled out the paperwork.   I got a email to saying my other card is being sent. This is June 1st. Was only supposed to be 6 weeks.   Sad Sad !!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cordell",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T22:29:08.000Z",
          "Titre": "Faulty Paypal Interface Creates \"Invalid\" Addresses",
          "Contenu": "Electronic Express's Paypal interface sadly mangled the address on my order, overflowing the last digit of my apartment number to the following line and rendering the UPS shipping address \"invalid\". Despite my efforts with the local UPS office to get them to correct the address and deliver the package, they would not override the shipper's directions disallowing any address change however minor. UPS sent the package back to EE and I am now waiting for my refund. So despite a relatively easy to use website, attractive pricing, and prompt shipping, their software systems doomed the transaction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Davis",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T05:20:29.000Z",
          "Titre": "Your service team left a large scratch…",
          "Contenu": "Your service team left a large scratch on the door of the laundry machine and said they were ordering us a new door. I have not heard anything about it since. I would like a new door delivered ASAP! Thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Notroutedright",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T17:50:02.000Z",
          "Titre": "I bought 2 item on line had shipped to…",
          "Contenu": "I bought 2 item on line had shipped to my home.One of the items did not work so I took it to the local store to return it. They told me I had to return it to the warehouse and they gave me the phone number. So I had to buy another product to replace the not working item out of pocket before I get the money back for the other product. I can the number the lady sends me a RA number to send it back. I had to pay for the shipping back to the warehouse out of my own pocket also.They say it a standard return  policy. I don't see it's standard from most large retailers. I consider you guys a large retailer because you have lots of location. I will most likely to buy online again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Y.S",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T21:56:09.000Z",
          "Titre": "Zero explanation towards the product & credit card",
          "Contenu": "The credit card was not explained to me correctly. Delivery was a mess. Still having to wait for all parts of my purchase to get delivered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EDWARD RAHM",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:40:20.000Z",
          "Titre": "Salesperson was great but my whirlpool…",
          "Contenu": "Salesperson was great but my whirlpool refrigerator has needed 5 service appointments and is still NOT WORKING. Bought is 6 months ago."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOHN LOTT",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T18:33:08.000Z",
          "Titre": "They installed it on Friday 5/26 it…",
          "Contenu": "They installed it on Friday 5/26 it stoped working 5/26 can not get it repaired till Monday 6/5 Now I will be with out my 1400.00$ dishwasher till then"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Troy P",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T13:57:42.000Z",
          "Titre": "Was a good price and that's the only…",
          "Contenu": "Was a good price and that's the only reason it's not 1 star. The package came in a crushed box and the product inside was scratched and scuffed up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Sugg",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T13:17:25.000Z",
          "Titre": "Your return policy sticks",
          "Contenu": "Your return policy sticks . Not a customer friendly policy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronnie Branch",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T18:22:46.000Z",
          "Titre": "I would have not bought from them if I…",
          "Contenu": "I would have not bought from them if I knew the TV was going to be shipped truck freight"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chinrednek",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T03:45:06.000Z",
          "Titre": "I tried to return something",
          "Contenu": "I tried to return something.  Request went into a black hole and never heard back with an RMA"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Barney Jones",
          "Nb_Reviews": 3,
          "Date": "2022-08-17T01:25:48.000Z",
          "Titre": "My Flat Screen TV Died",
          "Contenu": "I bought a 55” Samsung flat screen TV. After the first 6 months it was great than one side of the screen went dark. Electronic Express could care less. And I payed a $121.00 in shipping."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WISNOT NAZAIRE",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T13:09:17.000Z",
          "Titre": "I can wait to see my order"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KEENA YOUNG",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T21:07:46.000Z",
          "Titre": "The staff could be a lot friendlier!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lyn Ton",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T13:27:22.000Z",
          "Titre": "I purchased a switch and ehile it was…",
          "Contenu": "I purchased a switch and ehile it was shipping, the address was changed. When I called, a female was very rude and refused to tell me where my $380 purchase was sent. I had to make several calls to fed ex to find it. She said that the changes address was a previous address that I had never at before. By GOD’s grace I got the address and the person was nice enough to give it to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T15:23:56.000Z",
          "Titre": "Very slow in providing return…",
          "Contenu": "Very slow in providing return instructions as requested.  I have been told that an e-mail would be sent to me with instructions on how to return the item i purchased.  It's been more than 48 hours since i requested this info and i still have not received anything.  I have provided my e-mail address to the c/s rep on two separate occasions.  Please help!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-13T12:16:24.000Z",
          "Titre": "Delivery disappointment",
          "Contenu": "I ordered a refrigerator that was in stock. It has yet to deliver. This is a week later. Then to find out that when it does deliver it will be set outside my door. I do not have the strength to move a refrigerator into my house. I was charged $300 for delivery, for this type of delivery I could have hired someone and rented a truck for the same results. I am not impressed with the service I have received so far."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WEBCLIENT",
          "Nb_Reviews": 3,
          "Date": "2020-07-19T15:13:29.000Z",
          "Titre": "cheaply made…",
          "Contenu": "Doesn't match the picture...In a few words this is a cheaply made item. It's basically raw wood...I wouldn't call it beautifully stained... They're are splinters and rough wood all over this pet gate and the one I was shipped has a huge chunk missing. It didn't even stand up straight because it is warped... It's so lightweight that light breeze could knock it over. Do yourself a favour and buy a real pet gate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joetta Kinchen",
          "Nb_Reviews": 1,
          "Date": "2020-04-18T14:39:31.000Z",
          "Titre": "I know it’s some crazy times right now",
          "Contenu": "I know it’s some crazy times right now, but if a ticket was made on 4-4-20 and a shipment couldn’t be made the least you could do is respond to those whose money you have. At first my delivery was to arrive on 4-14-20 when it didn’t arrive, I didn’t receive any notice and has had no further information as to a possible deliver date.Thank you for being a essential. Stay healthy, stay informed. J Kinchen"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T16:39:30.000Z",
          "Titre": "Sorry but item took an extra day to…",
          "Contenu": "Sorry but item took an extra day to arrive and I asked 3 questions prior to items arrival and only 1 got answered. I don't believe in Average rating. You either suck or you're good. I will not or would not purchase from Electronic Express again - I chose EE over Amazon because I would prefer to help small business. I would personally return the item purchased if the communication was better, but I will take my loss and move on."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Gregory Brown",
          "Nb_Reviews": 3,
          "Date": "2020-05-07T14:09:28.000Z",
          "Titre": "Used Product Which Is Not Usable",
          "Contenu": "I ordered a sewing machine and it was a good price. The shipping was great, too. I looked like it was in perfect condition until we got ready to sew and discovered that it had thread stuck in the bottom of footer and behind the bobbin. I thought at first that it was neat that it came with a full bobbin but now know it was because someone else used it and screwed it up!!! I'm waiting to hear back and it's been two days now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-28T16:37:26.000Z",
          "Titre": "The price point was excellent and…",
          "Contenu": "The price point was excellent and quality product. However the cost to deliver was well over whatbis should have been by triple and they used FedEx neither place was workable even for a gold when it was sent to an incorrect address by no fault of mine, both Fedex and Electronics Express blamed each other neither helped with the problem"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2020-11-09T14:56:23.000Z",
          "Titre": "I ordered TV from…",
          "Contenu": "I ordered TV from pricewaiter.com however TV sent from electronic express. I do not mind. But outside package came significantly damaged delivered by FEDEX and left in front of my door. If I would see it i would not accept the package. It was handled so bad. As you know electronics prone  to damage if not handled and delivered properly especially TV's. I turned TV on it was working now but who knows if it will be problems down the road since TV handled very bad. And how long it will last ?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert A",
          "Nb_Reviews": 2,
          "Date": "2019-02-19T15:13:32.000Z",
          "Titre": "Item was refurbished but while updating…",
          "Contenu": "Item was refurbished but while updating it initially I started getting errors that the battery was nearing the end of its life.  Very pleasant when I called and got me a return authorization and president label.... HOWEVER...since then they have not credited the purchase price back or returned my phone calls.  They received the unusable computer back a week ago.  Up until this transaction I was pleased with EE."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-22T12:17:33.000Z",
          "Titre": "Quick, but missing part!",
          "Contenu": "The package came in super quick and they communicated very well! However, the box was missing a wire that comes with the product and when I called customer service, the lady was super mean and short with me. At this point it has been a week and I still haven’t gotten my replacement part that I was promised, and I am not sure if it is even coming!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ljhrt1968",
          "Nb_Reviews": 3,
          "Date": "2020-12-30T12:48:08.000Z",
          "Titre": "I got my product",
          "Contenu": "I got my product, which was a lego set that was just thrown in an envelope and shipped.  So it was basically a flat folder with Legos in it.  I had to keep it because it finally arrived 2 days before Christmas due to the postal system delays.  A little disappointed in your shipping process"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "snow",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T12:04:44.000Z",
          "Titre": "have not received the item",
          "Contenu": "order 8/16 now 9/7 still have not received the item. Called FedEx who said it has not received the item. Called Elec Express who said it sent the item. call paypal to cancel but I have to go to elec express so I am in a loop. I no longer need that item but I have to return the item which I do not have"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BJS",
          "Nb_Reviews": 1,
          "Date": "2019-05-11T12:13:13.000Z",
          "Titre": "My not so great experience",
          "Contenu": "The man who helped me pick me a washer and dryer as well as the delivery team were wonderful. The manager, however, was extremely rude when talking to me about the washing machine I ordered being out of stock. He sent me the display model and thinks “I should just be happy with it”. He was not happy when I told him I wanted a new one just like I ordered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Coleby",
          "Nb_Reviews": 1,
          "Date": "2019-05-04T13:26:34.000Z",
          "Titre": "OVER-BEARING",
          "Contenu": "I REALLY DON'T LIKE BEING PESTERED WHEN I GO TO SHOP, IF I HAVE QUESTIONS, I'LL ASK. I HAD RATHER SPEND 12 HOURS ON CAR LOT THAN TO COME IN MY LOCAL STORE. ONLY REASON FOR COMING IN WAS FOR MY WIFE TO GET A PORTABLE DVD PLAYER AND THE SALESMAN WOULDN'T LEAVE US ALONE ABOUT AN 84\" TV. I ADMIRED IT BUT COULDN'T AFFORD IT. TRAIN EMPLOYEES BETTER THAN THAT. I UNDERSTAND THEY WORK ON COMMISSION BUT YOU END UP RUNNING PEOPLE AWAY..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hunter & Karsyn Baron",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T22:41:45.000Z",
          "Titre": "quick delivery but not what we ordered",
          "Contenu": "We got the iPad we ordered within like a day but the iPad I ordered was was supposed to be WiFi and lte cellular data but when it came it was WiFi only and I tried to take it back to the store but they said to call customer service...we have tried calling multiple times and it just rings with no answer 😩"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2018-12-13T14:12:53.000Z",
          "Titre": "Not impressed",
          "Contenu": "I found that my product was a previous generation model and $150 overpriced.  This order took 10 days to receive as well.  On my next order, I was not notified of a backorder, and therefore received my package approx. two weeks later.  Received tracking information late on both orders, so did not know when to look out for my delivery.  Also, customer service would sometimes take two or three days to respond to simple inquiries"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2019-03-13T22:56:49.000Z",
          "Titre": "Wrong product description",
          "Contenu": "I ordered a Bluetooth dongle that, according to the ebay description, included a CD with the necessary software drivers.Before opening the dongle package, I read the Contents list.  No mention of a CD.  I emailed Electronic Express and asked if the CD was inside the package.  Julian Z. replied that he thought it was.I opened the dongle package and no CD.  Julian Z. offered a refund but I declined because it was easier to download the driver."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T19:22:34.000Z",
          "Titre": "I ordered online",
          "Contenu": "I ordered online. I had to return the gift and the only way was to mail it in. You have all these stores here in Nashville. One less than 2 miles from home and they won’t take returns, c’mon you guys have been in business along time now and should have better return service than this?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-24T05:13:44.000Z",
          "Titre": "Took way too long to get our packages…",
          "Contenu": "Took way too long to get our packages and after ordering they then tell me that they are out of stock and will ship it once they get it. 2 weeks later and a week before christmas they cancel the order. No notice nothing. Only way I found out was through a refund on my card from them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Salman Raza",
          "Nb_Reviews": 2,
          "Date": "2020-01-16T15:41:52.000Z",
          "Titre": "customer service is rude. Both reps that work for them",
          "Contenu": "Good prices and shipping but the return and exchange process is not good at all. Also the customer service is rude. They had two reps working and both will give you different information and when you ask questions to clarify somethings they get annoyed and don’t want to answer properly and give you wrong information."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2019-03-12T12:25:01.000Z",
          "Titre": "Wouldn’t honor posted price after checkout",
          "Contenu": "The sales associate upsold an internet router to me based on a posted price. After I checked out, I noticed I was charged $30 more. I brought up the discrepancy and went back to the floor and showed him the tag. They wouldn’t honor the price. I should have shopped at Walmart where they don’t punish the customer for their mistakes. Electronic Express emailed me asking how my experience was. I replied and their customer service department never responded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremy Martin",
          "Nb_Reviews": 1,
          "Date": "2018-12-02T01:35:28.000Z",
          "Titre": "Don’t Honor Prices As marked!!",
          "Contenu": "Went to store to look for a specific item.  Found the item with a good price so I had the employee pull them out of the shelf.  In small print on the tag I guess that sell had ended a few days earlier but they failed to pull the sale tag.  We walked up to the counter & employee called manager about honoring that ticket price & the manager said no.  Last time I checked that was callled “False Advertising”.....I do not recommend this store"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer Lisa G",
          "Nb_Reviews": 2,
          "Date": "2020-06-29T11:20:25.000Z",
          "Titre": "Although the product was in stock",
          "Contenu": "Although the product was in stock, good price and was delivered fairly quickly, I received an item that was clearly used. I placed a call and was initially offered a percentage off, which needed to be approved. I accepted but never heard back until I sent another email a week later and then the offer was rescinded. I was told that I could repackage it and ship it back and go through that hassle....I decided to clean it and keep it and hope that the original reason it was returned doesn't come back to haunt me....."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-12-15T12:48:58.000Z",
          "Titre": "Package took mini vacation still haven’t received",
          "Contenu": "Probably not sellers fault, but item went was GUARANTEED by Dec. 12.   Today is the 15th and item is in Utah.    Item shipped from Tennessee to Cincinnati Oh and for some reason it has been in Utah for 4 days.     I won’t buy from again and it can be blamed on fed ex or whatever.    I skipped over 20 other orders because this one was the closest."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-02T15:47:06.000Z",
          "Titre": "The seller sent me an item tootally…",
          "Contenu": "The seller sent me an item tootally different than description, he mentioned that laptop is touch however is not.When I contacted the seller he doesn't provide any options to solve the issue like ecxhanging or partially refund and tell me to return which is wasting time and I got to Best buy to get one instead as I needed urgently"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "trokletak",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T13:05:39.000Z",
          "Titre": "Issues with order and delivery",
          "Contenu": "First Had issues with ordering.   Kept causing fraud alerts.  For a 20 dollar charge. It’s probably on the bank end but I do wander if the particular vendor is causing more alerts.  Then the shipment never arrived.  The tracking shows a completely different zip code.   I called to check they said they will investigate and told me they will get back to me in 7-14 days!!! 2 weeks for a 20 dollar purchase.  I should have bought from amazon.  I try to by from different vendors but waste of time.  Would have never happened at Amazon."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2019-04-08T15:37:07.000Z",
          "Titre": "Survey",
          "Contenu": "Associate I dealt with was very professional and polite. No complaints there. However, I wasn’t satisfied with the service or situation of getting my stereo replaced. I was told the installer just had a baby. So I would call and check and nothing. I did this for about 3 weeks. Finally decided to do it myself. Much rather pay $130  and have a “professional “ install it. With less time ,than take 8 hours of my time. Anyways I love my radio and customer service is fine. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2019-01-16T18:29:44.000Z",
          "Titre": "Terrible return policy",
          "Contenu": "I would never in my life but from a company with such a stupid return policy. I didn't read the policy before I bought.Your shipping tactic was also lousy. The item I received was damaged, most likely due to your lazy shipping.Don't offer free shipping if you're not willing to wrap it in a way that doesn't damage it!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GB",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T01:00:19.000Z",
          "Titre": "Freezer was shipped via fedex",
          "Contenu": "Freezer was shipped via fedex. Outside of freezer was damaged on the back and at the bottom front corners. Diid not want the hassle of trying to return freezer. Since it still worked, I decided to keep it. Would not recommend buying anything from electronic express that ships fedex!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gina Wrye",
          "Nb_Reviews": 6,
          "Date": "2019-12-09T05:32:47.000Z",
          "Titre": "Bad customer service with delivery problem",
          "Contenu": "I guess for security reasons, when I went to order this game console to ship to another address my debit card wouldn't go through. It offered me the option to pay through PayPal. I went through but was staged to ship to my house instead. When I called them right away to tell them I needed to change the delivery address they told me too bad, it couldn't be changed. So I wound up paying about $30 to ship it to myself, then spent another $13 to ship it out to where it was supposed to go. Bad customer service!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 1,
          "Date": "2019-05-17T15:49:29.000Z",
          "Titre": "New $3000 fridge arrived with a huge…",
          "Contenu": "New $3000 fridge arrived with a huge dent in the side. I was told I could wait on a replacement or keep the dented fridge with a 5% discount. I opted for replacement. #2 fridge arrived two days later and it was in worse shape than the first one. More dents were in the fridge, a hole in the left bottom side and the bottom pull out drawer was broken .So, I am now waiting on #3 fridge which I was told may be a month or more before it arrives. I do get to keep #1 fridge for use until #3 gets here.  What a mess!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cathryn",
          "Nb_Reviews": 4,
          "Date": "2019-02-10T14:25:54.000Z",
          "Titre": "Where is my stove?",
          "Contenu": "And the paperwork on my stove had the wrong first name and the wrong telephone number. I tried to contact customer service because the delivery time would not work for me and a week later I still have not gotten any response to my email or text. I have no idea where my stove is. By the way it is fully paid for"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2019-03-02T09:09:03.000Z",
          "Titre": "No follow up regarding damaged goods upon delivery.",
          "Contenu": "Sale process was fine, delivery was quick, but communication after the sale was not available.  Delivery service advises to text for faster service, but offers no reply.  Damage to oven was communicated back to delivery service, but no follow up from EE was received on how/when it would be repaired/replaced."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Boner",
          "Nb_Reviews": 1,
          "Date": "2018-11-15T15:18:32.000Z",
          "Titre": "When they delivered the 4 appliances on…11/8",
          "Contenu": "When they delivered the 4 appliances on Thursday !!/8... there was a dent in the door of the refrigerator. I sent pictures as well as scratches of the hardwood floor. I called Tuesday, 11/13 and left message for Ashley, who I have previously communicated with. As of today 11/15 ....NO RESPONSEBill Boner"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Irate Customer",
          "Nb_Reviews": 2,
          "Date": "2020-05-27T13:29:54.000Z",
          "Titre": "Don't expect for everything to be there.",
          "Contenu": "While we received the item we ordered,  it was missing half of its accessories that were advertised, and zero response from multiple messages to customer service.   This caused a unnecessary shopping trip to try to find the missing accessories,  so we could use the item."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "david capps",
          "Nb_Reviews": 1,
          "Date": "2019-02-20T17:03:29.000Z",
          "Titre": "I already told them this Their return…",
          "Contenu": "I already told them this Their return policy is a joke to return pkg must be unopened and in \"pristine\"condition How oin the hell can you do that You have to open to find out why youre un happy In this case because there was no voice mail on units I didnt do enough research on these phones I guess But I assumed all anasonicphones had the same featuires that my old Panasonic phones had I disconnected them and put my old phones back in The new ones are in bottom of my closet till I dind someone who wants the cheap things"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allen Jeff",
          "Nb_Reviews": 4,
          "Date": "2019-07-18T16:06:10.000Z",
          "Titre": "Communication was good initally but…",
          "Contenu": "Communication was good initally but when a package was lost by Fedex in shipment (Fedex's representative admitted their driver delivered it to the wrong address and let a stranger sign for it but couldn't get it back later)  EE refused to issue a refund or replacement.  I was surprised things could go so wrong with a package that had signature confirmation.  The problem was really between them and Fedex who was fighting their claim but they passed it on to me when it wasn't my fault. They need to work on how they handle claims."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raf",
          "Nb_Reviews": 2,
          "Date": "2019-03-04T13:20:18.000Z",
          "Titre": "Broken item",
          "Contenu": "The Samsung TV 55' came broken. No visible dents or creaks were found. But when it was plugged in, the huge crack appeared on the screen.Return and refund and waisting time...Customer service copy-pasting messages.2 stars just because big box with \"nothing\" was delivered"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ikari",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T12:27:49.000Z",
          "Titre": "Received previously opened item",
          "Contenu": "The package of my Xbox Elite series 2 controller was opened before it arrived. The seals have been cut with a blade and the trigger pads were missing. Can't say I'm confident that I got a new controller and not a refurbished, or was sent the display model."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 2,
          "Date": "2020-03-19T22:31:44.000Z",
          "Titre": "No Follow Up email with tracking and upon receiving my order there was a part missing.",
          "Contenu": "I had to call CS to get a tracking number, when it states on web site that You will be receiving another email with the tracking number.Then when I received my Yeti Tumbler with the magnetic slide on top was missing. I contacted CS when I recieved my Yeti and told the representative about the lid missing the part. The representative checked other locations to see if they had one in stock.No Luck.The representative said I could return it for a full refund or they could give me a $10 credit back to my card.So that is what I did. Not sure if I would order from them again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T11:13:32.000Z",
          "Titre": "I purchased a countertop ice maker",
          "Contenu": "I purchased a countertop ice maker, it didn’t specify that it was used or refurbished on the online ad. (Guessing they must sell both, I would have specified that I wanted a New one if needed) I received my order, the box was very damaged and marked “Returned” on all sides of the box. When I opened the box there was no direction book,owners manual, or receipt information in either of the boxes. I immediately emailed them and the only response provided was that they would approve a refund if I wanted to ship it back to them, but needs to be within 10 days of original purchase???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2019-03-19T16:16:36.000Z",
          "Titre": "Ordered and purchased our new…",
          "Contenu": "Ordered and purchased our new applainaces March 4.  Got the delivery set for this Thursday yesterday.   Today get a phone call that the washer and dryer are on back order till May sometime.  The card we used us with me in Wisconsin.   How can this be resolved right now.Ron Hessil"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T13:22:03.000Z",
          "Titre": "Had to bring back dryer that was…",
          "Contenu": "Had to bring back dryer that was delivered, to the store in Cookeville. It had a big dent in the side.They did give me a new dryer, only to have the timer go bad. it cost me $60.00. I will not be doing any more business with Electronic Express any more. Also will be closing my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh H",
          "Nb_Reviews": 3,
          "Date": "2019-11-12T12:07:31.000Z",
          "Titre": "Quick delivery, shabby condition",
          "Contenu": "My dehumidifier arrived quickly, but the box looks like it was placed in standing water. It was disintegrating at the bottom and had water marks on the bottom half foot. It actually runs, but the condition of the box leaves me hesitant to buy anything here again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 1,
          "Date": "2019-04-09T21:08:09.000Z",
          "Titre": "I brought a freezer from the one in…",
          "Contenu": "I brought a freezer from the one in Mufreesboro and was told that they didn't have one in on that Saturday but would have one on the following Wednesday and they would call me. Never heard from them so I called them on that Friday and was told they were out again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ms Marilyn Stevens",
          "Nb_Reviews": 1,
          "Date": "2019-01-06T00:54:46.000Z",
          "Titre": "Faulty charger cord to ordered tablet",
          "Contenu": "I ordered & received a tablet & case combination, which looks great!!!  BUT THERE IS S MAJOR PROBLEM....THE CHARGER CORD IS DEFECTIVE!!!  I'VE SENT YOUR COMPANY 2 EMAILS REGUARDING THIS PROBLEM, BUT I HAVEN'T RECEIVED ANY RESPONSE FROM YOUR COMPANY!!!  PLEASE ADVISE ME IN REQUARDS TO THIS MATTER WITHIN THE NEXT 5 BUSINESS DAYS, AS I HAVE A HAVE ALREADY GIVEN YOU THE LAST WEEK TO DO SO!!!  IF YOUR COMPANY WILL SEND A REPLACEMENT CORD I CAN KEEP THE TABLET, IF NOT THEN I WILL NEED TO RETURN IT & RECEIVE A FULL REFUND....THANKS FOR YOUR PROMPT RESPONSE"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C. Hendrick",
          "Nb_Reviews": 2,
          "Date": "2020-10-29T13:36:49.000Z",
          "Titre": "Oven works fine, but...",
          "Contenu": "Oven works fine. We got it installed and all set up before realizing there was a dent on the top of the unit above the controls. The box had a pretty big damaged area on top but didn't look like it reached the unit. Our fault for not thoroughly inspecting every square inch before bringing it in the house and hooking it up. We paid too way too much money for a factory second. Electronic Express' response is just \"sorry, what do you want to do\". Not their fault but sending in the photos of the damage we should have been credited as this is a factory second. I have an idea to build a shelf to cover it up but still."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marion",
          "Nb_Reviews": 2,
          "Date": "2019-04-11T12:05:25.000Z",
          "Titre": "Great selection of electronic probably…",
          "Contenu": "Great selection of electronic probably better than the Best Buy in my area but it was the manager that day helping me to find a pen for my surface pro. He told me that they where doing no taxes that day. When I checked out and got my receipt there was tax charged."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T11:59:05.000Z",
          "Titre": "I called about my order and I was …",
          "Contenu": "I called about my order and I was  surprised that the lady I talked to was not polite at all during the inquiry of my order. She didn't seem to give a _______.  I did get the order in and was satisfied with the item. Not sure I'll buy again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deloris LaFave",
          "Nb_Reviews": 2,
          "Date": "2021-01-07T17:56:34.000Z",
          "Titre": "Ordered a pizza oven",
          "Contenu": "Ordered a pizza oven. It came fine, but the bottom of the box was rotted out and cardboard had been placed over it. There was nothing protecting my order. The oven seems to be fine but I was disappointed in the packaging and delivery."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-07T12:33:33.000Z",
          "Titre": "Delivery issues delivering to our…",
          "Contenu": "Delivery issues delivering to our vacant rental property; received a text at 8:10pm one Friday night that they’d be there in 10 mins. They Did not call to get the lockbox code, just left without delivering. Have been on the phone with them multiple times"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2019-03-11T23:06:13.000Z",
          "Titre": "When purchasing my computer they were…",
          "Contenu": "When purchasing my computer they were extremely friendly and helpful. When I returned hours later with a problem all friendliness was gone and I was met with challenges. “Who sold it to you, What did you do?” I will shop at different store in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T20:26:53.000Z",
          "Titre": "Pros and cons",
          "Contenu": "Neg-Prices are available everywhere- no real discounts-No free shipping- Pos-Easy to manage site- items are as represented Fast shipping / delivery"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phuoc",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:20:47.000Z",
          "Titre": "You told me and my sister will have…",
          "Contenu": "You told me and my sister will have 300$ visa gift card back for each person but so far we didn’t receive anything from the day we purchased yet. We feel like you guys tricked us for that"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T13:23:01.000Z",
          "Titre": "When it comes to buying a tv make sure…",
          "Contenu": "When it comes to buying a tv make sure you do your research, because some of the tv’s features are unwanted and can not be change on a LG OLED MOUSE POINTER IS A PAIN IN THE ASS. So if you don’t like mouse pointers that have a AI ATTACH as a feature then don’t waste $1400 on this tv for gaming. IT will randomly appear every time u move the tv control and drive you nuts because when you click to view its has already jump to a new area/feature on the tv…and it disrupts viewing on apps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne Rockhill",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:55:42.000Z",
          "Titre": "Good price for the TV but the delivery…",
          "Contenu": "Good price for the TV but the delivery process was ridiculous. Instead of using UPS, FedEx, or DHL, they use some other shipping company that took too long and has inconvenient delivery times."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "yukon",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T18:48:47.000Z",
          "Titre": "Not a very good experence",
          "Contenu": "I placed 2 orders for weather radios, both addressed to my P. O. Box. One order for 5 radios and one order for 1 radio. I received the order for the 1 radio at my P. O. Box because it was sent USPS. The order for 5 radios was sent UPS which does not deliver to P. O. boxes and was returned. I had to reorder to be sent to my physical address, which USPS doesn't deliver to. Electronic Express ordering system should have caught the shipping problem up front. It took several days for the refund to post to my account after the returned shipment was received even though the charge was posted as soon as I placed the order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:07:01.000Z",
          "Titre": "It takes too long to deliver."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marlene",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T05:09:53.000Z",
          "Titre": "We liked the quick delivery service and…",
          "Contenu": "We liked the quick delivery service and the delivery men.  They were fast and they cleaned up after the cutting through the cabinet to install the dishwasher.  They did not tell me how to start the dishwasher.  The company instructions were not detailed enough.  I went on the internet and got more information but not enough explanations.  I would like to know how much time each program takes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Drake Pertuit",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T13:47:17.000Z",
          "Titre": "Good price and product delivered on…",
          "Contenu": "Good price and product delivered on time but it came with 100 emails that are still coming."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keohane",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:01:17.000Z",
          "Titre": "Delivery Service from Electronic…",
          "Contenu": "Delivery Service from Electronic Express was a hit and miss mess from Day One. There were some good parts and other (not so good) parts. We scheduled delivery of our kitchen package on Saturday, October 7 (stove, refrigerator, microwave and dishwasher).  We knew from the beginning that the microwave was backordered and would not be delivered at that time so that was expected.When the delivery team arrived, they set up the refrigerator with no issues. They then told me that they did indeed have a microwave on the truck so they brought it in and installed it.  They made a mess on my countertops drilling the holes in the cabinet above the stove to install the microwave and did not clean it up.They then brought in the dishwasher – after a few minutes, they called me into the kitchen and said that they could not install the dishwasher because they could not get my old dishwasher out because of the way my tile flooring was laid. I did see them yank on the dishwasher so I believed what they told me was accurate.That team left – I called the store immediately and spoke to William, the store manager who sold me the kitchen package.  I explained what they told me. He assured me that once I had the flooring issue resolved, I could reschedule the install (at no additional charge which was GREAT).While I was waiting on a contractor to come out and resolve the dishwasher issue, 2 issues happened.  First, we noticed a dent in the side of the new microwave that was delivered. I called and spoke to one of the salesmen in the store where I purchased. He referred me to the install department. They were great to offer a new microwave and scheduled a replacement to be delivered on November  18.The second issue was quite a bit more involved. When the techs attempted to remove my old dishwasher on the original install date of October 7, they unhooked the water and drain lines under my kitchen sink. When they couldn’t install the new dishwasher, they did NOT reattach any of those lines. The undersink area flooded, soaked and damaged the wood under the sink. We did not notice it until a couple of days later when the wood was saturated and the water started to flow out onto the kitchen floor. We placed a catch basin under the drip and had to constantly deal with emptying that basin to prevent more damage.  I did not call and report that because I was so fed up and frustrated with the whole process. It took me four weeks to get a contractor to come out and look at the tile in front of the dishwasher and determine what needed to be done to get my old dishwasher out. It cost me $100 for them to tell me that all they had to do to get the old dishwasher out was to RAISE THE LEVELING LEGS, and it came right out.Needless to say, I was very disappointed that your installers apparently didn’t think to try that. So, now that the dishwasher was removed and we were ready for the new dishwasher to be installed, I emailed home install and asked if the new dishwasher could be installed on the same service call as the replacement microwave on November 18. They told me that it would be no problem to amend the work order. When the installer came on November 18 – he installed the new microwave, had me sign that I accepted the delivery and started to leave. I asked about the dishwasher – he was very polite but said he did not have a work order for the dishwasher install. He left – I immediately called install, voiced my displeasure about having to wait for yet another appointment.  I was rescheduled for November 27 to get my dishwasher finally installed.The techs came on November 27 and installed my dishwasher finally.  The tech who installed the second microwave and the dishwasher (Nico) were very nice and did a great job. I have no problems with those 2 teams. The first team was disappointing. We will never buy anything from Electronic Express that has to be delivered and installed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Moni",
          "Nb_Reviews": 3,
          "Date": "2023-11-26T19:30:24.000Z",
          "Titre": "I have bought reconditioned items…",
          "Contenu": "I have bought reconditioned items before but this one appeared to be a little rough on exterior"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jewell Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:15:20.000Z",
          "Titre": "Damaged appliances should always be replaced or take some money off the price.",
          "Contenu": "I would of given a 5 star, but! I don't have my paperwork to tell me what my payments are and date of payment.  Also! My microwave was damaged some. My husband and I said it was fine, but! After the delivery guys left. I look at it more and decided I wanted another microwave.  They told me someone would call me and let me know when they could bring me another microwave.  I never received a call back. I have called the warehouse 4 different times. They told me that my microwave was out of stock and they didn't know when more would come in. That wasn't good that they never called me back. Customer are always supposed to come first. I still have a damaged microwave.  At less they should take some off the price of my microwave since they don't want to give me another microwave. I didn't like that I had to keep calling them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:22:52.000Z",
          "Titre": "Unfortunate install issues",
          "Contenu": "Our salesperson was pleasant and friendly but a bit talkative lol.  Unfortunately the delivery crew was quite bad, they were not prepared to install and once we pressured them to look at the receipt and call the manager and got them to do the install they did not install correctly and made a very large mess of the house. Our refrigerator was damaged and had to have a follow-up install."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T18:18:06.000Z",
          "Titre": "Appliance arrived quickly.",
          "Contenu": "Appliance arrived quickly.Dislikes:Shipping fees are high This item was the same price everywhere else. It’s not discounted.Do better if you expect customers to return."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T00:10:20.000Z",
          "Titre": "The good and the bad",
          "Contenu": "Choices and ordering were great, as well as prices. However, I was told my appliances would be here in approximately 2 weeks,  3 weeks at the most. And at 4 weeks, we are still waiting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KAREN P SCOGGIN",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T17:30:11.000Z",
          "Titre": "Several issues with appliance",
          "Contenu": "Several issues with appliance. Was scratched, had door replaced, would not line up correctly , leaked from freezer front panel, had second door replaced, would not line up and then severe leak from ice/water dispenser.  Had to accept a second scratched refrigerator.  Will not deal with Electronic express in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T12:08:01.000Z",
          "Titre": "Shady pricing tactics",
          "Contenu": "Shady sales tactics. Their “before”prices on a lot of stuff are highly inflated to make it seem like the “sale” price is a good deal, but many of the sale prices are just the same price you’d pay anywhere else, but they tell you you’re saving 50% on sale! Do your research, don’t be fooled by their garbage before and after prices."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T21:37:30.000Z",
          "Titre": "Sales- Very Good- Inventory- Very Bad",
          "Contenu": "The salesperson was very friendly and sought to understand our needs. The selection was generally reasonable. The reason for the lukewarm review was availability. When I decide to go to a store to buy something versus Amazon, I want to pick it up right then, not two or three days from now. You need more inventory on site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TERRY MOORE",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T21:31:05.000Z",
          "Titre": "Dishwasher is good and quite",
          "Contenu": "Dishwasher is good and quite.  Dishwash time seems long but does a good job.  Installation was quite questionable however.  I fixed to leak in the drain line connection myself.  I also removed the two screws the installer was trying to drill into the underside of my granite counter top and used the installation holes provided on each side of the dishwasher to attach it to my cabinets.  This allowed me to level it better as well.  Still glad to have the installers unload it and place and make the original connections and haul-away my old one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Byron",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T23:31:57.000Z",
          "Titre": "Delivery was frustrating.",
          "Contenu": "Bought a stove, refrigerator, and dishwasher. The first attempt at delivery the crew was uncomfortable trying to put the refrigerator in the house. Understandable so they rescheduled. However, the store manager was extremely rude to my wife and me saying the delivery crew can get the refrigerator in the house. I told him to take it up with them. Second delivery attempt I took off work for and the refrigerator was left off the truck so a third delivery was necessary. An issue with the dishwasher was resolved during the second delivery. Salesman in store was very courteous and attempted to help with the refrigerator and dishwasher issue. All delivery personnel were very professional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelby",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T12:19:27.000Z",
          "Titre": "My washer and dryer were delivered…",
          "Contenu": "My washer and dryer were delivered without the pedestals I had purchased. When I called my local store the manager said it was “no big deal” and that I should have them in a couple of weeks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Talisa",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T16:11:12.000Z",
          "Titre": "Went in to purchase an open box tv",
          "Contenu": "Went in to purchase an open box tv. Website said it was there at Springhill TN store. Got there, it wasn’t there. Old bait and switch. Bought the one in box, however I’m very disappointed in Best Buy’s for not giving me the one in the box for the open box price.  Scam!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Della Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:38:41.000Z",
          "Titre": "The folks who delivered were very good",
          "Contenu": "The folks who delivered were very good, this was the first round. They could not hook,the dyer up because they did not have correct cord. I had emphasize the correct size they would need before coming out. So the delivery started from noon to 3, then I was told could be 4 or after took off work, they said didn't no when someone could reschedule for the cord, so here I am washer with no dryer, then since it was a gift from my parents my Dad insisted they fix it quickly and they gave a time for the next day 7 to 10, took off work again, they showed up around 7:45. They did not finish unpacking my dryer and the guys the second day left trash behind for me to throw away. So from here you can figure what was good and what we did not like. Forgot this part when we first called in the woman told us to take that cord back to the store and exchange for the correct cord, we told her they left no cord, and we had paid for delivery and hook up, her comment you can always get a cord."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bernadette K",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:34:55.000Z",
          "Titre": "Comparable prices",
          "Contenu": "I don't believe the majority of the staff even knows what they're talking about.  Hard to distinguish staff from customers.  It's never good for staff to smell strongly of marijuana. Otherwise, prices are comparable to other chain stores."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T15:13:20.000Z",
          "Titre": "I love my new washer and dryer so far but I have to pay over 300 dollars extra out of pockets because incomplete assessment of inlet/outlet.",
          "Contenu": "I love my new washer and dryer so far.The people were nice.But I was not asked about the plug-inlet/outlet so they couldn't plug in my dryer therefore I had to pay an electricians to fix it….The delivery people were niceBut After they install the washer my carpet was wet.I first thought that perhaps the old washer leaked on the carpet but I had to keep sopping water for over a week and mold was gathering on the wall behind the washer. (I DID NOT HAVE THIS LEAKING PROBLEM BEFORE the New Washer was installed. It took several more day to get E.E. to come out to found out the problem.The inspectors were nice. They said that It was not the machine.So I had a plumber come out; he charge me 100 dollar to tightening where the holes was put in.I think that the installers should had made sure that it was secured…."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Fowler",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T00:38:32.000Z",
          "Titre": "They misrepresents the controller I…",
          "Contenu": "They misrepresents the controller I purchased for my son. I think it was Microsoft’s fault too, but I expect the retailer to know what they are selling. The model number on the listing (FST-00008) was not the model number of the controller sent to us (FST-00001). It was a previous version that has a history of bad issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey Deason",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T22:16:45.000Z",
          "Titre": "Easy process but damaged products",
          "Contenu": "Process was easy, however 1st set I got the dryer didn't dry, had to take and swap out washer and dryer because they didn't have another set like mine. I get new set home and the dryer had a big dent in the side. Luckily they had another set so I only had to take and swap the dryer out. The sales person was great but the manager was rude and seemed like she was spaced out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T08:09:34.000Z",
          "Titre": "Everything was fine except for the part…",
          "Contenu": "Everything was fine except for the part were you have someone following you around like your going to steal something. I understand that they work off commission but 5ft from you the whole time your there is a little extreme"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID L",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T00:43:20.000Z",
          "Titre": "Very nice high end store",
          "Contenu": "The sales boy was not very knowledgeable about anything.  He had good customer service but lacked that personal service knowledge. Had a self guided tour and enjoyed the store greatly.  Love the product!  Klipse 600 home stero surround sound bar"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WA State",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T15:52:46.000Z",
          "Titre": "In store service was great",
          "Contenu": "In store service was great. Delivery and setup not so much. Tips expected for basic setups. And I paid over $400 to mount a tv. Seems to be two separate entities between the store and your actual installation and delivery services."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam B. Snyder",
          "Nb_Reviews": 3,
          "Date": "2022-09-25T19:30:32.000Z",
          "Titre": "Great TV",
          "Contenu": "Great TV Pleased with the TV after installation and after the family has had viewership for the last few weeks and it looks like it will hold up well. The problem was poor packaging during their delivery which was deposited on my doorstep stealthily!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A STEVENS",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T08:40:01.000Z",
          "Titre": "It took three times before I got the…",
          "Contenu": "It took three times before I got the right refrigerator.  Everyone was nice but I wasted several days waiting around for each delivery attempt.  So far, the refrigerator still works well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T16:12:22.000Z",
          "Titre": "The delivery was not so good",
          "Contenu": "The delivery was not so good. They tore my door frame up pretty bad. The salesman was great. Y’all definitely need to figure out a better way for delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fred Carmichael",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T04:48:41.000Z",
          "Titre": "What ever happened to the customer is first?",
          "Contenu": "G. M. Hunter is top shelf in his dealing with this customer. When I went into the store, I told him I was not real happy with E.E. at present. He listened to my complaints and understood the situation. I had spent most of the day trying to get E. E. phone sales. Something other stores do but not E.E. Overall my time with Hunter was productive and friendly. Can't say the same for most E. E. floor or 'net people I dealt with."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T16:22:47.000Z",
          "Titre": "I disliked the fact that my…",
          "Contenu": "I disliked the fact that my refrigerator on the first delivery was damaged. I had to wait another week to received a brand new one. The second delivery was somewhat disappointing because I had to leave my new refrigerator out on my back deck for a for days and was not able to get things hooked up or my old refrigerator disposed of. This was all due to the issue with me not having a shut off valve on the waterline running into the back of my old refrigerator. No blame but I had been without a proper working refrigerator for a few years now. I had my mind focused on a new up to date refrigerator of my choice. I think if you had someone that was more advanced with the installment process you would not have to turn the customer away because the delivery guy doesn't know how to install shut off valves. It's all a part of successfully installing refrigerators. There were a few bleeps with my delivery but accidents do happen. All in all I would still recommend purchasing electronic or appliances from Electronic Express. I plan to purchase items from Electronic Express in the near future. Thanks M and K Thomas"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mixtiles customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T19:21:23.000Z",
          "Titre": "I feel like when tell the sales person…",
          "Contenu": "I feel like when tell the sales person that you are not interested in all the extras they try to push on you, that they should stop after the first time you tell them NO instead of keep asking you to buy this or that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michel harris",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:03:38.000Z",
          "Titre": "I had to replace a defective microwave",
          "Contenu": "I had to replace a defective microwave; had to go to the warehouse to retrieve -they insisted I could not bring the broken one back to the warehouse (even though that is the same address on the shipping label they sent) customer service was completely rude and could not explain why if I had to drive 40 miles to pick the new one up why I could not drop off the broken one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAY",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T17:23:59.000Z",
          "Titre": "LG mount",
          "Contenu": "I reached out to Electronic Express for lead time before placing my order and was told I would have my order in 3-5 days....it took 12!  I was in a time crunch.  After 5 days, i asked where my order was and I received an \"We're sorry for the delay.  You can cancel if you would like.\"  When I would ask for an ETA they would give a broad...\"it'll ship this week\"It is unprofessional of them to not even provide and accurate ETA.  It seemed like they didn't care.  I finally received it and the product is fine but I don't think I will be ordering from them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike in Tennessee",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T03:04:37.000Z",
          "Titre": "Return Policy Fail",
          "Contenu": "Ordered a Computer Monitor.  Arrived as expected. Installed.Worked fine for 2 days.  Day 3 screen would go to black thencome back on.  Day 4 monitor died.  I thought no big deal, take to a retailstore give them the dead monitor they give me one that works ... Advised by CS No returns to storeShip back to company - they will evaluate and issue a refundI should have ordered from Amazon"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T13:30:17.000Z",
          "Titre": "Got a good deal, but not perfect",
          "Contenu": "Very good deal and was shipped on time.  But I would have liked the watch to be packed a little more safely for shipping. The watch box was just put directly into a mailer with no cushioning.  I also noticed a very light hairline scratch on the bezel.  It's not noticeable so I'm keeping it, but again not ideal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Dilbert",
          "Nb_Reviews": 4,
          "Date": "2023-10-06T15:53:46.000Z",
          "Titre": "A bit disappointed in the shipping…",
          "Contenu": "A bit disappointed in the shipping time. Still haven't received it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LANCE HASTY",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T20:29:54.000Z",
          "Titre": "Chrome book",
          "Contenu": "I wish the salesman had told me that iTunes doesn't work on chrome book. Other than that, it was a good experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T14:24:48.000Z",
          "Titre": "We just moved to Gallatin from…",
          "Contenu": "We just moved to Gallatin from Scottsdale AZ.  My son-in-law bought his Samsung 75\" TV from your store so I went and bought 2 of the same for our new home in Gallatin.  Everyone was nice, the their ENTHUSIASM was low.  I told them from the start I knew exactly what I wanted and showed them the exact model and asked them NOT TO TRY TO SELL ME ANYTHING ELSE.  That did no good.They seemed all 4 or 5 of the employees, not to want to leave the cash register area and walk down to the TV's and then wanted to discuss other model.  I did not appreciate it, and reminded him NOT to make any suggestions.I told him I had 21 Samsung TV's in my last home and I loved them and have no interest in buying anything other than the model I showed him on my iPhone.  He back off and went to work.I wanted them delivered AS SOON AS POSSIBLE.  And also wanted them installed if they had a day in the next few days, and if not my son-in-law would do it.  I didn't want him to have to as he is very busy. I reiterated whether or not they could install them I WANTED THEM DELIVERED AS SOON AS POSSIBLE.  It seemed to go in one ear and out the other.Now regarding the delivery.  I did get the TV's the following day.  The delivery guys came from North Carolina I believe he told me.  THEY WERE GREAT.  One of the guys carried a TV by himself (super strong) and handled himself and the other man was also a very good worker.  THEY DID A GREAT JOB.Back to the store associates for a moment.  I did witness a couple other customers come in.  One wanted a refund and another something else.  The team seemed to handle them fine.  That was nice.  They were very nice to me, JUST POOR LISTENERS.I would consider doing business with you again in the future, even though all of my electronics have come from BEST BUY.  I do appreciate convenience and your store in Gallatin is only a mile or two from me.One more thing.  Your questions below are crazy.  Why would you ask me which store.  You know the answer better than I do???Why would you ask me my name.  You also know that???More of a waste of my time and making me read a list of stores to click on.  Give your quiz some serious thought and learn from me only things you don't already know."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:51:31.000Z",
          "Titre": "okay",
          "Contenu": "Salesman told me my equipment would not work if I did not buy what he suggested"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Straub",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T17:45:47.000Z",
          "Titre": "Put the year and generation of product on website.",
          "Contenu": "Your site is misleading I got a 2018 iPad Pro instead of a 2020 .  You should really make that clear on your site . It’s not good business robbery deceptive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T13:16:17.000Z",
          "Titre": "The salesman that waited on us did not…",
          "Contenu": "The salesman that waited on us did not know anything about the wi-fi extender device."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kyler Houser",
          "Nb_Reviews": 3,
          "Date": "2023-07-10T03:04:29.000Z",
          "Titre": "Long LT",
          "Contenu": "I waited 5 days to get a shipping confirmation, which required a phone call to get."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tiltbob",
          "Nb_Reviews": 3,
          "Date": "2023-08-14T02:35:48.000Z",
          "Titre": "Room for improvement",
          "Contenu": "Made my order. They excepted. They charged me for the product. They emailed me the next day and said that it was out of stock.When you have a product out of stock please make it impossible for people to order it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T03:35:32.000Z",
          "Titre": "The manager and a salesman openly…",
          "Contenu": "The manager and a salesman openly disagreed about the product I should buy on the sales floor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emo",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:41:49.000Z",
          "Titre": "Try to up sell things you do not need"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PAUL",
          "Nb_Reviews": 10,
          "Date": "2021-03-28T11:47:33.000Z",
          "Titre": "Low inventory",
          "Contenu": "Not enough inventory on hand. Advertised item not availabe in store"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JEFFREY D COSTA",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T23:53:35.000Z",
          "Titre": "Salesman was knowledgeable but had…",
          "Contenu": "Salesman was knowledgeable but had really bad breath."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TERRANCE WOODALL",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T01:01:01.000Z",
          "Titre": "Could have been more available sooner…",
          "Contenu": "Could have been more available sooner for questions"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "shanon rooker",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T04:47:52.000Z",
          "Titre": "Poorly packaged for shipping.",
          "Contenu": "The of my items was good, but they bag it was shipped in caused some damage to the box. Wasn’t happy about that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Eroyan",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T18:02:54.000Z",
          "Titre": "Had to return my first order ever",
          "Contenu": "Had to return my first order ever. Sad but they took care of it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAVID SULLIVAM",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:14:34.000Z",
          "Titre": "First trip second trip",
          "Contenu": "Not sure of the exact dates buy may of 23 I went in to the store here in my town to look for speakers as I stood in the speaker display trying to figure it all out there was Noone around except three employees sitting in the next section over when I would loo thier way they wood turn around  so I left a few days later I had to go back it seems they were the only place I could the speakers I wanted an this time there a very nice young man I can't remember his name but he was very helpful I'd go back only if he was working"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T22:15:03.000Z",
          "Titre": "Still havent gotten my stove been 9…",
          "Contenu": "Still havent gotten my stove been 9 weeks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KATHLEEN POWELL",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:37:42.000Z",
          "Titre": "Sales person was rude and obnoxious."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Malakai  Medellin",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T16:31:39.000Z",
          "Titre": "Good packaging the helmet was a little…",
          "Contenu": "Good packaging the helmet was a little scratch"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JEREMY HITCHCOCK",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T19:06:48.000Z",
          "Titre": "Had to return first TV",
          "Contenu": "Had to return first TV, due to half the screen was dark."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T13:33:52.000Z",
          "Titre": "Appliance install BEWARE",
          "Contenu": "Two appliance install experiences. 1. Dishwasher was not sold with a cord to hardwire so the install could not be completed that day. 2. Range was delivered and I was informed they no longer install gas appliances and would only take my old one of it was unhooked. The salesman sold me a gas kit so that it could be installed by EE. I then had the range sitting in my living room in a box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T16:33:59.000Z",
          "Titre": "Everything was great",
          "Contenu": "Everything was great! Shipping was fast, and the product arrived as described. However, it went in sale for $80 less not even a week after it was delivered, and I contacted you guys asking if it would be possible to match the new sale price. I was told no, and it’s unfortunate because the original transaction was so close to the new sale price. A store credit would have even been great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L. P. from California",
          "Nb_Reviews": 2,
          "Date": "2020-10-28T15:05:20.000Z",
          "Titre": "Extremely difficult to be able reach a…",
          "Contenu": "Extremely difficult to be able reach a person...called multiple times and several days to finally reach a person. I had received a defective new cd player and wanted help to return it. Thinking about placing another order but concerned I might have the same experience. It has been over 2 weeks since I returned the product and I have not received a confirmation credit of my returned item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Forrest",
          "Nb_Reviews": 3,
          "Date": "2020-12-08T14:43:22.000Z",
          "Titre": "This has been my first experience with…",
          "Contenu": "This has been my first experience with this company and I'm disappointed. I ordered an in stock monitor and 9 days later it has still not shipped and customer service is very slow at relying to any emails. The price was good on the monitor but making a shipping label the day I bought it and 9 days later it still has not shipped is very troubling for me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T14:46:07.000Z",
          "Titre": "Shipping Method is Seriously Lacking",
          "Contenu": "The purchase experience was fine, but the item was shipped in the worst packaging ever. An almost $200 Nintendo 2 DS XL was put into nothing more than a padded envelope. They charged $15 for shipping, and that's the best packaging they could find? By the time it got to me there were multiple tears in the envelope and part of the seal had been torn open. Thankfully, the device worked, but for $15 I expected a little better packaging."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer in Tennessee",
          "Nb_Reviews": 1,
          "Date": "2020-11-28T13:07:08.000Z",
          "Titre": "I hate it when a salesman bs me",
          "Contenu": "I hate it when a salesman bs me. Its what happened here. Guy in the store talked me into getting this expensive gaming monitor, \"because thats the kind he uses.\" Found a better deal online at EE website and had to return the one I bought in person. He could have probably searched online on their website the first time and saved me the trouble."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AnnaLee",
          "Nb_Reviews": 10,
          "Date": "2020-12-09T12:36:34.000Z",
          "Titre": "they shipped everything",
          "Contenu": "they shipped everything well nothing was broken but it was defective and had to send it back. they wouldnt send me any return info for fedex to come and pick it up, so i have no proof whatsoever so i had to make the fedex guy leave. i called them again and finally  got info about the return so the fedex will come again today, hopefully. will update"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-27T14:03:53.000Z",
          "Titre": "The TV shipped quickly but was used",
          "Contenu": "The TV shipped quickly at a good price. However, it was supposed to be a new tv, and it had been used. The packaging inside was disturbed, and the roku had already been set up with a person's account. It appeared that it may have been a display model. It worked fine, but when you buy a new tv, you don't want one that has been used."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T19:36:53.000Z",
          "Titre": "I wanted to rate this 5 out of 5 but…",
          "Contenu": "I wanted to rate this 5 out of 5 but based on the issues I am having with the products and then having to go through the manufacturer for help (products are out of warranty). So now I have no way of getting this resolved and stuck with my order. Great ordering process and would recommend to others but just be careful with making sure your products work properly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-27T15:00:54.000Z",
          "Titre": "Shipping delayed",
          "Contenu": "My AC was initially going to come in a few days but got inexplicably delayed so it came the day after a heat wave ended. We got a shipping confirmation notice and then it didn't actually get dropped off at the shipping company for almost a week. Customer service was very responsive but could not offer any explanation for the delayed shipping. AC works great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T14:25:37.000Z",
          "Titre": "Good product but experience buying it",
          "Contenu": "I bought a beautiful Cookware, the product was great but for some reason they charged my card twice and sent to my email  only one receipt showing one transaction.  Thanks God I checked my account around two days after the purchased then I  saw the double transaction. I called customer service they handled properly but it wasn't such a good experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Bailey",
          "Nb_Reviews": 2,
          "Date": "2020-03-11T15:43:04.000Z",
          "Titre": "Listed as damaged box but had more damage than the box.",
          "Contenu": "I purchased a vacuum, arrived a few days late. It was listed as having a damaged box. After opening the canister was damaged and the power switch was inoperable. I notified and was sent a shipping label. Not happy that the vacuum was not inspected before being shipped and the time lost dealing with it but the seller probably does not look inside a box before shipping and they did refund me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-04-23T12:18:40.000Z",
          "Titre": "Buying w Electronic Express online was…",
          "Contenu": "Buying w Electronic Express online was great. Free Fedex shipping sucked. Fedex had my package out for delivery on Friday. Fedex said my address did not exist on friday. I did not receive it until the following Tuesday. Funny how my address did not exist one day and they could deliver later. Although the package looked like it had been through hell, the inside was OK.If I buy from Electronic Express again, I will insist on UPS or USPS shipping. They can find me!!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T21:51:38.000Z",
          "Titre": "Jaded customer service",
          "Contenu": "My package was stolen upon delivery, while this is not Electronic Express' fault, when I called in to ask what I could do next I was simply told \"we are not liable, sorry.\" No next steps, coupons, what I should do, nothing etc. Had a police report and everything. Again, not their fault but it clearly shows much they value a customer who may have otherwise returned. Particularly when I went out of the way to support a small business...Every big box store had the same price, and would have likely refunded me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 1,
          "Date": "2019-05-31T15:55:59.000Z",
          "Titre": "Electronic Express Credit Card",
          "Contenu": "I love Electronic Express the sales and prices aren't bad, butwhen it comes to using their credit card that's a different story.How do you have a credit card but cannot use it on their website,you can use other cards even Amazon pay but cannot use the cardof the website Electronic Express, I sometimes don't want to go tothe store and the nearest store to me is 45 minutes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 1,
          "Date": "2019-05-22T11:06:45.000Z",
          "Titre": "The store was nice but the service…",
          "Contenu": "The store was nice but the service needs work. i was looking for surround sound and blueray player, kid comes to help after i found it says he is going to look in the back for it i also inform him i was looking for a sub woofer for a car and i would be there when he returned he says ok and goes to help someone else for 20min. then comes to help me. get a sub down off a shelf. just not the service I would expect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tracy High",
          "Nb_Reviews": 2,
          "Date": "2020-07-21T13:29:56.000Z",
          "Titre": "Overpriced",
          "Contenu": "Kind of overpriced shipping is 24$. Not to mention there is no return label you have to pay for that as well. This seems as if that’s a disaster waiting to happen if you don’t get insurance when you return something. Just not the most cost efficient on their shipping and returns. Will not use their service again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patti J",
          "Nb_Reviews": 2,
          "Date": "2019-12-07T12:46:21.000Z",
          "Titre": "Good ... and Bad",
          "Contenu": "Good ... and bad....Great prices.... easy to find.... Fast shipping BUTI didn’t even know I bought my item until it arrived at my door!   Went through the process...I put my paypal info...and waited and waited and waited... Payment never accepted. Never confirmed. Tried 3 times and gave up.   So I ordered from somewhere else... and ended up with two PS4 gaming systems!  Fortunately was able to unload the second one without a problem....but what if I hadn’t?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cynthia Hatchett",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T21:47:31.000Z",
          "Titre": "I visited The 100 Oaks Store looking…",
          "Contenu": "I visited The 100 Oaks Store looking for an air condition by Danby it was not in stock, the associate checked the warehouse on the computer the price was 319.00 when the cashier rang it up the price jumped to 429.99   with a 30 per cent discount the subtotal price was 299.99. It appears it was a mark up to mark down."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-02-25T18:53:00.000Z",
          "Titre": "DVD player poorly packaged",
          "Contenu": "DVD player arrived in original manufacturers box stuffed inside a plastic non padded envelope!  Every other electronic device I've ordered online in the past comes double boxed with padding between the boxes. This helps protect the inner box from the gorillas handling boxes in transit!Fortunately the DVD player works but I'm sure it got more shocks in transit than it needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2019-02-24T11:25:14.000Z",
          "Titre": "When .i came like 2 weeks ago jyst relocated here with GM",
          "Contenu": "When .. I walked into the store the male Caucasian young man wouldn’t service me . He went & got this other young lady who did .. she showed me items .. I wanted & serviced me . He stood around & only serviced the white men who came in after me. I spent almost 1,800 ...I should of not given you my money ..The young lady was very nice .. I wanted to tip her ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cl",
          "Nb_Reviews": 1,
          "Date": "2020-09-04T12:36:42.000Z",
          "Titre": "Was a bit of a delayed process in…",
          "Contenu": "Was a bit of a delayed process in getting the product I ordered but it did arrive after about 25 days. Customer service didn't tell me anything about my delayed / damaged goods and I had to contact them multiple times to get updates on my order. Good prices but there may be a wait for your product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 10,
          "Date": "2019-06-13T15:53:36.000Z",
          "Titre": "Simple request ignored.",
          "Contenu": "Especially since EE was using USPS for delivery, I requested that my package be sent to my Post Office box address. I live on a busy street and do not like unsecured deliveries when I can avoid that. That simple request was ignored. Thankfully I did receive the package albeit it had sat in the rain several hours. Happily, the item survived that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2019-03-16T12:28:25.000Z",
          "Titre": "It was ok",
          "Contenu": "I purchased a tv through the Acceptance Now financier & It was ok. The 90 day same as cash definitely has hidden fees that no one told me about. As I neared the end of my agreement, I went in and inquired about purchasing something else and was questioned about who my landlord was and that my mom would have to come sign. I was in shock because I’m over 25 and had made every payment on time. Didn’t know what that had to do with anything."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2019-02-28T11:39:38.000Z",
          "Titre": "Overpriced, long install time",
          "Contenu": "Bought stereo that ultimately didn't work with my phone. Cannot take advantage of features without upgrading my already new phone. They charged way too much to install (triple what the place down the street quoted me). Was quoted a 1.5 hour wait. It took them 3.5 hours to install....Won't be revisiting this overpriced shop anytime soon..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-10-13T05:36:32.000Z",
          "Titre": "The package I received was beat up and…",
          "Contenu": "The package I received was beat up and torn. Don't know if it was the shipper or came from the warehouse in bad shape. When the package was opened, the product was damaged. I will give Electronic Express credit, when I reported the damage they immediately issued a return authorization."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike Way",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T13:52:58.000Z",
          "Titre": "Great site, unusual shipping problems, but solved eventually",
          "Contenu": "Great site, great prices, great communication.  I give it three stars because of snafus in shipping, not due to the shipper (FedEx), but Electronic Express' warehouse mishandling.  I eventually  received my product, but not without a lot of follow-up, phone calls and emails. I have to say I have never had a problem with orders; to be fair, this is an extremely rare shipping scenario.Appropriate apology was made and accepted. I will continue to be a customer; EE is a wonderful site with amazing deals.MIke W."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 2,
          "Date": "2019-03-20T01:07:58.000Z",
          "Titre": "The item ordered was not available",
          "Contenu": "The item ordered was not available but no one told us until I called because the receipt had not been e-mailed.  We were told we would receive a phone call the day before installation to give us a time frame.  By 6:00 we had not received a call so I called the store.  Instead of a phone call we got a text message.  Instead of a phone call 30 minutes before delivery we got a text message.  The home phone number is the one given to the sales person, but it wasn't used."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TK",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T21:04:41.000Z",
          "Titre": "Express Electronics has an excellent price on Samsung Flex washer  & dryer",
          "Contenu": "Express Electronics has an excellent deal on the Samsung Flex washer and dryer bundle. The only two things that made this experience a little sour was the change in a shipping company, which led to additional days in receiving my purchase. My second issue was about the promotional period."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2020-05-12T14:25:19.000Z",
          "Titre": "Well I guess the price was too good to…",
          "Contenu": "Well I guess the price was too good to be true? But my granddaughter loves the iPad. However, when trying to find a case to fit it, we realized that it is a 2012 model and we cannot find a case for one that old. I realize I bought a reconditioned item. I just didn’t realize how old it actually was."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mitsue Desiderato",
          "Nb_Reviews": 1,
          "Date": "2019-05-11T14:54:02.000Z",
          "Titre": "I am giving 3 stars because they…",
          "Contenu": "I am giving 3 stars because they replied quick to the return and refund.  For some reason, unknown, the battery they sent me was the exact same markings and model as the battery that I have but their battery would not fit into the phone.  just a fraction of an inch bigger on their battery.  I am in search for another battery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John O",
          "Nb_Reviews": 3,
          "Date": "2019-12-14T23:27:13.000Z",
          "Titre": "Disappointed",
          "Contenu": "Disappointed ! I ordered the TV and the website said it was in stock ,A couple of days later when checking shipping status the Company said it was back ordered  I called the Company and complained. Finally I got a person to help but the TV was finally shipped. No sure if I will order from the company again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dianna",
          "Nb_Reviews": 2,
          "Date": "2020-01-29T21:11:11.000Z",
          "Titre": "The rating would have been higher but…",
          "Contenu": "The rating would have been higher but they waited 1 week before shipping my product and did not let me know why. They did let me know when it was shipped and tracking information. Product was received as ordered. All in all it was a good experience.though. This is  my first time buying from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 3,
          "Date": "2019-04-10T23:28:50.000Z",
          "Titre": "Our purchasing process was good...but...",
          "Contenu": "Our purchasing process was good.  Our salesperson was knowledgeable and helpful.  He told us we would receive a call in about a week and a half to let us know when our dishwasher was in so we could pick it up.  When we hadn't received a call, we called them only to be told that the dishwasher wasn't on the most recent truck and so would not be in for another week.  Three weeks to get a dishwasher into the store after purchase.  Still hand washing dishes...I know, I know.  Still, 3 weeks????  Really?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-25T12:10:42.000Z",
          "Titre": "Tablet was sent to my address in…",
          "Contenu": "Tablet was sent to my address in Tennessee. Not my Moms in NJ. Kind of a bummer. I put in the right address. Not to mention having to use my bank account, not my charge account. It was denied. No balance, offers begging me to use it. Met everyone next time. My other purchases went elsewhere."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Hampton",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T00:26:38.000Z",
          "Titre": "…Where is the service?",
          "Contenu": "My rating has been formed from experiences at more than one store outlet. My initial ratings would have been all 5 star ratings. Store on Nolensville Rd. in  Nashville,Tn. Most of my other experiences have come from visits to the Rivergate outlet in Madison, Tn. There are never enough \"associates\" at the Rivergate outlet,.... and I've waited over twenty minutes to get some service there. Most times,... I simply walk out. I have purchased 4 televisions from the Nolensville Rd. store,.. and only a phone cord, or two, from the rivergate store."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Hiel",
          "Nb_Reviews": 2,
          "Date": "2020-07-09T21:05:26.000Z",
          "Titre": "Order was placed but never confirmed..",
          "Contenu": "Order was placed but never confirmed... next thing I knew about a week later I received email telling me product shipped.  Since it was shipped only in its original box, just places in a shipping bag, the box and product was slightly damaged. It works fine just a minor dent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SapphireTraveller",
          "Nb_Reviews": 3,
          "Date": "2019-04-09T11:55:37.000Z",
          "Titre": "Took too long to get my TV so I bought…",
          "Contenu": "Took too long to get my TV so I bought it from another store. Communications from EE was way too inconsistent and slow, I always had to reach out for status. After waiting almost 3 weeks for a $3400 purchase, I cancelled it and bought the TV for the same price from a store and brought it home myself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Billy Butler",
          "Nb_Reviews": 2,
          "Date": "2019-03-08T00:36:15.000Z",
          "Titre": "Car Stereo Expereince could have been better.",
          "Contenu": "Great immediate assistance with car stereo equipment purchasing decision.  Installation experience was not as smooth.  Installer did not install camera with a connection that would allow activation with a  button on the radio. The installer seemed annoyed that I was questioning his method of installation.  Management was engaged to resolve and I had to return two times to have this ultimately corrected.  I also showed management some minor damage to my dash from the installation, but was not offered any concession."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glynn",
          "Nb_Reviews": 1,
          "Date": "2019-05-23T00:25:22.000Z",
          "Titre": "TV ads promote 4K",
          "Contenu": "TV ads promote 4K, 8K, Qled, Oled and programs or networks or cable providers show little or nothing with that resolution! It is a rip off and I fell prey to their plan! Don’t pay for expensive TV like you see in the stores only to get home and see just cheap TV resolution! Rip off! Glynn Jackson"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ebay_bigsby19",
          "Nb_Reviews": 1,
          "Date": "2019-11-25T14:52:55.000Z",
          "Titre": "thompson neo10 notebook",
          "Contenu": "while the shipping speed was fine, i cant say much for the computer software, i found it to be rather limited. i use google alot but learn this computer doesnt offer it. also it seems to take forever to load. not my first choice of a computer, i prefer dell. but the price is reasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T08:24:55.000Z",
          "Titre": "Proper price point and fast delivery",
          "Contenu": "Proper price point and fast delivery. But you lost 1 star for another item listed for $100 more than everyday shelf price at Walmart. Kitchen aide mixer listed at $349 which has been $249 for over a year there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TIMOTHY CARTER",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:39:56.000Z",
          "Titre": "Ms Pac-Man",
          "Contenu": "If a full size arcade is what you after with an affordable price, then come here.My only reason for losing a star is delivery time.  I will definitely shop here again and already recommended it to two of my friends. I am harsh critic. So to recommend to someone else is my greatest compliment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T04:26:43.000Z",
          "Titre": "Hello",
          "Contenu": "Hello, I ordered the meta quest 3 for my sonnfornhis birthday. One of the remotes would not work. I returned it and im awaiting for the refund to clear, then I'm going to try to order another one and hope this one is better. The customer service was great in assisting me for the refund process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T17:27:18.000Z",
          "Titre": "Great company, wish they had price-matching",
          "Contenu": "The company is great and shipped my purchase fast but lose 1 star because I found a better price on the same item a few days later and they refused to honor it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alan Green",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T21:07:07.000Z",
          "Titre": "A Solid Shopping Experience",
          "Contenu": "E.E. offers easy and uncomplicated online shopping, although I do find their website a bit outdated and unintuitive when compared to larger national competitors. The delivery was on time and the driver was very courteous and helpful, but he really could have used a second set of hands on the truck in delivering such a large and heavy item. I assisted the driver in getting the item from the driveway into the house, but a retiree/elderly person's experience would have been quite different.The bottom line: I will always appreciate being able to order the exact item that I want from a local/regionally based business vs. Amazon, Best Buy, Lowe's/Home Depot, etc. I am very happy that we have Electronic Express here in the Nashville area."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Damper",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:10:24.000Z",
          "Titre": "Was quick and easy",
          "Contenu": "Was quick and easy. Only problem is shipping information and traceability. I reached out a couple of times to find out where my item was. Still haven't received it yet so can't say you guys are the best. Est. Delivery date Dec. 7th, it is the 8th today so as soon as I receive my items I can give 5 stars if everything is in order"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence korman",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:28:16.000Z",
          "Titre": "I ordered the washer and dryer before I…",
          "Contenu": "I ordered the washer and dryer before I realized the dryer door needed to be opened in the down position only frantically I tried calling it was Sunday I ordered them online so I went to the chat feature and explain my situation I received a reply that they can't change my order once it's in the pipe they can cancel it and then I can reorder and true to their word they did exactly that canceled my order and refunded my money I used Amazon pay and they're credited back to that Institution"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T02:34:25.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "Sales Person was knowledgable and helpful.  Our refigerator quit working and they could delive new one in 3 days which was fastest of 3 places that I went to purchase one.  The two men that delivered the Refrigerator were exceptional and very careful in taking the old one out (removing all handles on it) and taking front door off the hinges to avoid scraching it.  They were very careful bringing new one in and setting it up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:13:06.000Z",
          "Titre": "Great sales expertise",
          "Contenu": "Robert, the salesperson at EE did a great job helping me to decide which washer/dryer was best for meeting our needs. He took me through the purchasing process and made sure I had the warranty protection I needed. He also gave me rebate info that would refund me $100."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Voss",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T18:34:32.000Z",
          "Titre": "Great selection and prompt shipping for online orders",
          "Contenu": "My online order was shipped promptly and the ordering process was easy.  Giving 4 stars instead of 5 since I would have liked the option to have expedited shipping at additional cost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken Holloway",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T17:26:35.000Z",
          "Titre": "Dishwasher",
          "Contenu": "Employees at Electronic Express were helpful and friendly. Had to call installers back and the one that answered the home was also helpful and friendly,The installers were friendly as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meshika",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:36:40.000Z",
          "Titre": "The people were very friendly and…",
          "Contenu": "The people were very friendly and helpful. They made sure I had everything I needed and that my payments were affordable. They keep their store clean and neat including the restroom"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. Geoghegan",
          "Nb_Reviews": 6,
          "Date": "2023-09-15T13:24:17.000Z",
          "Titre": "Needed a fitness tracker watch asap",
          "Contenu": "My Charge 5 Fitbit died and I wanted to replace it. They are apparently backordered or out of stock everywhere and I needed one asap. Electronic Express had it, even though not my preferred color, so I ordered it.  It took about 5 days to arrive in PA, which is the reason for 4 stars instead of 5, but no complaints otherwise. I just hope this Fitbit lasts longer than the previous ones."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rachel",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T05:36:18.000Z",
          "Titre": "Good except for shipping",
          "Contenu": "First purchase at this site.  Overall it was a good experience, however I had issues with the shipping. I use a PO box for all my mail and packages. If PO box shipping is not allowed, a website will usually prevent the transaction.  This one did not. My package was shipped quickly but was held at my area UPS distribution center for days.  I kept checking the tracking, but it never moved.  There was no notification from UPS nor this retailer.  I finally contacted UPS and learned that my package couldn't go to my PO box, and I must make the 1 hour round trip to pick it up within the next 3 days.  This site should alert buyers to delivery options/problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TCL TV Buyer",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T15:09:10.000Z",
          "Titre": "Helpful Employee",
          "Contenu": "Someone offered to help as soon as I entered the store.  But not in an aggressive way, in a helpful way.  The store employee was able to answer any questions I had.  When I asked to walk throughout the store to take a look at everything they offered, he left me alone and allowed me to take my time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Britany",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T21:14:22.000Z",
          "Titre": "Zach is a great guy goes above and…",
          "Contenu": "Zach is a great guy goes above and beyond. We purchased a display item from him and received the wrong remote. Called and  spoke with him the following day about it. He not only had found the correct remote he also synced everything."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "C.A.",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T13:39:56.000Z",
          "Titre": "Would buy here again",
          "Contenu": "Good service, lots of product to look at in-store, and knowledgeable sales people. Follow up after the delivery and install was excellent. The only reason this isn’t five stars was that I was unable to get the refrigerator for five days. That was their earliest option for any in-stock item. If that had been 2-3 days, this would be 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Evans",
          "Nb_Reviews": 4,
          "Date": "2023-08-26T16:52:38.000Z",
          "Titre": "Store was small but well stocked",
          "Contenu": "Store was small but well stocked. The staff was engaged in a lively conversation with a customer when I arrived, but eventually one of the staff broke away from the conversation to help me find a TV. Told me it could connect wirelessly to my home WiFi and connect to Xfinity; it did quickly connect to WiFi but I was never able to get a wireless connection to my Xfinity account (had to use HDMI cable). This was due to my lack of knowledge in how to accomplish, but the salesman did not give me sufficient guidance. He did take the TV to the car and loaded it for me, which was appreciated. I will probably shop there again..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T15:16:45.000Z",
          "Titre": "Shipping box was a little smashed",
          "Contenu": "Shipping box was a little smashed, cant say this wasn't USPS fault or not but there was packing material on the inside and my items were not damaged. Everything else in dealing with this company was top notch though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Seely",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T14:24:09.000Z",
          "Titre": "Product OK",
          "Contenu": "Product OK.  Sales person great.   Need at least a few grocery type carts for people with disabilities to push and lean on while shopping.  Preferably. one or two electric handicap carts to use over the large floor space.   I personally cannot walk much and need a cart.  I have bought there a time or two but cannot manage walking to see any of your products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jorge Castro",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:31:16.000Z",
          "Titre": "The item took a little more time than I…",
          "Contenu": "The item took a little more time than I expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KEVIN WILLIAMS",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T12:07:49.000Z",
          "Titre": "Great Washer, but felt a little misled.",
          "Contenu": "I love my Speed Queen washer. The buying experience was excellent, except for one small issue. I bought from their Scratch & Dent store, & was told \"my washer had been refused on delivery b/c it was dented\". It turns out that wasn't the case. It had been a return during the 30 day return period, b/c the former customer had already registered the Serial #. I had to call SQ to get the Warranty switched over into my name. Not a deal breaker, as it was a good deal. However, it would have been nice to know the truth initially."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHAWN T",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T02:40:09.000Z",
          "Titre": "great customer service at the…",
          "Contenu": "great customer service at the store......delivery of stove and hook up of stove went well. delivery of laundry center (stacked washer dryer one unit) was great it had to be put in garage as we needed plumbing & electrical work done before install. Unit was not working, called for replacement, delivery center gave us run around, called store and they okayed new unit, delivery center still gave us run around we are currently waiting for new unit to be delivered tomorrow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geo",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T14:28:47.000Z",
          "Titre": "Overall Happy With My Purchase",
          "Contenu": "My packages arrived in a timely manner. One of the boxes of the megazords had some damage in a corner, but otherwise the contents were in great condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CT Wilson",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T04:14:39.000Z",
          "Titre": "Review",
          "Contenu": "Good transaction.  Wasn’t informed that Microsoft 365 that came with the laptop was a subscription until I got home.  I specifically told the clerk that I didn’t like/want any subscription software when pressed for an upscale for additional products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TucsonTerry",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T20:37:18.000Z",
          "Titre": "Almost 5 stars",
          "Contenu": "I was looking for 1 small and 1 medium cutting board to match the ones I already have. After a lot of searching, Electronic Express was the only place I found them. After I placed my order & received one board, I was disappointed when EE informed me that the other size was out of stock (I think it was discontinued). However, I am glad to have the 1 board. It arrived quickly, in good condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T17:27:25.000Z",
          "Titre": "Great service and payment plans. Need better TV displays",
          "Contenu": "We are returning customers.  We've been happy with all our purchases. My one complaint is the TV screens do not show the same background.  For example, I was deciding between an oled and qled. The tvs were not near each other and did not display the same background.  Potential customers need to see live TV Shows on the tvs. The display is deceiving. Most people do not watch in motion. TV color is different.   The oled seemed brighter. I told my husband why but he wanted the samsung oled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Toefield",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T14:52:53.000Z",
          "Titre": "The sales person that helped advise me…",
          "Contenu": "The sales person that helped advise me about my tv purchase was friendly and knowledgeable about the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RA",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:53:44.000Z",
          "Titre": "Fast delivery...took 6 days"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ERIC D JONES",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T23:19:46.000Z",
          "Titre": "Salesmen very friendly and honest",
          "Contenu": "Everyone we dealt with was very patient and worked with us to find the product that would work best for us. Any question they couldn’t answer they were honest with us about it and then they did everything they needed to do to get the correct answer for us. Honesty is very important for me when purchasing. We have purchased many things from Electronics Express in Oak Ridge over the past 5 years. We have been very pleased with all our purchases."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred Carmichael",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T05:17:08.000Z",
          "Titre": "Better than the first phone sales",
          "Contenu": "Better than the first phone sales. Oh! Wait! E.E. has no phone sales unless you want to wait several birthdays to talk to someone. I was hung up on 3 times. When on the computer, I was trying to order 1 item. Cart keep adding product to cart every time I started over. Suggest you put Decrease/ Increase cart on product page, in bold."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer S",
          "Nb_Reviews": 4,
          "Date": "2023-08-14T22:14:15.000Z",
          "Titre": "Got the item we needed",
          "Contenu": "We got the item we needed but not what we wanted. Online it advertised an open box item at the store but when we arrived we were told it was only available at the warehouse. We still had to wait for the item to be in store so why not send for the cheaper open box one rather than the same more expensive one. I was just hoping to save money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JASON WILSON",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T15:20:17.000Z",
          "Titre": "It took a few minutes to find someone…",
          "Contenu": "It took a few minutes to find someone in the store to help me with what I was looking for (which is unusual because you are usually pestered by 5 people before you can walk 20 feet in the store). Once I was able to locate someone (I believe the manager), he was honest, professional, and very knowledgeable of the product(s) I was looking at. The system I ended up purchasing worked exactly as the salesman said it would and I couldn't be happier with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PAUL LACROSSE",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T19:32:44.000Z",
          "Titre": "First time purchasing",
          "Contenu": "First time purchasing. Still haven’t gotten my order but we will see what happens when I get my order on Monday or Tuesday. My order is not late."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Felicia",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:57:07.000Z",
          "Titre": "The knowledge that the sales lady had…",
          "Contenu": "The knowledge that the sales lady had the fact that the refrigerator was in stock. The delivery guys were efficient and polite."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BELINDA PALA",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T16:46:27.000Z",
          "Titre": "Helpful sales person",
          "Contenu": "Our sales person was very helpful. She responded quickly to texts. I was disappointed that when the range arrived you no longer had a tech who knew how to install a downdraft range leaving us to figure it out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ring Neighbor",
          "Nb_Reviews": 3,
          "Date": "2023-07-23T12:35:18.000Z",
          "Titre": "Excellent smalls person",
          "Contenu": "Excellent smalls person. He said that the delivery person could hook my ice maker up. I explained to the Salesman how my previous refrigerator was connected under my sink. The salesman explained that The Delivery person could connect it . The delivery person was not able to do it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deneen",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T00:16:33.000Z",
          "Titre": "Great salesmen",
          "Contenu": "First and foremost, I  would give a five for the outstanding customer service I received on the purchase of my new refrigerator. I had had a terrible experience with a local big box store and  was not happy with the thoughts of working with another However, Tony and the store manager worked diligently to advise me on my purchase. The only reason for the 4 star rating was due to the delivery personnel not contacting me the day prior giving me an appropriate time of delivery and lack of notification 30 minutes prior to arrival. It all worked itself out but the company needs to be aware that processes and procedures were not followed in this area. At any rate, I am sold on Electronic Express and will return for future needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deanna",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T14:51:11.000Z",
          "Titre": "Pat was an very good in helping make a…",
          "Contenu": "Pat was an very good in helping make a decision.  The delivery guys were nice but they did not take any of the stickers or packing off the fridge.  Don't know if that is an EE policy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Mattson",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T18:07:01.000Z",
          "Titre": "My experience with \"you\" was fine",
          "Contenu": "My experience with \"you\" was fine, it's the system that failed me. I wanted a music receiver not what I got. I will keep it as a reminder to never order online again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T15:34:21.000Z",
          "Titre": "Delivery was great",
          "Contenu": "Delivery was great. The refrigerator works fine. Temperature gauge is a little off, otherwise it would be 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelsey",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T15:22:20.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Customer Service was by far 5 stars. They were super helpful and friendly. It seemed no matter how difficult I made a task they still willing to help and make everything right. I gave 4 stars because I was using my synchrony card to make a purchase and purchasing online was a little difficult. So I feel the communication with synchrony needs fixed. However, they helped my situation and I was able to make my purchase online. I do want to give a shout out to JD P. for going beyond to help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marjorie",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T15:30:12.000Z",
          "Titre": "The young man that waited on me was…",
          "Contenu": "The young man that waited on me was helpful. However, instead of telling me that security software is free on the computer he Ave me a sales pitch to sell me a program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anita B",
          "Nb_Reviews": 1,
          "Date": "2021-05-08T21:14:18.000Z",
          "Titre": "Excellent  TV",
          "Contenu": "Review is only for the amazing product.This is the 4th 50\" Class- H8G Quantum 4K ULED Android Smart TV we've purchased. Shipped one overseas to my Mom, for my daughter's bedroom, for my lil sis as a housewarming gift and one for me. Customer service is horrible. No one was able to help me  rectify the issue in order to place another order. Agent stated that the owner of the company is the only that will be able to help, but unfortunately he is out of the country.Will take my business else where then. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hannah",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T15:20:06.000Z",
          "Titre": "The appliance manager was very helpful…",
          "Contenu": "The appliance manager was very helpful and patient throughout the process. I really enjoyed the process, and would 100% do business with him again. However, after spending several thousand dollars I think delivery should be free/discounted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Love it",
          "Nb_Reviews": 5,
          "Date": "2023-06-16T02:43:27.000Z",
          "Titre": "I am happy to say that Electronics… still had a match to my Samsung kitchen appliances.",
          "Contenu": "I am happy to say that Electronics Express in NASHVILLE,TN at the 100 Oaks mall had exactly the same model that I had before my  old microwave appliance stopped workin by Samsung that matches my other kitchen appliances. They had one demo floor model left discontinued product that I purchased at a disconnected price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T01:33:55.000Z",
          "Titre": "We were looking at TV’s. They have a large selection of various brands and sizes. The employees were knowledgeable and helpful as we made our decision. We bought two TVs and we are happy.",
          "Contenu": "Good experience at this store."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Rabb",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T13:53:37.000Z",
          "Titre": "Had what I wanted in stock.",
          "Contenu": "Had what I wanted in stock.Staff did not offer installation service in the same week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Carlos G",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T22:45:53.000Z",
          "Titre": "Overall the experience was okay in that…",
          "Contenu": "Overall the experience was okay in that I received the order quicker than I thought that I would.  However, there was no literature whatsoever with the tablet that I ordered.  It included no instructions on getting started or operation of the device."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L Martin",
          "Nb_Reviews": 4,
          "Date": "2023-06-26T17:18:38.000Z",
          "Titre": "The tv arrived in good condition",
          "Contenu": "The tv arrived in good condition. Minus one star for not getting a phone call before delivery (they said someone would call) but luckily I was home to sign."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:22:47.000Z",
          "Titre": "a little skimpy on the packaging",
          "Contenu": "a little skimpy on the packaging, but good price and quick shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "john webb",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T11:53:50.000Z",
          "Titre": "Great pricing",
          "Contenu": "Great pricing,  questions answered some disparity between manufacturer and EE sales on warranty"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T18:04:06.000Z",
          "Titre": "Manager of the Hamilton Place store was…",
          "Contenu": "Manager of the Hamilton Place store was extremely helpful,knowledgeable regarding Samsung qled tv’s. I had a positive experience and will purchase from this store again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHARISSE BAUER",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T01:16:24.000Z",
          "Titre": "Oh I do like dealing with this company",
          "Contenu": "Oh I do like dealing with this company.  I don’t know, I either misread or it was difficult to read when I ordered a case & it said iPad5 instead of iPadS…I had already torn the box up assuming it would work. I’m sure this company would’ve been fine to return it to… I just chose not to. Too busy.  Cases are hard to buy online.  I’ll have to find it another home.I will continue to buy things online from this company.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rene",
          "Nb_Reviews": 1,
          "Date": "2021-02-28T13:37:59.000Z",
          "Titre": "Delivery was very slooooow.",
          "Contenu": "Delivery was very slooooow. This might’ve been FedEx’s fault. Can’t talk to a live person on the phone but chat feature was very useful. They even emailed a transcript of the chat. The 55in tv I bought came well packed. The original box came wrapped in bubble wrap inside another box. Would’ve given 5 stars if it wasn’t for the delivery and lack of a live customer service to speak to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MICHAEL SAWICKI",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T18:08:16.000Z",
          "Titre": "Other than receiving an incorrect order…",
          "Contenu": "Other than receiving an incorrect order for a remote control(which I decided to keep) the service has been   very good.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Zook",
          "Nb_Reviews": 3,
          "Date": "2021-02-26T13:10:28.000Z",
          "Titre": "Order on line at your own risk",
          "Contenu": "I ordered the watch for pick up in the store do to leaving the country 3 days later. When I went to the store to pick it up they didn't have the communication for it. I checked my email, as directed by the sales clerk, and they had shipped it based on the communication. I did contact them and tell them it was not to have been shipped but a pickup but they never replied until 4 days later.. Ibordered it Friday morning, I left Monday and it arrived Wednesday a full 5 days after my order was placed. So I will pay triple shipping. Once for Electronic express, once to mail to MBE Miami, and once from Miami to Panama. I am not a happy camper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RODNEY LEACH",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T05:10:33.000Z",
          "Titre": "My sales person Danyel was very…",
          "Contenu": "My sales person Danyel was very knowledgeable about the products carried by the store and was most helpful in making my choice of what I needed to purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JERRY HILAND",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:03:44.000Z",
          "Titre": "Buying the fridge for our home was…",
          "Contenu": "Buying the fridge for our home was great! The salesman did a wonderful job explaining everything and really made sure we were happy. The Delivery needs work, lots of work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E.J. Craig",
          "Nb_Reviews": 2,
          "Date": "2021-03-19T18:12:04.000Z",
          "Titre": "The fidget spinners are great and will…",
          "Contenu": "The fidget spinners are great and will be used for a custom pinball project I'm building. They are not just excellent finger toys they are great for arts and crafts as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J E",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T14:34:10.000Z",
          "Titre": "Ice maker",
          "Contenu": "I ordered an ice maker which I received quickly but there were no instructions on how to install it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherry Watkins",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:04:59.000Z",
          "Titre": "Good knowledgeable sales person"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miguel",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T03:33:26.000Z",
          "Titre": "Always good useful information",
          "Contenu": "I get very personable service and advice, which helps me decide what to buy.  There is no pressure to buy anything.  I like that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ZACH CARLENE",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:55:40.000Z",
          "Titre": "The sales associate was extremely…",
          "Contenu": "The sales associate was extremely knowledgeable regarding Refrigeration company's and who was the best for the money. We financed easily and delivery was timely. The sales reps were really nice and sociable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chelsea",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T20:58:18.000Z",
          "Titre": "The sales man was great!",
          "Contenu": "The sales man was great!! Very helpful and knowledgeable.  Only reason I didn’t give 5 stars. When they came to deliver they left a muddy red mess behind!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T11:51:57.000Z",
          "Titre": "Great customer service.",
          "Contenu": "Great customer service.I gave them one star since I bought a new product and it came in terrible shape with no packing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori White",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T22:31:28.000Z",
          "Titre": "The associates were very helpful",
          "Contenu": "The associates were very helpful, informative and polite. The sale prices were very reasonable. My only problem would be charging for delivery or installation after spending that much money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terrence",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T14:42:35.000Z",
          "Titre": "Salesperson was helpful and my…",
          "Contenu": "Salesperson was helpful and my appliances were delivered on time and installed correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Stefancin",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T14:57:37.000Z",
          "Titre": "Was fast",
          "Contenu": "Packaging was banged up inside box but it came ok"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darrell",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T12:59:11.000Z",
          "Titre": "Good company delivered very quickly …",
          "Contenu": "Good company delivered very quickly  Good product PC i bought working well I highly recommend them above Amazon and others"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-11T14:10:10.000Z",
          "Titre": "All is good",
          "Contenu": "All is good. Items received and appear to be working. Only negative is the time to receive the order, which came in 4 days after the projected date. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "THOMAS STRUAN",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T15:20:15.000Z",
          "Titre": "good experience",
          "Contenu": "I think this was a good experience for us.  By and large everything was exactly as it was explained in the store and the process was fairly easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T15:36:32.000Z",
          "Titre": "Good service Low inventory",
          "Contenu": "I would have rated this with five stars except for the lack of available product. Very happy with the TV we purchased but it's not the one we wanted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VICTOR WATFORD",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:50:51.000Z",
          "Titre": "Helpful and friendly staff",
          "Contenu": "Helpful and friendly staff, reasonable prices. Only issue was the sales clerk said my Gen 10 iPad had the M1 chip. He was wrong, but I am happy with the iPad anyway. It does everything I need it to do and does it well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:03:48.000Z",
          "Titre": "Overall good service",
          "Contenu": "Overall good service! A small problem with the ice machine hookup."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori White",
          "Nb_Reviews": 3,
          "Date": "2023-06-10T14:15:43.000Z",
          "Titre": "Loving my new  Maytag  washer and…",
          "Contenu": "Loving my new  Maytag  washer and dryer.  Every one  was nice and  polite.  My  only problem was the dryer was making a noise when the turned it on and had to take it back. They brought the new one 4 days later.  All  is good.  Thank you.  Lori"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Werling",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T03:59:18.000Z",
          "Titre": "Love love love it",
          "Contenu": "Love love love itGreat delivery, great service Hooked up stereo to Bluetooth, best day of my life!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MORDECHAI SIMONOWITS",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T23:04:00.000Z",
          "Titre": "the air conditioner arrived in time",
          "Contenu": "the air conditioner arrived in time. it works well. just one concern, it came with a dent in one corner"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EDDIE SUTTLES",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T15:52:43.000Z",
          "Titre": "Salesman was very knowledgeable",
          "Contenu": "Salesman was very knowledgeable, very helpful. Ordering the bases for washer and dryer was extremely slow and communication between store and customer a problem.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2021-03-10T13:40:43.000Z",
          "Titre": "So far, so good.",
          "Contenu": "Item came as described. Shipping was very fast. First time ordering. Will order again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID BOYD",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T03:22:03.000Z",
          "Titre": "Had an issue with a mounting bracket…",
          "Contenu": "Had an issue with a mounting bracket they were quick to fix the issue"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARCIA FLOYD",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T14:08:38.000Z",
          "Titre": "Not the right size",
          "Contenu": "Everything was good except that I ordered a 43 inch tv and received a 38 inch tv.. I should not have to pay for the 5 inches I’m missing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOYCE DOTSON",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T16:38:09.000Z",
          "Titre": "Items was delivered in a very quick…",
          "Contenu": "Items was delivered in a very quick time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JACK LEAVER",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T01:29:35.000Z",
          "Titre": "The salespeople",
          "Contenu": "The salespeople, help me find the right HDMI cable that will work with my new set. Make sure that my delivery was on time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T14:24:27.000Z",
          "Titre": "Delivery didn't take long",
          "Contenu": "Delivery didn't take long , everything was well organized and tracking was nice,  honestly all went well except for one issue the actual box of my Console was ripped pretty good maybe if possible you can packaged customers items better so that the actual product box doesn't rip."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Santos",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T18:41:25.000Z",
          "Titre": "The delivery guys were great and very…",
          "Contenu": "The delivery guys were great and very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Dortch",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T13:42:29.000Z",
          "Titre": "Best price",
          "Contenu": "Best price. Bulova website indicates that they won't honor the warranty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. Mecca",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T02:03:14.000Z",
          "Titre": "A little wait for my order.",
          "Contenu": "It took a while for the product to be shipped but is working fine for an open box buy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID PHARR",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T04:59:08.000Z",
          "Titre": "Had the product I was looking for and…",
          "Contenu": "Had the product I was looking for and good customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helen Molos",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T14:06:02.000Z",
          "Titre": "Will not let me program my roku…",
          "Contenu": "Will not let me program my roku controller"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Wilkerson",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T23:24:03.000Z",
          "Titre": "Good deal blah blah",
          "Contenu": "Good deal blah blah. Excellent service blah blah. Oh very useful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer  Yves",
          "Nb_Reviews": 2,
          "Date": "2021-05-03T11:59:08.000Z",
          "Titre": "computer",
          "Contenu": "The computer I ordered was not what I expected and returned it. I was able to return it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Farrell",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T00:46:07.000Z",
          "Titre": "Was helped right away",
          "Contenu": "Was helped right away. Showed me a cheaper model."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Castle energy group",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T13:30:11.000Z",
          "Titre": "They're fast and helpful  good business…",
          "Contenu": "They're fast and helpful  good business people"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:04:46.000Z",
          "Titre": "SS REVIEW",
          "Contenu": "A little pricy, but they have good stuff for sale"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "INEZ POINTER",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T21:30:32.000Z",
          "Titre": "The service was  Great but when itt was…",
          "Contenu": "The service was  Great but when itt was delivered I saw that there was damage on the outside it showed it to the delivery person and he took a picture of it and said that they would deduct it  then I signed the tablet  then later I got a call from someone and they asked about the delivery so I told them about the damage and they asked me to take a picture and send it too them and I did then they sent me a picture we’re I had signed the tablet also they did not put a new water line like they said they would have too when I purchased the refrigerator  so the deliver person said that it also would be deducted i still like my purchase"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 5,
          "Date": "2023-06-02T01:58:23.000Z",
          "Titre": "Good camera",
          "Contenu": "Good camera.  great price Clip designed for laptop and won’t fit on PC"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Way Watcher",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T21:25:05.000Z",
          "Titre": "For the price it is a good entry to…",
          "Contenu": "For the price it is a good entry to projectors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:36:03.000Z",
          "Titre": "Great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Danny Baker",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T15:55:16.000Z",
          "Titre": "Friendly and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mark puente",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:13:55.000Z",
          "Titre": "Found the product for very couldn’t believe how cheap I got the product cheap",
          "Contenu": "Found the product for very cheap. Ordered it without really thinking is this a legit website called the customer service had a great experience. They sent me information on tracking got it. Exactly 4 days later. Very prompt. Quick service. Just an amazing experience. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joliet_Jake",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T11:27:23.000Z",
          "Titre": "Electronic Express Online Ordering",
          "Contenu": "Ordered a replacement kitchen TV online from EE. The online viewing & ordering process was straightforward and notification was immediate. Received tracking info the next day with the arrival as expected & w/o issue. The OEMs TV box was inside another shipping box with a thick bubble wrap layer for protection. The box arrived clean & w/o any damage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz  Mills",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:16:32.000Z",
          "Titre": "I just called up and I'm given the part…",
          "Contenu": "I just called up and I'm given the part number and you found it and shipped it that day and I got it way before I even thought I wouldn't threw the mail"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D.S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:17:49.000Z",
          "Titre": "Not just electronics...",
          "Contenu": "The company shipped super fast and the item that I wanted was at the right price!  I would shop through them again.  I was initially skeptical since I bought a kitchen accessory from a merchant named, \"Electronic Express\", but everything turned out great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:26:36.000Z",
          "Titre": "Great for out of state buyers",
          "Contenu": "Fast free shipping and, best of all, no sales tax on out of state purchases. Couldn't ask for anything better. I got my order in under a week. If I need other small electronics, I'll shop at Electronic Express first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Climo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:02:08.000Z",
          "Titre": "Ordered on a Monday afternoon",
          "Contenu": "Ordered on a Monday afternoon, received my purchase on Thursday, so fast, so excited, you could not have put a toothpick in the box it was wrapped so tight so my purchase would not get damaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard B",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:52:19.000Z",
          "Titre": "The prices are phenomenal!",
          "Contenu": "The prices are phenomenal!! Shipping is quick and everyone I have dealt with has been great. I've started shopping here instead of Amazon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki Simpson",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T13:28:14.000Z",
          "Titre": "I excellent experience!will definitely order from this…",
          "Contenu": "I will definitely order from this company again. Everything was great from my ordering to delivery!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:52:30.000Z",
          "Titre": "Great!",
          "Contenu": "As described. Super fast shipping. Packed really well. My husband was impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "debg",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T18:42:29.000Z",
          "Titre": "Easy installation",
          "Contenu": "Excellent, quick and helpful answers from customer service.  Fast shipping even through the holidays!  Our accountant son enjoys tackling his own home maintenence projects.  He had no problem with the installation in replacing this garbage disposal.  The instructions were easy as advertised.  He was able to use the cord from the same old model that I had jammed and broke. When it leaked right after the first test run, he discovered he had not installed the gasket properly. That was his only fail.  I will definitely check this company again when I need items in the future!  Thank you Electronic Express!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Blyth",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:24:51.000Z",
          "Titre": "First time use",
          "Contenu": "Fast shipping, package was oddly well cared for in transit, item was found in the clearance section and was priced reasonably."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CB",
          "Nb_Reviews": 6,
          "Date": "2023-12-09T02:44:07.000Z",
          "Titre": "Satisfied Customer",
          "Contenu": "Delivered sooner than expected. Very pleased with Visio TV and new HP laptop. Arrived in great condition easy assembly for a senior 70 years young. While placing the order I chatted with rep and was very pleased with their professionalism. I would recommend to do business with them. Very satisfied customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Autumn",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T21:17:10.000Z",
          "Titre": "Great Item Selection!",
          "Contenu": "I ordered the Warmies reindeer. The plush is weighted, very soft, and has a lovely but not overwhelming lavender scent. In a way, the smell reminds me of jasmine which I really like. Electronic Express shipped quickly and carefully! I was emailed promptly regarding my order confirmation and then for my Shipping ID."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T07:48:01.000Z",
          "Titre": "Great Start to Finish Transaction",
          "Contenu": "Great pricing. Quick processing and out the door for shipping in a timely manner. I recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Skye",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:08:48.000Z",
          "Titre": "reliable & fast",
          "Contenu": "fast shipping, trustworthy! this is a genuine review I swear lol! ordered a warm plush from here since the warmie website has a lot sold out and my package came in good condition!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wanda",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:16:51.000Z",
          "Titre": "Very Dependable!",
          "Contenu": "The technician came out as scheduled and repaired the oven. They were professional and knowledgeable concerning their work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doris W Wade",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:36:31.000Z",
          "Titre": "Everyone there was very professional",
          "Contenu": "Everyone there was very professional, knowledgeable and friendly. Helped us with our return and helped us find the right TV for us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Tweedy",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T14:46:46.000Z",
          "Titre": "Simple and headache free .   Fast shipping",
          "Contenu": "Easy and fast service .  Packages arrived safely and boxed well .    Would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T21:12:09.000Z",
          "Titre": "I bought my son a new gaming computer…",
          "Contenu": "I bought my son a new gaming computer for Christmas and he received it in two days! I had a question prior to ordering and the sales representative was very helpful!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lillibird",
          "Nb_Reviews": 13,
          "Date": "2023-12-19T16:48:27.000Z",
          "Titre": "Excellent service and products",
          "Contenu": "As always I received excellent customer service and they have all of the top products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah C",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:51:53.000Z",
          "Titre": "Would shop here again",
          "Contenu": "Decent price, shipped out quick, provided tracking, arrived in only a plastic shipping bag with some slight cosmetic damage to product box. Product inside was in new, unopened condition. Other than improving the preparation/packing for shipping, no complaints; would definitely shop with EE again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "eric",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T13:21:05.000Z",
          "Titre": "Big shout out to these guys",
          "Contenu": "Big shout out to these guys. Ordered online and got a shipping confirmation the next day. Item arrived shortly thereafter as described and in perfect condition. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Fuqua",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:14:56.000Z",
          "Titre": "PRODUCT WAS DELIEVRED IN A TIMELY…",
          "Contenu": "PRODUCT WAS DELIEVRED IN A TIMELY MANNER. DELIVERY CREW WAS KIND AND PROFESSIONAL. PHONE PERSONEL WAS PROFICENT AS WELL."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jk",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T18:33:13.000Z",
          "Titre": "Awesome customer service!",
          "Contenu": "I purchased a 65” Bravia tv from Amazon by way of Walt’s tv, big mistake! Tv came to the house cracked, Amazon said I needed to go through Walt’s for replacement or refund, Walt’s said I had to take the boxed up tv to FedEx drop off? I guess to dollar general??? Anyways I called FedEx and they came and picked up! It took 2 weeks for them to get it and credit back my financing! Meantime I went to electronic express website and ordered another one, it was $100 dollars more, but the other one was on sale for prime days, it came in a couple days in perfect condition! I love this tv and electronic express because, I called customer service within the 30 days to buy the warranty and they told me it was on sale for $200 less, so warranty was $100 less and, and, and they credited my financing $200 within minutes of the end of our call!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T14:40:39.000Z",
          "Titre": "Excellent service",
          "Contenu": "Christian and his partner were very quick, professional, and efficient with their time and movements. They did an outstanding job if delivering my items. And the support from EE was top notched. You guys informed me about the delivery date and time on multiple days. This helped us to prepare for you coming."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Tierno",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:09:33.000Z",
          "Titre": "Best price found plus easy purchase and…",
          "Contenu": "Best price found plus easy purchase and very fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Vaught",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:02:38.000Z",
          "Titre": "I haven't had too many stores that…",
          "Contenu": "I haven't had too many stores that delivers quickly especially at Christmas time. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Pigeon",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T06:44:06.000Z",
          "Titre": "Super fast shipping",
          "Contenu": "Super fast shipping! Can’t wait for my boys to get their laptops for Xmas! They are going to be so excited!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "QueenV",
          "Nb_Reviews": 5,
          "Date": "2023-12-04T03:14:55.000Z",
          "Titre": "Great prices...",
          "Contenu": "Electronic Express had the best prices on the items I was looking for. My order went smoothly and arrived quickly. I would definitely recommend them to anyone and will be shopping here again myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Utkarsh",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T15:22:24.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "The customer service and their support for resolving an issue I had with my online purchase of an OLED TV from them was amazing.They went above and beyond in their redress and I was actually pleasantly surprised with their resolution.This might just be my new favorite store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BRIAN",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T18:16:58.000Z",
          "Titre": "Great Experienced",
          "Contenu": "Had been looking for a new computer and stopped into  Electronic Express because of previous helpful and positive experiences with their employees. I went back after several weeks for black Friday sales.  The salesman (Anthony) remembered me from my previous visit.  He again was very helpful and knowledgeable and helped me with decision. Very Happy with the new computer and service at Electronic Express."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crossroads Ministry, Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:07:20.000Z",
          "Titre": "The manager and assistant were knowledgeable and friendly.",
          "Contenu": "The manager and assistant were very helpful in helping me find the size of refrigerator we needed.  They made me feel welcome and knew the product immediately when I mentioned the size we needed.In the immediate future we will be needing four more of the same size and layer on another four.  We will definitely return."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:15:15.000Z",
          "Titre": "Great experience",
          "Contenu": "Easy purchase, fast, friendly, efficient installation. Overall a great experience and I will be a repeat customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Hodges",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:00:12.000Z",
          "Titre": "The customer support!",
          "Contenu": "The customer support.. They were really great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:35:28.000Z",
          "Titre": "Good sale price on item",
          "Contenu": "Good sale price on item. Delivery was reasonably fast. Would buy again from this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vicki Krantz",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:04:57.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! I ordered very small item but they sent it out right away and shipping was free which was really nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cecil Landers",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:45:02.000Z",
          "Titre": "Electric knife",
          "Contenu": "Service,  product quality and price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Mentzer",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T14:52:44.000Z",
          "Titre": "There prices are amazing",
          "Contenu": "There prices are amazing! There shipping is so fast. This is my experience with them and I’m not disappointed. I highly recommend them to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moises Morales",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T15:30:59.000Z",
          "Titre": "Good I will recommend.",
          "Contenu": "Product came in good condition. Also shipping was fast. I wish it was free but also the product I bought was cheaper than anywhere else even including shipping so I am definitely not gonna complain. Good service and kept me inform on the process from shipping to delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:56:49.000Z",
          "Titre": "impressed",
          "Contenu": "I was so impressed by the sale price of my Singer Sewing mannequin and it arrived within 2 days of my purchase for free!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristopher Hubbard",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:48:12.000Z",
          "Titre": "My order came pretty quick and when I…",
          "Contenu": "My order came pretty quick and when I thought I didn't receive all my order they had got back to me in no time and the  rest came the next day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TIM TIDWELL",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:28:50.000Z",
          "Titre": "Basically we ordered online and they…",
          "Contenu": "Basically we ordered online and they delivered items not broken. No real customer service just the products were as advertised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:58:32.000Z",
          "Titre": "Excellent customer service on the part…",
          "Contenu": "Excellent customer service on the part of the 2 salesmen that worked with me. Delivery of the appliances happened when EE said it would. I have one more appliance to buy & I will definitely go back to Electronic Express!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly Carter",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T09:57:51.000Z",
          "Titre": "Very professional and kind go out of…",
          "Contenu": "Very professional and kind go out of there way to do for you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DENNIS LATHERS",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T01:16:30.000Z",
          "Titre": "I started buying from Electronic…",
          "Contenu": "I started buying from Electronic Express several years ago.  I live in Louisiana.  Electronic Express has reasonable prices and the customer service is great when I've had to use it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda Caudill",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T15:28:56.000Z",
          "Titre": "I needed a basic dryer",
          "Contenu": "I needed a basic dryer . The salesperson helped me find one that fit my needs and didn’t pressure me at all. Then the delivery team came when we were available and were super efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Roskowski",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:57:00.000Z",
          "Titre": "Order arrived quickly and as described",
          "Contenu": "Order arrived quickly and as described. Great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:06:49.000Z",
          "Titre": "Sales person",
          "Contenu": "I believe the young lady who waited on me was Makayla (not sure if spelled correctly).  She seemed very knowledgeable, was very polite and friendly.  I was very impressed with her and the whole purchasing process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NYM1969",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T15:04:35.000Z",
          "Titre": "Excellent seller",
          "Contenu": "Excellent seller. Item was accurately described and arrived on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeanne Aldridge",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T03:17:08.000Z",
          "Titre": "This was my 1st time using EE",
          "Contenu": "This was my 1st time using EE. I had so many questions and each day before delivery of my nice Westinghouse TV, I was helped via E-mail by the wonderful people at EE. Never have I had such fast and friendly service. Everything went as planned and I had my TV within just several days of order. Thank you so much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Travis",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T16:57:38.000Z",
          "Titre": "Knowledgeable with Great Customer Service",
          "Contenu": "Jeremy in appliances and the Store manager Tyreek were great to work with. Jeremey was very helpful and knowledgeable and Tyreek went above and beyond to help me with an issue after I had purchased a washer and dryer. Highly recommend this store for Electronics purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Teubner",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:36:37.000Z",
          "Titre": "The product arrived undamaged and in a…",
          "Contenu": "The product arrived undamaged and in a timely fashion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:01:54.000Z",
          "Titre": "Had purchased the same things from…",
          "Contenu": "Had purchased the same things from another Big Box store only to be rescheduled four times !! Electronic Express was less expensive and delivered when they said they would. I'll be back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T14:38:56.000Z",
          "Titre": "I love electronic express because they…",
          "Contenu": "I love electronic express because they truly do have the cheapest prices on the same items . I live in Clarksville and I always , and I do mean ALWAYS receive excellent customer service at the Wilma Rudolph site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:01:58.000Z",
          "Titre": "Our Samsung has the perfect picture",
          "Contenu": "Our Samsung has the perfect picture! It was delivered on time and set up by your courteous staff!! They were a delight to deal with!! Thank you!!! The manager in the store was very very helpful in my selecting the Samsung!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Mccleskey",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:24:54.000Z",
          "Titre": "Love this company fast and easy",
          "Contenu": "Love this company fast and easy. Games are A1. I would recommend them to everyone thank you so so much Christmas gone be a 💥"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T16:59:48.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Matthew was one of the best CSR I've ever encountered. I am new to the area and he even gave me valuable information about the area. I still feel the price was too high, but I did get a quality product. So far, I love everything about it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:09:37.000Z",
          "Titre": "Salesman was very knowledgeable on…",
          "Contenu": "Salesman was very knowledgeable on appliances and prices with rebates were pretty good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrice Howard",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T16:31:55.000Z",
          "Titre": "Website easy to navigate",
          "Contenu": "Website easy to navigate.  Checkout was simple.  Good selection.  Shipping was quick after purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Whitehead",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:05:59.000Z",
          "Titre": "Fast delivery and great product.",
          "Contenu": "Fast delivery, great product, exactly as described in ad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Porter",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T01:59:12.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices and communications. Will shop from again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CALVIN HOLMES JR",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:26:45.000Z",
          "Titre": "I was satisfied with order and delivery…",
          "Contenu": "I was satisfied with order and delivery .Also  I had to be home for signature which was inconvenient but  it was to make sure I received it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Fistel",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T22:29:17.000Z",
          "Titre": "In stock and shipped next day for free",
          "Contenu": "In stock and shipped next day for free.  Also best price I could find."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Dugan",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:27:37.000Z",
          "Titre": "The price was the cheapest I could find…",
          "Contenu": "The price was the cheapest I could find and it is a great  product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christy Shade-Verstreate",
          "Nb_Reviews": 6,
          "Date": "2023-12-11T17:18:22.000Z",
          "Titre": "Excellent shipping",
          "Contenu": "I received my item in about 2 days and it was as stated on the site. I couldn't be more happy with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:59:05.000Z",
          "Titre": "From the salesman to the delivery…",
          "Contenu": "From the salesman to the delivery everything went smoothly!  Everyone was helpful and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T23:18:51.000Z",
          "Titre": "The employees at the Jackson Tn store…",
          "Contenu": "The employees at the Jackson Tn store are top notch! Seth helped us and explained everything in great detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:33:54.000Z",
          "Titre": "Exceeded expectations",
          "Contenu": "We ordered a microwave that came damaged. The manager immediately took charge and had a new one delivered from the warehouse in a matter of a day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virgil Young",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T19:11:00.000Z",
          "Titre": "They are very helpful and very…",
          "Contenu": "They are very helpful and very impressed with their service and they have a great communication with you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:37:36.000Z",
          "Titre": "Sunni was most helpful including making…",
          "Contenu": "Sunni was most helpful including making an order for the Onkyo AV.  Will continue to shop at this location and with Sunni, the store manager."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:09:06.000Z",
          "Titre": "Great employees",
          "Contenu": "The employees were great helping and answering questions. They helped us find a good laptop"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALICE KINNEAR",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T06:44:35.000Z",
          "Titre": "Christmas gift",
          "Contenu": "it was easy to purchase this item. it is a Christmas gift."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T18:11:26.000Z",
          "Titre": "HELPFUL AND FRIENDLY SERVICE",
          "Contenu": "I received attention and help as soon as I walked in the door!  Very friendly and kind. When I returned to pick up my merchandise they quickly loaded it in my car for me! Great customer service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Minnick",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T19:46:16.000Z",
          "Titre": "Returned an item",
          "Contenu": "Ordered an item. It was defective. Easy return. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evil Genius",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:10:42.000Z",
          "Titre": "Got what I ordered earlier than…",
          "Contenu": "Got what I ordered earlier than expected. It was well packed and in person condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Benites",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:31:52.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service. Ordered a PlayStation 5 online to be shipped to California. Fast UPS shipping within 5 business days, exact product, arrived in excellent condition. Overall great experience/company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:19:49.000Z",
          "Titre": "Better than Best Buy",
          "Contenu": "Love the staff and the prices at Electronic Express.  Everyone is very helpful and there’s a great selection to chose from on TVs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Oglesby",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:06:14.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, smooth transaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R.Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T06:05:20.000Z",
          "Titre": "Fast Shipping…",
          "Contenu": "The Prices and just the Fast Shipping is Amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katrina",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:39:47.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, shipped nicely. Recieved it on time. Great place to buy from"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:00:14.000Z",
          "Titre": "Wonderful associates who are willing to…",
          "Contenu": "Wonderful associates who are willing to go above and beyond to help each and every customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 8,
          "Date": "2023-12-12T18:34:48.000Z",
          "Titre": "They had the product I was looking for…",
          "Contenu": "They had the product I was looking for and at a great price. Delivery was time was great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:44:00.000Z",
          "Titre": "Great customer service and shipping",
          "Contenu": "Great customer service and shipping, my product came in undamaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny B",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T15:58:14.000Z",
          "Titre": "Everything when great",
          "Contenu": "Everything when great. Product received was as expected. Shipping was fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Benda",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T01:46:02.000Z",
          "Titre": "Best purchase",
          "Contenu": "Fast response and shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Dieffenbach",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T03:53:05.000Z",
          "Titre": "Great Experience",
          "Contenu": "Was what it was advertised as and came quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T17:35:52.000Z",
          "Titre": "Needed a phone for a landline in new…",
          "Contenu": "Needed a phone for a landline in new residence.  The item was available and the salesperson was helpful.  I will return as a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle R.",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T09:16:32.000Z",
          "Titre": "Online ordering was easy",
          "Contenu": "Online ordering was easy! System arrived in 3 days! Great payment plans"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T03:01:45.000Z",
          "Titre": "Review of store",
          "Contenu": "Nice verity of products with great prices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doris Morgan",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T03:22:35.000Z",
          "Titre": "The guy that helped us was so friendly…",
          "Contenu": "The guy that helped us was so friendly and show us all about the TV we were looking at"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Simon",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T19:32:59.000Z",
          "Titre": "Everything",
          "Contenu": "Everything.  From our Salesman to the installers.  Everything was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T14:01:04.000Z",
          "Titre": "Great install team",
          "Contenu": "Great install team. Polite and fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Lamb",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T13:34:15.000Z",
          "Titre": "Good product fast transparent shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:17:56.000Z",
          "Titre": "The sales person Charles was great",
          "Contenu": "The sales person Charles was great, very helpful and customer aware, he did a super job with finding and selling me my new gas range, I had went to two other big box stores and they could have cared less if they sold me a range, thanks Charles and electronic express"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eloise Pate",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T16:52:25.000Z",
          "Titre": "The salesman was very knowledeable and",
          "Contenu": "The salesman was very knowledeable andand helped me to make a decision to buy allLG appliances that day, which I am veryhappy with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lamar",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:38:28.000Z",
          "Titre": "Great job from everyone who helped us…",
          "Contenu": "Great job from everyone who helped us with our purchase of major appliances, especially Patrick (sales, Hixson store), and Henry and Christian (flawless delivery)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T19:31:51.000Z",
          "Titre": "Helpful service and knowledge of the…",
          "Contenu": "Helpful service and knowledge of the product I was interested in and bought"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Miller",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T15:59:54.000Z",
          "Titre": "Fast delivery and great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Micheal",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:35:29.000Z",
          "Titre": "Andrew was attentive",
          "Contenu": "Andrew was attentive, informative, helpful and got all of my questions answered quickly, and effectively."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bud",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T20:51:30.000Z",
          "Titre": "Time was taken to understand my needs…",
          "Contenu": "Time was taken to understand my needs and wants and  wants. The saleman did an outstanding job."
        }
      ]
    }
  ]
}