{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "focusme.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:07:16.000Z",
          "Titre": "Make it user friendly",
          "Contenu": "Make it user friendly.  I didn't the time to burn up learning the ins and outs.  It was cheaper for me to purchase Freedom and cut my losses."
        },
        {
          "Note": 1,
          "Pseudo": "Kleber",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:26:56.000Z",
          "Titre": "Software slow",
          "Contenu": "The software consumes too many resources, is quite slow and the configuration is not very intuitive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T15:27:42.000Z",
          "Titre": "Had to deinstall FocusMe from computer…",
          "Contenu": "Had to deinstall FocusMe from computer was restarting everytime I tried to turn it off. Will try to reinstall."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Rakan Al-Shawaf",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T20:14:30.000Z",
          "Titre": "PLEASE make it easy to download the…",
          "Contenu": "PLEASE make it easy to download the app!! Every time i want to redownload becauase i switch computers or format, i have to go on a scavanger hunt to find the download link. Just have a an easy link on the home page"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gloria Harrison",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T19:49:31.000Z",
          "Titre": "Not working",
          "Contenu": "It's not working for me. Every time I want to block an ad or website, I click on the FocusMe button. It stays grey and does not do anything. Maybe I am doing something wrong."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Wonderglue Glammy",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T09:55:38.000Z",
          "Titre": "Just isn't there yet"
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "Tameer Islam",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T05:46:41.000Z",
          "Titre": "I bought for my kids.",
          "Contenu": "I bought for my kids.They found ways to bypass the restrictions.Spent a month or more but failed to achieve my objectives."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Theresa Hodges",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T19:58:55.000Z",
          "Titre": "Hard to download",
          "Contenu": "Download didn't work. Password had to be set too many times"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "C Kafka",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T16:57:53.000Z",
          "Titre": "So much potential, but can't be trusted.",
          "Contenu": "I was on the two week trial, it's possible this would be a different experience outside the trial.During the trial, the app was doing exactly what I needed it to. During the schedule I set, it would prevent gaming and random video/social media surfing, letting me actually have a reasonable sleep schedule. It would pause and hide these apps, but I wouldn't lose progress, and it was very consistent and reliable.The day after my trial ended, the app popped up with a login screen. I attempted to login, the app interface would just lock up, and then randomly apply a schedule for a different time to my computer. Closing/ending the app of course didn't solve the problem, because it is (wisely) designed to relaunch if you try to play fast & loose with it. The only way to make my computer functional after the trial ended was to uninstall the app entirely (Thank goodness I didn't turn on the uninstall protection).In theory, this app is pretty good, and does what it says. But if there's a problem this early into it's use that causes the computer to essentially not work, it seems like a very dangerous app to use or rely on. Disappointing, really...so much potential, but can't be trusted."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T00:01:50.000Z",
          "Titre": "The application works great when it…",
          "Contenu": "The application works great when it comes to blocking websites but it is terribly slow when it comes to setting up my plans and schedules. I'm currently using a surface go 2, which while I know isnt the fastest laptop it is definitely a solid one. The only reason I continune to use this is because it is the most strict software on the market."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fernando Pereira",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T18:29:16.000Z",
          "Titre": "Nice app but there is a solution GAP in Windows 10",
          "Contenu": "Solution very simple to use but there are other apps and/or solutions which do the same, we can pay less and with more features. Also, there is a solution GAP because it is impossible to define access restrictions at the same time for differents uses in Windows 10. It is necessary to logon on each user at Windows 10 to apply all of restrictions that we want. The app does not do restrictions at the same time for all of them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Evgenii Kalenkovich",
          "Nb_Reviews": 1,
          "Date": "2021-11-10T20:22:17.000Z",
          "Titre": "Often wrong windows/tabs are closed…",
          "Contenu": "Often wrong windows/tabs are closed because I switched to them near the end of the allotted use period. In Chrome on Android, a tab is closed when I start typing an allowed address but a forbidden one is one of the suggestions."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T22:25:53.000Z",
          "Titre": "First the good thing",
          "Contenu": "First the good thing: your product leads the field in unhackability.  Cold Turkey is too easy to disable from the command line, and Freedom is so bad it's barely worth mentioning.  So you are leading this particular niche area of software.  Also, you've been helpful and quick to respond to criticism/offer technical support in the past.What's wrong with your software: it's buggy.  I can't count the number of times it's simply stopped working for no reason.  Or there's been a delay before a list would activate.  Or the fact, that, despite being set to activate at midnight, my plans activate at 4am.Your UI is bad.  There is no reason why, when editing a plan, it should be necessary to cycle through 5 or 6 screens in a linear fashion just to get to the one that I want.  This is particularly true because your program consistently freezes for a few seconds on the second screen of settings.  If you are going to make a UI this annoying, you should at least not be having glitches that cause your program to freeze.  Unforeseen stuff like this is why you should have good UI, a combination of a bug + poorly conceptualized UI makes the bugs even more annoying than they have to be.Secondly, there is no good way to import massive blocklists into plans, too large a copy paste buffer doesn't work and copy paste is the worst way to do this anyways.  You should preserve the copy paste option, but take a page from Cold Turkey and allow for the importation of blocklists in .txt files.Finally, your product, like all \"Ulysses Software\" should employ a \"rabbit snare\" principle - be hard to hack, but easy to make more restrictive.  It should be easy to add to blocklists during a locked plan.  The best example of this feature is Cold Turkey, which has a browser extension which allows the addition of any URL to a blocklist with a couple clicks.  As far as I can tell, the FocusMe browser extension doesn't do anything.  If you really want to one up Cold Turkey, make it possible to edit the browser URL when you're adding it, in order to add wildcards.Your product is a frustrating combination of power and immense, untapped potential.  I don't know if there is some deep tradeoff of bugginess you had to accept to get the level of unhackability you have, but the UI stuff could be easily fixed.I also eagerly wait a viable android version of your product, as I currently deal with smartphone by simply uninstalling all social media apps, browsers, and finally the store itself, to make sure I can't reinstall anything."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Nienke",
          "Nb_Reviews": 6,
          "Date": "2021-09-04T16:27:19.000Z",
          "Titre": "It gives flexibility to programme…",
          "Contenu": "It gives flexibility to programme according to my distraction habits, which is really good, but I thought it was annoying and intrusive; sometimes the programme froze."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-07T10:17:24.000Z",
          "Titre": "Good features bad desgin",
          "Contenu": "The app is good and the features one has is also good but the design of the app is not good at all. I think that the design of the app gets in the way of all the features and that the app is designed to complicated. There should also be a section of the app where you can see a day overview of all block in a calendar format."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yb",
          "Nb_Reviews": 1,
          "Date": "2018-06-04T12:33:54.000Z",
          "Titre": "Failure in design for both app and desktop",
          "Contenu": "(Sorry for the broken English)APP : the updating (of the system and/or app, I don't know) makes the app fail to its main purpose : sometimes the app doesn't work, and I can access content. Otherwise very useful.Desktop software : doesn't block youtube content when embedded in other website. For example, I use duckduckgo instead of google : I can watch all youtube video there. Not to compare, but coldturkey can do that, which means its feasible.Mail : too much mails, I stopped reading them"
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Martin Wassmann",
          "Nb_Reviews": 46,
          "Date": "2018-04-23T20:12:44.000Z",
          "Titre": "Promising productivity app.",
          "Contenu": "The core functionality is working well since the last update, but for 5 stars the app still needs to be Retina display ready and have iPhone support. Great developer/support team though, so I hope to return with a higher rating as soon as they work out the higher resolution and iOS support."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Sonia",
          "Nb_Reviews": 1,
          "Date": "2019-03-24T20:40:31.000Z",
          "Titre": "I like a lot of the features",
          "Contenu": "I like a lot of the features, but find the interface not at all user friendly - it is impossible to scroll down a lot of the time. I'm also finding it difficult to block one particular item, and this is now my main energy sink :(."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Syed Aadil Hussain",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T15:40:06.000Z",
          "Titre": "Review FocusMe now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-15T12:50:09.000Z",
          "Titre": "It took a lot of updates and a little…",
          "Contenu": "It took a lot of updates and a little while for it to start working. But I got it to work now. Ask me again later"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Shaughnessy",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T23:37:03.000Z",
          "Titre": "The software works reasonably well.",
          "Contenu": "The software works reasonably well.But the UI is dated, sluggish, and non-intuitive."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Vivek",
          "Nb_Reviews": 2,
          "Date": "2019-11-24T17:25:28.000Z",
          "Titre": "UI and usage needs improvement",
          "Contenu": "While I like the android app, the windows desktop app has an unintuitive UI and I have been unable to configure it for my needs, and keeps showing recurring bugs like maximize button being disabled.  So while the windows app has powerful features, I am unable to actually use them, e.g. to whitelist certain sites only for a set of hours every day including important emails (in gmail) but not other emails.UI issues:1. Usage of column heading like RULE instead of something more user friendly.2. The actual value for RULE is truncated in length and have to hover over it to see the full text (note: this problem would go away if maximize button or resizing of window works).  But ideally, I would like to increase width of only RULE column.3. Not sure how whitelist works. If I give a few sites to whitelist, then I expect that timer should run if any websites apart from these whitelisted websites are being used.  But on usage, it seems I have to enter some blacklisted sites also and only then the timer will run.  In that case, it is not clear how to blacklist all websites except whitelisted ones.4. The settings for a plan makes you jump sequentially through 6 dialog windows, when it could have been made into tabbed or a more compressed kind of UI with ability to set multiple parameters on same window.5. Sometimes, the settings will result in a window being blocked when I do not think it should have been as per my configured parameters.All in all, I have spent quite some time but unable to configure it for my needs.  I will probably wait till the UI and settings are improved."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Linus",
          "Nb_Reviews": 7,
          "Date": "2023-11-12T13:34:51.000Z",
          "Titre": "A good tool for increasing discipline.",
          "Contenu": "A good tool for increasing discipline.I use it to limit the time I spend gaming. Even without hitting the limits I set myself, I notice that I reduce the time I game on any given day, because I want to keep some reserve.What should be improved, however, is the userfriendliness. It's not always obvious how certain rules can be set up, the interface is a bit clunky."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler Bradshaw",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T20:03:18.000Z",
          "Titre": "I love the app on my computer",
          "Contenu": "I love the app on my computer; please work on getting an Android app that works on my version of Android OS. The Google Play Store shows an app but only works on my older phone. For reference, I'm running Android ver.13, One UI version 5.1 on a Galaxy S22."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Manuel Fahrer",
          "Nb_Reviews": 4,
          "Date": "2021-04-29T19:58:27.000Z",
          "Titre": "Extremly helpful - with minor weaknesses",
          "Contenu": "Really helpful for me to fight the monkey mind. I have almost entire control over each detail of my work plan. E.g. regular expression patterns applied on the URLs allow me to precisely define whitelists. Some weaknesses : - not available for Linux - slow during operation"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Ruben Gutschalk",
          "Nb_Reviews": 5,
          "Date": "2023-05-08T15:15:41.000Z",
          "Titre": "I have been using FocusMe for a long…",
          "Contenu": "I have been using FocusMe for a long time and I love it, especially the support. Also the programm ist very cheap, a 3 year license cost me 50$. But it also has flaws which is why I just cannot give it the five stars I would really love to give. 1. The Android App has straightforward been abandoned. I think the last update occourred like two years ago, misses a lot of features and has never worked properly on my two cellphones. 2. The Computerprogramm works and gets regular updated, but over time I stumbled upon flaws that were just never fixed:- YouTube Links opened via Whatsapp-Web/ Telegramm etc. don't get detected- FocusMe doesn't work on Opera GX, either the site doesn't get detected or it gets detected but doesn't get closed.Apart from this the program is lovely and I am sure at some point these issues will be fixed, so it is great to maintain a focus for yourself or other people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Florian",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T17:36:20.000Z",
          "Titre": "Great tool, but statistics page needs improvement",
          "Contenu": "Great tool for making you more productive! Curbed my need to surf the internet for hours.The statistic page to view your time spend has unfortunately some bugs!"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "BEATRIZ OLIVEIRA",
          "Nb_Reviews": 1,
          "Date": "2021-09-18T20:18:15.000Z",
          "Titre": "I already use FocusMe and I want so…",
          "Contenu": "I already use FocusMe and I want so say...it's really really great! The PC version is really great, but for Android...I had some problems that make this don't work nice for me: first, when I close application, the protection just don't work anymore :/ I already task the option ''protect FocusMe unninstall or disable'', but stills with the same bug."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "J M C",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T01:51:46.000Z",
          "Titre": "Synchronization between the windows app…",
          "Contenu": "Synchronization between the windows app and the android app is lacking. There is no transitivity between plans configured in windows app and the android app. I actually prefer focusme to the freedom app. However, the freedom app achieved perfect synch between windows and android phone. I think that is essential for mantaining a good \"focus\" on your work (not getting distracted by other devices that are not synchronized with the app). I read that focusme is working on this. I hope they get it done briefly."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "hazarr",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T14:13:40.000Z",
          "Titre": "this app has been amazing as it has given me more energy! seriusly",
          "Contenu": "this app has been amazing as it has blocked my access to some online which serve as distraction - including pornography material which is a current epidemic - worldwideNow, it would be great if the adult blocking option is based on dns server as well as keyword. I do hope for this program to continue developing and to see its ads on YouTube!!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Julia",
          "Nb_Reviews": 2,
          "Date": "2021-10-15T18:10:06.000Z",
          "Titre": "Really Useful!",
          "Contenu": "This is a great application. It's a bit pricey, and could be more user-friendly, but it has been a lifesaver for me. As an online student, I'm able to control which apps and websites I have access to at what time, and this is so helpful for time management. I like that there are different levels of password protection - the random character generator password is my favourite because it's enough of a deterrent when I simply want to scroll social media, but if i really need to stop the plan it is still possible. I would definitely recommend this for people with a serious procrastination problem, like myself."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Mauricio",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T07:21:37.000Z",
          "Titre": "The best software of its kind",
          "Contenu": "The best software of its kind that I found. The random password freature is very good. Saves me hundred of hours per year of distractions. Really recommend it for people struggling with self control in the computer. The android app still needs a lot of freatures present in the PC app though."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T08:49:52.000Z",
          "Titre": "It works and the support even answers on weekends",
          "Contenu": "I really wish there was an IOS app, the normal apple screen time is a bit limiting. The desktop app is amazing though, saved me a lot of hours of watching youtube."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Alexandre",
          "Nb_Reviews": 2,
          "Date": "2021-02-05T17:58:16.000Z",
          "Titre": "It's great, it's good",
          "Contenu": "Everything is great, just sometimes my account got disconnected and i have to contact the support to have my license key back.Otherwise it's very great, it helps a lot on my studies and my professional project. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T12:26:45.000Z",
          "Titre": "It's the same app that works",
          "Contenu": "It's the same app that works. Though I feel it's a little bit unoptimized for newer OS because it feels a little slow between each actions"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Esty B",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T10:47:54.000Z",
          "Titre": "Great app overall",
          "Contenu": "Great app overall. You have lots of flexibility in how to set it up. It's not always perfect (eg: adult sites blocker blocked me from filling out a form on gov.uk because the url had 'sex' in it as it was asking for gender). But have been using it for over a year now and am overall very happy with it."
        },
        {
          "Note": 4,
          "Lieu": "GR",
          "Pseudo": "Αγγελος Μπαχαρακακης",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T14:17:01.000Z",
          "Titre": "Customer support is perfect",
          "Contenu": "Customer support is perfect, the only problem is that in browser when it closes tabs from specific sites I checked for, it also closes tabs from sites I didn't say to close, mostly when those tabs are close to each other."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Hannam",
          "Nb_Reviews": 2,
          "Date": "2022-01-15T10:50:18.000Z",
          "Titre": "A good app with great customer support",
          "Contenu": "A good app with great customer support. It provides a useful nudge to keep off the games or twitter when you are supposed to be working."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shahbaz",
          "Nb_Reviews": 1,
          "Date": "2022-05-22T02:14:41.000Z",
          "Titre": "Focusme is great when it comes to…",
          "Contenu": "Focusme is great when it comes to Windows devices like but sucks when used in Android smartphones."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jo",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T22:09:56.000Z",
          "Titre": "It's good",
          "Contenu": "It really does help, keep you away from distractions, and increase your productivity."
        },
        {
          "Note": 4,
          "Lieu": "JO",
          "Pseudo": "Heidi  Rees",
          "Nb_Reviews": 6,
          "Date": "2021-08-31T03:41:00.000Z",
          "Titre": "I love how FocusMe works and helps…",
          "Contenu": "I love how FocusMe works and helps keeps my kids and I on track. I just want it to be available for Chromebook tablets as well!"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "werbliben",
          "Nb_Reviews": 2,
          "Date": "2021-11-12T10:59:43.000Z",
          "Titre": "Clunky, but robust and flexible - heartfelt recommendation!",
          "Contenu": "This is the most robust and fully featured distraction blocker of the ones I've tried. Flexibility in terms of scheduling (timer, specific hours of the day, no. of app/website launches etc.) and the level of security of the block (password protection, incl. randomly generated char. sequences, or a \"nuclear\"/forced mode) are essential to making it a good long-term solution that reduces stress instead of adding it. I've been really impressed with the forced mode (i.e., the one you can't turn off at all).Customer service is also great, in my experience. My license was auto-renewed, but the old one expiring meant that the app logged me out and stopped the plans that were running. I created a support ticket in panic on Friday afternoon and didn't expect to hear from them until Monday/Tuesday, but got a response within just a few hours, which means that I have a much higher chance of staying productive throughout this weekend.All in all, for me, it's definitely worth the asking price and I want to strongly encourage any ADHD brains out there (or anyone with less-than-stellar executive function, really) to take FocusMe for a spin and see if it works well for them.There are some downsides to be aware of, though: - the interface could use a touch-up; right now it's sometimes a little confusing even for me and I consider myself tech-savvy (don't let it scare you away from trying the app, though -- a few minutes of clicking every button you see should be enough to help you orient yourself);- on a related note, the license renewal issue described a few paragraphs above... simply should not have happened -- I'd expect the license reactivation to be automated and not stop active plans (upd.: Jon Rumens reached out to me and explained that the expected behaviour is indeed auto-reactivation, so, while the reason it didn't trigger in my case is still shrouded in mystery, I thought I'd downgrade this particular point from \"a feature not thought out\" to \"a weird bug that was surprising to FocusMe team as much as it was for me\");- the mobile app has not been working great for me, unfortunately -- to the point where sometimes the apps that were supposed to be blocked simply weren't. I suspect this is something that could be resolved with more tinkering, but I simply put the mobile app aside at some point. Most of my deathscrolling happens on PCs anyway + Android has a decent digital wellbeing app that works well enough for me.So yeah, while there are definitely things about FocusMe that feel janky and seem to require more manual tuning than should be necessary, but on the flip side you do get a very robust and flexible system that can't be fooled by simply killing the process / opening a browser window in incognito mode / restarting the PC."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T04:56:12.000Z",
          "Titre": "Overall the functionality of FocusMe is…",
          "Contenu": "Overall the functionality of FocusMe is great. For one, it actually works and blocks things as it should. I have used other programs that do not. Also there are so many options for what you can control and limit. I gave 4 stars because there are small things about the user experience and interface that either are a bit clunky or confusing. But overall great product and glad I purchased."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Jakob Swartz",
          "Nb_Reviews": 16,
          "Date": "2020-03-20T07:15:57.000Z",
          "Titre": "It works and does what you want",
          "Contenu": "This app is simple enough to get the job done, and expansive enough to customise if you want to. Of the four productivity apps I tried, this was the best option. Being able to block certain apps and websites on both phone and laptop has given me increased focus.The android app is free, and it gets the job done, but not too elegant (i miss the predefined lists of the pc app). Five stars when the phone app can link to the pc app."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Thomas",
          "Nb_Reviews": 3,
          "Date": "2019-12-11T16:52:00.000Z",
          "Titre": "Great features, poor interface, excellent customer support",
          "Contenu": "FocusMe has great features and multiple options for customization as well as great customer support. However, its interface is not delivering the user experience expected from a leading service that is billed monthly in 2019. The interface feels unresponsive and often gets in the way when setting up plans. The experience for creating a new plan or editing an existing one is somewhat intuitive but not particularly seamless or enjoyable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miko",
          "Nb_Reviews": 1,
          "Date": "2018-11-13T00:30:42.000Z",
          "Titre": "Never paid for an app my entire life",
          "Contenu": "Never paid for an app my entire life. But this one, I was glad to sign up for a 1-year membership plan. The tool is great, the customer service is wonderful, with Jon responding to my email himself, and the price was reasonable. The reason why I gave it a 4-star instead of 5 is that the app's UI could do better. I'd love to see a more user-friendly and fresher look."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "human12345",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T00:23:29.000Z",
          "Titre": "works well",
          "Contenu": "works well. at times, though - it crashes when a plan blocks a website. and then i can access the website. which defeats the purpose. or it randomly stops recognising the websites i am going on, which means i can access any website. defeats its own prupose a lot and i end up wasting a lot of time because i trusted this software.4 stars instead of 3 because customer support is responsive to a good level, and fixes problems."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Chago",
          "Nb_Reviews": 2,
          "Date": "2018-11-26T16:46:02.000Z",
          "Titre": "Excellent for those of us without enough self-control",
          "Contenu": "I love the fact that it is so difficult to bypass (if you choose that option, of course). I'ts excellent to keep you focused, it has helped me a lot, and the only reason I'm not giving 5 stars is because it lacks more options, e.g. I'd like to set some apps to be just blocked and other apps to be allowed for a certain time interval in the same plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Hill",
          "Nb_Reviews": 1,
          "Date": "2018-08-06T19:54:38.000Z",
          "Titre": "Great customer support",
          "Contenu": "When it works, it is great. Often have to close out and reopen or work some other voodoo to be able to click on the button to launch the time windowUPDATE: I have changed my review to reflect 4 stars. The customer support these guys offered was pretty incredible. Technical issues persisted but they offered great hand-holding and weekly check-ins. I now use this product every day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2018-07-12T15:26:32.000Z",
          "Titre": "The functionality is great",
          "Contenu": "The functionality is great, but for some reason I just don't use it consistentlyIn response to the below:This has more to do with the way I use the app rather than the app itself.  I have focusapp installed on two computers, my home desktop and my laptop.  Both computers come with their own distractions.  Disabling the distractions via the app is not as effective as simply taking my laptop to a place where there's no wi-fi."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martyn Folkes",
          "Nb_Reviews": 1,
          "Date": "2018-06-30T10:54:57.000Z",
          "Titre": "The best way to stay focused",
          "Contenu": "This is probably the best way to stay focused on your computer, mainly because you can block apps as well as websites. It is still a little rough around the edges, but no major problems. I would recommend FocusMe over all other solutions (and I've tried a lot of them)."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T21:31:20.000Z",
          "Titre": "Superior to other anti-procrastination apps, but not perfect",
          "Contenu": "Helps me to stay productive, whenever I remember to turn it on. I love that I'm able to have several different \"sessions\" running at the same time, such as one that prevents me from procrastinating at school as well as one that blocks my entire computer before bed. I have a few minor complaints - I wish it was easier to navigate and to add websites and apps. Is it really necessary to click the \"Next\" button 8 times to set up a plan? Is it necessary to search through every single app running on the computer to find something, rather than using an interface akin to the Windows \"Apps and Features\" one?"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Flo",
          "Nb_Reviews": 4,
          "Date": "2018-07-23T10:16:32.000Z",
          "Titre": "Does what it is supposed to do",
          "Contenu": "I just found a  setting that allows to block access to privacy settings. I can run it in forced mode without being able to outsmart it. Is is difficult to find this setting which is why I oversaw it the first time when I used the app. The response of the person that works for focus is not entirely correct. The option to block your privacy settings is available in trial mode as well! I deduct one star because the user interface is a bit clunky and the focusme employee who responded to me should know his own product better since the setting is available in trial mode! I am satisfied and find this app useful!"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "SANJANA ARAVIND",
          "Nb_Reviews": 1,
          "Date": "2019-03-03T17:23:13.000Z",
          "Titre": "Good but can still improve.",
          "Contenu": "The app is really good in the sense that it provides a lot many customization to fit your work mode, It has really helped me to stay away from wasting time in Youtube and other unproductive sites. But still there are browsers which are not covered by FocusMe, like SIDEKICK PRIVATE BROWSER, LUNASCAPE etc. The app developers can work towards making it universally applicable to all browsers or stop using other browsers.What I have done is , I stopped my access to downloading other browsers by adding the words browsing apps, browsers etc to RegEx feature of FocusMe , and blocked all other known browsers.Anyway they does a good job. Cheers !!"
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Tom Waldenmaier",
          "Nb_Reviews": 1,
          "Date": "2018-12-09T16:27:23.000Z",
          "Titre": "Recommendable App",
          "Contenu": "Focus Me is an awesome app and helped me in many things, such as staying awake not longer than I want to.One star is missing, because I think it is to expensive and because I can not install Focus Me on my phone."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michael Roy",
          "Nb_Reviews": 1,
          "Date": "2019-05-12T05:10:23.000Z",
          "Titre": "Great program, one critique",
          "Contenu": "So far, I'm really enjoying this program. Its been able to help me stay productive. It works very smoothly, and I love the option to create a random password of any character length: this allows me to access certain websites when I absolutely need them and keeps me from accessing them when I don't. My only critique is that, when I've set it to restrict some websites/apps to a certain time length per day (ie: only use Youtube for 1 hour per day), sometimes it doesn't accurately record the amount of time I spend on those websites/apps, and allows me a lot more time on them then what I've programmed. This might be a fault on my end, I'm not sure, but thought it would be worth mentioning."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "michel feyten",
          "Nb_Reviews": 7,
          "Date": "2018-06-06T18:30:03.000Z",
          "Titre": "practical and very swift personal help",
          "Contenu": "John and his team are very fast in responding to questions about software issues. I have never seen this before in any other firm!  And thus Focus Me works very well for me. Win10. Try it, and you will notice it !"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Safi",
          "Nb_Reviews": 2,
          "Date": "2020-01-30T18:25:16.000Z",
          "Titre": "No prebuilt profiles for Android.",
          "Contenu": "No prebuilt profiles for Android.There is also a small glitch in the Android app where it says you've spent 10 minutes on a time wasting app, where as you may have spent 50 minutes on it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "kier collins",
          "Nb_Reviews": 21,
          "Date": "2018-11-28T14:05:32.000Z",
          "Titre": "Almost 5 stars but interface isn't…",
          "Contenu": "Almost 5 stars but interface isn't quite smooth enough just yet. The features are fantastic and if you're wanting to blokck sites permanently when setting up 'plan' simply set it to forced mode. I'd recommend not setting it to last all day for a couple weeks to see if you don't ever want to access certain sites again.Sometimes when trying to do 'quick add' to an existing plan it takes multiple clicks of the mouse to be able to type into the field. All in all great service and it will only improve with time.I've just noticed as well (after initially leaving the review) that there is app and web browsing analysis that shows how much time you spend on what sites or apps, this is another great feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Diaz Quiroga",
          "Nb_Reviews": 1,
          "Date": "2018-06-29T12:55:37.000Z",
          "Titre": "The tool is great",
          "Contenu": "The tool is great, for me what is missing is two things:1) Plans syncs between notebooks/phone.2) Possibility to add plan using an external calendar (sync both ways)Kinds Regards,"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Matt Madden",
          "Nb_Reviews": 2,
          "Date": "2018-10-05T23:26:01.000Z",
          "Titre": "Powerful app & website blocker",
          "Contenu": "UPDATED: Recent updates to FocusMe seem to have fixed some issues we had on Windoze 7 and the developer follow-up to my concerns is much appreciated!A fantastically flexible application and website blocker that is sure to improve your productivity and/or limit your kids' computer time!Unfortunately the interface design isn't as easy to use as [I think] it could be, and I experienced some issues on Windows 7 that seem to have been fixed in a recent update.Also note that website filtering is only based on matching URLs (e.g. social media) or patterns in page titles (e.g. porn), so you won't be able to choose categories of community-currated black/white lists ala OpenDNS for example.This product lives up to it's name and it's obvious that the developer is committed to continually improving it. Recommended!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Harald",
          "Nb_Reviews": 2,
          "Date": "2020-07-14T06:59:40.000Z",
          "Titre": "Excellent tool to block unwanted…",
          "Contenu": "Excellent tool to block unwanted distraction. Blocks websites, apps, software in any way you like. Interface could use some polish, but that's about it."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Camila Mendes",
          "Nb_Reviews": 2,
          "Date": "2018-11-14T16:02:31.000Z",
          "Titre": "Amazing tool",
          "Contenu": "Amazing tool, it's been helping me a lot. Highly recommend. Only thing it that I wish it was a bit easier to navigate. Interface could be improved."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Alex Blagus",
          "Nb_Reviews": 2,
          "Date": "2018-07-20T19:53:03.000Z",
          "Titre": "I am reasonably comfortable with this…",
          "Contenu": "I am reasonably comfortable with this software. Though it does have considerable control over computer operations, which does make me slightly nervous."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Ursachi Adrian",
          "Nb_Reviews": 1,
          "Date": "2018-07-05T06:11:24.000Z",
          "Titre": "It helped me keep my addiction in…",
          "Contenu": "It helped me keep my addiction in check,in order to achieve a greater life value overall.Their customer service is very good,fast and reliable."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Brad Wilson",
          "Nb_Reviews": 1,
          "Date": "2019-04-12T02:10:57.000Z",
          "Titre": "My inner procrastinator hates FocusMe, but I love it.",
          "Contenu": "As I once wrote in an email exchange with Jon, the founder (who, BTW, goes to great lengths to engage personally with his customers), I love FocusMe and I hate FocusMe in roughly equal measure.  Let me finish ;-).  I love FocusMe because it is hands down the most effective control I have found over the many distractions to which I previously allowed myself to fall prey; and I hate FocusMe when I feel inclined to procrastinate because I simply can not find a way to break it.  And believe me, I've tried.  I quickly became adept at breaking the other apps in its class but FocusMe has me beat, making it entirely effective at helping me focus on what I need to focus on.The only thing holding back the 5th star here is that the UX is a little clunky, and it lacks the ability to synchronise and control plans across my multiple devices.  I believe that feature and improved UX are on their way, so I look forward to continued improvements in this fantastic product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 4,
          "Date": "2018-11-25T19:18:48.000Z",
          "Titre": "This app is incredibly useful for me",
          "Contenu": "This app is incredibly useful for me. Sometimes I find the interface a little confusing, so that's why it's 4 stars instead of 5."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Jeremy Henaut",
          "Nb_Reviews": 1,
          "Date": "2018-08-28T13:41:05.000Z",
          "Titre": "This app really did the job for me",
          "Contenu": "This app really did the job for me, easy to use and light, and most of all I haven't had any bugs with it. Consistency is appreciated"
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "ikousoft",
          "Nb_Reviews": 1,
          "Date": "2019-01-06T09:38:55.000Z",
          "Titre": "one of the main reasons that made me…",
          "Contenu": "one of the main reasons that made me more productive and disciplined by cutting distractions and focus more on what's matter"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Pierre",
          "Nb_Reviews": 1,
          "Date": "2018-04-17T17:41:21.000Z",
          "Titre": "Even though I know it’s complicated to…",
          "Contenu": "Even though I know it’s complicated to do with iOS, I’d love to have FocusMe on iPhone. Otherwise it works well."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "john clancy",
          "Nb_Reviews": 1,
          "Date": "2018-11-03T14:12:39.000Z",
          "Titre": "Very good software",
          "Contenu": "Very good software. Has stopped me wasting hours on the internet every day. Hours that I use to work now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "123",
          "Nb_Reviews": 1,
          "Date": "2018-11-30T20:54:02.000Z",
          "Titre": "Pretty Good",
          "Contenu": "Could have better interface. Lacking some features but better than all other blockers I have found."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Wright",
          "Nb_Reviews": 3,
          "Date": "2018-03-08T17:16:19.000Z",
          "Titre": "good system with 1 setback..",
          "Contenu": "If devices could sync, it would be 5 stars.  I do find this product helpful with my time management"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2018-09-21T20:19:18.000Z",
          "Titre": "Excellent tool to stop wasting days",
          "Contenu": "Focus Me is flexible to set up, with many options to specify the precise controls needed for focus on what is truly important. Important is the fact that once set up, it is really difficult to change settings. It ships me just seeing what is happening on Twitter, or on the news, and suddenly it is the end of the day and I've done nothing. It's exactly what I need.The Android version isn't as high functioning, which is a shame. It also has some difficulties specific to certain phones. We have a Huawei, an OPPO and a Samsung in the house, and we have difficulty in the first two cases but not on the Samsung. That isn't the fault of Focus Me, but it's a shame. I need to restart the app more often than I'd like, and I can lose focus because of it. Purchasing the app was a bit less obvious, as I didn't get a message telling me I'd been successful, and purchased two. Customer service are excellent, however, and I received an immediate refund on one. They were also good and responsive with some of the technical problems with the Android version, which is not wholly successful but due to Huawei peculiarities rather than the app.Very strongly recommend the computer version, and I how the Android version develops a little more."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ujada Edas",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T23:44:05.000Z",
          "Titre": "DON'T BE PUT OFF BY THE 4 STARS",
          "Contenu": "DON'T BE PUT OFF BY THE 4 STARS. I'll explain why FocusMe is missing one star. But honestly apart of that is an absolutely phenomenal filter system. No.1 in the world. It is totally unmatched. I'd rate it 9 out of 10 if I could. 4/5 is not doing it justice. I absolutely love FocusMe. The software is so extraordinarily intelligent, sophisticated, smart, robust and indestructible. No filter system in the world comes anything even close to FocusMe on the PC. Literally none.Want to block the TV show \"Big Brother\", but don't want to block the words big and brother individually? Focus Me lets you do that. Want to block the word videos, but want to allow the phrase 'Maths videos'? Focus Me lets you do that. Want to block Bing Images and Videos, but not Mail, Maps, Flights, OneDrive? Focus Me lets you do that. Want to time-limit how long you spend on a search engine, or searching on YouTube?  Focus Me lets you do that. I mean it's just so exceptionally smart. NOW the ONLY thing that I'm disappointed with Focusme is that, the blockage isn't as instantaneous! So if I attempt to search something I've blocked, there's a delay of 2 seconds before it's blocked. That's probably not a problem for many users. But for me, if that 2 seconds is enough to expose me to images which I can't forget about."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2019-01-16T17:52:07.000Z",
          "Titre": "Definitely like the concept, still learning to use it and make it work properly",
          "Contenu": "I'm still learning to use it and like it overall, but so far I'm having issues with functions on the desktop version. For a couple social media sites, I chose to only allow 3 launches per day of 15 minutes per launch with a minimum of 4 hours between launches. I also set up a window of time in the day when that is supposed to be active. However, it doesn't keep track of the time between launches when the computer is not on (so if I have 2 hours left before I can launch my \"second time for the day,\" but then I close my computer and come back to it a few hours later, it still says I have 2 hours left before I can launch again). It also is not keeping track of the number of launches per day, it just cycles through 1, 2, and 3 over the course of multiple days rather than restarting at 1 each day (including not counting the break time while the computer is off...so if I open my computer in the morning, I may have time left in a \"break\" even though it's a new day). Hard to explain, but basically, it's not working like I think it should based on how I set it up and I need to figure it out (which is a tall order since the desktop app is kind of clunky and hard to understand at first). TLDR: Good concept, but the details are not super intuitive or seamless in function. Still think it will be good to use for the year once I figure it out"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "rmacarthur",
          "Nb_Reviews": 1,
          "Date": "2020-12-07T23:28:36.000Z",
          "Titre": "Helps me stay focused and productive…",
          "Contenu": "Helps me stay focused and productive while working from home during Covid-19"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2018-04-17T16:23:37.000Z",
          "Titre": "Great application hope there will be…",
          "Contenu": "Great application hope there will be other features in the future."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Sandrina",
          "Nb_Reviews": 1,
          "Date": "2020-11-29T22:05:44.000Z",
          "Titre": "An verry useful tool.",
          "Contenu": "FocusMe helps me to focus on my work. No more distractions!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean ODWYER",
          "Nb_Reviews": 3,
          "Date": "2018-07-20T12:00:56.000Z",
          "Titre": "Great software",
          "Contenu": "Great software, fantastically useful, but needs design polish."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "HE GUO BENJA",
          "Nb_Reviews": 2,
          "Date": "2019-04-22T23:49:17.000Z",
          "Titre": "Has been helpful to focus on work",
          "Contenu": "Has been helpful to focus on work, increasing productivity."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Roid Faruq",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T09:01:52.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Just really what i need to get more focus."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Kabelo Monyela",
          "Nb_Reviews": 1,
          "Date": "2019-09-15T11:09:56.000Z",
          "Titre": "It's good",
          "Contenu": "It's good. It's not full proof but it works"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "milo brontesi",
          "Nb_Reviews": 1,
          "Date": "2020-06-14T15:21:29.000Z",
          "Titre": "a bit pricey but overall an exellent…",
          "Contenu": "a bit pricey but overall an exellent program"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "KKornacki",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T17:57:46.000Z",
          "Titre": "UX on MacOS was terrible",
          "Contenu": "UX on MacOS was terrible and now is ok"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2018-10-12T16:19:08.000Z",
          "Titre": "Replied promptly and to the point."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-15T23:30:20.000Z",
          "Titre": "Good app with good support!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Herbert Cochran",
          "Nb_Reviews": 1,
          "Date": "2018-06-22T16:13:51.000Z",
          "Titre": "Good product",
          "Contenu": "Good product. easy to use"
        },
        {
          "Note": 4,
          "Lieu": "CN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T13:13:59.000Z",
          "Titre": "Great",
          "Contenu": "Great, but can be better"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Tony Eappen",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T05:17:25.000Z",
          "Titre": "Excellent......."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Payam Khabbazi Zowj",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:35:43.000Z",
          "Titre": "Probably one of the best support teams…",
          "Contenu": "Probably one of the best support teams I have experienced. I've been a user since 2017 and they always treat me fairly and go above and beyond."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel Robinson",
          "Nb_Reviews": 7,
          "Date": "2023-12-04T20:43:57.000Z",
          "Titre": "The best purchase I've ever made!",
          "Contenu": "The best purchase I've ever made. FocusMe has changed my life and I've been able to unlock incredible amounts of willpower and intense focus.It's much better than all the equivalent products out there. I always recommend FocusMe to anyone looking to get ahead."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Preble",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T03:18:31.000Z",
          "Titre": "Long time user, support always helpful",
          "Contenu": "I've been using FocusMe for several years now, and it's been very helpful. Customer service is fantastic, I've reached out to them for help several times and they are always prompt with a solution."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sebastian",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T18:30:16.000Z",
          "Titre": "Amazing product, amazing service",
          "Contenu": "This product really helps me getting my focus for work I value but get distracted from frequently. Whenever there occurs a problem or I block myself from essential services using the product, the service is just amazingly fast and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Z",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T06:47:27.000Z",
          "Titre": "Can be set to be impossible to circumvent. 10/10",
          "Contenu": "Before buying this I always gave in to distractions and let my work pile up. Now I'm forced to be productive because I've set the blockers to be impossible to circumvent. This is such an underrated feature and I'm surprised no other blocking software I've seen has it! I'm many times more productive now than before. Mere willpower does not compare at all. I would recommend FocusMe to anyone who struggles with digital distractions."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Matheus Caetano Rocha",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T02:40:38.000Z",
          "Titre": "Sync Folder / Log in",
          "Contenu": "The response from the support was very quick and very efficient - even though my problem was very specific, every email from the technician was always right on the money, getting closer and closer to fixing it. Congratulations on the pragmatism and objectiveness - those are the best qualities for a support technician!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mario Lamoureux",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T20:40:54.000Z",
          "Titre": "Hi my name is Mario, and i'm a workaholic...",
          "Contenu": "Sometimes you have discipline other times you don't. This software allows me to respect my working hours. I'm a workaholicFor me it blocks certain software at specific time.Technologically it just work. You won't know it exists. It doesn't slow down the computer.Just buy it... get you life back...User for 5 years now..."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Trevor Flanders",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T04:23:00.000Z",
          "Titre": "Probably the best software I've purchased",
          "Contenu": "If you want to have more control over your digital environment, get FocusMe. Seriously, it's the best app out there. It can do anything you want it to with unlimited customizability and if setup properly is nearly impossible to workaround. The value add to your life and mental well-being is worth 50x the asking price."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Robyn Webb",
          "Nb_Reviews": 5,
          "Date": "2023-11-27T03:50:26.000Z",
          "Titre": "Great support",
          "Contenu": "Support people were knowledgeable, fast and able to solve my problem easily"
        },
        {
          "Note": 5,
          "Lieu": "DZ",
          "Pseudo": "Hyppolite",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T10:29:36.000Z",
          "Titre": "Helpful if your addicted to your screen and self control isnt enough",
          "Contenu": "Indulging too much in entertainement on screens, it was affecting my life in many levels. I tried to manage this by myself, but eventually I realised I lacked the self control. This really helped me.Plus you can customize your plan, you can add websites to the forbidden list WHILE your plan is active, you can set an uninstall protection to make sure you dont get rid of the software in a moment of weakness..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Barksdale",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T22:24:17.000Z",
          "Titre": "Unique Site Blocking Focus Software that Works!",
          "Contenu": "FocusMe is the only software I've tried that can reliably block websites and apps for periods of time. It's very easy to adjust to block sites for time periods from 15 minutes to months or years if you want. If you are a procrastinator, you know it's easy to get around a lot of methods like blocking sites through your browser and so forth. The customer service team is very responsive and helpful too if you have any questions or need to stop a blocking plan."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Coco",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T14:10:41.000Z",
          "Titre": "Great tool and excellent support!",
          "Contenu": "The focusMe application is a really great tool as it is simple, lean and can be highly individualized to one's current needs. Also the support when having problems is great! Clear, kind, persistent and very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "werbliben",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T01:49:28.000Z",
          "Titre": "Easiest recommendation of my life",
          "Contenu": "Great product, genuinely feel like there are human beings working on this app (and in the support team, too), thoroughly recommend this to anyone who is on the fence."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Warren Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:24:18.000Z",
          "Titre": "Excellent product & support !!!",
          "Contenu": "I have been a Focusme customer for a few months now and I just love the software. It's simple & easy to use. My favourite feature is the \"uninstall protection\". The support is just as great as the product. Support is quick and after a support request, the support team actually follows up to see if the problem was resolved.Its really good value for money !A well deserved 5 stars !!!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Manny Z",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T18:08:02.000Z",
          "Titre": "Life-changing... From procrastinator to successful business in 6 months",
          "Contenu": "One day 10 years ago while freelancing on upwork (odesk), I realized I had only gotten 3 hours of actual productive work done all day. The rest of the time was lost on all kinds of digital distractions. I started using FocusMe a week later and within 6 months I finally launched my first successful business. That was 5 years later than intended, but hey. Better late than never!I don't think I could have done it without FocusMe. Digital distractions are productivity death by a thousand cuts. Silicon Valley pays brain scientists millions to make their products as addictive and distracting as possible. I’ve tried just about all other distraction blockers on the market, but they are easily circumvented. FocusMe has a “forced” mode – you WILL get your work done.I'm an evangelist for this program. I always tell everyone about it. In this day and age, unless you have the willpower of a Tibetan Temple Elder, you may not even realize how many countless hours get lost every day, seeping through the cracks, seconds and minutes at a time. Unnoticed. Adding up to years of your life.How much is it worth to get your life back? To finally get around to all the things you've been putting off for years? A million dollars? I don't know. What I do know is that I can't possibly recommend this program highly enough. FocusMe I want your autograph! If you were a woman I'd marry you. If I was a woman I'd want your baby."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Joni Aikio",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T09:44:28.000Z",
          "Titre": "Focusme is the best there is for the job",
          "Contenu": "I think there is really not great alternatives around for blocking and focus programs. Focusme is super customizable with how you can set up your plans, and with forced mode you can not cheat. Customer care is also top notch. I've owned the program for many years now and I've always got answers to my questions within few days."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Maxime Coeman",
          "Nb_Reviews": 3,
          "Date": "2023-05-14T11:35:20.000Z",
          "Titre": "Love it!",
          "Contenu": "Been using for only 2-3 days and still kind of working out which of the protections works best for me but already saved hours of time and feel a lot happier! The blocks are impossible to cancel other than the canceling/pause method you set which is way better than other apps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Barnett",
          "Nb_Reviews": 3,
          "Date": "2023-05-01T03:51:38.000Z",
          "Titre": "Amazing product with excellent customer service",
          "Contenu": "FocusMe has been the best tool I've used in my life. Particularly during the pandemic years, I had succumbed more and more to internet distractions, wasting time on the computer instead of working, sleeping, or spending time with family. With FocusMe, I can now flexibly block what I need to, without having the option of removing FocusMe completely. The value is 100x what I pay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Holt",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T19:53:16.000Z",
          "Titre": "Great customer support!",
          "Contenu": "Great customer support!  I've been using this for years, and I've always had the best interactions whenever I've needed help with any features. More generally, I find the product *extremely* useful for keeping me productive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elliott Weir",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T00:11:30.000Z",
          "Titre": "Useful product, great cost, and great service",
          "Contenu": "I've used FocusMe for years to help me, and I decided to use it for some parental control on my middle schooler's laptop. Support helped me figure out how to do that and it's working great now!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard S",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T08:40:52.000Z",
          "Titre": "Good product and good value",
          "Contenu": "Good product that is robust about helping you focus. Takes a bit of time to get it set up exactly for what you may need but worth the investment - though default time plans will probably work for most people. When I needed to contact support they were very responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Audumbar Chinchkar",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T09:44:10.000Z",
          "Titre": "This website is best to curb time waste",
          "Contenu": "I have been using this website for sometime, it works perfectly well in blocking websites and apps. I feel I have saved lot of time in not using social media since i started using FocusMe. There are multiple configurations such time limiting, blocking straight aways, or seting hourly limit for apps and websites. Even if you run into a problem customer support is quick to give solution. I 100% recommend this app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manny S",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T02:12:42.000Z",
          "Titre": "FocusMe is Protected From Bypassing",
          "Contenu": "I love how protected the software is. With many website blockers, there are ways around them. However, FocusMe has predicted many possible escape routes, which I love, being that I am tech savvy."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Witte",
          "Nb_Reviews": 3,
          "Date": "2023-03-05T12:08:35.000Z",
          "Titre": "Taking control of digital distractions",
          "Contenu": "Focus Me is the most effective focus app I've found. I've used it for several years and they've continuously been listening to user feedback and updating its functionality. Their response time to issues is always on the same-day. With complex issues they book a video session to help you figure it out. I can't ask for more. This tool is as water-tight as you can get and it has genuinely improved the quality of my life: no longer am I a complete automaton in the digital world."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Zubayer Alam",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T12:27:19.000Z",
          "Titre": "Great blocking software with much flexibility",
          "Contenu": "I was recommended this software by a friend of mine. Having tried other blocking softwares before I must say this one is the best one out here simply because it allows for so much flexibilty.It has all the basics from automatic blocking to advanvced features where you even can block specific words, or entirely block youtube but keep specific study playlists which really has helped me. Granted there may be small bugs but they are nothing compared to the benefits of this softwareThe staff are also always ready to help"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Bjarke Pedersen",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T19:50:49.000Z",
          "Titre": "Amazingly great app",
          "Contenu": "Amazingly great app. Top of the line content through and through. Right amount of notifications and good tone. Can highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Cris Garay",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T22:32:46.000Z",
          "Titre": "Extremely helpful and effective!",
          "Contenu": "FocusMe is very helpful to people like me who have difficulty maintaining focus. I mainly use the app to prevent myself from using Facebook, visiting shopping websites, and using non-work related apps, during times when I should be working. I have only used a couple of features so far and it already has improved my productivity a lot! Can't wait to further explore it.Keep up the good work FocusMe team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clinton",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T10:42:48.000Z",
          "Titre": "Easily-customizable software that…",
          "Contenu": "Easily-customizable software that allows you to control how you spend time on your computer. Capable of blocking websites and software by way of address, name, title, etc. Can setup up multiple plans that run concurrently.  If you make a mistake by making security too tight or lenient, a message to the support team will have them respond within half an hour from my experience.  Software is updated regularly. This is a product I would recommend for someone looking to get their computer habits under control."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Jonas Rodrigues",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T18:29:35.000Z",
          "Titre": "FocusMe is an essencial software if you feel you are getting too much distracted by the internet",
          "Contenu": "I've been using FocusMe for some years now and ,in my perspective,  it's just the best website blocker and focus app there is.Nowadays it's so easy to get distracted on the internet and FocusMe provides many ways for you to put some obstacles between you and these distractions.I can honestly say that this software is totally worth it and that it made a huge difference on my life.Not only that, but the support is also great!10/10"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Divyansh Sangal",
          "Nb_Reviews": 2,
          "Date": "2021-06-20T08:47:49.000Z",
          "Titre": "Concrete Product, Awesome Customer Service",
          "Contenu": "Focusme has helped me cut down my compulsive internet surfing down by 90%. Down this path there were few issues to which FocusMe team was very receptive and then moved fast to solve. The product in itself provides a wide array of functionality starting from the core blocking functionality to the regex based website blocking which really helps to stay away from websites you don't want to go to. Thanks team."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David Bowen",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T17:29:27.000Z",
          "Titre": "There are things you want to do, but are hard, and FocusMe has made me look forward to doing them.",
          "Contenu": "FocusMe completely changed my productivity levels and my life really. I have tried other blocker systems, FocusMe has been the best one for me by far. Every workaround you could think of there is a way to block it. It's really nice to be able to boot up the PC and do what I actually want to do, instead of having to do it while fighting off distractions. All that stuff about deep work, context-switching and attention residue has gotten atleast 80% easier for me to do, I frankly do not think I could do any of that without this program.Additionally the support staff has always been extremely helpful, and they are always available and understanding, a very big thank you to Ryan and Lorenz!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Vaughan",
          "Nb_Reviews": 2,
          "Date": "2021-09-22T18:08:21.000Z",
          "Titre": "FocusMe is an effective time management…",
          "Contenu": "FocusMe is an effective time management app that helped me curb a video game addiction immediately back in 2018. It provides structure and limits that helped me regain control of my schedule. The app itself is very simple and offers a few handy features like graphing your time on apps and websites. The dev is responsive to feedback and writes a good blog, too."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Piotr Zielonka",
          "Nb_Reviews": 2,
          "Date": "2022-04-13T13:06:00.000Z",
          "Titre": "Product is quite good",
          "Contenu": "Product is quite good, there are two issues though:1. Some features were not working initially, I think this is fixed now.2. After one year of subscription, service was automatically extended for one more year and my credit card was charged, which is not what was my intention.Edit: great reaction from FocusMe, same day I have submitted my review, they have cancelled my subscription extension and returned me money for it, changed to 5 stars. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "JO",
          "Pseudo": "Omar Herzallah",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T14:54:00.000Z",
          "Titre": "Can't Live Without It",
          "Contenu": "This app is NECESSARY for a healthy, productive digital life. It is highly customisable and the support team is particularly excellent. They will work with you thoroughly and will tirelessly answer every question or comment. Help is quick and abundant through instant live chat, e-mail, or you could even hold a Zoom call with support if you would like to speak to someone through video. I am forever grateful to the support team and this app."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Damian",
          "Nb_Reviews": 1,
          "Date": "2022-04-17T12:00:02.000Z",
          "Titre": "No Other Program Like It!",
          "Contenu": "This is a one-of-a kind program! It really has the power to enforce specific time, app, and website limits. Unlike other applications that be easily circumvented, FocusMe does an excellent job at preventing workarounds. This is a great program if you want to limit your child's screen time or if you just want to be less distracted yourself from things like social media, video games, etc.The support team is also amazing: they are quick to respond to concerns, listen to feedback, and often implement suggestions from users."
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Taavo P",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T19:09:59.000Z",
          "Titre": "Best of its kind",
          "Contenu": "Having tried a few different top blockers it is true to say, without hyperbole, that this app is the very best blocker available. Besides its strong features, it is very receptive to costumer queries and concerns. I was previously a Cold Turkey user and discovered a loophole around their blocks, which they were unable to fix. However this same loophole was quickly attended to and patched up by the FocusMe team. If you want to gain control over the areas of your life in which control is lacking this app is certain to do that for you."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Daniel Arroyo Durán",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T17:46:20.000Z",
          "Titre": "App really does everything you need to…",
          "Contenu": "App really does everything you need to keep you away from distractions. Full flexibility regarding the options you have. In previous apps I've complained that the options are generic so you get one benefit but pay with a counterpart. Not the case of this one."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James Frost",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T14:31:17.000Z",
          "Titre": "Good app for time management",
          "Contenu": "Good app for time management. Block websites and apps at certain times or organise scheduled times for use. VERY flexible app...you can set it up in so many ways. Excellent communication and chat function from FocusMe team."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "R M",
          "Nb_Reviews": 7,
          "Date": "2022-02-19T16:10:00.000Z",
          "Titre": "Really really good",
          "Contenu": "I've tried various of these productivity apps. I use them to limit my access to all of the internet, and to some social media on my laptop, and sometimes to 'lock' my entire laptop. Focusme is by far the best, I've been using it for 3 years now. It's very versatile, works without hickups and the customer service is amazingly prompt, friendly and helpful with any issues or questions."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "tobias bengtsen",
          "Nb_Reviews": 4,
          "Date": "2022-03-19T19:45:19.000Z",
          "Titre": "FocusMe is a wonderful app to block…",
          "Contenu": "FocusMe is a wonderful app to block unwanted apps, websites, and search words on google.com. FocusMe has helped me enormously throughout the years. FocusMe helps me focus (hence the name) on what is important for me. The software has a ton of features and settings to customize the user experience. I can highly recommend FocusMe. There is also a version for android. FocusMe is in a constant development process, so new features and new versions are being released regularly. If you have an addiction or problems with overuse of social media, FocusMe is a must have for you"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Chris Clarke",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T07:55:28.000Z",
          "Titre": "Excellent software, outstanding support",
          "Contenu": "I've been using focusme for around 3 years now and honestly it's been the best investment both in terms of productivity, and just having a healthier amount of screen time. The software is really flexible, allowing you to set various lists of apps or websites to block, and for specific durations, times of day etc. I've had a couple minor issues with device activation in the past, but their support team has always been incredibly helpful and quick to resolve. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Gill",
          "Nb_Reviews": 12,
          "Date": "2023-09-08T15:56:04.000Z",
          "Titre": "Training my discipline day by day",
          "Contenu": "I have just started with this app a week ago and wow- I thought 'I don't need one of those - I'll manage my own discipline' but no- I 'did' need help. There are times when the sensible part of my brain has great intentions, followed by the obsessive compulsive part of my brain changing the intention - for those times - this app works for me 100%.  I set an intention - literally set it in FocusMe... and I then have to follow through. Once you set the app on force mode, you cannot stop it. This feature is so good for me because I 'would' turn it off otherwise. I just wish there was an app like this for my diet, my budget, my whole life lol...But overall- it 'is' training my discipline muscles too - so I think it really will help me all round. I love it"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Phil",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T11:21:06.000Z",
          "Titre": "Works great as stated",
          "Contenu": "The product works very well with many different options and limits to help allow better focus on the things that matter. Great product and works as stated."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Luke",
          "Nb_Reviews": 5,
          "Date": "2023-05-13T10:05:30.000Z",
          "Titre": "Most apps have loopholes but Focusme is different...",
          "Contenu": "I have tried many apps to help with digital distractions, but I always find loopholes. FocusMe is the one app that I just can't get around. After a few months of using it, I found the \"Emergency Stop\" feature. Essentially, you have to email the support team for a code. I was a bit worried because suddenly it seemed easy to stop strict blocks. However, the team offered to add a time delay for any future \"emergency stop\" requests, which I set to three days, more than enough time for willpower to kick in. It works with most browsers, but there are a bunch of niche productivity browsers that are not natively supported. Luckily, you can add these to the Application block list to avoid getting sneaky. Overall, I'm very happy with the app and it's well worth the monthly subscription fee. If you are serious about cutting out digital distractions, FocusMe is the only real choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Joseph",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T07:38:47.000Z",
          "Titre": "Focus Me is an amazing company with a great product",
          "Contenu": "Excellent company and service. I've been a customer for five years and their product has helped me stay focused and kept me off distracting sites. Their customer service is excellent as well."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Syed Hashir Sarfaraz",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T19:42:27.000Z",
          "Titre": "The reps are always helpful and ensure…",
          "Contenu": "The reps are always helpful and ensure the problem gets resolved. Hats off!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Flynn",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T00:38:09.000Z",
          "Titre": "The only tool that I've found that ACTUALLY WORKS",
          "Contenu": "This is the only tool that I've found that can effectively block sites and keep me from visiting the distracting and unproductive parts of the internet. I highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Gabriele",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T14:07:26.000Z",
          "Titre": "this is by far the most effective tool…",
          "Contenu": "this is by far the most effective tool to help you overcome any internet addictions.. if you struggle with your screen that steal you a lot of time and energy, then you can use focusme.   it is clear, understandable, easy to use, and very very effective.. also the help center is always available, and really really nice..  take your power back, internet is full of attention and energy stealer.. use this tool!! thanks thanks thanks"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Yochi H",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T22:32:54.000Z",
          "Titre": "Never been disappointed",
          "Contenu": "Never been disappointed. Has saved me many hours of time. Can be a little technical (such as I am unsure if I can block URL's containing a specific word?). Overall, definitely the best software for limiting the internet out there. Highly customisable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Casper Kleczek",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T00:43:16.000Z",
          "Titre": "great product and top class service",
          "Contenu": "Focusme is a great product that gets the job done but more importantly their service is top class. I have been in communication with their support team many times and they always answer quickly and provide top notch assistance. Lorenz has helped me many times, he is a 10/10. Ryan and others are very good as well.For the price they charge it is easily worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Any Name",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T13:15:40.000Z",
          "Titre": "Give FocusMe a Try - It worked for me",
          "Contenu": "Whether you problem is getting distracted by social media or being a bit of a workaholic, FocusME will improve you productivity and your health.This app helps me take care of myself. When I am working, I forget to take breaks. Sometimes I do not even have lunch. Ryan and I had a virtual meeting. He helped me get the settings right so that my computer would not let me work once it was break time. This has made a huge difference in my health - especially my lower back which needs a break from sitting in the chair. The support team is wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Burciaga",
          "Nb_Reviews": 2,
          "Date": "2022-05-13T03:30:53.000Z",
          "Titre": "Sometimes you need an external restraint",
          "Contenu": "This is the best app blocker I know about. Willpower and resolutions only go so far. Sometimes you need an external restraint to make the right choice. FocusMe is worth far more than its price. It's easy to use and it will prevent you from wasting hours of your life on unproductive tasks.I've been using it since 2015 and plan to use it for the foreseeable future."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Hà Nguyễn",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T15:38:00.000Z",
          "Titre": "A must-have product",
          "Contenu": "Thanks to Focus Me, I'm able to focus on things that are genuinely important to me. The team are also very helpful and responsive. I would say this is a must-have product living in a distracted world."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Zohar",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T17:14:02.000Z",
          "Titre": "Time and tide wait for none& what FocusMe means to me",
          "Contenu": "I agree, all apps have their issues, none is perfect. The only way we can get close to perfection is by constantly evolving from feedback. FocusMe has done what it claims,-ME-I, AM FOCUSED. The incredible customer service, the energy and passion they put into their growth is phenomenal.I wish them all the best, and I WILL BE FOREVER be your client and so will a few of my friends!!FocusMe -healthy mind, liberation from addiction, social media and Junk!!“Regret for wasted time is more wasted time ”― Mason CooleyDO NOT WASTE TIME BUY FOCUSME(Not a sponsored review)"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Nicolás Moya",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:14:00.000Z",
          "Titre": "Really amazing customer service",
          "Contenu": "As usual the team is very supportive and kind, they always solve everything"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "noah munro-kagan",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T13:21:48.000Z",
          "Titre": "Fantastic Tech Support by Ryan",
          "Contenu": "Was helped by a staff member named Ryan and he was just fantastic. I messaged in the live chat and had left the chat afterward forgetting about my question, but I was emailed immediately regarding the contents of my issue. Focus me support is unbelievable, this is the second time I've reviewed help from them, and it's fast and very extensive as always. Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Dominik Schmid",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T17:32:31.000Z",
          "Titre": "Best blocking software",
          "Contenu": "This software (for Windows) is the one and only I've came accross that is able to block ANY program and ANY website or expressions within an URL that I want to be blocked. Furthermore it is virtually impossible to bybass or kill this program - even if you are an administrator! It is by far the most comprehensive blocking software that exists - I've purchased and testet several ones."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Naveh",
          "Nb_Reviews": 1,
          "Date": "2021-06-12T03:30:39.000Z",
          "Titre": "Procreations Killer",
          "Contenu": "I waited to have the full experience before giving my review. I am using the program more than 2 months, and I recommend it for everyone that have problems with procreations. It help me to restrain my \"monkey mind\", and they have \"forced\" mode which blocking you from changing the settings you did (amazing!).moreover, their customer support is great. they answer quickly. when I had an issue with the program, 2 days later they issued update to the program and fixed it.Happy that I found this program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick G",
          "Nb_Reviews": 3,
          "Date": "2023-01-16T22:48:59.000Z",
          "Titre": "Extremely powerful and useful tool",
          "Contenu": "Extremely powerful and useful tool for productivity.  Helps me block websites that are built to be a time-suck like Facebook or Youtube, especially while I don't want to browse while I am working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T02:10:21.000Z",
          "Titre": "Helps keep you focused on whatever goal…",
          "Contenu": "Helps keep you focused on whatever goal you have set, whether its taking classes in college or just reducing the amount of time wasted on social media. The app is simple to use and easy to understand. It really is life changing!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Corey Giles",
          "Nb_Reviews": 3,
          "Date": "2022-09-11T16:07:48.000Z",
          "Titre": "Consistently helpful, thorough, & effective productivity aid and content blocker.",
          "Contenu": "I've been using FocusMe for several years now and it is truly one of the best apps for what it claims to do: Helping to block unwated content/sites and schedulng/controlling internet usage to help you be more productive and above reproach on your device. It is amazing at all of these things.They've thought of everything when it comes to their settings. Any way that a sneaky brain could think of getting around Focusme in a moment of weakness: disabling it, using another user account, incognito, etc... the people at FocusMe have thought of it and have added a setting to intercept that workaround. Secondly, the times that I have had tech issues or questions, the customer support has always been incredibly good, patient, clear, and helpful. I'm very grateful for FocusMe and I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Tranberg",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T15:19:36.000Z",
          "Titre": "Customer Service that actually solved my problem",
          "Contenu": "I got a couple 3 year subscriptions for 2 devices - big fan. I was running into a payment error and customer service resolved the issue *very* quickly. Ryan went above and beyond and even offered to send me the activation keys over chat. I didn't have to hope and wait for an email with the codes after the chat finished. I got them right then, right there. Problem solved."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Theresa P.",
          "Nb_Reviews": 3,
          "Date": "2021-09-27T13:36:15.000Z",
          "Titre": "I use this app for my 2 kids",
          "Contenu": "I use this app for my 2 kids, one in high school and the other in grade school. It's used for both their gaming PC and phones so I can rest assured that they are paying attention to school when they need to and are sleeping online. This also enables me to have their PCs inside their bedrooms but still have some peace of mind.I only purchased after running the free trial on this app and all the other mainstream ones. But decided on this one because it was the few that lets me target specific websites and apps all the while having flexible schedules and different ways to manage the restrictions. The pricing is excellent for what you get, one of the best out there and support is superb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolina Munoz",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T15:19:53.000Z",
          "Titre": "Excellent app",
          "Contenu": "Excellent app, we got it to help our son concentrating when we saw his grades slipping for all the online distractions, we made a schedule with him and he is able to focus much better! I love the fact it cannot be changed, he tried to hack it at first lol"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carmelo",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T12:25:15.000Z",
          "Titre": "Excellent customer support and product",
          "Contenu": "Excellent customer support. I found the anwers very thorough and detailed and my questions were answered within a day.Very useful product to manage your time effectively. I use this product daily in different platforms to avoid spending too much time on unproductive websites or with unproductive applications. It also provides tools to prevent yourself from self-sabotaging your time by disabling the product which I find very useful. I would like to see more improvements on the Android version of the product as I believe is not at the same level as the Windows and MacOS versions."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Manu Dubey",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T08:15:06.000Z",
          "Titre": "The app is an absolute beast and is one…",
          "Contenu": "The app is an absolute beast and is one of the best blockers out there, I had a terrific experience with the product as well as the online support team, everyone was humble and caring. The team is ready to assist always, I really appreciate the gesture of the team when they extended my trial so I could have some more time when I needed it. Also got a nice discount on first purchase, Really happy with the product as well as service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rav",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T14:43:44.000Z",
          "Titre": "This is a life saver!!",
          "Contenu": "I don't usually write reviews but for this I have to. I've been using this for 3 years and its the best bit of software out there. Its helped me to manage my digital world addiction and has made me productive in other areas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T20:34:59.000Z",
          "Titre": "This software is a Godsend",
          "Contenu": "The software has been a Godsend for me over the years. I was an early adopter and I still rely on it every day while working at home. I can control almost every aspect of my computer usage so it has been a great help in keeping me on the right track while working. I plan on using it for my boys as well when they're old enough to use a computer."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Y",
          "Nb_Reviews": 4,
          "Date": "2021-11-06T14:16:34.000Z",
          "Titre": "Highly recommended",
          "Contenu": "This is by far the most versatile, fully-featured and robust blocking software, and I tried most of them. You can make the rules as simple or as complicated as you want.I don't often leave reviews, but FocusMe's customer support have gone above and beyond to resolve a few issues I had and even implemented a new feature request and they deserve all the business they get."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Dean",
          "Nb_Reviews": 6,
          "Date": "2021-12-14T18:53:23.000Z",
          "Titre": "Helped me break habits",
          "Contenu": "I've been a FocusMe user for a few years now, and can safely say that it played a big part in me breaking the habits I wanted to. I now use less social media and have managed to keep distracting tools & websites at bay until set times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Verisimlitudesque",
          "Nb_Reviews": 1,
          "Date": "2022-06-18T17:44:55.000Z",
          "Titre": "Focus me has been a god send",
          "Contenu": "Focus me has been a god send. As someone with compulsion issues, this program has helped me focus and prevented me from giving into so many time wasters. The fact that its difficult to remove helps even more."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Mahmoud",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T15:18:34.000Z",
          "Titre": "very good for managing your time and blocking distractions (Gaming, Social media, etc..)",
          "Contenu": "They are constantly updating the app (adding new features and fixing bugs).Their customer support are very helpful and friendly.The app is very good at blocking distractions and really helped me with my studying."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sahil Bagdi",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T12:34:09.000Z",
          "Titre": "I am a valorant player.",
          "Contenu": "I am a valorant player.I used to play a lot but then one day FocusMe came out of no where and saved me from becoming a addict.Ohh Actually I became an addict then I paid and downloaded FocusMe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 17,
          "Date": "2022-02-10T02:08:41.000Z",
          "Titre": "A Focus App with More Options and Less Loopholes",
          "Contenu": "FocusMe is a fantastic program that keeps even the most tech-savvy people productive. I have had trouble keeping myself accountable for the hours I have wasted on my computer. I had tried other focus apps before but tended to find loopholes to exploit and disliked their singled-minded approach (usually, the only options are to block or not block websites/applications). FocusMe fixes many of these issues, with other options, like time limits and breaks. I have yet to bypass the program and only occasionally found bugs. FocusMe fixes them quickly or provides me with alternative actions.The interface, at times, can be a little confusing, and some of the functions I never use. However, FocusMe has been very actively pushing to improve the program.Overall, I am pleased with FocusMe. It has effectively forced me to start doing more productive things with my time!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "SVS",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T14:59:09.000Z",
          "Titre": "Sometimes your own focus is sufficient…",
          "Contenu": "Sometimes your own focus is sufficient to get the work done. At other times, a helping hand is needed. For me, I rely on FocusMe when I need a helping hand in upholding my attention. It works - and when it doesn't, the helpdesk makes it work quickly and efficiently."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "K Bulgakov",
          "Nb_Reviews": 6,
          "Date": "2022-05-27T13:23:00.000Z",
          "Titre": "This is one of the best companies that…",
          "Contenu": "This is one of the best companies existed right now and let me tell you why: 1). They focus everything on support. Try their support, it's always there. They care and provide solutions. 2). Free 30 day trial, not asking for a credit card! 3). The product does wonders, it works flawlessly and it can act like your higher self, keeping you Focused. 4). The price is extremely undervalued. You pay for a year what you pay for a month on Netflix! And try considering the value each has on your life and future. I would easily pay 5-10 dollars/month for this. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Graham Line",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T14:00:51.000Z",
          "Titre": "the online helper spent hours with me…",
          "Contenu": "the online helper spent hours with me trying o explain the installatio. a couple of issues with tht androoid,, i think the signposting on the website culd save more time"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ricky",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T18:27:30.000Z",
          "Titre": "One of the best apps to heal you from digital addictions.",
          "Contenu": "Hi,I tried freedom.to, and other free website extensions like blocksite, etc. But I never succeeded because I always gave in to the strong urges. I always found a way to deactivate the software and relapsed countless times. But my whole perspective towards digital addictions changed when I tried FocusMe. It's an extremely powerful and intelligent tool. You just can't cheat this software. Once installed and activated, this software will act like a strict teacher that will go above and beyond to fix you. P.S. - I would recommend using Mindfulness techniques along with this app. Don't completely rely on the software. This is because once that strong urge comes back, your mind will go extremely crazy. In that particular moment, you need some techniques to calm yourself down, and mindfulness will help you in that situation. Also, you can make this app Super Strict if you want. Check its advanced settings and enable the features accordingly to your needs. This app has saved my life and I will recommend it to all those people who are infected by Digital Distraction."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-09-10T02:23:28.000Z",
          "Titre": "FocusMe is the best tool for managing…",
          "Contenu": "FocusMe is the best tool for managing self-sabotaging procrastinative behaviour!I have a tendency to get distracted and FocusMe helps prevent that. During moments of mental clarity I will set up a Forced plan to prevent access to websites. By the time, I am tempted, my computer has been secured by FocusMe and prevents access so I can focus on my job & work from home.I've been using this service for 2 years and I highly recommend it to friends & family.Also, in case you do lock yourself out as I did recently, the Customer service & support is excellent!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Cristina",
          "Nb_Reviews": 2,
          "Date": "2021-08-22T11:51:20.000Z",
          "Titre": "Help got to me fast when I needed it",
          "Contenu": "I was having technical issues over the weekend and the support team reacted very fast to my issue and contacted me directly. FocusMe has been my saviour from distraction but also from things that drain my energy. A great tool for productivity but also for well-being!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anna",
          "Nb_Reviews": 2,
          "Date": "2022-03-13T17:27:43.000Z",
          "Titre": "Great useful program that blocked all…",
          "Contenu": "Great useful program that blocked all distractions as I was writing my dissertation, my journal article and applying for jobs. It's super effective at keeping me focused, takes a little bit of time to set up preferences, but it's very simple and user friendly. Cannot recommend it enough, 100% worth the annual fee."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Angelique Potter",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T05:16:11.000Z",
          "Titre": "I came across this site on Google and…",
          "Contenu": "I came across this site on Google and the service fees are less than other sites such as Freedom and Barke. What I like most about FocusMe is that my daughter cannot uninstall it which is a problem I've had with other sites. I am very impressed and will recommend you to others. And the staff are very friendly and so helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Corey Giles",
          "Nb_Reviews": 3,
          "Date": "2022-03-25T19:01:04.000Z",
          "Titre": "Louie Lorenz was such a great help this…",
          "Contenu": "Louie Lorenz was such a great help this morning as I was trying to resolve an annoying technical difficulty I was having. He was patient, kind, knowledgeable, and prompt. Two thumbs up for Louie Lorenz!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Thor- Eivind C. Flakstad",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T14:44:39.000Z",
          "Titre": "24 hour clock within hours",
          "Contenu": "I was in a need for a 24clock in the Windows app as I have never used AM/PM. Within hours of my request it was integrated and a new version of the software was released. Never experienced such a good costumer service delivered so fast!"
        },
        {
          "Note": 5,
          "Lieu": "NI",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T16:59:31.000Z",
          "Titre": "Great",
          "Contenu": "Great, i'm from Nicaragua, Central America. I know about fous reading a book. It's great, I can focus in one activity, one by one without procrastination. Tks"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Acyuta Arjunasakha Das",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T12:52:06.000Z",
          "Titre": "Does the job, saves your time and protects you from distraction.",
          "Contenu": "It helps me to remain protected from my dark deep distractions. It helps me to come out of entanglements and unlock my true potential and purpose. Just like a stomach disease gets cured when we don't eat anything, similarly, using this wonderful tool I starved my distractions and regained my original happy state of focused existence."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ed Scott",
          "Nb_Reviews": 6,
          "Date": "2021-05-31T15:14:42.000Z",
          "Titre": "Essential Software",
          "Contenu": "I find FocusMe is a totally essential tool for helping to keep my screen time on track. Being able to limit screen time and stay distraction free has had a really positive impact on my concentration, productivity and mental wellbeing all round.I've used FocusMe for a couple of years now - it is the best Windows tool for this I've come across and it has continued to function well through innumerable Windows updates. I contacted the customer service at today following a minor glitch and the person I spoke to was really helpful and friendly - and we got the issue resolved in really good time. It's definitely worth it - 100% recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T04:33:15.000Z",
          "Titre": "Prompt response",
          "Contenu": "I appreciate the prompt response.  It's nice that there are still tech companies that will provide phone and zoom support rather than just chat. The rep was able to quickly solve my problem, was polite, and listened."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Johnny Sins",
          "Nb_Reviews": 14,
          "Date": "2023-02-25T14:19:12.000Z",
          "Titre": "Where do I start..",
          "Contenu": "Where do I start... I use FocusMe now for 6 months... And I was looking for a mobile equivalent of another blocker I had installed on my computer. I can tell that FocusMe is very bulletproof. Tampering with the settings becomes impossible when a block is active. Screens will close when you try to enter a blocked application or website.There is just no one coming close to FocusMe in turns of smartphone blockers on Android or iOS. Not one being so user friendly and tamper safe. And the best thing of it all I have to mention yet. Ive had a bug (but it was due to my own doing, it had nothing to do with the app). And the support team immediately helped me through their chat. And when I disconnected from chat, they made sure to follow up on mail and helped me to solve the issue I had eventually.5 star app in terms of software and support. 😀"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Benyamin",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T14:41:31.000Z",
          "Titre": "Started using FocusMe six years ago. I continue to rely on it heavily.",
          "Contenu": "I have been using FocusMe software on all my PCs and phones since 2017 (over six years). I have a paid license.  I don't often write reviews for software, however in this case I would really like to commend the developers of FocusMe.  As someone who spends more than 8 hours a day at a computer, it is easy to let it take over your life, even to the point where I found myself watching, chatting and posting even when I didn't particularly want to.  I wanted to take control of my time, and FocusMe was a really good solution. FocusMe differed from other products because it handled the entire scope of the problem: 1) lock out specific programs, websites, and social media from my kids, 2) lock out some of the same stuff from me, 3) not interfere with special internet use (like GitHub, or work related youtube), and 4) to provide a range of solutions for partial lockout, by time, location, overall usage, multiple password schemes, etc.  And lastly, they do a really good job protecting the software from anyone who might trying to hack around it, including myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Thevan",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T20:32:33.000Z",
          "Titre": "Solid Application for Blocking",
          "Contenu": "A very solid app. Customer support is very quick to respond. I highly recommend this app versus other blockers that I have tried in the past. Have been a 2 year customer and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Prof. Dr. Customer the VI",
          "Nb_Reviews": 1,
          "Date": "2021-06-06T11:30:31.000Z",
          "Titre": "Pretty good idea",
          "Contenu": "Pretty good idea, changed a lot for me.Instead of spending 4-6 hours on youtube and Co. I now spend 4-6 hours on studying, doing sport, reading, yoga, meditating .... and and and. A pretty huge Game Changer, tho pretty insane I need that in this society to not be depressed and consume all the time.I would love to have more options in this programm. And of course I would love for it to be available on linux soon. The only bad thing is that Operating systems like mac or linux will always have a lot of ways to disable the app.It's just hard to take the control from an admin.But for everyone thinking about getting this programm ... do it !!! It will change your life ! ( not an exaggeration )"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefan S.",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T17:13:55.000Z",
          "Titre": "Very Useful Program and Excellent Customer Service",
          "Contenu": "I have been using FocusMe at work for several years to limit computer procrastination.  It is very effective in doing that.  The program has also saved me money by allowing me to limit the time spent on certain large shopping sites.  Having used the program for a long time, I have also come to appreciate the responsiveness of the FocusMe customer support. They are quick to respond, but above all helpful. They have helped me many times with technical issues, and the tech team even implemented several new features I had suggested/requested."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Rascoe",
          "Nb_Reviews": 2,
          "Date": "2021-09-27T13:50:05.000Z",
          "Titre": "The only way I get anything done",
          "Contenu": "This is the best blocking app I have EVER used.  The customer support is insane.  And the app gets updates all the time.  I also love the different settings and amount of customization.   My productivity would be in the shitter without it.  LOVE this app."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Mike Ahlert",
          "Nb_Reviews": 3,
          "Date": "2022-04-08T13:16:34.000Z",
          "Titre": "Keeps you focused! Amazing support",
          "Contenu": "Very effective app that helps to keep me focused on the important things! It's extremely hard to circumvent it, which helps enormously with follow-through.The FocusMe-team is amazing, constructive and supportive. I suggested a feature several years ago and the founder reached out to me personally to inform me that it was implemented some time later."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Javier Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T20:44:24.000Z",
          "Titre": "Had a rocky start but we got the ball rolling",
          "Contenu": "After a shaky start with a less than intuitive set-up wizard and even going as far as asking for a refund, the FocusMe team reached out to me and offered me a complimentary set-up call. That's not something that you get everyday. The level of attention was fantastic and Ryan had me up and running in 10-15 minutes and we realized that I had selected an option that was mucking up the way I wanted the software to run.Again, this is due to what I consider a somewhat unintuitive set-up wizard, but after we got the proper settings in place this runs like a dream and has dramatically increased my productivity since I'm so easily distracted even by Wikipedia!Thank you Ryan and the support team at FocusMe!"
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "Andrea Gallegos Vilema",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T15:43:07.000Z",
          "Titre": "My best investment on me with Focus.me",
          "Contenu": "Truly, focus.me has made a significant difference in both my work and personal life. I consider this tool one of the best investments I've made to date. Thanks to its usage, I was able to complete substantial projects at work, elevating my efficiency to levels I'd never reached before.In the past, I was easily distracted by reading or watching anime, and it wasn't easy to resist the temptation. However, focus.me has entirely changed the landscape. With its smart technology, my screen shuts off automatically, eliminating the need for conscious effort to avoid distractions. It is a definitive solution for any individual or company looking to increase their productivity.I cannot overlook their exceptional customer service. In my experience, the communication was seamless and I received assistance in less than an hour. They truly are an incredible team offering constant support.My heartfelt thanks to focus.me for its existence. With great anticipation, I hope they continue to expand and provide us with their invaluable support for much more time. Keep up the excellent work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T20:48:05.000Z",
          "Titre": "Indispensable! Trouble adjusting plans.",
          "Contenu": "I did have some problems when I first started using FocuseMe but have sense worked with their customer support team to fix them. I am very satisfied with both the product and their customer support."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Chimku",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T19:30:37.000Z",
          "Titre": "Best! Best! Best",
          "Contenu": "I completed my one year with Focusme Today and I Can't express my thanks to this application, i have saved my hours daily and have achieved my year-long goals successfully. The support is Amazing and friendly and never disappointed, i will be repurchasing it and this program will stay forever with me to maintain discipline at every moment of my life!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Alan C",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T18:06:16.000Z",
          "Titre": "Excellently designed app",
          "Contenu": "Great app, i really appreciate the level of customization like disabling the ability to uninstall or close using task manager. This is an example of great software design. Good job"
        }
      ]
    }
  ]
}