{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "fontba.se",
      "Review": [
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "MBatthias Blonski",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:03:49.000Z",
          "Titre": "Awful experience all around",
          "Contenu": "Awful experience all around, cannot get any of the \"features\" to work, and even signing into the account is impossible, my password is constantly wrong even after resetting it, cannot sync anything across and computers, waste of money."
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Kovacs Apor",
          "Nb_Reviews": 3,
          "Date": "2022-07-04T12:23:57.000Z",
          "Titre": "Not cloud based",
          "Contenu": "I subscribed for it, because I thought that it is a cloud based software so if I make my own library and I change my PC everything remains there, bit no...you have to install again and activate the fonts. The software needs to be opened always to sync with adobe softwares...I think not better then installing the fonts in control panel..."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Albert Vidal",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T09:16:17.000Z",
          "Titre": "I sent an email recently as I realised…",
          "Contenu": "I sent an email recently as I realised an automatic renewal had been made. It demanded a refund for that cause, and it was sent the same day of that renewal. No answer so far."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T05:48:30.000Z",
          "Titre": "longer notice period for renewal",
          "Contenu": "Most subscription services give customers a 30day window to renew a subscription, not FontBase 72 hours. when it comes to money don't bully customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bridgett M Denney",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T04:08:18.000Z",
          "Titre": "I still can't use it and I've ask to…",
          "Contenu": "I still can't use it and I've ask to unsubscribe and I'm still being charged."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grey Montagne",
          "Nb_Reviews": 4,
          "Date": "2023-05-24T16:37:50.000Z",
          "Titre": "Customer service: bad; Software: meh",
          "Contenu": "Update: It is funny to me that FontBase reacted to this review within less than 24 hours.When I purchased the software, the information was that credentials for account login would be sent immediately after purchase. No credentials came, I obviously checked spam, etc. After a few hours I e-mailed them on the same day asking for my credentials. As it was a Friday I figured maybe an answer would come on Monday. No answer. I then e-mailed them two more times over the course of a week. No answer, no credentials.In the meantime I had figured out that I could reset the account password as they had apparently used my purchase e-mail to create the account. But when they chose not to answer my queries at all and I realised that the product wasn't good anyway, I asked for a refund. And lo and behold, within less than 24 hours I get a refund - the refund confirmation comes in form of an answer showing all my messages to them, in which I ask them for the credentials. So they saw all my e-mails!So: I get a quick refund, I get a quick response to this review. Obviously they are reading their messages - why would they choose not to answer my simple request and send me the promised login credentials after purchase? ---From product to customer service: nothing is great about FontBase.I did not receive customer support.The software is not intuitive to the point of being unpractical. The subscriber version is no better. For beginners and pros there are better alternatives out there.FontBase also installs a ton of junk protocols and files on the Mac. For example an incoming connection allowing to bypass your firewall. That's absolutely not necessary for this kind of software; and it's either just bad coding or super-dodgy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christian Storm",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T23:15:54.000Z",
          "Titre": "Your automatic enrollment is a dark…",
          "Contenu": "Your automatic enrollment is a dark pattern. Thanks but no thanks. Also, it works poorly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Voigts",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T15:08:48.000Z",
          "Titre": "I have no idea what you provide me",
          "Contenu": "I have no idea what you provide me.  I have tried to stop the auto payments but no able to do so yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Bilinski Shain",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T01:24:11.000Z",
          "Titre": "It's not working for me",
          "Contenu": "It's not working for me. I asked for help a few days ago but haven't heard back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Selena Malott",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T22:46:51.000Z",
          "Titre": "Issue was not resolved."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Edward Lipsett",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T04:12:48.000Z",
          "Titre": "Unstable but usually functional",
          "Contenu": "MacOS 10.15.7 with Adobe CC. Font activations do not work reliably. Sometimea a font refuses to activate from the FB menu, often a font in an InD document will not activatate automatically, and eery time I have a font activated in one InD document, close it, and try to print the book file to PDF, the font has been deactivated. That means I have to generate the book PDF with the doc files open."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Liam Owen",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T13:45:14.000Z",
          "Titre": "Can't use the paid-for premium version of the software because customer service won't reply.",
          "Contenu": "The software was a much better option that the native Windows font manager, so I decided to upgrade.I realised that the e-mail I used wasn't currently working, so I resolved the issue and then contacted Font Base to get my login details (as the reset password links never work). I haven't heard anything back after 2 e-mails in 3 days.Right now it seems that I have purchased something which I am unable to use until I get a response from them."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Urly",
          "Nb_Reviews": 3,
          "Date": "2023-01-11T14:43:28.000Z",
          "Titre": "This is a very poor app",
          "Contenu": "This is a very poor app, unintuitive interface, limited options, no way to manage system fonts, and asking me to pay for a monthly subscription every time I open the app? I can't even test the so called 'awesome' options so I have no idea what they are.The free version doesn't feel trustworthy enough to throw money at.I wish there would be robust apps for font management like we had with Suitcase or even Fontexplorer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T15:22:08.000Z",
          "Titre": "The app is beautiful, but...",
          "Contenu": "The app is beautiful, but unfortunately has never worked correctly or consistently for me (macOS Monterey, M1 Max MBP). Clicking the icon in the dock does nothing. Clicking the icon in the menu bar opens the interface window, but then closing the window deactivates all fonts until I open the window again. I'd be happy to revisit the app once these bugs are sorted out."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Damien Toll",
          "Nb_Reviews": 4,
          "Date": "2022-09-28T03:29:39.000Z",
          "Titre": "Basic, problematic but still good",
          "Contenu": "I pay monthly for FontBase and it still launches a dialogue box asking me to get the full experience by paying for it and I'm already logged in. Fonts disappear out of Collections. It often displays crossed out boxes of legit fonts. It doesn't automatically load fonts in my Adobe CC like it proports to do. Can't export your set up across two computers. Have to reset your Collections. Having said all that, it is cheap and you can sort fonts quickly and activation is very fast"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beth Burrell",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T19:01:05.000Z",
          "Titre": "I came from the \"Other\" font management…",
          "Contenu": "I came from the \"Other\" font management software that I had been using for years. However, it was time for a switch. So, I found FontBase through a Google search for comparable font management systems. As simple as the interface is, I still find it confusing to use. Sometimes it feels like just a shell, and I'm waiting for the full functionality to kick in. It would be awesome if Adobe fonts were able to be integrated and listed under providers like Google fonts are. I do like the fun messages at startup and feel this interface has a ton of potential."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie S",
          "Nb_Reviews": 2,
          "Date": "2021-08-26T17:36:05.000Z",
          "Titre": "I detest the SaaS business model",
          "Contenu": "I detest the SaaS business model. Yet another yearly payment my one-person design studio has to keep up with.I also realized after purchase that I can no longer use any of my legacy Type 1 fonts, so that's been a fun challenge!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Angus",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T15:48:45.000Z",
          "Titre": "Difficult to understand how to use app.",
          "Contenu": "Difficult to understand how to use app.App doesn't play well with others.App won't integrate with the likes of Inkscape or Gimp.When enabled my system bogs down to unusable.My system is runs:I7 - 260016 GB ram"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Monica Martinez",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T17:49:07.000Z",
          "Titre": "- Opening a document takes too long",
          "Contenu": "- Opening a document takes too long, not sure if FontBase is conflicting with Adobe's cloud.- I Illustrator, if an open document uses a font, text with that font is pasted onto a second, then the first document is closed, the font is deactivated in the second document."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Mariella Mayr",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T10:34:31.000Z",
          "Titre": "The account is not synchronized",
          "Contenu": "The account is not synchronized, so if I work on multiple devices I have to upload all fonts again"
        },
        {
          "Note": 2,
          "Lieu": "BD",
          "Pseudo": "Mrh Raju",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T14:23:02.000Z",
          "Titre": "Issue with Font Compatibility in Figma with Windows 11 Pro",
          "Contenu": "First and foremost, I want to express my appreciation for the excellent services FontBase provides. As a satisfied customer, I have been using your font management software for a while now and have found it to be reliable and user-friendly.However, recently I have encountered an unexpected problem. While the fonts activated through FontBase work perfectly fine on my Windows 10 Pro operating system, they do not appear to function correctly within Figma. When attempting to utilize the activated fonts in Figma, they do not show up in the font selection menu, preventing me from using them for my design projects.I have taken the following troubleshooting steps in an attempt to resolve this issue:Restarted both FontBase and Figma to ensure all processes are refreshed.Verified that the fonts are activated and working correctly in other applications, including other design software.Checked for any pending updates for both FontBase and Figma and made sure they are running the latest versions.Confirmed that Figma is able to access and utilize other fonts installed on my system, indicating that the issue is specific to FontBase fonts.Despite these efforts, the fonts still do not show up within Figma. As Figma is an essential tool for my design workflow, it is crucial for me to have seamless integration with FontBase to maintain consistency and productivity.I kindly request your assistance in resolving this matter. It would be greatly appreciated if you could provide guidance on any potential solutions or workarounds to enable FontBase fonts to function correctly within Figma. Additionally, if there are any known compatibility issues between FontBase and Figma, I would be grateful for any information or updates on this matter.Please let me know if you require any further information or if there is any additional troubleshooting I can attempt on my end to assist with the resolution process.Thank you for your prompt attention to this matter. I look forward to your response and a swift resolution to the font compatibility issue between FontBase and Figma.Best regards,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PRL-USA",
          "Nb_Reviews": 2,
          "Date": "2021-11-04T22:52:29.000Z",
          "Titre": "Seems to run very slow at times when…",
          "Contenu": "Seems to run very slow at times when activating and deactivating fonts"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "John Glenn",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:41:12.000Z",
          "Titre": "Subscription Problem is spoiling the fun",
          "Contenu": "I am having problems with my subscription. I paid for a one-year subscription I cannot use!! I sent an email today and still no response."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "DAVID AMIEL",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T17:58:52.000Z",
          "Titre": "Like don't Like",
          "Contenu": "I don't like :I would like to have the classification of families (moderm, Garaldes slab etc) apart from the tagsSome tags are already assigned I would like to be able to change themI can't export the preview to PDF to compare itI like : good value for money, has a future"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Damien Toll",
          "Nb_Reviews": 4,
          "Date": "2023-10-29T09:11:42.000Z",
          "Titre": "Fonts supposed to automatically launch…",
          "Contenu": "Fonts supposed to automatically launch with the Adobe CC suite which rarely works and although I pay for a subscription a pop up appears on launch telling me of the great services available if I subscribe"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Daniel Becker",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T13:22:21.000Z",
          "Titre": "Useful but with potential for improvement.",
          "Contenu": "Fontbase is a really useful font manager. However, some shortcomings become apparent in extended use: if, for example, a local folder is linked with fonts, all the fonts stored there are copied to the Fontbase system folder. Live use of the local folder is therefore not possible, and double storage space is used. In addition, Fontbase currently only allows Google as a font provider, which considerably reduces the scope of services. Last but not least, the subscription model is recommended even if you are already a paying customer, which is an absolute no-go for me personally."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Samuel",
          "Nb_Reviews": 2,
          "Date": "2021-11-27T20:22:16.000Z",
          "Titre": "Great app which needs some fixes",
          "Contenu": "Great app which needs some fixesFontBase is a great app that works on Mac and Windows which is amazing. Sadly the sorting by styles like italic, serif or sans does not really work, it recognizes almost non of my 10000+ Fonts correctly. The Interface feels a bit unintuitive, too. But overall a solid app that helps you to organize your fonts."
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Zsolt Popa",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T16:59:38.000Z",
          "Titre": "Good company slow support",
          "Contenu": "Been their paying customer since year one. During this time I needed support twice, and their reaction both times was disappointingly slow. The first time it was important to get an invoice with an updated VAT number, they responded in about 1 week, at that time it was already too late due to the tax deadline. The second time, their system messed up something, and even though I was paying, the software did not recognize me as a customer. I sent several emails (no reply), then on the 3rd day i was writing them on every available channel (twitter / facebook), then finally they responded. Took me real effort to get their attention.Again, great software, but support needs a huge update."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Maria Jose",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T21:01:05.000Z",
          "Titre": "Navigation is not great.",
          "Contenu": "Navigation is not great.Also, drag and drop does not work most of the time when I need to add new fonts to collections. I am happy with the fact that I can activate and deactivate fonts and once my collections are sorted, they make my work much easier. I just wish those bugs were sorted for it to be perfect."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "morillas brand design sl",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T20:13:11.000Z",
          "Titre": "Incompatibilities and more",
          "Contenu": "Incompatibility with PS files. I understand is an old format nonetheless it could be interesting that this files also works because we have thousands of fonts that right now we can't use.Also I've noticed that if we have repeated font files we use to get trouble with the auto-activation.Most times the font files appear ungrouped on Adobe Applications.When I click a fonts folder on the left column of Fontbase, is not practical that automatically it shows the sub-content folder, because then the column scroll down is too long and it's difficult to navigate for this section to find the folder that you are looking for.I've noticed that the app is slower nowthx"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Pitrell",
          "Nb_Reviews": 2,
          "Date": "2021-11-24T18:47:34.000Z",
          "Titre": "Unfortunately no alternative so far",
          "Contenu": "There are hardly any decent font management tools. In contrast, FontBase is clear, not perfect, but also not a waste product like the other tools on the market. However, at 180 Euros for the full version, it is priced rather unattractively. 30 Euro would have been fine. Therefore, I use it only out of necessity, not knowing an alternative.My answer to Fontbase: I am aware that developing good software costs money. I also like to do without further updates but not like to do without the functionality of the once purchased software. You, however, restore the functionality to that of the freeware version after the subscription expires. These are not fancy cloud-based service options but normal program parts. Then it is better to charge for the updates in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "PE",
          "Pseudo": "Carlo Portillo",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T14:44:49.000Z",
          "Titre": "Nice, but it would be nice if...",
          "Contenu": "I like the app, but there is a problem when sometimes fonts don't update automatically and restarting both Adobe and Fontbase are necesary.Adding an Auto optimizing Font Files would be nice, to have the chance to delete duplicated fonts.A Dynamic collection based on automatic added fonts should be a cool adition."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "morillas brand design sl",
          "Nb_Reviews": 2,
          "Date": "2022-11-28T16:00:43.000Z",
          "Titre": "Slow, trouble on auto-activate fonts and font formats",
          "Contenu": "The soft is so slow when I visualize the font folders.For example, seeing the subfolders in the first column won't be necessary. It would be nice to see all the fonts of the folder on the first column directly on the big left window, without opening vertically the subfolders on the first column. This takes a lot of time depending on the number of types that you have.On the other hand we still have trouble with the new processor on mac and fotbase, the only way to make it work is going to start icon of illustrator, for example, and mark the option open with Rosseta. If we don't do that the auto activate fonts doesn't work.On top of that it would be nice that the soft will accpet PostScript fonts, because we have a huge amount of types on that format and it's a pitty to loose them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Miguel Rivero",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T03:54:29.000Z",
          "Titre": "Fast product overall",
          "Contenu": "Fast product overall. Needs a better search engine though. The one that's currently in place lacks ease of use. It also doesn't help that there's not much documentation."
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "PCP",
          "Nb_Reviews": 5,
          "Date": "2023-02-04T02:26:50.000Z",
          "Titre": "Slow, unresponsive, and causes problems with my Adobe apps",
          "Contenu": "It's tough to find a decent free font manager for Mac. I'd hoped FontBase would be it, but apparently not. I started using it to save on load times and only use the fonts I needed but it just ended up causing more problems.For starters, there's an incredible lag on the program. I was trying to speed up the programs I need these fonts for by disabling the ones I don't need, but FontBase is just as slow to load, if not slower, than having all the fonts enabled at all times. And many times, fonts that I turned on in FontBase would not appear at all in Illustrator or InDesign, requiring several rounds of restarting those apps or deleting preference files. Since I stopped using FontBase, I've had zero problems loading these fonts.Being able to preview fonts and organize them is helpful when I'm trying to choose the right one for a project, but even using FontBase just for this purpose causes my entire system to lag. Overall, the few benefits this program has (font previewing, organization, free) aren't worth all the lost time in lag and performance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary-Lynne",
          "Nb_Reviews": 7,
          "Date": "2021-12-13T19:23:14.000Z",
          "Titre": "Love everything except loading brand…",
          "Contenu": "Love everything except loading brand new fonts in.   If I store them in my Fonts directory.  I doesn't \"see\" them.  I have to put them in a folder that contains nothing but active fonts and then add that folder.   Once that folder gets too big, I'll probably have to create another one and so on."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Radu Șovăilă",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T14:14:04.000Z",
          "Titre": "A good font manager",
          "Contenu": "A good font manager. There are some missing features, the most glaring being the absence of an easy way to collect fonts activated in FontBase and used in Adobe Illustrator/InDesign files."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Chua Kok Hai",
          "Nb_Reviews": 2,
          "Date": "2021-08-30T00:22:24.000Z",
          "Titre": "So far so good however Fontbase has…",
          "Contenu": "So far so good however Fontbase has taken over some of my system fonts and if it is not open, some of my web pages look funny plus some of my applications"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Chua Kok Hai",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T04:54:58.000Z",
          "Titre": "I think it will be good to have…",
          "Contenu": "I think it will be good to have features like if I close the app window, the app can still run in the background, as now when you close the app window it will just quit and have to relaunch it again."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T20:35:43.000Z",
          "Titre": "Overall I like FontBase but there are a…",
          "Contenu": "Overall I like FontBase but there are a few issues...1. Font don't always activated on when loading documents in programs like Photoshop where they have been used - this is inconvenient as we have to open FB and toggle them on to get them to work.2. Watch Folder Issue - Google Drive:If your FontBase root folder is on your Google Drive (for working with teams to sync collections), you CAN NOT create Watch Folders. This means you can’t watch your System fonts, OR, if you have your fonts organized outside the FontBase root and want to “Watch” those folders for changes vs. making copies you can’t.The only workaround for this is to have FontBase installed locally, and then each team member can use a \"Watched Folder\" for Google Drive, however, then Collections are no longer shared/synced.It's a huge pain point for working with teams when using Google Drive. There's an entire thread on it in their Support Forms called \"Google Drive - Watch Folders Issues\"; unfortunately we can't add links in reviews.3. Lack of Sub-Folders for Collections make things a bit messy for organization. It's also problematic for Teams due to point #2.The UI is nice, the price is right, but there are some of those smaller grievances that have us looking to move back to Connect Fonts (formerly Suitcase Fusion)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raul Lozano",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T16:26:01.000Z",
          "Titre": "Haven't seen an auto activation feature…",
          "Contenu": "Haven't seen an auto activation feature for Affinity Publisher/Designer/Photo.These apps are quickly taking over the market. Need assurance that this will indeed happen."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Corrado Carbè",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T11:11:12.000Z",
          "Titre": "Nice app but..",
          "Contenu": "Nice app, with great potential. Although it's been years without any real upgrade in functionality."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Çağrı Akıncı",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T09:57:40.000Z",
          "Titre": "ADDS AND CONS OF THE SOFTWARE",
          "Contenu": "I switched to your software because FontExpert does not support adobe 2023. As a former FontExpert user, I don't think the interface of your software is useful. Because of the design of the software it looks like a phone application. I find it useless as a designer who is used to working with classic menus. In some fonts, even if I reduce the font size, I cannot see the preview of the font fully because I cannot adjust the line height. When typing the font name in the font search section, because of live search, some letters are not written. I have to correct it every time. There is no problem with my keyboard, I checked :) Font tagging feature is very useless. When I want to add one of the tags I created before to a font I just installed, the program doesn't allow me to select the tag. I have to type the full tag name every time. This wastes a lot of time. I would be very grateful if you bring a feature where we can detect and delete duplicated fonts. For example, it would be much more useful if we could select and delete all fonts which has both OTF and TTF format with single selection. Or it would be more useful if it finds duplicated fonts by analyzing them. My last request is completely related to the dollar exchange rate in the country where I live. Since the dollar exchange rate in Turkey is 18.62₺, the subscription fee of your application is unfortunately expensive for me. If you have the opportunity to make a discount on the annual subscription fee, I would love to take advantage of it.Have a nice day..."
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "don card",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T06:33:47.000Z",
          "Titre": "Buggy & Dysfunctional UI",
          "Contenu": "Buggy, In particular, the dysfunctionality moving/copying fonts between 'Collections'The UI is badly designed in form AND functionwith icons that are somewhat incomprehensible"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "João Gabriel Riveres",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T00:29:42.000Z",
          "Titre": "I'm having lots of trouble with its…",
          "Contenu": "I'm having lots of trouble with its database. It keeps losing connection to it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leonardo Borsten",
          "Nb_Reviews": 4,
          "Date": "2021-06-11T21:43:40.000Z",
          "Titre": "FontBase is a very useful and necessary app.",
          "Contenu": "FontBase is a very useful and necessary app for my graphic design and website design work. I prefer to use FontBase over FontBook because it's more versatile. However, the alphabetical ordering of font families is pretty much useless when using visual and stylistic criteria to choose a typeface for a job. The name of a font family is irrelevant in design.I also notice that FontBase does not support Postscript 1 fonts. I have a lot of those."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Claudia Klees",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T01:35:32.000Z",
          "Titre": "The concept and design is brilliant",
          "Contenu": "The concept and design is brilliant, but there are some bugs, and issues detecting all my fonts properly on a windows machine. Also, the premium features are great, but some additional categorization features besides slant and font weight would be good (example: type of font face, i.e sans serif vs serif)"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Hadhami Arfaoui",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T14:41:30.000Z",
          "Titre": "no search options -",
          "Contenu": "no search options - no view options"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Damien Toll",
          "Nb_Reviews": 4,
          "Date": "2021-03-28T22:50:41.000Z",
          "Titre": "Pay for the full version and although…",
          "Contenu": "Pay for the full version and although it's cheap, I can't back up my font list and export it to my other computer. Have to find and load them all from scratch. Need an export option"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T13:08:28.000Z",
          "Titre": "We really like the software but have a…",
          "Contenu": "We really like the software but have a great deal of trouble with the auto-activate feature when using the Adobe CC products, Illustrator is the worst by far!"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Frank Wassenberg",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T13:38:47.000Z",
          "Titre": "I would like more/better font…",
          "Contenu": "I would like more/better font classification"
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Philip Mundia",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T06:11:36.000Z",
          "Titre": "Great font management tool But...",
          "Contenu": "First the UI, its great, the dark theme Is a treat. Secondly, It's a great font management tool and especially how I can preview the fonts, I also love the auto activate option, really comes through in a crunch, I hope you add a duplicate checker and one to help sort between commercial, Demo and free fonts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 8,
          "Date": "2023-12-01T00:52:02.000Z",
          "Titre": "So close - just one thing...",
          "Contenu": "My one complaint is there is no way to filter out the fonts that have not been tagged, etc. When I install a bunch of fonts at once it is hard to keep track of which ones need sorting.Otherwise it loads faster than any font manager I've ever used."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Karl",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:50:20.000Z",
          "Titre": "I love how simple an intuitive it is",
          "Contenu": "I love how simple an intuitive it is. We had a membership with Suitcase but I felt it tried too much.The only issue I have with FontBase and it may not even be your issue is that there is often a delay when opening InDesign and the fonts syncing. I usually have to activite the FontBase window then activate the InDesign file to get it to sync quicker (in my head this seems to work). This may suggest it is more an issue with InDesign than you, but I am sure it worked super fast when I first joined you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CMC.",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T09:08:15.000Z",
          "Titre": "Great program but those weird…",
          "Contenu": "Great program but those weird subliminal messages that flash when I open the program give me the creeps."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DJ MARCHAND",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T22:10:36.000Z",
          "Titre": "I love your font management software, but...",
          "Contenu": "I love your font management software, it's the only one I've found that comes close to what I need. It still has some quirks I don't understand, but overall satisfactory.Quirk #1: When font files get deleted, they get removed from the visible lists, of course, but not from the internal lists, so when activating all fonts in a Collection, I can't see the full red bullet, since \"some fonts are not activated\", in the program's algorithm. Or if I delete all fonts from favorites, the number doesn't get to zero, that sort of thing.Quirk #2: Tag management is sub-optimal IMO, hard to manage yourself.Quirk #3: Too easy to delete a font from a collection by error, by just slipping the mouse."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Ricardo Robles",
          "Nb_Reviews": 9,
          "Date": "2023-04-11T18:14:26.000Z",
          "Titre": "Sometimes it behaves",
          "Contenu": "Sometimes, it just does not work, I mean, once every 50 times. Fonts won't auto-activate (even if the app tells you that they are active). I am uncertain if It's because M1 mac chip, or Adobe o Fontbase. The workaround is to deactivate then and reactivate them. So, it just takes 1 minute to solve, and like I explained, it seldom happens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy Mullis",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T23:20:36.000Z",
          "Titre": "Good font manager, sometimes unstable",
          "Contenu": "Overall, this is a pretty good font manager, and despite its faults, ABSOLUTELY THE BEST font manager available for Windows.My biggest gripe is that the application is a bit unstable, and crashes on a pretty regular basis.I would love to see a refresh of the main interface and a focus on improving stability and core features. I've never used the \"preview\" pane, and after 3+ years of  using this software, the \"discover\" pane still displays a \"Coming Soon\" message."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "stephanie",
          "Nb_Reviews": 7,
          "Date": "2022-07-05T12:44:14.000Z",
          "Titre": "Great app",
          "Contenu": "Great app! Some minor issues like the auto-activate plug-in is late (not available when updating Creative Cloud) and some font families get separated (regular, bold in one \"folder\", light and black in another for example) But definitely my favourite fontmanager! I love the file management, it fits my needs perfectly. Price is very OK also!"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "stephanie",
          "Nb_Reviews": 7,
          "Date": "2021-07-05T10:07:57.000Z",
          "Titre": "I love it",
          "Contenu": "I love it, just some problems with some font-formats or with how the family is interpreted sometimes (separating italics and bold from regular f.i. etc.). But generally they seem to listen as the updates are constantly improving on these areas. In terms of usability I'd wish for a better folders management in the sidebar (collapse all, show all). Cheers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather Henderson",
          "Nb_Reviews": 2,
          "Date": "2022-01-16T18:05:14.000Z",
          "Titre": "Request for shortcuts, filters, integrations",
          "Contenu": "I think a few features would made to the awesomeness of this font manager:1. Keyboard shortcuts for common tasks, like “View Family” or “Favorite”2. Filter based on number of fonts in a family, e.g. view families with 6 or more weights3. Waterfall view of family weights and styles in the main view4. Adobe Fonts integration to view, favorite, and organize (same as Google Fonts)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Friesen",
          "Nb_Reviews": 2,
          "Date": "2022-01-16T04:52:50.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Almost perfect, however I wish FontBase would handle Postscript fonts. I prefer Open fonts but after years of building up a font library which includes many Postscript fonts to have to abandon them and buy a new collection of Open fonts seems unfair."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "clintonaclarke",
          "Nb_Reviews": 3,
          "Date": "2022-03-18T20:50:10.000Z",
          "Titre": "Pretty Good Program",
          "Contenu": "I have found Fontbase for Mac to be generally pretty good. My biggest reason for the move to it was because of the insane pricing models of Extensis Suitcase which I used for almost 15 years. Esspecially when every time having to upgrade and backwards system compatibility, their fees were getting to be too much."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Tim Fuchs",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T19:19:13.000Z",
          "Titre": "Very useful tool",
          "Contenu": "Nice tool, but I wish it had more buil in tools for eg. Affinity software instead of only for Adobe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald M Koliha",
          "Nb_Reviews": 7,
          "Date": "2022-12-06T08:03:28.000Z",
          "Titre": "No very intuitive, but works OK",
          "Contenu": "I gave up on Suitcase/Connect (sorry to mention competitor names) which is now virtually unusable.  I turned to FontBase due to some positive user reviews.  Getting going was a bit confusing (not exactly explanatory -- no help or documentation that I could find), but now it seems to work fine, at least in Adobe InDesign."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Raúl Mella",
          "Nb_Reviews": 2,
          "Date": "2021-08-14T11:43:53.000Z",
          "Titre": "Fontbase is great and the only thing…",
          "Contenu": "Fontbase is great and the only thing that makes me point 4/5  is that their help support must improve.Other than that, it's one of the most valuable app I have ever encountered and I love being am awesome subscriber."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Guillermo Chavarría",
          "Nb_Reviews": 2,
          "Date": "2021-08-17T19:05:11.000Z",
          "Titre": "The program is useful",
          "Contenu": "The program is useful, but it keeps having some compatibility issues with Adobe CC. Besides, sometimes, it still lacks a right tool to find fonts based on appareance or style."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2022-07-20T16:32:44.000Z",
          "Titre": "Almost Perfect!",
          "Contenu": "It's not glitch free, but it is the best one out there at this price point. I find myself restarting it every couple of days just to make sure it syncs properly; other than that I love it. It makes it really easy to find my favorite fonts and not have to always have them loaded on my machine."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ATHANASIOS KARALIAS",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T21:35:39.000Z",
          "Titre": "Great App with professional features",
          "Contenu": "Great App with professional features. I gave it 4 star, cause for everything there's room for improvement.Even the free version has all you really need, minus some automations.Price is fair."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "AMLT",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T23:58:38.000Z",
          "Titre": "Love the program, needs a bit more instructions for advanced options",
          "Contenu": "Love the program! A bit more explanation of how the shared root folder and auto activation work would be great. Auto activation especially seems hit and miss"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 1,
          "Date": "2022-07-25T16:42:56.000Z",
          "Titre": "This has been my primary font manager for over a year.",
          "Contenu": "This has been my primary font manager for over a year. I love its simplicity and ease of use. It’s reliable and does exactly what it says it does. I’ve only had one or two issues and they’ve been resolved in either updates or with help in the forums. Great app! Highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Christodoulos Christodoulou",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T14:26:44.000Z",
          "Titre": "Great font managing app."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Darryl Luscombe",
          "Nb_Reviews": 8,
          "Date": "2022-03-13T03:26:21.000Z",
          "Titre": "The best of the font management for linux.",
          "Contenu": "The best of the font management utilities for Linux. I just wish it was a little more feature rich like many of the available Windoze options."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gabriel Lefebvre",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T23:08:12.000Z",
          "Titre": "My few problems with your software:",
          "Contenu": "My few problems with your software:1) The tool to create new collections is not intuitive. I have to search for it every time want to create a new one. Mabe it is just too dark or it could just be placed right under the word \"Collections\"...2) I have experimented few problems with the search tool. After a search, going back and forth on my design software, I get back to FontBase and the search is still on but not in an obvious way. And I forget that I was using it. So I go to my collections and fonts do not appear. It always takes me a few moments to understand what is going on. To resolve that, maybe the search tool could have more contrast when on. Mabe in fluo green instead of subtle purple...3) The fact that a font is part of a family is also not obvious enough. The bold gray number is not enough to help me to find a font. Also, it is not cool to have to go to another page to see the entire family. This could be done in a \"drop down\" style without leaving the page."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 6,
          "Date": "2023-02-20T00:17:06.000Z",
          "Titre": "Decent program",
          "Contenu": "While it's a wonderful app to look at fonts, I find that the a better help function would increase the user experience."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Viktor Csete",
          "Nb_Reviews": 3,
          "Date": "2021-12-01T18:35:40.000Z",
          "Titre": "Got up-to-date Adobe CC",
          "Contenu": "Got up-to-date Adobe CC, and sometimes auto-activation is very slow, it can take 15-20 seconds. Yeah, that is slow for me :) But works. :)"
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Juan María Sánchez Cruces",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T19:11:33.000Z",
          "Titre": "More integrations with other free fonts…",
          "Contenu": "More integrations with other free fonts sources. Figma plug-in to activate withour restarting the program, faster updates on Google Fonts database."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick Bianco",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T01:24:36.000Z",
          "Titre": "fix adobe font integration",
          "Contenu": "Because of issues with the adobe fonts integration.  if it wasent for that id be saved from font manager 10.  I love the speed of font base"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "cliente",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T10:58:45.000Z",
          "Titre": "Fontbase could ativate the fonts like…",
          "Contenu": "Fontbase could ativate the fonts like rightfont. If a text is selected on adobe it will be nice to change the font on fontbase."
        },
        {
          "Note": 4,
          "Lieu": "MQ",
          "Pseudo": "Hugues ODINA",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T20:03:20.000Z",
          "Titre": "Great app",
          "Contenu": "Great app ! Above all, I appreciate the way the fonts are managed. Just about the user interface, I think it can be improved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise M Marion",
          "Nb_Reviews": 6,
          "Date": "2022-05-11T20:17:23.000Z",
          "Titre": "Great functionality",
          "Contenu": "Great functionality. I've subscribed for a couple of years. I just wish the collection syncing was easier across all of my devices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maimarie Mercereau",
          "Nb_Reviews": 1,
          "Date": "2021-08-29T17:41:45.000Z",
          "Titre": "It's been improving",
          "Contenu": "It's been improving. It's still tricky to keep the fonts organized. It can take a while to load fonts, although it's not a web browser so it makes sense. Also, loving the little splash page jokes when app first launches. Very cute!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T04:12:18.000Z",
          "Titre": "In general the Fontbase is great",
          "Contenu": "In general the Fontbase is great. I am still missing some options like collect to output."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "rodrigo",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T19:23:56.000Z",
          "Titre": "I will put five stars when there is a…",
          "Contenu": "I will put five stars when there is a search for “similar fonts“. It would be the perfect application."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "JOAO C R FONSECA",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T14:19:42.000Z",
          "Titre": "It's an excellent app for font…",
          "Contenu": "It's an excellent app for font management and it's still growing up to reach five-star level. Keep up the good job."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Marcello Marques",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T01:56:48.000Z",
          "Titre": "Nice but stalled",
          "Contenu": "Nice app, but the development pace is a bit sedate. Would like to see additional features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Ortiz",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T22:14:46.000Z",
          "Titre": "The Red Box",
          "Contenu": "When I open the app a red box appears that reads \"Could not Download Update\". I feel like I'm missing something."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Megan N Dunn",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T14:04:47.000Z",
          "Titre": "Love FontBase - Easy and Simple",
          "Contenu": "FontBase is easy to use and really just what I wanted - I only knock off a star because about 20% of the time some kind of update between either them or Adobe completely ruins my ability to work and makes my software non-functional until I roll back to an earlier update."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Allison",
          "Nb_Reviews": 3,
          "Date": "2022-11-14T15:57:18.000Z",
          "Titre": "As good as any font management app I've…",
          "Contenu": "As good as any font management app I've used and so worth the inexpensive price."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Webb",
          "Nb_Reviews": 11,
          "Date": "2022-11-17T20:49:23.000Z",
          "Titre": "I really like the program",
          "Contenu": "I really like the program, but I find certain aspects of it confusing and frustrating."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Magdalena Adrover Gayá",
          "Nb_Reviews": 2,
          "Date": "2022-03-14T15:31:09.000Z",
          "Titre": "I really like this program",
          "Contenu": "I really like this program. It could use some improvement in UX, but overall it works very good."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "bee",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T18:27:49.000Z",
          "Titre": "good app",
          "Contenu": "the app is good and affordable. some elements a bit confusing"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Katja",
          "Nb_Reviews": 3,
          "Date": "2022-01-09T23:03:54.000Z",
          "Titre": "Great program but...",
          "Contenu": "It's sometimes a bit hard to sort the Fonts. Especially, that you have to double save the font on the computer. Takes away disk space."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caoimhe Ora Snow",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T22:28:10.000Z",
          "Titre": "Search result organization",
          "Contenu": "I wish the search results were a little better organized."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "belladesignworks",
          "Nb_Reviews": 1,
          "Date": "2023-01-22T23:38:34.000Z",
          "Titre": "Overall an essential piece of software…",
          "Contenu": "Overall an essential piece of software At a affordable price."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Ale Petrini",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T13:27:40.000Z",
          "Titre": "working and simple"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "massimo rosestolato",
          "Nb_Reviews": 5,
          "Date": "2021-05-08T13:48:12.000Z",
          "Titre": "Simple Font Manager to use, Right price",
          "Contenu": "Simple Font Manager to use, very light in the system. With even Auto-activation on Photoshop, Illustrator and InDesign CC2021, if there was also for Adobe After Effects would be 5-star. Right price"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2021-04-09T02:12:27.000Z",
          "Titre": "Everything is great. Almost...",
          "Contenu": "Everything is great... Almost. The most important feature I still missing - fonts will not packaged along with InDesign and images. Making that manually actually takes a lot of time"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Ricardo Tramontini",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T23:59:20.000Z",
          "Titre": "I don't like the fact that i can't…",
          "Contenu": "I don't like the fact that i can't throw a font directly to a collection. And sometimes the search engine is a bit slow. Other than that it works very well!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Auset",
          "Nb_Reviews": 5,
          "Date": "2021-04-03T01:45:59.000Z",
          "Titre": "Great modern user interface",
          "Contenu": "Great modern, easy to use interface. Needs more instructions for beginners and a bigger help section to explain how & why the features work."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "evanmac",
          "Nb_Reviews": 2,
          "Date": "2022-10-22T13:56:34.000Z",
          "Titre": "Sync doesn't work very well"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Patrick",
          "Nb_Reviews": 2,
          "Date": "2021-04-11T18:33:16.000Z",
          "Titre": "Minor reliance issues",
          "Contenu": "Fonts sometimes deactivate as I use them, and sometimes auto-activation don't work. Not big productivity breakdowns but still annoying."
        },
        {
          "Note": 4,
          "Lieu": "LT",
          "Pseudo": "Donatas B.",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T08:36:01.000Z",
          "Titre": "The app is great, but has still some way to go.",
          "Contenu": "The app is great and very helpful. However it's a bit buggy and lacking some features (though being improved slowly)"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mick Szirmay",
          "Nb_Reviews": 2,
          "Date": "2021-05-13T17:22:21.000Z",
          "Titre": "Good solid reliable font manager",
          "Contenu": "Good solid reliable font manager. Stays out of your way until you need it."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Magdalena",
          "Nb_Reviews": 2,
          "Date": "2021-04-03T11:40:21.000Z",
          "Titre": "Great, but crashes a lot",
          "Contenu": "I really like FontBase, but it crashes on me too often :/"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Allison",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T16:07:04.000Z",
          "Titre": "Great app",
          "Contenu": "Great app, works solidly just like any other font app I've used that cost a fortune in comparison. No issues and very affordable for freelancers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P Spagnuolo",
          "Nb_Reviews": 4,
          "Date": "2023-11-30T20:51:26.000Z",
          "Titre": "Excellent, Simple Font Manager",
          "Contenu": "I've been using Font Base for just over a year as a replacement for Extensis Suitcase which I used for many years. As an independent, professional designer of 30+ years, I don't need extensive features or the subscription costs associated with them. I've recommended FontBase to others and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Felipe Glauber Lima Rodrigues",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T16:03:22.000Z",
          "Titre": "Best free font manager with fair paid extensions",
          "Contenu": "I'm an old user, since first beta version, and app improved a lot. Everything works better than the expensive alternatives. They offer monthly, yearly and a lifetime subscription. It's integrated with Google Fonts and Adobe apps works gracefuly with it. Sync collections (paid) is another top feature, the search is awesome and compatibility with TTF, OTF are technically perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JkW",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:03:46.000Z",
          "Titre": "Very easy to use",
          "Contenu": "I love how quick and easy it is to use. You don’t have to go through numerous clicks to get what you want. This is THE EASIEST way to get glyphs that I’ve found."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Karine Bosse",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T15:58:11.000Z",
          "Titre": "The response was fast and efficient",
          "Contenu": "The response was fast and efficient. I was looking for a way to change the email associated with my account, and they did it for me. Easy peasy. It would be a nice function to add on the customer side in the future."
        },
        {
          "Note": 5,
          "Lieu": "JO",
          "Pseudo": "Ahmed Abu Nahleh",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T10:33:30.000Z",
          "Titre": "great features!",
          "Contenu": "I like the auto activation feature for adobe apps, and the watch folders where I can download any font into it and it's automatically added to fontbase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonardo Borsten",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T00:30:20.000Z",
          "Titre": "Reliable and good value",
          "Contenu": "FontBase is a reliable app. It shows TrueType and OpenType but not PostScript fonts. It doesn't come with font classification  presets, but you can easily make your own collections by clicking \"New collection\", give it a name, and dragging font families from the main list onto the collection. You can then click the collection name to see its content on the main panel."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ozan Vardar",
          "Nb_Reviews": 4,
          "Date": "2022-07-06T13:12:58.000Z",
          "Titre": "A great tiny software with huge functionality",
          "Contenu": "FontBase is a great tiny software with \"huge\" functionality and stability. In a digital ecosystem of David vs Goliath stories, this feature frenzy app easily changes your life as a designer by doing less, just its job. (Also can handle +4k fonts in adobecc apps without any hangs) Cheers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawna Simmons",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T20:13:06.000Z",
          "Titre": "Great font manager",
          "Contenu": "Working in printing and graphic design, I need to have access to thousands of fonts. Our current server has over 50,000 fonts, and it's just not feasible to install all those fonts.  I love having the ability to only activate the fonts I need, and the ability to quickly scroll through and see font previews at a glance. Works wonderfully with Adobe InDesign, Illustrator, and Photoshop. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rendesia White",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T10:41:08.000Z",
          "Titre": "Great Way to Organize Your Bazillion Fonts",
          "Contenu": "Fontbase is great. I recently bought a new computer and I knew I didn't want to store my multitude of fonts locally. I installed all my fonts from old PC to a folder in Google Drive, and then synced that folder over to Fontbase. Now I have access to my bazillion fonts without taking up precious hard drive space.It's great that you can set up different collections of fonts, which I've done for various brands, and it's handy to create collections for different styles in a way that makes sense to me like Script, Graffiti, Elegant, Distressed, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Smith",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T13:43:14.000Z",
          "Titre": "Stellar font manager",
          "Contenu": "Stellar font manager. I used to have to wait quite a long time for all of the fonts to render on the previous app I was using. Fantastic for managing ginormous font collections with zero lag on my system resources. It's also cross platform on Windows, Mac & Linux! This app has been a godsend for me. I've purchased multiple license subscriptions!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lars Zimmer",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T16:20:16.000Z",
          "Titre": "Very happy with FontBase",
          "Contenu": "Until now I'm very happy with FontBase! From my experience with Linotype FontExplorer I find FontBase faster and less overloaded. In first place I love the integrated Google Fonts Library, the Collection Sync Function and the similar interface on Windows and Mac Clients. Keep up your good work!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Matt Echo - Matteo Fiore",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T12:09:45.000Z",
          "Titre": "Essential part of my workflow",
          "Contenu": "Fontbase quickly became an essential part of my workflow. Nice interface, great UX design. \"AWESOME\" premium features.The icing on the cake would be a better synch between different devices using fontbase. Other than that, great work."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Eugene",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T07:21:16.000Z",
          "Titre": "They are absolutely fantastic in so…",
          "Contenu": "They are absolutely fantastic in so many ways. What an amazing service even when you aren't a paying subscriber. Though I highly recommend to sub and support this awesome team. Plus you'll get sweet extra benefits like auto activated missing fonts in Adobe software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T00:58:25.000Z",
          "Titre": "This company responded",
          "Contenu": "UPDATE: The company has responded and I'm now good to go.I bought the $180 package on Tuesday and it's now Friday, and have been waiting since then for the e-mail to set up my account and upgrade. I have e-mailed them at mail at fontba.se and...nothing. I am preparing to dispute my credit card because of their lack of response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Lesley",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T18:24:03.000Z",
          "Titre": "Fonts and Users love FontBase",
          "Contenu": "What app out there can handle fonts in Windows so elegantly and efficiently? FontBase is incredibly affordable, polished, easy to use and, most importantly, it is tremendously useful! Helps my whole work process. I can imagine UI changes and more ways to visualize and organize the fonts in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jon Tarrant",
          "Nb_Reviews": 30,
          "Date": "2023-03-22T13:13:41.000Z",
          "Titre": "I was using another font app",
          "Contenu": "I was using another font app, but they kept increasing the price with no improvements in the app.  I found FontBase, used their free version for a while and found it had just as much functionality as the more expensive one.  I bought the full licence at a fraction of the price of the old app.  It's reliable and fast.  My only regret is not finding it earlier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Broadstreet",
          "Nb_Reviews": 2,
          "Date": "2021-07-24T08:12:56.000Z",
          "Titre": "Great tool",
          "Contenu": "Great tool!  I've used both of the major font management products on the market and the cost alone of this one should make most users consider it first.  However after numerous troubleshooting issues with other software, I've fully moved over to this as a financial contributor!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John Pease",
          "Nb_Reviews": 3,
          "Date": "2021-11-11T22:15:23.000Z",
          "Titre": "FontBase is the best font management tool ever!!",
          "Contenu": "FontBase has to be the most useful font manager around. Simple to use, very sparing on system resources, clean appearance. I have tried many of the high cost options but don't have extensive requirements for editing fonts etc. FontBase is perfect for managing and viewing my font collection! Love it!!"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Plamena",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T13:05:14.000Z",
          "Titre": "Just what I needed for my fonts management",
          "Contenu": "Once you read the Getting started (or something to that effect) on their page, the app is quite easy to understand and use. You can add custom tags, which is great for my extensive fonts library. I can now easily separate my baby fonts form my wedding fonts from my tech fonts. With the enable/disable option, it's very easy to stay on top of my fonts management. The subscription price is more than affordable, and it's so much worth it to have."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Cristóbal Alarcón",
          "Nb_Reviews": 4,
          "Date": "2023-01-20T05:23:37.000Z",
          "Titre": "Fully integrated it to my workflow. I don't know what I would do without it",
          "Contenu": "I use it every day as a graphic designer. I have fully integrated it on my workflow.- Intuitive font file activation via folders and not only files? For free? Check- Automatic activation when you open FontBase? For free? Check- Select and customize scanned folders and collections? For free? Check- Scroll trough favorite, active, inactive, or all fonts? For free? CheckAs i needed more I started paying for the premium version, that allows me for a even faster workflow. Without it I would be back to manually installing and uninstalling a gazillion fonts.There's room for improvement although, like temporal font activation. And there is a bug that some font families appear all as crossed squares, even tough the characters in that font file exist.Overall, 9.5/10"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Raúl Mella",
          "Nb_Reviews": 2,
          "Date": "2022-10-16T23:41:21.000Z",
          "Titre": "I'm very happy that this piece of…",
          "Contenu": "I'm very happy that this piece of software exists. When I knew about it, I could stop pirating Suitcase, which was an uncomfortable thing for me to do, and start doing the right thing paying monthly for this software if I need to design (something that I don't do constantly).  The only thing I would improve is the frequency of updates but I'm sure that the developers do the best they can with their resources and I can only feel grateful that they decided to develop this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Pfaffendorf",
          "Nb_Reviews": 2,
          "Date": "2022-10-18T18:06:49.000Z",
          "Titre": "Love it!",
          "Contenu": "Love not having to install all of my fonts, love being able to sort them into categories.Having categories transfer over between two computers when I save the fonts on a flash drive in stead of a cloud storage would be the cherry on top."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Barker",
          "Nb_Reviews": 8,
          "Date": "2022-04-04T11:23:11.000Z",
          "Titre": "Excellent and very reasonably priced font activator",
          "Contenu": "Does everything we need in a busy graphic design and web design studio, at a greatly reduced cost compared to the major established player. Easy to use, has auto activation plugins for Adobe products, works seamlessly in the background."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Andre van Wyk",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T07:44:08.000Z",
          "Titre": "Controlling you font library can not be easier",
          "Contenu": "It makes controlling my typefaces so much easier. The integration to Google fonts is the biggest plus."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Mathias Rée",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T22:24:28.000Z",
          "Titre": "Great companion App for designers",
          "Contenu": "I run Font Base alongside the Affinity Suite. When I launch it, font families \"magically\" appear in the design application. Does not require a restart of Affinity Suite, but  Injects fonts live into the programme. Font management capabilities are great, easy to handle.I consider Font Base a must have for any serious designer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T16:11:08.000Z",
          "Titre": "Finally dropped Suitcase",
          "Contenu": "Finally dropped bloated, slow, overpriced Suitcase for a basic font manager that does what it's supposed without being a resource hog. All we need is a reliable font manager and FontBase does everything we need. If you're on the fence with switching, just do it. Well worth every cent."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Watanabe Carcasss",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T10:21:35.000Z",
          "Titre": "It's just great",
          "Contenu": "Anything and Everything in this world can be made much better, but based on the price-tag, what Fontbase does is remarkably... and OMG, their support is put of this world, almost instantaneous reply, courteous, straight to the point... just love it. Can't recommend enough"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Broadstreet",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T17:31:11.000Z",
          "Titre": "Very cost effective and easy to use, strong on features!",
          "Contenu": "Very cost effective compared to the two major players on the market for decades, and so much more easily integrated across all platforms (Mac/PC) that I use.The ability to install across multiple versions of Adobe apps will be useful for those who have to maintain versioning of projects, and the ease of font management simply blows away the competition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 7,
          "Date": "2023-06-13T02:12:00.000Z",
          "Titre": "Effortless",
          "Contenu": "The Fontbase app works flawlessly and the payment schedule requires nothing on my part. I am notified that the payment is upcoming and then I get a receipt. It couldn't be easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Baney",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T19:01:55.000Z",
          "Titre": "Love this app!",
          "Contenu": "I prefer to save my fonts locally and access all Google fonts automatically. This app helps me not only categorize my fonts, but speed up the design apps on my computer by loading only the active fonts that I need. The preview features are also nice in helping me choose which font works best. The price is also very affordable. Can't say enough good things!"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Marouane Tourham",
          "Nb_Reviews": 6,
          "Date": "2023-02-10T09:15:53.000Z",
          "Titre": "Fontbase",
          "Contenu": "Fantastic peace of software, does the job, many features, simple, the UI is good, the price is spot on for premium. One of the very best font managers, the best quality/price ratio imo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AfreshStudio.com",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T14:50:59.000Z",
          "Titre": "FontBase makes it so easy to manage fonts",
          "Contenu": "FontBase makes it so easy to manage, organize, access, and auto-activate fonts! Helping me make a good font decision when designing is so key, and this app totally helps with that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Sousa",
          "Nb_Reviews": 2,
          "Date": "2022-07-23T00:03:18.000Z",
          "Titre": "Very handy for showing only the fonts I…",
          "Contenu": "Very handy for showing only the fonts I want for a particular application.  Also using Photoshop CS5 I have no provisions for adding glyphs to fancy fonts, but fontbase makes it a very easy process."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ozan Vardar",
          "Nb_Reviews": 4,
          "Date": "2021-07-06T11:23:37.000Z",
          "Titre": "A Simple & Smart Tool",
          "Contenu": "It's a great app and a safe buy for every designer that needs/deserves a good font manager. Constant updates, plugin support and resource friendliness keeps Fontbase a must."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Brennan Paezold",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T05:06:52.000Z",
          "Titre": "Easy to search and organise",
          "Contenu": "Easy to search, organise and add fonts. Collections are great, and setting up previews is a nice feature."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T22:36:28.000Z",
          "Titre": "FontBase has saved me hours of wasted time",
          "Contenu": "FontBase has saved me hours of wasted time, looking through hundreds of fonts for the right one. It is eternally useful and well worth it."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Silviu Moldoveanu",
          "Nb_Reviews": 3,
          "Date": "2022-12-02T11:43:46.000Z",
          "Titre": "Best tool on the market",
          "Contenu": "Great interface, perfect user experience with no help needed. You just dive into your next project knowing your back is covered."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stefan",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T20:56:39.000Z",
          "Titre": "This is THE font manager, nothing else compares.",
          "Contenu": "Hands down the best and most affordable Font Manager ever. In terms of choosing and comparing fonts for a project, nothing else comes close to as efficient."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Duncan - Blue Monster Creative",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T18:45:06.000Z",
          "Titre": "Top Notch Program and Service",
          "Contenu": "Both a great program and great service.... tried it for a year as I was tired of all the headaches from my other font manager (the luggage one), that seemed to come with way too much \"baggage\" of problems/issues... after a year there was no question as to whether I would renew, and took the lifetime.  Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Thomas G",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T12:37:31.000Z",
          "Titre": "An all-round solid font management…",
          "Contenu": "An all-round solid font management system! Some improvements could be made to bring it up to a fantastic level, but a really solid solution for an affordable rate!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Trout Kamalo",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T14:54:17.000Z",
          "Titre": "such a powerful program",
          "Contenu": "I gladly pay such a small fee for such a huge program as FontBase.  I rely on it daily and recommend it to my peers.  It's the easiest and most comprehensive font program I've used!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mark Z",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T00:15:00.000Z",
          "Titre": "Font Manager",
          "Contenu": "It's a program that does exactly what it's designed to do, and the price is right, plus there's even a free functioning version with less features."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK DANTONI",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T14:31:45.000Z",
          "Titre": "Fontbase was recommended by a friend…",
          "Contenu": "Fontbase was recommended by a friend who is also a graphic designer and is the best font utility I’ve found in my 30+ years working in the graphic design business. Very easy to use, I’ve been relying on Fontbase for 4 years and highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordon Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:02:58.000Z",
          "Titre": "You contacted me to remind of the need…",
          "Contenu": "You contacted me to remind of the need to renew, included a hyperlink that allowed easy renewal.  Couldn't be easier!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Fatma Nabilla",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T15:20:24.000Z",
          "Titre": "Overall I like it",
          "Contenu": "Overall I like it, but some fonts are showed as rectangle (maybe there are problems with the font, though the fonts work normal inside the design software)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stefan",
          "Nb_Reviews": 2,
          "Date": "2021-09-15T21:26:53.000Z",
          "Titre": "Nothing else compares!",
          "Contenu": "This is the best font management software hands-down. I switched from much more expensive software and found this far more user intuitive. The biggest thing for me is being able to have dozens of font samples in a grid arrangement. Half of logo design done right in Font Base. Crazy."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sheree Dillon",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T02:43:36.000Z",
          "Titre": "Reliable",
          "Contenu": "Reliable, really easy to use and always works well. When the program expired because I didn't pay, it was easy enough to renew the subscription in only a few clicks."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Ricardo Robles",
          "Nb_Reviews": 9,
          "Date": "2022-04-11T13:54:08.000Z",
          "Titre": "More than a gimmick.",
          "Contenu": "I bought this more of for a \"toy\" and do some funky personal fonts or symbols for work.This thing is amazing... I've been doing symbol fonts for work and every single time it has not disappointed me.If one day I decide to create a full for profit font, this is the way."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Nikolaj Ehmsen Meedom",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T18:58:09.000Z",
          "Titre": "Not bad. Not bad at all",
          "Contenu": "Fits the purpose quite well. Nicely integrated in adobe apps, easy and fast to work with. Nice balance between features and simplicity. I keep hold of licencing for the different entities I work for with #tags. I like to pay for what I use, and this app is good value for money. Keep in mind that I'm a one man band so I don't have many needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Riley Osborne",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T21:24:05.000Z",
          "Titre": "A brillant tool for those who need easy access to typefaces on the go!",
          "Contenu": "I have really enjoyed using FontBase as a font management tool. It has made organizing my typefaces across multiple devices and multiple operating systems a breeze. It is also a great resource to easily install and remove brand-specific font files once I switch to a new project or discontinue working on-site for a customer on one of their devices. I highly recommend using FontBase for any designer or person who has to maintain and organize branded typefaces across multiple devices or within an organization."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank J Ferrer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:41:18.000Z",
          "Titre": "Very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Amanda",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T17:26:52.000Z",
          "Titre": "Great font manager, worth the price for premium",
          "Contenu": "I love Fontbase and have used it exclusively since I discovered it a few years ago.  The team is great, they add new useful features and the program works wonderfully."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "K Krishnamurthy",
          "Nb_Reviews": 2,
          "Date": "2021-07-09T08:42:57.000Z",
          "Titre": "Excellent app",
          "Contenu": "Excellent app! Only thing would be cool is if it keeps track of fonts installed on your one machine so you can transfer the same fonts to another machine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T23:31:15.000Z",
          "Titre": "A Font Library tool for professional designers",
          "Contenu": "Being a professional designer that needs a font organization tool that just works... FontBase is it.I am a convert from Suitcase Fusion and have zero regrets. :)"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Destileria de Ideias",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T11:24:31.000Z",
          "Titre": "Lightweight, powerful and affordable.",
          "Contenu": "Been a paying user since 2020. Perfect piece of software, lightweight, nimble and actively developed. Not to mention extremely affordable!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "andy",
          "Nb_Reviews": 7,
          "Date": "2022-11-26T11:06:54.000Z",
          "Titre": "Been using Suitcase for years but it…",
          "Contenu": "Been using Suitcase for years but it juts got too expensive. FontBase does exactly the same for a fration of the price. Intuative and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hoopenfaust",
          "Nb_Reviews": 2,
          "Date": "2021-11-09T00:14:07.000Z",
          "Titre": "Suitcase was a money grabbing scam so I…",
          "Contenu": "Suitcase was a money grabbing scam so I switched to a superior product. Will never look back. Thanks guys for writing and deploying fantastic, productive software."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "W L",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T19:01:40.000Z",
          "Titre": "The only font manager you need",
          "Contenu": "Simple, elegant and extremely useful. Does exactly what I need it to - and more - unobtrusively and with styleThe small monthly fee is worth it"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2022-03-01T05:15:13.000Z",
          "Titre": "Excellent font management utility",
          "Contenu": "As a graphic designer, font management is critical, especially as I have over 4000 fonts on my system. For years I struggled with the clumsiness of Font Book on my Mac, mostly because it was free. Then I stumbled onto FontBase, tried out the free version and loved it. I'm amazed at what is included for free. Although there were some features the paid version included that I felt would be useful, I mainly felt that a piece of software that is so well thought out, so well supported and also reasonably priced, deserved my hard earned dollars. I renewed my annual subscription for my second year now just the other day.While I really love the speed and minimal fuss approach the developers have taken with the UI, for me, the ability to 'Add' watched folders is the deal sealer. I have manually sorted my fonts into folders named by style categories on my iMac, which I sync to my cloud backup. These then become available when I sync my Macbook which has the same FontBase setup for when I work remotely. Any font I add into my watched folders immediately becomes available for activation in FontBase on both machines and easily locatable. Such a time saver.I'm sure it's possible this feature is available elsewhere, but I'd be surprised if it was done better and for free.I cannot recommend enough the work these guys are doing, if fonts are your thing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Chevers",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T20:29:58.000Z",
          "Titre": "FontBase is a terrific way to search…",
          "Contenu": "FontBase is a terrific way to search through thousands of fonts I have on my computer. It also activates them automatically.I highly recommend this program."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "massimo rosestolato",
          "Nb_Reviews": 5,
          "Date": "2023-05-08T15:25:15.000Z",
          "Titre": "Perfect for font management especially with adobe CS",
          "Contenu": "I have been using the software for several years and I find it perfect in managing fonts, especially for self-activation in the Adobecs package, it would be superlative if there was self-activation for adobe after effects as well. I hope it's in development because I've seen that it's requested by many."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Daniel Bocek",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T23:57:12.000Z",
          "Titre": "Your font manager is great",
          "Contenu": "Your font manager is great, integration with Adobe CC. Plus Google Fonts as a bonus."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Torsten Wagner",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T15:08:52.000Z",
          "Titre": "Very good software",
          "Contenu": "Very good software. Also good support and better than Suitcase in my eyes. Using FontBase since some years now an i'm still happy. The price is also very affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSE A COLINA",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T03:33:25.000Z",
          "Titre": "This is an essential uitility for any…",
          "Contenu": "This is an essential uitility for any designer or an design studio. Perfectly well executed. I cannot function without it"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Juan María Sánchez Cruces",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T13:25:12.000Z",
          "Titre": "The go to font manager",
          "Contenu": "Easy to use, nice experience and interface, great feature set. If you need a font manager, this is the right choice."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Bruno Porto",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T13:35:52.000Z",
          "Titre": "Good tool but still deserves some implementations",
          "Contenu": "Quite satisfied with the tool. Some improvements could be implemented but I believe that over time these changes will emerge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hoop2125",
          "Nb_Reviews": 5,
          "Date": "2023-01-09T18:09:18.000Z",
          "Titre": "Replacement to our beloved FontExplorer X",
          "Contenu": "We are looking for a replacement to our beloved FontExplorer X. I thing Font Base will be an upgrade for us. The nice part is we can pay $3 a month to try it and see if we like it in the long run."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tanja",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T07:25:53.000Z",
          "Titre": "I love font base",
          "Contenu": "I love font base. I have even recommended it to a few friends."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Liam",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T12:13:36.000Z",
          "Titre": "Really affordable price and works well",
          "Contenu": "Really affordable price and works well. Makes my life a hell of a lot easier being able to turn fonts on and off, finding and adding new fonts. Sometimes I can't find some fonts that are on Google, it would be good if this was always up to date with the site."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Phil",
          "Nb_Reviews": 7,
          "Date": "2023-03-29T16:51:29.000Z",
          "Titre": "So much better than this horrible font…",
          "Contenu": "So much better than this horrible font explorer product by Linotype and much cheaper too! Thank you Fontbase!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Renee Luciani",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T08:32:53.000Z",
          "Titre": "Great alternative to Extensis",
          "Contenu": "I've been using fontbase for a while now. As a graphic artist who was an Extensis user, Fontbase is a great affordable alternative."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "trisha",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T08:09:42.000Z",
          "Titre": "An attractive design",
          "Contenu": "An attractive design, good functionality and the quick result when searching for fonts... Thanks for this..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 7,
          "Date": "2022-05-12T22:24:32.000Z",
          "Titre": "FontBase is great",
          "Contenu": "FontBase is great! It just sits there working away in the background organizing all my fonts. I rarely think about it. And it's inexpensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crista Rowe",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T15:33:47.000Z",
          "Titre": "I looked for quite some time for a font…",
          "Contenu": "I looked for quite some time for a font manager that worked on multiple platforms consistently. Thank you for making that work!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "juan antonio albacete calero",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T08:34:18.000Z",
          "Titre": "Nothing to complain at this budget",
          "Contenu": "Nothing to complain at this budget. Maybe a better way to export/import font folders from a private collection."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stolkramaker",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T02:25:35.000Z",
          "Titre": "No Fuss font management",
          "Contenu": "No Fuss font management. If you’re going to sign up to a monthly-fee font management program, this is it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Glynis Yvonne Louden",
          "Nb_Reviews": 2,
          "Date": "2021-08-07T12:29:42.000Z",
          "Titre": "Best Font Manager available",
          "Contenu": "Best Font Manager available. Very easy to use. No overkill like certain other similar apps. And a wee bonus – fraction of the cost!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hoopenfaust",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T02:35:29.000Z",
          "Titre": "Simple and Fast…",
          "Contenu": "Fontbase was the reason I left suitcase. It's fast and does the job."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "julio cesar ortiz soto",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T07:42:37.000Z",
          "Titre": "I really like using FontBase",
          "Contenu": "I really like using FontBase, I've been a user for years, sometimes the interface is a bit confusing but in general it's fine."
        },
        {
          "Note": 5,
          "Lieu": "BO",
          "Pseudo": "Antonio Bustamante",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T03:44:00.000Z",
          "Titre": "Great must have tool",
          "Contenu": "Great tool, light in resources with a nice UI. The integration with Adobe CC it's great, wish it includes after effects to be a 6 star review. Keep it up"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "W L",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T04:23:03.000Z",
          "Titre": "Works perfectly for me",
          "Contenu": "Works perfectly for me. With over 60,000 typefaces I can easily find the one I want right away, and view all the styles in one typeface to find the best solution for design excellence"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Tamborski",
          "Nb_Reviews": 5,
          "Date": "2023-03-10T22:35:18.000Z",
          "Titre": "Enables me to do so much more!",
          "Contenu": "I love this software, it allows me to store, organize and use so many more fonts than I was able to in the past."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T10:07:40.000Z",
          "Titre": "Reliable and resource efficient.",
          "Contenu": "Reliable and resource efficient.Regularly updated and is proving to be a very stable font manager. Auto activation is also very effective and support for major design apps."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Yury Vasilkov",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T13:29:58.000Z",
          "Titre": "Best font manager of all I've used",
          "Contenu": "Best font manager of all I've used. Stable, got all the needed features, and subscription is really inexpensive."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Tonye",
          "Nb_Reviews": 4,
          "Date": "2022-07-06T13:17:54.000Z",
          "Titre": "Love it...100%",
          "Contenu": "I've been using FontBase since 2018 and I must say I have enjoyed using it every bit. I love that it's very easy to use and the interface is uncluttered.Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abie Silva",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T14:49:57.000Z",
          "Titre": "Been using the software for a few years…",
          "Contenu": "Been using the software for a few years now; it's been great all around and I have zero complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Peters",
          "Nb_Reviews": 2,
          "Date": "2022-04-17T15:19:16.000Z",
          "Titre": "FontBase is the one tool every designer…",
          "Contenu": "FontBase is the one tool every designer needs on every one of his Windows machines. I only wish there was a Mac version."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T22:59:57.000Z",
          "Titre": "As a designer",
          "Contenu": "As a designer, FontBase is a must have. It saves me so much time! It keeps me organized and from doom scrolling for the fonts I'm looking for."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Dagmar",
          "Nb_Reviews": 3,
          "Date": "2023-02-06T15:49:19.000Z",
          "Titre": "nice tool",
          "Contenu": "clear font management tool for a small price, have not regretted the switch from extensis"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Allison",
          "Nb_Reviews": 3,
          "Date": "2021-11-14T15:36:03.000Z",
          "Titre": "Love this and love the affordable price…",
          "Contenu": "Love this and love the affordable price for freelancers. It's stable, works comparable to other expensive platforms - well worth trying."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Mahfoud",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T15:59:12.000Z",
          "Titre": "Really useful tool for managing fonts",
          "Contenu": "Really useful tool for managing fonts, especially Google Fonts. I can't work without it since more than 3 years"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Iann",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T01:35:29.000Z",
          "Titre": "The best font management software for Windows and Mac!",
          "Contenu": "I use FontBase in Windows and I can say that this is the best font management software ever! I'll always use FontBase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Keefe",
          "Nb_Reviews": 8,
          "Date": "2023-08-22T22:07:50.000Z",
          "Titre": "Simply the Best",
          "Contenu": "I've been using this app for a while now and it is the best that I have used. Very easy to manage all my fonts that I've collected."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Tonye",
          "Nb_Reviews": 4,
          "Date": "2021-06-24T08:50:59.000Z",
          "Titre": "I have used Fontbase since 2018 and I…",
          "Contenu": "I have used Fontbase since 2018 and I must say it has gotten better and helps me easily manage my fonts. Well done to the Fontbase team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Keefe",
          "Nb_Reviews": 8,
          "Date": "2021-06-22T19:27:35.000Z",
          "Titre": "Phenomenal app to keep track and control fonts",
          "Contenu": "FontBase makes keeping track of fonts super convenient and easy. Easy on and off for the ones you are using and the ones you seldom use. This is a must have!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Fredrik",
          "Nb_Reviews": 7,
          "Date": "2023-02-28T03:09:33.000Z",
          "Titre": "This is a great app for keeping your fonts organised",
          "Contenu": "This is a great app for keeping your fonts organised... and great that you can see even fonts that are not activated."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "kerry wood",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T09:02:17.000Z",
          "Titre": "100% stable",
          "Contenu": "100% stable. Brilliant asset. I specialise in typography and this is one of my go to tools."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Keefe",
          "Nb_Reviews": 8,
          "Date": "2022-07-22T20:08:28.000Z",
          "Titre": "Fontbase is the answer to organizing fonts!",
          "Contenu": "I love Fontbase! It's keeps my \"collection\" of fonts organized and I can easily click on and off as I need one! Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T14:02:05.000Z",
          "Titre": "My font management software of choice!",
          "Contenu": "Great product.  I’ve tried many font management software before fontbase. Fontbase is a great value"
        }
      ]
    }
  ]
}