{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "fourthfrontier.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stuie Morris",
          "Nb_Reviews": 29,
          "Date": "2023-11-30T08:45:51.000Z",
          "Titre": "Terrible customer service had had…",
          "Contenu": "Terrible customer service had had ongoing issues since purchase I believe I have a faulty unit as the number of glitches I’m having seems odd. Customer services finally sent me a new strap but my problems with it still exist ! Not worth the money with this level of customer service in my opinionFinally after threatening legal action got a refund some 3 months after purchase . I stand by my original post however credit where credits due Paven in customer  services had finally authorised my refund ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dip",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T23:00:08.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service Arranges calls and no one shows upHave been dealing with an issue for months"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "patrick moberg",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T17:45:23.000Z",
          "Titre": "Complete garbage DO NOT BUY",
          "Contenu": "Complete garbage. The device has some interesting technology which is why I purchased it. However, the device does not stay snapped to the chest strap for anything other running. I tried using during CrossFit workouts and it constantly fell off. I tried swimming with it and it fell off. Finally after only six months of use it stopped taking a charge and stopped working all together. For such an expensive product I expected more. Total disappointment. Once more the customer service is not helpful at all. Neither is the support team. DO NOT BUY THIS!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Boyer",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T09:15:57.000Z",
          "Titre": "Problems accessing ECG data",
          "Contenu": "There seems to be problems getting ECG data.  There have been several times where my ECG does not post for days and it requires contacting support.  Often, support takes a long time to rectify the problem.  Also there are problems accessing data from the dashboard"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michaelholly",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T13:50:24.000Z",
          "Titre": "The product does not accurately read my…",
          "Contenu": "The product does not accurately read my heart rate when training, it gives crazy heart rate values like 40 bpm when i am going full out. I thought it might be the strap, and sent a message asking how i buy a replacement strap but i never heard from anyone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Daren",
          "Nb_Reviews": 28,
          "Date": "2022-03-03T20:48:46.000Z",
          "Titre": "Hit and miss with the results from the…",
          "Contenu": "Hit and miss with the results from the unit. Many times I have not received any ECG readings.  Some of the ECG readings I have received have been worryingly inaccurate.  I have tried to return the product within the 30 day window but every obstacle has been put in the way.  There is too much effort spent trying to get the user to sign up to the expensive monthly health subscription."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Disappointed Gustav",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T04:49:03.000Z",
          "Titre": "I am facing issue with: FourFrontier X after installing and uninstalling Frontier Plus that did the firmware update.",
          "Contenu": "I am facing issue with:The device worked great since I bought it until I installed Frontier Plus for testing, invited by the product team.The new version has updated the firmware on my device and since then many functions are not working anymore, like Breathing rate and Training load. Breathing rate is always 1 to 6 and Training load is always 0. Other functions might not work as well.I uninstalled the test application Frontier Plus, but the device still doesn't work as before.When I try to update the firmware, it says that I have the latest version.I cannot roll back the firmware update done by Frontier Plus.Please let me know how I can fix the problem.I did uninstall and reinstall the initial Frontier X application. I did reset the device.Gusti MateiPhone: samsung - SM-T870Android Version : 12APP VERSION : 5.10.5Firmware Version : FrontierX3.36_260922Hardware Version : V04.1Mac ID : F8:F0:05:C4:37:39"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T13:04:47.000Z",
          "Titre": "Product with many flaws and appaling customer service",
          "Contenu": "I received a product with battery issues. And I also noticed many things I disliked about the X2. First the poor battery quality, but also, the app doesn't show steps counting neither distance and pace for indoor walk and threadmill; the product requires a USB charger 5V 0.5A that do not exist with UK plug only EU or US what is very inconvenient for UK users; there is no USB C connector; Bad support - not always they answer the questions asked, not always they answer the emails; Bad privacy policy - I do not want my data being processed on the frontier website without my consent. That should be an optional feature; Bad return item process - appaling have to go to a google meeting video call with 8 support people to be able to send back a product that I am not satisfied with. No questions should be asked; And the X2 should have also ANT+ not just bluetooth. Only after complaining they sent me the return label, which I used to send back the product straight away on the same day. Next day it reached them warehouse and they simply stopped answering me on them support email and I still did not receive a refund. This is a very dodgy practice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T21:16:39.000Z",
          "Titre": "Does not last",
          "Contenu": "Absolute waste of time and money. After the fourth month it does not charge on even turn on. Customer service is not that helpful. Don’t waste your money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Addy",
          "Nb_Reviews": 5,
          "Date": "2022-11-20T22:17:56.000Z",
          "Titre": "Device may be good but communication is appalling.",
          "Contenu": "Over six months and they still have the wrong name."
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "Josef Resch",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T09:41:35.000Z",
          "Titre": "Disappointed"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Graham",
          "Nb_Reviews": 17,
          "Date": "2023-11-12T19:44:25.000Z",
          "Titre": "A good heart rate monitor and found it…",
          "Contenu": "A good heart rate monitor and found it accurate in terms of HR compared to several other devices. The ECG I would say was questionable hence the 3 stars constantly get the other rhythm been impossible to find out what this relates to.  I am keeping if it due to the breathing rate which I am keen to explore more and it is an accurate HR but as far as ECG I have no confidence in the accuracy. Forgot to add the forum is a complete waste of time posted and nearlt 2 weeks the posts are still in moderation reduced review to 2 stars - could be so much better with a decent forum and support service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Quinsland",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T18:53:25.000Z",
          "Titre": "Great Device - Terrible Engineering",
          "Contenu": "I love my Frontier monitor most of the time.  But it easily becomes detached during even a light workout.  I spent a few hours yesterday searching for it after it became detached while doing some chores around the yard.   It's now really banged up with a lot of scratches.Also, the micro-usb charging process is very vulnerable to damage from dirt, sweat, or water.  The flimsy plastic cap is easily lost when it's removed for charging.   99.9999% of the engineering effort went into the electronics and the remainder went into making sure the unit stays attached and charged. My advice, wait for the next version.   Maybe FF will fix these glaring design issues.   In the meantime, I've got a banged up unit that I'll sell - cheap."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kevin James Walsh",
          "Nb_Reviews": 46,
          "Date": "2023-04-11T08:32:25.000Z",
          "Titre": "Two faulty devices",
          "Contenu": "Two faulty devices - my first device had a faulty screen and an error message - this was replaced quickly by FourthFrontier - this is why I am not giving one star. Now, my replacement device has something loose on the inside of the device - when an activity starts, it makes a very loud noise and vibrates excessively, and when I gently shake the device I can hear something moving and knocking around on the inside. I did not have this noise or vibration level on the first device."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Jon Larsson",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T13:40:35.000Z",
          "Titre": "Needs more development",
          "Contenu": "Got the device out of curiosity but my heart is just fine. As a HRM it is slightly worse than Garmin etc and a bit more noise. About as Noisy as a wrist based HR sensor I would say. Surprised to find I get 5-10% ”other rythms” during runs. I double checked with a proper ECG stress test which says my heart is 100% healthy. The algorithm probably picks up noise and misclassifies it as an abnormality making it rather useless as an ECG monitor actually. Good thing was that I got a one-on-one meeting scheduled with their support but unfortunately they did not show up at the scheduled time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dlangford",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T15:57:35.000Z",
          "Titre": "My device stopped charging and after…",
          "Contenu": "My device stopped charging and after speaking with customer service returned the device as directed.  I never heard back and never received the replacement."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T01:36:17.000Z",
          "Titre": "The device doesn't always connect to…",
          "Contenu": "The device doesn't always connect to the app. Secondly the ecg reports can be difficult to understand. Lastly the battery life is quite weak."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mark Havenhand",
          "Nb_Reviews": 2,
          "Date": "2022-11-20T23:05:40.000Z",
          "Titre": "OK but could be better",
          "Contenu": "The single lead ECG functionality is great.  It's a pain having to have a phone running to get garmin head units to pick up teh Frontier X as a HR monitor.Main issue is the lack of granularity on the abnormal heart rhythm functionality and the inability to turn off specific checks.  So if I knoww I have ctopic heartbeats, it would be good to be able to remove ectopics from the stats.  The device is pretty useless if there is zero information about the issues it has found"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "michaelholly",
          "Nb_Reviews": 3,
          "Date": "2022-09-20T13:22:39.000Z",
          "Titre": "It is a good heart rate monitor",
          "Contenu": "It is a good heart rate monitor, it has issues staying connected during hard exercise.  It will also say that your training load is say 500 while you are working out, but then when you quit it will only give you a training load of 400.   On some exercises such as rowing it does not measure the same heart rate as other monitors,  it measures lower"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-09-21T00:52:31.000Z",
          "Titre": "Overall the unit has performed as…",
          "Contenu": "Overall the unit has performed as advertised. The problem I’ve had is with support. Multiple contacts have ended up with”will get back to you in an email” which never happens. Although my last issues were actually resolved, and did get a follow up email. I think it would be useful if you started a trouble shooting you tube section like other company’s have started. This would not only benefit your customers but give you some extra cash through the advertising. Your contact portal is useless since none of your employees can troubleshoot!"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Schmittmm",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T17:11:52.000Z",
          "Titre": "Very useful device providing great insights. Problem resolution by support team so la la",
          "Contenu": "I really like the Frontier X and use it for long bike rides and indoor rowing. I bought it to better understand how my heart is responding to extensive exercises (I am 50+) and if there are any health issues creaping around the corner. Over time the connectivity problems with my Garmin Edge 1030 have gotten addressed through firmware updates, though I still see dropouts once in while.My main issue is that I have reported a problem with the device, in that the vibration mechanism came lose inside the housing and I fear the device will break completely soon. I have contacted the support team, had even a video call and was promised a solution to address this issue (replacement etc). We never closed this case. I am still waiting. In a nutshell: Very cool device and super useful! Support and problem resolution, not so good"
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Vincent",
          "Nb_Reviews": 9,
          "Date": "2022-11-21T11:26:47.000Z",
          "Titre": "There should be more  Information on…",
          "Contenu": "There should be more  Information on the artefacts, what the mean."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KEVIN",
          "Nb_Reviews": 4,
          "Date": "2023-11-24T22:16:58.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Customer service is great. The USPS couldn’t find the first shipment so Fourth Frontier sent a second unit FedEx. No questions asked. They were on top of the issue and worked it to my complete satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gillian",
          "Nb_Reviews": 5,
          "Date": "2023-10-12T23:10:03.000Z",
          "Titre": "Invaluable training tool",
          "Contenu": "I have had a Frontier x for over a year and it has been invaluable. I have atrial fibrillation so I have used the device to see how my heart is doing and how training affects it. My cardiologist loves it as it gives information way beyond what can be provided in a short ecg or even a week or two’s holter monitor.  Customer service has also been excellent. The device recently developed a fault and was replaced without a quibble. I wouldn’t be without it."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "pbs",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:43:19.000Z",
          "Titre": "Best ECG tracker I've found so far",
          "Contenu": "First of all I can confirm that the support is responsive and very friendly. My device had stopped charging and they sent me a replacement device immediately. They will record a video call during this process, but will delete the video upon customer request and data privacy concerns.The device itself appears to be quite accurate at rest or during sleep. The live ECG shows clearly visible premature contractions coinciding with felt palpitations and you can easily tell whether they’re of ventricular or atrial origin. That shows me that it is clearly not recording fantasy data, but your real cardiac activity. It also accurately diagnosed episodes of atrial fibrillation. Those details are also visible when moving, but the overall ECG will show noise from movement artefacts, so that the ECGs are not so useful to identify details beyond heart rate & rhythm. At least I haven't yet found a way to interpret them otherwise.I assume that movement is a challenge for such a small device and I had been searching for an ECG tracker for quite some time. This is by far the best device I’ve found so far. The team is quite active and appears to be keen on constantly improving the device. I’ve received a couple of firmware updates & one can expect that the device gets even better with time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcus Hompesch",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T04:26:50.000Z",
          "Titre": "Overall really happy with the device…",
          "Contenu": "Overall really happy with the device and app. The service team at the frontline is dedicated and responsive....which was tested after the ECG keyboard navigation on the web app stopped working properly. Fixing it took 'forever' but eventually got done. There is room for improvement on the ECG reporting side, e.g. please include better analytics...should be very straight forward if AI supported...useful metrics would include: total beat count, count of PVCs, PACs, bigeminy etc ..adding those report metrics would make this an outstanding device & heart health ecosystem....and certainly turn this into a five star product and experience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andrew King",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T20:02:24.000Z",
          "Titre": "Great device for ECG but...",
          "Contenu": "Great device for ECG, but pretty much useless as a BTE connection to external devices for HR monitoring/readouts. Not precise enough nor frequent enough updates (1 sec update sporadic at best). I always wear a secondary HR monitor to link to Garmin device and/or peloton bike."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Lester",
          "Nb_Reviews": 6,
          "Date": "2022-12-23T19:51:08.000Z",
          "Titre": "The device works as promised",
          "Contenu": "The device works as promised! My cardiologist was able to read the ECG and determine there were no abnormalities. Switching between activities on my mobile phone is clunky, but all of the graphs are easy to find and interpret. The only reason I didn't give it five stars is that the cost is high relative to its usefulness."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T03:40:19.000Z",
          "Titre": "Excellent device for keeping track of…",
          "Contenu": "Excellent device for keeping track of heart health and for sports training. My only suggestions would be to would be to flatten out the back of the sensor so that the snaps would not pop off during exercise, and to make the percentage of non-Sinus Rhythm events give more detail to the user on the website/app. The back of the sensor is not flat, so the snaps can pop off during exercise. And as for the non-Sinus Rhythm events, all you see is a simple pie chart showing the percentage of the time during the workout that you we not in sinus-rhythm. This is helpful, but it would be much better to have these events flagged on the ECG, so you wouldn't have to hunt for them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Triathlete",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T00:05:55.000Z",
          "Titre": "The heart rate monitor is great",
          "Contenu": "The heart rate monitor is great.  It is very accurate for real time heart rate when swimming, cycling and running.  I don't know how accurate the ECG / EKG is as I have a heart condition so I don't know if my heart rate is actually irregular as much as the monitor says but I plan to check that out with my EP at my next visit with him.  I would like to have the ability to talk to some specialists about my data."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sandra Sukstorf",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T20:07:36.000Z",
          "Titre": "I love the device and so appreciate the…",
          "Contenu": "I love the device and so appreciate the information.  IN fact, I need it.  But I find the device too unreliable to use.  I run daily and need to have a heart rate monitor.  My battery is always dead and even after leaving it charged and plugged in, most of the time, I can’t get it to start.  I reboot it and do what I think needs to be done, but it still doesn’t work.  Often it cuts out in the middle of my run and is dead.  :-( however, the customer service has been repeatedly outstanding"
        },
        {
          "Note": 4,
          "Lieu": "BM",
          "Pseudo": "Martin Jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T22:29:06.000Z",
          "Titre": "Support",
          "Contenu": "I had an issue wiht my device not charging and once i email support it was resolved right away. Great product"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve Brooks",
          "Nb_Reviews": 11,
          "Date": "2023-05-11T18:59:47.000Z",
          "Titre": "Finally took the plunge and overall very happy.",
          "Contenu": "I'd been considering changing my Garmin HRM-RUN for a FF X2 for some time and finally took the plunge.I'm bradycardic (resting HR in the low 30s) which still freaks my wife out although I've had an ECG with my GP. While the ECGs have said all is ok, I have always wondered if there was a reason why I struggle to raise my HR above around 160bpm, and also when my pace slowing towards the end of really long runs, is my HR dropping because I'm slowing or am I slowing because my HR is dropping? Not easy to simulate lying on a bed in a GP surgery!Good Stuff:Heart seems to be working fine if slow.Heart Strain remains minimal through out my runs.Still no reason why I can't get above 160bpm but engine seems ok.FF App decided to stop assigning GPS data to my runs on a couple of occasions but submitted a query and all was resolved really quickly and efficiently.Improvements?:Would be great if data recording would start and finish with my watch. Sometimes the overview at the end comments that my Cadence is too low but that's because I've stopped my run and had a chat or driven home before remembering to stop the X2.Have worn the X2 while sleeping and dataset says 98% Other Rhythm but this appears to be due to my low Resting HR rather than any weirdness in the rhythm. Would be good if it could 'learn' that this is normal for me perhaps?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nicholas West",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T20:08:22.000Z",
          "Titre": "Frontier X, Ideal for heart health",
          "Contenu": "I bought the Frontier Heart Monitor at the beginning of July 2022, having been diagnosed a little earlier with paroxysmal atrial fibrillation (PAF). Having learnt that certain minerals and vitamins had a supportive  effect on the heart. I could tell if my heart was getting better (or worse) and I would also be able to see if I was in PAF as my condition was asymptomatic. This device seemed to be the ideal choice. Toward the end of July this year, it kept dropping out of the blue-tooth connection to the app and finally stopped working altogether. On contacting the support group I was instantly e mailed reboot instructions. So back in business I carried on but a couple of days later it happened again, increasing and causing me great inconvenience. I was then asked to send a video of the device as there seemed to be something not right with the blue button, and approximately 10 days later was offered a replacement on return of the old one. I was then told that the new device a Frontier X2 would be sent on the Friday and the next morning I received it in a brand new box with all of accoutrements. I cannot thank the support team enough for their care and efficiency and would have given a 5 Star if it hadn't broken down in the first place and also a couple of additional app issues.Issue 1, I do not agree with the HRV (heart rate variation) explanation, My arrhythmia results simply don't tally. 2, Running, 'Cadence' (no. of steps per minute) is worked out as an average over the full time the app is running. So stop to cross a busy road, stop to tie a shoelace, stop by falling over, Cadence becomes 0. Stop the app after cooling down or warming up before starting the run, Cadence will drop significantly, Once again I strongly recommend this device for health as well as exercise and for the support you will get if something goes wrong."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Jeff Buchanan",
          "Nb_Reviews": 5,
          "Date": "2022-11-20T22:40:43.000Z",
          "Titre": "Great Product.",
          "Contenu": "I'm 74 and have diagnosed A-Fib although it is paroxysmal not chronic and TBH I rarely experience it. In fact, intense training sessions on a cycle have apparently eliminated my need for anti-arythmic drugs. P-waves are consistently present regardless of HR , 52 (basline pulse) - 150 BPM (my set max HR). Being able to monitor this post work-out (I don't live stream) is a huge benefit. I do experience quite a bit of R to R variance on EKG. Some of this is actual PVCs that I can see on the rhythm strip. I'm told this is not pathologic; it shows up as \"other\" in HRV. I've also experienced some recently troubling failure of HR to accelerate on demand - just sits at around 75% max. Its occurrence is also rare but possibly indicates a developing AV block that may require an on-demand pacemaker. (I'll leave that to my cardiologist). The EKG feature has been great in keeping me clued in. I can't share it with my cardiologist because his in-hospital network won't allow it (They're in the process of changing over). I find the recommendations for next workout to be no more than boiler plate - I ignore it. Needs improvement that is relevant to my actual training load. The total workload displays are excellent allowing me to compare my cycling work-outs both on good days and bad. The weekly totals allow me to skip a work-out for recovery or, if I'm feeling it in a good way go ahead and safely press it a bit. There is no question that this is the best, most cardiovascular comprehensive wearable device I've used."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nigel Taylor",
          "Nb_Reviews": 4,
          "Date": "2022-12-17T09:28:27.000Z",
          "Titre": "Invaluable Support",
          "Contenu": "Guidance being sent over in terms of advised run distances help along with seeing so much data is very reassuring."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Claire",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T19:47:49.000Z",
          "Titre": "Real good",
          "Contenu": "Real good. The phone app still has some issues when I put in my height 5’7 it saves it at 6’6 not sure why. Also the heart strain does not show reading when using the app during exercise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FitmanNJ",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T16:48:09.000Z",
          "Titre": "Hardware/App improving, customer service still frustrating at times",
          "Contenu": "From my initial use of the product, my FrontierX has become more stable, and therefore more useful as an ECG-tracking device. As with most computer-like hardware and software, however, Fourth Frontier continues to suffer from instances of poor communication with customers, which degrades one's confidence in the FrontierX/FrontierX2 product. We can only hope that they will invest more attention to this critical service so as to reach their full potential in the future."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alan Stuart",
          "Nb_Reviews": 7,
          "Date": "2023-11-11T10:08:36.000Z",
          "Titre": "Excellent device and very helpful…",
          "Contenu": "Excellent device and very helpful customer support !"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paul",
          "Nb_Reviews": 6,
          "Date": "2022-11-11T06:20:36.000Z",
          "Titre": "Frontier X NOT GOOD as an real-time HRM replacement",
          "Contenu": "My experience echo's this submission below by Mark Lewis.   FF's Support was very good with my initial inquiry when I was experiencing connection issues between the HRM and my Garmin 1030+ (intermittent and loss of signal, HRM freezes, loss of workout data, and under-reporting of HR levels in real time to Garmin).   Then after reasonable follow up by their Support Team, communication stopped and I have been unable to reach them.   I asked if they would consider a \"trade in\" to replace my Frontier X with their new X2 (that addresses some of my issues) but no response.   See detail below for another user's similar issues.   It's difficult to justify a $500 HRM that cannot handle the basic (wahoo, Garmin, etc) HRM functionality.   BTW - I (tried to) use the FFX as my HRM for cycling with normal rides of 3-6 hrs in duration.from Mark Lewis \"I have had this for a few months now,, and felt the need to edit this. For pure ECG this kit is great, but as a HR monitor to connect to other devices, its simply awful. Its overly complicated compared to rivals, and very often just does not display any HR at all, and ends up having to be reset. During rides its a 3or 5 second average of HR for some reason, which isnt particularly usefull, and once or twice an hour will drop out for no reason. Having compared side by side with wahoo and a garmin (wearing both) it just isnt up to spec on this side for the price. Which is very disappointing, considering this should be the easy bit to get right\"** update as of Sep 2022...Fourth Frontier has addressed the issues I was having...with great response from their customer service group after a few attempts to reach a knowledgeable person relative to the device issues I was having."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Bruce Giles",
          "Nb_Reviews": 15,
          "Date": "2022-02-06T07:54:28.000Z",
          "Titre": "Edit, 1 year on update",
          "Contenu": "A premium interaction from start to finish.I was unsure what to expect, however their back of house systems are slick, and communicate well all aspects of delivery. My HR strap arrived in 4 days (I ordered on a Friday), packaging is great, functionality is more than expected. Honestly cannot say enough good stuff about this heart strap. Their customer service reached out promptly when I posted a comment on facebook at how happy I was, and the interaction has been super quick and relevant. Highly recommend.Edit - I have had this for a few months now,, and felt the need to edit this. For pure ECG this kit is great, but as a HR monitor to connect to other devices, its simply awful. Its overly complicated compared to rivals, and very often just does not display any HR at all, and ends up having to be reset. During rides its a 3or 5 second average of HR for some reason, which isnt particularly usefull, and once or twice an hour will drop out for no reason. Having compared side by side with wahoo and a garmin (wearing both) it just isnt up to spec on this side for the price. Which is very disapointing, considering this should be the easy bit to get right.That said, the ECG strips are great, and this leaves me in a dilema, I honestly think I am going to have to wear two HR monitors, because I want the ECG, but I need accurate HR reads too for maintaining zones while cycling.Customer service has been, well a tad bleak too I might add, initially pretty responsive, but having gone to them with a bug, I feel I have been pushed aside and ignored somewhat, being nearly a month since I responded to their conclusion with what I felt was a pretty rational response. In this instance it was around the buggy nature of the FIT files that their back end software creates, I have as yet been unable to upload a single one to any software (strava, garmin etc) and have it not either bug out, or just not upload at all as its \"corrupt\". Customer service blames Strava, but clearly this is not unique to stravva, and is across all platforms pointing back to the fit file being the issue. I have dropped my rating to 3 our of 5 stars based on its still market leading for ECG in my view, but falls short everythwere else.Edit 2: One year on and this product has become a little more \"finished\". Multiple firmware updates have seen what was a bit clunky get a lot smoother. I get better (But not perfect) connections to my garmin while still using it connected to my phone, but mostly the back office algorithms  have massively improved. They now spot and identify rythm issues and you can easily find them in your recording, and usefully a lovely little pie chart of sinus rythm vs non sinus is displayed next to each workout in the list, great idea. Definately getting more and more usefull, the long term stats addition is great too for spotting trends in  HR/Breathing etc. With these updates I have increased to 4 stars. 5 for me would be perfect connection to all devices and good response times to HR variability during workouts, negating the need to wear two straps when exercising."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Jeet phulwaria",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T15:01:51.000Z",
          "Titre": "Everything is good but ...",
          "Contenu": "Everything is good but .... No C port for charging"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gabriel Odey",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T14:28:28.000Z",
          "Titre": "The best product for your heart health",
          "Contenu": "I'm thrilled I chose the Fourth Frontier device over others I researched more than 2 years ago. It's proven to be reliable with excellent battery life, providing comprehensive heart data for monitoring. Whether I'm cycling, running, swimming, or tracking my sleep due to a heart condition, the device has enhanced my understanding of my heart's performance in relation to various factors.Recently, I faced my first issue in over 2 years, where workout data wasn't syncing. The support team promptly guided me through a device reset, resolving the problem efficiently.During an overseas trip, I forgot my device, and the team reached out, demonstrating exceptional customer support by checking on my well-being.Over time, I've observed continuous improvements, such as integration with Google Fit and Strava, allowing me to track workouts seamlessly. The device's price is justified by its features.My only suggestion would be to enable GPS tracking on the device itself, without the need to activate the app on my phone during cycle rides."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 6,
          "Date": "2023-11-25T16:55:52.000Z",
          "Titre": "Had a little problem recharging",
          "Contenu": "Had a little problem recharging.  The support was immediate and on point .  The device itself is invaluable as a workout and health aid to an older (77) \"athlete\" with some health issues.  Being able to monitor heart strain and HRV in real time very important and reassuring to me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T20:08:31.000Z",
          "Titre": "I love this device",
          "Contenu": "I love this device. Despite the fact that it stopped syncing data after only 15 months, the company did all it could to help me and made me a great offer to replace it. I did not take them up on their offer, because I was able to buy it from Amazon with a 3 yr warranty for just a bit more. I'm hopeful that this new unit will last longer than 15 mos, but with the warranty, I no longer care. Either way, the data has been very helpful with my training routine and overall health monitoring. The ECG is a game changer that I believe no one else has."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Parsons",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T22:29:33.000Z",
          "Titre": "This is a great piece of technology",
          "Contenu": "This is a great piece of technology. I’ve been using it for a couple of years as has my wife. It’s actually gotten better over time unlike a lot of other tech.And their customer support it fantastic if you ever need any help."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alistair Adams",
          "Nb_Reviews": 5,
          "Date": "2023-11-24T21:50:20.000Z",
          "Titre": "A revolutionary device - attentive customer service",
          "Contenu": "I was a relatively early adopter of the Fourth Frontier heart monitor. This a unique and revolutionary device. Revolutionary because now anyone can get up to 24hr EKG readings without having to go through expensive medical systems. Unique because I know of no other product like this.As an early adopter I've seen big improvements in the software and the level of support. This to me is an indication that the company is growing and becoming more mature. My customer service interactions have always been very positive and the team is there to help resolve issues. For my most recent case they were attentive to suggestions to improve their product, interested in how I used the device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DOUG RAINES",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T00:25:14.000Z",
          "Titre": "Fourth Frontier Technical Support is SOLID.",
          "Contenu": "My Fourth Frontier Technical Support on 11-10-23 was extremely helpful in diagnosing and resolving the X2 caught or stuck in ship mode.  By going through routines to reboot the X2 both plugged into the electrical connector and not plugged in the issue was solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lester",
          "Nb_Reviews": 6,
          "Date": "2023-10-27T19:16:17.000Z",
          "Titre": "Great support!",
          "Contenu": "I've had challenges with the firmware, and every time I call the support team, they're prompt, easily accessible, and very helpful. I purchased the device after an aortic valve replacement, and it gives me peace of mind while I continue to train at safe levels. My cardiologist also agrees that the device provides valuable feedback."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M.R.",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T09:09:02.000Z",
          "Titre": "Good unit and support",
          "Contenu": "Really good for keeping track of both my activities and sleep. Unit did malfunction many months into use however the team were really helpful and got another unit out to me very quickly and was easy to deal with on my end."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roger Hunter",
          "Nb_Reviews": 5,
          "Date": "2023-10-04T20:49:55.000Z",
          "Titre": "This product is quite unique...",
          "Contenu": "This product is quite unique.  It offers excellent feedback on various heart parameters during exercise and the support team is first class.  I've used heart rate monitors since the early days of Polar and the Frontier X is now my go to monitor, though I sometimes pair it with an older Suunto.  Buy one, it will be the best training aid you can currently obtain."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Andrea Zauli",
          "Nb_Reviews": 4,
          "Date": "2023-11-09T15:09:16.000Z",
          "Titre": "Great Device",
          "Contenu": "Great Device, and great support.I had a probleme because the device stop to respond after heavy water. I contacted the helpdesk they replied quickly and give me the right advices. Wait the device to dry and try to turn it on. It worked perfectly. The device resists under 1.5m of water."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Grace",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T17:04:31.000Z",
          "Titre": "excellent i had problem and they fixed…",
          "Contenu": "excellent i had problem and they fixed itdefinitely recommend them"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Claudia Müller",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T20:13:39.000Z",
          "Titre": "very good support service",
          "Contenu": "very good support service. had a problem with the device not responding any more. Fast answer with good instructions to resolve the problem. good monitor with a lot of information for training. heart rate much more appropriate than the sport watch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "b abney",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T18:00:49.000Z",
          "Titre": "I have used Fourth Frontier for over 1…",
          "Contenu": "I have used Fourth Frontier for over 1 year. It provides  much more information than Apple Watch or Whoop, both of which I have used. When I had problem charging the monitor, Support was on the phone with me to resolve the problem, and then followed up to ensure that the problem had actually been resolved."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ams",
          "Nb_Reviews": 5,
          "Date": "2023-10-06T18:55:30.000Z",
          "Titre": "FrontierX",
          "Contenu": "FrontierX have produced a product that enables you to train effectively and monitor the health of your heart. I purchased the device to monitor my arrhythmia, acquired from possible overtraining. I wish I'd had the device early, as it could have prevented damage to my heart. FrontierX are accessible and provide excellent backup.A must have device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim White",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T22:38:39.000Z",
          "Titre": "There's a New Kid in Town in the Wearable World!",
          "Contenu": "While there are still some software kinks to work out and some needed features, I will still give 5 stars for the level of data the X2 spits out compared to many other wearables. As a user of an Apple Watch Ultra, Oura Ring, Whoop, and Polar HR monitors, I have learned quite a bit about biometrics and wearables and the X2 provides a wealth of real-time information. I like the idea of using breathing rate as an indicator of strain versus solely relying on heart rate as most apps and wearables do.Customer service is very good so far as well. I have received prompt responses to my questions. I look forward to using the X2 to further improve my health and athletic performance."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Dagmar Schatz",
          "Nb_Reviews": 13,
          "Date": "2023-09-28T22:51:31.000Z",
          "Titre": "Excellent device - excellent staffers",
          "Contenu": "Since December 22, I have been consistently training with the device and I'm extremely pleased with the results. The device provides prompt responses to all my queries and the support team is always dedicated, knowledgeable and empathetic. If you want to prioritize your heart health, I highly recommend Fourth Frontier as an excellent place to start."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Middlesworth",
          "Nb_Reviews": 13,
          "Date": "2023-08-18T05:30:05.000Z",
          "Titre": "Frontier X2 Delivers",
          "Contenu": "I have had the Frontier X2 for a few weeks now and I can say it does an excellent job of tracking my heart rate, breathing rate, and heart strain. The continuous ECG has been a useful tool for assessing a heart beat issue that was going on during exercise. I have looked at the training data and advice that this tool provides and once I start serious training again I’m looking forward to using these features. I did have one issue with the phone app but that was quickly resolved by an email to the Fourth Frontier support desk. Excellent customer service! From what I have seen so far I strongly recommend this device."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dharmesh",
          "Nb_Reviews": 5,
          "Date": "2023-10-05T14:11:03.000Z",
          "Titre": "Love the HR monitor",
          "Contenu": "Love the HR monitor, using it for running cycling walking mainly for over a year. Used it to work out my FTP and even impressed my GP. Taking back control of my health from the state and industry."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Wing",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T14:20:18.000Z",
          "Titre": "I have become almost addicted to my…",
          "Contenu": "I have become almost addicted to my Fourth Frontier app these last 60 days. I am a 66 yo man with several chronic conditions. A healthy diet and a robust exercise regiment are essential,On Monday, July 10 , it appeared I had lost my 4 mile activity.  On Tuesday I emailed Fourth Frontier to see if they could restore my July 10 activity.Sneha responded back to me within 60 minutes - indicating that she was working my issue. I did not expect that level of service. By Wednesday,,July 12, my July 10 activity had been restored. These guys and gals are the best!??Chris"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Parsons",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T17:02:11.000Z",
          "Titre": "This product is excellent",
          "Contenu": "This product is excellent. I now just it exclusively as my heart rate monitor. It works very reliably and I have recommended it to friends who have had heart issues in the past. I have never seen any indication of heart strain from the app but it’s good to know it’s there as I do push myself very hard."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Rhoades",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T18:04:08.000Z",
          "Titre": "Everything advertised and more",
          "Contenu": "This device has everything it advertises. I love the ecg feature which I will use with my cardiologist. I’m currently using the alerts to train in zone 2 and love that feature. I’ve recommended this device to friends and family who are serious about their health."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joanne Isakow",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T19:13:33.000Z",
          "Titre": "Very responsive to problems I have been…",
          "Contenu": "Very responsive to problems I have been having with my unit. I look forward to having my issue resolved.I have been using my X2 almost for a 10 months issue free- great for people who like to push it hard during cardio, and to be cognizant of needed recovery. Like it so much I bought 2 more for my parents to wear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T16:51:42.000Z",
          "Titre": "Purchased the device on a whim",
          "Contenu": "Purchased the device on a whim, I have used other heart rate devices before but none with real time ECG. Thus far I have been super impressed with the fidelity of the data as a medical professional who works with ECG I have found it very interesting to go through my workouts and looks at how my data changes depending on the conditions. I have had no issues and been extremely happy with the purchse"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Antonio",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T13:25:15.000Z",
          "Titre": "One word....... Wonderful!!!",
          "Contenu": "One word....... Wonderful!!!since march 2023 i have had flutter/atrial fibrillation problems. With this heart rate monitor I'm able to monitor the behavior of my heart during my activities.Yesterday I met my cardiologist and he was amazed at how accurate the graphs were.GREAT!!!A special thanks to Sneha and Sana that helped me to solve an issue. A very good support service!!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "nirver sandhu",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T10:42:20.000Z",
          "Titre": "Recently purchased a frontier x2",
          "Contenu": "Recently purchased a frontier x2 from Amazon,great device,decided it was my best option following a cardiac ablation in June 2023.I had a problem with the ecg pdf option.I  was contacted by the support team and resolved the issue after about 40 minutes of a group video meeting with 3 participants.I wanted the device to allow me the confirmation that my heart had recovered fully before returning to normal exercise routine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T06:48:57.000Z",
          "Titre": "This devise is resilient",
          "Contenu": "This device is quite a feat of engineering, so after months of awesome results that helped me understand and manage my AFib, the device had a crash.  And though it's degree of disablement was multi leveled and uncertain, the techs were able to direct me to tutorials while also working behind the scenes. All is back to normal now, Both the hard and software are incredible"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 5,
          "Date": "2023-06-10T02:32:00.000Z",
          "Titre": "Outstanding  !",
          "Contenu": "Great product. Have just upgraded from the X to X2. The customer service is amazing. Questions are answered in a timely fashion. (Thanks Pavan!)I use mine primarily on a mtb and fat bike in the winter w the occasional gravel and road ride thrown in.Excellent information provided as well as extremely useful and functional app. I would recommend to anyone."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Bodhisattwa Dasgupta",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T09:27:33.000Z",
          "Titre": "Expensive but absolutely worth its salt...!!!",
          "Contenu": "A really useful device for athletes and extremely useful for those who are not so young. It gives you a wealth of data and also explains the data range. Over time, it provides you the trends so that you can understand how your fitness is shaping up and if there is anything thats needed to be done from fitness or health point of view. Expensive yes, but an absolutely worth one time investment."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr William Mcloughlin",
          "Nb_Reviews": 24,
          "Date": "2023-07-19T16:13:00.000Z",
          "Titre": "Customer service second to none.",
          "Contenu": "I needed some spare USB rubber plugs for my Frontier X2, so I contacted Fourth Frontier to see if they could furnish my requirements. I was contacted by Sneha who was only too happy to help. Sneha kept me up to date throughout the duration of my order. I can say with experience whilst dealing with Fourth frontier on this occasion and in the past, customers service support is second to none."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Niels Voigt",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T15:37:57.000Z",
          "Titre": "Nice details great overview.",
          "Contenu": "Beautiful extension for my feedback materials that I use. For years I worked with polar cheats staps and lots off apps. This FF X2 brings ecg to your fingertips. Nice details good overview and for me a 🔑 in understanding more. Living the 20 sec ecg strip while scrolling through the recording.Thanks a lot for bringing this to the market.Niels Voigt"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JDTrade",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T18:55:44.000Z",
          "Titre": "My 4th and best heart rate monitor I have tried",
          "Contenu": "I love having access to my heart health, especially knowing heart disease does exist in my family history. The onboarding call is so cool to help answer any questions and understand how to maximize the benefits of the product. I also love the recommendations on how to improve on previous workouts. $500 isn't cheap, but I feel it's well worth the price, highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "S Kumar",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T10:47:10.000Z",
          "Titre": "Motivation and safety",
          "Contenu": "I was worried about getting back into exercise after a recent health scare. I bought the Frontier X2 to help monitor my heart and hopefully provide some peace of mind.  The device lets you set strain and heart rate limits and vibrates if you exceed those.  The device also provides a detailed continuous ECG for long workouts and lets me generate pdf reports of the entire ECG. The training load feature is also motivating. It tracks your exercise throughout the week and provides total weekly exercise recommendations. So far it’s helping me get back on track!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T10:21:38.000Z",
          "Titre": "This device is really useful",
          "Contenu": "This device is really useful. I share the same device with my husband, it's really easy to switch between accounts. You can set limits for buzz alert, it gives vibration once you exceed the set limit really useful feature. ECG recording quality is very impressive. Over all worth it. Customer Support is good, he answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Riddell",
          "Nb_Reviews": 2,
          "Date": "2022-12-15T22:12:28.000Z",
          "Titre": "Loving the X2!",
          "Contenu": "Loving the product. Ease of use and form are fantastic. Updates are coming along nicely and definitely improving the experience.Works nicely away from my phone too. Wore it during pick-up hockey and it recorded data with little interruption, even under my shoulder pads and with some physical contact."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Cunningham",
          "Nb_Reviews": 8,
          "Date": "2023-09-15T21:18:03.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "Outstanding Customer ServiceMy heart rate monitor wasn't charging correctly, contacted Frontier and they had us run thru different troubleshooting and we provided a video of what is happening when we plug it in to recharge. They identified it was an issue and shipped me their latest Frontier monitor with the new magnetic charging cable/system. So much better than the previous charging system. Pavan was great, he was in constant contact with me and always following up, the best customer service. The product is great, I love using it and it monitors my ECG when exercising since I have AFIB so it is crucial for me to have something like this"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "nadir mir ali",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:40:52.000Z",
          "Titre": "This was a great experience",
          "Contenu": "This was a great experience. First the person spoke flawless English. She is also from the same town that I grew up in. Quite experienced. Solved my problem immediately. Also offered to send me the USB cover that I lost. I think that this company is going to go places. So far I have spoke with Abhimanyu, Peter and now Sana from the company and all of them are extremely helpful and courteous.Nadir Ali, MDCardiologist based in Houston, Texas"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike Riley",
          "Nb_Reviews": 10,
          "Date": "2023-09-06T19:32:06.000Z",
          "Titre": "A very good level of response",
          "Contenu": "A very good level of response to my issue which sorted my problem quickly.   I really enjoy using the monitor as it gives me comfort when I train that I am not over stretching myself."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr William Mcloughlin",
          "Nb_Reviews": 24,
          "Date": "2023-07-28T09:03:05.000Z",
          "Titre": "Retrieved Lost Data",
          "Contenu": "I recently removed my HRM without stopping the activity in the app. I noticed that the data of my activity had not been automatically synced to my activity history. I contacted Fourth Frontier and they helped me with retrieving the data. This company gives superb support everytime no matter the issue."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Ananth Narayan",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T17:58:58.000Z",
          "Titre": "The best on this galaxy",
          "Contenu": "In terms of precision and perfection, you guys are the best monitor on earth. Customer service is also absolutely amazing. My monitor konked the second day, no questions asked, they replaced it with a new one. Just Pls work on displaying calories burnt plus theres a lag of 5/10 seconds on the double buzz when it crosses the set heart rate limit. My heartful thanks to you guys for coming up such a wonderful gadget.. literally my heart <3"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Cesar Cortez",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T12:54:48.000Z",
          "Titre": "The team is just amazing!",
          "Contenu": "The team is just amazing. Anything i ask in the live chat is responded to in just minutes if not seconds. If they can't quickly resolve the issue they politely referred me to members of the team that are experts on the matter. Of the hundreds of products that i've bought in the past upto present, fourth frontier is probably in the top 2 in terms of customer satisfaction. FrontierX2 is awesome but what makes it even more satisfying is that quality aftermarket service is exemplary! I won't hesitate to promote this product to my friends. Kudos! Keep it up! God Bless guys!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Prabhat Agarwal",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T06:30:22.000Z",
          "Titre": "Helpful in improving cardiac health after MI",
          "Contenu": "I am 58 years old and have had two emergency angioplasties - in 2017 and 2021. I gave up smoking after the first one and decided to something about my cardiac health after the second one. I procured the Frontier X Device and subscribed to their Frontier Heart Program. I am happy to report that my cardiac health has improved considerably in the last 18 months with the guidance of the Frontier cardiac coach as per my Stress TMT reports and One Mile Walk test. In addition I am also assured that my ECG and heart health is looked at on a weekly basis by experts and any signs of coronary blockage will hopefully be spotted on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T17:21:41.000Z",
          "Titre": "New Fourth Frontier User for Walking/Hiking/Running",
          "Contenu": "I have used Fourth Frontier for a few walks now and I'm happy to use it for tracking my heart rate so that I don't over exert myself when exercising. I also like the additional alerts for heart strain and for the breathing rate.I was surprised to get a complimentary one on one call for a technical overview (Thanks Pavan!) and I will be attending a complimentary call with a health expert to review the health related questions I have with the device.Thanks Fourth Frontier and I hope to use your device to improve my cardio fitness!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan Gutkin",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T21:46:34.000Z",
          "Titre": "I have been using the device for my HR monitoring",
          "Contenu": "I have been using the device for my workout to assure that I ado not exceed 120 HR set by my cardiologist. I find that it’s the only device on the market that tracks critical data without the need for you to stop and wait and alerts you if you exceed set thresholds. Customer service is very good and receptive. I would highly recommend this product *****"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr William Mcloughlin",
          "Nb_Reviews": 24,
          "Date": "2023-01-04T13:18:05.000Z",
          "Titre": "The only HRM I use now.",
          "Contenu": "I bought the Fourth Frontier X2 a couple of months ago and have been using it when training on an Indoor smart bike. I have based my training on the useful training load score recommendations as set out within the Fourth Frontier mobile and desktop apps. The recommendations have enabled me to train more efficiently. I have 2 other HRM's but none come close to helping me acheive my training goal as this device does. Yes it is expensive but I feel that these benefits outway the cost. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Cesar Cortez",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T07:37:59.000Z",
          "Titre": "A few months after... a follow up review",
          "Contenu": "I've been using Frontier x2 for a couple of months now. Been using it in all types of activities... even during sleep. Juat an awesome device to have. It helps guide me on how to approach my daily training. Online staff is quick to respond to any inquiries. Very helpful indeed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian Duff",
          "Nb_Reviews": 3,
          "Date": "2023-09-22T15:16:34.000Z",
          "Titre": "Frontier X2 significantly better than basic HRM",
          "Contenu": "My Frontier X2 is such a significant step up in data access from my old basic heart rate monitors that I can't imagine exercising without it. Neither can my cardiologist."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon Cohen",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T22:29:06.000Z",
          "Titre": "Had a massive heart attack 2 weeks ago…",
          "Contenu": "Had a massive heart attack 2 weeks ago (which included 3 cardiac arrests) , and wanted immediately to \"look at my heart\". I refused to wear those little ECG boxes that cardiologists prescribe. I needed an alternative that my cardiologist and I could trust between the visits. Frontier X2 was the answer...  If the X2 reveals anomalies I may need to wear the little box , but in the meantime it's my best friend. I am looking forward when my X2 will be used not for medical purposes but to monitor my workout progress and good health. In the meantime, the X2 gives me some reassurance.It's a great product backed up with a very good customer service.Congratulations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Offutt",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T19:04:32.000Z",
          "Titre": "Very good and reliable recorder of multiple variables.",
          "Contenu": "After a small malfunction in the beginning - which your tech team fixed - it has worked perfectly over almost 200 sessions over the last 7 months.  I use it as a monitor for longer, more intensive aerobic endurance sessions.I highly recommend it for those who care about vitals when exercising for safety and track changes over successive workouts."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roger Hunter",
          "Nb_Reviews": 5,
          "Date": "2022-09-26T19:12:58.000Z",
          "Titre": "An excellent product",
          "Contenu": "An excellent product, though to gain the most from it you'll need an above-average understanding of data from an ECG.Support is outstanding.  The reason I mention this is because you'll probably need their advice at some stage as it's not as simple as a heart rate monitor.I've run for 40+ years and this device is the most accurate, informative and useful piece of kit I've ever owned.If you're serious about exercise or monitoring your cardiac health I suggest you buy one tomorrow."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Siddharth Shanbhag",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T20:42:34.000Z",
          "Titre": "The only device that can do ECG while…",
          "Contenu": "The only device that can do ECG while runningAfter a ton of research, I chose Frontier X2 (bought it on their website). Hands down the best form factor for long ECG recordings during my runs.   The data quality is pretty good for a device that can record ECG during my long runs as well shorter HIIT sessions.  Been looking for something like this as I enjoy long distance running and I've been worried about my heart health now that I'm in my mid 40s and have heart disease history in my family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darryl",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T18:50:10.000Z",
          "Titre": "Done with Polar products and decided to give FFX2 a shot",
          "Contenu": "I decided to take the plunge and get this piece of new technology. The Polar product (H10) had a lot of problems particularly with syncing - I spent anywhere between 15-25mins trying to get this to work before I played my sport oftentimes to no avail. Already bought two of them with straps which comes up to the half the price of the X2. The FFX2 has been superb. Support (Sneha) has been absolutely wonderful. I have the potential for SVTs which hopefully the latest attempt at stopping them (May 8th) will prove fruitful. I'm looking forward to interacting with the technical folks regarding details of my ECG signals. As I am ramping up my training and using the FFX2 as a guide to my progress, I am going to sign up for at least 2 months of tech support to go over data details during my workout sessions. HIGHLY RECOMMEND THIS PRODUCT. If you have cardiac challenges - this is the product to get."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "N M",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T18:24:08.000Z",
          "Titre": "Exceptional piece of equipment",
          "Contenu": "I was advised to use the Fourth Frontier heart monitor from the hospital as I had collapsed whilst I was training for no reason. So I used the monitor during any exercise. The readings were sent to the hospital and reviewed by the doctors. However, I was able to review the data myself via the app. It was excetionally easy to use and review. I was able to program it to alert me if I was outside my typical heart rate or if I had irregular beats. The service from team also was above and beyond. They emailed me if they noticed I hadnt trained for a while to check everything was ok. Would definaltely recommed this product and company to anyone without a doubt. Thanks Fourth Frontier."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Pritish Shah",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T08:57:26.000Z",
          "Titre": "Fast accurate and prompt support",
          "Contenu": "Fast accurate and prompt support , really good post sales service hopefully stays same way as they grow. Device is small slick and accurate. Overall high-end product but delivers on accuracy and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Broadbent",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T17:56:33.000Z",
          "Titre": "BEST experience ever-Frontier X2 purchase <3",
          "Contenu": "I purchased the frontier X2 about 2 years ago, and I was having a tough time financially, they let me return it and got my money back. Then, I bought it again, last year, and have just loved this device. I used it so much the power button eventually popped out. Sent it back recently, and they got me a replacement device with completely covered 2-day fedex shipping!  This is the BEST service I've ever experienced. 5 STARS EARNED!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Robertson",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:51:54.000Z",
          "Titre": "A step or two above the other chest…",
          "Contenu": "A step or two above the other chest heart monitors on the market. I am a number geek and really love the wealth of information I am getting from this device!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Art Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T22:00:15.000Z",
          "Titre": "Troubleshooting by tech support",
          "Contenu": "I have been using the Fourth Frontier chest strap for almost 2 years with only a few minor glitches. Recently, I was unable to sync the GPS data from my cell phone with the Fourth Frontier app. Tech support worked with me for several weeks to try to resolve this issue. We were not able to recover the data, but not for lack of trying. This issue has not recurred since this one instance. I am sure that, if another issue occurs, tech support will be there to attempt to find a solution. I am very happy with the device and the support I get from Fourth Frontier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna Fisher",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T23:07:59.000Z",
          "Titre": "best customer service EVER!",
          "Contenu": "As it turns out, I am not going to be able to use the device the way I had hoped (to alert me if I go into AFib).  Also, because I have a pacemaker, the heart strain function will not work for me.  Not knowing why the device was freaking beeping all the time, I reached out to customer service and got EXCELLENT service and responsiveness.  One of the founding physicians of this company got on the phone to explain things to me said that down the road, they may engineer the device to be able to do that, just not now.  Best customer service ever!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T17:27:41.000Z",
          "Titre": "Almost 50, Fourth Frontier is exceptional to monitor to heart health",
          "Contenu": "I have owned this monitor for about a year and nothing out gives the data fourth frontier does. The information provided is good intel for your cardiologist and allows you to closely monitor how your heart is functioning. Great product for healthspan!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Andreas G.",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T10:55:47.000Z",
          "Titre": "Excellent product, service team is very responsive",
          "Contenu": "I have been using the Frontier X since 2021 when I bought it for recording long-time ECGs. The Frontier X is extremely useful for this purpose because it allows to see irregularities in the ECG - which cannot be done with normal fitness watches.Since my first ECG recordings I have reported a couple of issues and I appreciate that this can be done directly in the Frontier X application on my phone. For all raised tickets I received an immediate response and noticed subsequent improvements through several new versions of the firmware (on the device) and software (of the app).  I think that this company and their product have gained maturity and I can (and do) recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rodd wagner",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T22:42:26.000Z",
          "Titre": "Fourth Frontier Heart Rate Device",
          "Contenu": "Fourth Frontier not only has the technology to track exercise ekg in addition to HR and breath rate; but their customer support is outstanding!  They also offer high quality coaching to help athletes train and compete safely.  Highly recommend this company and product(s)."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr William Mcloughlin",
          "Nb_Reviews": 24,
          "Date": "2023-06-14T17:14:28.000Z",
          "Titre": "Bought the Fourth Frontier X2 about 6…",
          "Contenu": "Bought the Fourth Frontier X2 about 6 months ago. I have too say it has enhanced my training through the training load data which gives you a training load percentage to aim for within a set time. Highly recommended and well worth the money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T18:52:31.000Z",
          "Titre": "Better than a smart watch for keeping…",
          "Contenu": "Better than a smart watch for keeping track of my heart!  This devices gives some incredibly detailed graphs and charts including a pretty high quality EKG. My gripe with smart watches is that you have to hold the watch with both hands to get an EKG and that too a short 30 sec view. Since this is worn on the chest it can pick up your EKG hands free. The other metrics such as heart rate, breathing rate, starin are pretty handy too, especially because I can set alerts for them and don't have to keep looking at a watch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:16:46.000Z",
          "Titre": "Great product and great service",
          "Contenu": "Great product and great service.  I ordered the X2 a few months ago and promptly received my order.  The device was easy to setup and use.  The data for heart activity was surprisingly detailed and the app and web portal was also easy to use.  After a few months I started having a small issue with the device.  I contacted the support team and received a prompt response.  The customer service group was knowledgeable and pleasant to work with. I provided the requested information about the problem and I received a new device within a few days.  I highly recommend the FourthFrontier X2 for anyone that is interested in monitoring their heart health."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nestor J Portillo",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T00:38:17.000Z",
          "Titre": "Fast and accurate support",
          "Contenu": "Had to reach out due to a small glitch with my device and I got a) fast response, b) Accurate instructions that solved my issue right away and c) nice follow up.Good customer service model and mindset."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ffx wearer",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T16:50:26.000Z",
          "Titre": "This is an excellent piece of kit.",
          "Contenu": "This is an excellent piece of kit.For anyone concerned or curious about their heart’s behaviour you must consider the Frontier X. It works, has been very reliable and the app seems to get helpful updates from time to time. I don’t connect it to my watch so can’t comment on the performance of that.I had an issue shortly after I’d purchased it and they sorted it out far better than I would have expected.Some kit you buy and regret, some is mediocre, this is spot on - it does more than I expected and it does it well."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Jon",
          "Nb_Reviews": 26,
          "Date": "2022-09-19T09:44:38.000Z",
          "Titre": "The device has been invaluable in…",
          "Contenu": "The device has been invaluable in getting back into an exercise regime and having peace of mind after been diagnosed with a cardiac issue.This is a really great product.I would love to see some extra functions and alerts and it would be great to be able to check on the current ECG that is been recorded during a workout.It would also be great to have a shortcut button in the app for an instant ECG."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Geoff Bannoff",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T22:49:32.000Z",
          "Titre": "Had a Frontier X for years, just got an X2",
          "Contenu": "I have had a Frontier X for several years, and recently upgraded to a Frontier X2 so I have a second one for travelling. This is a great product. In particular I find the \"heart strain\" metric very useful. I use this to push myself harder when I'm feeling healthy, particularly when I was running regularly.The Frontier X's heart strain reading was was my main metric during my recovery from long covid over 7 months. I learned that if I pushed myself too hard, I could get a couple of weird symptoms, but  as long as I kept my heart strain below a particular threshold (0.08 in my case), I could safely exercise. Without this, I likely would have been afraid to exercise at all, which would have prolonged the recovery period.Not a lot of difference between the Frontier X and the Frontier X2. A bit faster data transfer, but the same reliable information, presented in an easy to read format.I rely on my Frontier X, and it's been a great product. I highly recommend this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ali Behnam",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:37:34.000Z",
          "Titre": "great job supporting the product i had…",
          "Contenu": "great job supporting the product i had an issue and the support team was on it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Capability Brown",
          "Nb_Reviews": 54,
          "Date": "2022-11-23T14:29:53.000Z",
          "Titre": "Allows me to exercise in confidence",
          "Contenu": "My husband bought me this heart monitor after I had a heart scare. It allows me to get back to exercise without fear of over-doing things. I know that I need to rest when I get irregularities in frequency. Really great product. Super quality,  and a comprehensive app."
        },
        {
          "Note": 5,
          "Lieu": "IQ",
          "Pseudo": "Mazen Shiekh",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T18:41:35.000Z",
          "Titre": "Finally, sth that does deliver",
          "Contenu": "It has everything anyone needs. It is practical and reliable. I am using it as a training monitor and as a health monitor. I have tried so many from galaxy, Huawei, tag heuer watches and i own 3rd generation Oura ring. All not even close."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Trust Me",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T12:13:49.000Z",
          "Titre": "A year and a half in, still good.",
          "Contenu": "I've had a Fourth Frontier X since December 2021, the service and help from Fourth Frontier has been excellent from the start when I had a slight problem with the chest strap and they sent replacements immediately. I raised an issue with the web interface recently and had the same experience - they were straight on it and fixed the problem.The hardware itself is really very good. It seems to get frequent firmware updates and performs as well now as it did when it was new.The quality of the data coming out of it is excellent.I've recently upgraded my running watch to a Garmin 245 which has the correct Bluetooth capability to connect to the FFX, this is great because I now have reliable heart rate on my training records as well as the ECG traces on Fourth Frontier's dashboard.If you have an odd heart rythmn and are interested in monitoring it, this device really does do what you need.Oh, and of course you can set off an ECG and share it with your cardiologist live. That is a really cool feature."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hal Waldman",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T19:58:32.000Z",
          "Titre": "Fourth Frontier is a great device",
          "Contenu": "Fourth Frontier is a great device.  It has a wealth of data and is very easy to utilize.  There is an excellent support staff which are always available.  There is ample material to show your cardiologist. It is very easy to wear.  I strongly endorse this product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby G",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T23:38:14.000Z",
          "Titre": "Heart rate is accurate",
          "Contenu": "Heart rate is accurate; cadence is correct.  I really like the breathing rate and updates to correct any defects.  I run/bike/walk and appreciate the impact these activites have on the body.  The addition of O2 reading would be nice."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "S.G",
          "Nb_Reviews": 7,
          "Date": "2022-10-07T17:06:34.000Z",
          "Titre": "Most detailed heart wearable with unique metrics",
          "Contenu": "Great little device that has given me next level data on my heart health.I got it because i've been worried about my fitness and pushing my heart too far after getting covid a few times, so I wanted to get more detailed data about my heart and this is the only wearable I could find with continuous ECG. I cycle and run quite a lot so its been invaluable to know how my heart is doing and seeing the full ECG graph and other metrics like heart strain over time during my exercises has been really useful.The app UI is a little dated but overall it has more data and metrics than anything else out there which is the important thing for me because it's helped me exercise more confidently."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Alfred Appel",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T16:23:42.000Z",
          "Titre": "Frontier X registers excellent single lead ECG, even during intense workouts",
          "Contenu": "I use Frontier X, the first version, since 1 year now.The device works surprisingly well. It produces a nice, stable single lead ECG approximately equivalent to V5 even during heavy training sessions. The online app adequately indicates premature ventricular beats and bigeminy. A registration during several hours at rest nicely shows the influence of caffeine or alcohol intake on the occurrence of premature beats. The device is also easily recognized by Zwift, so it is very useful for indoor sessions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luca Pani",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T02:11:58.000Z",
          "Titre": "\"Unparalleled Precision and Outstanding Support: A Top Pick!\"",
          "Contenu": "I've used numerous health devices, but the FourthFrontier chest cardiac monitor truly stands out. Its accuracy and precision are unmatched, giving me real confidence in the data it provides. But what elevates my experience even further is their exceptional customer support. Anytime I had a query or needed guidance, their team showcased impressive technical skills and quickly addressed my concerns. This is not just a device; it's a comprehensive package of advanced technology and outstanding service. I wholeheartedly recommend it to anyone who values top-notch personal health monitoring."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kirstie",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T19:29:19.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service. I have had some issues with device turning off and not recording sessions so isn't full proof but their help always is."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T23:44:19.000Z",
          "Titre": "Great heart rate monitor",
          "Contenu": "Great products and fantastic communication when contacting them. I own the Frontier X and Frontier X2 and I needed something sorting on the Frontier X2 and everything was resolved within a week. Emails were quickly responded to and they were very proactive."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jason",
          "Nb_Reviews": 12,
          "Date": "2023-05-11T22:51:11.000Z",
          "Titre": "Great device…",
          "Contenu": "Very easy to use and accurate heart rate monitor and so much more. I need to watch my heart slight irregular beat so for me this is amazing. I had a small issue with it but Forthfronters customer service was the best I've received inn a very long time. thanks guys"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "sje",
          "Nb_Reviews": 3,
          "Date": "2023-05-20T13:40:54.000Z",
          "Titre": "Fourth Frontier X - Great product, great service",
          "Contenu": "I’ve been using Fourth Frontier X for about 18-months. It had a few glitches in the first 6-months but the firmware updates were frequent and every time I’ve sent a message to support with a minor problem, they’re super-quick to respond, swarm the problem, and get it sorted so quickly. They also make it so easy to submit problems, inviting you to do so, which gives you the confidence they’re keen to hear from you so they can improve the product. The support you get is best in class—they are so polite, effective and responsive.I’m a real advocate for the Frontier X device. I use it 2-5 times a week for cycling and, after a mild heart scare a few years ago, it gives me the confidence to go do what I love doing knowing the Frontier X is going to show up any problems (I’ve had none—so I’m living life to the full). It gives me the peace of mind, and my loved ones, knowing I’m not doing anything that’s damaging my heart.I can’t speak highly enough of the product or the post-sales support team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tarcisio Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T00:59:04.000Z",
          "Titre": "I love this device and all of its…",
          "Contenu": "I love this device and all of its features, especially the heart rate variability data.  This allows me to monitor my high stress workouts.  The support for the device is great, very responsive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Masarie",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T21:44:22.000Z",
          "Titre": "I like the product",
          "Contenu": "I like the product.  I was told that I could get one free consultation.  I can't find where this can be set up on web site.  I recently received and e-mail with a link to schedule a meeting but the link took me nowhere.  Just blank page.Follow up (2022 12/12):  FF responded immediately to my inquiry.  I had a video conference with a doctor and he helped me set up a meeting with one of their medical outreach experts.  I just now completed the 30-minute meeting and it was incredible.  The expert was enthusiastic; extremely knowledgeable, and presented the concepts very clearly and thoroughly.  I learned so much in the 30-minute session and was very, very impressed.  I've change my rating from 3 to 5 stars.  Well done FF!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ritu Singh",
          "Nb_Reviews": 3,
          "Date": "2023-03-04T20:45:08.000Z",
          "Titre": "Useful Device, Quite pleased with the Frontier X2",
          "Contenu": "I’m quite pleased with the Frontier X2. I really like the heart insights arrhythmia or abnormal rhythm pie chart that I get at the end of my workouts. I was concerned about PVCs in the past, so I’m glad to have a device that can help me monitor that during my workouts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 5,
          "Date": "2022-11-20T22:11:17.000Z",
          "Titre": "Great product",
          "Contenu": "Great product.  Great support.I've been using the original version for a while.  It's been durable (lasted through a good mtb crash).  I did manage to lose the dust cap for the charging port . I'm using it for cycling/hiking/snowshoeing so a piece of tape has worked to protect it.  Probably not a good idea if you swim with it. The reports and format are useful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Burns",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T17:24:48.000Z",
          "Titre": "Frontier X helped me get a quick diagnosis",
          "Contenu": "Frontier X allowed me to track Atrial Flutter that was occurring many times daily, but never in the doctor's office. My primary referred me to a cardiologist (again, normal EKG in office) and I was able to show him multiple EKG's from the Frontier X documenting rapid heart rate.He scheduled a stress test, multiple arrythmias were observed, and I'm scheduled for an ablation procedure next week. I probably would've dismissed the palpitations if I hadn't had the reports from Frontier X to show my doctor. I look forward to using it as I begin my recovery from the ablation."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Matthew Elmes",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T11:12:48.000Z",
          "Titre": "Great device, great service",
          "Contenu": "Great device! Connected immediately. No tech head scratching involved. But what really made the difference was the product support. They are there for you and they know their product. Very happy 😃"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 2,
          "Date": "2023-04-26T22:03:05.000Z",
          "Titre": "My adventure in wearable monitoring…",
          "Contenu": "My adventure in wearable monitoring devices continues with the Fourth Frontier X2 heart monitor. I like the ability to monitor my heart strain along with live heart rate, cadence and HRV. I'm still learning the intricacies of the device, but have been very pleased with the promptness and knowledgeability of the support staff in response to my science nerd questions!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jon Seymour",
          "Nb_Reviews": 4,
          "Date": "2023-05-16T15:35:25.000Z",
          "Titre": "Had a problem with the device not Charging",
          "Contenu": "Had a problem with the device not charging. The online chat took a bit of time but the problem was resolved. Happy with the services I received.Kiran (the support officer) was very professional."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Santos",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T09:15:01.000Z",
          "Titre": "You wana know why this is an expensive…",
          "Contenu": "You wana know why this is an expensive item?Because it works perfect and the support if you need is amazing weldone  many thanks for prompt support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ericbs",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T15:23:13.000Z",
          "Titre": "This device is great",
          "Contenu": "This device is great. I had heart surgery 4 years ago and I'm very athletic. So I wanted something to track my heart during bike rides and workouts. The Frontier X gives me that. I can check it after my workout and see an EKG of my heart and see how it reacts during each part of my my ride. I also have other devices to track my sleep and HRV and the Frontier X definitely helps to see whats happening inside my body."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Anthony Quiles",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T05:42:04.000Z",
          "Titre": "it was a learning experience",
          "Contenu": "it was a learning experience, there's a lot of information to digest, but, I happy to have it all. also knowing my accurate heart rate is comforting, and being able to set the limits a pleasure. with limits set, I don't have to constantly look at a screen. all in all a great experience."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Harry marsh",
          "Nb_Reviews": 11,
          "Date": "2023-05-13T11:50:17.000Z",
          "Titre": "An excellent device for exercise and…",
          "Contenu": "An excellent device for exercise and just monitoring your health and heart rate generally. I’m 57 and use my monitor so that I can exercise without safely without over exerting myself as well as reviewing my performance and checking that I’m exercising in the most optimal way for my age and level of fitness. This device is good for anyone at any ability who exercise regularly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Brigitte Small",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T15:55:52.000Z",
          "Titre": "Interesting data!",
          "Contenu": "The data I get from this device is super interesting - in particular continuous traces during exercise, breathing rate, heart rate and HRV. It’s fascinating to exercise and leave the device on for an extended recovery period. The graphs and charts in the web app make it easy to look through your workouts and see where you pushed yourself and how your body responded. Comparing HRV changes before and after exercise is interesting and helpful for exercise programming."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Luc Hendriks",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T07:57:53.000Z",
          "Titre": "Great!",
          "Contenu": "Been using it for around 2-3 months every day and it's a great product, does exactly as advertised. Customer service is top notch as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Carter",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T19:10:25.000Z",
          "Titre": "Very responsive tech support",
          "Contenu": "Very responsive tech support. Emailed me back with detailed instructions, so none of this back and forth. The person responding knew their product."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ams",
          "Nb_Reviews": 5,
          "Date": "2022-11-26T00:05:17.000Z",
          "Titre": "Provides continuous ECG data to help…",
          "Contenu": "Provides continuous ECG data to help you monitor your heart.Excellent for helping you to e ercise and train safely or to monitor yourself for possible heart issues.The company is very approachable."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Muhamed Shebin",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T18:57:17.000Z",
          "Titre": "Great Bluetooth Connectivity, Great Device!",
          "Contenu": "I have certain expectations for a portable EKG monitor, especially because I needed it for my dad who has atrial fibrillation. I have been pleasantly surprised by the Frontier X2 Portable EKG Monitor. It was packaged safely and professionally. The instructions are easy to follow. It is recommended to charge the monitor before use, but I was able to use mine straight out of the box. The size of the monitor is compact, but still offers good screen quality. The monitor also offers different leads to check. Viewing the EKG On my computer and smartphone is very easy on the Fourth Frontier Website. I used the website provided for the download. I would recommend the Frontier X2 Portable EKG Monitor.I have seen reviews which say the device has connectivity issues, but my experience is just the opposite, working very smoothly without any connection issues. This is totally worth every penny. Probably one of my best purchases ever on Amazon. It’s small, compact and accurate!Great Device"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anthony Gregory",
          "Nb_Reviews": 5,
          "Date": "2023-02-02T11:50:43.000Z",
          "Titre": "I’ve purchased one of your heart rate…",
          "Contenu": "I’ve purchased one of your heart rate monitor’s and yes it’s giving me insight to my Atrial Fibrillation which is now persistent A/Fib yes 24/7. As of May 2022 I had moderate dose of COVID 19 requiring A/E admission with HR from 64 to 200 bpm, one day prior to this I had ridden 88 miles at average speed 20 mph  with no heart rate issues and having used this training route before I had heart rate and power data and Peak flow data. The only data to show changes worth noting was my breathing rate and peak flow peak flow down by 150 mls and breathing rate 28 to 30  my perceived rate of exertion higher based on reps.Woken at 0500 with palpitations heavy chest the rest is now history, as a cyclist having raced for 50 years A/Fib was likely to occur  echocardiogram  due this week and then ablation soon after then hopefully normal sinus rhythm and that where fourthfronter comes in I can set tight alarm limits so lessen the risk of over doing it, but it will give me early warning of cardiac strain.My back ground retired anaesthetic nurse and Advanced life support provider.RegardsVicGregory"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "david arnold",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T14:38:31.000Z",
          "Titre": "Outstanding support",
          "Contenu": "Outstanding support. I opened a ticket and had a solution within 4 to 5 hours that corrected the issue. Can't beat that!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "paul haslehurst",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T10:43:54.000Z",
          "Titre": "My Fourth Frontier is mainly used to…",
          "Contenu": "My Fourth Frontier is mainly used to record my heart problems. Last year, I emailed some ecg results to my Cardiologist as I was having approximately 1500 extra beats per day and episodes of multiple extra beats as I thought. Based on what he saw, he changed my medication to reduce my extra beats to a more managable level. He also confermed that  I had AF again, I had two ablation operations 9 years ago. Having a Fourth Frontier means if i'm feeling unwell I can check what is happening in real time, as I can see live data on the smart phone app. I can also get a full 24hour recording if needed and as I have done before, email it to my Doctor/Cardiologist.Cost wise it is equal to my Omron ecg monitor. But for use it is much better, as you can record for as long as you want or the battery lasts, the Omron can only do 30 seconds. Looking at my ECG's I can even tell if the extra beat comes from the top or bottom chambers of the heart.  I've never been to a hospital appointment before where the cardiologist knew what he was going to do before I even entered the room, thanks to the Fourth Frontier ECG's I had sent him previously. Overall an excellent piece of equipment, compatable price wise with some medical grade ECG equipment, but so much easier to use especially for irregular heart beats."
        }
      ]
    }
  ]
}