{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "geekstudio.us",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George D..",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T19:34:40.000Z",
          "Titre": "Not at all satisfied with My experience…",
          "Contenu": "Not at all satisfied with My experience with Henry Adam's, not only was he very hard to understand. He was unable to fix my problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken homeowner",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T14:04:39.000Z",
          "Titre": "New HP printer instructions QR code did not work",
          "Contenu": "This company claims to be A rated by Better Business Bureau. They lied!  Google the Better Business Bureau and search their site.  Geek Studio is NOT accredited period. This is a slick outfit and they will rip you off.  They will install LogMein Rescue Unattended software on your computer which means that they can get into your computer without your knowledge.  Do NOT, I repeat Do NOT allow them to touch your computer.  Hang UP!  I was connected to them by \"HP Support\" so I thought it was legitimate.  Real HP Support would help you start up a new printer for free.  These people want BIG BUCKS.  Again, HANG UP!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T04:34:08.000Z",
          "Titre": "DON'T USE THEM…",
          "Contenu": "I spent hours on phone with who I thought was Canon.  Then trsnsferred to HP then Geek Studio.  I just needed scanner to see new Laptop. I just got laptop today.  They said I had Chinese viruses and Trojan virus.  Charged me $163.  Then said done.   I said you haven't done what I've asked 35 times since I first called.   I questioned him too much.   He said did I want money back.   I said I'll call Canon and HP tomorrow so he got mad and messed up my laptop.  I shut laptop but not fast enough. There is no credit so I will have to dispute charge!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler H..",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T12:27:56.000Z",
          "Titre": "Helpful Seem to get everything working",
          "Contenu": "Scam don’t do it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie Fensterstock",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T17:40:25.000Z",
          "Titre": "I have been scammed",
          "Contenu": "I have been scammed.  This company is not part of HP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T01:38:27.000Z",
          "Titre": "Poor service",
          "Contenu": "The technician was very rude to my wife. In addition it took him 2 days just to protect my software and connect to my printer. He had terrible customer service skills and we only used him because HP said we had to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Wagman",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T21:53:00.000Z",
          "Titre": "Geek Studio has hacked every device…",
          "Contenu": "Geek Studio has hacked every device since 2019. They continue to do so, I am in their system. The company I started to use was changed from “Sysvantage” to “Geek Studio”, that’s when they took control of my phones and laptops. The call my landline 📞 every day multiple times and still do only to harass my wife and I.  They used my credit card number to make at least five purchases. They are are group professional Hackers / Scammers. They can do you a lot of harm. The police have heard 30 harassment messages on my landline and saw all the fraudulent documents that I printed out and many emails as proof. All the authorities are aware and looking into these ($&”@sob). Be Safe and careful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Cancillieri",
          "Nb_Reviews": 2,
          "Date": "2022-07-25T08:12:32.000Z",
          "Titre": "These people tried to steal from my…",
          "Contenu": "These people tried to steal from my elderly parents a year and a half or so ago. They had the audacity to contact them again last week. I reported them to Hewlett Packard as they ARE NOT BUSINESS PARTNERS with that company (confirmed with HP's fraud division) and I reported them to the Better Business Bureau as well. HP said anyone can claim anything they want on their websites and there is nothing they can do themselves. These people are slick and were VERY aggressive when confronted. I'm in shock that they would even contact my parents again let alone try to get money from them - again. Here is a copy of the review I posted last year on Yelp for the scam details:1 year ago on YELPThese people are a scam. They conned my elderly parents twice, the first time in August and then again this week. They claim to be business partners with HP - which I confirmed they are NOT. They are not affiliated with Microsoft and they are not BBB approved. Their website looks legitimate. BEWARE. The scam? They got my parents to pay them for a contract to troubleshoot tech issues and to safeguard their home pc. The Geek Studio was given full access and loaded a program to my parents home conputer. Six months later, i believe they dropped a virus on my parents computer. The Geek Studio called the minute the alleged hack occurred saying they got an alert. William, the tech, claimed the service contract my parents had didn't cover ransomware and that they now needed to pay the Geek Studio $995 to stop the virus. The $995 price was for 5 year contract to safeguard my parents IP address and against all other breaches. They then offered my parents a lifetime plan for $1450.00 - and because my parents were \"good clients\" The Geek Studio gave them a \"deal\"or $1250.00 for a lifetime of \"protection \".THIS WAS ALL BS. When I researchered The Geek Studio I found others they took advantage of too. And as I said, I contacted HP immediately and confirmed my theory. I then contacted the Geek Studio directly and had to deal with a nefarious, hostile man named Gary. Let me say this man is nightmare. When I refused to relent and threatened legal action - which I will still pursue- they caved and refunded my parents the $1250.00. We were forrtunate to get the money back. But the damage and time lost and all of what we now have to do with fraud alerts, changing accounts, passwords and all that comes with this kind of crime is time consuming and stressful. Please, do not trust these people. DO NOT PAY THEM FOR ANY SERVICE. DO NOT GIVE THEM ACCESS TO YOUR COMPUTER. These people are well organized and their website looks professional. They are savvy perpetrators and they prey on people with limited tech knowledge."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Riley E..",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T00:41:50.000Z",
          "Titre": "Trying to get to the point more instead…",
          "Contenu": "Trying to get to the point more instead of constantly putting me on hold, hanging up, and telling me he would call back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rebecca L...",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T18:39:00.000Z",
          "Titre": "Problems were taken care of by the…",
          "Contenu": "Problems were taken care of by the technician. very glad purchased the plan. Keep up the great assistant."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandra W..",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T20:55:23.000Z",
          "Titre": "i thought the service was great",
          "Contenu": "i thought the service was great! i would recommend it to other people thanks alot for your help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith C..",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T18:35:15.000Z",
          "Titre": "these technicians are very competent…",
          "Contenu": "these technicians are very competent and knowledgeable about there profession 5 stars"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ivan",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T22:12:04.000Z",
          "Titre": "Service of the represenative was…",
          "Contenu": "Service of the represenative was excellent. He was patient and very professionial"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bennett Norman",
          "Nb_Reviews": 2,
          "Date": "2022-03-30T20:58:30.000Z",
          "Titre": "The help was excellent because I tried…",
          "Contenu": "The help was excellent because I tried everything else and wasn't working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arnett L..",
          "Nb_Reviews": 2,
          "Date": "2022-03-22T22:12:24.000Z",
          "Titre": "Good",
          "Contenu": "Job well done by George Davis. He was very professional and helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John M Jr",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T21:14:50.000Z",
          "Titre": "VERY PROFESSIONAL",
          "Contenu": "VERY PROFESSIONAL, HELPFUL & COURTIOUS!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aurora M..",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T19:26:51.000Z",
          "Titre": "thankful appreciate your service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carolyn O..",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T23:04:52.000Z",
          "Titre": "satisfied from the services"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shabaka D..",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T01:08:41.000Z",
          "Titre": "The service was very well",
          "Contenu": "The service was very well, good customer service it took longer than expected, but it was worth it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T17:01:55.000Z",
          "Titre": "I ordered a new hp printer",
          "Contenu": "I ordered a new hp printer. It took 4 hours and $100 to the Geek Squad to get it up and running. Not what I expected. It does run well now, and it prints and scansThe tech from Geek Squad filled out the review; I was not satisfied with the explanation for the needed repairs. My computer worked well with my old printer but developed mysterious connection issues to the new printer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jack Cowart",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T20:27:42.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, took too long, but resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JONESIN FREIGHT INC",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T16:04:55.000Z",
          "Titre": "I truly wanna give 5 stars",
          "Contenu": "I truly wanna give 5 stars, but to quote an old cliché \"The jury's still out\". What I mean by that is I don't know how this is gonna play out over the next six months. If everything works out like it's supposed to I'd give five stars, I mean the proposal that I am protected now is a novel idea, but it's one of those things that only time will tell."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark E..",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T20:36:12.000Z",
          "Titre": "I would like to thank George ant fine…",
          "Contenu": "I would like to thank George ant fine support team for the help they have given me on this matter with my computer that I have. I now have a better understanding on what is going on with hackers and what they can do to a computer and other device that you have. if i have any problems ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Demberg",
          "Nb_Reviews": 3,
          "Date": "2021-07-08T15:58:04.000Z",
          "Titre": "I called Geek Studio for my computer…",
          "Contenu": "I called Geek Studio for my computer problems which were satisfactorily resolved by Geek Studio. The technician also gave me information about the technical issues I was facing on my device. He was very professional and knowledgeable. I am Satisfied with the result.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne Simon",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T18:08:30.000Z",
          "Titre": "I have purchased a 5 year plan and…",
          "Contenu": "I have purchased a 5 year plan and asked to say how it is going. I have had the service for 24 hours, how could I give any honest review when i have no time for a test period? The staff seems knowledgeable so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Teresa S ..",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T17:43:52.000Z",
          "Titre": "George !!",
          "Contenu": "George was extremely patient and kind not to mention his excellent technical skills. My computer and printer are ready to begin my new business venture. I highly recommend it!Teresa Stone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda Cummings",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T21:16:58.000Z",
          "Titre": "Jeff was very patient with the process…",
          "Contenu": "Jeff was very patient with the process and never gave up. He us his skills wisely until he resolved the issue. Thank you, Jeff, for helping me today."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrice Moore",
          "Nb_Reviews": 3,
          "Date": "2021-06-17T21:44:07.000Z",
          "Titre": "Jeff was such a great help with…",
          "Contenu": "Jeff was such a great help with installing my Microsoft information. I would recommend this services to anyone. Thanks Jeff for all that you have done to make my day wonderful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary M ....",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T00:28:54.000Z",
          "Titre": "very knowledgeable and patient with me",
          "Contenu": "very knowledgeable and patient with me.  thanks for doing everything to try and save my printer.  thanks for all of your hard work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret Rephen",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T22:31:09.000Z",
          "Titre": "the service was well explained",
          "Contenu": "the service was well explained. the provisions were made to resolve my problems in a way that was complete and more than satisfactory."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald  B..",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T22:36:55.000Z",
          "Titre": "Thank…",
          "Contenu": "Thank you to everyone that helped me today. I will call you if I need any help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Meddy L",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T21:43:44.000Z",
          "Titre": "Thanks for fixing my printer issue.I am…",
          "Contenu": "Thanks for fixing my printer issue.I am happy with services provided by Geek Studio."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T01:03:05.000Z",
          "Titre": "I liked that the problem got fixed",
          "Contenu": "I liked that the problem got fixed.  It took a while.  Seemed complicated.  Service Technician was excellent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AMOGE O..",
          "Nb_Reviews": 1,
          "Date": "2021-08-24T01:49:02.000Z",
          "Titre": "Service i received was great",
          "Contenu": "Service i received was great . tech was patience and told me every thing about my printer & computer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "carol marell",
          "Nb_Reviews": 4,
          "Date": "2021-04-07T18:57:18.000Z",
          "Titre": "The service was the best I have had…",
          "Contenu": "The service was the best I have had from any agency I have contact with.Thanks Geek Studio for your help"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John T Wilkinson",
          "Nb_Reviews": 2,
          "Date": "2021-07-26T21:17:41.000Z",
          "Titre": "The George and team are great",
          "Contenu": "The George and team are great.  Thanks for all your help and the confidence you have restored."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laura K..",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T18:47:35.000Z",
          "Titre": "Alright service ...",
          "Contenu": "The service was fine. A bit impatient at the end but otherwise pretty good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John H",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T21:07:19.000Z",
          "Titre": "Thank you for the support,I will call…",
          "Contenu": "Thank you for the support,I will call you If I need any help"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alfreda M..",
          "Nb_Reviews": 1,
          "Date": "2022-04-23T20:55:24.416Z",
          "Titre": "Thank you the support.i will call you…",
          "Contenu": "Thank you the support.i will call you if i need any help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dianne L..",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T18:14:25.000Z",
          "Titre": "Service was helpful and computer and…",
          "Contenu": "Service was helpful and computer and printer are working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carrie Ohlson",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T23:46:59.798Z",
          "Titre": "great service",
          "Contenu": "great service, very efficient, explained things well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maria Martens",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T02:07:41.000Z",
          "Titre": "We appreciate the help this afternoon…",
          "Contenu": "We appreciate the help this afternoon and evening.  Earl and Mary"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Svetlana D....",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T23:49:05.000Z",
          "Titre": "I am very thankful to George for all…",
          "Contenu": "I am very thankful to George for all his service and help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert J Garraty",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T20:40:02.000Z",
          "Titre": "Service was great",
          "Contenu": "Service was great . George Fixed my printer issue .Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet L..",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T23:03:49.000Z",
          "Titre": "Excellent Service provided by George",
          "Contenu": "Excellent Service provided by George . Very happy !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon Paul C..",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T19:53:55.000Z",
          "Titre": "service was excellent",
          "Contenu": "service was excellent. very patient as well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ray Clark",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T21:49:21.000Z",
          "Titre": "Happy with the service i received today…",
          "Contenu": "Happy with the service i received today by George"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret Mullenax",
          "Nb_Reviews": 2,
          "Date": "2021-08-20T18:06:04.000Z",
          "Titre": "HE  WAS VERY GOOD AND HELPED ME WITH MY…",
          "Contenu": "HE  WAS VERY GOOD AND HELPED ME WITH MY PRINTER"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Douglas K...",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T23:04:14.000Z",
          "Titre": "Service I received by George was  Very…",
          "Contenu": "Service I received by George was  Very Good !!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sylvia J C..",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T19:04:31.000Z",
          "Titre": "It was great",
          "Contenu": "It was great . I loved your service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Peterson",
          "Nb_Reviews": 7,
          "Date": "2021-06-10T19:44:47.000Z",
          "Titre": "Thank you Sam for the help excellent…",
          "Contenu": "Thank you Sam for the help excellent services"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pogo M Reese",
          "Nb_Reviews": 2,
          "Date": "2021-06-04T18:23:30.000Z",
          "Titre": "My tech was great",
          "Contenu": "My tech was great. He got my printer working"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Li-Wen Sa",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T00:32:16.000Z",
          "Titre": "Service was Great ..",
          "Contenu": "Service was Great ..Thank Geek Studio"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert ONeill",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T18:22:02.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Respnse time was excellent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rafael A..",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T20:50:00.000Z",
          "Titre": "This service was Amazing :)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle D..",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T22:07:35.000Z",
          "Titre": "Excellent Customer Service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alfredo B..",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T00:48:54.000Z",
          "Titre": "Extremely good",
          "Contenu": "Extremely good.  thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allan Butcher",
          "Nb_Reviews": 2,
          "Date": "2021-05-26T23:59:35.000Z",
          "Titre": "Great Service i received today !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ligia O..",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T01:39:49.000Z",
          "Titre": "Good Service",
          "Contenu": "Good Service. !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry W P",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:31:37.000Z",
          "Titre": "It was a long process",
          "Contenu": "It was a long process, but very worthwhile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Esmeralda F C",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T01:09:48.000Z",
          "Titre": "The on button to the 2 month old HP…",
          "Contenu": "The on button to the 2 month old HP printer laser would not  turn on...numerous methods were attempted with the Geek Studio technicians to no avail.  HP had to be contacted and there was a delay for the requirement of an invoice/receipt had to be presented.  Was a new avenue to experience this issue and has now been resolved. I await patiently for new HP printer  Sincerely, EFCavazos"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VJSMITH",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T01:24:05.000Z",
          "Titre": "Geek Studio was confusing at first",
          "Contenu": "Geek Studio was confusing at first - wondering if it was a scam.  However, after further investigation, they were very helpful and we look forward to working with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelby C..",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T14:47:46.000Z",
          "Titre": "I dont quite understand the technical…",
          "Contenu": "I dont quite understand the technical lingo, so Im trusting that George and the others who helped service my issue did just that. I appreciated how they took care of the problem remotely and didn't need to keep me on the phone to finish the job. I only wish the second person I spoke with had just as much patience and understanding as the first tech I spoke with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul K..",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T23:51:31.000Z",
          "Titre": "All issues seem to have been taken care…",
          "Contenu": "All issues seem to have been taken care and so far as i can tell at this point all is working fine. Thanks for  your assistance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis B",
          "Nb_Reviews": 3,
          "Date": "2023-07-06T23:39:17.000Z",
          "Titre": "Difficulties",
          "Contenu": "I always have difficulty understanding people with accents. The enunciation is not clear enough for me. Because I am hard of hearing the volume is not loud enough. Other than that the service was great and everyone showed a lot of patience with me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eleanor M S",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:45:27.000Z",
          "Titre": "They were very helpful and very patient…",
          "Contenu": "They were very helpful and very patient with me as we worked through the problems. i though i had some cyber protection but i did not so I am all set up now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael W",
          "Nb_Reviews": 4,
          "Date": "2023-05-09T02:22:49.000Z",
          "Titre": "I found the overall service to be…",
          "Contenu": "I found the overall service to be competent, friendly and patient.  I have a hearing impairment and sometimes really struggle to hear the other party.  That was the case today, but your team worked through it.I would recommend the Geek Studio service to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dolores S G...",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T01:19:35.000Z",
          "Titre": "Geek Studio service was good & techs…",
          "Contenu": "Geek Studio service was good & techs where knowledgeable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T04:34:46.000Z",
          "Titre": "A patient techician",
          "Contenu": "Technician was very patient with my old computer, and very thorough.But I do wish I can actually seeing his pointer left my computer screen. All I have left was a frozen screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William R..",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T20:31:57.000Z",
          "Titre": "You worked very hard to solve the…",
          "Contenu": "You worked very hard to solve the problem, but you said that it was a hardware issue and not a software issue.  so I still have a HP printer that will not feed the 2nd page or more of the document I need/want to print."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TGIRetired",
          "Nb_Reviews": 4,
          "Date": "2022-11-23T19:01:35.000Z",
          "Titre": "They have resolved issues for me but…",
          "Contenu": "They have resolved issues for me but they are expensive and the first package I paid for didn't cover everything.  So now I have paid for a second package that they claim will keep issues from occuring.  I sure hope so"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael M",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T01:28:14.000Z",
          "Titre": "I had a great experience today with…",
          "Contenu": "I had a great experience today with George. He was so knowledgeable and very pleasant to work with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Constantino M",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T22:18:10.000Z",
          "Titre": "Impressed with the knowledge your…",
          "Contenu": "Impressed with the knowledge your experts have. I was looking for a new printer or my old printer to get repaired for my official work. I am happy with the options they provided me with that worked with my budget."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary K M..",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T21:20:55.000Z",
          "Titre": "Good Job geek studio tech fixed my…",
          "Contenu": "Good Job geek studio tech fixed my computer & printer issue it took time, but the job was well done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert W G..",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T02:40:36.000Z",
          "Titre": "The service was quick and efficient and…",
          "Contenu": "The service was quick and efficient and geek studio reps were very friendly and professional. I am very pleased."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jodine",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T21:32:09.000Z",
          "Titre": "Tech was great",
          "Contenu": "Tech was great, efficient.  Could be a little more personable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gwendolyn D.",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T01:59:04.000Z",
          "Titre": "technicians very helpful and…",
          "Contenu": "technicians very helpful and professional, very pleased with the level of knowledge provided today."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Judith R..",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T00:40:40.000Z",
          "Titre": "I was very satisfied with over all…",
          "Contenu": "I was very satisfied with over all service I received today by Geek Studio . Tech were very kind & patience with me,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia A",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:30:02.000Z",
          "Titre": "The service was both helpful and…",
          "Contenu": "The service was both helpful and educational.  I appreciate the technicians who helped me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosemary J",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T22:16:40.000Z",
          "Titre": "The best thing about Geek studio’s…",
          "Contenu": "The best thing about Geek studio’s services is its ability to quickly figure out and resolve technical issues."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T21:11:53.000Z",
          "Titre": "The team has the best project managing…",
          "Contenu": "The team has the best project managing skills. Whenever I need them, they handle all the issues effortlessly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lois M",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T21:15:50.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service. Resolved all my printer issues remotely within minutes. Now it's working well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela L S..",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T22:11:04.000Z",
          "Titre": "Technician was so patient and kind",
          "Contenu": "Technician was so patient and kind! George helped me figure out the IT problem I have been struggling with for some time. Thank you so much!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony and Anita DeNiro",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T23:26:32.000Z",
          "Titre": "George was outstanding",
          "Contenu": "George was outstanding.  He worked the issue completely and was successful in restoring my printer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Damian H..",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T01:10:26.000Z",
          "Titre": "My printer was fixed along with the…",
          "Contenu": "My printer was fixed along with the security on my computer.  My computer also is running faster"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard W",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T00:23:41.000Z",
          "Titre": "Agent very knowledgeable",
          "Contenu": "Agent very knowledgeable. Was very satisfied with conversations I had with him. Would definitely keep using this service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy C..",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T21:54:15.000Z",
          "Titre": "Jeff was very informative",
          "Contenu": "Jeff was very informative. he fix my printer issue and its working now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirika B..",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T01:44:18.000Z",
          "Titre": "Excellent customer services",
          "Contenu": "Excellent customer services. Agent was able to assist me with my request for printer services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joan S",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T19:58:33.000Z",
          "Titre": "Got all the issues…",
          "Contenu": "Got all the issues resolved, and were extremely helpful. I will continue to use their services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas B",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T19:29:00.000Z",
          "Titre": "They were very fast and helpful",
          "Contenu": "They were very fast and helpful.  I had a positive experience and would recommend them to anyone who needs technical support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca A S...",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:14:47.000Z",
          "Titre": "He us his skills wisely until he…",
          "Contenu": "He us his skills wisely until he resolved the issue. Thank you, Jeff, for helping me today."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Wade",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T19:06:18.000Z",
          "Titre": "Very happy with service today",
          "Contenu": "Very happy with service today, everything explained in a way that was easy to understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Denise B..",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T23:00:51.000Z",
          "Titre": "Service was very good problems were…",
          "Contenu": "Service was very good problems were taken care of by the technician."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald McGeever",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T03:24:36.000Z",
          "Titre": "The young lady i was taking today was…",
          "Contenu": "The young lady i was taking today was very polite. She helped me out fixing my printer issue ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Hill",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T23:43:13.000Z",
          "Titre": "service was satisfactory as best I can…",
          "Contenu": "service was satisfactory as best I can tell as I need to confirm performance. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen Mc..",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T23:05:22.000Z",
          "Titre": "Thank you for your help",
          "Contenu": "Thank you for your help. the printer is now working after your long project to fix it.  I appreciate it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew H",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T02:36:56.000Z",
          "Titre": "experience was good",
          "Contenu": "experience was good. printer is working great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina O",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T21:13:06.000Z",
          "Titre": "Experts have enough knowledge for…",
          "Contenu": "Experts have enough knowledge for troubleshooting any kind of technical problem. Good customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy S",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T22:57:25.000Z",
          "Titre": "Whenever I am stuck with any IT issues",
          "Contenu": "Whenever I am stuck with any IT issues, your team is always be there to solve the same."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eve H..",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T20:09:52.000Z",
          "Titre": "Excellent!!!Jeff fix the printer issue…",
          "Contenu": "Excellent!!!Jeff fix the printer issue and its working fine now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Delwin R..",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T22:24:58.000Z",
          "Titre": "It was cool experience with geek studio…",
          "Contenu": "It was cool experience with geek studio tech today ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra B",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T22:16:04.000Z",
          "Titre": "Jeff did an excellent job",
          "Contenu": "Jeff did an excellent job; efficient, knowledgeable and sensitive to me, a really good addition to your tech staff."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luana M K...",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T00:54:06.000Z",
          "Titre": "Wonderful Services by Geek Studio",
          "Contenu": "Wonderful Services by Geek Studio . I m really happy with the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Herman Rodemacher",
          "Nb_Reviews": 2,
          "Date": "2023-07-17T19:59:41.000Z",
          "Titre": "Geek Studio",
          "Contenu": "Geek Studio did outstanding job, and I will recommend to everyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth V F.",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:07:07.000Z",
          "Titre": "Very good service and nice gentleman."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy M K..",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T03:27:13.000Z",
          "Titre": "A very good experience",
          "Contenu": "A very good experience. Had patience and answered questions thoroughly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael P V",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T23:44:06.000Z",
          "Titre": "Geek Studio services was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda S..",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T01:06:37.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent! Very quick and efficient. Thank you George Davis."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry h",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T03:36:17.000Z",
          "Titre": "Enjoyed the excellent service",
          "Contenu": "Enjoyed the excellent service. I am satisfied with the results.."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Regina A",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T22:59:42.000Z",
          "Titre": "Great experience with the team",
          "Contenu": "Great experience with the team, Jessica & Jeff as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel P..",
          "Nb_Reviews": 2,
          "Date": "2022-08-11T22:50:45.000Z",
          "Titre": "I am satisfied with the service …",
          "Contenu": "I am satisfied with the service  received.Thank you very much.Daniel Perry"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lenore W..",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T22:26:04.000Z",
          "Titre": "Good service geek studio fixed my…",
          "Contenu": "Good service geek studio fixed my printer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy B",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T19:44:59.000Z",
          "Titre": "The Geek Studio Cleanup and on my…",
          "Contenu": "The Geek Studio Cleanup and on my computer now its working good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Letecia Roper",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T21:26:05.000Z",
          "Titre": "Geek Studio are very professional…",
          "Contenu": "Geek Studio are very professional support personnel.I would recommend the Geek Studio to anyone having computer issues. The service was outstanding and very efficient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda F.",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T02:12:26.000Z",
          "Titre": "Answered all questions and had great…",
          "Contenu": "Answered all questions and had great timing on tech issue"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blair J.",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T01:13:27.000Z",
          "Titre": "Geek studio service was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray T",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T22:48:22.000Z",
          "Titre": "Had very good service",
          "Contenu": "Had very good service. Jeff fix my printer issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark W..",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T22:06:06.000Z",
          "Titre": "George was very helpful in all my…",
          "Contenu": "George was very helpful in all my problems and more..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jemimah M",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T21:13:23.000Z",
          "Titre": "very glad purchased the plan",
          "Contenu": "very glad purchased the plan. Keep up the great assistance."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Phillip Siviter",
          "Nb_Reviews": 3,
          "Date": "2022-10-28T23:45:27.000Z",
          "Titre": "Phillip J",
          "Contenu": "Great work, I satisfied with your work. Thank you, Jassica."
        },
        {
          "Note": 4,
          "Lieu": "BH",
          "Pseudo": "Yaw O A..",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T23:32:33.000Z",
          "Titre": "The Service is very good by Geek Studio…",
          "Contenu": "The Service is very good by Geek Studio Techs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David E F..",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T23:08:31.000Z",
          "Titre": "Very good service by Geek Studio"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bogdan Marinescu",
          "Nb_Reviews": 3,
          "Date": "2023-06-02T21:24:04.000Z",
          "Titre": "Very happy with Geek Studio Service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Syble A",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T23:17:17.000Z",
          "Titre": "thank you very much",
          "Contenu": "thank you very much. Thank you for fixing my printer Issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Y",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T19:01:12.000Z",
          "Titre": "I am pleased with the service",
          "Contenu": "I am pleased with the service. the technician was on point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lindsey B...",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T00:21:59.000Z",
          "Titre": "Its my first time visit & I am happy…",
          "Contenu": "Its my first time visit & I am happy with services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helen T..",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T00:37:56.000Z",
          "Titre": "Great Service by Geek Studio",
          "Contenu": "Great Service by Geek Studio. Really Happy"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Karen J..",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T02:53:44.000Z",
          "Titre": "very good patience was awesome"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marillyn S",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T23:55:27.000Z",
          "Titre": "Great Experience,",
          "Contenu": "Professional, courteous, respectful, informative and educational. Excellent consultant who went above expectations to resolve my concerns and create solutions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bohumil O..",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T02:41:35.000Z",
          "Titre": "your serviceman did very good job",
          "Contenu": "your serviceman did very good job! Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William B..",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T02:11:23.000Z",
          "Titre": "The service was fine they took care of…",
          "Contenu": "The service was fine they took care of everything I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David M F..",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T00:00:39.000Z",
          "Titre": "The service was prompt and very…",
          "Contenu": "The service was prompt and very helpful. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anya M..",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T00:59:15.000Z",
          "Titre": "Very responsive and helpful team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "No, why should I give my name?",
          "Nb_Reviews": 2,
          "Date": "2022-01-27T14:55:38.000Z",
          "Titre": "The tech that helped was very nice",
          "Contenu": "The tech that helped was very nice. Did the job, I suppose--i wouldn't know. Respectful and as quick as possible. Did not care at all for the review being completed, by him, right in front of me, typing the whole thing. Really, if he is instructed to do that, Geek Studio---get a clue, not at all a good idea."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michelle G..",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T20:50:46.000Z",
          "Titre": "The people were polite",
          "Contenu": "The people were polite. I found it difficult to follow some instructions because what showed up on my screen, initially, was not what the technicians were seeing. I was tied up for bout 4 hours altogether"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Kennedy",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T00:32:32.000Z",
          "Titre": "I needed help with my laptop and I…",
          "Contenu": "I needed help with my laptop and I called Geek Studio and i was working with Jeff he was able to fix my laptop and working with him was a great experience.  We worked together for two days and he had the skills and knowledge to put the laptop back in a conduction that it is like new. Thanks you Jeff very much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Drew S.",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T22:36:48.000Z",
          "Titre": "Very simple and understanding",
          "Contenu": "Very simple and understanding. Fast, helpful, good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl H..",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T23:13:23.000Z",
          "Titre": "Technician spent a lot of time trying…",
          "Contenu": "Technician spent a lot of time trying to resolve the problem re. set up of HP printer and basically was patient with one who is not technically proficient. His knowledge and directions were clear and appreciated. All my problems were resolved by him."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hyacinth M.",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T22:54:00.000Z",
          "Titre": "Jeff Marcus provided quick and…",
          "Contenu": "Jeff Marcus provided quick and understandable answers to all of my questions. Quick response time also. Very courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer L....",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T22:39:31.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, my experience was satisfactory!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia J H..",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T00:13:59.000Z",
          "Titre": "Very Helpful with my printer…",
          "Contenu": "Very Helpful with my printer installation and  other issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abby B..",
          "Nb_Reviews": 2,
          "Date": "2022-03-03T22:58:17.000Z",
          "Titre": "George’s service was excellent",
          "Contenu": "George’s service was excellent – he was able to get a replacement printer for me & cleaned up and installed safeguards on my computer.  Going forward, I look forward to enjoying my desktop again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl M Kraiza",
          "Nb_Reviews": 3,
          "Date": "2022-04-26T00:05:57.170Z",
          "Titre": "George from Geek Studio did an…",
          "Contenu": "George from Geek Studio did an excellent job retrieving all of my documentations that have been hacked off of my PC. It made me very nervous to have this happen. Thank you Geek Studio!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paunita C",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T21:36:31.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. i am happy with the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bethania C..",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T01:28:56.000Z",
          "Titre": "I am glad to have joined Geek Studio…",
          "Contenu": "I am glad to have joined Geek Studio Inc..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doree  M..",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T01:30:30.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service.  Hewlet Packerd service not working to download soft ware. Alternative was provided with assurance that HP software should be up and running soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna J B..",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T02:09:02.000Z",
          "Titre": "Customer service from geek studio was…",
          "Contenu": "Customer service from geek studio was excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith E ..",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T21:49:47.000Z",
          "Titre": "My HP printer is fixed and running…",
          "Contenu": "My HP printer is fixed and running smoothly now. Thanks for quick support. I would call you again if any problem comes up with my HP printer again. Very Helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula J..",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T02:29:18.000Z",
          "Titre": "Good Service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vada P..",
          "Nb_Reviews": 1,
          "Date": "2022-04-20T01:04:50.696Z",
          "Titre": "Called up for help installing new…",
          "Contenu": "Called up for help installing new printer. The process took about Less Then 2 hours but now it it is done successfully. Thanks, Jeff, for good service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas E R",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T22:54:27.000Z",
          "Titre": "Thank you for the support Jeff."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rita Wilson",
          "Nb_Reviews": 3,
          "Date": "2022-12-09T21:04:06.000Z",
          "Titre": "Very helpful polite and knowledgeable",
          "Contenu": "Very helpful polite and knowledgeable Resolved computer issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Candace A. R..",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T21:59:04.000Z",
          "Titre": "Fantastic!",
          "Contenu": "Very professional and helpful.  Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Curtis Gayden",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T22:55:15.000Z",
          "Titre": "Good customer service I have ever…",
          "Contenu": "Good customer service I have ever experienced for all my professional requirements."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David B",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T01:31:37.000Z",
          "Titre": "the sevice was very good and the teck…",
          "Contenu": "the sevice was very good and the teck was very helpful"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carolina M..",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T22:22:26.000Z",
          "Titre": "Jeff Marcus was a very good in…",
          "Contenu": "Jeff Marcus was a very good in delivering the service his knowledgeable about the product installed.he fix my printer issue.i am happy with the services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phil E..",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T01:51:59.000Z",
          "Titre": "Great job !",
          "Contenu": "Great job !! by Geek Studio"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary K",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T21:50:42.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you, Jeff, for helping me today."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary G..",
          "Nb_Reviews": 4,
          "Date": "2022-01-10T17:59:06.000Z",
          "Titre": "The service was very efficient and fast…",
          "Contenu": "The service was very efficient and fast to solve all my new printer problems. I would recommend this service to any of my computer friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia W.",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T02:41:32.000Z",
          "Titre": "OMG I don't know what I would have done…",
          "Contenu": "OMG I don't know what I would have done if I didn't have protection with Geek Studio. I let a hacker gain access to my account by mistake and George was patient with the situation and was able to restore my account after the hacker demanded money from me to get access to my computer accounts and personal ID."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis B",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T20:38:42.000Z",
          "Titre": "On this date 12/12/23 George provided…",
          "Contenu": "On this date 12/12/23 George provided me with excellent service while fixing a hackers intrusion on my computer & network. Thanks George was pleasant, patient, and explained everything as many times as I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Co",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:21:15.000Z",
          "Titre": "Gary and George were helpful and…",
          "Contenu": "Gary and George were helpful and confident. They provided great support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria J...",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T01:16:12.000Z",
          "Titre": "George was excellent",
          "Contenu": "George was excellent. he was very patient with both of us. George was very empathetic and did everything he could to assist us.  we really appreciate the knowledge and courtesy he displayed, he is a great asset to this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trudy L. S...",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:01:32.000Z",
          "Titre": "Extra service was provided by…",
          "Contenu": "Extra service was provided by technician Henry because of issues with my connection to the Internet. But overall I am satisfied by my interaction with Henry today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Johns",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T23:01:25.000Z",
          "Titre": "An easy to understand conservation",
          "Contenu": "George was pleasant, patient, and explained everything as many times as I needed to help me understand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Barnes",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:37:47.000Z",
          "Titre": "My experience was great because ADAM…",
          "Contenu": "My experience was great because ADAM CARTER is very knowledgeable in his field. He's very courteous and patience. The main thing he determined what the problem was and solved. further he educated me of the need for better security and gave me options. thanks to God for his expertise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Moore",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T20:54:52.000Z",
          "Titre": "I received excellent service from…",
          "Contenu": "I received excellent service from William and Adam Carter. If I had not called I would not know that we had a network virus.Very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary L K",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T03:11:30.000Z",
          "Titre": "Outstanding customer service",
          "Contenu": "Outstanding customer service. great technical support. Technician was able to fix the issue with my computer and made recommendations on my printer status."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Y...",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:54:34.000Z",
          "Titre": "THIS Was a very good experience for me",
          "Contenu": "THIS Was a very good experience for me.  Henry did a very good job! and my printer problem is solved ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irene Cole",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T02:26:45.000Z",
          "Titre": "My experience was great because George…",
          "Contenu": "My experience was great because George is very knowledgeable in his field. He's very courteous and patience. The main thing he determined what the problem was and solved. further  he educated me of the need for better security and gave me options. thanks to God for his expertise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yolanda B T",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T23:29:52.000Z",
          "Titre": "It was a great experience",
          "Contenu": "It was a great experience. I'm glad I have geek Studio Thanks for all your help."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T00:41:04.000Z",
          "Titre": "Professional service",
          "Contenu": "The technicians were very knowledgeable, professional and polite.However I felt there were too many documents to sign which took an extra 10 minutes. I am happy with the results though.Printer is working again and computer running faster after cleanup.Thank you for your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger J G...",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T20:20:32.000Z",
          "Titre": "Henry Adams Did a fantastic job of…",
          "Contenu": "Henry Adams Did a fantastic job of helping me with my issues. He communicated clearly and effectively through the entire process. He was patient and very kind. Highly satisfied with his service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlene Delgado",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T22:47:57.000Z",
          "Titre": "They were able to take care of the…",
          "Contenu": "They were able to take care of the viruses and now I can use my phone to print next is setting up the laptop to print as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fronzo G Sr.",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T02:47:00.000Z",
          "Titre": "service working good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol R",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T22:38:16.000Z",
          "Titre": "I appreciated the service and patience…",
          "Contenu": "I appreciated the service and patience with the technician that helped me get my printer working. I look forward to having your company assist me again if necessary.Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mert Leese",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:22:16.000Z",
          "Titre": "I was impressed with the way your rep did the  best he could to make me understand what he was saying.",
          "Contenu": "I was impressed with the way your rep put up with understanding that I was not understanding things he he was trying to tell me as I am not as comuter smart as I do not always understand what he is trying to tell me."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sandy",
          "Nb_Reviews": 6,
          "Date": "2023-11-14T01:54:33.000Z",
          "Titre": "My experience has been great",
          "Contenu": "My experience has been great. Everyone who helped me did it in a quick and efficient manner troubleshooting the issues i have been having with the printer and laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RONALD SCHINDLER",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T01:01:57.000Z",
          "Titre": "Today was a good day working with Jeff…",
          "Contenu": "Today was a good day working with Jeff Marcus. My HP printer had been hacked in. Jeff took immediate steps and action to fix my HP printer. I found Jeff friendl and helpful. He treaded me like family. I thank Jeff so much for his expertise. God Bless Jeff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RoseMary",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T23:53:24.000Z",
          "Titre": "I had a big problem with my printers",
          "Contenu": "I had a big problem with my printers, and Jeff was able to solve it and did an excellent job making the changes I needed and explaining what he did and how and why. My issues are resolved and I am very pleased with his work. I would recommend his services to any one that I find needs such work done.He is very full of knowledge and was able to solve all my problems.Thank you Jeff, you made my day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T01:10:46.000Z",
          "Titre": "Feel fully protected.",
          "Contenu": "Extremely knowledgable about my Mac and the Premium Package is a good value for a lifetime protection.Been living with an unsecured system and finally fell victum to Chinese malware, but caught it just in time with help from the GEEKs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard M",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:37:41.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  Everything explained very clearly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:51:17.000Z",
          "Titre": "Henry has excellent knowledge very in…",
          "Contenu": "Henry has excellent knowledge very in formative and patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connie Louise Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:47:43.000Z",
          "Titre": "Responsive and Thorough",
          "Contenu": "Responsive and ThoroughThank you William and George for you patience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet G",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T03:27:26.000Z",
          "Titre": "Although it was an exhausting day",
          "Contenu": "Although it was an exhausting day, through no fault but my own, George & Gary got us to a secure ending.A tough, hard & costly lesson to learn...Thank you Geek Studio for all your patience & support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tanya S",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:33:58.000Z",
          "Titre": "great customer service and issue was…",
          "Contenu": "great customer service and issue was fixed in a timely manner.  polite and knowledgeable about the issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan N",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T01:23:55.000Z",
          "Titre": "Geek Studio was very fast and helpful",
          "Contenu": "Geek Studio was very fast and helpful. They showed me everything they were doing and explained why."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph M. S",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T22:57:22.000Z",
          "Titre": "George Davis was an excellent…",
          "Contenu": "George Davis was an excellent technician. He was very knowledgeable, polite and easy to understand. If I had any questions, he could answer them. I am very satisfied with his work. I look forward to communicating with him anytime that I have any concerns with my computers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda S.",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T01:28:58.000Z",
          "Titre": "thank you for your service they were so…",
          "Contenu": "thank you for your service they were so helpful. save me from a lot of damage from hackers thank you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas H.",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T00:26:41.000Z",
          "Titre": "The Service was excellent",
          "Contenu": "The Service was excellent, George Davis was extremely helpful. He went over and above what I would have expected.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mellisa V.",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:23:49.000Z",
          "Titre": "My rep was amazing",
          "Contenu": "My rep was amazing.  And handled everything as a professional.  He called me back to make sure everything was working properly. Very l excellent service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula G.",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:23:27.000Z",
          "Titre": "I liked it service by geek studio they…",
          "Contenu": "I liked it service by geek studio they fixed my printer services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norilyn V..",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T23:50:45.000Z",
          "Titre": "Jeff has been very professional",
          "Contenu": "Jeff has been very professional, polite, and understanding. My knowledge in computer is lower than the 5th grader and he had walked me thru the process and had made me understand the issue and the solutions. 5 star rating to Jeff and the team at Geek. I apprciate the help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roeshounda B",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T03:45:20.000Z",
          "Titre": "George Davis was so calming and…",
          "Contenu": "George Davis was so calming and reassuring throughout the call. He went above and beyond by even working 2 hours past his time to get off from work. He deserves a raise and #1 customer service award. I want to speak to him every time I call in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna J S.",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T21:26:04.000Z",
          "Titre": "my new printer was not scanning from my…",
          "Contenu": "my new printer was not scanning from my laptop. I called to have help and allowed the tech to remotely help me. I was told that there was a virus/malware infecting my IP address, and I purchased Wolf security package. The problem has been resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Sorensen",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T20:47:19.000Z",
          "Titre": "The representative was very patient…",
          "Contenu": "The representative was very patient with me and took care of my problem right away.  He is very knowledgeable.  Great service overall."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yolanda A..",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T23:01:37.000Z",
          "Titre": "Jeff was very professional and…",
          "Contenu": "Jeff was very professional and responsive to my concerns. He explained everything thoroughly and made sure I understood each step of the process and how to accomplish the task I was trying to complete. I would strongly recommend Geek Studio to others based on Jeff's performance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfreda P M..",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:31:31.000Z",
          "Titre": "All of the techs were very helpful…",
          "Contenu": "All of the techs were very helpful especially Jeff.  He worked diligently to clear my laptop and get my printer working properly.  I have all the confidence in the techs that assisted today in getting my issues resolved. Thanks everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colette D..",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T20:09:43.000Z",
          "Titre": "Geek Studios was so helpful",
          "Contenu": "Geek Studios was so helpful. I can's say enough about each and every technicians that I talked to. Very knowledgeable. Jeff Marcus was a very understanding tech. Explained each and everything to me. Highly recommend these services. Thank you so much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth M..",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T03:01:11.000Z",
          "Titre": "I am very pleased with the service I…",
          "Contenu": "I am very pleased with the service I received. the two gentlemen that helped me were curious and walked me through my ignorance about electronics and saved my butt!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Dunn",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T20:09:49.000Z",
          "Titre": "THE SUPPORT AGENT WAS WELL IN HIS",
          "Contenu": "THE SUPPORT AGENT WAS WELL IN HIS KNOWLEDGE OF MY PROBLEM, AND FIXED IT IN RECORD TIME. i AM VERY PLEASED WITH THEIR HELP, AND LOOK FORWARD TO WORKING WITH THEM IN THE FUTURE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RENATE J..",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T23:21:30.000Z",
          "Titre": "I have had a very good service from…",
          "Contenu": "I have had a very good service from your team, they installed security on all my devices on this network and I am happy with the work.  Looking forward to secure roaming ahead."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Barry",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T04:54:47.000Z",
          "Titre": "They all were very patient as I am hard of hearing and 83",
          "Contenu": "They all had a great understanding of my need in getting my new printer hooked up as it was too complicated for me. Plus I had not been aware of my lack of security protection so they solved that issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert K",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:19:45.000Z",
          "Titre": "Service was great",
          "Contenu": "Service was great. printer is working properly now and the computer has been cleaned up . Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John B",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T02:22:24.000Z",
          "Titre": "I found our dealings with Geek Studio…",
          "Contenu": "I found our dealings with Geek Studio personnel to be pleasant and very professional. I am confident that our making a lifetime purchase of this service was a solid decision for the future. Thank you soooooooooooo much!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Johnson Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T01:43:36.000Z",
          "Titre": "Amazing help with everything I needed",
          "Contenu": "Amazing help with everything I needed, extremally knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth M A",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T22:50:56.000Z",
          "Titre": "I found the help given most helpful",
          "Contenu": "I found the help given most helpful. The techs were not only very professional but quite patient. I would definitely recommend the services to friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise R S..",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T02:16:10.000Z",
          "Titre": "i like the service they are very…",
          "Contenu": "i like the service they are very patience  with you and very courteous with you I would recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T01:15:56.000Z",
          "Titre": "The technician was very knowledgeable",
          "Contenu": "The technician was very knowledgeable. The printer is a peice of trash and it took over an hour for the poor man to fix it. HP you should be ashamed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janie Kerr Pride",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T20:26:26.000Z",
          "Titre": "My technician was very helpful!",
          "Contenu": "My technician was very helpful!! he answered all of my questions and got my computer set up and running correctly.  He also set up my new printer and helped me sign in to the program that will set up firewalls on all of our devices for life! I am so grateful!! Thanks!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan C..",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T23:12:38.000Z",
          "Titre": "Geek Stuido was a great help with my…",
          "Contenu": "Geek Stuido was a great help with my computer today.They were prompt in helping to fix the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah H...",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:22:30.000Z",
          "Titre": "service reps were very helpful and…",
          "Contenu": "service reps were very helpful and courteous they explain everything they did in terminology  i could understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina E",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T02:01:27.000Z",
          "Titre": "GS was very helpful and informative!",
          "Contenu": "GS was very helpful and informative!! Made my computer brand new again and helped with my HP printer issues. Thanks!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey E B",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:38:02.000Z",
          "Titre": "service was very helpful to get my…",
          "Contenu": "service was very helpful to get my system back on track."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary O...",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T23:44:52.000Z",
          "Titre": "Henry Adams Thank you for addressing my…",
          "Contenu": "Henry Adams Thank you for addressing my problem and ensuring it was fixed. I appreciate the help and your expertise"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen R B",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T00:21:31.000Z",
          "Titre": "service person was patient and…",
          "Contenu": "service person was patient and explained everything to me so Could understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BECERRA,A..",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T02:02:13.000Z",
          "Titre": "The Tech Henry Adams was very helpful…",
          "Contenu": "The Tech Henry Adams was very helpful and very knowledgeable in solving my problems. The Tech was concerned about my situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margetalken",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T19:56:39.000Z",
          "Titre": "Henry Adams was very helpful solving my…",
          "Contenu": "Henry Adams was very helpful solving my problems. Thank you for addressing my problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathie P C.",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:29:24.000Z",
          "Titre": "Finally",
          "Contenu": "Finally, I received the help I needed after days of frustration. Praying that when I come back to the computer and printer this evening, all will be well."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jean Quintero",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T22:40:46.000Z",
          "Titre": "Henry Adams was very knowledgeable and…",
          "Contenu": "Henry Adams was very knowledgeable and patience to go thru all the details and pleasant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol F...",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:34:20.000Z",
          "Titre": "HENRY ADAMS WAS VERY UNDERSTANDING.MY…",
          "Contenu": "HENRY ADAMS WAS VERY UNDERSTANDING.MY PROBLEM AND HELPED ME WHEN I DIDNT KNOW WHAT TO DO AND THAN NEXT.EVERYTHING WAS PERFECT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Swafford",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T03:00:20.000Z",
          "Titre": "I really enjoyed working with George",
          "Contenu": "I really enjoyed working with George.  He was patient with me and was very professional.  I was very slow on the computer due to a recent illness.Thanks George"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Butler",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T00:25:06.000Z",
          "Titre": "very satisfied with the service rendered"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly J",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T20:58:23.000Z",
          "Titre": "The service was very efficient",
          "Contenu": "The service was very efficient, and the tech was very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheryl K..",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T00:10:15.000Z",
          "Titre": "My tech was awesome",
          "Contenu": "My tech was awesome. He kept me informed through the entire process which lasted over 4 hours. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Bowman",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T21:10:36.000Z",
          "Titre": "Excellent service by Geek Studio Techs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas B.",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T23:18:23.000Z",
          "Titre": "Helpful with tech issues",
          "Contenu": "Geek Studio helped me with a large security issue in a timely and friendly manner.  I appreciate their support with technical issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard V",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:22:26.000Z",
          "Titre": "Very nice and plesant  VERY PATIENT…",
          "Contenu": "Very nice and plesant  VERY PATIENT with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valia P",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:59:42.000Z",
          "Titre": "Very helpful the technician told me how…",
          "Contenu": "Very helpful the technician told me how to proceed to try to get my invoice printed properly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy K",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T03:51:09.000Z",
          "Titre": "Great Service by geek studio",
          "Contenu": "Great Service by geek studio. George he fixed by epson printer Ink pad Error."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Floyd C..",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T21:22:18.000Z",
          "Titre": "GEEK STUDIO",
          "Contenu": "GEEK STUDIO HAS BEEN A GREAT HELP TO ME GETTING MY COMPUTER AND PRINTER WORKING AGAIN.THANK YOU VERY MUCH GEORGE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eva M",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:27:37.000Z",
          "Titre": "my experience was great!!!!",
          "Contenu": "my experience was great!!!!!  Very helpful and I believe they are the best. Could not ask for any better!!! they deserve a raise for putting up with seniors like me.Thanks so much for your help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti A B",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T21:19:44.000Z",
          "Titre": "The service from George and the other…",
          "Contenu": "The service from George and the other IT guys really helped me get my computer working including my printer. Yeah!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara L D",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T01:20:27.000Z",
          "Titre": "I appreciate all the help I ve received…",
          "Contenu": "I appreciate all the help I ve received today. Everyone has been very helpful and knowledgeable!  thank you for your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felita N.",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T02:14:21.000Z",
          "Titre": "It was a wonderful learning experience…",
          "Contenu": "It was a wonderful learning experience and helped by George Davis to walk me through and to have my bugs removed on my laptop and have my printer work good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miranda S",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T00:33:00.000Z",
          "Titre": "They had helped me with everything",
          "Contenu": "They had helped me with everything. I didn't really have to do anything and, I'm very satisfied on what they did for me.  I will recommend these people for my friends too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas A M",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:21:57.000Z",
          "Titre": "Thank goodness we had Geek Studio",
          "Contenu": "Thank goodness we had Geek Studio. Thank you for rescuing us from hackers. Everyone we talked with was very kind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenna Webster",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T00:13:35.000Z",
          "Titre": "George",
          "Contenu": "Mr. Gorge was very patient and friendly.He was considerate and very knowledgeable.took some time but the work was very satisfactory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan C..",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:03:54.000Z",
          "Titre": "Jeff was extremely patient with me and…",
          "Contenu": "Jeff was extremely patient with me and never gave up on a challenging situation. Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose E M...",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:20:06.000Z",
          "Titre": "I was so happy to get somebody that…",
          "Contenu": "I was so happy to get somebody that knew what they were doing. outstanding job by Jeff Marcus"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denolda R G...",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:12:03.000Z",
          "Titre": "Jeff is very knowledgeable and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara A G",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T02:36:51.000Z",
          "Titre": "George Davis was compassionate thorough…",
          "Contenu": "George Davis was compassionate thorough and listened to everything. Thank GOD FOR GEORGE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald C Jasch",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T22:03:01.000Z",
          "Titre": "Knowledgeable and Helpful",
          "Contenu": "The Tech was very helpful and very knowledgeable in solving my problems. The Tech was concerned about my situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara R..",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T22:45:51.000Z",
          "Titre": "i feel much more comfortable with my…",
          "Contenu": "i feel much more comfortable with my computers security after this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan F R",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T01:42:34.000Z",
          "Titre": "George",
          "Contenu": "George, your services are great!  So far things are looking way up now, and with your assistance, I thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura G I",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T02:14:44.000Z",
          "Titre": "My experience was great",
          "Contenu": "My experience was great, the team are professionals enough to handle my printer issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mary Brink",
          "Nb_Reviews": 8,
          "Date": "2023-09-18T21:25:51.000Z",
          "Titre": "I’m amazed at the level of expertise…",
          "Contenu": "I’m amazed at the level of expertise that they have!  I’m proud to be able to call on them anytime I need help!  Very courteous and helpful folks and they were always so kind"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T23:10:35.000Z",
          "Titre": "Very satisfied",
          "Contenu": "Very satisfied. I feel better knowing my devices are now protected.D Taylor"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean A N...",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:20:41.000Z",
          "Titre": "very satisfied happy with the services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg O",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T02:23:20.000Z",
          "Titre": "the gentlemen did a great job of…",
          "Contenu": "the gentlemen did a great job of solving my issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn B..",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:39:20.000Z",
          "Titre": "the quick response and the discovery of…",
          "Contenu": "the quick response and the discovery of all things wrong with my laptop. the knowledge and courtesy of the technican."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark W..",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T20:49:27.000Z",
          "Titre": "Thank you for your services",
          "Contenu": "Thank you for your services. Saved the day again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael J R",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T20:50:37.000Z",
          "Titre": "George was great answered all questions…",
          "Contenu": "George was great answered all questions and installed a firewall on my network."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet P",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:16:50.000Z",
          "Titre": "My experience with George Davis was…",
          "Contenu": "My experience with George Davis was excellent.Thank you for everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca B",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T03:04:22.000Z",
          "Titre": "I very much appreciate the geek studio…",
          "Contenu": "I very much appreciate the geek studio help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth S...",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T18:27:56.000Z",
          "Titre": "Inability to scan from Brother printer…",
          "Contenu": "Inability to scan from Brother printer was resolved.  Will check tomorrow that different network used is also protected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T02:30:37.000Z",
          "Titre": "The experience with George was great…",
          "Contenu": "The experience with George was great thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James C..",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T00:08:32.000Z",
          "Titre": "George did a fantastic job and ensured…",
          "Contenu": "George did a fantastic job and ensured I knew what was happening with my system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tena L B",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T04:45:46.000Z",
          "Titre": "Excellent",
          "Contenu": "Great Service, stayed on tele and computer for hours until problem was solved"
        }
      ]
    }
  ]
}