{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ghostek.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James D",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:29:12.000Z",
          "Titre": "DON'T order the Pixel Fold — EXEC",
          "Contenu": "Ordered the Pixel Fold — EXEC.  The case was poorly designed junk.  Immediately requested an RMA.  Left a review on Ghosteks website, which they failed to post, indicating knowledge of the poor quality of the product.  I will never order from ghostek again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T12:05:43.000Z",
          "Titre": "Won’t respond to emails for help",
          "Contenu": "Ordered the wrong size and Ghostek was unable to even respond to emails asking for an exchange. The product seems solid enough but support is apparently non-existent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Agent",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:47:23.000Z",
          "Titre": "Zero responses to my requests for info on order status.",
          "Contenu": "Zero responses to my phone calls. Zero responses to my emails. Had to purchase another case to protect my phone. Finally shipment received. But customer service does not exist."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Mark Belcher",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:31:12.000Z",
          "Titre": "Product was crap, but shipped fast",
          "Contenu": "Shipping was fast, but Quality control doesn't exist with Ghostek. Bought an S22 case, first one turned up with a broken clip and a power button that was permanently pressed in. Contacted ghostek. - they were very slow to reply. Eventually a replacement was sent, that turned up with guess what - an even more broken clip. Now I have 2 useless cases and still out of pocket over $100NZD.  Apparently I can get a refund if I ship the case back to the USA, but to do that would cost the majority of what I would be refunded anyway. Take your money and spend it elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Brenda DeVries",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:21:50.000Z",
          "Titre": "Here I am receiving a review request and my case still hasn’t arrived. …",
          "Contenu": "Here I am receiving a review request and I have yet to receive my iPhone case.I ordered the case in November 27th from the Black Friday sale. The shipping arrival date I was given was December 5th. It is now December 11th and the details from the tracking information doesn’t change for days at a time. Using DHL as the shipping company was mistake number one. I have sent an email to customer service but that obviously didn’t help at all. I stare everyday at my brand new iPhone 15 that I cannot use without a case. Had I known that it would be this long I would have ordered elsewhere. Very disappointed with this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:01:12.000Z",
          "Titre": "Customer service and shipping is trash",
          "Contenu": "Not only is your shipping bad but your customer service is garbage. I gave you a second chance even and you still messed it up. Don't use the USPS I said plus I have been waiting patiently for over a week for it and haven't gotten it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raymond W. Nocella",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:44:45.000Z",
          "Titre": "Bad Business",
          "Contenu": "Wound up with the incorrect case. Then inorder to get a refund (which im waiting for) i had to pay for shipping to return it.  Poor business practices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juan Chavez",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:39:29.000Z",
          "Titre": "I bought an item that I want to return…",
          "Contenu": "I bought an item that I want to return and have no instructions on how to do that. I called, emailed and messaged but never got any response on how to return it."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Vincent Wyon",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:36:12.000Z",
          "Titre": "What a desappointment!",
          "Contenu": "What a desappointment!This is a wonderful protective MagSafe case. Well… aesthetically speaking! I'm still looking for the MagSafe feature. Certainly, it attaches well but the problem is that when you want to charge your smartphone by induction, well…. it doesn't recharge. Maybe the shell is too thick, I don't know. In addition, the most problematic thing about this protective case is that it drains your phone. I'm not a materials engineer but I assume the aluminum part must have something to do with this problem. It’s really a shame! I was not expecting that at all…"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "M.k.",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T18:18:57.000Z",
          "Titre": "Don't trust ghostek compatibility",
          "Contenu": "The case I ordered from ghostek.com was incorrectly marked as compatible with my phone.  A fact that is VERY easily checked by.a simple Google searchIf I could attach a screenshot of ghostek's website showing compatibility I would.  Instead, knowing that, they are trying to paint me as some idiot who doesn't do their homework"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T17:57:34.000Z",
          "Titre": "Ungrateful of their Customers",
          "Contenu": "Firstly, I received my case in a timely manner & I'm grateful for that. But it's after the sale that completely changed my mind. My case was broken, honestly did to an engineering flaw. When I contacted them about this they told me that I would have to pay to receive a replacement case. Then that I would have to pay shipping & restocking to return the broken case completely. And finally I just stopped getting any response.A simple suggestion: take care of your customers. They are who pay your bills!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Taylor Rubio",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:38:37.000Z",
          "Titre": "Poor packaging",
          "Contenu": "Poor packaging like it had been rummaged through"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Aragon",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:43:21.000Z",
          "Titre": "The case was horrible",
          "Contenu": "The case was horrible. It literally broke the first day. It did not secure my phone. The hinge protector was a thin piece of material that was not secure at all. Waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANDRES S",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:54:12.000Z",
          "Titre": "Issues with the case",
          "Contenu": "Issues with the case, and now problems to. Laim the warranty"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cordell",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:34:32.000Z",
          "Titre": "Product was good",
          "Contenu": "Product was good. But the emails you keep sending after unsubscribing is really pissing me off, I won't be buying anything again, too pushy of a company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Nolan",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:51:34.000Z",
          "Titre": "The wrong one got sent I ordered…",
          "Contenu": "The wrong one got sent I ordered green/blue aluminum case ,and received a black one"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Obrien",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:01:20.000Z",
          "Titre": "available car mount that was out of stock",
          "Contenu": "Car mount displayed available when it was out of stock. A lot of back and forth for a month ( 4 weeks folks ) No accurate info on when the item would  become available.   Not until I looked on the website and the car mount displayed 11/6/23 as available. It was my fault for thinking the email correspondence department would be product knowledgeable.     I’m stuck waiting 6 weeks on a paid item. Last product I purchase from Ghostek. Based on the skill set of there training dept and quality control. ( not fault of representatives)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marvin Bardney",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:55:56.000Z",
          "Titre": "You guys sent me the wrong phone case",
          "Contenu": "You guys sent me the wrong phone case. So I had to pay $14 in shipping and handling out of pocket!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathleen Cox",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:58:22.000Z",
          "Titre": "I Have contacted you for a refund",
          "Contenu": "I Have contacted you for a refund. I still have not received any contact from your company. Since you only allow 30 days for a return. This is making me extremely upset."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "May Ioane",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T07:33:57.000Z",
          "Titre": "The fact I haven't received my…",
          "Contenu": "The fact I haven't received my package......from 20th October 2023 I had ordered my products. Up until now have received any updates what so ever.  Really Disappointed with your company's service and taking my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Deatcher",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T06:50:05.000Z",
          "Titre": "Stay away, cheap quality at expensive price!Ordered from Ghostek.com Exec 6 for…",
          "Contenu": "Ordered from Ghostek.com Exec 6 for samsung galaxy fold 5. On the hinge protector there should be 4 prongs connecting the left case to the right,top to bottom, but it only had 3 so when you put it together on the phone it just detaches at the bottom. Sent them pics of the problem and they said they would send me a new one but that would be my one time replacement. So I wait and the next one comes and goes what same problem, they didn't even look in the box to make sure this one right. On the first one it comes with a qr scanner for directions and it only took me to YouTube with no video. So now I am 3 weeks in and still no working case and waiting to get my money back! Will never order from. This company again. I get it mistakes happen but apparently this $60 CHEAPLY MADE CASE has a defect in the way they make. Plus if you screw up once check the replacement before sending it out, this has been very inconvenient and I am sticking with outerbox from now on!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Loyal but disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T02:27:10.000Z",
          "Titre": "Worse phone case I have ever gotten…",
          "Contenu": "Worse phone case I have ever gotten from Ghostek. Complete waste of money and doesn't protect the phone. And it is just taped to the phone. And the tape is weak and don't hold for very long. I will not buy another case for this phone from ghostek."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William DeBrew",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T04:15:17.000Z",
          "Titre": "Delivery time is ridiculous",
          "Contenu": "Delivery time is ridiculous. I received confirmation over a week ago that my product has shipped from NY....I've ordered stuff from much further than NY that has gotten to me alot quicker. I guess I should have just ordered from Amazon like I usually do. Well, never again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregg Boeke",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:00:04.000Z",
          "Titre": "Wrong case",
          "Contenu": "Wrong model case.  Took weeks to get through the discussion.  Then was told you have a 30 day limit.  Now stuck the a new case that won't fit my phone.  No more recommendations for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle Coberly",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T16:31:10.000Z",
          "Titre": "False Advertising",
          "Contenu": "False advertising by calling the product \"Slim\" as the product is bulky, you can't use the fingerprint sensor when this case is on, company forces you to pay for return shipping just to get your money back which cost me another $7.74. Biggest waste of money & I will never recommend this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Holly Harmon",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:18:05.000Z",
          "Titre": "Still waiting to get return instructions",
          "Contenu": "Well I ordered the wrong case. I was \"approved\" for a return....however I'm still waiting to hear back on how to complete the return.And.....now I guess I'm paying for the return. 🤦🏼‍♀️"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Ertman",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T02:51:32.000Z",
          "Titre": "I needed a case for an iPhone 11 and I got IPhone 11 Pro",
          "Contenu": "I needed a case for an iPhone 11 and I chose iPhone 11 on your website and the case that comes up is for an iPhone 11 Pro ..so because I notice that after choosing iPhone 11 your site brought up products for the Pro I received an order that doesn’t work for what I need and am then expected to pay to return it…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Lombardi",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T03:15:17.000Z",
          "Titre": "Fitment is horrible",
          "Contenu": "Fitment is horrible. Case covers left side of keyboard while phone closed. Adhesive strips do not stick to the case itself."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Jeannell Casaje",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T11:43:55.000Z",
          "Titre": "atleast give the buyer a window time to…",
          "Contenu": "atleast give the buyer a window time to cancel or change order. For future buyers, double check and always finalize your order before submitting order. they wont give you a chance to cancel it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KYLE KINCANNON",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:04:37.000Z",
          "Titre": "Phone case arrived timely and is a very…",
          "Contenu": "Phone case arrived timely and is a very nice case, however, the case does not fit the phone properly and it seems to cover a portion of the earpiece and you can barely hear anything from the earpiece. Remove the case and everything works as it should."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Machan",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:36:42.000Z",
          "Titre": "First time I see the product in web…",
          "Contenu": "First time I see the product in web site look amazing but after I order and the item arrive, I see and install to my phone is look bad and awful, very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Erik Estrada",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T22:24:53.000Z",
          "Titre": "My shipment has not arrived",
          "Contenu": "I have been waiting for my shipment for more than 15 days, there has been no progress since February 3. I need help with shipping otherwise I want my refund. I hope you can help me, thanksShipment DetailsDHL eCommerce Solutions #2230700277930523Delivery by DP Paket PlusLW479766551DECustomer Confirmation #E1DDC553-3427-4D71-A79B-E0304Peso0.1416 KGServicioDHL Parcel Intl Standard"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Frederick Go",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T19:41:46.000Z",
          "Titre": "A bad experience",
          "Contenu": "Its more than a month now and still don’t have my order. I emailed many times. Tracking history since sept 27, PROCESSED AT TRANSIT FACILITY.Till now no update, Date of purchase is August 24, 2023 order#157513. I would like a refund😤😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr. Overkill",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T21:24:03.000Z",
          "Titre": "S21 series case doesn't fit the S21 5G…",
          "Contenu": "S21 series case doesn't fit the S21 5G and look as much as I can, I cannot see the S21 5G case that I have that I'm trying to replace on your site, I need it waterproof and I need it now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael hoffman",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:04:54.000Z",
          "Titre": "Unfortunately terrible customer service",
          "Contenu": "I do not like leaving negative reviews but Ghostek had terrible customer service.  Did not help one bit in resolving an issue.  Not one bit.Update: Don't let them fool you.  I did NOT place an order after requesting 50% off.  Ghostek sent out an email where you had to try and find the 50% off code on a word find puzzle.  There was so many different words to try.  I tried at least 15 of them.  When I went to submit another word, the screen on my phone adjusted and I ended up hitting order instead of submit code.   I IMMEDIATELY contacted Ghostek customer service via their website AND Facebook messenger to alert them of the issue.   Immediately.  They do not provide a phone number to contact customer service anywhere.  I told them the situation and that I'd like to cancel my order or keep the order of they would honor the promo.They, conveniently for them, contacted later, after it was in the \"shipping process\" and asked for the email that contained the word find for the promo code.  I immediately sent it to them and they responded they couldn't do anything.  Didn't offer me any kind of discount. Just said I could pay to return the case.Why also would you send out an email with a word find in which there could be 100 different words that may be the correct option??  Just want to waste everyone's time or just hope they accidentally hit purchase instead of clicking the button to submit the code??  Unprofessional all around."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cote",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T15:25:29.000Z",
          "Titre": "It’s loose on the right side",
          "Contenu": "Update: I took the screen protector off and the problem is still there. The case doesn’t hug the phone on the right side. The lip of the case is hanging and even though if you push it, it does not stay. I contacted customer service and they blamed it on my screen protector, which is ridiculous because it’s not even touching it. So they are making me pay to return a faulty case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabino",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:12:18.000Z",
          "Titre": "Hinge broken on case I ordered",
          "Contenu": "Hinge broken on case I ordered. Received a replacement with the same issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eugene Scott Dubay",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T01:04:42.000Z",
          "Titre": "The case is worthless can't use it",
          "Contenu": "The case is worthless can't use it, Thankfully I saved my old one which I am using now don't know how to get a refund Please get back to me on that. sound when I speak to people reverberates, echoes, makes it difficult to communicate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Levi Hollon",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T20:53:25.000Z",
          "Titre": "Most poor customer service EVER@!!",
          "Contenu": "Ordered a phone case for Samsung galaxy s23 ultra on July 6th. Tracking kept saying en route to packaging facility. Ghostek initially said they expedited the package. Two days later, still en route to packaging facility. Email Ghostek again. They agreed to send replacement, stating the package had been lost. Have waited two days more and have yet to recieve any information about a tracking number or status of replacement. They took my money though. I have tried calling them SEVERAL times and get forwarded to voice-mail. I have sent emails asking for updates or my money back for the case, snd just like their name......ghosted. Paid a lot for the case and probably the poorest customer service I have ever experienced."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Senor Sr Calderon",
          "Nb_Reviews": 3,
          "Date": "2023-11-13T18:59:17.000Z",
          "Titre": "I received a different case color",
          "Contenu": "I received a different case color. I waited for a week, and I am still waiting for the right one.Customer service replied to me 2 days after I sent the first email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jaryd Brezee",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T20:48:48.000Z",
          "Titre": "Well delivery was messed up and took 5…",
          "Contenu": "Well delivery was messed up and took 5 days to get a response on a replacement half thought you were a fake company... supposed to get reshipped but no track so idk if I'm even getting it definitely won't order here again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "eric harris",
          "Nb_Reviews": 6,
          "Date": "2023-10-05T14:55:28.000Z",
          "Titre": "Ripped off",
          "Contenu": "Ripped off. Waiting eternally for this case to come. Shipping times are false! This company is fraudulent. Don't be fooled by other reviews. DHL never delivers anything on time. Stealing my time is ripping me off. In 6 days no one contacted me with a problem.  The address is CORRECT! A phone can easily get broken when you are relying on getting the case and it does not come. A lot of risk that I should not have had to take."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ma.Ab",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T23:13:55.000Z",
          "Titre": "Hard to hear people whole case is on",
          "Contenu": "Hard to hear people whole case is on. Couldn't listen to music on phone with case on. Couldn't take videos underwater with case on because it wouldn't allow me to use it (too sensitive)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T23:21:24.000Z",
          "Titre": "Major Disappointment",
          "Contenu": "When I received my case it wasn't even close to the quality your website stated. I returned it. To find out you don't even offer free returns. So it cost me another $15.00 shipping. I have bought cases in the past that where excellent from your company. But that last two where complete garbage quality. Especially at a $50.00 price point. I don't know what happened to your company over the last few years. But it's definitely not the same. I will not be purchasing anything going forward."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Victor Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T16:49:59.000Z",
          "Titre": "Disconnect between customer service and shipping dept",
          "Contenu": "You guys shipped a total different item, when you tried to fix this, you guys made a mistake with the second shipment, a tracking # was provided and this is not moving. Now I just got an email saying that you guys were looking in a totally different order. You will try to ship this item for third time.I don't know when my item will arrive, I have been dealing with this for exactly 2 wks, for a shipment inside of USA"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kevin Williams",
          "Nb_Reviews": 3,
          "Date": "2023-07-28T04:02:58.000Z",
          "Titre": "Took twice as long to receive product…",
          "Contenu": "Took twice as long to receive product as advertised. The actual color was different than picture. Have not received an email about how I go about getting a refund.IN RESPONSE TO GHOSTEK'S REPLY I ordered it on the 30 of June received it on the 17 of July you do the math its 12 business days.As for the return I have to pay international shipping charges to return you crappy and unsatisfying S23 ultra phone case that is not as described ....Ghostek is a rip off and make terrible cases ...don't get me started on the Ghostek case I ordered for my fold 4 worst cases ever"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Daniel",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T06:43:48.000Z",
          "Titre": "Order 2 items only received 1",
          "Contenu": "Order 2 items from ghostek flip and a fold case and paid for shipping ghostek semt am email saying my items were being dispatched and showed both items being sent Shipping did take a while but ghostek specified there may be delays but received my parcel today only to find out that ghostek only sent one item but on the packing slip inside the parcels says both items were sent  Very unprofessional to miss an item on a order of 2items ...... waiting to hear back from ghostek seeing how they would recitify this issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teddy B",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T20:17:40.000Z",
          "Titre": "Wrong color",
          "Contenu": "This review is not so much about the case but the fact I was sent the wrong color I ordered clear and was sent smoke did not want to be bothered with returning."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ben Reiss",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:41:39.000Z",
          "Titre": "Wrong Product Sent!",
          "Contenu": "I have already emailed your company and haven't received anything back yet. You sent me the Wrong Case! It does not fit the phone I purchased it for! Please call me to sort this out, +61432354011Thankyou.Ben Reiss."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Maass",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:08:49.000Z",
          "Titre": "Regret buying direct from ghostek",
          "Contenu": "Regret buying direct from ghostek. Case came for S23 but mine is 23 Ultra. Because I bought Ghostek vs through Amazon I'm paying $15 return shipping on a $39 case. Super uncool"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Zac",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T09:55:44.000Z",
          "Titre": "Garbage customer service",
          "Contenu": "Garbage customer service. Been waiting for 20 days and my issue has been yet to be resolved. Shipping wasn’t updating but they wouldn’t check until 20 working days are over.Prompted them on 22nd of august that the shipment isn’t updating. You guys can look at it here - webtrack . dhlecs . com/orders/33872308013527654/details/B99E32B6-08EC-4069-A299-4BD78Only when I emailed them pass beyond 20 working days did they bother. Upon having checked with their courier services they said it’s lost. Yet they can’t even offer anything else to make up for the time lost. The only offer? Save money and be budget to resend the order with the same garbage courier they used, imagine waiting another 20 days for your order to go missing again. Trust issues for real. Also expect them to be almost unable to be contacted because you have to keep prompting for something to be done or get a reply that’s robotic. Brain dead. Think I’m better off finding another company that has better customer service even if they cost more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert J",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T23:19:12.000Z",
          "Titre": "Looks good but don't expect to use the fingerprint sensor.",
          "Contenu": "I was pleased with the look of the case but I could never get the fingerprint to scan through the screen protector.  I watched the video, numerous times and once you open the package you can't return the case.  So, I would not recommend the case to anyone due to the price and being unable to get the fingerprint to be accepted by the phone."
        },
        {
          "Note": 1,
          "Lieu": "RW",
          "Pseudo": "SOLANKI JAYESHKUMAR MUKESHBHAI",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:19:13.000Z",
          "Titre": "NO UPDATE ON GOODS WE BOUGHT FROM YOU…",
          "Contenu": "NO UPDATE ON GOODS WE BOUGHT FROM YOU AND WE DONT KNOW HAVE BEEN SHIPED OR NOT. PLEASE UPDATE YOUR LOGISTICK."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "604 jdl",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T19:55:08.000Z",
          "Titre": "My limited edition z4 flip case's spine…",
          "Contenu": "My limited edition z4 flip case's spine has broken four times. The material the spine is made of, and the tiny lugs that hold it to the case, are a complete failure in design. Now after breaking for the fourth time, they are refusing to honor their lifetime warranty.Just be careful with this company."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "S R",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T19:48:04.000Z",
          "Titre": "I know it isnt the company's fault but…",
          "Contenu": "I know it isnt the company's fault but my package wasnt delivered. The shipping company claims I dont have a deliverable address, i live in canada. This isnt the first time I've had this issue. There is a serious problem with the east coast hub of the US postal system."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brook Williams",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T14:33:42.000Z",
          "Titre": "Horrible Case",
          "Contenu": "I ordered 2 cases for my fiance and myself, we had the case for a week and had to order a different case. My attached credit card case the magnet fell off the first 5 days so the wallet wouldn't stay closed. The case itself does not seem to be secure enough to handle a drop and there is no screen cover in the event that it does get dropped. I would not recommend this case, I spent over 90.00 and I can't even use it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isidro Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T17:33:58.000Z",
          "Titre": "Spoke with support regarding me…",
          "Contenu": "Spoke with support regarding me shipping refund that I paid extra for. I was notified BY GHOSTEK that a refund was issued for the expedited shipping I paid on both orders. When I asked what the refund days were for how long it takes to get deposited. Besides of reading the email they asked for the item I returned. I DIDNT RETURN ANY ITEM GHOSTEK WILLINGLY SENT ME A EMAIL SAYING IM GETTING A REFUND FOR EXPEDITED SHIPPING I PAID FOR $20!!!! NOW THEY WONT EVEN RESPOND TO MY EMAIL ABOUT IT WHAT A FREAKING JOKE I WILL NEVER ORDER AGAIN!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "arron riggs",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T15:31:50.000Z",
          "Titre": "JUNK",
          "Contenu": "I advise everyone to steer clear of this company. i still have recieved no contact other than them commenting on my review. absolut junk and they have not attempted to fix the situation just blame the customer. Ill add to this one like i did the last one. you still have not reslonded to the numerous emails i have sent to you. your failure to take care of your customers will lead to the down fall of your company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:25:17.000Z",
          "Titre": "Muffles sound",
          "Contenu": "I bought the case for its dust/water proof feature but it’s really bad I can’t hear the other person when I’m on the phone and even when I try speaker the sounds so muffled and the person on the other end can’t hear me I will be buying a OtterBox"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "tony oliva",
          "Nb_Reviews": 6,
          "Date": "2023-10-24T20:59:30.000Z",
          "Titre": "Bad customer service",
          "Contenu": "Horrible customer service got a used case and it took them forever to give me a refund the case had scratches all over it horrible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "S. Raelynne Becerra",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T15:34:12.000Z",
          "Titre": "Case shattered and company never…",
          "Contenu": "Case shattered and company never responded. Way too much money for such poor quality.I emailed, I talked to their page via \"messenger\", I sent multiple inquiries and they're flat out LYING about not receiving any information from me. It wasn't regular \"wear and tear\" the thing just snapped in half. POOR QUALITY!This company lies and LIES! I EVEN PROVIDED SCREENSHOTS OF UNANSWERED MESSAGES TO PROVE IT. After they realized they were caught lying they said they'd replace the case. I sent them my exact order details to confirm the correct case would be replaced. They assured me it would and I stupidly believed them. But guess what? They LIED AGAIN! I got cheap garbage that doesn't even stay on the phone and no one responds at any of their contact options: email (which I have emailed repeatedly despite their lies), messenger, or phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stonks",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T17:46:34.000Z",
          "Titre": "Great 2 months.",
          "Contenu": "I was really expecting this case to last longer than 3 months for how expensive it was. I can't get a in contact with customer service at all. Never buying from this company again taking down all my reviews from all socials. Yes I will take the time to scroll through and find them in the comments of the posts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Lassiter",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T09:53:20.000Z",
          "Titre": "I will no longer do business with these…",
          "Contenu": "I will no longer do business with these people. The first time, when I made a mistake,  it took four weeks to resolve the issue. This last time, I believe I was sold an inferior product. I cannot resolve this issue as I discarded my receipt ten months ago. It appears to be necessary. Nope, no more with these guys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:02:10.000Z",
          "Titre": "This company has the worst customer…",
          "Contenu": "This company has the worst customer service. I was sent the wrong case, for a totally different phone... customer service made it out as my fault, and they might help me out one time. Unapologetic and very rude customer service made us not even want to try or reccomend Ghostek products ever again.**Photos were sent with pictures of the packing slip and contents the very first email to Catherine. She replied with a very smug email implying she is doing me a favor this one time...(I recieved an iPhone mini case, and ordered a Note 20 ultra case....). Her rudeness was the reason we initiated a return and not an exchange. We understand mistakes are made, but when you blame the consumer, that's just bad business. Catherine's bad customer service is why we will not reccomend or use Ghostek products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Ford",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T13:04:24.000Z",
          "Titre": "Phone Overheats with Wireless Charger",
          "Contenu": "My case which was supposed to be mag safe compatible will not use the mag safe charger because it makes my phone over heat and stop charging.I bought the EXEC case off Amazon... this is a review of the case, not the mount. And YES, when using the case with a magsafe charger, my phone overheats and stops charging. Please do not assume things off of your inaccurate data collected on me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Bourne",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T02:50:27.000Z",
          "Titre": "I never received my order then got a…",
          "Contenu": "I never received my order then got a text saying my address us undeliverable which is odd to me because everyone else delivers here I have never had a problem receiving any order from any other company.  This was a gift for my son and yes it was refunded after 3 weeks of non delivery and me having to search for a way to contact the company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Xavier Williams",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T17:34:07.000Z",
          "Titre": "The case it great but.......",
          "Contenu": "The case it great, but it doesn't fit the phone properly. I have reapplied the case multiple times and the fit isn't correct, the case blocks the fingerprint reader and won't say formed to the side."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nestor v sorto",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:13:01.000Z",
          "Titre": "I dropped my phone and the screen got…",
          "Contenu": "I dropped my phone and the screen got damaged while using the case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick Worth",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T20:46:36.000Z",
          "Titre": "This case is too slick and slides off…",
          "Contenu": "This case is too slick and slides off everything making it useless in protecting my expensive IPhone 14 Pro Max"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paris Sepe",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T16:38:58.000Z",
          "Titre": "Exec Pro Max 14 is too heavy,",
          "Contenu": "Exec Pro Max 14 is too heavy,Mainly because of the card carrier being magnetic, The old design was thinner and slid into a slot on the case, very lite, very thin profile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Briana Buchanan",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T14:16:27.000Z",
          "Titre": "False Advertising",
          "Contenu": "I bought what I thought was a light gray phone case with light blue and lilac purple on it. The photos made it look very cutesy and that's what I wanted. When I received this prismatic color, it is not that. It is a dark purple and a dark teal and blue color. What I thought I was buying versus what I actually received look like 2 different products. I consider this false advertising. Unfortunately, I received the case the same day I got my phone and so I could not return it. I needed a case on the phone to be able to use it. You need to make sure you're accurately portraying the way your cases look in real life correctly with the pictures you post on the listing. I feel scammed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T20:54:23.000Z",
          "Titre": "Over Priced Plastic",
          "Contenu": "I paid for expedited shipping but it did not arrive any faster than normal shipping. Also the case is priced as a premium case but it is very slippery and all I feel is plastic. I do not feel metal at all."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Sandeep Ramsaha",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T21:20:32.000Z",
          "Titre": "Delivery is slow and there is no update…",
          "Contenu": "Delivery is slow and there is no update on when the expected delivery might happen. The least I expected is to know when can I expect to have the case!!! Other companies are much faster in delivery. Go check UAG !!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle B",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T18:23:17.000Z",
          "Titre": "Shipping was slow and terrible case.",
          "Contenu": "Shipping was slow. I only used the case one day cause the built in screen protector was annoying and flexed every time I typed or touched the screen. Especially around the edges there was a large gap between protector and screen. Biggest flaw I found is I work around sand and it had got between the case and screen. I thought this case was waterproof and dust proof. If sand can get in the case I'm sure water will too. Will not buy again."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Sam",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T18:54:55.000Z",
          "Titre": "Absolutely useless",
          "Contenu": "Absolutely useless, I ordered a screen protector and many other accessories. It took them a month to ship it and I still haven't received it even after 4 months of waiting for shipping.I have contacted them 8 plus times and no response at all from them apart from check the tracking number. I even contacted the shipping company to see what was up but they said Ghostek had to file a report for an item that was taking to long (in my case it had been 3 months at this time and shipping was supposed to be 1 week - 1 month) and Ghostek didn't even reply or send an email to the shipping provider. Worst accessories provider on the internet as they can't get you their products to you even though they are a well rated product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick Foster",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:53:32.000Z",
          "Titre": "I am having problems with first all…",
          "Contenu": "I am having problems with first all getting the screen cover clean to just to put the front case on. The finger print spot should have been marked somehow and the small finger print dots always had air bubbles. The last time I cleaned inside the previous dot did not come off all the way so made a mess and was very difficult to get the screen cover. On top of that after having for 2-3 things started to pop up inside the screen cover.  Screen cover scratches very easily. The flash cover is very difficult to get clean and keep it that way. Scratches on the lens covers.I sent several messages to the company without even a courtesy reply. So all the problems and very poor customer service I can not recommend this case for anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carl Harrison",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T14:14:36.000Z",
          "Titre": "poor customer service ,buyer beware",
          "Contenu": "ordered a atomic slim case, i wanted the leather back and the website claimed to be out of the gunmetal with leather,  looking thur pictures of the colors orange also had a leather back so i order the orange even though not my preference in color ... recived the case and its not leather... some kind of burlap fabric...customer service has been going back anf forth with me on it for days ... and in the most recent response they are saying its vegan leather.... they refuse to send the correct case with out me returning the mistake case first, i cant chance my phone being unprotected...the case appears to be well made , but pictures are very misleading and customer service refuses to admit the picture in question is wrong....exploded view of the orange case clearly has a leather back in the picture,  customer service continues to ignore comment on this picture from their website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seth Lepine",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:17:40.000Z",
          "Titre": "I bought a case for my new pixel 6…",
          "Contenu": "I bought a case for my new pixel 6 which I absolutely love. But some person at your company decided it would be a good idea to put a finger print stick circle right in the center of the phone where you type when texting. It some industrial grade sticker that doesn't come off without the use of a razor blade. Needless to say I damaged the screen protector on my brand new case and now has a large indent in the screen. Real smart thinking ghostek. If I want to put a sticker on the finger print unlock I should be able to do it later. It should not come with the case. Like my case but hate the big lump in m screen."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Daniel",
          "Nb_Reviews": 3,
          "Date": "2023-02-17T09:32:39.000Z",
          "Titre": "Case keeps falling off phone",
          "Contenu": "Ordered a fold case and flip case but ghostek left out the flip but they were quick to send out a replacement which i received today.In the fold case there were small adhesive tape that held the case to the phone amd the fold case is great however the flip case received today had no adhesive at all and the case keep falling right off the phone and doesmt protect the phone.Does ghostek not do and quality assurance checks?! Not happy with this first ihave to wait over a month for my case and now that ive received it. It doesmt even protect my phone......"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kellie Dow",
          "Nb_Reviews": 4,
          "Date": "2023-08-11T14:11:06.000Z",
          "Titre": "This company sucks",
          "Contenu": "This company sucks. I ordered a case and clip on Sunday 8/6 as of today 8/10 I haven't received anything about my order being sent. I send an email asking what the hold up is and they tell me my case is on backorder and won't be shipped until Sept 15th!!! WHAT THE HELL and I had to email them to find this out,they didn't have the courtesy to email the customer and let them know?! Garbage customer service. Atleast I got a refund but now have to go and research ANOTHER case and wait more time for it to get here to protect my phone. 💩 funny it won't let me post a picture. NO WHERE WHEN YOU ORDER SAYS PRE-ORDER OR BACK ORDER! NOR DID IT SAY THAT WHEN I PLACED MY ORDER 8/6. LOL."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T23:43:04.000Z",
          "Titre": "I have emailed and emailed GHSTEK MANY…",
          "Contenu": "I have emailed and emailed GHSTEK MANY MANY TIMES! About what was going though. I STILL HAVE NOT HEARD BACK FROM YOU. its BEEN  ABOUT 7 WEEKS."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ryan De Ruig",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T21:34:02.000Z",
          "Titre": "No one can hear you with the cover on.",
          "Contenu": "I haven’t tried my cover yet, but when my wife has her cover on her phone, no one can hear. So she’s about to bin it because it’s pointless to have it on for that reason."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alisa  Smith",
          "Nb_Reviews": 3,
          "Date": "2023-09-21T18:14:11.000Z",
          "Titre": "Thx for nothin...",
          "Contenu": "Listed the case i ordered under the note20 ultra, it didn't fit. Then your rep shamed me for not reading the small print. No problem...no more ghostek for us.Sincerely..."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nick Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T13:42:27.000Z",
          "Titre": "The case is awful for phone calls",
          "Contenu": "The case is good, but it makes phone calls almost impossible. Everytime I call anyone, or am trying to talk on the phone. I am constantly told I’m hard to hear, and choppy, or that I’m cutting in and out. Great protection, but basically useless as a phone with these cases on."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Gavin Cathcart",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T16:13:17.000Z",
          "Titre": "Ordered a case for my phone it’s been…",
          "Contenu": "Ordered a case for my phone it’s been weeks waiting for it to arrive and now during this time my phone has incurred damages that wouldn’t have happened with a case."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Smith",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T18:49:55.000Z",
          "Titre": "I ordered a cell phone case",
          "Contenu": "I ordered a cell phone case, I got a shipping confirmation email. After seven days there was no update on the shipping. It just stayed the same. I communicated via email stating that I had not received my item yet even though I got a shipment confirmation email. They stated that they had discontinued the item at that time. It was still listed on the website. It was also listed on eBay and Amazon for my particular phone. I requested that I would be sent another case that was listed on the website. However, they refunded my money for the case maybe I’m wrong but I felt like waiting seven days and I had to email to check on the status of order. So my main complaint was someone waited seven days even though I had a shipping confirmation to tell me that they no longer sold it so why send a shipment confirmation that it had shipped when it really didn’t. I run a company I understand customer service I totally do so I feel like I should’ve gotten a case comped because nobody asked me if I wanted to refund or order something else at equal lesser value."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lorenzo rubel",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T00:58:01.000Z",
          "Titre": "Requested 2 refunds/returns and never…",
          "Contenu": "Requested 2 refunds/returns and never was given the ability to do so. Customer service took way too long to respond."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rollie Morrow",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T16:45:30.000Z",
          "Titre": "Don't know if it's coincidence or not",
          "Contenu": "Don't know if it's coincidence or not.  I've had my phone for 2 years now, always had an Otter Box, phone never got damaged.  The week I've had this case the back of my phone is shattered.  Not happy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KP Provost",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T18:24:53.000Z",
          "Titre": "I purchased the waterproof one",
          "Contenu": "I purchased the waterproof one.  No complaints about the quality of the case but you can barely hear anything out of it.   That is my only complaint but hearing is important."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Sebastian Quek",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T18:08:44.000Z",
          "Titre": "The shipment is too slow",
          "Contenu": "The shipment is too slow , ordered on 15th Feb , received it on 1st March is scarily slow , the package itself is lightweight , should not have taken such a long time to reach destination ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 3,
          "Date": "2023-03-22T05:27:49.000Z",
          "Titre": "Case was called slim but was very…",
          "Contenu": "Case was called slim but was very bulky, the back of it was leather but a part was peeling up already, some excess glue on the inside of the case. it wasn't up to the quality I thought I would be getting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Van Duker",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T15:34:53.000Z",
          "Titre": "I ordered the wrong one by mistake",
          "Contenu": "I ordered the wrong one by mistake, I have asked for an RMA over a week ago with no response, I have already ordered and received the correct one, very poor customer service"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T20:07:26.000Z",
          "Titre": "This case is only to be used for…",
          "Contenu": "This case is only to be used for underwater applications.  It is NOT an everyday case.. you cannot hear your calls and your calls cannot hear you...."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "jacobtomas",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T18:05:13.000Z",
          "Titre": "Not so much the product because I only…",
          "Contenu": "Not so much the product because I only just received it. The shipping went to Germany before it came to Canada?   Unacceptable in my opinion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isidro Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T22:36:27.000Z",
          "Titre": "Paid for extra shipping on BOTH cases.",
          "Contenu": "Paid for extra shipping on BOTH cases.Came as regular shipping and was very upset. Why did I pay an extra 20.00 for each separate case for fast shipping?!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Francisco Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T06:22:07.000Z",
          "Titre": "I'am not happy with the product it did…",
          "Contenu": "I'am not happy with the product it did not fit my phone"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "AbdAlrzzaq Alommar",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T21:15:33.000Z",
          "Titre": "You're asking me about my order and I…",
          "Contenu": "You're asking me about my order and I haven't received it yet, worst shipping ever, If i have ordered it from china it would have made it to me by now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leticia Lizarraga",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T01:48:40.000Z",
          "Titre": "I sent an email saying that I needed to…",
          "Contenu": "I sent an email saying that I needed to return item and never got a response. I was looking to get a different item because I got a new phone and  don't have any use for the item I purchased."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Bert",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:51:17.000Z",
          "Titre": "Zero Customer Service!",
          "Contenu": "I ordered the \"Galaxy S23 Series Waterproof Cases with Holster Clip — NAUTICAL - Galaxy S23 Plus / Clear\" (Order Number: 152680) on July 14, 2023, and here are the following reasons why I did not like the service I received from ghostek:1. Even though the confirmation email said my product was shipped on July 15th (from New Jersey), I only received it today (July 27);2. Because I never received a response to TWO \"Contact Us\" messages that I sent ghostek re: the product that I ordered, my wife ordered another case through Amazon yesterday & that product was at my door TODAY (meanwhile it took ghostek 13 days to deliver their product); and, lastly,3. The \"Tracking\" info. that ghostek sent me was absolutely bogus.  When I clicked on the Tracking button (which I did numerous times over the past 13 days). all it ever said to me was, \"En Route\" & I had no way of finding out how close it was to being delivered to my door.  Additionally, when I went to DHL's website directly & put in the crappy Tracking number that was provided to me by ghostek, their website said the number was erroneous!All-in-all, a very frustrating experience buying a ghostek product (but they certainly have the right name - the company is \"ghost-like\" in their delivery & communication with their clients)!  I will not be shopping for any products offered by this company again & I will be leaving a Google review too!Bert."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CRAIG P",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T22:01:12.000Z",
          "Titre": "Not HAPPY...",
          "Contenu": "Was so excited to get this case...but very disappointed with how it fit for the money.The hinge seems to be really loose and rattles ALOT and where you use your finger print side button I could not get it to work but once and awhile...now it just sits on the counter after 3 days of trying to make it work since I paid a 140 bucks for it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Valen Provenza",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:09:23.000Z",
          "Titre": "Phone case is great. Belt clip bad",
          "Contenu": "Phone case is great. The belt clip that I bought extra as an accessory was very disappointing. Phone falls off every time I bend or kneel the slightest bit"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Erik Horn",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:04:39.000Z",
          "Titre": "This product is absolute garbage",
          "Contenu": "This product is absolute garbage. My phone fell from a two-foot shelf onto a mat and the screen shattered inside this case. On their website, they advertise that the case can withstand a twelve-foot fall. This is blatantly false advertising. I tried to get a refund through Amazon, but that was useless. I then tried to get a refund from the company directly, which was useless. Do not buy this case.  *EDIT* The company did finally own up to the product problem and did give me a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Dorsch",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:38:37.000Z",
          "Titre": "I love the case but disables Pixel 8 pro temperature sensor",
          "Contenu": "I love the case.  Everything seemed greater until I attempted to use the thermometer feature on my pixel 8 pro. This case renders the sensor inoperable.  Does not read correctly under any circumstances.  I hope that thos issue can be rectified in the deign of this product or I may need to return.  I know many do not use this feature but I have found many practical uses for this that I have already integrated into my life. Is there a revision of this product that addresses this issue.  If there is not I would like a refund or return.  I have already wasted applying one of my magsafe compatibility magnets to this case.I want to like this. It's perfect for me in every way except for this fundamental, important flaw.  Please contact me to come to a resolution."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Kirsty Pentecost",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T06:41:19.000Z",
          "Titre": "Tiny bit to small",
          "Contenu": "The cover is a couple of mm to small, doesn't quiet fit, covers the charger hole slightly,  so the charger doesn't stay in properly."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew Hartley",
          "Nb_Reviews": 16,
          "Date": "2023-10-30T12:41:30.000Z",
          "Titre": "iPhone 15 Pro case is very…",
          "Contenu": "iPhone 15 Pro case is very disappointing. The case has no button, just a recess provided with a waterproof membrane, to operate the function button on the phone. You need very narrow fingers to operate it. The membrane is likely to be damaged. The foam sheet located around the camera lenses on the case disintegrated leaving little bits of black foam on the lenses."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adam King",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T15:01:59.000Z",
          "Titre": "Samsung Z Fold 5 Exec - Product Lacking",
          "Contenu": "Samsung Z Fold 5 Exec case not brilliantly made/designed - the front screen edge on the left/hinge side tends to be compressed slightly by the sliding hinge cover.  This slight compression causes the edge to pop-up away from the front screen and warp slightly obscuring it.  The sticky strip is obviously intended to mitigate this effect but it doesn't do a great job and ends up becoming a pocket-fluff magnet.I also didn't feel the manufacturing or material quality of the bike mount was particularly good for the price either - quite thin-walled plastic throughout.Logistics of ordering all good, but as I said, I wouldn't highly rate the product itself."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert A Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T00:13:51.000Z",
          "Titre": "Shipping took to long, dirt under screen protector",
          "Contenu": "I paid for express delivery 1-3 days, ended up getting it 7 days later. The front screen protector somehow got dust and crumbs underneath it even though it's supposed to be water proof (cleaned before the case was put on)Ended up ripping the screen protector out because it got so bad, phone is water proof so I'm not missing out on that, just sucks this case is \"ip 68\" rated but somehow got crumbs and dust under the screen"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LeSheba Morris",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T16:48:56.000Z",
          "Titre": "I wasn't satisfied with the phone case…",
          "Contenu": "I wasn't satisfied with the phone case I ordered. The S pen slot steady opens and my pens fall out. They cost to much to keep losing them. It's hard to type on the keyboard as well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T15:22:37.000Z",
          "Titre": "The cuality of the product is not what…",
          "Contenu": "The cuality of the product is not what I expected. I asked for a refund and have not received it, just got an email that the request was received and haven't heard back from you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jekrr755",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T15:22:45.000Z",
          "Titre": "I didn't like the product",
          "Contenu": "I didn't like the product.  It was a two piece cover not one piece & it came with adhesive strips which made me very apprehensive about the stability of the cover staying on if the phone was dropped.  Yikes!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason Greenberg",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T03:48:47.000Z",
          "Titre": "Not easy getting customer support",
          "Contenu": "I have been trying to make a return for a week and I feel like I am not getting anywhere. I receive a question via email and I respond right away. It takes a whole day to receive a response with another question. This back and forth is driving me crazy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Curtis G",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T14:28:46.000Z",
          "Titre": "Almost Fantastic",
          "Contenu": "Strong well made and beautiful case for the Pixel Fold. Unfortunately the access to the fingerprint scan button is way to small.  Cannot use the fingerprint scan or even power it on with case closed (even pinky won't work). Open it is then accessible.  For the price point of this case that is a killer for this case."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Louis M",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T17:42:55.000Z",
          "Titre": "Poor fitment",
          "Contenu": "The phone cases didn't fit the phone very well and the hinge cover was way bigger than it needs to be. The hinge cover also wasn't magnetic so it needs to be manually flipped open and closed. Pretty disappointed with the quality of the product."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ashley",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T18:10:14.000Z",
          "Titre": "No follow-up",
          "Contenu": "Well I tried contacting someone to get a follow-up with my order that I placed on July 28th and still haven't received it. There has been no update since August 4th. I wanted to know why it is taking soo long to get my package since it is supposed to be coming from Brooklyn New York,  and I'm in Montreal, Qc Canada"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelsea",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T04:27:33.000Z",
          "Titre": "Feels and looks cheap",
          "Contenu": "I ordered the aluminum case and expected the quality to be better. I guess if you are looking for something big and bulky.. that also feels and looks like cheap plastic. The spine of the case is so bulky that it gets in the way of opening your phone. You have to be careful not to break it. It's not worth the money at all. I'm so disappointed witjt his purchase and actually regret it."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Steve B",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T16:21:44.000Z",
          "Titre": "Broken card holder",
          "Contenu": "Edit- Ghostek is sending me a new case. I'll update the review if the new case works as expected.The magnet in the phone wallet is held together by 2 pieces of metal and a magnet. One of the metal pieces came unglued right out of the box and now it won't close. The polarity of the magnet in the case is opposite of the car mount o have and won't hold. The case itself is ok.... bought it for the card holder and phone mount."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T02:29:50.000Z",
          "Titre": "Looks nice, but slippery and impractical",
          "Contenu": "My partner really likes his Ghostwk case, so I ordered one as well. First downside is I thought I was ordering a fully encompassing case to protect from dust, which I didn’t. But that’s on me.My issue is that as lovely as the case looks, it doesn’t offer much protection and it’s slippery. I’ve very nearly dropped my phone 10 times a day since I put this case on just because the plastic is smooth and doesn’t offer any real grip. I feel like the grey plastic needs to be less smooth, either change of material or add texture to it so you don’t drop it. It does have little plastic strips either side of the case but they are made out of the same smooth plastic and are almost flush with the metal part of the case, so don’t really do much.I will be changing out my case asap. I feel like with the lack of overall coverage with how slippery this case is I am going to drop my phone and break the damn thing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SH",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T18:32:21.000Z",
          "Titre": "Phone case concerns that need to be fixed for this price",
          "Contenu": "The case covers the ear speaker, bottom speakers and charging port so you cannot hear calls clearly or enjoy the sound. I contacted tech support and you have not responded. For the price this is not acceptable the phone is already waterproof so why does the front screen protector cover the speakers, charge port, bottom speakers etc?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicholas Norton",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T15:45:06.000Z",
          "Titre": "Haven't had it a month and already…",
          "Contenu": "Haven't had it a month and already broken.  Waste of 80 bucks.  Update. I don't need a courtesy replacement.  I don't want your product.  An obvious flaw was made in your design.  It's going to continue to break there, with normal daily use.  I'm just going to buy another phone case, from a quality manufacturer.  Replacing a broken product, with the exact same thing, will result in another broken product.  You have been blocked, do no attempt to reach me further. Good day"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Russell Ladouceur",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T21:16:30.000Z",
          "Titre": "As far as protecting my phone when…",
          "Contenu": "As far as protecting my phone when dropped the case works great. Texting with the phone is difficult in the finger print scan zone. Waterproof capabilities are no good. Water penetrated the case causing charing issues well above the 10 meter mark. Not ever 4 ft deep. Left message on Instagram and no reply. Would not buy again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T12:31:22.000Z",
          "Titre": "The buying experience is ok",
          "Contenu": "The buying experience is ok. It is pretty normal. The shipping information however is less than stellar. There has been no shipping information sent or updates. There is not an option on the website to check on your order status. So I guess it is a guessing and waiting game as to if you get your purchase or not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith Bell",
          "Nb_Reviews": 5,
          "Date": "2023-07-20T16:10:17.000Z",
          "Titre": "It's an ok case but could be better",
          "Contenu": "It's an ok case but there is issues with lack of sealing due to gaps around the edges that are constantly getting dust and other things inside.  The pictures look like thick tempered glass but is actually a thin piece of clear plastic. Only certain chargers will fit due to the length to the base there is where the plug sets.Would of rather of got the waterproof case for $20 less if I knew about the issues and build quality but sadly too late now.  Probable will avoid the brand in the future."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff Nixon",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T10:57:39.000Z",
          "Titre": "You sold me a product that you had in…",
          "Contenu": "You sold me a product that you had in stock five days later you discontinued it with no explanation. But when I go to the website, you still have it for sale that’s called false advertising."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D. Wms",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T18:18:21.000Z",
          "Titre": "This was my 3rd order after returning…",
          "Contenu": "This was my 3rd order after returning the same case 2020 edition; they kept sending me the wrong one. The Amazon vendor was a disaster when trying to order the 2022 edition for my new phone. The armor case was designed to protect the phone itself since it was tested by the military. This is the only reason after the frustration and aggrevation in placing the order directly on their site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Coughenour",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T15:40:18.000Z",
          "Titre": "Terrible sound quality",
          "Contenu": "The plastic for the screen protector is poor quality not clear. It also makes phone calls impossible due to the affect on quality of sound. I tried a few mods to make it work for me. I cut the screen protector out which help some but in the end under 24 hrs and it was taken off"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Tanya Erlank",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T09:35:07.000Z",
          "Titre": "I am still waiting for my order",
          "Contenu": "I am still waiting for my order. I purchased my ghostek phone cover almost 3 months ago, and it arrived in my country over 1 month ago, and still nothing. And no one is able to help or assist me. I am heavily disappointed and I have not been able to use my new phone and I feel like I have wasted my money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Applegate",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T00:19:24.000Z",
          "Titre": "The case plastic scratches easy",
          "Contenu": "The cause feels good in my hand and seems durable but it dident last two days before the front screen and camera protector had scratches all over them making it dull. So in my opinion the case itself is strong but the plastic they used for protection is garbage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clint sassman",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T00:52:41.000Z",
          "Titre": "Haven't received a response back from…",
          "Contenu": "Haven't received a response back from you guys when I got my case it was bent or deformed would like a new outside piece"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen Tammearu",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T17:57:32.000Z",
          "Titre": "Poor R&D",
          "Contenu": "The case looks nice and certainly delivers on water resistance and shock dispersement, however, the build makes the phone completely useless as sound gets redirected and trapped causing feedback and echoes. I wanted to return the case but no longer have the packaging."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tim Brockert",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T16:42:38.000Z",
          "Titre": "I had to modify this phone case 3x…",
          "Contenu": "I had to modify this phone case 3x before it was usable. It doesn't fit a car phone holder, the charging cable couldn't fit in until I carved it out, same with fingerprint ID and volume control, so 4 modifications."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T21:20:07.000Z",
          "Titre": "Case wasn’t mag safe compatible as described",
          "Contenu": "I ordered an allegedly mag safe compatible case for my iPhone 12 mini and the NRG wireless car charger. The case was not mag safe compatible, and even if it was, it is not large enough to place a mag safe magnet on it to allow it to attach to the charger. So, I had to by a different case from another company to use the charger. I submitted a review already for both of these items and neither were posted on the website, which raises more questions. They dispute that it was represented as such, but to this day, it is."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bradley Schneider",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T15:44:18.000Z",
          "Titre": "Poor placement of magnet.",
          "Contenu": "The case has a built-in magnet. The magnet did not align up with the wireless charger. It did not wirelessly charge correctly. By placing the magnet 2 mm above the current placement, it would have rectified the issue. Poor placement of the magnet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Wlasniewski",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T22:31:54.000Z",
          "Titre": "Not impressed",
          "Contenu": "Dropped my phone once on the corner, while my phone was perfectly unharmed( which is the goal) the integrity of the case screen was compromised with a 1 inch Crack in the top right corner. It was only a 2.5 foot drop. Guess I expected more with all the hype on these cases. Previous case was 10 bucks and took much more or a beating before being compromised."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J M",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T18:51:19.000Z",
          "Titre": "Wallet is junk",
          "Contenu": "The very 1st time i used the wallet, put in my license, debit card, and punch card for work, and it broke. Now im stuck with a case that has all kinds of wierd sharp edges and its akward to hold. The main reason i got it was for the card wallet, and its extremely poor quality. Also, cant even purchase a seperate wallet. Big disappointment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle Ragland",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T19:20:45.000Z",
          "Titre": "Wish I could use it, but the front cover wont allow it",
          "Contenu": "The case was nice, and shipped/arrived quickly. I am not going to be using this case unless I need a backup. The issue is that the cut out for the front glass overlaps the display area on the front screen of the Fold 4. This means clicking on that side of the screen is not possible as the case is raised about 1/3 an inch. I swipe from the sides to go back, and also do gaming on the phone, making this very inconvenient option. I was super excited to get this case with the spine cover for the phone, but disappointed in the design for the front screen, causing me to choose to not use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Gisewhite",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T02:11:02.000Z",
          "Titre": "The Pixel Fold case is not great",
          "Contenu": "The Pixel Fold case I purchased does not stay on the phone very well.  Even with the glue strips that are provided, every time I open the phone case the back half of the case comes off.  The case does not allow the Google wireless charger to work and the case has a really bulky cover for the hinge."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Cena",
          "Nb_Reviews": 3,
          "Date": "2023-01-20T13:59:40.000Z",
          "Titre": "The case seems to Look OK",
          "Contenu": "The case seems to Look OK. But it scratches easily. So easily that the fingerprint function does not work. My phone cannot pick up my print bcus there is a bubble or a mark under my screen... I installed it right as the directions say.. the camera section has scratches and makes my photos less quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T16:05:49.000Z",
          "Titre": "Just not what I expected",
          "Contenu": "Just not what I expected I expected more coverage on the hinge of the phone case.  More detailed photos on your description would be better. We'll use it for now cuz it was $58 and want my phone to be protected some what."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Garner",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T15:47:33.000Z",
          "Titre": "Hinge protector",
          "Contenu": "After using the case for only a couple of days the hinge protector stop automatically flipping closed when you close the phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T05:28:46.000Z",
          "Titre": "I don't care for the case at all",
          "Contenu": "I don't care for the case at all. It's working, but only after taking the screen cover off. The sticky button you out on didn't work for me at all with my fingerprint. But worse, the screen was so foggy. Just not clear at all. Hen typing or games, i could hear the screen protector tapping my screen and I had to push hard each time I typed for it to work. Otherwise the case is strong and sturdy, but now I need another screen protector."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jun",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T01:52:48.000Z",
          "Titre": "Hope for better screen on case",
          "Contenu": "The grip is good, protective and like how it covers the charger input from anything going in but when trying to type or actually using the phone the screen can’t react well and have to press slightly hard or go slow because of the screen the case have and gets a little frustrating"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kruse",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T14:33:04.000Z",
          "Titre": "Case is Great, Customer Service Not So Much",
          "Contenu": "Case is perfect, but hand strap broke within 24 hours of owning the case.  Sent email and they asked for photos of the strap.  No big deal, but I didn’t keep the strap."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T15:58:48.000Z",
          "Titre": "I own a Samsung zfold4",
          "Contenu": "I own a Samsung zfold4, and recently purchased the Ghostek Covert clear case that provides exceptional protection for my zfold4. I absolutely loved the case.... But then just a week into having the case on my phone, my inside screen started becoming unresponsive to my Spen and touch from fingers. I then used the \"create a note\" feature and covered every area of the inner screen with the pen. This was when I realized that the two magnets from the Covert's Binger protection had ruined my screen in the exact two areas of where the magnets are with the phone unfolded, and the two ruined circular areas on my inside screen are about the size of a half dollar coin. As a result of this, I'm not able to file a warranty claim and have to use an insurance claim that is going to cost me $250 to replace my zfold4, and it's not by fault from me that I'm having to spend money because of a problem caused by the Ghostek Covert case. The customer service response to my problem was not treated with care nor was this problem escalated to higher authorities in the Ghostek management team."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle Harris",
          "Nb_Reviews": 3,
          "Date": "2023-03-31T21:17:52.000Z",
          "Titre": "Ghostek I absolutely love my case",
          "Contenu": "Ghostek I absolutely love my case. It goes perfectly with my brand new S23+ (lavender). However the clear back is NOT scratch proof. I've only had it 8 days and there are already scratches on the back. It's not stored in my purse or pocket. I reached out to customer service and have yet to receive a response."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Tracy Popp",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T07:32:50.000Z",
          "Titre": "not as good as a life proof case",
          "Contenu": "time line to order and receive the product was super, but the case is not as good as my Lifeproof case. I already have dust and small particles under the screen protector. I wonder how water proof the case is????????"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Durio",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T15:16:53.000Z",
          "Titre": "Not sealed and hard to use.",
          "Contenu": "The dot on inbetween the plastic cover and screen is not the easiest to get right.  The case is not sealed and thus I have dust between my screen and plastic protector. I cannot peel it off the screen cover because I do not have any dots left."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alexandria Peoples",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T19:45:56.000Z",
          "Titre": "Not Worth The Money",
          "Contenu": "The case bubbles a the back leaving the phone uneven when set down. The speakers barley work in the case and you can not hear a phone call let alone speak clearly for the other person to hear on."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald Puckett",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T23:21:17.000Z",
          "Titre": "Wrong color…",
          "Contenu": "Although this company came highly recommended I ordered a case and after almost two weeks wait Time the wrong color case came which upset me but it is what it is I’m not trying to wait for the whole return thing so I guess I’ll be okay"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chasity Houchins",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T13:21:50.000Z",
          "Titre": "Read before ordering!!!",
          "Contenu": "I ordered a new case for my S22 Ultra. I got the executive with the detachable card wallet. I also ordered the NRG mount. It took almost 2 weeks for my order to arrive, with very little assistance from customer service except to \"wait longer\" and a tracking link that I already had.  When my order finally arrived I was very disappointed in the product. The wallet is not flexible and only holds a couple cards and is cumbersome to use. The detachable feature needs work as well. The NRG mount was the most disappointing. The magnet isn't strong enough to hold my phone and case without any cards in the wallet. It was completely unusable.  I immediately boxed it all back up for return. Additionally, they sent a card with a QR code for instructions but the video that was supposed to be linked was not available.**In response to the company reply, when asked by trustpilot I updated info in my review to include my order number 137241. Only holding 3 cards would not be a huge problem but the wallet makes it cumbersome and difficult to access the cards. Taking the wallet off is easy but it doesn't go back on as easily.  As far as the NRG mount concerns, I was searching your site by device and that mount came up as an accessory.  While I am not happy with the product or shipping time, I remain hopeful that the return process won't be too difficult."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacob Jervell Harris",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T20:25:44.000Z",
          "Titre": "Poor quality",
          "Contenu": "They are quick to reach out when concerned. The case I bought for the z flip5 sucks. The case comes off the phone when dropped or when you unfold it. Not of good quality. To expensive for what you get. Not happy with it at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Ooten",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T17:32:06.000Z",
          "Titre": "The case is nice and waterproof",
          "Contenu": "The case is nice and waterproof! The only thing i dont like is it echoes other people when i have them on speaker!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tee",
          "Nb_Reviews": 2,
          "Date": "2023-04-23T16:30:55.000Z",
          "Titre": "The wrong case was sent to me so I…",
          "Contenu": "The wrong case was sent to me so I reached out to customer service & said I was able to exchange but I had to pay for shipping. Doesn’t make any since. Y’all sent the wrong case so why do I have to pay for shipping."
        },
        {
          "Note": 2,
          "Lieu": "BH",
          "Pseudo": "romy rajan",
          "Nb_Reviews": 2,
          "Date": "2022-11-20T05:29:22.000Z",
          "Titre": "the magnet broke out on the card…",
          "Contenu": "the magnet broke out on the card holder. also i was expecting it to be an overall magnet. bcse its easy to mount to the car holder. now every time i need to remove the card holder inorder to stick to the magnetic car holder."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Cat",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T13:50:02.000Z",
          "Titre": "Considering it still hasn't departed…",
          "Contenu": "Considering it still hasn't departed the USA 15! Days later, I'd say.. pretty sh¡t."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mandy",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T22:49:42.000Z",
          "Titre": "The case is made not nearly as well as…",
          "Contenu": "The case is made not nearly as well as I would have expected for that price point.I have used the case for approximately 1 month, and can no longer take clear pictures because it scratches so easily."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean Wenham",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T23:19:41.000Z",
          "Titre": "It works as advertised.",
          "Contenu": "It works as advertised.I expected it to look more executive style. But it looks plastic."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn Maes",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T20:45:07.000Z",
          "Titre": "Couldn’t even make a call the sound was…",
          "Contenu": "Couldn’t even make a call the sound was so muffled… nobody could hear me unless I put it on speaker. Went with a spider case and it works great. Sorry ghostek, but you need to work on it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:07:32.000Z",
          "Titre": "Terrible right out of the package",
          "Contenu": "When I received the phone case. The double sided tape wasn't on the phone. Like it wasn't even in the phone case it was just in package so now the case slides off while in my pocket. The screw that holds the hinge protector on scratched the hinge on my phone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelley Pierce",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T02:10:05.000Z",
          "Titre": "Junk box showed up opened..",
          "Contenu": "Junk box showed up opened... no screen saver on flip cover waste of money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T23:37:27.000Z",
          "Titre": "Bigger case than expected",
          "Contenu": "Bigger case than expected, a little heavy but at least it works"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stacie Elam",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T17:02:42.000Z",
          "Titre": "I’m not crazy about this case!",
          "Contenu": "I’m not crazy about this case!! You can’t hear as good with it and people can never hear you good unless you use earbuds. And then sometimes you can still sound muffled to the person on the line. I would NOT purchase this case again! It is slim an and fairly nice case but if you can’t hear or people can’t hear you doesn’t matter to much how well it’s designed. But the case was to much not to use it for a little bit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kathy Horn",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T16:26:29.000Z",
          "Titre": "I love the case but was disappointed…",
          "Contenu": "I love the case but was disappointed that I got no screen protector!"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Roy Overbeek",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T19:35:32.000Z",
          "Titre": "I am still waiting to get it delivered",
          "Contenu": "I am still waiting to get it delivered I ordered same day stuff from Japan And those packages I already have a week"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Yancey Lacroix",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T00:34:30.000Z",
          "Titre": "The screen protector is already…",
          "Contenu": "The screen protector is already scratched up pretty bad and I've only had it a few week I'd like a way to have it fixed"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Tanya Erlank",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T17:10:36.000Z",
          "Titre": "I still haven't received my package",
          "Contenu": "I still haven't received my package. It doesnt seem to be moving at all. My email is not going through and my phone call says DHL is closed. Please help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christian",
          "Nb_Reviews": 3,
          "Date": "2022-11-17T18:08:46.000Z",
          "Titre": "Case was good first day",
          "Contenu": "Case was good first day. But then putting phone in pockets and whatnot. Somehow started to get dog hair and dust under the waterproof case and onto my screen. Have to clean regularly"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jamie Dill",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T13:59:56.000Z",
          "Titre": "Design flaw",
          "Contenu": "I loved the case at first but noticed that when on the phone everyone would complain they couldn’t hear me and that I sound “muffled”. Being that this was a new phone that was strange so after multiple complaints I started thinking it was the case. I looked at the bottom where the speakers are and when in the case they are completely covered so I took my phone out and haven’t had a problem since. I really wish this wasn’t a design flaw because I loved everything else about it!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Sarah",
          "Nb_Reviews": 5,
          "Date": "2023-05-03T10:14:09.000Z",
          "Titre": "the fingerprint sensor doesn't work…",
          "Contenu": "the fingerprint sensor doesn't work with the case on, contrary to what is claimed. It's quite bulky as well."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Arturo",
          "Nb_Reviews": 4,
          "Date": "2023-08-11T17:35:30.000Z",
          "Titre": "Bad experience",
          "Contenu": "Bad experience! I still without received my Nautical Case… too bad"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael K",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T17:01:27.000Z",
          "Titre": "Not a disaster, but...  meh",
          "Contenu": "It's a bulky case.  The cover appears a little wavy.  A pain to plug into with that flap in the way.  The ring for the thumb print is a little off center."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RODD PARKE",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T19:37:34.000Z",
          "Titre": "I don't like that I have to remove the…",
          "Contenu": "I don't like that I have to remove the case to charge my phone on my other Qi chargers. It is a hassle."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vanessa Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T14:20:04.000Z",
          "Titre": "Could not use microphone.",
          "Contenu": "Could not use microphone when the case was on.  Other than that big thing, I loved the case."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JAW",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T20:58:22.000Z",
          "Titre": "I ordered the case for my Google pixel…",
          "Contenu": "I ordered the case for my Google pixel 6 and the clip. The case is water proof but not very durable. And the the universal clip doesn't hold very well for my line of work."
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "Hiro",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T14:01:47.000Z",
          "Titre": "Different from the picture on the…",
          "Contenu": "Different from the picture on the website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bonnie Chaix",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T02:30:20.000Z",
          "Titre": "It doesn't work on my charger",
          "Contenu": "It doesn't work on my charger.  I have to take the cover off, and that's a bit difficult.Too much trouble."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael hospelhorn",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:44:21.000Z",
          "Titre": "Case looks great",
          "Contenu": "Case looks great. However only had it for a week and a half and have cracked the back of the case in 2 places. 1 on the lense for the camera and 1 in lower middle of the back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sammy Duran",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T23:14:47.000Z",
          "Titre": "iPhone 12 Pro phone case with belt clip",
          "Contenu": "I loved my phone case with belt clip but I accidentally dropped them and the belt clip broke which is why I bought this set in the first place. The phone case is heavy duty but the belt clip is definitely not. Only had it for 2 weeks.*Update: Ghostek made it right by sending me another belt clip! Very pleased with their customer service! Thank you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nate Popple",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T15:03:00.000Z",
          "Titre": "case",
          "Contenu": "the buttons are very hard to press and the case is very slick other than that it is a very nice case"
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "N/A",
          "Nb_Reviews": 3,
          "Date": "2023-02-10T06:05:52.000Z",
          "Titre": "I still haven't received the parcel",
          "Contenu": "Today is 10 Feb and I still haven't received the parcel. Poor logistic!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "sam",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T18:49:01.000Z",
          "Titre": "some bugs to work out",
          "Contenu": "The case does not preform that well. The muffled voices because of the waterproofing is really bad"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Romero",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T03:34:04.000Z",
          "Titre": "The adhesive stickiness gave withing a…",
          "Contenu": "The adhesive stickiness gave withing a week of having the case. And I work in office."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blayne",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T01:14:13.000Z",
          "Titre": "Review",
          "Contenu": "Everything was great. Shipping was fast. Loved the case. But while I had the bottom rubber piece that covers the charger & stylus pen off, I accidentally dropped my phone. It chipped a piece of the case. Is there a warranty to replace the case?"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Matt Robins",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T13:37:31.000Z",
          "Titre": "Case Quailty",
          "Contenu": "The case is nowhere near the quality that I thought it would be it is very plasticity and the charge port door is very hard to open"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T13:57:03.000Z",
          "Titre": "Overrated.",
          "Contenu": "The nautical case for p6p is bad, get a normal case instead. The internal screen isn't covered by a protective film, but the external part is. So it gets dusty and you have to literally be in a clean room with gloves like the installation video to install it properly. The fingerprint censor smudge never goes away, I've tried it 4 times with the extra ones they gave. Maybe I'm just not skilled enough, but mass produced consumer products shouldn't be this difficult to install correctly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wisconsin",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T16:18:48.000Z",
          "Titre": "Frustrated",
          "Contenu": "The product itself was fine. However if you think paying for shipping to have in 3 days don't waste your money. It will not happen. Sending a polite request for return of shipping fees went into a black hole. Ordered Wed night n paid shipping expected to get Sat. Didn't get till Mon night. Luckily paid for screen saver prior to getting this. New Phone was dropped n screensaver did its job."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Mohammad",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T16:14:14.000Z",
          "Titre": "Good but Bad for Calls",
          "Contenu": "The product seemed like it wasn't sealed properly. Seemed refurbished but is functional...Calling experience is bad with this case on. The other side cant even hear me nor can I hear them. The design is bad when it comes to this aspect only."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sharon Woods",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T16:20:32.000Z",
          "Titre": "I had my case that I paid 168.00 for 3…",
          "Contenu": "I had my case that I paid 168.00 for 3 days set down in a chair at a restaurant and my phone slipped out of my pocket and case broke wow I I'm so disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Laginess",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T15:50:25.000Z",
          "Titre": "I was incredibly disappointed with this…",
          "Contenu": "I was incredibly disappointed with this case.  Hard plastic everywhere, no soft touch or rubber.  The buttons look and feel cheap.  The screen protector was flimsy and at best, would guard against scratches.  The biggest complaint though was the sound.  Everything was muffled and all calls experienced feedback. I went back to my old otterbox after only one day.  I had high hopes for this case,  but will not be buying from you again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Xicotencatl",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T03:01:39.000Z",
          "Titre": "It was the wrong case",
          "Contenu": "It was the wrong case. I searched for Galaxy S10e and Ghostek offered me the Galaxy S10 without realizing it till I got it."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T23:41:46.000Z",
          "Titre": "Qc lacking",
          "Contenu": "I was super excited to get the case for my fold 4 but was disappointed in the end. the sticker was loose, and the fitting is not right. When you open it, the bottom piece where the buttons are located are separating from the case. The fitting is not snugged. The volume buttons are not aligned and hard to press. I feel like i just wasted my money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julius Pressley",
          "Nb_Reviews": 1,
          "Date": "2022-10-10T23:09:22.000Z",
          "Titre": "Overall disappointed with the design of…",
          "Contenu": "Overall disappointed with the design of the fold 4 henge protection case. Way too bulky volume buttons weren't operable. And it was hard to press the fingerprint unlock button. Also the magnetic henge felt supper cheap. Expected more from ghostek."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Thaís Albuquerque",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T02:37:43.000Z",
          "Titre": "My order is late",
          "Contenu": "My order is late. Order number 144079-21Apr2023"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dawn Weinkrantz",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T18:52:11.000Z",
          "Titre": "I rarely complain",
          "Contenu": "I rarely complain.  But being that you asked.  The case is very flimsy.  I have a friend who has one that is amazing.  So when i got my new phone I was so excited to get one.  It does not seem to fit right. Its kinda loose and flimsy.  The QR code did not work for the instructions.  I had to find a video on my own.  The front and the back cover are slightly off in color.  I do have to say you do have fantastic customer service that answer's quickly. I just dont feel the quality of this product is even close to what the older model was.  :)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T00:37:27.000Z",
          "Titre": "Don’t bother getting this case if you want to have a conversation",
          "Contenu": "While the case protects the phone, you can’t hear any thing through it. Not worth buying"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CMB",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T23:35:21.000Z",
          "Titre": "Case slides off phone",
          "Contenu": "I hate to leave 2 stars, but the case arrived 2 weeks after the original back order date.  When I finally received it, it wouldn't stay on my phone. The case kept sliding off!!! I'll be returning the case."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick Carlson",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T22:11:13.000Z",
          "Titre": "Product has huge scratches in it after…",
          "Contenu": "Product has huge scratches in it after a few weeks. Not water or dust proof. Very unhappy."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Paul Nelson",
          "Nb_Reviews": 5,
          "Date": "2023-05-28T17:40:08.000Z",
          "Titre": "The cover purchased only cover the back"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "PD",
          "Nb_Reviews": 4,
          "Date": "2022-08-17T16:08:18.000Z",
          "Titre": "Frost white covert case color change",
          "Contenu": "I had bought  a covert case in frost white and since it was mentioned as anti yellowing and would atleast last for 18 months.. I was pretty impressed with the look in the beginning but its just been couple of months maybe less than 6 months and the case has turned yellowish brown. Not sure if I’ll be purchasing again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cheree Williams",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T14:09:17.000Z",
          "Titre": "I like the thin design of the nautical…",
          "Contenu": "I like the thin design of the nautical case. I \"did\" test it in a sink if water for over an hour and it is water proof. That's a big plus, BUT I can't use the case because it will not recognize my fingerprint.  I tired over a dozen times and it won't work. I gave the case to my husband who does not use a fingerprint with his phone. If you fix that problem this would be a 💯 % great case all the way around."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Brodersen",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T16:02:40.000Z",
          "Titre": "Took almost two weeks to get here and…",
          "Contenu": "Took almost two weeks to get here and it wasn’t what I wanted."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "David M",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:45:20.000Z",
          "Titre": "Very good product poor service",
          "Contenu": "I have a GHOSTEK case for my old phone.  It has overall lasted better than the life proof and people can hear me better than the otter box. So I purchased the nautical slim for my iPhone 14.  Fit is good. Waterproof as expected. Button control is much better than the iPhone 8 design in which the silence mode dial is useless.  However, I totally forgot about how poor the customer service is.  I never heard back on warranty for my iPhone 8 case that the charge port rubber plug failed.  The only way to contact them is email.  They don’t read the whole email before responding. Which then takes additional emails and time to get an appropriate answer.  Glad I finally did receive my new cases.  They look like they will stand up."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Emilio Rosa Nuñez",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:27:38.000Z",
          "Titre": "Address situations",
          "Contenu": "I not receive my order  for incorrect address format in your sender proveedor"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Emmanuel Mark Ortega",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T22:12:14.000Z",
          "Titre": "Good cases, long time to get",
          "Contenu": "I haven't received my ordered Ghostek cases for my iPhone 15 Pro Max and Galaxy Z Fold5 phones. I ordered this last November 26. The cases look good on the website. DHL tracking was last updated November 29. I sent a message and was told that there might be delays with the (US) customs. This was my first time to order phone cases from the States. Most of the other branded cases I have bought were shipped from HK.(Reply, update)As delays are expected and could reach 30 business days for the delivery to be fulfilled, there is very limited visibility in tracking the package. I have experienced DHL package tracking here in Asia and they provide timely, relevant updates including customs delays. Thirteen calendar days have passed without any updates from the tracking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rdginto",
          "Nb_Reviews": 7,
          "Date": "2023-12-03T07:01:05.000Z",
          "Titre": "Cover ordered was wrong color",
          "Contenu": "We ordered two covers. Good communication regarding tracking delivery. Unfortunately one of the covers wasn't the color ordered. Upon contacting I was told they didn't have the color ordered. I would have liked to be able to decide if I still wanted the cover in another color or money returned. I wasn't."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Kohler",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:46:38.000Z",
          "Titre": "Difference from earlier versions make this version awkard.",
          "Contenu": "Shipping was slow a week to get the product.  Produawkward.  ifferent from prevailed model, it no longer has rubber on sides, thus slips in hands, more drops with this.  Al's product shape is awkward, wider back panel, makes it difficult to pick up and constantly looking at the back instaes of the front, it just seems ergonomics would have the front panel wider or same size.  The waterproof panel at the changing port is better than earlier version.  Did not like the fingerprint sticky side on the screen protector, it shows a dot, and I don't use fingerprint biometric.  The case is engineered well and will function as designed, it just is awkward compared to an earlier version"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T16:00:29.000Z",
          "Titre": "My review hinges on one thing",
          "Contenu": "The case is nice but my biggest problem is the hinge not having a spring to close. My previous case had a hinge, a full back and cover over the front screen, it was a generic case for a third of the price. I think simply adding a spring to the hinge would get the case to where it needs to be. Very awkward to have to close every time."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Patrick Dansereau",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:07:29.000Z",
          "Titre": "I like the idea behind ghostek and…",
          "Contenu": "I like the idea behind ghostek and everything but i didnt received my case delivery i paid 17dollars 5-10days work days now 11 work days still at jfk us im in canada and parcel didnt move for a week"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:48:37.000Z",
          "Titre": "Nice case once it showed up.",
          "Contenu": "The case was nice, easy to install, fits phone well, and doesn't feel bulky.  Only issue was the time it took to ship."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jennifer Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T07:48:23.000Z",
          "Titre": "Cases nice and does the job it supposed to do. Love it.",
          "Contenu": "I love the products (two iPhone cases).Thank you for your responding and follow up my feedback."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Dunk",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T21:43:10.000Z",
          "Titre": "Overall durable product",
          "Contenu": "Overall durable product, however the top case going around front screen of the fold 5, is overlaying on the screen, losing some visibility along left side (screen is reduced) Trying to type when having to press the ! Key is almost impossible."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Albert Adams",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T16:23:55.000Z",
          "Titre": "I wouldn't buy this one again.",
          "Contenu": "It appears to have taken 4 or 5 days for the case to be mailed, then another 3 to arrive.  The tracking sucked.  I bought another cheaper case from Amazon to protect the phone during the uncertain wait.  The application process was confusing.  I had to remove and reinstall 3 times, and will be stuck with a smudge in the fingerprint area.  It will be difficult to access the stylus if my fingernails are recently trimmed, and the voice assistant can't hear me unless I speak directly into the bottom of the case.  3 stars might be high.I'll probably buy the cheaper version of the Covert model, which is what I wanted in the first place.  I had it on my last phone and loved it, but I'll buy it through Amazon so I can reliably track it and know what to expect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cory Roberson",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T03:39:25.000Z",
          "Titre": "Pretty good case just can't open the…",
          "Contenu": "Pretty good case just can't open the charging port wish they would add either a loop or metal ring into the case"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy Newsome",
          "Nb_Reviews": 3,
          "Date": "2023-10-09T17:24:25.000Z",
          "Titre": "At first glance the case looks well…",
          "Contenu": "At first glance the case looks well made and is visually appealing, and I have no doubt it will protect my phone. Anytime I use speaker phone the person on the other end says I am hard to understand even with the speaker close to my mouth, and I keep having to clean little bits of dust from under the screen protector. Overall I really nice case with a couple improvements needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cs",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:15:16.000Z",
          "Titre": "Shipping time not accurate. Product great so far.",
          "Contenu": "\"2-5\" day shipping turned into 8 business days in addition to two weekends.  Did not receive in time for vacation.  Using it now, works very well, as described"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:02:23.000Z",
          "Titre": "Waterproof but callers cant hear you",
          "Contenu": "Its nice that the phone is waterproof, but I keep hearing people tell me that they cant hear me when im talking on the phone (speaker). The main phone they can hear me a bit more but they say it sounds muffledPhone Galaxy S10 NAUTICAL"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T14:57:53.000Z",
          "Titre": "Wrong Case Received",
          "Contenu": "I went on your website and selected my phone - the iPhone 11 Pro Max - looking for a case.  It brought me to a selection of cases to choose from.  What I didn’t realize is that the page it brought me to included cases for the iPhone 11 and iPhone 11 Pro in addition to the Pro Max.  Naturally, I ordered the wrong case and received it.  Customer service was fast to respond, but your filtering system on the website needs to work a little better to prevent this kind of thing from happening in the first place."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "TDG",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T18:24:54.000Z",
          "Titre": "Delivery took very long after paying…",
          "Contenu": "Delivery took very long after paying almost 20$ for it. I have bought many things online and usually if over a certain amount delivery is free but product arrives within a week. If you pay product is received within a day or two. This took 10 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danielle Sekula",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T14:13:47.000Z",
          "Titre": "The case is nice but the hinge cover…",
          "Contenu": "The case is nice but the hinge cover part falls off and is lost now within a week. The belt clip is useless for holding this phone, don't bother.I did not misplace the hinge cover, it dosent stay on. This should clip on securely. But, thanks for approving a replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANTHONY G PERRY",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:27:44.000Z",
          "Titre": "Great quality but I was thinking the…",
          "Contenu": "Great quality but I was thinking the BLUE case was more blue than black. Color on website should be changed from Blue to Navy. Picture of blue you have is VERY deceiving."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Douglas Logie",
          "Nb_Reviews": 3,
          "Date": "2022-12-11T17:23:22.000Z",
          "Titre": "Great items well-made, but too many are too small for North American people",
          "Contenu": "In general your items are well-made and great loss of marks with the last purchase because you’re Crossbody bag fanny pack, Belt is the typical human size of most items being made these days. And they’re incredibly smaller than what a normal North American person should be. This is not your problem but everybody’s problem except clothing manufacturer such as under armour"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tanner Jorud",
          "Nb_Reviews": 3,
          "Date": "2023-10-12T18:06:36.000Z",
          "Titre": "Good protection, ugly case (green color)",
          "Contenu": "The coloring of the back plastic isn’t great. I knew what I ordered so I didn’t return it. But it’s ugly a gradient from green to clear or just clear would have been better. The case itself is pretty legit though. From a protection standpoint it’s good. Only other complaint would be the cutout for the action button. It’s too deep and hard to get at. Better off just doing it like the other buttons."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Nolin",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T16:18:38.000Z",
          "Titre": "I like the case",
          "Contenu": "I like the case, but I didn't like the fact that I bought under a false pretense, being that your company made design changes to the case based on customer reviews, and didn't photogenicly change the changes on the web site. I believe that the glass for the top half should be a option in the package, and if customer doesn't want to use it, leave it in the box. The double glass protection is the only reason I purchased the case, I didn't get what I purchased, I was graciously offered a return, but I'll keep it"
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Nitchamon Nitthayakoson",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T09:17:11.000Z",
          "Titre": "Usable but not recommended",
          "Contenu": "Everything work well, the screen is touchable, sound quality is okay and it is waterproof. It is working as it is intended but the screen protector is wobbly the gab between my phone and screen protector give a weird feeling, there’s a gap that unable to squeeze close at the top, magsafe circle at the back is painted in a very ugly way and the sticker for mute switch is just a very bad design. Not worth my money at all.if you looking for a waterproof case that work perfectly fine this is for you but for someone who want a great experience and better quality material, I think you may have other better choice."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "DrPMG",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T20:11:46.000Z",
          "Titre": "Terrible shipping, web pictures & description need improvement!",
          "Contenu": "The phone cases themselves are fairly good. The web site depictions & colors do not truly reflect the items themselves so we are not sure we would have chosen the ones we did had we seen them live. Shipping was TERRIBLE!  Took over 2 weeks from New York to Toronto. That distance can be coved by bicycle faster!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Sparks",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T16:28:26.000Z",
          "Titre": "Happy with the charging cables and wall…",
          "Contenu": "Happy with the charging cables and wall plug, not so much the executive case. Only got it for a emergency backup because you don't sell my phone case anymore. Now I am forced to look elsewhere for a phone case. Also, lately I've wanted to order other products, like the phone banks;and all ither products; that are on sale only to see that they are sold out before the sale starts. I feel like the company is slipping badly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T05:26:30.000Z",
          "Titre": "Not great, but it works.",
          "Contenu": "I am a big fan of creators of cases for folding phones. However, this case for the Fold 4 (EXEC) is not great. It fits the phone alright, but the bezel around the outer screen makes the phone way harder to use. There also is no outer screen protector built in. I also find the three card capacity of the \"wallet\" attachment way too limiting. My last case cost me $20 and was more useable in every way. That being said, its durability left something to be desired after about a year of use it was a loss. Sadly the product is not sold anymore and ghostek advertised at just the right time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bernie Moltchan",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T14:51:48.000Z",
          "Titre": "Ghostek S22 case and Ghostek Bluetooth Ear buds",
          "Contenu": "The protective S22 was good quality, however the instructions for assembling the case left a lot to be desired.The Blutooth ear buds were another story. Pairing with my new Lg 4k TV (2023) was almost impossible. I'v given up trying to pair the two. The ear buds were not worth the money spent. They won't hold a charge long enough to pair, and when they do indicate they are paired with the TV, the sound is intermittant or not at all.Not worth the money, Don't buy them!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mrs Diane Slape",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T01:21:17.000Z",
          "Titre": "I loved this case until less than…",
          "Contenu": "I loved this case until less than 2months after purchase, the edges started yellowing and looking dark brown after my vacation, making it look really crappy. And a week ago my screen shield cracked, eventhough the edges are higher than the phone screen.  I want to buy the same one again, because I love it so much, but the same thing will happen in a few months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T15:43:05.000Z",
          "Titre": "Material and look is awesome",
          "Contenu": "Material and look is awesome. However I had to modify certain areas. Case around fingerprint recognition was too bulky, when you unfold the phone. Case covers selfie button on small backscreen. So I cut it off. Basically transformed it to the original Samsung case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah Lynch",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T18:29:48.000Z",
          "Titre": "Wallet really only for 2 cards",
          "Contenu": "Case itself is very good quality, wallet portion only holds 2 cards. 3 will make it not click closed. Unfortunately for me, as I have to carry 2 cards (I prefer to use my Discover & it's not accepted everywhere so I need a back up card too) plus my ID, I'm still on the hunt for a true 3 card wallet phone case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam Ishak",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:40:52.000Z",
          "Titre": "Good start but room for improvement!",
          "Contenu": "To be honest, I was a bit disappointed in the case but I am trying to get used to it. A few things that could be made better:1. The case only attaches near the hinge but the hinge is pretty tight so when I go to open the case, it often slips off the front of the phone - not to the point where it completely dislodges but enough to be annoying.2. The bezel is thick enough that it covers the navigation button at the bottom of the screen. I often have to try 3 or 4 times to swipe off an app.3. The card case is a little too thin to be helpful. Ideally, I could travel without a wallet if I could carry my license, swipe card and 1 CC but I can only fit 2 of the 3 so I need to carry a wallet anyway.4. It would also be helpful if the card case attached in either direction so you could kickstand the phone in more than one orientation, but the magnet only works in 1 specific place.5. The hinge cover is odd - it just sort of flops around and feels unfinished. Would be better if it were a little tighter and less bulky - maybe even use a vinyl cover that's contiguous with the front and back cover?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-22T16:06:59.000Z",
          "Titre": "Customer service was good and Cas came…",
          "Contenu": "Customer service was good and Cas came fast but the screen protector is plastic and shows wear rapidly. There are cheaper cases this same quality like the body glove waterproof which is almost exactly the same and cost half as much as ghostek nautical slim."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Newson",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T15:30:51.000Z",
          "Titre": "The case was nice but after removing…",
          "Contenu": "The case was nice but after removing the film from the back I noticed it was really foggy and not clear like it looked in the pic online. I tried to wipe with micro lens cloth but it was still foggy otherwise really well made case. I have purchased 3 in the past"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jarcy Darcy",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T02:03:48.000Z",
          "Titre": "I WAS a big fan of ghost tech",
          "Contenu": "I am a big fan of ghost tech. However I recently purchased purchase the exec six for the pixel fold. I reached out to customer care because the case absolutely does not work and the magnetic wallet holder turns off the main screen no matter what you do. The adhesive does not work for this specific case as well as the hinge protector is a floating hinge protector that does not actually connect to the phone and wobbles back and forth. These are huge issues for a phone like this, especially a phone that cost $1,800. The case is $60 and I emailed them so they can replace the case with a different case. Instead of replacing the case with something that works, they sent me the exact same non-functional case. I don't know if I can trust them again if this is not rectified. If they rectify the situation, I will be happy to change this review and update everyone on the outcome."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "Serhii",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T14:08:57.000Z",
          "Titre": "Beautiful, but some scratches were out of the box.",
          "Contenu": "I bought 2 clear COVERT cases, for iPhone 13 Pro Max and for Google Pixel 7 Pro. Both of them look nice, buttons are easily accessible. One of them (for Pixel) arrived with scratches out of the box (I have photos if needed). Also not very nice that because of the polished back side of the Pixel fingerprints are very recognizable on the back side of the case that is made with glass. For iPhone, everything was perfect, MagSafe worked pretty well, and fingerprints on the back side of the case are not recognizable because of the rear phone material mat. Also, it was without any scratches out of the box. Delivery to NL was quite expensive that is why I was upset because of the case issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JMB",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T18:47:36.000Z",
          "Titre": "Loved that the case has a built in…",
          "Contenu": "Loved that the case has a built in screen protector, and love the feel of the case. But the power button stays pressed due to the case, rendering the button useless and unable to lock/unlock phone with the button. Went back to my OtterBox"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Jones",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T21:44:16.000Z",
          "Titre": "May have to make some changes but other than that it is great",
          "Contenu": "It is a great case; but others could not hear me; so when I tore off the strips on the bottom of the inside of the case and the rubber pieces on the inside; now they can hear me and I can hear them. Other than that; this is a great case!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "SWal",
          "Nb_Reviews": 6,
          "Date": "2023-03-19T04:37:57.000Z",
          "Titre": "Nice case but wont suite",
          "Contenu": "Postage very quick.Disappointed in the case thought something different. Unlike other Ghostek cases I had this one doesnt come with screen cover. I should of looked closer but really wanted the oilslick effect."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Myosha Walker",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T19:10:45.000Z",
          "Titre": "My front of the z5  case keeps sliding off",
          "Contenu": "My first case piece keeps sliding off, need a case smooth to the touch similar to the z 4 ,please tell me it can fit both, my bday present to myself to get this z5 ! I can't let it break in any way!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chip",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T06:00:23.000Z",
          "Titre": "The case is very well-made, but useless for anything other than underwater use.",
          "Contenu": "The case is very well-made, but I feel like in the description it should have told you that you literally cannot hear anybody talking to you. It’s muffled , and every call that I have been speaking with others, absolutely nobody I spoke with could hear me clearly, very pleased with the case for being waterproof, I wish that description would have included that this case is merely for waterproof purposes, not functionality of your phone. The  I-charging station I purchased at the same time works great, so I would give it a five star rating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Quamane Davis",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T00:03:42.000Z",
          "Titre": "The case is a little flimsy and the…",
          "Contenu": "The case is a little flimsy and the fitment isn't as tight as I would like. The sticky edges were not a good idea. I was hoping that there would be some type of click on apparatus to make it easier to remove and put back on for maintenance purposes."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Rennan Izarchi",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T17:08:00.000Z",
          "Titre": "It protects well, but the fit isn't the greatest",
          "Contenu": "Shipping was impeccable... fast and provided tracking as expected. The price is great, and the case covers the phone as you want it to, but the fit is a tiny bit too loose.I find myself having to adjust the case around 4 times a day, and that to me is pretty annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tomas",
          "Nb_Reviews": 3,
          "Date": "2023-02-06T18:06:51.000Z",
          "Titre": "So close.",
          "Contenu": "Love the case and design overall, however, a couple of minor faults prevent me giving a better rating. The leather on the back looks and feels great, but it's not accurately cut or glued. A couple edges fraying up. It's just not square with the rest of the case. I would expect a bit better quality for the money. For how much it costs, it should be nearly perfect, and mine just isn't which is disappointing. I get the feeling that the small piece of leather will be the first part that fails and makes me question the long-term durability. One minor subjective gripe i have is how slippery the case is. Some micro knurling on the aluminum sides would go a long way to adding grip and still look and feel great."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michel Robichaud",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T19:56:03.000Z",
          "Titre": "Must of got shipped by a hitchhiker",
          "Contenu": "Shipped status on July 27, we are now August 10 with \" delivery in process\" status, still no sign of the case. So far not impress. Time will tell if it ever arrives or if it's gonna be a hassle to get the product or a refund."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William ross",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T00:15:32.000Z",
          "Titre": "The phone case was a Phone case was amazing.mazing but I also…",
          "Contenu": "The phone case was amazing but I also ordered. The universal phone clip set the note fit. My fold 5 case that I ordered from you guys. I wish I would announce that. What's the point of having it with it? If you can't even use it on it, it never says no. We're on your site that you cannot use it. That's only problem, my head. Other than that, great experience, thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CST",
          "Nb_Reviews": 2,
          "Date": "2023-01-25T06:29:27.000Z",
          "Titre": "I made a mistake - My fault!",
          "Contenu": "I made a mistake.  I thought the case would be more sturdy than it actually is.  It's quite flimsy when I was expecting metal encasement with rigidity.  I cannot use it so, it's down in the basement as I'm not going to use that.  As I stated at the beginning, I made a mistake but lesson learned."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sasha Korecky",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T06:54:05.000Z",
          "Titre": "Magnets need to be better secured",
          "Contenu": "The magnetic strips that hold the wallet case closed both became detached.  I had to super glue them back in to place.  Also the hinge protector feels a little to loose and cheapens the feel and look of the case."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Gregory Cohen",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T21:48:23.000Z",
          "Titre": "Case is good offers great protection…",
          "Contenu": "Case is good offers great protection but swiping up or getting the edges is impacted by the raised edges of the case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angelos Ghobrial",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T00:50:44.000Z",
          "Titre": "I like the case quality",
          "Contenu": "I like the case quality. But I don't like the service.  I ordered case and I paid for it then you told me that it is not available. So if it's not available why you guys show it to the customers online."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T04:09:31.000Z",
          "Titre": "If buying from Canada",
          "Contenu": "If you are ordering from Western Canada be aware, products will take awhile to be delivered. I was a little disappointed that it took 3 weeks to get here after paying 17.00$ for shipping. As for the case itself (nautical slim for the 23 ultra) it's definitely a quality constructed case. I work as a tradesman and I have no doubt this case will fully protect my phone from drops or dust etc. The size is what I expected, it doesn't really add too much extra bulk to an already large phone.the sound quality does suffer a little. The phone is completely sealed in the case and the sound ports are blocked off but it doesn't really bother me to much.Accessing the pen is also a bit tricky, if you trim your nails it's going to be a pain to pull the pen out.I'd give the case 4 stars but the wait time brings my review down a star for the overall purchasing experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bri",
          "Nb_Reviews": 2,
          "Date": "2023-01-22T17:57:52.000Z",
          "Titre": "The grip is great, the case is a huge flop.",
          "Contenu": "The grip is amazing, a bit unfortunate that I can only use it once and chose to do so on the case I ordered. The case is flimsy and poorly cut. It doesn't actually fit my phone which is disappointing. So I now have a defective case with a grip I cannot use. The color scheme is not what I thought so that is disappointing too. Overall I wouldn't reorder."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve F",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T16:22:27.000Z",
          "Titre": "Great looking case if you carry a micro cloth everyday",
          "Contenu": "Love the case, I don't like how the clear back peice shows finger prints and the lock screen button could be a little less effortless when pressing it (that could break in over time, and be easier to push)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jamie Dingman",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T18:04:53.000Z",
          "Titre": "I like the product and the protection…",
          "Contenu": "I like the product and the protection it gives my phone. I would give your support and product a 5 star! I do not like the shipping method you use to ship your products. It should not take 16 days for me to receive my phone cases! That's totally ridiculous! Change the shipping method or the shipper otherwise I will not order another product from you!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MG",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T22:56:05.000Z",
          "Titre": "After 4 months, scratches make it impossible to use in sunlight",
          "Contenu": "So, I've had my ghostek protector for 4 full months now, and it's been great at protecting the phone from drops. However, the screen is so incredibly scratched I cannot read the phone in bright sunlight at all. I need to shade it with my body, and that's not always possible. I put the phone in my pocket, and my pockets may have dust or crumbs from horse treats (which are basically made out of dry compressed hay), so while it's a constant presence, it's not particularly rough. I noted in my original review that the clarity of the fingerprint sensor circle is noticeably better (distractingly so) than the clarity of the surrounding screen protector.that continues to be the case. I wish that ghostek could include the same adhesive covering the entire screen to enhance clarity. Finally, the scratches are also protecting the photo lense protector, so my photo quality is not as good. I may be going back to traditional glass protectors and pelican cases, as the scratches plastic will not be workable in the summer sun. Hope they continue to work on improving the design."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "paul lawson",
          "Nb_Reviews": 2,
          "Date": "2023-07-19T20:28:08.000Z",
          "Titre": "I really didn't get to use case.",
          "Contenu": "I really didn't get to use case at all...I use fingerprint all the time with my phone .. Google 6... And it's not working with the case... I'm disappointed because I was looking forward to waterproof option of case..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenniel aka KJ",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T21:37:12.000Z",
          "Titre": "The case comes off too easy when…",
          "Contenu": "The case comes off too easy when opened, used the extra stickies but still same issue after a few days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caleb Carrillo-Miranda",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:13:43.000Z",
          "Titre": "It's a nice phone case but",
          "Contenu": "It's a nice phone case butThe back wallet card holder the sticker that covers the magnet came off and the bottom magnet ripped out. But the case itself is a great buy"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Justin Strocher",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T20:57:24.000Z",
          "Titre": "Great service not sure on the product yet",
          "Contenu": "Service was great shipping was fast. Seems to be a quality product but I'm not a huge fan of how the case actually feels in the hand. It is quite slippery. A rubberized coating on the plastic part of the case may have been a better option."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Su Timmerman",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T18:37:28.000Z",
          "Titre": "Wish I could have test drove it....",
          "Contenu": "This is one time where I really wish I could have test driven this case before purchasing.  I have a new S23+  and wanted stylish protection for it.  I've used Lanhiem in the last, and really like them but there was always an issue with the microphone cover.  After reading the reviews on the Ghostek Natical Slim, people were reviewing that while the case had microphone issues in the past, the issues seemed to be resolved on the new cases.  Sadly,  I can't say that's true.  When making calls,  people not only say they can't hear me well,  but that there is a lot of distortion.   No idea why.  My phone was brand new, out of the box.  Its also a bit more slippery than I like.  There's no grip to it.  It's a hard shell plastic all around, sleek and gorgeous, but SO slippery! Not sure what I'm going to do about this issue.  It wasn't a cheap purchase! 🫤"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn Holland",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T02:49:17.000Z",
          "Titre": "The kick stand on my case has a magnet…",
          "Contenu": "The kick stand on my case has a magnet issue not secured in place and stand would not stay in closed position, I added some guerilla glue to magnet....so far so good. Case is very good, would buy again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Denise T.",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T22:39:13.000Z",
          "Titre": "I expected something a bit different",
          "Contenu": "I was under the impression the case would have a front cover it did not. The plastic is somewhat ridged but I thought the case would have a tougher feel to it.  The aluminum color is cool. I did contemplate sending the case back. I also purchased the hand strap. Would I recommend it? Ummm, maybe not this case. NO"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chase",
          "Nb_Reviews": 2,
          "Date": "2023-07-09T16:07:19.000Z",
          "Titre": "It's ok, constantly have to remove the case",
          "Contenu": "Encases the entire phone which is good for protection. Sound isn't great with the case on. I have to remove the case anytime I want to charge my phone. Also have to remove the case anytime I'm in the car because it doesn't fit the car phone holder with the case on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia Lloyd",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T19:12:55.000Z",
          "Titre": "Unfortunately",
          "Contenu": "Unfortunately, I am not a big fan of the angle that my phone now sits at with stand that I purchased. It does seem to be good quality but I have to prop it up on other objects to get my phone at the angle I like to watch things on my phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T14:53:08.000Z",
          "Titre": "You REALLY need to work on the design",
          "Contenu": "There are a few things that could be improved. The case needs to fit snug against the phone & have the edge raised all the way around the screen on the phone. There's no raised edge around the screen when the phone is open. It's flush with the edges of the phone screen. You drop it, when open, & it's going to get screen damage. That's not good. The top piece needs to fit right against the cover screen. As it is, there is quite a gap between the cover screen & the case. That isn't good. You don't want dust & all sorts of other things getting in there & gunking up the screen & the case. I paid good money for this case, & it took forever to get it to Texas from Brooklyn. Y'all need to DUMP DHL as your shipper. Go with UPS or USPS. I've only had the case for 9 days, & I'm beginning to wish I had gotten the Otterbox Defender."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "chandler roberts",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T00:36:08.000Z",
          "Titre": "Belt clip stand",
          "Contenu": "Belt clip stand does not keep the phone up after a month of use. The clip doesnt even stay clicked in place to create the stand. For a $60 dollar case and to not have that feature is not worth it even the look of the case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Filiberto Garay",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T15:08:59.000Z",
          "Titre": "Decent",
          "Contenu": "Excited to receive my new case but was sent a case for the wrong phone, replacement will take a while to get here which i think i should have been compensated with expedited shipping."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "RAD Dad",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T17:50:11.000Z",
          "Titre": "Good case but expensive",
          "Contenu": "Product was nicely packaged, good video showing how to attach it to phone. Product itself is a little more bulky then expected but seems like it will be fairly protective. It slips out of your hand more then I thought it would. It does have some silicone grip but very little and no sling or ring to put your finger through like some of the competition. I find that very disappointing. The hinged protects the phone but is larger then I thought and gets in the way when opening the phone and setting it on the table such that it rocks or falls over when interacting with the phone. The case looks nice and I'm sure I will appreciate its protection however the cost was very high compared to other brands. I also bought the attachable ring so that I can hold on the phone better but it was difficult to attach the phone. I attached it to the front because I still wanted to use the magnetic charging but there was less space on the front of the phone to put it which makes holding a little more awkward but still better then without. If someone asked me if I would recommend the case I would tell them to try something cheaper first"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Krishan Pal Singh",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T05:39:54.000Z",
          "Titre": "Good protection with sharp edges.",
          "Contenu": "I have been using ghostek since last year, but when I bought it again for s23 ultra, the edges are quite sharp and the fingers don't glide over them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T20:21:20.000Z",
          "Titre": "Room for improvement",
          "Contenu": "Case is protective, but it messes up the functions of the side quick app function and pulling down to check my notifications. Fix that and I can easily rate as a 5"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Duane Aubin",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T19:23:36.000Z",
          "Titre": "Great case; middling customer service",
          "Contenu": "Edit: It's a terrific case, and will likely prove to be the best case I've ever used. Thus far, I am very happy with it.To be fair, yes, I input the incorrect address (well, the autocomplete did, and I didn't realize it until the order was submitted); however, I caught it immediately, and requested help fixing the error within a time frame that should have been doable. I'm firmly of the opinion they ought to have been able to do something for me at that point.At any rate, yes, the neighbour did hold on to the case, and I was able to pick it up from them (because it so happens that the incorrect address was nearby).The case itself, thus far, feels splendid. It seals the phone seamlessly into military-grade shock-dissipating material; it covers/protects the camera bar (not all Pixel 7 Pro cases do that), as well as the screen (no more fumbling to install those screen protectors requiring surgical dexterity and precision); and the lanyard provides an extra level of security against dropping the phone off a cliff, into a river/lake/ocean, down a sewer grate, etc...) And it does all this without adding excessive bulk. The phone still looks sleek and svelt, it does not look like a tank attachment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Pusca",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T14:31:50.000Z",
          "Titre": "i wish it was more grippy",
          "Contenu": "i wish it was more grippy, i thought the sides would be silicone/rubber feel but they are more of a plastic feel, the back gets oily/greasy quickly, for the price it's an \"okay\" case, can't comment on durability or yellowing yet, time will tell"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Guillaume Baroni",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T14:55:33.000Z",
          "Titre": "Strong but the back gets nasty really fast",
          "Contenu": "The case is sure, very strong and looks cool, but it is not very comfy. Surely, I could deal with that.However, the transparent back is, for me, a nightmare because it is full of fingerprints and I find it a bit cheap compared to the rest of the case :(.I really wanted to love it, but the back of the case is a big problem for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ejf",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T21:54:53.000Z",
          "Titre": "The product description isn’t accurate",
          "Contenu": "The product description isn’t accurate. It’s the same for the nautical and nautical slim case but the back is not clear on both. One is clear and one is transparent."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "JB Ravenel",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T20:35:26.000Z",
          "Titre": "Great overall",
          "Contenu": "Great overall - I think this case would be even better if just a little thinner"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Bigham",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T02:21:42.000Z",
          "Titre": "Nice build but screen protector…",
          "Contenu": "Nice build but screen protector scratches easy. And inside of screen protector isn't easily able to be cleaned from dirt and grim."
        },
        {
          "Note": 3,
          "Lieu": "CY",
          "Pseudo": "Natasa petrou",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:49:42.000Z",
          "Titre": "Front case doesn't work for me",
          "Contenu": "Front case doesn't work for me. I cleaned it, wipe it and nothing. I dont even have a film/glass on the screen and the fingerprint is not working even if I have the sensitive mode on. Oveall is a beautiful, full secure case. It just not working for me. I dont know why"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hector Pineda",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T22:18:13.000Z",
          "Titre": "Looks cheap",
          "Contenu": "I like  the back part of the case. However the front looks cheap.  Kind of 3d printed finished.  The screen protector holds bad fingerprints which make it look really bad. The good things It seals perfectly  and the touch feels almost like the phone glass screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevan Stamps",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T21:47:41.000Z",
          "Titre": "I really like the case!",
          "Contenu": "I really like the case!! It’s thin-exactly what I needed, but the screen protector wasn’t as sturdy as it should be. It’s has a crack in it already, small but it’s there. My case before was just too bulky, but the screen protection part held up."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Frank P",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T15:25:58.000Z",
          "Titre": "No front protection",
          "Contenu": "I did not like the fact that the phone case did not have a front protector for the phone screen. Just like the back of the phone. I'm not too sure if it was missing or if that's how it comes. Now, I have to buy a screen protector for the front screen."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Troy Ledet",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T20:45:43.000Z",
          "Titre": "You get what u pay for",
          "Contenu": "Phone overheats in case when on wireless charging"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alma Cox",
          "Nb_Reviews": 3,
          "Date": "2023-02-01T00:27:22.000Z",
          "Titre": "I have purchased 3 mini phone covers…",
          "Contenu": "I have purchased 3 mini phone covers from you in recent years.  My first two were great!This last order in pink had a back piece so rigid that I could not remove not even one card.  I asked for a return authorization but instead I was sent a black piece that is much more flexible and I can remove my two cards easily.I now have a phone that works but it is two toned.  I’ll keep it but don’t have a good feeling on how this was handled.  I my opinion the first back piece in pink was not made correctly and this is your way of addressing the problem without actually admitting that the first back piece was wrong.If you’d have let me return the pink I would have bought a whole new black cover and felt better about the whole  process.Your covers are convenient so I’ll probably stick with you.  Thanks for listening.I would like to add that my husband who doesn’t have any medical issues could not remove a card from the new pink back cover; we feel it is not made correctly.  I’m able to use the new black back cover myself.  They need to review their new product fir flexibility."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Faith Lam",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T23:10:34.000Z",
          "Titre": "Screen protector separated",
          "Contenu": "Had my case for a few months. Within the first month the screen protector has already separated from the top of the case. Otherwise seems like a good case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Romario Smith",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T15:43:47.000Z",
          "Titre": "Very solid case and will protect your…",
          "Contenu": "Very solid case and will protect your phone no doubt. The issue is every use. It really makes the phone blocky with how thick it is which might be a good trade for some people. For me it's 50/50. It can feel like a brick most days carrying phone around. The good part about the design that I like is the clear backing so that I can show off my custom skins 😎. The biggest flaw with this case has to be the fingerprint reader cutout. It takes a lot of time unlock my phone using my finger print. This the main reason for my 3 stars. If that flaw can be fixed I think the extra weight and blocky feel of the phone won't be so bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T17:06:31.000Z",
          "Titre": "Not dust proof!",
          "Contenu": "I work in a bakery where flour is flying around in the air, I bought Themis case because it said it was water and dust proof, I still have to take it apart every night when I get home and blow all the flour out of my phone and case."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jean Backus",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T00:36:40.000Z",
          "Titre": "The product didn't look anything like…",
          "Contenu": "The product didn't look anything like what was advertised on the website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Johnny Zimmerman",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T02:19:16.000Z",
          "Titre": "The carrying case is slippery hard to hang on to.",
          "Contenu": "The waterproof carrying case that I bought was supposed to be easy to hang on to but it is so slippery it is hard to hold on to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "June Garcia",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T16:19:51.000Z",
          "Titre": "An alternative case that does its job",
          "Contenu": "I was looking for something different that had the waterproof features and the MagSafe compatibility. The otter boxes are far expensive and bulky. I used to use the lifeproof cases but they started to lose it quality over time. I saw this case on Amazon wanted to to try it out. I mean, you spent over $1,400 for a device you need to protect it. The only complaint I have is there’s no was to hear the person you’re speaking to through the case unless you put the call on speaker and remove the charging port cover. The iPhones have stereo sound and the case blocks the ear piece speaker so you can’t hear music or regular phone conversations clear, they sound muffled. The other complaint is the rear camera. When you zoom out to 0.5, the case shows a “fish eye lens” to the picture unwanted. I think the case lifts up from the phone and doesn’t stay in place. Other than that, it’s a better alternative to the other waterproof cases in the market."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MA Shopper",
          "Nb_Reviews": 4,
          "Date": "2023-02-24T15:40:00.000Z",
          "Titre": "Really nice cases but...",
          "Contenu": "Really nice cases but...However they do not hold up long term. I had bought one for my Note 20 Ultra, and 2 years later the plastic is all foggy, yellowed, and looks terrible. For what they charge for these, they should hold up longer than a couple years. I purchased 2 different ones for my S23 Ultra and have concerns about their longevity. I've had cases that cost a fraction of what these do that are still looking great on my Note 20 Ultra. I am extremely meticulous how I take care of my phone and cases. RESPONSE TO GHOSTEK, As I said, I have off brand cases that cost a fraction of what the Ghostek cost for my Note 20 Ultra and they still look great 2 years later. It's not me, or how I take care of the cases, its the cases. If all my cases looked bad I'd agree it could be how I'm taking care of them, but it's not me. I'm not really surprised Ghostek implied its how I used and took care of the cases for my Note 20 Ultra. Sad that companies jump to blame the customer."
        },
        {
          "Note": 3,
          "Lieu": "VI",
          "Pseudo": "Marlon Brin",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T15:05:49.000Z",
          "Titre": "The color scheme of the case I found to…",
          "Contenu": "The color scheme of the case I found to be dull, I was not excited about the pink case it seems so subdued. I had higher expectations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tiana Almendares",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T05:00:31.000Z",
          "Titre": "The case is great but the hing…",
          "Contenu": "The case is great but the hing attachment that covers the hing could be better constructed I have to keep pushing it in and that I don’t like"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2022-12-21T20:15:49.000Z",
          "Titre": "The screen protector is really bulky…",
          "Contenu": "The screen protector is really bulky and makes it very difficult to use the finger scanner. It is also uncomfortable to talk on the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cw",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T20:16:04.000Z",
          "Titre": "piece broke off within a week",
          "Contenu": "the charging port cover’s pull-tab ripped off within a week. opening the charge port cover without the little pull-tab is difficult. everything else about the case is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "chad hershey",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T19:51:40.000Z",
          "Titre": "Slippery",
          "Contenu": "The case does seem to be very protective but I don’t like how slippery the back of the case is. I wish there was a texture that would make it easier to hold."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Claudine Gerardo",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T09:42:16.000Z",
          "Titre": "I like that the case is protective",
          "Contenu": "I like that the case is protective, but was disappointed it didn't have a front screen protector like other cases for this phone do."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Aeron",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T10:55:20.000Z",
          "Titre": "Bit cheap plastic feel to it",
          "Contenu": "Bit cheap plastic feel to it, would love it to be nice silicone. The screen protector and lens protector are great."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T09:29:54.000Z",
          "Titre": "Front screen edge was difficult to touch.",
          "Contenu": "I love the design of magnetic case but at the edge of outside screen is too hard to press the screen or swipe."
        },
        {
          "Note": 3,
          "Lieu": "DO",
          "Pseudo": "Zemhyr Tanks",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T19:23:36.000Z",
          "Titre": "Case off size",
          "Contenu": "Company is probably great but the case for the fold 4 is off size on the front screen, waste of money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T22:49:55.000Z",
          "Titre": "The delivery time was good.",
          "Contenu": "The delivery time was good.My problem is with case.The volume button is very hard to operate. Have to push hard in just the right spot to get the volume control to work. Other than that the case good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rueben S Jones",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T14:27:05.000Z",
          "Titre": "It could be Different!",
          "Contenu": "I really enjoy the metal and rubber that they use on the case, however my reason for it being a 3 star is the person preference for a more boxier feel in hand and the case being less bulky would be nice in hand for me personally, I hope that one day you all decide to try a design in that manner with those colors and special designs especially for a Google pixel device... Message me personally I want to be the first to try it out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kris s.",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T03:15:13.000Z",
          "Titre": "Questionable fit and color",
          "Contenu": "Got the red case. Wish it was a little darker. Comes off as pink in the right light. Also it doesn't seem to fit my phone perfectly. You can see certain parts of my phone where it's not flush. Quality and feel are good though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Coyle",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:25:38.000Z",
          "Titre": "100% honesty......I am more than happy…",
          "Contenu": "100% honesty......I am more than happy with the phone case hands down. It's sleek and provide plenty protection with out the bulkyness......but the clip needs to be redesigned I'm active and my work is active...I am up and down and in and out of equipment the slightest bump or jump and the phone falls right out of the clip.....aggravating worries me that it will catch the right edge of steel or have that just right moment.       If you guys and gals come up with a better clip or fix it would be bullet proof look forward to some feedback"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ozan Yuceer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:37:40.000Z",
          "Titre": "Almost perfect",
          "Contenu": "Great looking case and build quality is definitely there. Nice chunky feel. But 2 little things couldve been better. 1st, case is thick on the sides and makes it hard to reach to sides on the screen. 2nd, volume and power buttons are not covered thats fine but because case is thick it makes reaching them hard as well. 4 stars from me. Fit finish great. Feels expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patrick Bissonnette",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T03:21:52.000Z",
          "Titre": "The case for the outdoors!!",
          "Contenu": "The advertising for the case and Ghostek in general is very well made. It really hypes the product to a point that it's hard to be fully satisfied. The sound quality, if you need to make a call using the phone is as you would expect with a waterproof case, there no miracle with this case, it sound about the same as it did with other brands. In term of using the case, it is more something that I would use once in an while and not full time. That is solely based on how difficult it is to open the charge port as well as the sound quality when playing a video or talking on the phone. I feel it will be useful whenever I am going kayak fishing or hiking. The case, while it looks super sharp when clean, is a fingerprint magnet. The back and the front of the case get dirty and are fairly difficult to clean compared to other screen protectors. Would I buy it again, I would when it comes on sale, I don't think I would pay full price but I do intent to get another one when I replace my phone. I also feel like the regular, non-waterproof case will probably something I get too. I would love for Ghostek to push toward wireless chargers(Car), mounting options, etc.; adapted to their case like some other companies are doing. It would also be great if they made it to fit with a screen protector, given the case will not be on the phone every day, a solution to that issue would be great. It fits, but the usage is so so. 4 Stars overall, because it's very solid, very nice looking and well advertised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ishvara",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:57:17.000Z",
          "Titre": "Good Cases",
          "Contenu": "The atomic clear case for the iPhone is good, I just wish the corners had the aluminum on them as well for extra protection. The water proof case is also great! It seems to be work perfectly and is actually 100% waterproof. I did the product test and then did it again with my iPhone inside and no moisture or water got inside the case. I haven’t been able to figure out how to attach the string loop you put on the waterproof case for easier carrying though"
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "Chris Kyriacou",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T13:46:27.000Z",
          "Titre": "Good customer support",
          "Contenu": "Edit: Thanks to customer support for resolving my issue and being fair on the refund! This is now sorted and I understand that the issue was a combination of misunderstanding and bad luck. All ended well.Original review for context:I placed my order on the 12th of November.The order was shipped promptly and I was provided a DHL tracking number.Soon after, the DHL tracking wasn’t updating anymore so on the 24th I sent an email to Ghostek asking if they knew what was happening with my package. But they never answer back.On the 30th of November I sent a kind reminder.. but no answer.On the 7th of December I sent another reminder.. but again no answer.On the 8th of December, I go package hunting at 2 of my local post offices and I was able to find the package which changed delivery method mid-journey and was handled by the local post office service now.Anyway, at this point I am happy because even after 1 month I got my package but instead of an iphone 15 case I was sent some kind of a foldable case.So now I ve sent my 5th email requesting a full return and refund + the additional costs of local VAT and import taxes I incurred with little faith that I will ever receive an answer.Ghostek seems to be living up to its name, ghosting customers.I just hope someone from the company sees this and gets in touch. I have no interest in your products anymore and I just want my money back."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jason Moore",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:29:20.000Z",
          "Titre": "The phone case is everything it is…",
          "Contenu": "The phone case is everything it is advertised as. The case is a little big and the plug cover for the charger hole is hard to open which is probably needed to be as it is advertised to be water proof up to 20meters for an hour. Not willing to test that theory on a brand new $1800 phone. Easy to install over phone and the ghostek logo is boss! Would be 5 stars except the delivery service took over 2 weeks to deliver."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Chris",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T22:34:54.000Z",
          "Titre": "Great experience",
          "Contenu": "Phone cover fits perfectly.Shipping was also very efficient.Highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristin D",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:56:08.000Z",
          "Titre": "The protective screen cover scratches…",
          "Contenu": "The protective screen cover scratches too easily. I think I just rubbed it with the cloth that was provided and it scratched. I think that is my only critique. It fits well."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Derrick Carroll",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:16:33.000Z",
          "Titre": "Everything is good just the case has…",
          "Contenu": "Everything is good just the case has the smallest flaw in that the power button will engage at first for about an 8hr period on and of and over n over I ended up somewhat Id call stretching it to where it didn't engage anymore"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHIRLEY ATNIP",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T14:40:26.000Z",
          "Titre": "Samsung fold 4",
          "Contenu": "my phone sometimes has trouble closing all the way with this case on. its a good protector i wish there were more options with color & design in my phones particular model. It seems like everything has a ton of apple iphone selections but not enough Samsung selections."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sydney",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T20:18:15.000Z",
          "Titre": "Minor changes",
          "Contenu": "Love the overall case, very well made. Just wished that there was something on the case so I could put an accessory like a lanyard on it. Had to use a dremel in order to put holes in it so I can attach my lanyard on it as i know i wouldnt drop it as often as I would without it, but other than that loving the case!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 4,
          "Date": "2023-10-16T16:46:26.000Z",
          "Titre": "Excellent customer service response",
          "Contenu": "I had ordered two items, but when I received my package, there was only one delivered. (So, I can't give the full five starts) But when I contacted customer service, they responded quickly, and I received my second item within a week. I was very grateful and impressed. I appreciate the excellent customer service, and I love the products. They should have a 4 1/2 stars."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "R Johnson",
          "Nb_Reviews": 6,
          "Date": "2023-09-22T11:41:40.000Z",
          "Titre": "Great customer service, company, phone cases & accessories!",
          "Contenu": "Great customer service! Excellent quality products! Quick shipment of my order. My advice is to get customer input about designs before putting out cases. I bought the atomic slim 4 case for my Samsung galaxy z fold 5 and found 2 over looked issues that other high end companies have addressed. First, the back hinge protector is big and the space it has should have been utilized for storage and protection of the s pen. That would have been a great way to give more purpose to each part of the phone case and the z fold's well known accessory. Secondly the space for the finger print button access on the side is too narrow and greatly hinders using that function for quick access into a locked phone. Improvements are needed regarding both points. Otherwise the case is truly well designed and of fantastic quality!! 8 out of 10 rating. Great company with innovative designs!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chad Kuroski",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:21:01.000Z",
          "Titre": "I love my pixel 7 case",
          "Contenu": "I love my pixel 7 case. I purchased 2 of them one for myself and 1 for my wife..only complaint was shipping took 7 days....I am in carpentry and construction so I'm anxious to see how durable the case will be over time...overall 9.5 out of 10 on look and quality !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben P",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T02:15:02.000Z",
          "Titre": "Better side grips on case",
          "Contenu": "I think the sides of the case would benefit from a much \"gripper\" if that word applies, lol when holding the case with phone. The grips are too small to make any difference when holding. A much more tactile feel and stickier grip really helps I think when holding the phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T14:23:42.000Z",
          "Titre": "CooL",
          "Contenu": "The case is amazing. The color was bit brighter than I expected which was awesome. Brighter would be better. Only downfall was the back so shiny/ slick it showed every smudge & fingerprint 😥 I ended up painting it to avoid the smudged mess"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joan H",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T03:29:24.000Z",
          "Titre": "Metal case too rigid!",
          "Contenu": "I thought the product looked great but I was hoping to get one of the limited edition cases but they were all sold out with no mention if they would ever be re-stocked. Secondly, I didn't think about the case being aluminum but now that I have it I don't like the hard feel of it in my hand. I'll be getting a different case before winter sets in that will have a softer grip."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Parker",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T22:56:44.000Z",
          "Titre": "I purchased a nautical swim case",
          "Contenu": "I purchased a nautical swim case.  Knowing it's a waterproof case. As the case was the speakers were muffled and microphone clarity was non existent.  I removed all the plastic covers. Knowing it voids the warranty. Makes a huge difference. The phone is already water proof.  The finger print stickers are ugly. The phone recognizes the finger print without it.  Overall it's a good case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T00:59:58.000Z",
          "Titre": "Covers parts of fold 4 front screen",
          "Contenu": "This is my second ghostek case, I loved my first one for my s21 ultra and my wife is happy with hers for her pixel 7 pro. However I have a few issues with my new case for my fold 4. For the most part the case is solid and does as intended but the glue strip that holds the case to the phone didn't hold well and shifts around and covers part of the front screen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "josh surkosky",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T02:27:36.000Z",
          "Titre": "Great case so far",
          "Contenu": "Great case so far! Phone case construction feels sturdy and functions well. The extruded buttons are a nice functional feature, almost too easy to press accidentally. If possible the buttons could be more low profile. The back of the phone case would be much better if it was a “one-piece” solid plastic design using the same material as the surround rather than the gloss black insert that is prone to scratches (it’s just an unnecessary extra seam that can fail). The MagSafe insignia on the back is ugly, find a way to integrate the MagSafe technology with the Ghostek symbol or hide it completely (make the symbol gloss black against the black satin/matte case). It would make a much more sleek design. The Lifeproof Fre charging port cover/seal is a better design; easier to use and better looking. I hope this case can handle water just as well. I am so glad this case uses a harder plastic rather than the rubbery surround from the lifeproof fre because it wears quickly and loses its adhesion which causes it to basically fall apart. My favorite part about this case is the price point. It is so much more appropriate than other brands. I will buy three of these cases before I buy one rip-off lifeproof or otter box case!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy Whitehead",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T17:34:24.000Z",
          "Titre": "Got the case for my galaxy s22 ultra…",
          "Contenu": "Got the case for my galaxy s22 ultra after some crazy shipping to get here. Love the case. Wish the fingerprint sticker was an option as I don't use mine. The main drawback to the case is in my line of work the plastic screen cover scratches way too much and easy. But it does keep the actual phone screen itself safe from metal chips."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Lovett",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T01:54:53.000Z",
          "Titre": "I do not like the design for the new iPhone Pro Max Case",
          "Contenu": "I do not like the design for the new iPhone pro max cases. The action button is covered in plastic when it should be a button like all the rest. It’s hard to fit my fat fingers inside there. Other than that, I love the capabilities the case offers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darlene Perrine",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T19:11:10.000Z",
          "Titre": "The case is made well",
          "Contenu": "The case is made well. The card holder that attaches to the back is sturdy & stays on. I am very disappointed the case is not magnetic. I bought Ghostek because the last case I had was Ghostek & worked beautifully on my car magnet. This one is not magnetic so I ordered a different case from Casebus that’s magnetic with the card holder. I would’ve really liked an option that was magnetic with a card holder for the iPhone I have, otherwise it is a good product."
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Ahmad Jantan",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T06:41:51.000Z",
          "Titre": "Good....",
          "Contenu": "Good..... Perfection and robust....But I notice that it's not mend for universal wireless contact power bank"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald W Brooks Jr",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T00:43:14.000Z",
          "Titre": "The Case is nice but the part that…",
          "Contenu": "The Case is nice but the part that covers the hinge on the Z Fold 4 is flimsy plastic that popped off and broke off of one drop. Plus the fingerprint sensor is blocked by Case. I feel like I need a $50-$100 gift card if I paid $225 for this case and it broke on one drop. Now my hinge is not protected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alyssa R.",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T15:57:35.000Z",
          "Titre": "Good Stuff",
          "Contenu": "Experience was great. The only issue I have with the case is that it covers a little too much of the front screen and I am unable to swipe out my side menu. Other than that, it works great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 3,
          "Date": "2022-12-16T07:29:01.000Z",
          "Titre": "ghostek vs Otterbox",
          "Contenu": "Bought the Nautical slim because I wanted a waterproof case. Had a waterproof Otterbox Defender on my old Pixel XL and tried to get another but they don't make the same type for the new Pixel 7. There is not enough protection on the Ghostek cover for the back of the phone, no rubber or hard plastic just a thin clear plastic insert like the screen protector on the front. I am hoping it is more rugged than it looks. Price was good compared to other covers available just don't know how durable and waterproof it will eventually end up being."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T04:38:27.000Z",
          "Titre": "Case is great, caution screen fingerprint reader",
          "Contenu": "Case is great, however fingerprint scanner sticker (pixel 6 pro)/any on screen fingerprint reader device totally kills the screen experience if you get it dirty.Ghostek do you have a recommended method to clean? They do provide a set of little stickers to place on it to protect it, but next to impossible to prevent a tiny specs of dust getting on it over time. Aside from that an absolutely fantastic case and do recommend!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 5,
          "Date": "2023-03-02T03:59:03.000Z",
          "Titre": "3rd nautical case",
          "Contenu": "I got the nautical slim for the s23 ultra.+ lighter and less bulky than the other nautical (I had that one on a s9+ and iPhone xr)+ opens easy, shuts tight + great fall protection - After removing the case once and then putting it back on the phone the fingerprint scanner doesn't work properly. Some kind of airbubble keeps forming with prevents the scanner from working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AnonymouseJam",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T13:53:21.000Z",
          "Titre": "Beautiful Design",
          "Contenu": "The actual design of the case is beautiful and I can see it being very protective. I haven't dropped my phone crazy yet, but I have been known to accidently fling it across the room. I can tell this case will be fitting of my needs and keep my phone safe from me 🤣🤣 the only reason I gave 4 stars is cause the case was borderline late to show up. I know it's not the necessarily company's fault, but they do give delivery estimates before you purchase."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Alison  R",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T12:54:15.000Z",
          "Titre": "Long wait,  great case",
          "Contenu": "Original review stated item hadn't arrived. Postage was longer than the stated timeframe, nearly a month. Case itself is fantastic.  Very protective,  strong.  Easy to hold,  buttons are easy to find and use,  though I don't really like the look of them,  they are very functional.  Definitely feel my phone is safe.  Use of phone is not impared, no issue with sound quality, login, charging etc."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Cresswell",
          "Nb_Reviews": 2,
          "Date": "2023-04-29T10:17:43.000Z",
          "Titre": "Iphone 14 pro excellent but some MagSafe accessories don't fit",
          "Contenu": "I purchased via UK Mobile Fun the Ghostek Iphone 14 Pro case. It's only available in one finish but it's very good. The MagSafe magnet is very strong and my only grip is that the Apple MagSafe wallet will not stay on as  the bottom  camera surround blocks it.The same issue with the official apple MagSafe battery does not fit due to that lip but it does turn sideways to just fit but not securely.I was impressed with the item that I purchased the Ghostek Atomic for my other phone the Google Pixel 7 pro."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Schwinkendorf",
          "Nb_Reviews": 2,
          "Date": "2023-02-13T19:26:49.000Z",
          "Titre": "Spine piece broke in my pocket",
          "Contenu": "Spine piece broke in my pocket. When I directly emailed info@ghostek I got an automated reply followed by a claims rep. After verification of damage I am being sent a replacement. Very good customer service in my experience. Thanks Ghostek"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isaiah K Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T00:52:55.000Z",
          "Titre": "Durable and Waterproo",
          "Contenu": "I work in a field where I get wet a lot and this case is perfect for not worrying about damaging my phone if it unexpectedly gets wet. Only slight complaint is it makes the fingerprint sensor almost unusable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fireupa",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T05:11:07.000Z",
          "Titre": "The Ghostek Galaxy z fold 4 Exc is…",
          "Contenu": "The Ghostek Galaxy z fold 4 Exc is solid and well made. Installation was easy and fast. The only reason why I don't give it a 5 star is because there's no car mount or anyway to mount your phone in your car. Hopefully they come out with an attachment soon."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr John Broadley",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T13:05:02.000Z",
          "Titre": "Just took a little bit to long for delivery",
          "Contenu": "Just took a little bit to long"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler Posey",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:32:22.000Z",
          "Titre": "Overall, pretty decent case",
          "Contenu": "The construction of this case is solid. Fairly good fit to the phone. Not too bulky. Only complaint I have is the front part of the case isn't perfectly centered, the left side goes over the screen edge by about an 1/8 of an inch. Otherwise, I'm fairly happy with this case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Blanchard",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T13:28:49.000Z",
          "Titre": "I was looking for a military grade…",
          "Contenu": "I was looking for a military grade phone case for my pixel 7 pro andGhostek had everything I was looking for. Delivery was reasonable considering all the logistics issues of today's market. They are a US based company out of Brooklyn, NY. I would definitely recommend this company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NC",
          "Nb_Reviews": 5,
          "Date": "2023-05-30T17:53:34.000Z",
          "Titre": "I love the aluminum cases",
          "Contenu": "I love the aluminum cases.  They always ship fast.  Though I ended up with the wrong case somehow and customer service never responded (that I saw).  I ended up reordering the right case.  The price point is cheap enough that it doesn't irritate me too bad.  Though the price has risen sharply in the last few years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darlene Pino",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T15:42:38.000Z",
          "Titre": "Great but can't hear",
          "Contenu": "No one could hear me talk and I had difficulty hearing them.    But I bought it solely  for the screen protection and phone protection, so I just removed the waterproof film over the microphone and speakers and it works great now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric V.",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T23:05:50.000Z",
          "Titre": "I love the look and colors",
          "Contenu": "I love the look and colors. The only complaint would be the bottom at the charging port should have a rubber stopper or some kind of dust protector by the USB port. The side grips are a hard rubber and pretty slick. If they were maybe an interchangeable softer rubber they might be better suited for grip. My plan is to cut up a couple straps of the hogue pistol grip wrap and replace the side rubber. Outside of thoes features. I love it. The otterbox defender i am used to are good but they are boring as all hell."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "LYNDA KIMOLA",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T16:13:36.000Z",
          "Titre": "I really like this case",
          "Contenu": "I really like this case, especially cause I can attach a line to it. Being a boater, it is not only important to have it waterproof, but I need to have it secure so I do not loose it into the water. The one problem, which is to be expected is that I have to be careful to speak right into the microphone. It is as easy to order and was delivered when expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan A Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T23:22:02.000Z",
          "Titre": "Great Beautiful Case, kickstand needs work",
          "Contenu": "I liked the case, clean, slim, and modern.I did not look like the accessory phone strap I purchased as the kickstand is broken.The cases are built well, the accessory is not; would like a reimbursement as possible.Possibly would be better to use a light alloy rather than plastic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T16:56:57.000Z",
          "Titre": "Case is great and arrived quickly",
          "Contenu": "Case is great and came very quick.  Only thing i wish theyd change is the \"thumbprint\" sticker on the inside of the screen protector it should be optional not come already installed cause it doesnt come off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharen Adams",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T14:14:30.000Z",
          "Titre": "I love my new case",
          "Contenu": "I love my new case! My only problem with it is that I have to close the hinge part, it doesn't close automatically when the cover is closed! I would definitely buy from you again as the cases are made and perform well!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T18:10:43.000Z",
          "Titre": "Decent case, but poor wallet idea",
          "Contenu": "Ghostek was offering the only wallet case for the new S23 at the time of my order.  Shipping was prompt. Product without the magnetized wallet part is super nice and easy to hold. Magnet on wallet part isn't strong enough to keep it together in your pocket."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 6,
          "Date": "2023-04-23T14:02:21.000Z",
          "Titre": "Case is very sturdy and offers great…",
          "Contenu": "Case is very sturdy and offers great protection. The grip is not very good though and the case does make the phone very heavy. The MagSafe is a strong connection to the MagSafe car phone holder but the weight of the phone with the case on is the biggest negative. Also slightly overpriced compared to the likes of Mous and Otterbox. Presentation box is good quality to be fair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kurt Andrews",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:54:34.000Z",
          "Titre": "Simplest case I've ever used.",
          "Contenu": "Extremely easy to put it on the phone, but it was pricey for the aramid limit edition. Wonder what aom CF would be like. Fits great, and protects everything."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Lyons",
          "Nb_Reviews": 3,
          "Date": "2023-02-28T17:23:13.000Z",
          "Titre": "A durable wallet phone case",
          "Contenu": "There is no doubt Ghostek makes durable phone cases.  My last case for an S21+ was an all time fav.  My most recent case for the S23 ultra provides excellent protection but ov erall is a bit heavy.  I purchased the wallet version with the wallet attaching magnetically...it holds to the main case with  just the right force to keep it firmly in place. Furthermore, when I need to remove it for, say, charging on my charging pad, it removes without excessive force...an amazing balance between the two design conditions for the wallet.  However, I am a bit disappointed in the physical design of the wallet in that it has a magnetic cover over the 3 cards it holds. If the cards are a bit misaligned the cover will not close forcing a pause to move them around into position so it can engage the magetic closure mechanism.  The cover can be used to put the phone in stand mode which is a great feature.  Overall, a thoughtfully designed case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-26T20:23:25.000Z",
          "Titre": "More good than bad and worth it",
          "Contenu": "I really like the look and feel of the case as well as the strong magsafe magnet. Plus the wallet is great as well. You sure weren't lying about the \"fits up to 3 cards\". 3 fit perfectly but it you try to also put a dollar bill or anything else in there it won't close. Fitment was/is an issue. The phone doesn't sit as firmly in the case as it's designed to. The shock absorbing inner rubber things push it out slightly causing the case to partially cover the lower speaker and mic. Not enough to effect calls but still noticable. It also means that if I push on the camera bar a little it pops the phone out. Overall I really like it and haven't had any troubles yet"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Christopher Gore",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T14:02:32.000Z",
          "Titre": "Best case I've had yet",
          "Contenu": "It's durable, looks great and protects in all the right areas. It sits a bit higher above the screen sides than my other cases so I'm happy about that. Doesn't add too much girth to the phone but it's definitely heavy. Try not to drop it on your face in bed!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason R.",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T02:00:40.000Z",
          "Titre": "Case good, universal holder bad",
          "Contenu": "Love the nautical slim case for my pixel.  I also got the universal belt clip holder/stand.  Not thrilled about the stand though, the clamps cover my volume buttons so it automatically turns my volume down to vibrate.  gave it to my wife and fits her galaxy s22 well.  wish the universal holder fit my pixel.  would be 5 stars if it did"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Micaela Nunez",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T22:59:58.000Z",
          "Titre": "Cute case and light compared to my…",
          "Contenu": "Cute case and light compared to my otter box symmetry or whatever lol but just wished the edges would be raised a little more just a tab to protect it a little more other than that it's been good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence Erbin",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T15:00:10.000Z",
          "Titre": "The case is great except for the hinge",
          "Contenu": "The case is great except for the hinge.  The hinge should be crafted so it closes automatically rather than closing it manually."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abel Aungst",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T14:08:13.000Z",
          "Titre": "Silly string.…otherwise great",
          "Contenu": "Price and timelyness of delivery where great case works great. The only draw back is that the cord or hand string/ security strap. Connects at the center top of the case. Making it wvey inconvenient. I would prefer it be on the bottom corner. Otherwise, if you dont use it, the case is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SteveS",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T17:15:44.000Z",
          "Titre": "Return",
          "Contenu": "A bit disappointed Ghostek did not have a case that fit my S8 active. Liked the looks etc of what I did get. The return though was quick and efficient . Ill chock it up to better luck next time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Francisco",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T16:37:10.000Z",
          "Titre": "Okay",
          "Contenu": "Black seems to scratch off the case pretty easy. Case is overall good and protects the phone, but did take recalibrating the fingerprint 3 times. Love the idea of the easy to remove strap for Qi charging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenn",
          "Nb_Reviews": 6,
          "Date": "2023-09-10T20:13:00.000Z",
          "Titre": "Good deal",
          "Contenu": "Seems like a very well made case at an affordable price. I'm digging it and this will probably be the place I purchase future phone cases"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Adele",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T01:03:33.000Z",
          "Titre": "The product is great",
          "Contenu": "The product is great, it was exactly what I wanted. My only feedback is that I was hoping the case itself would also be magnetic as well or instead of the wallet because as I had expected, while using the wallet case on my magnetic car mount it had been occasionally falling off. I think this is due to the case being a little chunkier (especially with the wallet) and it having to magnetize through the outer plastic material. So I will likely have to purchase an additional stronger magnetic car mount to hold it."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T02:39:12.000Z",
          "Titre": "Ghostek",
          "Contenu": "The case is solid but the delivery time was a lot longer than I expected"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rene",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T01:57:56.000Z",
          "Titre": "The case is great, but wallet no.. .",
          "Contenu": "The case is great! However the wallet just opens all the time. Even if I put one card. I can only put two cards in otherwise it doesn't close at all. Too bad as I like the design, but not happy about the wallet thing. Especially as this isn't cheap. The material quality is really good. Any idea of how I can make this wallet work?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-02-23T21:47:13.000Z",
          "Titre": "Satisfied",
          "Contenu": "I'm very surprised that a case that is supposed to be sealed completely is able to get dirt behind the screen protector. I work in the dust and mud so I have to make sure my phone is protected. But it seems solid otherwise. I wish the back was see through but I'm overall happy with the case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 2,
          "Date": "2023-02-26T19:20:42.000Z",
          "Titre": "I've purchased several Ghostek…",
          "Contenu": "I've purchased several Ghostek waterproof, shockproof phone cases for my galaxy phone in the past. Numerous drops, wet weather you name it my Galaxy S8, which I just retired after 8 years of use on farms, hiking & fairly rugged use, still looks brand new. My new phone S23+ arrived so I got a waterproof/shockproof case for it. Turned out the front screen of the case had a defect. Ghostek was AWESOME at getting this resolved and I got new replacement case in just a few days, but in the meantime, my new phone slid off the sofa onto the floor... about a 1.5 foot drop. I didn't think anything of it based on my previous experience with these cases but when the new case arrived and I transferred the phone to the new case, I notice the top of my brand new, week-old phone was cracked on the top edge. While I think this new case will offer good protection, I'm pretty disappointed bc supposedly using this case you can drop your phone from a much greater height without damage to the phone. I did notice this case doesn't have the 'rubber' edging that my last case had so maybe that's why?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Cline",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:16:27.000Z",
          "Titre": "For the price we paid not a bad product",
          "Contenu": "For the price we paid, we thought it would have a screen cover on the cover screen.  All in all it's well.built fits great. Only down fall.i.can see is no screen protection  either open or closed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachaad",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T03:07:27.000Z",
          "Titre": "Interface and packaging",
          "Contenu": "Interface and packaging. The product I love looks and the quality. However, the product fitting on my phone is not perfect . One corner is slightly higher then one side . I'm paying premium price this product , need to be prefect"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "HueyMungous",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T17:35:43.000Z",
          "Titre": "Case is OK, could be better though.",
          "Contenu": "Case is good.  Not a fan of the way the silence button is operated.I get that extra skins are provided for when they fail, but there’s only three of them and I can’t see that membrane lasting very long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T18:24:46.000Z",
          "Titre": "I bought the nautical case for an…",
          "Contenu": "I bought the nautical case for an iPhone and the case is great, holding up well and phone calls can be heard. The seal over the charging port could have a bigger pull handle on it though. And the whole “agent” marketing thing you guys do is silly in my opinion. Overall great case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BD HOUSE",
          "Nb_Reviews": 5,
          "Date": "2023-06-18T16:27:18.000Z",
          "Titre": "I love the quality and how it seals the…",
          "Contenu": "I love the quality and how the case seals the phone all around. I did notice it seems the phone volume has decreased when taking a call as if the speakers are being blocked some?"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Valerie",
          "Nb_Reviews": 5,
          "Date": "2023-01-11T02:31:01.000Z",
          "Titre": "Upside down",
          "Contenu": "Nautical slim is my go to case. Got new phone so I ordered new case.  Same great quality.  However the tiny hole available for the leash is now located on the top of the case instead of bottom corner. Pretty annoying to have leash at the top of the phone after all these years at the bottom.  Otherwise great case."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Riri",
          "Nb_Reviews": 3,
          "Date": "2023-06-14T16:42:52.000Z",
          "Titre": "Good overall experience",
          "Contenu": "Good overall experience. Only critique is that the iPhone belt clip is quite “clunky” and more “masculine “ than I was expecting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Zadra",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T21:13:27.000Z",
          "Titre": "Fast delivery & well packaged.",
          "Contenu": "Fast delivery & well packaged.. Looks good..My second order..Not keen on it shown finger prints on the back..Seems strong..Time will tell how it holds up..So far satisfied customer.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike RUSS",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T16:58:47.000Z",
          "Titre": "Nautical 2",
          "Contenu": "1) The instructions video was not very helpful. Most of the time it talked about checking the case to be water tight, not on how to install it on the phone.2) The small round wheel that shuts off the ringer (iPhone SE gen3) does not engage the switch on the phone. Attempted 3 times and gave up. Not a deal breaker for me. All the other controls are very easy to use. Overall a good case(so far) worth the $$$$."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Jakob",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T21:24:10.000Z",
          "Titre": "Quick Delivery, Bad Transport",
          "Contenu": "The delivery was quick enough, the product worked really well. I'm very happy of the results.However I do feel like paying toll fees for the product is outrageous as these are very expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T17:34:05.000Z",
          "Titre": "Great cases aside from fingerprint",
          "Contenu": "Love your phone case but the fingerprint reader does not work properly.  I have followed directions to the T and it cannot read my fingerprint."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leola Woodford",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T20:58:24.000Z",
          "Titre": "Nautical",
          "Contenu": "Love this case, my 3rd one because the cover scratches so easily. That is the only flaw.  Other than that, it does everything it  is supposed to do. Waterproof and has great drop resistance."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Josh C",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:35:26.000Z",
          "Titre": "Nice",
          "Contenu": "Product seems well made we'll see how well it holds up. Shipping could be quicker but overall satisfied so far."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Asif",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T15:00:01.000Z",
          "Titre": "The cases for iPhone 14 Pro Max & AirPods Pro look nice and serve their purposes",
          "Contenu": "The cases for iPhone 14 Pro Max & AirPods Pro are good-looking and sturdy. My phone fell a few times from my hand in the last few months. However, the case kept it unharmed. I am satisfied with both of these products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlos Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T14:59:58.000Z",
          "Titre": "Product is good",
          "Contenu": "Product is good. My only problem with it is, I have to open my fold 4 in order to access my phone. Because the case is so thick I can't use my side buttons in the closed position. Other than that the case is great. Also, I wish there was a belt case holder! Just a thought"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 9,
          "Date": "2023-03-14T17:59:05.000Z",
          "Titre": "I love the phone case",
          "Contenu": "I love the phone case. It's very comfortable and looks great. I'm still evaluating the mag safe car mount. The magnet doesn't seem that strong but we'll see. The vent mount is very secure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Len Sanford",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T14:51:36.000Z",
          "Titre": "The case is great",
          "Contenu": "The case is great! Not bulky at all. This is the case I use everyday. Only thing I would have liked was to have the bumpers around the case more rubbery, to make the phone easier to grip. I definitely recommend this to anyone looking for a case for their Pixel 7 Pro!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kyle Lylyk",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T19:02:23.000Z",
          "Titre": "The phone case is easy to install and…",
          "Contenu": "The phone case is easy to install and has done a good job keeping the screen intact when it has been dropped. The only downside is the sound is a little muffled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guillermo",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T19:36:55.000Z",
          "Titre": "Not a bad case",
          "Contenu": "Not a bad case, protects the phone well. The bad part is that the finger print reader doesn't really work well with the case on. the front and back get finger prints, It's also a bit slippery for a none slip grip case. Haven't tried it under water yet. But over all i like the case."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Christian Lemay",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T15:09:40.000Z",
          "Titre": "Excellent case",
          "Contenu": "Excellent case, feel sturdy but I dont't know if such a rigid plastic can absorb that much of an impact or if it may transfer the shock to the phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MICHELLE D FINK",
          "Nb_Reviews": 5,
          "Date": "2023-10-03T20:43:49.000Z",
          "Titre": "You need to put some kind of cover on the front part. You have it on the back of the phone now. You need to cover on the front.",
          "Contenu": "I wish you would have put a hard plastic. Are a gorilla glass plastic on the front part where the cameras at. You have that open so if I drop it. I can still Knick the front part of my phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Canfield",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T17:55:05.000Z",
          "Titre": "This is a replacement case for a phone…",
          "Contenu": "This is a replacement case for a phone and I had the same phone and the same case but this case fits looser in the buttons are in the right spot"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Edith",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T14:10:48.000Z",
          "Titre": "Great case!",
          "Contenu": "Great case just way too long to receive! I like the material and the pocket to hold cards. I've dropped it a couple times and it held up well."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cathy Graham",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T19:32:32.000Z",
          "Titre": "Product is great and they were able to…",
          "Contenu": "Product is great and they were able to change my order for me. Time to delivery was longer than expected"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew R",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T23:54:09.000Z",
          "Titre": "Case it great and protects well",
          "Contenu": "Case it great and protects well, cannot hear phone calls unless on speaker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "curtis maison",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T20:15:56.000Z",
          "Titre": "Great case love it",
          "Contenu": "Great case love it.  My only concern is the screen protector does not all biometric to synchronize"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sherry",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T15:13:05.000Z",
          "Titre": "The phone case is excellent",
          "Contenu": "The phone case is excellent, nice grip, works well. Very pleased with it. The only issue is,  could not get the finger print screen to work. I tried a few times.Case seems durable. Services was quick on delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronnie Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T20:13:04.000Z",
          "Titre": "Fantastic case so far",
          "Contenu": "Fantastic case so far, I'm not able to send audio notes in applications like whatsapp, telegram etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T16:35:01.000Z",
          "Titre": "Case fit and durability are excellent",
          "Contenu": "Case fit and durability are excellent; only downside is black exec case collects fingerprints and skin oils"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 6,
          "Date": "2023-12-03T15:53:21.000Z",
          "Titre": "It's well made",
          "Contenu": "It's well made! I only had it for 2 weeks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Siv A.",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T06:34:11.000Z",
          "Titre": "I've had it for almost two weeks now",
          "Contenu": "I've had it for almost two weeks now, I love my Prismatic Ghostek case.The case is of good quality and is well made. I feel my phone is protected.I gave it 4 stars (a high praise from me, as I am very critical of phone cases) for a few reasons. The clear plastic back is quite slippery, especially after holding your phone for an extended amount of time. I found my hand would get sweaty and if I were holding the phone sideways for game playing or streaming, and I'd lose my grip on the phone. I ended up buying a Mobi Handle to fix that problem. I like quality products. I am not a rich person, but I also can't justify putting a $1400 phone in a cheap $10 case (hence me choosing to buy this case, after reading many reviews and watching product videos.)The only other issue I have is with the grips on the sides of the phone.There is a hard edge to them that makes them uncomfortable to hold.I wish the grip part was a softer material. I am a woman, I have small hands and need to hold the phone (an S23 Ultra, a big phone) with a tighter grip.This issue probably won't bother people with larger hands.All in all, I am very happy with my purchase. I even bought my mom one in Purple. She loves it as well.I hope the prismatic colors hold up and it lasts for a few years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Hannigan",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T15:15:07.000Z",
          "Titre": "Love the case",
          "Contenu": "Love the case.  Only issue I have is I can't really get to the my power button and volume button so easily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Courtney",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T21:00:24.000Z",
          "Titre": "Love this and cute…",
          "Contenu": "I love the case provides good protection  the only flaw is a lot of dirt and dust gets between the phone and case"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Testerman",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T22:56:54.000Z",
          "Titre": "Nice case but slick",
          "Contenu": "Pros-The case and card holder is nice and the magnet holds them together very well. Cons-The case and card holder could use a little more grip and the card holder needs a stronger magnet to keep it closed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jared L",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T21:00:14.000Z",
          "Titre": "Good protective case with a few flaws",
          "Contenu": "Bought the Nautical slim to fully protect my $1500 phone due to my job that battles all the elements of nature. Had the case for about a month and there's still no dirt, water/moisture underneath the protective screens so it does it's job well. The only 2 cons that I've noticed is the speakers are very muffled (which is for water protection) so having a phone call in a loud environment is a no-go. And the finger print scanner part worked well for a few days but the left side has formed a small air bubble so the scanner is no longer reading my finger print. Other than those 2 cons, it's a solid phone case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:39:15.000Z",
          "Titre": "Like but think it would have been…",
          "Contenu": "Like but think it would have been better if it had a front glass or plastic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon Anderson",
          "Nb_Reviews": 2,
          "Date": "2022-11-13T15:18:00.000Z",
          "Titre": "Great case",
          "Contenu": "The case seemed to take forever to get to me but it was worth the wait only one small warp was there  around the bottom where the charging port hole is located. Nothing too bothersome but all in all a great case... saved my phone numerous times from costly drops already!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Thorpe",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T17:42:23.000Z",
          "Titre": "Ghostek makes great products!",
          "Contenu": "Ghostek’s Nautical phone case is my favorite, because it provides water and shock protection,and isn’t overly bulky.   When I bought one that had a defect- the charging port cover came off- they replaced the cover quickly. I knew it was an unusual flaw, because I tried to remove the plug from my old case, and it was impossible to remove. I’m buying Ghostek for all our phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Brant",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:20:24.000Z",
          "Titre": "Ghostek sets a high level!",
          "Contenu": "Ghostek sets a high level for the quality of its cell phone accessories, and for its outstanding customer service. As a New Yorker, I am proud to support this local tech company. Great job - Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steve c",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:31:31.000Z",
          "Titre": "Awesome product",
          "Contenu": "Awesome product.  I just accidentally dropped phone down stairs not a scratch of damage to phone.  Ordered another case the next day.  Wanted a different color."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Israel Berdecia/Bibiana Collaz",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:32:57.000Z",
          "Titre": "The material on the case is sturdy…",
          "Contenu": "The material on the case is sturdy which is excellent. But one thing is different, I can’t install a protective glass template with this case. There’s not enough space for it! I like to protect my iPhone as much as I can!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Z",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:35:27.000Z",
          "Titre": "Great communication",
          "Contenu": "Delivery was delayed, and immediately recieved update and offered refund. This was above and beyond. It was not a waiting game. They were able to deliver within a timely manner.  Love the headphones."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Big Abang",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:20:06.000Z",
          "Titre": "Great",
          "Contenu": "Great. I had issues with the fold 5 exec6 case quality. They replaced it immediately. Good job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie",
          "Nb_Reviews": 6,
          "Date": "2023-12-17T23:28:08.000Z",
          "Titre": "Very Nice 👌🏻",
          "Contenu": "Years ago I got tired of boring Ol Otterbox, went looking for something new. Found Ghostek and never looked back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Dales",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:08:07.000Z",
          "Titre": "Love my case",
          "Contenu": "I received my case it fits beautifully. Looks good on my phone I’m vey happy with it no complaints. Thank you I will for other products from Ghostek"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Michael Tan Boon Siong",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T22:37:31.000Z",
          "Titre": "I love ❤️ GhostTek nautical slim casing…",
          "Contenu": "I love ❤️ GhostTek nautical slim casing for my iPhone 15 Pro Max.I ordered it on 11th November, I received my well packed parcel on 24th November before my birthday on 29th November. It’s an awesome waterproof casing & also drop test durable Nautical Slim casing. Definitely will introduce this Ghostek casings to my friends.Swift delivery by DHL logistics team.Thank you 🙏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Maciel",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:46:41.000Z",
          "Titre": "A little disappointed that there was no…",
          "Contenu": "A little disappointed that there was no screen protector with my purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christiane Laidlaw",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T23:50:02.000Z",
          "Titre": "For Agents eyes only",
          "Contenu": "I love Ghostek products! I used to go through different stores to get them but this cyber Monday I went straight to the source. I'm happy I did. The website is well laid out so it's easy to find what products you're looking for and what model of phone you need to match. They even had products that I never even knew about and I ended up buying more than just their cases. The sale! Omg the sale was fantastic and I even got a discount code that made it even better! My Note 20 Ultra is now covertly covered, charged & gripped! I enjoy the little videos they have on YouTube calling their customers agents. It adds personality to the brand and I'm there for it. Ghostek cases are practically indestructible. The nautical cases are slim but completely waterproof and tough as nails. The Nrgy charging cable is the most flexible material reinforced cord I've ever had and I absolutely love it. It allows my quick charge blocks to reach my phone & charges super fast.  The hoster fits all the cases I got and adds a clip & a stand to the ones that need it. I'm very happy with my purchases and I'd recommend this company to anyone who likes a little whimsy & rock solid protection with their phone gear. Good luck, Agent!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ishwar Sawh",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T22:53:34.000Z",
          "Titre": "This might be the best case ever…",
          "Contenu": "This might be the best case I've ever purchased for any of the phones I've had. It feels solid, strong, and is easy to take on and off if need be. The only 'negative' if I can even call it that, is the fingerprint scanner. Most of the time, it doesn't work when I need it to. Now, that's not the case's fault, simple how the s23 works. Everything else is perfect for me. The charger plug, the side buttons, the overall feel of the case is awesome."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Lorena P.",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T11:02:08.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, fast and helpful. Very happy with both items I ordered, very good quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Green",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:43:10.000Z",
          "Titre": "Pixel 8 Pro Exec",
          "Contenu": "Pixel 8 Pro ExecThe case is sturdy, fits great, and the magnet is very strong. The only thing I would change is the direction the wallet opens from. I would like it to open from the other side because I tend to use my phone in landscape mode in the other direction, so having the wallet open to prop up my phone is backwards for me. That is most likely personal preference, which is why I didn't take a star away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Galloway",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:00:55.000Z",
          "Titre": "I don't have to worry about my phone…",
          "Contenu": "I don't have to worry about my phone being damaged in the nautical slim case as I work in the mud and water all day. Nice case!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Larson",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:33:51.000Z",
          "Titre": "Love the way it fits",
          "Contenu": "Love the way it fits. Quality packaging, clear instructions. You can tell this company cares and for that, I am optimistic in the protection this case will provide! I drop my phone often bc of my dogs and how chaotic life can be, so I found this company and look forward to excellent protection through the slush and snow of winter!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Malia Rota",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T08:09:49.000Z",
          "Titre": "I ordered this all the way from New…",
          "Contenu": "I ordered this all the way from New Zealand and was able to still get this in a timely manner. I was after something unique and with a bit of swagger too. Absolutely love my new wallet and phone case. Highly recommended to all!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Patrick Landry",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:45:53.000Z",
          "Titre": "Nice product perfect service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:28:16.000Z",
          "Titre": "Great affordable waterproof phone case!",
          "Contenu": "I ordered from this site because it was actually cheaper than Amazon and I knew it would be authentic. Ordering was easy and I had a phone case mailed shortly after."
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Eddie Ng",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:16:49.000Z",
          "Titre": "the ease of purchase is a good…",
          "Contenu": "the ease of purchase is a good experience, I can just pay using Google Pay and everything is set."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Justin Y",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T18:45:26.000Z",
          "Titre": "Durable and functional!",
          "Contenu": "Ghostek makes the most durable cases out there! They also have the best customer service and warranty. They definitely stand behind their products!! Highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Andy",
          "Nb_Reviews": 4,
          "Date": "2023-11-15T03:36:53.000Z",
          "Titre": "Ghostek pixel 7 pro case",
          "Contenu": "I love it it's a very nice design an protects my phone at all times ..specially now that it doesn't fall out of my pocket anymore because of the case..well worth the buy however I won't be throwing it or dropping it from 12 metres lol 😂  I don't see the need to prove that the case protects my phone"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "George Arvanitis",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:49:53.000Z",
          "Titre": "Good  value for money",
          "Contenu": "Such a great phone case u can never go wrong I got a teal colour for my s23 ultra and it really looks good 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T03:10:24.000Z",
          "Titre": "Sturdy High-Quality Products",
          "Contenu": "I am very impressed with how durable and well-constructed my case is. I have already dropped my phone once on a hardwood floor and the case completely protected my Pixel Fold from sustaining any damage! I would recommend to anyone they give Ghostek a try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mommaknows",
          "Nb_Reviews": 15,
          "Date": "2023-11-22T17:09:02.000Z",
          "Titre": "I really like the phone case and it's…",
          "Contenu": "I really like the phone case and it's stylish with practical aspects such as the kick stand. I really like the screen protector that came with the case as well. It fits nicely with absolutely no bubbles. I just prefer that I have a case that is a two piece and it fully seals my phone inside. This is a great case and quality product it is easy to use and install. I'd definitely recommend this product and Ghostek. I just need my case to fully protect my phone from water, dust, mud and drops. This will definitely be my go to case in the summer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg  S",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:13:13.000Z",
          "Titre": "Great case",
          "Contenu": "It’s a great case. Really seals out everything. I just wish I would have gotten it sooner. I was worried about the front being too thick with my blue light screen protector but not a problem. I don’t even notice any touch issues. Great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Huff",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T15:30:41.000Z",
          "Titre": "Awesome",
          "Contenu": "I'll definitely continue to purchase cases from ghostek. They have an awesome life and hold up well in my environment as an industrial construction worker."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Julianne Vazquez",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:36:20.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. They was quick and resolved my issue super fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Mark",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T02:18:02.000Z",
          "Titre": "I love the phone cover’s they hold up…",
          "Contenu": "I love the phone cover’s they hold up really good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Peterson",
          "Nb_Reviews": 4,
          "Date": "2023-12-07T17:03:33.000Z",
          "Titre": "Hassle Free",
          "Contenu": "Easy ordering plus free shipping.  I buy Ghostek because it works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach Prime",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:43:02.000Z",
          "Titre": "Great simple well made case",
          "Contenu": "Great simple well made case, no bs, click it together and you're good to go"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gio",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T02:02:01.000Z",
          "Titre": "accurate product descriptions",
          "Contenu": "The sale process was smooth and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T14:21:00.000Z",
          "Titre": "Solid cases",
          "Contenu": "Solid cases always I only ever get the covert since my last phone the atomic slim was available so I settled for the Covert it’s a great case I have trusted GHOSTEK for 3 phones now never had a broke screen yet. Now I don’t drop my phone much but it happens occasionally. I don’t use screen protectors either."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Siccardi",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T22:15:09.000Z",
          "Titre": "Ghostek has great cases",
          "Contenu": "Ghostek has great cases. I always trust that I will get a top quality, perfect fitting, durable and protective case for my iPhone from Ghostek. The customer service is great and it's nice to know the company stands behind its products. Shipping and delivery communication is excellent and prompt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Cook",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:39:55.000Z",
          "Titre": "It was the perfect gift for my Mother",
          "Contenu": "It was the perfect gift for my Mother’s new IPhone 15 Pro. I use the same case already for my model and knew she would love it compared to her old cases on her prior phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CaptianADHD",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T20:00:07.000Z",
          "Titre": "Case is great at protecting.",
          "Contenu": "I got my 2nd case from Ghostek because the 1st one was so amazing and did exactly what they claimed.  I wanted a 2nd case for when I didn't need the heavy protection that the atomic slim provided.  The Covert is perfect for casual events and I have the Atomic Slim for extream protection when I need it.   My next purchase for my phone will also be a Ghostek, maybe the Nautical for wet and muddy outside events.Thanks Ghostek for such incredible products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Lucas",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T22:12:02.000Z",
          "Titre": "Great products",
          "Contenu": "Great products, I will never use a different brand of cases ever again! I recommend this company to anyone who wants a sure case and style all in one! I give them 10 stars ✨ hands down!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Orion Dante",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T21:53:31.000Z",
          "Titre": "Looks and feels great",
          "Contenu": "Got the clear matt case with the small red accents, and it all looks great. Texture is nice and grippy, and the clear back lets me customize the look of the phone further. I currently have a DBrand vinyl showing.The hinge mechanics are all visable, personally I like it, though they may look or feel a little bulky for some.The case does add some extra thickness to the phone, but it makes it feel a lot more robust, and it is not unwieldly at all. I haven't tested dropping it, but it feels like it would protect my phone.Finally, it's precisely sized and easily fit around my spigen outer screen protector with zero issue lining up properly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Grubb",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T04:00:00.000Z",
          "Titre": "Samsung S23 Ultra Case",
          "Contenu": "Well 1st I order wrong case and it was completely my fault for not paying attention and there so fast shipping it when I emailed them later that night to correct it they already sent it out ... so I order the right one and it came within 2 days as well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ACameoAppearance",
          "Nb_Reviews": 4,
          "Date": "2023-10-12T18:37:11.000Z",
          "Titre": "Pretty and protective",
          "Contenu": "Ghostek had my Atomic phone case to me in less than a week. The prismatic colors are absolutely gorgeous, I've received many compliments. Also, my phone looks and feels protected. My only complaint is about the hinge protector. It stays sticking up unless I manually close  it. It is extremely bulky, so it doesn't fit in the UV disinfector, or my phone stand; and it can't be used as a kick stand. Sure my hinge is protected but at a cost. I am using a Speigen screen protector on the front & it fits well with no lifting.I've had the case for a week or so now. So far, so good!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oliver Osterhues",
          "Nb_Reviews": 5,
          "Date": "2023-11-05T17:29:32.000Z",
          "Titre": "Ghostek Exec for iPhone 15 Pro Max",
          "Contenu": "Someone recommended I look at Ghostek, when I said the magnet on the case I got with my iPhone 15Pro Max wasn’t very strong.  I watched a number of reviews on YouRube and decided to give the Exec a try.  Not only is the magnet MUCH stronger, the case feels great in hand!  I highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T21:54:47.000Z",
          "Titre": "Case is perfect",
          "Contenu": "Case is perfect; light, protective, looks great and comfortable to use. The magnet is strong and works with magwallet and anker battery pack without issue. Highly recommend this case"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:32:15.000Z",
          "Titre": "Great service fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Sebok",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T01:56:26.000Z",
          "Titre": "Post office lost my order",
          "Contenu": "Post office lost my order, which isn't ghostek fault but they refunded my expedited shipping. Answered quickly, did what they could. Still really sucks tho cause I work in a chemical plant and I really need that case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel López",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T15:09:20.000Z",
          "Titre": "Totally protected. We know that phones are expensi ve and…",
          "Contenu": "We know that phones are expensive and can break or be damaged. I love this ghostek case because apart from protecting the cell phone from falls, it also protects it from the aya and the dust"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Bagovich",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T01:58:46.000Z",
          "Titre": "Great quality Great price",
          "Contenu": "I never heard of Ghostek before seeing an online advertisement but the price of the item I was interested in was very reasonable. I had a phone case already but wasn't 100% satisfied with it. So I figured I would give the Ghostek case a try. I am thrilled with the quality, fit and feel of this case. My new \"Go To\" phone case supplier is Ghostek"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lukas",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:16:38.000Z",
          "Titre": "Great case",
          "Contenu": "Great case, fits well the clear part kinda got scuffed up or scratched already but it's not too noticeable. Protects the phone and feels thinner, buttons work amazing unlike a lot of cases. You get what you pay for this is definitely quality"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Grant Novakovski",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:56:34.000Z",
          "Titre": "Shipment came pertty quick package was…",
          "Contenu": "Shipment came pertty quick package was well done no damages at all makes my phone awesome looking"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AMANDA",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T14:56:23.000Z",
          "Titre": "Awesome Experience",
          "Contenu": "Fast shipping, great price and quality product"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Juan Manuel De La O Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:06:18.000Z",
          "Titre": "This is my second case ,my first…",
          "Contenu": "This is my second case ,my first experience with you was great that's why I choose you again for my New Samsung S23 Ultra"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thom Scott",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T14:48:01.000Z",
          "Titre": "Great product",
          "Contenu": "Ordered two iPhone 15 pro max cases, an AirPods Pro 2 case, and a usbc cable. Received all but the cable, it was crossed out on my packing list. I assume it was sold out, but there was no attempt to inform me of this before I received my order. Love the products, will keep purchasing from this company. Thanks for resolving my issue in a timely manner!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Top Jatabutr",
          "Nb_Reviews": 2,
          "Date": "2023-10-22T15:03:06.000Z",
          "Titre": "The product is great, but My fault",
          "Contenu": "The product is great. It was me. I  didn't double check the model before I sent the order in. When I received the order that's when I realized I ordered the wrong size cases. Luckily I wanted the wallets and they are interchangeable between phone models, S21 series."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Bueno",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:47:53.000Z",
          "Titre": "Great products!",
          "Contenu": "Packing was easy and simple. Comfortable and easy to handle. MagSafe is really strong! I purchased both Nautical Slim & Atomic Slim for IPhone 13; as well the Covert AirPods Pro Case!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Big boy",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:42:47.000Z",
          "Titre": "Excellent Protection and Seamless Experience",
          "Contenu": "Title: Excellent Protection and Seamless ExperienceI recently purchased the Google Pixel 7 Series Rugged Full Body Waterproof Case — NAUTICAL slim for my Pixel 7 Pro, and my experience from ordering to daily use has been exceptional. The ease of ordering on their website made the process hassle-free, and the timely shipping ensured I received the product at my doorstep promptly.One of the standout features is how well the case fits my phone; it's like a second skin. The minimal impact on the phone's thickness is commendable, providing a sleek and comfortable feel without compromising on protection. The case offers a perfect balance between a slim design and robust defense.The waterproof nature of the case has proven to be a game-changer. On more than one occasion, it has safeguarded my phone from unexpected encounters with water. The added layer of protection is a reassuring feature, especially for those who lead an active lifestyle or find themselves in unpredictable weather conditions.This isn't my first Google Pixel 7 Series case, and it certainly won't be my last. The durability and reliability of their products are evident. My only reason for purchasing a second case was due to an unfortunate incident that punctured the film over the flash, compromising the waterproofing. However, this incident only reinforced my trust in the product.In conclusion, the Google Pixel 7 Series Rugged Full Body Waterproof Case — NAUTICAL slim is a great investment for anyone looking for top-notch protection without sacrificing style. I highly recommend it and will continue to choose this series for all my future phone case needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deidre",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T18:17:17.000Z",
          "Titre": "Absolutely love my GHOSTEK case!",
          "Contenu": "This was my second purchase of the same case for my phone. The first was about 2 years ago. I got the new one because the screen cover was scratched up so badly that it was getting hard to see the screen and the charge port cover had lost the pull tab, but my phone was completely protected. It's like-new still! I am much happier buying a new case every couple years than buying a new phone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reuben Brown",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T14:15:46.000Z",
          "Titre": "First I would like to mention that the…",
          "Contenu": "First I would like to mention that the product is really top notch quality. Second I would like to say the time of delivery was quick and precise. Third I would like to say price is decent for the level of structure in their products. I recommend to anyone looking for protection for their devices look no further my word...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manny Pareek",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T18:50:39.000Z",
          "Titre": "Case is good and fits well",
          "Contenu": "Case is good and fits well, just the delivery time could be better"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik B",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T05:59:17.000Z",
          "Titre": "Quality product",
          "Contenu": "Covert case fits the Pixel 8 pro well, has excellent grip, and looks good! This is my second covert case, and both have been quality products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trent Lytle",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T01:53:07.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, great price and fast shipping. This is my second case, wanted a slimmer one, and I don't think I will use another brand ever. Case is well built and has actual buttons instead of rockers. Totally weather sealed and stands up to whatever Mother Nature throws at you. Bought my first case for a trip to Niagara Falls, NY and it held up well walking the Cave of the Winds. I got soaked and so did the phone but I managed to get some food photos. My only \"issue\", nit picking here, is that I wish the sides were a little more textured and maybe with some rubber for a little more grip. Like that it is made in the USA, and in New York even if it's NYC. A little ribbing from your neighbor way up north. Keep up the great work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian D Gibb",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T14:08:42.000Z",
          "Titre": "Covert operations",
          "Contenu": "Fit my z flip 5 perfectly for covert operations. Very easy to communicate with home base. I highly recommend Ghostek for all field agents"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry Gavidia Giusti",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:24:31.000Z",
          "Titre": "I was surprised when I received the…",
          "Contenu": "I was surprised when I received the case for my iPhone 14 pro max, the quality of the material is very good, the Ghostek cases are made to really protect, the inside has padded protection, the best case I have ever bought"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T02:23:18.000Z",
          "Titre": "Quality that works",
          "Contenu": "Returning customer, strong case design,  quality that last, used mostly in a maritime environment for work, multiple drops never had a screen crack."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Sullivan",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T17:54:42.000Z",
          "Titre": "Excellent product and customer service",
          "Contenu": "The product is wonderful and I had questions and the customer service was the best I have seen in a long time. Not only were they quick to respond but they had great advice and help and I can't say anything more except they were not typical so what you see today I recommend them Highway"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin R.",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T15:09:32.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you. Great experience.  Fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "for your order",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T14:02:16.000Z",
          "Titre": "great for Z Flip 5",
          "Contenu": "I had bought several cases for the Z Flip 5 when I got it, none of them stayed on-UNTIL I got this on, The best case for this model of phone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "M.  Julian",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T14:06:42.000Z",
          "Titre": "Best phone protector!!!!",
          "Contenu": "I used for many years lifeproof to protect my phone, but can’t compare to this IP68.This phone protector is of superior quality, I’m very happy with my ghostek phone protector"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Jody-Ann Byfield",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T21:03:12.000Z",
          "Titre": "Great shipping",
          "Contenu": "Great shipping, very sturdy product, too bad i got it 10hrs after my new phone fell and the screen broke. But it is on now and i feel more secure and i love the colour"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Esaud Coranguez",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T05:06:57.000Z",
          "Titre": "I loved the style of my protector and…",
          "Contenu": "I loved the style of my protector and even more so the design that allows access to use my screen"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Kahler",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T09:07:25.000Z",
          "Titre": "You have great products and wonderful…",
          "Contenu": "You have great products and wonderful customer service as well. I love the case for my Samsung galaxy Z fold 4. I bought both of them that are made for my Samsung phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark A",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T21:40:59.000Z",
          "Titre": "Love the case and the shipment was fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Vera",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T15:19:32.000Z",
          "Titre": "Great case",
          "Contenu": "The product was delivered without any issues. The case is protective and feels great! I like how strongly the magsafe works with this case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Panther",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T00:08:26.000Z",
          "Titre": "I very much so have liked all the cases…",
          "Contenu": "I very much so have liked all the cases I've purchased. The fit and quality is always great, but to be honest I love the styling you guys put into theses cases. My wife has to even get in on these cases. She loves her pink covert case."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T16:15:49.000Z",
          "Titre": "Great website",
          "Contenu": "Great website . Easy to use no issue shipping is great . Sending out tracking   # is very helpful also insures customer that this Is no fraud."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SK",
          "Nb_Reviews": 4,
          "Date": "2023-10-05T20:27:10.000Z",
          "Titre": "Ghostek Makes the Best Cell Phone Cases",
          "Contenu": "I love Ghostek products. They are reliable and sturdy products. I bought 3 cell phone cases from them so far. I recently bought the same case that I bought for my iPhone 13 Pro max for my new iPhone 15 Pro max. The reasoning is simple. It’s an excellent case that protects the life of my phone from a large range of mishaps, and it is the best insurance that I could ever buy. Thank you, Ghostek for making some of the best cell phone cases and accessories out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:29:36.000Z",
          "Titre": "return incorrect phone protector…",
          "Contenu": "return incorrect phone protector recived my refund quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Rising",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:12:43.000Z",
          "Titre": "Although the phone case wasn't exactly…",
          "Contenu": "Although the phone case wasn't exactly what I wanted, they were very good on returning it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Qualls",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:52:59.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping! Great product.... A+++ Company and brand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TH",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T01:18:26.000Z",
          "Titre": "Repeat buyer, customer for life",
          "Contenu": "This is my second case from Ghostek and I couldn’t be happier. 1) quality: these cases feel substantial but not heavy or bulky. It’s clear they use good materials. The finishes last even after me abusing my old phone for over a year. 2) style: I think these are some of the best looking cases on the market. The Atomic slim is sleek but utilitarian/military inspired, color ways are great and they’ve added more styles/colors since my first. 3) safe: I’m not gentle on phones…I drop mine frequently and toss it around and on the floor at the gym. My phone looked as good as the day I got it when I traded it in. 4) mag safe means mag safe: this case anchors my phone on its charger/mount like nothing else. I never have to worry my phone falling off no matter what I’ve done to it. You truly cannot go wrong with a Ghostek case. Otter who?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Braden Culpepper",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T08:09:07.000Z",
          "Titre": "Here is an account of my experience…",
          "Contenu": "Here is an account of my experience with Ghostech. I am holding in my hands right now, one of the best purchase decisions I have ever made. I am holding in my hand two different products. 1.) A two thousand dollar phone: the Samsung Galaxy Z FOLD 5. One of, if not the most sophisticated phones available on the Planet today, including the Apple iPhone 15 Pro Max which this phone trumps in my opinion. 2.) The Ghostech product that goes with the Samsung Galaxy Z FOLD 5 ( there are two if I am not mistaken and the more expensive one costs over twice as much as the less expensive one which is expensive. I have the more expensive one, it cost $200.) Concerning the Samsung Galaxy Z FOLD 5: I have not even begun to explore this phone. The features are many. The thing that stands out about it the most is that in the configuration that I have it in at the moment *(folded) it is likely the smallest  Most compact Smart Phone on the Market. We're I to put it in it's only other configuration , unfolded, it would be the the largest Smart Phone on the Market. It's revolutionary. The big deal is that the touch enabled screen folds. There may have been some problems with earlier versions, but these have been eliminated with the Advent of the FOLD 5. Concerning the Ghostech case:Simply put, it's a miracle. The list of advanced materials puts the Starship Enterprise to shame. The engineering of this, the mechanical engineering stands as a testament to the advantages of the modern day Computer Modeling and AI enhanced Machibe Learning available to our top minds today. And that is who I give credit to, the Human Engineers who conceived, designed, and executed the prototypes and then everything else they did after that. I am holding in my hand the most sophisticated phone case in the worldl which my personal assistant assembled in about 90 seconds. GHOSTECH hit this one out of the park. Way to go, guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Tucker",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T16:06:37.000Z",
          "Titre": "Finally found the one!",
          "Contenu": "This case is smooth, strong, good looking and the color red! Red is a rare color to find these days and this one is fantastic. So thank you for that option Ghostek. The price was right, and the shipping was very, very fast!I read through dozens of reviews of dozens of companies. This just fit my needs and thankfully my wants. I'm very happy with my purchase and highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Pena",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T13:35:58.000Z",
          "Titre": "The best Phone protector ever",
          "Contenu": "The best Phone protector ever, just yesterday falls from a 2 story home (about 16' high) and not even a scratch. Highly recommend 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T00:47:57.000Z",
          "Titre": "Love your iPhone cases",
          "Contenu": "Love your iPhone cases.  Needed one for my new iPhone 15 Pro Max.  I had one for my 12PM.  I needed it before my phone got delivered and you did not disappoint.  My only suggestion is to add a stronger magnet in the case for MagSafe charging.  I added another stick on for my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CB",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T02:50:07.000Z",
          "Titre": "I LOVE this case",
          "Contenu": "I LOVE this case. It far exceeded my expectations. It feels great in my hand, makes the phone easier to handle, looks great and thank you for the hand strap! I encourage others to check out your products. It was a pleasure doing business with you!"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "Cynwell Wong",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T18:47:32.000Z",
          "Titre": "Good case",
          "Contenu": "great customer support. even you've sent me wrong item.. you are able to compensate it without hassle.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Jo",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T16:29:27.000Z",
          "Titre": "The case is well made",
          "Contenu": "The case is well made, sturdy and feels great in my hand. The MagSafe wallet is a bonus. The price is excellent for the great quality. I will definitely purchase again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa  Arens",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:44:26.000Z",
          "Titre": "I love my new Ghostek  case",
          "Contenu": "I love my new Ghostek  case. It is very durable, and worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kay m. malloy",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T07:23:31.000Z",
          "Titre": "Great company and great cases",
          "Contenu": "You guys were awesome. The first case I received looked like it was used. I contact you and you promptly replaced it. Loved that. Truly a great company. I told my friend about your company and how great you guys are. She immediately placed an order for her new iPhone 15 pro."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David S",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T00:01:29.000Z",
          "Titre": "Ordered a great protective case for my Z Fold 5",
          "Contenu": "Ordered a great protective case for my Z Fold5 with hinge protection and accidentally dropped my phone and have never been happier to have a solid case!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alex Dollimore",
          "Nb_Reviews": 6,
          "Date": "2023-10-11T22:55:07.000Z",
          "Titre": "Best phone case by far.",
          "Contenu": "I stumbled across these phone cases a while back and had them on my last few phones. I wouldn’t use any other case now. They are on the dearer side of phone cases but worth every penny when the you’re protecting a phone worth over £1200."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tristan Roy",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:51:45.000Z",
          "Titre": "Exactly what was expected",
          "Contenu": "The price was affordable and the product is exactly what I was looking for"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Castren",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T19:56:44.000Z",
          "Titre": "Super quality and styling case",
          "Contenu": "Super quality and styling case. Excellent fit and stands apart from other cases.Will order from ghostek again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Shively",
          "Nb_Reviews": 9,
          "Date": "2023-09-26T18:08:52.000Z",
          "Titre": "Waterproof",
          "Contenu": "Quality is great. Just what I needed as  the assistant superintendent at a golf course. Protection from the elements is paramount."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T17:53:09.000Z",
          "Titre": "Pixel 8 pro Nautical Slim",
          "Contenu": "Love this case! Solid yet slim design, looks amazing on the Pixel 8 Pro, and keeps phone well protected. High quality product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Ewing",
          "Nb_Reviews": 3,
          "Date": "2023-10-01T14:06:29.000Z",
          "Titre": "I’m a fan of Ghostek cases",
          "Contenu": "I’m a fan of Ghostek cases. This is my 2nd Covert case. It ticks all the boxes, secure in the hand, buttons work well, excellent drop protection, & has a good look.Over all, a great value for the money!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Thompson",
          "Nb_Reviews": 16,
          "Date": "2023-11-16T09:54:23.000Z",
          "Titre": "Ghostek phone case",
          "Contenu": "Excellent quality and excellent value and a great service and product thanks Rob 😊 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig Whitten",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:57:12.000Z",
          "Titre": "The ease of the order",
          "Contenu": "The ease of the order, how prompt is was delivered and then item I received is excellent."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Trevor Evans",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:52:52.000Z",
          "Titre": "It does what it says on the box.",
          "Contenu": "It arrived and does what it says on the box."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl Reinhardt",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:21:17.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, good price, didn’t arrive in an Amazon package."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitchell Moore",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T21:11:32.000Z",
          "Titre": "The Nautical is the most durable case…",
          "Contenu": "The Nautical is the most durable case I’ve ever used. I’ve tried many other underwater cases. I trust this brand the most."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Andrew Macleod",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T19:42:04.000Z",
          "Titre": "Found what I was after and was quick…",
          "Contenu": "Found what I was after and was quick delivery as well so I was pretty stoked with it fits perfectly and looks good"
        }
      ]
    }
  ]
}