{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "goodleafdev.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SLUMS PA",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:01:09.000Z",
          "Titre": "Honestly do not recommend this CRAP…",
          "Contenu": "Honestly do not recommend this CRAP vps. It hasnt even been a full 2 weeks and this is the second time my server isnt online for HOURS due to the vps not working. It will keep saying Active but it wont be online. Support doesnt help you, if they even decide to reply at all to begin with you will be waiting even longer for a reply than it takes for the vps to start magically working on its own again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MostImporantReviewer",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T01:31:31.000Z",
          "Titre": "Not Great, Not Terrible",
          "Contenu": "I had my VPS deployed by the Owner/Sysadmin/Support Agent/Billing Agent/Technical Support Agent/CFO/CEO NateB.I received the email for my services (Found it in the spam folder) and right off the bat, some login credentials for my service were missing. No biggie, Nate was quick to give me answers and find that information for me. The machine in theory had ok specs, but the internet was not great and fluctuated at times. At the time of my test (Using speedtest CLI) I got 42ms ping, 57mbs down, 940 up. I did however have a few issues. On 7/29/2022 there was announced downtime in which my service was offline for 16+hrs. I also referred my friend to this service, and my friend's server was on a node in which a double drive failure occurred and his data has been inaccessible for weeks now (The owner says they are working to restore the drive, my friend was not transferred to a new node and his service is still down, he was compensated 2 free months) As far as professionalism goes, there are a few things that could be improved on. For example, at one point last week, there was a case in which the owner was having a disagreement with a ex-customer and decided to post about it in the #annoucement chat of discord. The owner name-dropped the ex-customer and released information regarding a fine the ex-customer incurred. I've also experienced the owner of this host's interaction with competitors. While I fully support being competitive in the market, this type of competition was done in a non constructive way. Mocking another hosting company, laughing at ideas and those that proposed them, name calling, borderline bullying, discouraging words like \"you'll never succeed\".  Overall, this host has potential and I'm not sure I would recommend it to my friends at this point in time, based on reliability, affordability, maturity, and overall feel for the company.There site has now been down for 24 hrs with no announcement or response from the owner. (Possible Exit scam?)Update: The site outage only lasted for 5 days.Update2: 8/6/2022Coincidently, 11 hours ago my free VPS was terminated by the owner without reason after the owner of the company replied to my review.. I guess you have to be careful about who you review.Update3: 8/6/2022I've been contacted by trustpilot to provide details as the owner is attempting to take down my review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry W.",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T03:21:51.000Z",
          "Titre": "Awesomeness is here... with GoodLeaf!",
          "Contenu": "Awesome Support, awesome owner, great specs, cheap, and I thank GoodLeaf Development LLC by a lot! I will continue to use it, and never NOT use it.Update: Found a way more affordable host, so I don't use Goodleaf anymore. All though Goodleaf served me well, I just cannot recommend them anymore. Nate helped me a lot though, which is why they are still getting three stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OGGaming",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T22:37:13.000Z",
          "Titre": "They are fast to help resolve any issue…",
          "Contenu": "They are fast to help resolve any issue and best host provider i would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Rage Gaming",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T13:43:39.000Z",
          "Titre": "So far the setup has been a breeze",
          "Contenu": "So far the setup has been a breeze already had a pre install of server to get going for Five M which was helpful setting up I definitely recommend these guys for it’s VPS service I’m using. Also game was smooth when I loaded in no hiccups way better than my last service I was using thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Romero",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T08:09:45.000Z",
          "Titre": "The only host you will need",
          "Contenu": "I have been through a handful of server hosts, GoofLeaf is by far the best host I have had the pleasure to do business with. They are friendly & helpful and very fast support!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Megan",
          "Nb_Reviews": 4,
          "Date": "2023-11-09T16:12:04.000Z",
          "Titre": "Top notch stuff!",
          "Contenu": "I’ve been with GoodLeaf Hosting for 14 days now. They're excellent, great support! Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Reeves",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T21:04:38.000Z",
          "Titre": "Best on the market",
          "Contenu": "For starters, there support is extremely good, always responding promptly and being able to relay over answers to any questions clearly and concisely which is rare in this field. Then it comes to the quality of their products which is in a whole new level. Honestly, they might be the first company that might actually undercut prices. This and the combination of running giveaways is definitely why I gave them 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Game Eagle",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T05:23:35.000Z",
          "Titre": "Nothing else like them",
          "Contenu": "I have used a provider for over 5 years and never thought anyone could beat who I used in the past. GoodLeaf reached out to me and after making a ticket and talking about my needs they pulled through with no hesitation. Their service and products are top notch and I recommend them to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Stimmel",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T02:14:18.000Z",
          "Titre": "This is outright the best hosting…",
          "Contenu": "This is outright the best hosting company out support is insanely fast, the servers performance is really good, prices are really good you won’t find a better host"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kitten Kins",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T17:12:08.000Z",
          "Titre": "GREAT STAFF",
          "Contenu": "the owner dealt with me directly, when it came to setting up the account, as well as all my billing questions. they explained everything so i could understand it as im just the middle person, i came to the hosting place due to a credit i had won in a giveaway. But i couldnt be happier that i won that and got introduced to this hosting site. Great staff."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adonis Cruz",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T15:50:03.000Z",
          "Titre": "Best in the Business",
          "Contenu": "I used good leaf for about 6-9 months perfect ping perfect vps control with no issues I can 1000% say it's well worth it multiple times without question"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "s p",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T01:55:34.000Z",
          "Titre": "Can’t beat good leaf hosting",
          "Contenu": "Brilliant service would never go anywhere else for a VPs or dedicated server if I could give more starts I would fast service for support and if there is any problems they get fixed right away"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Caleb Bérubé",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T01:51:59.000Z",
          "Titre": "Greate guy great servers great support all around good hosting company",
          "Contenu": "I won a giveaway witch is good but even after that he still kept helping me great servers took me a while to figure out Ubuntu but if you can figure it out it's easy to work with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T08:47:25.000Z",
          "Titre": "the best fivem hosting that ive bought…",
          "Contenu": "the best fivem hosting that ive bought everyone is so nice and treat you like family they respond super fast and goodleaf staff is super nice shout out to fearfulwtf#2574 for helping me with everything i need help with i 1000% recommend this hosting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eyad",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T22:00:04.000Z",
          "Titre": "Supplied with VPS's fair prices and…",
          "Contenu": "Supplied with VPS's fair prices and very helpful setup. Took his time to help me out and configure everything. All in all, Grade A hosting. Highly recommend this man for anyone who needs hosting!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamara Hilderbrand",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T20:08:46.000Z",
          "Titre": "They are very professional and reliable…",
          "Contenu": "They are very professional and reliable if anything goes wrong or I need any assistance they are quick to respond to all tickets. I haven't had any issues at all and they are very good at communicating if there is maintenance or outages even upgrades going on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dalton Shaffer",
          "Nb_Reviews": 2,
          "Date": "2023-05-24T07:33:00.000Z",
          "Titre": "Super fast setup within 15 minutes of…",
          "Contenu": "Super fast setup within 15 minutes of purchase, all the software you could need preinstalled, ports opened, I couldnt ask for anything more! -Shaffer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Khaotic Demon HD",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T00:18:55.000Z",
          "Titre": "Honestly best support I have ever got…",
          "Contenu": "Honestly best support I have ever got when it comes to getting a vps and setting it up. The owner is super chill and even goes into a call with you to help you. I have never once had that experience. Its all just been in chat and never in a call. 100% recommended. I will be staying with this company for the foreseeable future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kadell G",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T02:37:43.000Z",
          "Titre": "While on Travel He Working",
          "Contenu": "Helps us big time even though he was on travel. VPS got locked out and while on travel he was able to troubleshoot and get us back up and running! Definitely deserves 5 stars for that alone. Customer Service TOP TIER!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T01:57:06.000Z",
          "Titre": "1000/1000",
          "Contenu": "Made a report got help within seconds! These guys at goodleaf hosting are awesome and very helping and responsive!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Big Uno",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T04:18:57.000Z",
          "Titre": "Never had an bad experience with…",
          "Contenu": "Never had an bad experience with GoodLeaf. Very responsive, and goes above and beyond to help with any issues that occur. 10/10 service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "friedbcn",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T19:40:04.000Z",
          "Titre": "They were able to guide me through the…",
          "Contenu": "They were able to guide me through the most of the process as well as a very good dev @fearfulwtf was able to get our server up in running and everything set up on the new vps!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OneUp Entertainment",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T12:39:56.000Z",
          "Titre": "GoodLeaf, the industry leading hosting provider does it again!",
          "Contenu": "GoodLeaf has provided exceptional customer service to me and my colleagues. Everyone I know personally who has interacted with this company has had all their expectations met and more. On point customer service, insanely fast and reliable servers, virtually instant responses to any opened tickets, and the best part is the pricing. We've worked with many companies trying to find a server provider who can handle our very large and demanding server requirements and GoodLeaf has exceeded them all. Would definitely recommend them to anyone needing hosting, I've yet to find anything even comparable to the services we've received from GoodLeaf. Thanks again Nate and looking forward to many years of great business! - 1Up Entertainment"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James L",
          "Nb_Reviews": 2,
          "Date": "2022-06-21T00:17:27.000Z",
          "Titre": "Best pricing and staff team",
          "Contenu": "Best Staff team out there the owner is kind and always willing to work with you unlike zap hosting there to rip you the F*#k off thank you for your services !!!!⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "NITRO",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T23:57:34.000Z",
          "Titre": "I recently purchased a game server…",
          "Contenu": "I recently purchased a game server heres what i think about this company!pros:Friendly staffFast supportSupport explains things clearlyStaff works with you on any and all issues you have!Cheap and affordable prices!cons...there is no cons Genuinely this is the best hoster i have been with and i will be with for the foreseeable future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T03:21:35.000Z",
          "Titre": "Amazing support",
          "Contenu": "I purchased a VPS and I am still learning and they have gone above and beyond. Even a late night call to help me with something I was overlooking. Definitely has my back with support when I have no idea what I am doing lol. I haven't had any issues with the VPS either. Everything is working without a hitch! Thank you so much for doing amazing work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Kirkland",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:10:25.000Z",
          "Titre": "Connect To Remote Desktop",
          "Contenu": "I had a issue connecting due to some misc. problems and lack of knowledge. The issue was resolved timely & correctly. Thank You! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Swervo",
          "Nb_Reviews": 2,
          "Date": "2022-09-11T05:29:56.000Z",
          "Titre": "W Hosting W Support",
          "Contenu": "The owner was very helpful with assisting with issues I had with fiveM and was very professional. I recommend good leaf hosting for all your game sever needs !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bennett Ricki",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T05:58:53.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Service Friendly SupportWorth every penny"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Galaxy Networks",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T01:15:22.000Z",
          "Titre": "Came from a horrible server host…",
          "Contenu": "Came from a horrible server host transferred over here was able to get me setup the same day and was very helpful would 100% recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Lawless",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T00:07:13.000Z",
          "Titre": "GoodLeaf is the best VPS provider",
          "Contenu": "I have been using GoodLeaf for a few months and the performance of my game server is so much better since I switched over.  Great performance and and great support also.  5 stars all day!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Quang Vu Luong",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T11:50:30.000Z",
          "Titre": "Owner himself does everything with…",
          "Contenu": "Owner himself does everything with love. Tried for 2 weeks, staying cause of the support.Im switching everything over and i recommend you should as well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "GMS Gaming",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T21:50:29.000Z",
          "Titre": "best service and quick response",
          "Contenu": "Very helpful service while trying to get a server running using a Goodleaf Hosting server. Recommend to all"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Mr.Melon",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T03:09:51.000Z",
          "Titre": "Best experience I've had in a while",
          "Contenu": "Owner puts a lot of work on his own shoulders answers anything you need help with responses and help are insanely fast and helpfull and the server are actually really well priced for the performance you get big recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Lee",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T01:48:17.000Z",
          "Titre": "Company was very quick to respond and…",
          "Contenu": "Company was very quick to respond and handled any problems with solutions. Very happy with their service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "riz gotti",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T04:16:17.000Z",
          "Titre": "Great support",
          "Contenu": "Great support. Quick response. Very helpful. Offer the best packages can also customize your package. 10/10 will definitely recommend to others"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yung Don",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T01:43:36.000Z",
          "Titre": "Was great with helping me set up and…",
          "Contenu": "Was great with helping me set up and get everything going I would  advise anybody to give them a chance"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Exonic Taw",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T22:01:12.000Z",
          "Titre": "Fast Support!",
          "Contenu": "Super swift assistance through their support. Their work is amazing and I appreciate the quick responses to problems that sometimes occur!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ryan Kamlassaran",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T06:24:31.000Z",
          "Titre": "10/10 hosting",
          "Contenu": "10/10 hosting, joined their discord wondering which server is better, if you are with zaphosting get out from there and join here is 100% better service , and the owner is active 24/7 will take the time and answer your messages."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T22:45:34.000Z",
          "Titre": "They have been super helpful",
          "Contenu": "They have been super helpful, even when they didn't need to, The company all around is good with customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 3,
          "Date": "2022-08-11T13:43:55.000Z",
          "Titre": "A Step Up From My Last VPS Provider.",
          "Contenu": "The NVME SSD was certainly a step up from my last provider. I am also paying only 2 dollars more than my last providor for largely scaled up specs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Infantryman",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T18:45:01.000Z",
          "Titre": "The Owner/team is very helpful with any…",
          "Contenu": "The Owner/team is very helpful with any questions you may have. Everythinh is priced extremely fairly for your Vps needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cj",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T07:05:40.000Z",
          "Titre": "Best server hoster ever!",
          "Contenu": "Best server hoster ever! best prices! Also great service! Responds under 24 hours amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dylan Horn",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T05:24:05.000Z",
          "Titre": "AMAZING",
          "Contenu": "Bro was so awesome and screen shared the entire time!! Give him a couple hrs and your good any questions will be answered in a quick way. Dont use zap be smart use Good Leaf"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James s.",
          "Nb_Reviews": 2,
          "Date": "2022-03-25T15:18:59.000Z",
          "Titre": "This Hosting is really good.",
          "Contenu": "This Website hosting was really amazing I enjoyed setting it up and it was really easy to config. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GHOSTYBOI",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T01:28:14.000Z",
          "Titre": "Amazing provider",
          "Contenu": "Best server provider out there I've been with them for some time and the owner is professional, staff listens to the customers, if you have any issues the owner will help, there's more the website is well thought of and easy to use there vps servers are easy to use, there vps are lightning fast and high quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary Cannon",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T02:17:23.000Z",
          "Titre": "Best support i have ever had.",
          "Contenu": "Best support i have ever had with any hosting got the issue fixed asap!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T17:06:23.000Z",
          "Titre": "Great",
          "Contenu": "I just started using their VPS so I can’t say to much besides a noticeable difference of better connection and server restarting and loading 7x faster, But the customer service is the best ever, even outside the range of hosting and FiveM, the customer service is still the best I’ve ever seen with anything and if you have any questions about anything they try to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devan Ray Satterfield",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T02:53:28.000Z",
          "Titre": "Amazing support!!!!",
          "Contenu": "Amazing support!!!!! Super easy to add scripts and a amazing VPS. LeafToast is the best developer!!!!!! 😗"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NerdFoo",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T11:41:59.000Z",
          "Titre": "Most helpful bunch I have worked with",
          "Contenu": "Most helpful bunch I have worked with. Always take the time needed to fix the problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Bushore",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T01:10:34.000Z",
          "Titre": "the owner was very helpful he set up my…",
          "Contenu": "the owner was very helpful he set up my vps and taught me how to use it. He also transferred all my files over free of charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edgar Standifur",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T04:33:48.000Z",
          "Titre": "goodleaf is and great host to host a…",
          "Contenu": "goodleaf is and great host to host a FiveM server i would recommend him to anyone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Gaming",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T22:52:11.000Z",
          "Titre": "I love this hosting company",
          "Contenu": "I love this hosting company, Good DDOS Protection Great Prices.?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SNIPERGOD BASEYT",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T13:28:58.000Z",
          "Titre": "Best of thBest e best I highly recommend…",
          "Contenu": "Best of the best I highly recommend GoodLeaf Hosting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stoney Cannabis",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T00:18:57.000Z",
          "Titre": "Absolute legends",
          "Contenu": "Absolute legends! I Highly Recommend!Their Customer Service Was Excellent and Super Fast!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Charlie Burbidge",
          "Nb_Reviews": 3,
          "Date": "2022-05-01T00:17:25.000Z",
          "Titre": "Cheap Reliable Servers",
          "Contenu": "I purchased a server from this place and i will say they are alot cheaper than alot of other server providers and more reliable plus you get better operating systems and CPU and things it is very good i quite like it i would 100% recommend it for anyone who is looking for an affordable fast hosting. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitch Pizza",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T11:56:53.000Z",
          "Titre": "excellent service",
          "Contenu": "excellent servicepretty fast setup time 10/10 would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toxic",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T03:39:47.000Z",
          "Titre": "Best service ever 100/10 W service and…",
          "Contenu": "Best service ever 100/10 W service and great support"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Sohail Ahmad",
          "Nb_Reviews": 5,
          "Date": "2023-07-25T08:39:12.000Z",
          "Titre": "google is king of all hosting &…",
          "Contenu": "google is king of all hosting & development"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T02:50:44.000Z",
          "Titre": "service is the best ive used and fast…",
          "Contenu": "service is the best ive used and fast support team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Flop Flop",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T23:52:13.000Z",
          "Titre": "Understand able is ready to help is…",
          "Contenu": "Understand able is ready to help is good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TOPSHELF BOOG",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T01:22:29.000Z",
          "Titre": "they are very helpful and respond fast",
          "Contenu": "they are very helpfull and respond fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daygo Chronicles",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T08:31:19.000Z",
          "Titre": "W GOODLEAF",
          "Contenu": "Help Me Fix the Problems And I was Running SMOOOOTH"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gem City Rp",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T20:18:50.000Z",
          "Titre": "Best host ever",
          "Contenu": "Best host ever . Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lopez Jones",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T18:09:43.000Z",
          "Titre": "w support helped me with no problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rugga Lmao",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T21:03:32.000Z",
          "Titre": "great and fast service helped us setup…",
          "Contenu": "great and fast service helped us setup everything we needed help with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harol I Rage",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T09:03:47.000Z",
          "Titre": "Great service fast response what else…",
          "Contenu": "Great service fast response what else can you ask.10-10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HBK Bino",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T06:21:46.000Z",
          "Titre": "Leaf",
          "Contenu": "Very respectful, Quick, Trustworthy and good customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kp inla",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T04:19:07.000Z",
          "Titre": "Best Serivce"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trevin Keli",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T05:29:02.000Z",
          "Titre": "W Hosting Great Team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron S",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T21:53:45.000Z",
          "Titre": "fast help when needed",
          "Contenu": "fast help when needed . very nicely setup hosting ! A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiden Myers",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T04:46:58.000Z",
          "Titre": "Very Good So Far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naiym Cooper",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T18:12:02.000Z",
          "Titre": "10/10 they get everything done im about…",
          "Contenu": "10/10 they get everything done im about 10 mins i will buy again"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Brime",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T05:16:17.000Z",
          "Titre": "Reliable Hosting",
          "Contenu": "Reliable Hosting with Fast & Great Support. Highly Recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaQuinn Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T18:36:17.000Z",
          "Titre": "Best VPS service",
          "Contenu": "Best VPS service ive had. Thanks for the good work"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "svanx on EU",
          "Nb_Reviews": 2,
          "Date": "2022-03-26T23:50:59.000Z",
          "Titre": "Honestly best host out there…",
          "Contenu": "Honestly best host out there #LLlovesKids"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Long",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T05:46:01.000Z",
          "Titre": "Very fast support",
          "Contenu": "Very fast support. Can't wait for the new VPS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gxblin",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T03:32:26.000Z",
          "Titre": "Best Hosting I've ever used"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STS guns",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T15:22:25.000Z",
          "Titre": "great support and a fast setup!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "somethingwong",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T07:18:24.000Z",
          "Titre": "Amazing company Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SNIPERGOD BASEYT",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T21:36:39.000Z",
          "Titre": "quick and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DALLAS",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T19:30:58.000Z",
          "Titre": "Pretty good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camary Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T02:02:21.000Z",
          "Titre": "Very professional and patient"
        }
      ]
    }
  ]
}