{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "gounitywireless.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffrey Pulver ScottyOtter",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:33:59.000Z",
          "Titre": "Disappointment in Unity",
          "Contenu": "I signed up for a phone giveaway. I was contacted by emails twice assuring me the phone would arrive in 7- 10 days. They even gave me the phone # saying i could make use of this number until the actual device showed up. I never used the phone #, i would use it when the device arrived. But it never arrived, contacting Unity they repeated that i would recieve the device in 7-10 days. Today has been near a month and still i have no phone and getting through to customer service is an automated system which actually loops back to itself when your selecting choices through the keypad. I am more than frustrated and can not endorse them as my primary phone carrier. Right now, i am hetting by with a VoIp app over the internet asy phone. Which does not act in the same manner as a personal phone does."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timmy Woodrum",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:08:18.000Z",
          "Titre": "I did not receive my package of my…",
          "Contenu": "I did not receive my package of my united Wireless cell phone I bought. I got an email stating that my package was shipped and delivered but I never did receive the package like the email stated. I bought an paid for the phone an never received it. I am very displeased an unhappy with the company an the service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Garry Hendrickson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T07:48:56.000Z",
          "Titre": "The truth in this government subsidiary...",
          "Contenu": "They lie from the start they never have any intentions of sending you anything free. Before you get totally enrolled there's fees. And the tablet they tell you is this that and another. And in turn you'll get a tablet that isn't worth the 10 bucks you gave them. And to try to call them and ask them about it they just hang up on you. They say all this about its a free program and they can offer it because of the government. Sure their so called free program costs you 10. From the jump then when their garbage breaks you get to spend more money as they reap the bennifits of the money being made from the government. And what I mean is when have you ever seen a company that's not making hardly anything off of something bennifit from it? Well in the 47 years I've been alive I havnt seen it once."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cherise Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:07:13.000Z",
          "Titre": "Keeps disconnecting my service every…",
          "Contenu": "Keeps disconnecting my service every month when I was told I only need to make a call or send a text. And they do it at night when you can't reach customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maira & Edwin",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T05:06:51.000Z",
          "Titre": "PROVIDER IS HORRIBLE",
          "Contenu": "THE WORST PROVIDER, CONSTANTLY IS GETTING TURNED OFF."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cele Chuy",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T21:05:52.000Z",
          "Titre": "I wish you could give 0⃣ stars",
          "Contenu": "I wish you could give 0⃣ starsI would certainly will give it to this Company they sell this phones with the name Hyundai what a price of crap I get one paid $60.00 for it and the Damm thing only worked for 2 Months, and when I contact them to close my account ASAP they give me all kinds of excuses for not closing it I had to contact them 2 times by phone and about 5 or 6 times via Email before they do something I even told them that I was going to get in touch with FCC I only have to say one thing STAY AWAY FROM THIS COMPANY isn't worth the agravavecion I would never use them I will tell anyone to STAY AWAY FROM THEM for they own good!! 👎🏼👎🏼👎🏼"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tylonne Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:47:24.000Z",
          "Titre": "Wow!!",
          "Contenu": "Wow!!You want to know my experience through Unity Wireless? Here you go… I signed up for the Acp program for the tablet with unlimited data but received a SIM card instead, so I figured OK the SIM card is supposed to go into the tablet, so I’ll waited for the tablet to arrive. The tablet never arrived, so I gave support a call. I was informed that I didn’t qualify for the tablet because I hadn’t paid for the tablet, (Miind you it advertises free tablet with unlimited data through the ACP program.)so I said OK I’ll pay for the tablet. They then sent me an invoice through my account with them, to pay for the tablet. Then came the waiting game for the tablet to arrive. I was so excited. I figured this would fix Everything. I was wrong. Once it arrived, I noticed, that the tablet I received was not the tablet that was advertised on their website. The tablet advertised already had the data applied to it, there was no Sim card needed. the tablet I received, however, was called “My Tab Pro.”But I gave them the benefit of the doubt I placed the sim card inside the tablet, only to have nothing happened. It kept telling me that I had no data, so I gave support a call, letting them know what I was experiencing with the tablet, and was told “we apologize. That was our fault. The tablet was not activated. If you’ll turn it off for 10 minutes and then turn it back on it should be fine”,so I did so. When I turned it back on and tried to use it, I still received the same message that I had no data.  I gave support yet another call letting them know what I was experiencing with the tablet, this time I was told to turn it off for 30 minutes. Only what they didn’t know is I already turned it off for 30 minutes and it still had not   worked. I knew it was not going to work. And so I called them back yet again but this time I was told shut it off again for a longer period of time and it should work, but please do not contact us through phone anymore contact us through the website. I’m thinking to myself. What is the phone number on there for, if we’re not to contact you through it? So now, here I am  stuck with a Sim card and a tablet but they’re charging I guess ACP for something that’s not even being used. And it’s my understanding that if you don’t use that Sim card you lose your ACP but you’re still charged by the company that you’re going through? so how do I get rid of this garbage? This is so not worth stress and that’s exactly what it’s giving me stress."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TENELLE",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:12:01.000Z",
          "Titre": "I switch from unity wireless to at&t internet and unity wireless switched it back…",
          "Contenu": "I switch out my service from unity wireless to at&t internet service. But some how unity wireless switch it back.  I no longer had the service because the account was inactive due to no usage. Which caused me to have to pay $32 when it should of been $0 for my internet service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley Poole",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T06:24:13.000Z",
          "Titre": "SCAM: Advertised FREE PHONE+ UNLIMITED DATA",
          "Contenu": "Advertised FREE PHONE+ UNLIMITED DATA. What I received: a tablet with 1gb data and it cannot even make or receive phone calls. LIFELINE+ ACP services are supposed to give a phone with talk, text and data. I messaged Unity customer service and even called them. They weren't helpful. They knew what they done and it was done purposely. I transferred out (within days) to SafeLink for an actual free phone with unlimited talk, text and data.You've been warned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Yancy",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T12:00:57.000Z",
          "Titre": "I can only imagine how it would be to…",
          "Contenu": "I can only imagine how it would be to own the tablet i was told i would be receiving, only to be told that \"if I was approved for the tablet, there would be a tracking number below,\" in which, there wasnt. No reason why i wasnt or nothing, but they want me to use a sim card, when i can just get a tablet and sim from somewhere else....senseless communication, all a waste of time.\"  It is fraudulent of any company to advertise that they are giving something away when they really aren't.   Misrepresentation of a product or service is a real crime and you guys are definitely guilty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keyera Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:56:45.000Z",
          "Titre": "I was told my tablet does not support…",
          "Contenu": "I was told my tablet does not support text and calling under the ACP which is bull crap . Yall need to send out phones smh"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Johns",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:41:27.000Z",
          "Titre": "My Tablet not working, after many attempt's.0",
          "Contenu": "After putting sim card, screen show's \"no Sim Card\" after several attempt's, by Support sent instructions for reboot, didn't work, \"no sim card\". Also eject not working. I took it to a repair shop, they got sim card out put sim card in still \"no Sim card\". I'm 73yrs old, disabled. When I received tablet, you deactivated my smart phone, now I have no internet access. Can't check my medical info, my bank info. Have talked to you 9/27, 10/7-12, 10/15-22,27-11/22-13. Please send replacement and how to send this Tablet back to you. Please help me get back on line. I've been in the hospital several times, stress not good. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Billy Jo cope",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T18:53:30.000Z",
          "Titre": "I'm having way too many I'm having way too many apps and I can't delete them and when I do they come backads pop up I…",
          "Contenu": "I'm having way too many ads pop up I can't hear people when I video chat I'm getting a lot of spam calls even though I block them they still get through. And my pictures that I saved on my gallery somebody's getting a hold of them and going through them and putting them on the internet I would like to have that stop somehow and I have more issues but they'll be enough for now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sadsad Americanwish I wasn't",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T14:08:30.000Z",
          "Titre": "Prom Night Promise... Just the Tip",
          "Contenu": "Can anyone tell me why this company is based in Florida and going cross country to California to hock their product which is cheap and unforgiving? Thanks for sending JUST A SIM CARD and the 100s of emails asking me to please order a device in which to use said sim card. I get that this is probably a fly by night operation and your taking advantage of the American tax payer but all yourself... are you a good person? My guess... you base the company in Florida for tax purposes... not uncommon for people to do when they have 20% legitimacy and need to accrue profits asap. Lax governmental control because ron DeSantis is a Spineless weasel who's only characteristic worth noting is his FAKE tounge smile (wierdo)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry Stokes",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T00:24:23.000Z",
          "Titre": "Non-working phone with bad customer service",
          "Contenu": "You must purchase the phone separately from the free SIM card. My phone has never worked in the month I have owned it. Several emails have gone back and forth and no resolution yet. So far, 3 SIM cards have been sent to me, but none of them worked. I asked for the purchase price of the phone to be refunded and I will send the nonworking phone back to them. Their response..... They are sending me another SIM card!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Utley",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:31:27.000Z",
          "Titre": "Worst company to do business with!!",
          "Contenu": "Worst company to do business with!!! Yes it supposed to be a free tablet.. Was approved,paid my initial money. Received tablet which did not work a still isn't working!!! I have made over 50 calls to customer service. Sent numerous emails and pictures to technical support, still no resolution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Arnold",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:43:08.000Z",
          "Titre": "You can sell me a tablet but you can…",
          "Contenu": "You can sell me a tablet but you can not give me wifi you a racket"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T08:18:27.000Z",
          "Titre": "I'm trying to get a free phone and they…",
          "Contenu": "I'm trying to get a free phone and they won't let me. When I get an email about 20,000 free phones, I can't seem to apply for one because I already have an account and a SIM card, they are very deceiving in their advertisement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Roysdon",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:35:48.000Z",
          "Titre": "I paid for a phone and it's  junk",
          "Contenu": "I paid for a phone and it didn't have a Sim card with it therefore I had to order another Sim card which took another week to get and when I tried the phone it was tore up . Either something happened in shipping or charging port or battery but either way it will not work . I contacted the company about it and instead of replacing my phone they wanted a bunch of pictures of it like that's going to fix it . I would not recommend that anyone order from. Them. I'll gladly change my review once I get the phone and sims card that I out paid for,  my address is 110 Slumber Rd Jamestown Tn 38556"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beth Alexander",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T19:45:07.000Z",
          "Titre": "I received the ox tablet",
          "Contenu": "I received the tablet, I wanted because it offered wifi. And after a week, I didn't have any service. Couldn't open any apps, after some research found out it was on a plan and only had a limited amount of data I could use. So now it's just another piece if technology that sits around gathering dust because it's useless for me to get done what I needed it for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julio Velazquez",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T20:20:48.000Z",
          "Titre": "I was only approved for a sim card why…",
          "Contenu": "I was only approved for a sim card only why is that'  wat am I supposed to do with a sim card and no phone I have a phone but it's locked so watch am I supposed to does there a way u can send me a phone with it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robinette Ruth",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T20:18:21.000Z",
          "Titre": "They tell you can get a free tablet…",
          "Contenu": "They tell you can get a free tablet government tablet and then when you sign up for their service they tell you have to pay for it and if you didn't pay for it then you've already got one which is a lie I've never received the tablet this is a scam if you ask me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Toya Bean",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T21:34:39.000Z",
          "Titre": "I got my package they said but it was…",
          "Contenu": "I got my package they said but it was delivered to my porch Noone sign it off or anything and I never received it I'm Pass..and they won't replace it I feel like they should because it's not activated yet or nothing I just don't have it and someone should have been able to sign it off not my package Get dropped off outside without me knowing that and someone took or something happened to it and I don't feel like it is fair"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AMANDA",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:52:21.000Z",
          "Titre": "I never received the tablet that I paid…",
          "Contenu": "I never received the tablet that I paid for. It was sent to my OLD address TWICE according to the customer support. But they would not issue a refund or agree to replace the order that I never received, although I had contacted support numerous times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:35:49.000Z",
          "Titre": "Never received the device I PAID for!!!",
          "Contenu": "I paid $20 to receive the smartphone they had advertised. It was delivered to a whole different state. And upon requesting it be replaced and sent to my correct address. I never received any feedback. I had my bank replace the payment. But Unity did not. Zero out of ten I do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ida Parks",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T19:12:27.000Z",
          "Titre": "I've never received a SIM card I got…",
          "Contenu": "I've never received a SIM card I got the phone it looks nice and everything but it froze right out the box it won't work I also sent $20 for the phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Louise Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T02:43:08.000Z",
          "Titre": "I paid $20 for a phone The phone has…",
          "Contenu": "I paid $20 for a phone The phone has never worked No one has gotten back in touch with me about how to send the phone back so I did got a one star because I lost $20 and y'all's free service sucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Flaugher",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:36:28.000Z",
          "Titre": "I had a serious issue with the shipping…",
          "Contenu": "I had a serious issue with the shipping of my tablet to the point it was sent back to shipper. I then tried 4 different times over a week and a half to write customer support and I still haven't received a response at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Works To Much",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:35:45.000Z",
          "Titre": "Said get free tablet well was denied so…",
          "Contenu": "Said get free tablet well was denied so what I do get a phone that was compatable to there sim low an behold didn't work so I'm out of a phone I tried cancelling the service didn't work this company been getting my benefits for what for free an i received what nothing didnt know they were getting it until today when I got denied for another service there not a fraud but there support is garbage thanks happy holidays"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T04:22:59.000Z",
          "Titre": "The worse company ever",
          "Contenu": "You are is not the best company you all send a phone without a Sim card and when you send a Sim card to go in it the Sim card doesn't work for the phone. How I suppose to use the phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffery Spahn",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T07:05:58.000Z",
          "Titre": "You find where you delivered my phone…",
          "Contenu": "You find where you delivered my phone you haven't put it on my doorstep you reimburse me for my money that I've spent to get Verizon another month extremely disappointed pissed off"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Jennings",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T14:31:48.000Z",
          "Titre": "Got nothing I asked for",
          "Contenu": "I applied and was approved. I told them that I had another provider involved in this program and they were supposed to help with that.well no word from them yet. I asked for a phone and they sent a tablet instead. Said it was delivered but I haven't seen it. Just started with them and I'm already not likeing them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wyndi Radcliffe",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:34:18.000Z",
          "Titre": "I bought a phone from y’all",
          "Contenu": "I bought a phone from y’all. Does not work. Will not even charge. On top of that I tried to finish my application for a tablet and it would not let me. Then I misplaced my enrollment number and sent numerous emails and absolutely no reply."
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Compxer Incorporated",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T08:51:44.000Z",
          "Titre": "Horrible experience I would never…",
          "Contenu": "Horrible experience I would never recommend this company I told them if they going to take my ACP they should give me a phone free if not to cancel it they use AI response as no human would repeat the same in the end they just send a SIM Card without a phone and took advantage of my ACP I would never recommend this company to anyone I hate it I will be complaining to ACP of this company and telling the rest of the world this company is a scam! Not to mention they only offer 5GB of data then goes slow again SCAMMERS!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus Hervey Marke aka Mark",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:09:10.000Z",
          "Titre": "I wasn't approved for a phone or tablet…",
          "Contenu": "I wasn't approved for a phone or tablet unfortunately yet I did get a SIM card that I couldn't use due to my phone being locked so nothing was done to satisfy me in using the Unity Wireless at all. I don't know what I needed to be able to get a tablet or phone for free but I wish the emails would stop reminding me of getting such free opportunity that I cannot get when I deserve one with all the unnecessary unfortunate situations happening during this hardship. And to only get either a phone or tablet by buying at a price I cannot afford is impossible since I have no income at all hence the reason why I was hoping for a free phone or tablet to help me through my situations. I see that even with me trying to get back on my feet to gain employment, get back into school and gain my own business would have to be put on hold until I can get something like a phone or tablet to help me out. If only someone has a heart to give and not think about the consequences of being helpful to a needy person like me would it help me to know hope still lives on this day and time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ekebo Oska",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T01:19:28.000Z",
          "Titre": "I hope that I'm gonna receive mine I'm…",
          "Contenu": "I hope that I'm gonna receive mine I'm happy to waiting"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Denise Black",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T01:50:12.000Z",
          "Titre": "No WiFi",
          "Contenu": "I am not understanding why I do not have WiFi automatically with this service, I only have talk and text...It's like carrying around a paperweight.If I cannot log into someone or somewhere WiFi passwords.When I am away from my house...What good is a cell phone service without WiFi...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Antonio b mann",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:45:07.000Z",
          "Titre": "No customer service",
          "Contenu": "I received the unity phone. Realized I couldn't make or receive calls. Called the tech number to get help and they want to charge me to get help! Is that what you call customer service?? I'm not satisfied and don't think others will be either!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tee",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T12:23:31.000Z",
          "Titre": "Unsatisfied",
          "Contenu": "I tried to sign into my account and it said I didn't have an account.So I was unable to connect.Than when I tried to go through my email I was unable to do that So I don't have a phone or anything and I paid for a phone, I don't even have, so I'd like to know just where is my phone? Somebody got a free phone at my expense  , further more I don't even  have a sims card, and when I try to go in and try to sign up again, guess what.....they said I already have an account.Very frustrating and just don't know what to do, I can't get ahold of them neither, ri try and fix the problem, because it says I don't have an account......  : o (I was very disappointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Salvatino D.",
          "Nb_Reviews": 8,
          "Date": "2023-11-15T16:48:11.000Z",
          "Titre": "You don't get the OX Tablet advertised",
          "Contenu": "I sent 2 different emails asking about a particular matter and both times, when I did finally get a response, it didn't say anything in regards to my question. I asked if I would be getting the tablet \"advertised\" on all their ads, or if I would be getting a different one. No answers and you have a co-pay for the tablets and I didn't want another tablet that is so slow and outdated that it's useless, and that's what I got. I didn't receive the tablet advertised, I received one that barely functions and doesn't have any of the specs advertised. Now I have to communicate with a company that doesn't like to respond and return this tablet because it's not even worth the $10.01 co-pay. You DON'T get the \"OX Tab\" advertised on all their ads!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:26:41.000Z",
          "Titre": "second worst acp/lifeline communications company ever.",
          "Contenu": "Applied for service Nov 17th... Was emailed and told I was approved and if my SIM card would ship and be to me in 7 to 10 business days. After 10 business days I called Unity to be told it shipped I it had plenty of time to get there so therefore I need to go check my mail because I must have misplaced it was talked down to to the point I felt this guy who had to put me on hold for 3 minutes just to find out where they ship my SIM card from, was straight up calling my a liar, after spending 2 hours on the phone and finally speaking to a supervisor I was assured that when they sent me the new replacement SIM card I would get a tracking number this time so that they can prove that they sent it and I would know where it was at in the mail of course I didn't receive any tracking number and finally on December 8th I finally received a SIM card though they collected the entire month worth of ACP benefit for November and the beginning of December without providing one bit of service then after my five gigabytes worth of high speed data was used up, which in this day and age doesn't take but a couple of days when you're watching streaming movies and TV shows on Hulu, Prime Video, Netflix etc even on data saver lowest quality picture possible...instead of being throttled down to the 128 kb per second like they one told me an email and two says on the website I'm throttled down to 1 to 6 kb/s every time I've attempted to email and ask questions of customer support I get end run around answers don't actually answer the question and I'm very disappointed with their service as a whole I would not recommend unity wireless to anyone ever bottom line. And now that it's been 30 days since I've had their service I'm going over to MetroPCS this afternoon and swapping my ACP program over to them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "joann rojas",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:26:40.000Z",
          "Titre": "Ok I got the acp phone and for some…",
          "Contenu": "Ok I got the acp phone and for some reason I can't make phone calls text receive and I don't got money to pay.and that's not right"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JANE MOORE",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T19:07:03.000Z",
          "Titre": "Didn't work for me",
          "Contenu": "I never could make it work. I don't understand why you send complicated things to physically handicapped people, but are surprised when they don't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colleen Julios",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T23:33:23.000Z",
          "Titre": "Nothing in the mail,, I pay 10 no tracking number all lies",
          "Contenu": "Hello nothing just stop the nonsense"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Monroe",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T21:20:01.000Z",
          "Titre": "I received a dummy SIM card in my phone…",
          "Contenu": "I received a dummy SIM card in my phone and I don't have a SIM card to put in there and I got in contact with claims to send me one to where I had my phone sent to in Texas. So the phone I have might go into somebody else's hands, because I'm pissed because I need an active phone for my primary doctor and my specialist, due to me having five autoimmune diseases COPD and pulmonary artery hypertension."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MARCUS",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:43:26.000Z",
          "Titre": "REPORTING TO FEDERAL TRADE COMMISSION",
          "Contenu": "I am reporting this company the UNITED STATES FEDERAL TRADE COMMISSION for defrauding the Federal government.  You are taking funds and not providing the services that have been agreed on.  When I called customer service about my data and voice being non functional I was lied to and told it was active! Well I assure that it is not and the rep had the audacity to tell me I needed to send and email then hung up the phone on me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "chad palmer",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T01:19:26.000Z",
          "Titre": "Lies.",
          "Contenu": "So for the last few weeks I've been communicating with unity Wireless and everything seemed promising and now it has been revealed that whoever has been messaging me has just been lying to me in order for me to get a better review. They claim they are sorry and apologize and want to resolve any issues but yet they don't follow through with anything they say. Beware of this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kay Dabney",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T04:09:37.000Z",
          "Titre": "Does me no good to have a SIM when I…",
          "Contenu": "Does me no good to have a SIM when I don't have money to buy a device to put it in I thought it cane with a device there was no point in even sending me a sim"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tiffany Hatmaker",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:39:00.000Z",
          "Titre": "I never received my order or a phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori Hyman",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T18:24:28.000Z",
          "Titre": "My phone worked wonderful for the first…",
          "Contenu": "My phone worked wonderful for the first 3 days until I let my neighbor use my phone and he gave them my name and now I can not call out txt or even use data. They say I would get a new sim card but it has been 5 days and still not able to use anything for Drs nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AppleRedd",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T06:56:10.000Z",
          "Titre": "As they lied I have not received my…",
          "Contenu": "As they lied I have not received my phone. I will not be joining this company in the future nor will I recommend this company to my friends or family. Duck Unity!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:04:55.000Z",
          "Titre": "I got an email saying I was approved…",
          "Contenu": "I got an email saying I was approved for a tablet and a discounted phone. After receiving the phone I now get another email explaining that I would only be receiving a sim card only and no tablet. The sim card is worthless without a tablet to run it. I really feel like I've been scammed. I continue to get text msgs now with emails rushing me finish shopping for the tablet that I now no longer desire. I wished I'd never tried this company. How long now will it take for me to stop getting all these f n emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MrChOpItUp",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:29:45.000Z",
          "Titre": "This company is nothing but clowns,I…",
          "Contenu": "This company is nothing but clowns,I had trouble every single time of every single day for over a week,and today is the first day I get to speak to a \"live\"person who I could barely hear or understand.Well now I'm really hotter than a .45 I'm thinking I've finally resolved my situation I have to call them back only now to get told the tablet is not eligible for where I live!,I give these people one star because I cant post without ratings least one.im sorry I cant really be honest and truly state what my feelings are in the proper language I'd prefer to use,but I guess all I can say is nothing good and also thanks for wasting my time! I'll definitely make it a point of to let people know about my experience with this place..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annette Means",
          "Nb_Reviews": 5,
          "Date": "2023-10-30T18:51:09.000Z",
          "Titre": "Why?",
          "Contenu": "I ordered one of the phones for this site for $20.00. It didn’t say limit 1per customer or anything like that and I did like the phone so I went back to the site to get one for my granddaughter. They let me purchase it no problem and then maybe a day later I received an email telling me my order was cancelled. Nothing else just your order has been cancelled. No reason why. Ok so it said I could reply to the message which I did just asking why they cancelled the order.  I sent an email to the support department to see why and no one will answer me or give me a reason as to why I couldn’t order another one. Not the worst situation I’ve encountered but irritating. So then post it limit one per person or whatever. Stupid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EMILY",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T18:10:30.000Z",
          "Titre": "They're paying for good reviews",
          "Contenu": "LIARS! I gave them 1 star originally for poor service. They emailed me to let me know if I gave them 5 stars they'd send me a new phone. I did as I was asked but they lied and now says my account has issues. Don't believe the ratings because they are paying people for good reviews."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danielle Younger",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T00:34:27.000Z",
          "Titre": "None working cell phone.",
          "Contenu": "I tried calling the customer service number but received no response. I paid for the $20 cell phone but it doesn't work at all. It doesn't power on.Please will someone reach out to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Smokeking",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T19:55:13.000Z",
          "Titre": "Horrible company",
          "Contenu": "They reached out to me about a negative comment stated that they will send me a free phone and a Sim card if I updated my comment. This service is not worth trying because my phone came. It did not work. I contacted them and nothing happened so please go to a different phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony McGahee",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T15:25:45.000Z",
          "Titre": "I bought a phone from you y’all But I don’t have a Sim card with a phone number",
          "Contenu": "I bought a phone from you all. You all did not send me a Sim card my phone number if you can reach me at right now is it 704-249-0046 I’ll try calling you online customer service but I never get through. I’ve tried five times. If you can help me with my Sim card I would gladly appreciate that with a phone number."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vickie Boudreaux",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T02:38:17.000Z",
          "Titre": "Where is the phone I paid for",
          "Contenu": "Where is the phone I paid for? I have written several emails and showed prove of my order with correct address.  Still no reply on what you are going to do about sending it to another state with wrong address."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Latia Simpson",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:01:37.000Z",
          "Titre": "I’ve been telling these people to stop…",
          "Contenu": "I’ve been telling these people to stop contacting me stop enrolling me in your program at this point it’s harassment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vickie Boudreaux",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T15:21:49.000Z",
          "Titre": "I paid for a phone and never received…",
          "Contenu": "I paid for a phone and never received it. I have written several emails for them only to answer saying it was delivered. It was delivered, but to a different address and a different state. I showed proof that I ordered and paid for the phone for delivery to my home. Still, they have only replied that it was shipped. So with a free sims card that I can't use, I strongly believe that this is not a trustworthy company. Stay away from this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam skinner",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T23:11:33.000Z",
          "Titre": "Well I ordered a phone still haven't…",
          "Contenu": "Well I ordered a phone still haven't received it don't think I'm going to receive it even though it put my my account too low to actually do the things that I had set up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T18:51:07.000Z",
          "Titre": "Garbage not even sure why I got this…",
          "Contenu": "Garbage not even sure why I got this Sim card in the first place and on top of that they shut off my previous service I am not sure what went on and what happened but I'm glad I don't rely on this service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Theodore B. Savage, J.D.",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T13:11:54.000Z",
          "Titre": "No Internet Service With Unity",
          "Contenu": "I received my tablet, and the Internet does not work at all. No service. Wasted money on a tablet, now gonna demand a refund, or file a small claim in Florida courts, and complaint with the FCC."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:37:47.000Z",
          "Titre": "I have a cell phone from y'all and it…",
          "Contenu": "I have a cell phone from y'all and it do not work I tried to send emails and picture of the phone and it will not work I am sending the phone back"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edmond Edgar",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T08:10:22.000Z",
          "Titre": "they offer tablets then only offer you…",
          "Contenu": "they offer tablets then only offer you a sim card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Borman",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T21:58:53.000Z",
          "Titre": "complete GARBAGE \"service\".…",
          "Contenu": "ever since I received my package in the mail my life has been ruined you sent me a phone a d tablet that won't activate at all.your support team gave done nothing to help me at all but provide useless info abd it's been almost a whole week.srill nothing.im taking to them right now thru text..still trying to get this garbage service up abd running.abd it refuses to activate my account.it savts I'm active in th website.but in my phone's it says no service abd disconnected.thus is pure garbage company in my opinion a d your support team are all worthless I want a complete refund.ir in taking you to court for messing up my mental health.ive got it all documented and ready to go to my lawyer if I don't get done kind of fix to this problem or a full refund.youve driven ne insane w rage a d made me miss my liver specialist appointment which was important abd now I'm dying because if it.so YOU ARE IN TROUBLE BIGTIME.my son is going to be the new owner after I die because of what happened here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T00:19:09.000Z",
          "Titre": "The ad said free phone not SIM card",
          "Contenu": "The ad said free phone not SIM card. Now I will be receiving a SIM card for nothing because I was not expecting the end results.. SIM card no PHONE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shanay Turner",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T23:17:18.000Z",
          "Titre": "I purchased a phone for $20",
          "Contenu": "I purchased a phone for $20, and it runs extremely slow. It cuts off, unexpectedly and It loads apps etc. extremely slow. I am not satisfied and I am extremely unhappy!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T04:32:48.000Z",
          "Titre": "2 to 12 emails daily...its so annoying",
          "Contenu": "I got my tablet and it works as it should. The problem is that I recieve between 2 an 12 emails a day tling me that I need to click it to activate service. I click on it every damn time and it says my service is already active. I regret signing up with Unity and turns out I can not cancel and go with another provider. I hope tbis helps someone. BTW, I have called and customer service says there is nothing they can do, to keep in mind that its free...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shelia Crenshaw",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T00:05:36.000Z",
          "Titre": "Well I called and got my phone…",
          "Contenu": "Well I called and got my phone activated and now it's not working again for some reason I can't make no calls or if she calls or nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annie Guzman Working mom",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T02:24:40.000Z",
          "Titre": "Worst customer service?",
          "Contenu": "I asked for help several times with an hour response. I still can't use the service lack of communication on your part."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Loretta Moreno Brewer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:22:27.000Z",
          "Titre": "Told me I qualify for a tablet",
          "Contenu": "Told me I qualify for a tablet, but then had to reapply and now it's telling me something different. IDK"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 3,
          "Date": "2023-11-04T22:53:53.000Z",
          "Titre": "I was told that I would get a phone or…",
          "Contenu": "I was told that I would get a phone or tablet and all I got was a chip that I can't use it is misleading the way they are doing business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Newsome",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T21:18:52.000Z",
          "Titre": "i got the phone and it will not charge…",
          "Contenu": "i got the phone and it will not charge or come on, i can not use it at all, the phone i did have is falling apart can yall help me please i really need a phone, ,i wish yall had a number where i could talk to somebody. Please help me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vickie Boudreaux",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T17:58:36.000Z",
          "Titre": "Paid for phone and never received it",
          "Contenu": "It's been well over a month and many emails to this company for a phone I paid for, but never received. Only after leaving a bad review, do I hear from them. They have said that I will receive a phone for free, lol, once I remove these reviews. It's not that easy. My point is that I PAID for this phone, so once you send it to me, I'll remove this. They sent the free sim to my address, but when I paid for a phone, it was so say, sent out of state. I have sent them a copy of my receipt with my shipping address, still no phone. So, I'd be very cautious about paying for a phone through this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:16:06.000Z",
          "Titre": "Was told I was getting a phone and…",
          "Contenu": "Was told I was getting a phone and tablet if I paid 20 dollars never received tablet just phone you shouldn’t trick customers into buying things and not send it especially those of us on fixed income"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Madagan",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:19:20.000Z",
          "Titre": "Tablet terrible experience. Nothing but lies.",
          "Contenu": "Do not deal with these people they suck. They keep giving me the runaround for over three weeks now telling me they’ll send a tablet back-and-forth every day. They had me go back and change the bad reviews to good reviews which I did and still no tablet. I am done with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaac Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T03:30:20.000Z",
          "Titre": "No network is available.I called…",
          "Contenu": "No network is available.I called customer service and told me ( I did not use the service for one month).I have got the phone just a week  ago.!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jodi Schnell",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:02:04.000Z",
          "Titre": "I was told I would receive a tablet…",
          "Contenu": "I was told I would receive a tablet from you and I haven’t. I can’t log into Unity wireless to look at my account either. It tells me I am a duplicate subscriber."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly Baumgartner",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T08:37:30.000Z",
          "Titre": "I love the tablet...service isn't to par!",
          "Contenu": "I love the tablet. But as we all know not everyone is gifted with wifi. The tablet is perfect for 15 bux. But I can't even use the thing. No signal. I don't even have a phone app. I have a number and it shows in info on tablet but no way to use the tablet without internet unless I'm googling something. An that even takes 20 min to load. I paid 15 bux for the tablet. Idc I like it. Just wish I could actually use it. Like intended. Trying another provider maybe?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "olivia florez beard",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T17:49:50.000Z",
          "Titre": "recived a phone i paid for and a sim…",
          "Contenu": "recived a phone i paid for and a sim card in it and unable to get it working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DANIEL",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T19:44:11.000Z",
          "Titre": "I cannot get any service at all no…",
          "Contenu": "I cannot get any service at all no matter where I go even if I have full service it says for some reason it just doesn't want to work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cherry Ann Sandoval",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T06:09:15.000Z",
          "Titre": "I can't dial out I haven't received my…",
          "Contenu": "I can't dial out I haven't received my phone I bought cause I don't get service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deirdra Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T04:40:44.000Z",
          "Titre": "Trash Company",
          "Contenu": "I got the phone and the Sim card don't work. No one is trying to help me fix this issue. I would not recommend this company to anyone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley L. Wise",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:05:29.000Z",
          "Titre": "I didn't get a tablet so this is a lie"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Holly Howland",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:42:10.000Z",
          "Titre": "I paid for a phone it was shipped to…",
          "Contenu": "I paid for a phone it was shipped to wrong address. I tried to call every number I could find and can not talk to a real person. I have sent emails with no response! I want my phone or a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unity Wireless User",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:50:45.000Z",
          "Titre": "First",
          "Contenu": "First, you send me a SIM card without any type of device. Then I PURCHASE a phone for use on my account sent to my address and receive it with NO SIM CARD. I am STILL waiting on a SIM CARD. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe kolnick",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:26:44.000Z",
          "Titre": "No stars I didn't get phonewant refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dustin Snow",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T07:16:14.000Z",
          "Titre": "I still haven't received my Sim card so…",
          "Contenu": "I still haven't received my Sim card so there for I haven't even been able to use the phone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:21:29.000Z",
          "Titre": "Unsatisfied",
          "Contenu": "Wanted the tablet, got the SIM card instead. Not happy at all!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ily Vazquez",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T08:26:04.000Z",
          "Titre": "Down grade",
          "Contenu": "I got a phone nice big and perfectPhone just stop working and customer service won’t do anything sucks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOE",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T09:31:21.000Z",
          "Titre": "I can only use tablet when around Wi-Fi…",
          "Contenu": "I can only use tablet when around Wi-Fi it doesn't work when we're not around Wi-Fi which defeats the purpose of having it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JACK",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T07:04:06.000Z",
          "Titre": "the phone suck a waste of money.",
          "Contenu": "the phone suck a waste of money.. it broke on the 5 daY I CANT HEAR ON ITI CANT DOWNLOAD PAYPAL AP THIS PHONE CAMERA IS THE WORST I HAVE EVER SEEN .TAKE IT OFF THE MARKET NOW,PLEASE POST MY REVIEW."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Shellabarger",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:15:51.000Z",
          "Titre": "I never received any service ore a…",
          "Contenu": "I never received any service ore a download app don't know where to go to get it done"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peedy",
          "Nb_Reviews": 17,
          "Date": "2023-10-17T05:14:51.000Z",
          "Titre": "UNITY WIRELESS IS A SCAM",
          "Contenu": "UNITY WIRELESS IS A SCAM! I THINK THEY ONLY WANT OUT INFO. I DIDNT RECEIVE NO TABLET. I RECEIVED A SPY SIMS CARD. THEIR SO FULL OF S---!N THE CUSTOMERS ARE JUST AS FAKE! THEY NEED TO BE REMOVER. FAKES! FAKES! GOT DAM PUNK ASS FAKES! BBB NEED TO REMOVE THEY ASAP!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Garner Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T04:57:13.000Z",
          "Titre": "the Internet data",
          "Contenu": "I like it alot but the Internet data is bad like its buffering other than that I like it's jus wen not on WiFi getting on the web on to a app or whatever takes forever or just say no Internet connection or check it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Williams",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:03:35.000Z",
          "Titre": "Your customer service people are very…",
          "Contenu": "Your customer service people are very disrespectful and rude I was sent a chip for a phone but no phone I will send a B8L 2022 tablet which does not work I have been calling around for 2 days straight and got no answer on who sent me this tablet and why it does not work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T15:21:55.000Z",
          "Titre": "The service is very slow",
          "Contenu": "I've been contacted by unity wireless for the problem, and they're going to fix the problem for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "April GUillory",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T11:05:44.000Z",
          "Titre": "You guys emailed me twice and told me…",
          "Contenu": "You guys emailed me twice and told me my iPad was on its way. I called customer service and they told me they were sending me Sim card. For what? Now air talk emailed me and said they already transferred my service with them off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "P.O.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T07:52:46.000Z",
          "Titre": "The HURRY UP & WAIT GAME",
          "Contenu": "Well I had to purchase the phone which took over 2 weeks to receive, it's did not come with a SIM card, so I had to reach out to you all and order one, that took another 10 days, so about a month before I could use the service!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GLT",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T06:30:15.000Z",
          "Titre": "Keep Looking - This ain't the answer!",
          "Contenu": "At best? Incomplete information in advertising. At worst? They just straight up lie. $15 smart, branded tablet - they said. UNLIMITED talk, text & data - they said.The reality is...1. $15 is accurate. 2. Smart? Jury's still out. My son works in an I.T. department and we'll begin day 3 of trying to set this thing up tomorrow. 3. Branded? With a name no one knows.4. Unlimited? Talk & text?...apparently so. Data? 3 GB worth per month. After that, dial-up speed.Now, they're kind enough to sell you data at $10/GB. If I can afford that, I'm not qualifying for this thing. 5. The battery on this tablet drains exactly 3 times as fast as my OLD Samsung.Bottom line...talk & text may be OK. But if you need data connectivity, this is not the answer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Layton",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:50:00.000Z",
          "Titre": "I was wanting to sign up for the tablet…",
          "Contenu": "I was wanting to sign up for the tablet that they offered but when I went to the next window all they would offer me was the SIM card and I didn't need a SIM card I already have a phone and a SIM card I was needing a tablet so it's not really pleased"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracy DeSteph",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:13:24.000Z",
          "Titre": "cell phone no service",
          "Contenu": "Got a cell phone and tablet and no active service. I never got any minutes for the phone to function and it's no help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bridgette Geise-Cronin",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:37:40.000Z",
          "Titre": "The service is sketchy at times",
          "Contenu": "The service is sketchy at times. The phone I had to purchase is slow and laggy...the battery drains super fast. Have to charge every day."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Nielson",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:02:59.000Z",
          "Titre": "I can't make a call on the phone all I…",
          "Contenu": "I can't make a call on the phone all I got is internet and that's about it I'm about ready to give up but the thing in the trash c"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "shesosly",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T04:03:47.000Z",
          "Titre": "I still cant use the service because…",
          "Contenu": "I still cant use the service because the phone I \"paid\" for is probably the worst phone Ive ever had. It doesnt charge for ever, and doesnt hold a charge for more than 3 or 4 hours . Its sickenly slow, and hard to type on!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Misty",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T01:06:37.000Z",
          "Titre": "First off I think the free tablet is a…",
          "Contenu": "First off I think the free tablet is a scam cause not only did I not get a tablet but they didn't supply a phone instead I got a sim card then they gave me a Kansas number and I live in Missouri and refuse to give me a Missouri area code which makes my service slow ! When I called to get a 816 number unity wireless insists that the rural community I live in which is about over 100 miles from the area that the Kansas area code 913 is supposed to be used..The whole reason for me getting a life line phone is that I can't afford a cell phone on my budget as I am disabled living below the poverty line and my family that would call me can't because they don't have long distance on their landline phones. This company isn't open on the weekends and I know for a fact my zip code is not in the 913 area code.. I'm gonna look into different company that is if I can actually get online.. (edit) this review took all of my data cause my phone constantly on roaming. Because I live in the 816 area code which is Missouri.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rhonda Warren",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T07:35:01.000Z",
          "Titre": "I still don’t have my SIM card so I…",
          "Contenu": "I still don’t have my SIM card so I can’t use my phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phish",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:23:47.000Z",
          "Titre": "It seems very difficult to place call…",
          "Contenu": "It seems very difficult to place call on my tablet. Call quality is subpar even with headphones. Tablet runs kind of slow but that’s understandable as it’s 4G. I’m happy for the fact that I have Internet access now but I still cannot use tablet outside of my home. Calls will not go through and I cannot access the Internet when I leave my apartment. I have called customer support and emailed them on several occasions we’ve reset my tablet numerous times to no avail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anita Faulkner",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:17:46.000Z",
          "Titre": "No incoming calls or making calls",
          "Contenu": "When I got my tablet in mail and unbox everything I could not make any calls or receive any calls, I called guys which wasn’t much help. I did everything that was necessary and what you guys told me to do and still yet nothing works as far as making and receiving calls which I’m not pleased about at all, I gave up on calling you guys cause every time I called it was the same thing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MARTY",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T02:59:56.000Z",
          "Titre": "Nothing Is For Free",
          "Contenu": "I thought I was receiving a Tool to help broaden my horizons but I have spent more time with the Tech guys trying to repair my Nee Tablet than actually using it for more important purposes. I must say I have a very nice Paperweight. I’ve asked for a return label & a difference tablet but it has fallen on deaf ears. Now I’m repeating the same Tech Techniques againI did not get it for Free, I did pay for it, not much but used my funds for this beautiful Paperweight, I’m not upset, I’m thankful, I hope the majority of you are enjoying your new tablet. I wish I could check the box at the bottom of the page, but I can’t."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gilberto Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T07:35:28.000Z",
          "Titre": "I  missing my tablet and my chip for my…",
          "Contenu": "I  missing my tablet and my chip for my phon????"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurel",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T22:16:23.000Z",
          "Titre": "Wanted a tablet but it didn't work out",
          "Contenu": "I applied for a tablet and was told they're sending me a SIM card. This makes no sense.I just got a free tablet from Excess Telecom instead. Maybe try them. But to be honest, lately it won't come on after charging. And after it had worked beautifully for about two months.Although I can't afford it, I am considering just saving up to buy a brand new tablet on my own at Montgomery Wards' website or something.I make less than $40,000/year and on disability and I have to pay for everything out of that, rent, food etc. But Montgomery Wards' has a payment plan and I'm just not getting any success with these \"free\" offers.~Laurel"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tashie Hudson",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:35:29.000Z",
          "Titre": "I didn’t get SIM card for my phone if…",
          "Contenu": "I didn’t get SIM card for my phone if you have better instructions about everything it is containing in the package"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ISATOU",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T02:04:52.000Z",
          "Titre": "My issue was NOT resolved...",
          "Contenu": "My issue was NOT resolved despite following the instructions. My mobile service still doesn't work! I experience low quality sound and the tablet freezes often. Cheap quality! I guess what can you expect for such a low cost product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charladane Bradley",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T02:40:25.000Z",
          "Titre": "I really like my tablet the only bad…",
          "Contenu": "I really like my tablet the only bad thing about it is the data is an unlimited. I can talk and text Unlimited but to be able to watch something while out and about if I'm not connected to Wi-Fi one movie will suck up all of the data so, I very seldom take it out and about because I like to watch my movies so I keep it at home connected to my Wi-Fi so sometimes it serves a purpose but when. I really and truly need it to go somewhere or do something. I can only call or text can't watch movies can't watch TV on it not enough data."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Linda Charles",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:25:31.000Z",
          "Titre": "You never sent me my cord for my…",
          "Contenu": "You never sent me my cord for my tablet,I got the tablet but it came with no cord"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KYLE",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T00:29:07.000Z",
          "Titre": "Not great when connectivity while…",
          "Contenu": "Not great when connectivity while traveling. Screen cracked when it was exposed to heat. No way to order a replacement online without going thru the process of getting service again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ms Cint",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:37:22.000Z",
          "Titre": "I got this tablet and nobody seems to…",
          "Contenu": "I got this tablet and nobody seems to call me back or e me back in regards to the fact that I can't use it it's asking for a phone number that I don't have. Or brother is asking me to connect to a phone that I don't have I'm assuming this thing is refurbished because it's asking for a ID of a phone that does not belong to me. I've emailed and called and got nowhere. Thank You"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alan Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T07:05:37.000Z",
          "Titre": "Service",
          "Contenu": "Would be good but haven't got a hold of customer service.  Phone won't  let me turn on service, so can't use it yet!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANDREW",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T04:17:57.000Z",
          "Titre": "As I stated when i first received the…",
          "Contenu": "As I stated when i first received the tablet, the tablet is nice but I have such limited service in this area rendering it basically useful only over wifi. I asked if there was a way to change service company but never received a response."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MIGUEL",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T08:22:27.000Z",
          "Titre": "Well,I purchased a tablet from you guys…",
          "Contenu": "Well,I purchased a tablet from you guys and to be honest the tablet wasn't what I expected.I got the tablet and within 3 days the screen had broken. It seemed like just touching the screen would scratch it,these tablets are nothing compared to Samsung tablets which are always sturdier built! To make matters worse I emailed customer support and asked if maybe I could get a free phone(since i knew getting a tablet replaced for free was out of the question)and the kindly said I could purchase a phone from you guys which are the same phones assurance wireless and safelink wireless offer for free.I tried using the Sim card from my tablet(unity wireless sim)and I couldn't be more disappointed,the service is awful,definitely not 4G it's more like 2G.With that being said I think I'll try one of the other phone companies in the near future,thanks but no thanks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HEIDI",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T22:42:02.000Z",
          "Titre": "Our first month was Awesome!",
          "Contenu": "Our first month was Awesome!! But as each month goes by the internet access has been terrible! It runs slow & most time it is that dreaded circle of death!! Becoming very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JASON",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:05:18.000Z",
          "Titre": "I was in a pinch where I didn't have…",
          "Contenu": "I was in a pinch where I didn't have extrs money for a tablet or bills and needed one for my new jobDownside I was lied to live in person when I asked to determine that the tablet was 5G I was assured that it absolutely was when I got the tablet it was not 5G I rarely got signal enough to use it for what I wanted to use it for because of this"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LISA",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T15:05:26.000Z",
          "Titre": "My first tablet broke and I utilized my…",
          "Contenu": "My first tablet broke and I utilized my warranty to get another one. But the second tablet wasn't the same as the first tablet. The first tablet had internet service and I could make phone calls from it but the second tablet is just a plain tablet. I wanted one like the one I bought in the first place. I was told by unity wireless that your tablets don't come with internet and telephone but my first one had it so they lied to me. So my warranty wasn't very good because it didn't give me a tablet as good as the first one."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "REBECCA",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T07:04:21.000Z",
          "Titre": "I can’t use the device",
          "Contenu": "I can’t use the device. I cannot make calls and it gets no signal. My girlfriend had a hot spot through T mobile that works great.  I can only assume it’s because I have a balance through T mobile. I won’t pay it because I spent over two hours on the phone reaching an agreement after I started service with them and they shut me off because they no longer offered the plan their sales people gave me. At that point the service should have been free but after we came to an agreement I received my bill which did not reflect what I was quoted.  Truly not interested in spending 2 more hours and having the same thing happen again. I would rather switch to the hot spot device or switch Carrie’s if I find my experience to be the same as the tablet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mercedes Carr",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T17:10:59.000Z",
          "Titre": "Should be able to switch from a cell…",
          "Contenu": "Should be able to switch from a cell phone to tablet easy or ya sim works for both and coroner service rather it be online or email don’t reply or get back to u in timely fashion"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beverly Duran",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T15:28:36.000Z",
          "Titre": "I rarely use it cuz it's been hacked",
          "Contenu": "I rarely use it cuz it's been hacked, etc.The reason I got it was for my 9 yr old granddaughter.I am raising her as my own.She needed tablet for technology class but doesn't use it because got damaged by hackers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dmi Mulholland",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T01:11:03.000Z",
          "Titre": "I paid for a phone but did not get a…",
          "Contenu": "I paid for a phone but did not get a SIM card?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EDWARD",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:12:55.000Z",
          "Titre": "I am unable to do anything with the…",
          "Contenu": "I am unable to do anything with the tablet. Claims that I do not have an internet connection. And therefore it will not let me do anything. We even tried using it for the camera outside. And I'm unable to get it to properly link."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Craig Dubs",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T02:41:24.000Z",
          "Titre": "Terrible service",
          "Contenu": "From powering on it takes way to long to do anything!! Once running I get thinking circles all the time! T mobile service isn't very good where I live,but I've called you 2-3 times to correct it!! You need good ENGLISH speaking CSR's, out serving is bad!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bernadette WHITEHEAD",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T18:34:59.000Z",
          "Titre": "Phone stop working I call was told I…",
          "Contenu": "Phone stop working I call was told I would receive another and send my phone back I called again after the phone didn’t come and was told my warranty had expired"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CYNTHIA",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:00:33.000Z",
          "Titre": "You sent me a tablet that the sim card…",
          "Contenu": "You sent me a tablet that the sim card doesn't work and now I'm waiting for you to send me a new SIM card, so I can hopefully activate my tablet and use it like it's intended! And I won't be able to activate it in time, so I will probably have to go through the whole process again, just to get what I was promised the first time, except waiting on a new SIM card really messed up the timing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LAURA",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:49:58.000Z",
          "Titre": "Your customer service is bad and the…",
          "Contenu": "Your customer service is bad and the bars or reception on your tablets is slow.  Plus i cant put updated app on my tablet because its an old tablet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KEVIN KILMER",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:10:41.000Z",
          "Titre": "WHAT EXACTLY WAS I SUPPOSED TO RECIEVE?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "EMMA",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:58:18.000Z",
          "Titre": "Bad customer service",
          "Contenu": "Bad customer service. I been calling and asked to speaker to a supervisor, cause the lady was so rude and she tells me she can’t transfer me to a supervisor, I have to call back. When I call back no one answer the phone"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PRESTON",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T16:04:10.000Z",
          "Titre": "I did take the plastic off of the screen it’s the paper that was stuck on the screen that want come off the screen",
          "Contenu": "My tablet stays freezing up and when I got my tablet they put the sticker on the screen and I couldn’t get all of it off there so my screen still has some of the sticker on there"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KB",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T23:28:30.000Z",
          "Titre": "It's alright",
          "Contenu": "The tablet is slow at times, will freeze up to where I have to turn it off and restart it and it doesn't work well without wifi. So that's disappointing. The deal was good, it was only $10 & some change even though it said free in the ads. I haven't dealt with customer service but it's an alright tablet. You get what you paid for that's for sure!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SETH",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:27:02.000Z",
          "Titre": "Opened the box and everything was not…",
          "Contenu": "Opened the box and everything was not protected, Sim card was already put in but wrong way. And I thought it came with its own provider, but has to be hooked up to wifi to work, would not recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dorothy Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T16:42:32.000Z",
          "Titre": "They don't listen",
          "Contenu": "I already have a phone through q Link wireless. I approached unity about a tablet that I found out I was not eligible for and I accepted that I was perfectly all right with it. They decided to send me a SIM card and I guess that automatically made me a customer now they are sending me emails and texts about using my phone activating my phone and all kinds of ignorant stuff. I told unity wireless I already am a customer with q Link I do not want the phone I do not want their service I am fine they responded in an email explaining to me why I did not get the tablet which I accepted and accepted my information that I'm already a customer with q Link. I asked to be taken off list to be removed as a customer so far they have not done so they are continually sending me emails about using my phone and other stuff about a phone I don't want or their service and as of this review they have not done what they said they were going to do I would not recommend unity wireless to my worst enemy"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "STACY",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:28:16.000Z",
          "Titre": "You all never got back with me when I…",
          "Contenu": "You all never got back with me when I told you all that my tablet wasn't charging and I sent pictures like you all asked and I never got no response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SANDRA",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:03:04.000Z",
          "Titre": "Unhappy",
          "Contenu": "After 2 months the tablet quit working an your customer service sucks. Told me to charge it, btw it was charged and then told me I was ineligible to get it replaced."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SONYA",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:34:03.000Z",
          "Titre": "Tablet and phone mixed I'm over it",
          "Contenu": "Kept having to call and have them reconnect my service cause it kept going out. I just stop using it missed to many important calls"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Iris Boyd",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T09:51:50.000Z",
          "Titre": "When I signed up",
          "Contenu": "When I signed up, I was under the impression that I could use my own cellphone but The SIM card sent to me  doesn’t work with my iPhone. I  inquired about it but was denied a new SIM."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shaun Brown",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T22:55:42.000Z",
          "Titre": "Unity wireless is not that bad wish I…",
          "Contenu": "Unity wireless is not that bad wish I could sign in to unity wireless and use my phone for calls not text plus but otherwise it's okay"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SHAWN YATES",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:02:21.000Z",
          "Titre": "Sad face",
          "Contenu": "The service is not really good like i was hoping for beautiful tablet but u need free wifi to bring it to life big disappointment"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ASHLEY",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T03:10:50.000Z",
          "Titre": "I paid for the 15 dollar plan with…",
          "Contenu": "I paid for the 15 dollar plan with unlimited data n I only get 7gb of data the internet slow and it's not unlimited"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SUE",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:09:38.000Z",
          "Titre": "Make sure you can get the internet and service at your location",
          "Contenu": "Can’t get your internet at my location. I have the tablet not the phone. The battery is short lived and the program is hard to and confusing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adrienne Ross",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T10:04:25.000Z",
          "Titre": "I'm thinking y'all ran out of tables…",
          "Contenu": "I'm thinking y'all ran out of tables cause all was offered was the sim card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "STEPHEN",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:21:03.000Z",
          "Titre": "Needs help",
          "Contenu": "Cannot do anything if only connected to t mobile.  Have to have Wi-Fi connected and this tab still runs slow"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TRAVIS",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:37:11.000Z",
          "Titre": "My Internet is always going out",
          "Contenu": "My Internet is always going out. Can't make or receive calls in area where I have full coverage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JENNA",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T22:41:07.000Z",
          "Titre": "Great for those who don’t need internet connection or play games.",
          "Contenu": "The tablet and service is ok for those who don’t need reliable internet connection, don’t play games, and don’t need much memory."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "VEOTIS",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T05:29:20.000Z",
          "Titre": "I have call and told you that I can not…",
          "Contenu": "I have call and told you that I can not use the calling on my tablet it will not work I ues the tablet with WIFI the tablet doesn't have service to go online with the sell service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ELIZABETH",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T03:04:53.000Z",
          "Titre": "It's not allowing me to do anything on…",
          "Contenu": "It's not allowing me to do anything on my device I can't access the Internet nor make any calls"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GAVIN",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T22:44:13.000Z",
          "Titre": "Quick delivery of the SIM card, but I didn't have a phone to put it in.",
          "Contenu": "I still have not inserted my sim into a phone that I don't have. I requested that I get a smartphone however all that was received was a Sim card. The SIM card was sent in a very nice box however. That was good."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FREDDIE",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T07:03:58.000Z",
          "Titre": "My tablet broke and I couldn't get in touch with anyone to get it fixed",
          "Contenu": "My tablet broke and couldn't get in talk with anyone to try to get sent in to get it fixed to resolve the issue with it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "master card",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T06:05:17.000Z",
          "Titre": "Reception I can't",
          "Contenu": "Reception I can't do anything on here but make calls. Streaming music isn't easy..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NANETTE",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:40:18.000Z",
          "Titre": "The customer service & tablet quality",
          "Contenu": "The customer service I have no clue haven’t really needed them but as for the tablet it doesn’t work well it deletes all the apps I put into it and to turn it on you have to hole the bottom for a minute or longer for it to just turn on"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stuart Abel",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T05:30:57.000Z",
          "Titre": "You have a slow connection some of the…",
          "Contenu": "You have a slow connection some of the stuff on the internet web sites will not load correctly and sometimes it appears that the connection is not working at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T05:53:06.000Z",
          "Titre": "Remind to many times to make sure to…",
          "Contenu": "Remind to many times to make sure to connect each month to keep services even though I use it just like you say"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Evelyn Monell",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T21:01:54.000Z",
          "Titre": "The signal is not very strong",
          "Contenu": "The signal is not very strong, and i cant use the phone, it always says i have a message but i cant retrieve the message.Very complicated to use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOSIE",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:58:42.000Z",
          "Titre": "no internet service",
          "Contenu": "This device still does not have it's own internet. I have called twice and the issue remains unresolved."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CARRIE",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T00:24:12.000Z",
          "Titre": "When I received my tablet it did not…work",
          "Contenu": "When I received my tablet it did not work the charger prong in the inside was broke so I just have a dummy tablet and the represenative said nothing they could do after months and months of dealing with this issue"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gwendolyn Wilkins",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T16:02:19.000Z",
          "Titre": "I'm not having good service it's very…",
          "Contenu": "I'm not having good service it's very complicated for me"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "BRADEN",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:15:11.000Z",
          "Titre": "No service with out wifi connection",
          "Contenu": "My tablet doesn't work with out being. Connected to Wi-Fi I'm not sure what to do I have tried everything"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janice M Cook",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T01:35:32.000Z",
          "Titre": "I have no signal to use my phone to…",
          "Contenu": "I have no signal to use my phone to text or make calls"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANGELA",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:44:09.000Z",
          "Titre": "Someone else must have had my tablet…",
          "Contenu": "Someone else must have had my tablet because I keep getting texts and strange voicemails"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ida Singleton",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T14:12:54.000Z",
          "Titre": "I still can’t make any calls on my…",
          "Contenu": "I still can’t make any calls on my tablet! It says network busy, I followed the instructions given to me and still the same"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KIMBERLY",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T00:24:15.000Z",
          "Titre": "It works great as a cell phone as far…",
          "Contenu": "It works great as a cell phone as far as using it to surf the Internet it does not work without Wi-Fi"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SHIKIYAH",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T18:16:39.000Z",
          "Titre": "When I recieved my tablet",
          "Contenu": "When I recieved my tablet, there was a sticker stuck to the screen and I had to scrape it off the best way I could."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kirstie Fain",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T23:21:35.000Z",
          "Titre": "Cancelation of service within 6 days",
          "Contenu": "If I go 6 days or longer my service is canceled & it's supposed to be a monthly service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:10:09.000Z",
          "Titre": "I am supposed to get unlimited data but…",
          "Contenu": "I am supposed to get unlimited data but it stopped working. No data left. What is up with that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MB",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:21:46.000Z",
          "Titre": "Your business wouldn't replace my…",
          "Contenu": "Your business wouldn't replace my tablet when I called and informed your staff that I was having issues with my tablet that it wouldn't allow me to touch and use my screen I thinking the touch sensor I called and complained 2times your staff only offered me a deal to pay 85.00 for a replacement and informed me that your business don't replace tablets that I only get a one time device free not good customer service at all for your customers I will inform everyone about not using this wireless service and issue they will have"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANDRE",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T23:40:54.000Z",
          "Titre": "The wifi to this tablet is intermediate…",
          "Contenu": "The wifi to this tablet is intermediate at best the table functions well when connected to outside wifi service but its internal wifi leaves much to be desired"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CHARLENE",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:53:43.000Z",
          "Titre": "Looks can be deceiving",
          "Contenu": "The tablet I received has very poor internet connection, and I can only talk on it with headphones attached, customer care suggested I download a texting app to make calls , but it still only works with headphones"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JENNIFER",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:49:57.000Z",
          "Titre": "I don't have WiFi with y'all although I…",
          "Contenu": "I don't have WiFi with y'all although I was told I did customer service sucked"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CARL",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T01:24:51.000Z",
          "Titre": "Most of the time I cannot get on the…",
          "Contenu": "Most of the time I cannot get on the internet with it. Bad connection, no data speed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pamela Brewster",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T13:19:03.000Z",
          "Titre": "Lack of quality",
          "Contenu": "Phone is made of very very poor materials and put together very poorly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jermane Davidson",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T21:51:28.000Z",
          "Titre": "Slow in Mo.",
          "Contenu": "This tablet is so slow and takes so long to do anything on it. I mean I like it just wish it was faster and the battery dies really quick."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NATASHA",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T02:51:53.000Z",
          "Titre": "My table doesn’t work without Wi-Fi",
          "Contenu": "My table doesn’t work without Wi-Fi. As well as the sound doesn’t work unless I’m using a speaker. Is there anyway to get a new device???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TAHIMA",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:03:09.000Z",
          "Titre": "Bitter sweet",
          "Contenu": "U can’t download app’s the internet service is poor"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carol Allyn",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T20:15:38.000Z",
          "Titre": "The phone number doesn't work!",
          "Contenu": "The phone number doesn't work!! It won't call or accept calls!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DETRIECT",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:13:32.000Z",
          "Titre": "Hello my tablet is glinching and can't…",
          "Contenu": "Hello my tablet is glinching and can't make phone calls or receive calls."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sabrina Holt",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T18:28:19.000Z",
          "Titre": "No phone number",
          "Contenu": "I have no phone number"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NATHAN From Iowa",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T21:50:19.000Z",
          "Titre": "Tablet is pixelated pretty bad not very…",
          "Contenu": "Tablet is pixelated pretty bad not very good picture quality"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NIEMAH",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:34:31.000Z",
          "Titre": "My tablet never works outside of WiFi…",
          "Contenu": "My tablet never works outside of WiFi as promised"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "vw",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T22:04:43.000Z",
          "Titre": "connection lost connection slow…",
          "Contenu": "connection lost connection slow connection not good. cant get a decent connection and always kicked out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T08:46:16.000Z",
          "Titre": "In the ad said that the internet is…",
          "Contenu": "In the ad said that the internet is unlimited and is only 2GB of data provided. Not good!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KEVIN",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:49:01.000Z",
          "Titre": "Man wen I get the lil mins it run out…",
          "Contenu": "Man wen I get the lil mins it run out so fast I don’t even know if I got them or not"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GWENDOLYNNE",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:37:15.000Z",
          "Titre": "My tablet rarely works",
          "Contenu": "My tablet rarely works. Jumps all over. And I have NO free/unlimited ANYTHING"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Cameratta",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T13:30:01.000Z",
          "Titre": "Device is terrible and slow"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KAREN",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T15:16:31.000Z",
          "Titre": "My son was sent a tablet",
          "Contenu": "My son was sent a tablet. The charger port didn't last long at all. Now it will not even charge to be used at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANNA",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:01:40.000Z",
          "Titre": "My tablet only works with wifi",
          "Contenu": "My tablet only works with wifi. I have called to get the issue resolved but it happened again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HARLY",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T04:10:02.000Z",
          "Titre": "I asked them to replace my tablet and…",
          "Contenu": "I asked them to replace my tablet and they won't get back with me ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amelia Lane",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T05:10:21.000Z",
          "Titre": "I'm not certain on of I got any no useage",
          "Contenu": "I'm not certain on of I got any help as I still don't have use of my tablet"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ilene Davis",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T16:36:52.000Z",
          "Titre": "Limited phone time",
          "Contenu": "Well basically this company lead you to believe that you could get it and still continue with your unlimited talking text and phone calls because it's a government plan when in actuality you only get so many minutes and then your phone cuts off so this plan is no good if you're going to get a plan like SafeLink or assurance wireless don't get this plan just keep your other plan with unlimited everything this is not worth it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Robinson",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T20:00:19.000Z",
          "Titre": "Calls… what calls",
          "Contenu": "Does not make calls like it says. Just a crappy tablet that gives the energy of “good enough” for the poor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nacera",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:35:13.000Z",
          "Titre": "Very slow",
          "Contenu": "Very slow, it stops the connection with no reason"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unsatisfied customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T08:10:42.000Z",
          "Titre": "disappointed",
          "Contenu": "My phone is glitching out the screen flickers it goes from light to dark speaker doesn't work can barely hear anything out of the speaker have a hard time trying to get any of the buttons to work you got to tap on the screen like several times I've had this phone for about a week before I started seeing the problems with the screen glitching the buttons not wanting to work mind you when I did receive the phone it came with a case and a screen protector which I put them both on as soon as I got it out of the box the phone has not been dropped damaged in any sort of way physically on my part to be honest its not worth the hassle"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lindsay Moss",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:48:01.000Z",
          "Titre": "I've done the application on other…",
          "Contenu": "I've done the application on other websites and they all say congratulations your approved but so far nothing has showed up in the 2 months it's been. I hope unity wireless has different results. I will be posting updates as I received email today saying my tablet will be shipped in 7 to 10 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derrick Sanders",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:00:48.000Z",
          "Titre": "It was easy to feel out the form I hope…",
          "Contenu": "It was easy to feel out the form I hope this comes it said congratulations I've been approved when it comes I'll put more feed back on here to let you guys know"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Bost",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:36:44.000Z",
          "Titre": "This is my second time doing…",
          "Contenu": "This is my second time doing applications. The first application I did and I didn't hear anything from the company. But I hope to receive tablet from Unity Wireless. I will let Unity Wireless know."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Liana Principe",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:38:07.000Z",
          "Titre": "Affordable or free service",
          "Contenu": "Everything was great and explained well easy to follow and understand. Hoping it's a free service I have wifi already so it should be great!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlotta Lamb",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T01:06:06.000Z",
          "Titre": "I like how simple and to the point the…",
          "Contenu": "I like how simple and to the point the application process was. And great to be of help to the people who in these times can't really afford any extra luxuries like a cell phone and tablet.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "dale Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:44:31.000Z",
          "Titre": "Would of rate higher but I am confused …",
          "Contenu": "Would of rate higher but I am confused  I was told I qualified for tablet and sims card and got the tracking number and say they are shipping me tablet and sims  and it says if its sims card only there wont be a tracking number why would i get a tracking number and dont at the buttom of email it say i only getting sims card  i am confused am i getting the tablet too i need to know"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer charles owens",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T03:13:12.000Z",
          "Titre": "Take people's info fast & reliable to get results.",
          "Contenu": "Giving wireless service to low income people."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sonja Woodie",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:38:48.000Z",
          "Titre": "You asked...",
          "Contenu": "I really wanted a tablet because my eyesight is really bad.  I ended up having to buy a phone from you.  I haven't had to deal with customer service yet but what I have saw,  yall are doing well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carey Fason",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T05:41:40.000Z",
          "Titre": "The customer service aren't patient or…",
          "Contenu": "The customer service aren't patient or polite. One of them was yelling at me because i couldn't understand how Unity works and that I wanted a new phone number associated with the tablet. I'm going to try again and find put what's going on and what my phone and tablet #'s are. This is just a small update from my 1st review"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "צבי בן יהודה",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T02:48:35.000Z",
          "Titre": "False advertisement..?",
          "Contenu": "Well, I was happy to hear  that I was going to get a new phone, with unlimited talk, text and data for people in my situation, seniors, section 8 housing, etc. Since Covid I really haven't bounced back and haven't worked in 2 yrs. I have no income and have applied for disability and it's pending. The new phone caught my eye cause that's what I really need along with no monthly bill. I've been evicted twice from my apartment cause no income to pay rent. I'm homeless now.With Unity, I just received info that a tablet is coming my way with no phone. That Unity does not offer Free Phones. I'm really disappointed.What am I to do?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon Galloway",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T09:48:00.000Z",
          "Titre": "Quick process online!",
          "Contenu": "Quick process online!! Super fast n easy!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frederick Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:28:11.000Z",
          "Titre": "Difficult intructions to activate phone",
          "Contenu": "It has taken me weels to finally get this phone to work.  I have been unable to reach customer service by phone.  There need to be better and clearer instructions on activation.I dont know why you cant just send a phone with the right sim card ready for use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sadsad Americanwish I wasn't",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T05:44:47.000Z",
          "Titre": "Unfortunately typical of our society....let's give billionairs tax cuts and fleece the 99% who really need those breaks. Ins twenty years who is going to be there to bag your rich peoples groceries?",
          "Contenu": "I didn't receive a tool for the service. I had to pay 20 dollars for a phone that can't hold a charge for even 3 days when in stasis and it took weeks for it to arrive after ordering it. This is after months of having a sum card with nowhere to put it. If someone can tell me who best to make phone calls or lol up job postings with just a sum card and no device please clue me in. #poorpeopleproblems #whatsmiddleclass?#richkeepgettingricher#theother99%#whosgoingtospendmoneywhennobodyhasanymoneytospend?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raleigh Lee",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T03:30:37.000Z",
          "Titre": "It's so slow and glitchy regardless it sucks",
          "Contenu": "It's so slow and glitchy regardless or reception or where you are. Buttons, or touchscreen doesn't work at times. You have to mash and mash and mash screen and it won't pick up the touch. Slow and to be honest is the worst phone and pad I've ever used and owned. Sorry just the truth. I will be probably looking to go to assurance wireless. I had better luck and service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T12:44:34.000Z",
          "Titre": "What can you improve if you can let…",
          "Contenu": "What can you improve if you can let somebody know if they get approved for a phone or tablet I was expecting to get approved for a phone cuz I got was a  sim card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Brumfield",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T22:29:38.000Z",
          "Titre": "Happy Customer",
          "Contenu": "Good Afternoon To All - when I switched companies - everything went well.  Then I got the 1st message, do you need a phone and then again everything went well.  next got the message tablet on the way and the phone is on the way.  Next got both devices and fired them up and that is when the issues started - tablet had no internet and the phone would not dial any numbers.  Send it message and got a quick responses - got a SIM card yesterday and now the phone works properly and the tablet still does not have a internet connection.  So if it does not connect to anything I will just it in my house where I can connect it to my own internet.  Thanks for the hard work, because I am sure everybody trying to get free internet is hard on you folks.  Keep the good work, my case might be rare."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matty",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:56:14.000Z",
          "Titre": "I didn’t like the business mix ups and…",
          "Contenu": "I didn’t like the business mix ups and the service wasn’t working as well … I need a newer iPhone for work stuff but can’t afford any…"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MOIZUDDIN",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T13:41:33.000Z",
          "Titre": "good morning my experience was not…",
          "Contenu": "good morning my experience was not really good I received tablet with free service but my tablet was not working properly.... touch screen was really bad... I email your service but not really good response.... if any possibility I can changed or return il will be great for me thanks appreciate"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KAYLA",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:04:34.000Z",
          "Titre": "The tablet is overall great",
          "Contenu": "The tablet is overall great, but I believe I received one that was refurbished. The charging port is messed up somehow. I’ve been having issues charging the tablet since I’ve got it. It’s hard even reaching someone. They read your messages sometimes & never respond. However, it never slows down. The picture quality is pretty decent. The calls service is pretty decent as well. The charging port is just annoying. The charger doesn’t fit in the slot like it is supposed to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TRACIE",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T16:47:08.000Z",
          "Titre": "The policies could very well beg a…",
          "Contenu": "The policies could very well beg a little more clear and lenient. If you sent me a defective product then it should be replace with a tablet that is in good working condition without any type of cracks, gkitchez,etc,. The screen in proper order. And calibrated correctly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Desmond Watson",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T01:48:13.000Z",
          "Titre": "I never received my tablet in the mail",
          "Contenu": "I never received my tablet in the mail. I did receive the phone, so it wasn't a complete bad experience. I originally applied so I can have a tablet to use. I honestly didn't need the phone. I feel the phone was mailed and received because I paid for it. It's was only $20, but still I went from getting a free tablet to paying for a phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keiona Brooks",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T03:43:36.000Z",
          "Titre": "Hello unity wireless phone family",
          "Contenu": "Hello unity wireless phone family, I am writing to let you guys know your doing well with keeping so many families connected! I love this tablet by the way, I only have one problem. I was so excited to know unlimited data comes with my service. I also was expecting internet inside my tablet also? I do not have interest on the go? Is there any way I can get that service with my data service from you all? Everything else is awesome with unity wireless! Keep up the good work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "OTIS HOHIMER",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T06:42:16.000Z",
          "Titre": "No Connectivity",
          "Contenu": "I have had connection issue since I've received this tablet.It still doesn't connect without using another wifi source."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MARCUS",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:34:06.000Z",
          "Titre": "I guess it comes with the free…",
          "Contenu": "I guess it comes with the free territory but the connection isn’t too stable. For some reason I can’t use any internet functionality. I’ll tweak it and look at the schematics I know and see if I can get it to work but it is an inconvenience nonetheless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Lanford",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T02:57:59.000Z",
          "Titre": "Experience with Unity wireless so far",
          "Contenu": "In my experience so far with Unity Wireless, the service itself is great!! No dropped calls or scrambled signal anywhere I’ve been so far. The only thing that stands out in the negative for Unity wireless is that when you need to talk to someone in customer service, it takes forever to talk to someone, and that’s if you ever get connected at all. If you do get connected and actually talk to someone, they are very professional and nice!! Customer service is a MAIN FACTOR in any services you may need and that’s the reasoning in why I didn’t give but 3 stars. If this improves, I’ll do another review and change my rating accordingly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer hammond",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T21:10:10.000Z",
          "Titre": "Not the best and not the worst...,",
          "Contenu": "My sim card was already inserted into the phone and the phone didn't recognize the SIM. Took roughly a week for it to be sent to meit sat over the weekend before fed ex picked up. Had I ordered on a Monday I would have had it by Friday.. No tech support to help activate service that should be a 24/7 service..still have yet to see what kind of cell service my phone is capable of"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "REBECCA",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T09:05:32.000Z",
          "Titre": "The ad is misrepresenting about the…",
          "Contenu": "The ad is misrepresenting about the tablets ! It shows the larger 10” tablet as free and free service ! But once you are approved the 10” tablet cost I had to pay $125 for mine and other people have paid different amounts , more then $15 or $25 it’s like $80 and up I paid $125 !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LISA COOPER",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:56:08.000Z",
          "Titre": "THE OX-TABLET THAT I PURCHASED IS NOT…",
          "Contenu": "THE OX-TABLET THAT I PURCHASED IS NOT PERFORMING WELL MOST OF THE TIME, I HAVE TO REBOOT TOO OFTEN AND THE BATTERY LIFE IS SO SHORT AND DRAINS FAST, EVEN IF I'M NOT USING IT!! I REALLY WOULD LIKE A REPLACEMENT WITH A BETTER AND MORE UPDATED TABLET PLEASE 🙂"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terraino Adams",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T05:02:49.000Z",
          "Titre": "Well I would be up and running if the…",
          "Contenu": "Well I would be up and running if the SIM card would have came with the phone and you guys keep sending me messages saying I need to activate my phone before some dead line"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GLYNDA",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:08:17.000Z",
          "Titre": "No phone and slow internet",
          "Contenu": "I love the tablet but after receiving my replacement tablet, I haven't been able to access the phone and the internet is very slow and alot of times don't connect at all. On a positive note I was very pleased with customer service. When I had a problem with my tablet it was corrected and I received a new tablet within a week. Thank you Unity Wireless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ALEXANDER",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:39:07.000Z",
          "Titre": "GOOD Tablet. Bad Service. No Service Connection as of yet.",
          "Contenu": "The tablet provided to me is a quality, smooth operating product and I enjoy it. Unfortunately, I STILL do not have service connectivity after almost 3 weeks of having the device and NO representative has tried to reach out to me after I have left messages on Unity Wireless site. I still CANNOT use my device outside of my home's WIFI connection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela Flowers",
          "Nb_Reviews": 3,
          "Date": "2023-09-20T04:51:42.000Z",
          "Titre": "Service or Device problems",
          "Contenu": "The apps on the tablet that accompanies this service consistently crashes each time I try to use it.  I've checked with the other connections around me and they are fine.  Is this the service or the device that's got problems?  I've talked to others and some have said that the service and device are rotten because it's a free service, is that true?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Story",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:34:18.000Z",
          "Titre": "The service is good so far and I like…",
          "Contenu": "The service is good so far and I like the phone however the data is not unlimited like it said it would be it's only 1g of data instead but other than that I'm satisfied"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LAQUESHA",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:37:47.000Z",
          "Titre": "The internet doesn't work like suppose…",
          "Contenu": "The internet doesn't work like suppose to only when I'm connected to wifi, my phone calls doesn't come through, people be calling me and I have had several individuals Stat that it's goes straight to voice mail. When I try to call out it, it takes 2 minutes before it even start ringing, I can't hear the other person on the phone unless I have a headset connected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Moonwolf",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T20:30:01.000Z",
          "Titre": "So far ordering the service was fast…",
          "Contenu": "So far ordering the service was fast and easy,now let's see if I actually receive it Then I'll review and raise the stars!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Miss Denise",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:45:49.000Z",
          "Titre": "Uncertainty in a confusing way",
          "Contenu": "I am unsure if I paid for a decide from unity wireles. I am not able to access my application or account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHANNON",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T02:36:24.000Z",
          "Titre": "Thank you",
          "Contenu": "I love having the free service! Thank you! But I dislike the very slow internet on my device. It it seems like my text messaging is very limited. I don’t text all that much. And for some reason my messaging will be disabled I can not text anyone, and it’s probably the same with incoming messages😏"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ERIC",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T05:07:33.000Z",
          "Titre": "I received my tablet",
          "Contenu": "I received my tablet.  But still can't get the internet access away from my home.  The company has recently help by recenting the access. It didn't help. Anyway I can just reset the tablet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CARL",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:29:11.000Z",
          "Titre": "It takes the phone too long to boot up…",
          "Contenu": "It takes the phone too long to boot up and not enough data 5 GB would be better and it allow you to do more job searches than fine things that you're looking for"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Bushre",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:49:46.000Z",
          "Titre": "Actual Good Try",
          "Contenu": "Well I am just trying for the first time and it was quite simple and It’s cool it comes with case and screen protector and all cords for operating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Beres",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T22:21:33.000Z",
          "Titre": "My device hesitates all the time",
          "Contenu": "My device hesitates all the time! I have 1 game on it and it has to be restarted constantly! This is a lifeline for me and I have a hard time contacting my daughter in an emergency! The date of experience is wrong but it has been happening since the day I received it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Hardie",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T21:10:08.000Z",
          "Titre": "Well I haven't gotten my Sim card yet…",
          "Contenu": "Well I haven't gotten my Sim card yet but I did have a very short easy process and was approved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SANDRA",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:29:17.000Z",
          "Titre": "I never said anything, but I did receive my tablet with a pretty good cracker crossed it and now it it won’t even login so I think I need to get a different one and exchange it",
          "Contenu": "I received my tablet an I never said anything but it did come cracked an I was disappointed in that. You think I could get a replacement cause I can’t even log on now"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hiram Sledge",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T19:54:50.000Z",
          "Titre": "I didn’t know it but I get no signal…",
          "Contenu": "I didn’t know it but I get no signal where I live I figured they had a way of checking that instead of sending me a SIM card for a phone I had to buy now after all this I still don’t have a phone to use ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MARJORIE C RIVAS",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T03:35:30.000Z",
          "Titre": "Well all i can say is i love how the…",
          "Contenu": "Well all i can say is i love how the company always give me my minute on my phone on time but i want to know how can o get a new phone because this one be acting upi had about 2 years"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VICTORIA., ..bad reception",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T01:15:40.000Z",
          "Titre": "Bad reception at home and when traveling,  videos are always looping.",
          "Contenu": "Bad reception at home and on the road,  videos are always looping,  do you have a modem and wifi you can put in my house because that would help 100%.….im very appreciative for this service it helps me out so much...i thank you so much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DAWN",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T12:23:55.000Z",
          "Titre": "I think overall things have been ok",
          "Contenu": "I think overall things have been ok. I got the tablet quickly. All the things have been easy for me to do. My only issues are the tablet sometimes lags meanings doesn't change screens quickly or will go black and won't come back up for a while. And the service is great in cities or bigger towns but often not great in rural areas which is where I spend most of my time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Opeal Dempsey",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T01:32:14.000Z",
          "Titre": "My internet service on the phone is…",
          "Contenu": "My internet service on the phone is very poor can't play games"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T18:31:58.000Z",
          "Titre": "The service is super slow",
          "Contenu": "The service is super slow. Almost non-existent. So, that's a bit of a problem. Also, the tablet is incredibly slow, so you can't really do anything on it. All in all, I'd rather pay for service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dee B.L",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:06:01.000Z",
          "Titre": "I'm not sure how to write this review, but here goes",
          "Contenu": "I'm not sure how to write this review.  The application was easy to follow.  I got a Sims card in a timely fashion.   But...I mainly applies because they said I could get a free ipad/tablet.  But when I got to the point of selecting the item it only gave me one choice.  Which isn't a choice at all.  And yes, it wasn't a ipad/tablet.  It was a simms card.  I took it but I was not happy. Not only because it wasn't what I even applied for but because I had to find my own phone.  Uggh.  Very disappointing!  And for that reason I gave them only 3 stars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ELIJAH",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:53:08.000Z",
          "Titre": "U get cut off by reduced billing for your phone service",
          "Contenu": "That if u have service for Wi-Fi on ur device your carrier will kick u off of the reduced bill if u get it, but if you call the economic benefits line they will change it back"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BETTY",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T14:22:59.000Z",
          "Titre": "I've been trying to call out to keep my minutes but my tablet ain't letting me call out I got off my Wi-Fi it said Put it on data that I got it on data and it still won't let me dial out",
          "Contenu": "But I dislike is I can't call out on my tablet I cut off my Wi-Fi I'm using data like it says but I'm still not able to make no calls if there's a way I can get help I appreciate it I do want to keep my minutes monthly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 13,
          "Date": "2023-11-19T05:21:13.000Z",
          "Titre": "Awesome tablet from free",
          "Contenu": "Awesome tablet from free. But I was told t have unlimited data. Then after getting it says 3g. That's not a lot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sean Williams",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T01:12:21.000Z",
          "Titre": "Unity Wireless",
          "Contenu": "It a good service I just wish that the customer could get more than just 5gb of data and it would be nice if unity wireless had some kind of Data app so we the customers could check and see how much data we have left etc..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ANGEL",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:36:15.000Z",
          "Titre": "My tablet service is bad cuz it not…",
          "Contenu": "My tablet service is bad cuz it not working with sim card not going sussues though something wrong with sim card need good running."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy Saxe Gebo",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:14:33.000Z",
          "Titre": "I thought the free phone was part of…",
          "Contenu": "I thought the free phone was part of the deal.. can you please explain this.. it went through for a free phone.. I just sighned up and I know it takes time I will write another review when I receive everything"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Swanson",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T00:50:12.000Z",
          "Titre": "What I didn't like was that when I…",
          "Contenu": "What I didn't like was that when I called the help center, I was put on hold for over 20 minutes and finally I hung up. Is trustpilot another name for unity?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STEPHEN",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:31:26.000Z",
          "Titre": "The tablet is great but the signal is…",
          "Contenu": "The tablet is great but the signal is practically non existing.. Can't make call and very little data.. Have to use personal home wifi to use tablet.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melanie Wagers",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:25:42.000Z",
          "Titre": "I will say the approval process is so…",
          "Contenu": "I will say the approval process is so easy. However, the communication is horrible. Cannot get anyone on the phone or to answer chat messages."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PEGGY",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T21:45:10.000Z",
          "Titre": "had to send tablet back due to device…",
          "Contenu": "had to send tablet back due to device issues im still  email stated i would recive my tablet within 24 to 48 hrs  still not here waiting on tablet to come back"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Meagan Alford",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T01:11:53.000Z",
          "Titre": "I like how it was easy and affordable…",
          "Contenu": "I like how it was easy and affordable and quick to get the service required for me to keep in touch with my loved ones"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Patrick Lucey",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T22:09:19.000Z",
          "Titre": "Still waiting on my SIM card…",
          "Contenu": "Still waiting on my SIM card replacement. Over all service is good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "EMMANUEL",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T05:00:41.000Z",
          "Titre": "There is no unlimited data plan as…",
          "Contenu": "There is no unlimited data plan as advertised and even when you want to top up the plans cost are too expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:45:08.000Z",
          "Titre": "My phone hasn't worked because I was…",
          "Contenu": "My phone hasn't worked because I was told by your CS that I need a chip that didn't come with the phone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHAREA",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:42:36.000Z",
          "Titre": "I love the size and the applications…",
          "Contenu": "I love the size and the applications for kids especially.  The service is poor very slow need 5G service not 4G so I have to add wifi to speed up service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TIM",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T20:00:55.000Z",
          "Titre": "I put my sim card in Tablet it only …",
          "Contenu": "I put my sim card in Tablet it only  worked once watched one youtube video & during that video it stopped working."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shanon Battile",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T08:02:24.000Z",
          "Titre": "Never received sims card"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jennifer huffman",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T16:40:13.000Z",
          "Titre": "Well not liking this service very at…",
          "Contenu": "Well not liking this service very at all. My signal isnt good anywhere I go. I always run out of data. I don't understand it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STEPHANIE",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T03:50:27.000Z",
          "Titre": "I am upset the charging port will not…",
          "Contenu": "I am upset the charging port will not charge until it is set just right. How can we fix this? Otherwise wonderful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Will Davis Jr",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T11:06:19.000Z",
          "Titre": "The sim card that came with the tablet…",
          "Contenu": "The sim card that came with the tablet has a phone number of 5010907107 and it works. The sim card that came with the phone has no number and it doesn't work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TESSA",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T01:04:30.000Z",
          "Titre": "I figured the tablet would have data…",
          "Contenu": "I figured the tablet would have data where ever it went but it does not . Need to explain that a little more . And I have never given out that number contected to it but it receives phone calls all the time ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LARRY",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:41:41.000Z",
          "Titre": "It was fast getting the tablet but…",
          "Contenu": "It was fast getting the tablet but found it does not work everywhere went 10 miles from home and had no service at all"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CARMEN",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:43:24.000Z",
          "Titre": "Professional",
          "Contenu": "Professional. Would be nice if it was made easy to Change the phone number, a lot of these numbers are refurbished and spam calls come in drones. Too many spam calls."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Quiana Stovall",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T12:05:38.000Z",
          "Titre": "I can't wait till it gets here.",
          "Contenu": "I can'kt wait till it gets here.Now that it6 here You want it back Peace of crap Two sim card , have to pick one before you make a call.You want it back? And it's slow as hell."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn Brown",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T23:40:39.000Z",
          "Titre": "you offered a free tablet which I never…",
          "Contenu": "you offered a free tablet which I never got and I bought a promotional phone for $20 what happened to the tablet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelvin Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T18:05:58.000Z",
          "Titre": "You should be able to keep the same…",
          "Contenu": "You should be able to keep the same number instead of keep changing numbers now I have to give my family the new number my doctor the new number and you shouldn't have to wait that long to get another sim"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GIOVANNI",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T16:33:46.000Z",
          "Titre": "My mobile service doesn't work",
          "Contenu": "My mobile service doesn't work. I am able to connect to wifi though. It's been doing this since I received the tablet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Aguilar",
          "Nb_Reviews": 4,
          "Date": "2023-11-20T02:47:03.000Z",
          "Titre": "No product",
          "Contenu": "I ordered November 10 and today November 20 have not received my product..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Annette",
          "Nb_Reviews": 9,
          "Date": "2023-09-27T16:36:49.000Z",
          "Titre": "not a good phone",
          "Contenu": "The cellphone that I received is the worse. When Nokia first came out, I had one and I got rid of it because of the sound, you can't hear good on it. The reception is bad. I know it was free through the Government, but it is still the worse."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy-Elyse Neer",
          "Nb_Reviews": 6,
          "Date": "2023-09-27T00:37:46.000Z",
          "Titre": "The sign up process was really…",
          "Contenu": "The sign up process was really confusing and I am still not sure the device is using their network"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Wiedemann",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T22:50:48.000Z",
          "Titre": "The tablet I was provided was not of…",
          "Contenu": "The tablet I was provided was not of the best quality though it was adequate.  The brand was unknown to me but i might try to purchase my own device next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "latasha clark",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:11:43.000Z",
          "Titre": "the tablet broke and couldn't reach out…",
          "Contenu": "the tablet broke and couldn't reach out for a replacement tried to order another one and it was too high"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RUNETTE",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T02:54:42.000Z",
          "Titre": "WiFi won't stay connected for long…",
          "Contenu": "WiFi won't stay connected for long periods of time. The volume is too low. The sticker that was on the tablet was hard to get off - wasn't able to get it all off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KEVIN",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T20:57:18.000Z",
          "Titre": "While I like the tablet",
          "Contenu": "While I like the tablet, the service is lacking. Can only use the web on Wi-Fi and some apps won't work on the tablet. The plus is that the tablet can receive calls and texts, which is okay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T22:25:29.000Z",
          "Titre": "I tried to make a call or use the…",
          "Contenu": "I tried to make a call or use the internet and it always makes a busy sound when I dial. The internet never connects."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BILLY",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:40:22.000Z",
          "Titre": "Don't get me wrong it's okay service…",
          "Contenu": "Don't get me wrong it's okay service the tablet the volume is terrible you can't really hear even if it is on speaker need better data plans and a app that you can download where you can view how much data you used and anything else about your account I'm writing a three stars if these problems improve our rate it more stars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Be",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T23:52:18.000Z",
          "Titre": "I was sent a tablet that is glitching…",
          "Contenu": "I was sent a tablet that is glitching bad. Afraid it's my info will be stolen. Sent videos yesterday. Still waiting for issue to be fixed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peyton Brueckl",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T08:01:17.000Z",
          "Titre": "I love that I got a free tablet with…",
          "Contenu": "I love that I got a free tablet with service on it but I can't get the Internet to work when not in wifi."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laura Barnhart",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T08:07:14.000Z",
          "Titre": "I loss service alot",
          "Contenu": "I loss service alot. not good coverage"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CHERYL",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T13:53:09.000Z",
          "Titre": "I live in the country and I’m unable to…",
          "Contenu": "I live in the country and I’m unable to get the service I need to make phone calls or use my data service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wayne Foster",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T19:33:36.000Z",
          "Titre": "Everything was all good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Cardona",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T23:27:47.000Z",
          "Titre": "Received my phone but SIM card was no…",
          "Contenu": "Received my phone but SIM card was no good now I have to wait for my replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T23:40:21.000Z",
          "Titre": "The phone runs slow when trying to get…",
          "Contenu": "The phone runs slow when trying to get on the Internet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cynthia Ingram",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:29:43.000Z",
          "Titre": "Wrong product",
          "Contenu": "Wrong product I filed for a tablet and I got a phone. Was very disappointed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BILL  S PRICE",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T23:01:40.000Z",
          "Titre": "I can’t hear caller",
          "Contenu": "Can’t get the speaker volume to turned up to hear the person I’m talking too  it so hard to hear"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHERRY",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T13:27:04.000Z",
          "Titre": "I still have not received phone ordered…",
          "Contenu": "I still have not received phone ordered with tablet. It took along time to get order from FedEx."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T11:01:38.000Z",
          "Titre": "I was disappointed in the tablet iTablet less then pleasingt was…",
          "Contenu": "I was disappointed in the tablet it was used a d has scratches on it, and the resolution is of poor quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAY",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T14:52:18.000Z",
          "Titre": "More Live People",
          "Contenu": "It’s very hard to get in contact with a Representative when help is needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra Jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T18:07:59.000Z",
          "Titre": "My internet doesn’t work unless I’m on…",
          "Contenu": "My internet doesn’t work unless I’m on wireless"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LUZ",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T23:23:21.000Z",
          "Titre": "Trouble logging in the majority of time…",
          "Contenu": "Trouble logging in the majority of time ready to close the account and use it for phone service since I had to acquired internet with Hughes net service I'm giving you to many stars out a estimated dated the problem been seen the initial"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arnethya Denson",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:45:02.000Z",
          "Titre": "Everything is good news but I need a…",
          "Contenu": "Everything is good news but I need a tablet or phone I do not want a card I do not have a phone or tablet I'm using someone elz phone you sigh up for this  thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristie Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:12:51.000Z",
          "Titre": "The service is great for people…",
          "Contenu": "The service is great for people struggling with communication troubles right now. It didn't take long to get your service or package. I think it's awesome thing to apply for"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffery Spahn",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T06:16:43.000Z",
          "Titre": "You came through I got my device I do…",
          "Contenu": "You came through I got my device I do want my internet though and I appreciate all your help Thank you it's a godsent blessing and again thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard A. Reed II",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:30:01.000Z",
          "Titre": "SimpleACP for Internet to complete",
          "Contenu": "Simple to complete. However, internet service would better serve my family than a phone or tablet. They appear to me as not necessarily needed as opposed to internet service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheneka Howard",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:19:00.000Z",
          "Titre": "I was accepted for a tablet and a SIM…",
          "Contenu": "I was accepted for a tablet and a SIM card and I just want to see how it works when it gets here and how it helps me with my classes and then I could give a full review but so far y'all are great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T06:45:29.000Z",
          "Titre": "Well",
          "Contenu": "Well, I received a phone with no Sim card and I’m waiting on the tablet. It’s taking quite some time I’m not really sure it’s coming."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter Bird",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:59:24.000Z",
          "Titre": "Application was easy to fill out,can…",
          "Contenu": "Application was easy to fill out,can wait to get my tablet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alicia Yvanes",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T17:41:23.000Z",
          "Titre": "Give it a try.",
          "Contenu": "Unity wireless was grate and super easy and fast. It let you know if you qualify right then and there. I'm glad the government is giving out things like this to people that can't afford it it really does help out a lot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn Cunningham",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:13:34.000Z",
          "Titre": "I was trying to sign up to get a tablet…",
          "Contenu": "I was trying to sign up to get a tablet and had troubles with it, so now I'm getting a sim card I do believe? So I'm a little confused about all this..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sonia Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:37:11.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I did have issues with the SIM card but those were resolved by emailing Customer Service. Sometimes it can be difficult to get a live person to help you but if you email them with your problem, you’ll definitely get a reply in no later than a day.  The phone and tablet are also way better than I was expecting and happy with my experience so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Prodonovich",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:41:19.000Z",
          "Titre": "it was a little rough at first",
          "Contenu": "it was a little rough at first, getting my sim card and buying my phone..... but now i got it hooked straight up from the envelope , and i'm impressed by the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynette Elliott",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:44:31.000Z",
          "Titre": "It was easy to apply for the Sim card…",
          "Contenu": "It was easy to apply for the Sim card but I also desperately need the cell phone also how do I be sure I get that when it asked me to choose the only item that allowed me to click on was just the Sim card I need the phone also"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Sichler",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:46:08.000Z",
          "Titre": "Best deal out there .  Be patient",
          "Contenu": "Why my device,,,,,,, DEVICES still have NO connection or service?. . . . . .Update.Tobe honest I kinda gave up on trying to troubleshoot..With the holiday AND working crazy shifts...And I just today decided to take a look, and well, it works😁.It is a decent phone with a very large screen...Over the years I've learned that no matter what cellphone service company I've run into there are issues.No company is perfect.  The service probably here offers the greatest deal of ANY provider.So ,I'm happy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jessica Read",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:41:54.000Z",
          "Titre": "Just Have Faith",
          "Contenu": "I was approved and I couldn't believe that the tablet was actually free and not false information."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erick JC",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:20:46.000Z",
          "Titre": "Really am happy that the application…",
          "Contenu": "Re- ( I received my tablet after contacting the customer service that was able to see me with my tablet still a bit confusing though, happy here tablet looks and runs perfectly. Thank you). Really am happy that the application was approved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Carr",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:43:53.000Z",
          "Titre": "Good phone and service fast shipping…",
          "Contenu": "Good phone and service fast shipping but now my phone isn't working for some reason"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helen Shinaway",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:05:43.000Z",
          "Titre": "Sims card",
          "Contenu": "I didn't receive a Sims card to activate my phone. So I'm currently just using it with WiFi from my nephew. Please advise..Helen Shinaway11-28-2023"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T22:52:16.000Z",
          "Titre": "Well I recently was robbed and…",
          "Contenu": "Well I recently was robbed and everything was taken laptop included so I was issued a tablet  but came with no service So I pray that I filled everything out and I recieve a functioning device ,Promise to pay it forward  ty"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jamie Solidwood",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T19:11:01.000Z",
          "Titre": "Well the application was pretty easy…",
          "Contenu": "Well the application was pretty easy the only thing is that they don't show you how to get the phone and or tablet and all they will send is the sim card! When I figured it out how to do the phone and or tablet, I didn't have the money to send for either phone or tablet so will wait for sim and hopefully get a phone real soon!Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia Mundy",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T11:51:55.000Z",
          "Titre": "I am happy to have your service I hope…",
          "Contenu": "I am happy to have your service I hope I get a new phone from you . Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theresa Cordero",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T16:26:45.000Z",
          "Titre": "This is a 5 star review it was very…",
          "Contenu": "This is a 5 star review it was very simple to apply in as little as a week l had my phone, I'm older and not very phone savvy but it was really just turning it on love Unity wireless! Recommend it to everyone who is in need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KL",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T21:19:54.000Z",
          "Titre": "Decent yet lacking info",
          "Contenu": "Ordering was great. Shipping was fine tho a bit slower than expected. Was a giant sticker on the front of the tablet that took some time to remove. No information on how to actually use one's account w/ the tablet much less what number that has been assigned. For someone who may get this & not know how to use a tablet straight out of the box, could pose issues. Tablet info is a bit lacking as well. A \"here is your new tablet & let's get you started\" card or website would be great for new people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mortynrick",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T23:19:50.000Z",
          "Titre": "Pretty good but lacking hi-speed",
          "Contenu": "This is one of the better Obama phone plans out there. The reason why I only give them 4*s is because on their website it says they offer unlimited talk, text and data. What they don't tell you is they only give you like a gig or two of highspeed data. I used that up in a day and after that my internet was so slow, even slower than 4g. Besides that the T-Mobile service is pretty great, I've never lost a call or missed a text."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teressa Pridemore",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:32:33.000Z",
          "Titre": "The phone looks nice but it is…",
          "Contenu": "The phone looks nice but it is difficult to use. The battery doesn't last long at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darlene",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:17:26.000Z",
          "Titre": "My experience was quite good.",
          "Contenu": "I'm excited about getting my new cellphone, the approval came rather quickly and this is going to be very beneficial for my life."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Sands",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:30:37.000Z",
          "Titre": "I'm approved do I get A phone and…",
          "Contenu": "I'm approved do I get A phone and tablet it only let me select sims card on.my son need tablet and phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicki Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:22:17.000Z",
          "Titre": "Everything was going well until the 2nd…",
          "Contenu": "Everything was going well until the 2nd day of service. I can makea call but can not recieve a call. A lady comes on the line and says that my number can't be reached at this time.I need this fixed asap please."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nikki",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:59:54.000Z",
          "Titre": "Staying connected",
          "Contenu": "Keeping me connected to my parents"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TASHA",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:25:51.000Z",
          "Titre": "After ordering my tablet and sending…",
          "Contenu": "After ordering my tablet and sending payment, I received my tablet in a short matter of time.At first I wasn’t pleased with the service because while trying to use my tablet away from home with no internet connections, I had no service. After contacting support I was informed tht I would receive a SIM card by mail so I can have unlimited data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert von Giebel",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T17:24:27.000Z",
          "Titre": "Lining the ducks up",
          "Contenu": "From wat I can recall as a TBI & Multiple Spinal injury patient was that unit came in Mail & I had difficulty with opening case 2 install battery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aquanette Markey",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:11:38.000Z",
          "Titre": "My experience so far have been great",
          "Contenu": "My experience so far have been great. Proper value of product, professional customer service and mail product I time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexis Denaro",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T06:37:34.000Z",
          "Titre": "I had just seen the ad on Facebook I…",
          "Contenu": "I had just seen the ad on Facebook I applied and it’s saying I got approved 7/10 days for the phone. All in a matter of 2 minutes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Akuma L",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:55:45.000Z",
          "Titre": "Decent can't complain.",
          "Contenu": "Decent can't complain.. well see how well they do. Customer service isn't so good at there job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anitria Beard",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T00:06:53.000Z",
          "Titre": "Malak is great!",
          "Contenu": "Malak reached out to me via email to rectify the situation and I was very pleased with his professionalism. Awesome job Malak"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MJ Moore",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T23:18:16.000Z",
          "Titre": "Great deal and was approved rite away",
          "Contenu": "Great deal and was approved rite away. It awesome to get service plus a new tablet with my approved service. Just waiting on device to get ti me. Yehhh..thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 4,
          "Date": "2023-09-26T21:11:19.000Z",
          "Titre": "Easy application and delivery was…",
          "Contenu": "Easy application and delivery was quick. My unit is 4g which makes it slower than my current phone. It does like to shut down and reboot in the middle of checking emails, sort of like an unscheduled break. 😆 I guess it knows better than I do when it's time to do so!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paula Mccall",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T17:50:40.000Z",
          "Titre": "Customer service is outstanding",
          "Contenu": "Customer service is outstanding, the only problem with the phone is that the phone just shut down often while I’m in the middle of a conversation, other than that everything else is perfect"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KAREN",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:35:01.000Z",
          "Titre": "Problems with Tablet",
          "Contenu": "I've really enjoyed my Tablet but lately it's starting to shut completely off and it's usually hours before it restarts. But for the past few days it hasn't come back on. Is there a helpline number I can call?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "betty",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T21:35:07.000Z",
          "Titre": "Nice company",
          "Contenu": "They were very helpful haven't had this service for that long but it's working out pretty well so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ADAM",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T20:56:58.000Z",
          "Titre": "Great job unity wireless",
          "Contenu": "It stands by what it says and if you have a problem you call and they fixed it if I would have given you guys five stars there would be no room for improvement but it's a great service thank you great job unity wireless"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clint W. Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T15:03:40.000Z",
          "Titre": "The Unity unlimited data.",
          "Contenu": "The service is great. It's just stinks bcuz it said unlimited data but I only get 6.5 GB of data a month.When I'm out in my travels sometime I need to use it for GPS or to simply look up things and before the middle of the month is over my data outside of the houses WiFi is used up.And I really depended in that unlimited data from Unity but other than that it's great. I love it.Oh one more thing, can I used the SIM card for my tablet since I didn't get a new phone which is what I needed?🤔"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Nyland",
          "Nb_Reviews": 5,
          "Date": "2023-10-18T17:32:58.000Z",
          "Titre": "Just ordered the tablet and iam excited…Roberts review.",
          "Contenu": "Just ordered the tablet and iam excited to get on. I need it because I got news 3 weeks ago I have pancreatic cancer. Plus kidney disease."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARK",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:06:41.000Z",
          "Titre": "The reason why it’s only four stars is…",
          "Contenu": "The reason why it’s only four stars is because nobody explain to me how this extra Sim card works if it goes in in the tablet or if it goes into a different phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Brooker",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T00:34:09.000Z",
          "Titre": "Tablet",
          "Contenu": "I thought iwas approved for the tablet thats one reason i changed over to unity thank you let me know if i will receiveing a tablet Jeffrey Brooker"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nicole Prunier",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T02:00:00.000Z",
          "Titre": "I would have loved to give  5 star…",
          "Contenu": "I would have loved to give  5 star HOWEVER  unfortunately my screen protector was cracked in 2 places.  On bring quite long. Other than that it was GREAT 👍👌🙂"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ERIN",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:47:47.000Z",
          "Titre": "Tablet is awesome I really enjoy it .I…",
          "Contenu": "Tablet is awesome I really enjoy it .I do wish customer service was more available to unity wireless customers. But all n all I have greatly appreciated and enjoyed my experience with Unity Wireless!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Hopper",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:07:38.000Z",
          "Titre": "I love my service but I didn't get a…",
          "Contenu": "I love my service but I didn't get a active sim card"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T02:40:24.000Z",
          "Titre": "Received my phone but I had no Internet…",
          "Contenu": "Received my phone but I had no Internet service. Unity is trying to fix it or will send me a new Sims card. I really like my phone. So far things work okay but the Internet but I'm sure it will get fixed soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Keating",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T12:24:45.000Z",
          "Titre": "The process was easy and fast",
          "Contenu": "The process was easy and fast. I have no doubt that my sim card will work just fine in my tablet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen S",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T08:57:08.000Z",
          "Titre": "Love the tablet but upset at the fact…",
          "Contenu": "Love the tablet but upset at the fact that the white paper on the screen is terrible and hard to get off without messing up the screen"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie San Agustin",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T22:28:46.000Z",
          "Titre": "That Unity Wireless provided me with a…Sim card",
          "Contenu": "That Unity Wireless provided me with a free Sim card that is great. The only thing is I believe the network doesn't work weekends or just Sundays."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harry Soderberg",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:28:32.000Z",
          "Titre": "it was slow at first but after it would stream moves with no problem",
          "Contenu": "I was surprised it streamed so easy, but I once it got started it seamed to work grait"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ELIZABETH",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:12:27.000Z",
          "Titre": "The phone option is hard to figure out…phone problem",
          "Contenu": "The phone option is hard to figure out and hard to get it get it to work sometimes it randomly disconnects from the data and can't finish texting"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyga Daye",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T20:03:41.000Z",
          "Titre": "It's a nice website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy Balog",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T00:32:00.000Z",
          "Titre": "The Tablet is showing that there is no SIM card in it",
          "Contenu": "I like the service but i can't get the tablet to work after accidentally pushing the SIM card out of the device. Can someone help me?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Throop",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T04:36:56.000Z",
          "Titre": "Best part of unity wireless",
          "Contenu": "The unlimited data the quality of service just wish had more options of phones"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANDREA",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T22:46:57.000Z",
          "Titre": "I am supposed to receive another SIM…",
          "Contenu": "I am supposed to receive another SIM card from you in the mail for my tablet but I have not received anything yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jes oli",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T02:02:01.000Z",
          "Titre": "It’s true what’s happening in this page…",
          "Contenu": "It’s true what’s happening in this page I’m very happy I got a table thanks ypu"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANDREA",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T02:35:16.000Z",
          "Titre": "I like that it's free and an actual…",
          "Contenu": "I like that it's free and an actual free service that runs correct And not slow at all!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alberta Coleman",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T14:37:06.000Z",
          "Titre": "Reliable Response",
          "Contenu": "Very reliable Response and product I love. Didn't understand about Sim card wasn't added."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tonya Pilgrim",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T15:28:13.000Z",
          "Titre": "I appreciate the phone and it is free",
          "Contenu": "I appreciate the phone and it is free, but it's slow and the data is very slow. My service is in and out in my area."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LYSTRA",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:33:31.000Z",
          "Titre": "Easier Reading",
          "Contenu": "Very comfortable with reading, this tablet is better than the small cell phone. I wear spectacles!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BARRY",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:28:58.000Z",
          "Titre": "Phone owner",
          "Contenu": "There is no other experience to take from me using your service that it's suit me fine ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Cavazos",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:57:11.000Z",
          "Titre": "Took the full 10 business days to get…",
          "Contenu": "Took the full 10 business days to get here but so far so good.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TR",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:52:00.000Z",
          "Titre": "A better quality product",
          "Contenu": "The tablet is okay but it's really a old and outdated tablet I believe that if you're going to give these products to consumers then it needs to have some kind of better instructions and the quality of the tablet should b be more exciting adorable and friendly to use I haven't even never heard of this company before it sounds like a company made in China I'm quite sure there are a million of American products and the same nature as this one that are much better in quality but I was given for for free"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROSALIND",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T02:52:02.000Z",
          "Titre": "Good service no concerns",
          "Contenu": "This has been a good experience. I am satisfied with my service and would definitely use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T04:05:37.000Z",
          "Titre": "Had a hard time getting the phone to…",
          "Contenu": "Had a hard time getting the phone to call out quite a few I spoke to were helpful .only problem is I had to reset phone again today.got it figured out I hope .but unity  so far seems great.     Thank u"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "REBECCA",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:23:55.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, it's absolutely wonderful. I had thought it was a good unlimited data and wifi. But it shows that I have neither. I have data and mostly it works with someone else's wifi."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CANDIDA",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:09:42.000Z",
          "Titre": "Affordable price",
          "Contenu": "Affordable price, nice tablet comes with charger, plug, & case, with everything you need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alice Barefoot",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:22:14.000Z",
          "Titre": "My phone arrived and was very…",
          "Contenu": "My phone arrived and was very inexpensive but it lags really bad"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Springer Hendricks",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T21:41:59.000Z",
          "Titre": "The only thing is is that it only comes…",
          "Contenu": "The only thing is is that it only comes with a SIM card so if you don't have a phone it is no good and then they still want to charge $20 for a phone for not even being able to afford your own food so I don't know it's kind of silly to send me I won't be able to use it so kind of pointless"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christina Lister",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T23:07:04.000Z",
          "Titre": "Internet is a little slow sometimes or…",
          "Contenu": "Internet is a little slow sometimes or maybe it's the $20 I purchased from the site"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Nave",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:02:51.000Z",
          "Titre": "Need better instructions on how to…",
          "Contenu": "Need better instructions on how to prepare for activation. This service piggy backs on your internet service. It is NOT an independent carrier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ABIGAIL",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:49:16.000Z",
          "Titre": "I love tablet It functions really…",
          "Contenu": "I love tablet It functions really wellAnd I use it for personal informationAnd I wish I would get 2 more for my kids"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ALICE",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:28:37.000Z",
          "Titre": "Everything was great",
          "Contenu": "Everything was great. From the beginning process to the shipping time. You do only get just 1 GB of data. It doesn't leave any data do do anything else."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DEBORAH",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:23:40.000Z",
          "Titre": "Unity wireless was very gracious in…",
          "Contenu": "Unity wireless was very gracious in assisting me with my tablet purchase and resending me a SIM card they were always available to assist me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MICHAEL",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:47:35.000Z",
          "Titre": "Took awhile to get the tablet due to…",
          "Contenu": "Took awhile to get the tablet due to FedEx shipping issues but the tablet works great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cera",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T18:57:56.000Z",
          "Titre": "The process was fast and easy my tablet…",
          "Contenu": "The process was fast and easy my tablet shipped fast and it came with a case a screen protector"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hv",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T02:33:27.000Z",
          "Titre": "Poor internet",
          "Contenu": "It says unlimited data but if I’m away from Wi-Fi I have zero service what do ever."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anjanette Carson",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T05:58:48.000Z",
          "Titre": "The phone seems to be working well",
          "Contenu": "The phone seems to be working well. But my ORIGINAL REQUEST was for a tablet"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CLARIE",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:12:19.000Z",
          "Titre": "When I didn't receive my first tablet…",
          "Contenu": "When I didn't receive my first tablet they shipped me a replacement. That made me happy!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amber West",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T19:25:18.000Z",
          "Titre": "They seem very attentive",
          "Contenu": "They seem very attentive. I appreciate all the help from customer service. They are very nice and understanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiy P.",
          "Nb_Reviews": 4,
          "Date": "2023-09-26T23:31:07.000Z",
          "Titre": "Great deal",
          "Contenu": "Great option for those who can’t afford an expensive phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tamfoo Latch",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T23:59:03.000Z",
          "Titre": "Process was easy",
          "Contenu": "Process was easy, shipping took a ridiculously long time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Avina",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T15:20:32.000Z",
          "Titre": "I like these guys",
          "Contenu": "I like these guys. Fast customer service. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-05T18:11:33.000Z",
          "Titre": "I order the tablet an got a phone…",
          "Contenu": "I order the tablet an got a phone instrad not happy. Called an they said sorry."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T04:40:52.000Z",
          "Titre": "Shipping was fast",
          "Contenu": "Shipping was fast.  Phone is nice. I am happy with my experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LONZO",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T17:35:56.000Z",
          "Titre": "I like it but I can't get internet…",
          "Contenu": "I like it but I can't get internet unless I'm hooked up to wifi. Other than that I love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHERYL",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:50:24.000Z",
          "Titre": "So easy to work with this organization",
          "Contenu": "So easy to work with this organization.  Everything was just as they said it would be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana Dildine",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:54:41.000Z",
          "Titre": "The fact that I received a free tablet…",
          "Contenu": "The fact that I received a free tablet with free service! That has helped me and my family immensely!!!! Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phyu Aye",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T02:56:43.000Z",
          "Titre": "Connection is really really slow and…",
          "Contenu": "Connection is really really slow and the phone is very very very slow I don't know why... But yes I'm glad I got a free cell phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WESLEY",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:40:09.000Z",
          "Titre": "UnityUnity Wireless has a great service I really love it and the pad is durable and smooth. Wireless has a great service I…",
          "Contenu": "Unity Wireless has a great service I really love it and the pad is durable and smooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MONTIQUE",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T23:14:40.000Z",
          "Titre": "I'm just a little disappointed whenever…",
          "Contenu": "I'm just a little disappointed whenever I leave the house I cannot use my Wi-Fi I always have to connect into a Wi-Fi that somewhere around when I thought I had free Wi-Fi maybe I need to call customer service to see what is the the reason why but other than that I'm very satisfied with your services"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GERRY",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:24:40.000Z",
          "Titre": "I am really enjoying my tablet but…",
          "Contenu": "I am really enjoying my tablet but there’s not enough data on it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RACHEL",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:57:07.000Z",
          "Titre": "Kinda disappointed",
          "Contenu": "It was frustrating that u cant use the tablet to make calls or text"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KENYATTA",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T00:56:30.000Z",
          "Titre": "It’s just like a normal tablet. I",
          "Contenu": "It’s just like a normal tablet.. the quality is good but I can’t text or call anyone.how do I fix it?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Burgashvili",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T22:12:11.000Z",
          "Titre": "Helpful to use for many time and…",
          "Contenu": "Helpful to use for many time and sometimes it hard to use on keyboard pads"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mason davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:06:12.000Z",
          "Titre": "Very satisfied with the service thank…",
          "Contenu": "Very satisfied with the service thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beauty OfBling",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T01:33:29.000Z",
          "Titre": "Fast shipping",
          "Contenu": "I had a great experience but wish had better instructions sent with tablet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARGARET",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T17:54:51.000Z",
          "Titre": "Easy to apply",
          "Contenu": "I got a free phone the state, it was super easy to apply and I got in Just a few weeks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moveloves Pokemongo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:32:32.000Z",
          "Titre": "Applying was so easy  hoping for fast delivery",
          "Contenu": "I  applied late. I am a single mom with an autistic child. This tablet will help me better communicate with her. I hope, it arrives before Christmas because we have been so down on our luck this year. I heard it is a reputable company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Christoffersen",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T07:01:34.000Z",
          "Titre": "Just wanted to say thank you to unity…",
          "Contenu": "Just wanted to say thank you to unity wireless for responding. I had bad experience with another company. So I applied to y'all no problem. Cause I'm in the middle of disability case going on three years. Because of being real sick an phone issues I missed my video hearing. An I have to stay in contact with my attorney. So thank you. I'm already impressed with you guys. God bless. Danny"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lashan Grant",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:23:09.000Z",
          "Titre": "Satisfied Customer",
          "Contenu": "I enjoy having valuable data and Unity provides each person accordingly to their situation it's not easy to have variety of choice and I thank Unity Wireless for being a great provider! Thanks. Can't wait to try it out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Mallett",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:01:21.000Z",
          "Titre": "The application was very easy and very…",
          "Contenu": "The application was very easy and very simple to do. It wasn't a long application at all. The wait time was literally a blink of an eye. And I should receive my device and SIM card to seven days because it's very from the company and I'm appreciative for good I am going to be able to use this device for many different reasons and not have to worry about how I'm going to be able to pay my bills."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enrique Arguijo",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T12:54:44.000Z",
          "Titre": "Easy process",
          "Contenu": "I'm just very grateful for unity to approve me for there services, and soon I'll be able to be in in contact with friends and family! Thank you again Unity Wireless,God Bless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Felles",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T11:11:49.000Z",
          "Titre": "I just wanted to say thank you so much…",
          "Contenu": "I just wanted to say thank you so much for helping me get a phone and service with you guys I really needed a phone because my dad isn't so very well and now I can keep in touch with him thanks for helping me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justine Lo Iacono Hartline",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:01:21.000Z",
          "Titre": "The application was easy to fill out",
          "Contenu": "The application was easy to fill out. The survey was good. Submitting the application was easy and being approved right away. This is going to help me out alot I can't afford one on my own I'm blessed to be receiving a tablet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Boatie",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T12:36:13.000Z",
          "Titre": "driving…",
          "Contenu": "It started out like this I was driving down the road. It was my mom's birthday it Thanksgiving time too.My mom's passed away now, so I went back in time, you know does anybody know the spot,that spot on route 66 at the crossroads, you know it's a signpost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pastor Ronald",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:58:41.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Great deals on devices. Thank you for serving those who are unable to have affordable Internet and phone service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adolf Salazar",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:12:49.000Z",
          "Titre": "Simply amazing",
          "Contenu": "Unity Wireless is an exceptional phone and tablet company. Their products are designed with cutting-edge technology, offering a seamless user experience. The phones are sleek, powerful, and packed with innovative features. The tablets are versatile and provide stunning visuals. Unity Wireless truly stands out in the market for their outstanding quality and performance. I highly recommend their products to anyone seeking a top-notch mobile device. Thank you for your time and effort."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Belinda Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:26:20.000Z",
          "Titre": "the unexpectedly",
          "Contenu": "It was really easy to fill out everything and they said I got it which I wasn't really expecting it because there's always something hidden between the lines that You Don't see but so far this has been useful and very true and can't wait to get it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tasha Castillo",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T17:27:54.000Z",
          "Titre": "Thank you so much for this incredible…",
          "Contenu": "Thank you so much for this incredible deal. You have no idea how much this is going to help me excel with my future. I am so grateful for Unity Wireless. Have a blessed & elegant day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:50:15.000Z",
          "Titre": "This is a Great opportunity for people…",
          "Contenu": "This is a Great opportunity for people who still can contact their Love ones as well as a phone call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Caton",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:21:11.000Z",
          "Titre": "This has opened up opportunities I had…",
          "Contenu": "This has opened up opportunities I had no idea were available to me! If you haven't already taken advantage of this awesome deal, don't wait! It's for real, unlike many scams that take advantage of people with disabilities. Like me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WAYTON",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:36:32.000Z",
          "Titre": "It was pretty easy to go through and o…",
          "Contenu": "It was pretty easy to go through and o it in all the information and they also brokes this down for you it’s its quite easy to understand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dorothy Markland",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:19:52.000Z",
          "Titre": "I haven't been able to get internet…",
          "Contenu": "I haven't been able to get internet since I signed on with u. So I called. I guess it's fixed now.I still don't understand the meaning behind the taking the Sim card out of the phone to use in the new tablet. There's no way I can get the Sim card back out of the phone it took me for ever to get it open the first time. I'm not gonna break the phone to try to get it again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:04:51.000Z",
          "Titre": "Thanks",
          "Contenu": "It was easy to fill out I am so glad there is this for people to get this cut life's hard right now prices of everything are outrageous"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Booth",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T08:13:40.000Z",
          "Titre": "The process to get the free phone or…",
          "Contenu": "The process to get the free phone or tablet went very smoothly. It was not a very long process at all. Didn't even have to pay the $10.01 that most companies charge it looks like the phones that they're offering for free look very nice. Looks like I'm more of an upgraded phone than most companies are providing for free. I just hope that the service and the signal work really well and has fast speed. Can someone answered have the speed on the tablets and phones are fast?? I gave a four-star rating only because I do not know if the speed of the phone or tablet is faster not. Can someone please let me know"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Fraire",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T12:47:03.000Z",
          "Titre": "An eye opener!",
          "Contenu": "Being approved and the survey afterwards opened my eyes about where I am currently in my life and how 2024 will be a better year."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Chandler",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T08:15:34.000Z",
          "Titre": "This phone is very good quality",
          "Contenu": "This phone is very good quality. It has amazing picture quality responsive and easy to use . I am very satisfied compared to previous government assistance phones I have received in the past. I really recommend this network to anyone that need a free phone due to financial problems . Thank you very much for the amazing phone and service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Freeman",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:24:12.000Z",
          "Titre": "If all you say is true then your…",
          "Contenu": "If all you say is true then your company will be the most important services in this world thank you and may all you do be blessed by God and just keep it real"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teffany Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T03:20:13.000Z",
          "Titre": "I Love this company so much they're…",
          "Contenu": "I Love this company so much they're professional at all your needs and more ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney Arlene",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:28:44.000Z",
          "Titre": "I have not had a phone since June of…",
          "Contenu": "I have not had a phone since June of 2023 and this is the only company that would help me with a tablet or phone.. i honestly do not have any words because I am so speechless.. All I can say is thank you so very much to all of the team members who helped me make this possible!! Merry Christmas.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giovany Terriquez",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T06:13:44.000Z",
          "Titre": "My experience was good",
          "Contenu": "My experience was good. I had to do I a lot of typing but all is well. It to obtain my free service and tablet. You guys are doing good in verifying the users. I didn't struggle at most it was just a lot of typing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madison Holder",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T16:33:37.000Z",
          "Titre": "This is super helpful when you need…",
          "Contenu": "This is super helpful when you need help and can't afford a phone or tablet thanks so much guys for your help I just got approved for it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:04:51.000Z",
          "Titre": "I just want to say thanks for…",
          "Contenu": "I just want to say thanks for everything is really going to help with my work and very easy to sign up and it's very true.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:12:39.000Z",
          "Titre": "Unity Heart Consideration to my life…",
          "Contenu": "Unity Heart Consideration to my life conditions an that is rare for us as we can't get to catch a true human hearted communication provider that offers services to accommodate Senior Citizens as myself when transformation of our life's is Changing. . So I Truly Salute Unity Wireless for for taking the less fortunate to Heart"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberto Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:43:41.000Z",
          "Titre": "UNITY WORRY ABOUT THERE CUSTOMERS.",
          "Contenu": "They are just so good in service and they really care for your well being too never had a company worry about you so personal like unity men god bless this people..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Cathy",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T02:04:19.000Z",
          "Titre": "They are helping people who can't…",
          "Contenu": "They are helping people who can't afford phone they're helping people stay connected with family friends doctors"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Campbell",
          "Nb_Reviews": 4,
          "Date": "2023-12-22T03:20:35.000Z",
          "Titre": "great so far with fast approval have…",
          "Contenu": "great so far with fast approval have recieved tablet yet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Tino",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T11:43:43.000Z",
          "Titre": "I really think you guys are great…",
          "Contenu": "I really think you guys are great especially helping people that are struggling through life and not being able to afford it because of the cost of living and prices going up on everything thank you for your support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mittie",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:23:34.000Z",
          "Titre": "Easy to understand",
          "Contenu": "Easy to understand. Approved me when others would not. Now I can keep in contact with my doctor and family"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Bethea",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:51:59.000Z",
          "Titre": "My God is always on time 🙏🙏🙏🙏🙏",
          "Contenu": "I would love to thank you for everything thank you for for being there with no one else was there for me thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amber Presley",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T08:34:14.000Z",
          "Titre": "Easy Peasy",
          "Contenu": "Simply the easiest application for applying for services. Short and simple. All applications should be as easy. Thank you very much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T18:23:42.000Z",
          "Titre": "RonReview",
          "Contenu": "The application was easy,the process was simple,and fast,thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Ornelas",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T08:18:00.000Z",
          "Titre": "Quick and easy application.",
          "Contenu": "The application was easy to fill out and the response time was quick. I wasn't how long it would take to get a response. I'm glad I did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mims Boyd-Poss",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T05:39:22.000Z",
          "Titre": "Amazing service and fast to apply",
          "Contenu": "I saw this add scrolling and the speed for the approval was unbelievable it only took seconds to fill out. It's self explanatory and walks you thru everything you need to know to make sure that you are approved and it says only a week and the tablet or phone to arrive with all the information you need to set it up for it's monthly free time... Everyone that gets any government help needs to apply bc it's 2023 and if you are a struggling parent like I am you if you have children in your homebits a comfort knowing that they will also have a way to contact or make their own emergency calls and I'm a huge fan of one less thing to have to stress over bc I can't afford a new phone and a bill bc my job ler alot of people go bc work has been slow I will be able to use this to also fill out applications to find another job. This economy has been so horrible and groceries being so high right now this will be a huge help in my home."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Kiefer",
          "Nb_Reviews": 6,
          "Date": "2023-12-15T23:39:33.000Z",
          "Titre": "The application is straight forward and…",
          "Contenu": "The application is straight forward and easy to understand. I filled out the application and I was told that I would receive my phone in about 2 weeks ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:14:41.000Z",
          "Titre": "Quality and service",
          "Contenu": "Every step of the Unity Wireless has been very pleasant and professional, the phones and tablets are very high quality. People who I know that have government phones and tablets threw the other companies all have that there phones and tablets a are poorly made. I'm very happy I got Unity Wireless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricardo Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:24:40.000Z",
          "Titre": "It was the fastest and easiest",
          "Contenu": "It was the fastest and easiest, and real simple to get through the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ariel Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:25:12.000Z",
          "Titre": "awesome sauce",
          "Contenu": "Because the question they asked made me think that they care about helping people, and it was easy and quick thank you and take care"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dianisha Vinson",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T12:18:53.000Z",
          "Titre": "Believe Unity Wireless is with the it..",
          "Contenu": "I can't believe the messages that you have sent and said about Unity Wireless. Their quick tk get tour orders sent out to you. Plus, it take them actually lesser than a week to receive your phone in the mail. And I live in California. I swear Unity Wireless will always get my upvote"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:38:02.000Z",
          "Titre": "Super Quick",
          "Contenu": "Super Quick, simple and easy to access/ work your way through the website to apply."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vee Marie",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:02:24.000Z",
          "Titre": "When I didn’t receive my tablet they…",
          "Contenu": "When I didn’t receive my tablet they went above and beyond to make sure I did !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabrielle Washington",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T20:52:02.000Z",
          "Titre": "It was fast and easy to do and I loved…",
          "Contenu": "It was fast and easy to do and I loved how it don't take long for a response I would most definitely recommend this to people that have government assistance"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Tilley",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:15:31.000Z",
          "Titre": "THANK YOU UNITY WIRELESS!",
          "Contenu": "Fast and easy process to get my order for my new unity wireless service and phone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Gerena",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:36:58.000Z",
          "Titre": "Overall....",
          "Contenu": "Overall, a great program to take advantage of especially if you are struggling financially."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Penrose",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:53:15.000Z",
          "Titre": "Very easy to apply, simple instructions that made the transition through very easy and you get the phone within ten days, love it!",
          "Contenu": "Very easy, step by step instructions and bam, you have new phone that you will receive in ten days, love it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ELLIA",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:50:41.000Z",
          "Titre": "I wish I could hear it better I wear…",
          "Contenu": "I wish I could hear it better I wear hearing so it's hard for me to hear it real good that is the only problem that I see with your tablets. And I wish I know how to do more with it but I can't hear it good so I just do what I can but I love this tablet. Thank you very much if you ever get something that I can really hear on would be appreciated please let me know Ella"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vivian Harrison",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T08:54:12.000Z",
          "Titre": "They didn’t take me through all the…",
          "Contenu": "They didn’t take me through all the other things some of the companies take you through and I love it it was easy for me to fill out the paperwork"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T06:26:30.000Z",
          "Titre": "Helpful and good deal with phone turned bad",
          "Contenu": "Helpful and good deal with phone... It's been a few weeks and has turned into a nightmare. My phones sound isn't working for over half of the apps and the service can have full bars and still not connect to a call. Then says my texts I can receive are twenty something per day.... Never been with an unlimited anything that had limitations on the basics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LILY HARTMAN",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T00:04:24.000Z",
          "Titre": "I haven't even got the phone yet but I…",
          "Contenu": "I haven't even got the phone yet but I was thankful that you even considered me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steph Lyons",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T23:35:54.000Z",
          "Titre": "The best experience I have ever had…",
          "Contenu": "The best experience I have ever had dealing with a provider.  Quick and easy to complete the questions. The most surprising thing is how interested they are with my opinion and concers and with my experience. If they treat everyone as well as I was treated I can see them being the #1 phone company in the country , thank you Unity wireless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Storck",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T03:22:42.000Z",
          "Titre": "Unity made my experience great because…",
          "Contenu": "Unity made my experience great because filling out info was simple. Also, they handled the challenging task of ensuring I qualified for free tablets and Internet. Then, to top it all off, I could buy a phone through them for only $20. All of this is helping me continue my education because my college courses are online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID Pelland",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T01:30:29.000Z",
          "Titre": "Very fast response great job and not a scam",
          "Contenu": "This is great even the quick response they do I sent a email and in less than 2 minutes they responded back with good news thank you all very much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila Shirah",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T03:52:31.000Z",
          "Titre": "Great customer service",
          "Contenu": "I got the My Tab Pro with a sim card and then I got the Maxwest Nitro N62 phone. I had to call customer service because I couldn't get either one to work. And they were very nice and got the sim card activated for me. The phone works great even where I live (nothing really has good signal except AT&T). So i am very pleased with the service. I had to call customer service again because the tablet is still not working but again they were very nice and are working on trying to figure out why the tablet isn't working."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T06:27:12.000Z",
          "Titre": "I haven’t received nothing yet",
          "Contenu": "I haven’t received nothing yet, but I see in my emails is telling me I need to pay for a phone if I have to pay for a phone is not free. I know $20 is nothing for a phone but when you’re on a budget it’s a whole lot, so if I can get a free phone or a free tablet, I would gladly appreciate it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley Henry",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:43:44.000Z",
          "Titre": "This is from the bottom of my heart…GRACEFUL",
          "Contenu": "This is from the bottom of my heart bless you, because I could not afford a tablet on my own by me being on a fix income I am forever grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Misael Rivera",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T06:50:45.000Z",
          "Titre": "I love it a New phone so excited thanks…",
          "Contenu": "I love it a New phone so excited thanks unity wireless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cameron Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:25:44.000Z",
          "Titre": "Another company was trying to give me…",
          "Contenu": "Another company was trying to give me service that interrupted my Unity Wireless but they quickly intervened and made it happen. Got a phone & tablet... Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leroy Clark",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T09:14:08.000Z",
          "Titre": "I need my phone to be taken off…",
          "Contenu": "I need my phone to be taken off restricted.  So I can make outgoing calls and texts.plus to receive  incoming calls and texts ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TAMMY",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:58:52.000Z",
          "Titre": "Unity Wireless at my Service during my Financial hardship",
          "Contenu": "Unity Wireless are providing families, well me and my Fa mily wireless connectivity during this financial crisis I have endured due multiple job losses thanks to the company I was able to search for jobs openings and apply when the library was closed as well complete my resume from my home, and allow the children to complete their school assignment and minimized the overall financial burden to maintain internet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Haynes",
          "Nb_Reviews": 11,
          "Date": "2023-12-19T17:01:53.000Z",
          "Titre": "It was really easy to apply for unity…",
          "Contenu": "It was really easy to apply for unity wireless. Thank unity wireless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jermaine knowles",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:28:38.000Z",
          "Titre": "The application was easy and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL GIGLIO",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T07:36:12.000Z",
          "Titre": "Very good service and good quality on Internet!",
          "Contenu": "Very good service and good quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnny Dane",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T10:25:44.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service and all I've been looking for in a carrier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DeAngelo Stokes",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:35:01.000Z",
          "Titre": "Love it  I like how they helped me…",
          "Contenu": "Love it  I like how they helped me choose a new service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Harding",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T05:28:13.000Z",
          "Titre": "It was easy.",
          "Contenu": "It was easy,  fast,  and I feel safe that information I gave is safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Parker",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:34:58.000Z",
          "Titre": "Was easy to apply I'm just a little…worried it want arrive",
          "Contenu": "Was easy to apply I'm just a little worried it said phone tablet combo but didn't mention it at the end so I'm hopeful both of one will show up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leroy Werito",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:30:59.000Z",
          "Titre": "It easy to fill out",
          "Contenu": "It easy to fill out , and also easy to understand.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "stephen Jolly",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T06:05:21.000Z",
          "Titre": "You were really helpful but I forgot need a tablet alsoto…",
          "Contenu": "You were really helpful but I forgot to get a tablet from you if I could I would like to get a tablet also with the chip thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eva Zion",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:04:35.000Z",
          "Titre": "🌹 I didn't think that I was going to…",
          "Contenu": "🌹 I didn't think that I was going to get approved for a device for free! You know - one of those too good to be true kinda things... But I am pleasantly surprised to find myself approved and waiting for it to arrive in the mail!🌹"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DELPHINE",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:41:14.000Z",
          "Titre": "I will tell people about unity wireless customer service is ok",
          "Contenu": "When I signed up and customer service talk to me with respect and if I have any problems with my cell phone I will call the technology department"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caroline Trevino",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:15:59.000Z",
          "Titre": "Words can't explain how helpful its to…",
          "Contenu": "Words can't explain how helpful its to me and my family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Girlinghouse",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:45:33.000Z",
          "Titre": "I just applied with you the team…",
          "Contenu": "I just applied with you the team Wireless and was approved and I'm hoping that they send the phone and a SIMs card with it so I can use my same phone number that wasn't specified, I'll see I guess."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T06:02:05.000Z",
          "Titre": "I had no problem filling out the…",
          "Contenu": "I had no problem filling out the application form and excellent results from the application. I will see when my tables arrive and thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tina lachney",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T06:19:48.000Z",
          "Titre": "They help people who can't afford to get a phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Fox",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:06:32.000Z",
          "Titre": "Thank you so much and God bless you…",
          "Contenu": "Thank you so much and God bless you y'all..I can't wait to try my new tablet out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AJ Saylor",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:15:28.000Z",
          "Titre": "You guys made it simple and easy to…",
          "Contenu": "You guys made it simple and easy to answer the questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ella B Edwards Desroches",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:18:11.000Z",
          "Titre": "Everything was clear and understanding…",
          "Contenu": "Everything was clear and understanding to read"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance Swinehart",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:48:53.000Z",
          "Titre": "Great company no complaints from me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melquades Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T11:28:15.000Z",
          "Titre": "Fast and easy approval",
          "Contenu": "I had no problems applying easy as 123.Thanks 🙏👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Haynes",
          "Nb_Reviews": 11,
          "Date": "2023-12-15T22:39:20.000Z",
          "Titre": "It’s easy to apply for a I pod or a…easy",
          "Contenu": "It’s easy to apply for a I pod or a phone or a SIM card. I’m waiting on mine to come in the mail 🙏🏿"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Watt",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T10:34:08.000Z",
          "Titre": "I was very comfortable working with…",
          "Contenu": "I was very comfortable working with Unity Wireless."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "david young",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T16:34:51.000Z",
          "Titre": "My experience was very well very…",
          "Contenu": "My experience was very well very encouraging I am grateful and thankful to be able to receive this I give God the glory everyday for my life my life of my husband was also retired thank you so much for choosing us"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:22:20.000Z",
          "Titre": "The application process only took a few…",
          "Contenu": "The application process only took a few minutes. And I was approved in less than an hour. I should get my phone In 7-10 days. Will post another review when it comes in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Kepola",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T18:17:04.000Z",
          "Titre": "I like the phone because it's bigger…",
          "Contenu": "I like the phone because it's bigger than the phone that I had and it finished logging in all my information I think."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Lee Pastor",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:56:05.000Z",
          "Titre": "Very Simple to follow step by step…",
          "Contenu": "Very Simple to follow step by step instructions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ash Ussery",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:49:12.000Z",
          "Titre": "So quick and convenient",
          "Contenu": "So quick and convenient! Keep up the good work Unity Wireless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Treyday Twox",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:55:57.000Z",
          "Titre": "Great service help me threw out all my…",
          "Contenu": "Great service help me threw out all my phone situations"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TONGA JOHNSON",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:17:48.000Z",
          "Titre": "I need a tablet to do my Bible reading…",
          "Contenu": "I need a tablet to do my Bible reading with larger print that's why I need the tablet thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CESAR CHAVEZ",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T06:25:35.000Z",
          "Titre": "Important communication and videochat for deaf and relay too",
          "Contenu": "I am deaf and I experienced through American sign language I was grow up many years and relay also plus important communication videochat"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesus de La Torre",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:38:30.000Z",
          "Titre": "Outstanding",
          "Contenu": "It was outstanding great magnanimous out of this freaking world no problemo very satisfactory indeed indeed yes indeed too easy draw sergeant no problem whatsoever inserted the same and let it begin too easy to draw Sergeant simple never easy yeah right with this unity wireless forget about it it was a piece of cake and I had my piece of the pie I can't deny it thank you so much God bless and good afternoon and happy holidays peace"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Evans",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T03:29:51.000Z",
          "Titre": "As far as the availability and the…",
          "Contenu": "As far as the availability and the easiness that goes along with qualifying to get a tablet and a phone will be great can't do any better than that lots of companies offer lots of things out there but they have different ideas about what you need to use them for"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Robles",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T03:15:04.000Z",
          "Titre": "Nice...",
          "Contenu": "All went smoothly for the application process,thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dimitri Butler",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:55:21.000Z",
          "Titre": "As it Behooves me to learn or find out…",
          "Contenu": "As it Behooves me to learn or find out that it seems Unity, Wireless doesn’t care about their clients as you would think. Because just about a week or so ago repeatedly called them for over a period of three weeks after receiving finally my SIM card I thought would’ve been included with the phone purchase delivery. And having the phone charged up for weeks The phone wasn’t even working at all. Didn’t want to try it until receiving the actual Sim card. I have repeatedly called their customer service requesting that they send me a working unit it’s still brand new in the actual box it had came in. Now I am upset angry is disturbed from poor bad business practice activities you would’ve thoughts someone replace this unit by now after making numerous of calls to inform them of this problem up on very disrespectfully plus some. Oh they could continue telling you to go online and file a claim. I did that the app doesn’t allow you to go any further and now enough is enough. I’m waiting to receive a full unit working it’s a paid service federal government paid plan gotten actually really ridiculous overwhelmed but disturbed by all this again it’s like you’re getting the runaround like they don’t care Customer Service is bad I’m appalled from so much bad, poor utterly service, not being rendered properly. Isn’t fixed and they don’t send me a brand new unit I’m gonna be following FCC and federal and state charges, as well as Consumer Protection and Regulatory already started the procedures I wait for a replacement happen too many issue problems in their system how dare unbelievable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Coleman",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:36:58.000Z",
          "Titre": "Good experience with helping me to get…",
          "Contenu": "Good experience with helping me to get my life together"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Henry White",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:17:07.000Z",
          "Titre": "Satisfied",
          "Contenu": "Easy to follow directions fast approval process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony DiNitto",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T07:48:11.000Z",
          "Titre": "Everything went well they elped me…",
          "Contenu": "Everything went well they helped me through everything I had to do to get help with a table thank you so much 😁🙏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel Martell Lumpkins",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T00:05:07.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, I'm trying a new service. I'm hoping for the best."
        }
      ]
    }
  ]
}