{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "gravityforms.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Greg Buck",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T03:30:26.000Z",
          "Titre": "I am not sure what the difference from…",
          "Contenu": "I am not sure what the difference from gravity form to contact forms is.  I have both set up and they are both terrible at letting spam or seo marketing crap get Into my contact sheet."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "EA",
          "Nb_Reviews": 3,
          "Date": "2023-07-27T01:00:59.000Z",
          "Titre": "You need to send my 2 years money back…",
          "Contenu": "You need to send my 2 years money back ASAP to my account  those you have taken out from my account without my permission."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A Bloom",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T09:29:46.000Z",
          "Titre": "We were hacked through your form and…",
          "Contenu": "We were hacked through your form and had to get rid of it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Debbie C.",
          "Nb_Reviews": 5,
          "Date": "2023-01-10T17:20:09.000Z",
          "Titre": "Not honoring their word regarding future add-ons",
          "Contenu": "I've held an unlimited Developer license for 12 years.  Gravity Forms stated that \"Future add-ons released for Gravity Forms will be available at no cost for developers.\" This is no longer true."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Winstead",
          "Nb_Reviews": 5,
          "Date": "2023-03-28T21:41:11.000Z",
          "Titre": "Buggy AF",
          "Contenu": "Buggy AF, not recommended for serious work. Support is horrible!"
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "Nguyễn Quốc Đại",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T11:25:15.000Z",
          "Titre": "Shady marketing moves"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charisse",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T15:40:57.000Z",
          "Titre": "Confirmation notifications are not…",
          "Contenu": "Confirmation notifications are not sent!!  It's a pain to go in and resend them."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Wouter",
          "Nb_Reviews": 6,
          "Date": "2023-08-03T07:46:07.000Z",
          "Titre": "Difficult to use",
          "Contenu": "Extreme diffict to use"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T07:20:28.000Z",
          "Titre": "Pretty good",
          "Contenu": "Works most of the time, net very user friendly"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "R. T.",
          "Nb_Reviews": 14,
          "Date": "2022-09-27T09:42:04.000Z",
          "Titre": "It's probably top 3 of all form…",
          "Contenu": "It's probably top 3 of all form plugins, but lacks the following things holding it back for years:1. Feature Request Portal for loyal customers like canny.io, where we could easily add bugs and requests! You should not make it hard for people to give feedback and vote on it! Especially when we pay high amounts yearly.2. Styling, theme, and looks are just super ugly and outdated.3. Hard to change the styling, even with CSS it's a big mess to change field sizes, centering etc.4. In an era of Typeform and Jotform, Gravity should be much more modern with buttonized checkboxes/multi-select lists, auto-continue after entry, continue by pressing enter, etc.5. CRM integrations are lacking, it's well integrated but there are many essential things missing, like company fields, which force one to buy another expensive plugin from a third-party seller.6. No integration with push services like One Signal7. Many basic things missing, like international phone prefix selector etc. which then has to be bought again from third-party vendors...8. Lack of deep integration with industry-standard builders as Cornerstone and Elementor"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Nabeel Molham",
          "Nb_Reviews": 3,
          "Date": "2023-08-03T04:17:05.000Z",
          "Titre": "Good reliable form builder that gets…",
          "Contenu": "Good reliable form builder that gets maintained regularly."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Bruce",
          "Nb_Reviews": 3,
          "Date": "2024-01-10T18:04:06.000Z",
          "Titre": "These guys absolutely super serve their…",
          "Contenu": "These guys absolutely super serve their customers!Whenever I have needs their support is all over it in a hurry.And Gravity Forms is the best solution I've found and I've used many contact forms. Absolutely the best."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jane Good",
          "Nb_Reviews": 1,
          "Date": "2023-12-23T22:44:09.000Z",
          "Titre": "Great plugin",
          "Contenu": "Great plugin, easy to use, a ton of integrations, by far the best of all the WordPress form plugins that I've tried."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T20:20:38.000Z",
          "Titre": "Gravity Forms processes our online payments cheaply and well",
          "Contenu": "For processing our membership payments and dinner reservations, etc. thru PayPal, Gravity Forms works and notifies us of each transaction, provides an audit trail. I could not find a  better solution for the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T17:35:48.000Z",
          "Titre": "EASE OF USE",
          "Contenu": "The ease of use makes Gravity forms the best forms plugin! I am able to quickly and easily create a detailed form and gather all necessary information. Gravity forms stores all submissions and I am able to download whatever information I need for reports."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cross Keys Village - PA",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T22:11:12.000Z",
          "Titre": "Easy to use and versatile",
          "Contenu": "Gravity Forms are easy to use and quite versatile. The \"duplicate form\" is very handy, making it easier to create variations on a basic form to suit your need."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Konnekt",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T03:33:48.000Z",
          "Titre": "Best forms for WordPress",
          "Contenu": "Availability of plug-ins to interface to CRM and EDM apps. Frequent updates that don't break existing forms. Good support. Lots of other users."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T22:37:31.000Z",
          "Titre": "Gravity Forms has a very well thought…",
          "Contenu": "Gravity Forms has a very well thought out user interface. This is a great convenience for both the vendor and the companies seeking qualified contractors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T22:51:10.000Z",
          "Titre": "Performs as advertised.",
          "Contenu": "Had to get all of our office forms online during pandemic.  Gravity forms worked like a charm.  Straightforward.  Easy to design."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Wakakirri",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T03:38:01.000Z",
          "Titre": "Highly Recommend!",
          "Contenu": "Highly Recommend! The flexibility and options available makes it such a robust system to use.  Can't live without this plugin!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Logan van Wyk",
          "Nb_Reviews": 9,
          "Date": "2022-06-27T10:29:16.000Z",
          "Titre": "Best and most cost-effective form builder for WordPress.",
          "Contenu": "Easily the best and most cost-effective advanced form builder for WordPress. I now never miss new leads and have been able to integrate with other software to ensure we process leads and support requests effectively."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Carl Hägerstrand",
          "Nb_Reviews": 4,
          "Date": "2023-07-26T20:33:49.000Z",
          "Titre": "Sometimes you just love something…",
          "Contenu": "Sometimes you just love something without really knowing why, this is one such occasion!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Beate",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T10:47:40.000Z",
          "Titre": "to automate business…",
          "Contenu": "Gravity is a tool to automate business processes. It works and the price-performance ratio is good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T22:41:34.000Z",
          "Titre": "The greatest WordPress Forms…",
          "Contenu": "The greatest WordPress Forms application of all time, hands down, no debate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T03:48:46.000Z",
          "Titre": "Flawless product.",
          "Contenu": "We’ve used Gravity Gorma for years. Such a powerful but super simple piece of software."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T10:58:33.000Z",
          "Titre": "I use Gravity Forms in all of my…",
          "Contenu": "I use Gravity Forms in all of my WordPress projects. There are lots of features but it's still easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T16:14:51.000Z",
          "Titre": "Ease of use",
          "Contenu": "Ease of use - we don't have any trouble understanding how to use the forms"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T14:20:07.000Z",
          "Titre": "Always makes things easy for the user."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Grant",
          "Nb_Reviews": 6,
          "Date": "2023-07-26T20:23:00.000Z",
          "Titre": "Really good."
        }
      ]
    }
  ]
}