{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "heatbit.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Broadhurst",
          "Nb_Reviews": 4,
          "Date": "2023-09-09T22:57:09.000Z",
          "Titre": "Garbage and wasted time…",
          "Contenu": "I ordered pre ordered heatbit and waited 18-20 months for it. It was a year behind the promised date. Was excited when I finally Got it BUT  IT didn’t work. Tried every fix that their customer service suggested. Tried to make it work for 2 months with their CS telling me to do this and try that. Nothing worked. This product is junk. The CEO is a fake and a lying chump. Their customer service is inept. Don’t waste ur money on this crappy product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phillip T Snyder",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T03:05:33.000Z",
          "Titre": "Ordered at the end of November and still haven’t seen my product.",
          "Contenu": "Ordered back in November for a February delivery and haven’t received my unit yet. Concerning issue is I’m not getting any updates and no one has bothered to reply to my questions about where my unit is. I’ve sent messages to their FB site and the support team via email. Disappointing as it sounds like a great product and I liked the website. So far the customer experience has been non existent. Not sure if I’ll ever see my product. We’ll see. Going to give it another week or two and then contest the charge and contact the better business bureau I guess."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T21:33:38.000Z",
          "Titre": "Received the Orange Heatbit today",
          "Contenu": "Received the Orange Heatbit today. Gorgeous!  But so far, it won't connect.  I've been in the queue for tech support for about an hour... had a tech say \"hello?\" but never responded back, so I'm still waiting.I have starlink internet, has that been an issue for anyone?  I have another Heatbit on order, so I don't know if I got a lemon or if they simply don't work with Starlink."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "C.W.",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T22:47:34.000Z",
          "Titre": "Won't connect to wifi",
          "Contenu": "Won't connect to our wifi via the app. No requirements listed on the website and customer service is nil. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Broadhurst",
          "Nb_Reviews": 4,
          "Date": "2023-03-27T21:42:25.000Z",
          "Titre": "What rhymes with Heatbit?",
          "Contenu": "What rhymes with Heatbit? How about Eatsh1t? This product does NOT work, and the customer service is terrible. If you talk to the CEO Alex, he basically tells you to eatsh1t…not my problem. Do you want the full story and details, just get in touch with me and I will spill all. But basically, I gave this company $950 as an early investor and adopter. High hopes for Heatbit dwindled away. Two years of delays and finally got a unit. Was so excited and…it didn’t work. I contacted their customer service no less than 20 times. They had me try all sorts of reinstalls, power cycles, test flights, etc. I spent at least 12 hours trying to make this work…and nothing. The product is pure CRAP.  Stay away. Heatbit is a scam and the CEO is chief scammer. I have all the emails from Heatbit CS and CEO Alex and will gladly share them with people in the media who want to write about it. So what did they do? They asked me to ship back the unit, no replacement unit, no free unit, with no compensation to me for all my lost time and effort, etc. What a terrible product and they don’t back it up. STAY AWAY from Heatsh1t."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Woodelles",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T02:48:30.000Z",
          "Titre": "Apparently this is vapor ware",
          "Contenu": "Apparently this is vapor ware. Product never received."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Major Dad Official",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T17:32:32.000Z",
          "Titre": "The Heatbit concept is absolutely brilliant!",
          "Contenu": "The concept is absolutely brilliant, the execution however is 'lackluster'. As far as a heater goes, unless you can log into the Heatbit system, the heater unusable and is nothing more than a small tabletop. In other words, the heating function is not available if you can't log in to the Heatbit wifi. I understand bugs and other issues, but this is unacceptable performance. After multiple, 15+ support requests, there has been no resolution. I lost track of how many times I have had to delete the app and reload it trying to get the appliance to function. I have tried to activate my warranty, but there is apparently some 'secret' steps I must take before that happens. I just don't know what they are, and they won't tell me either. I've even said 'Please' with no effect. If I had to do it all over again, I would PASS on purchasing the appliance and wait for the Mk2  version. Again, a truly revolutionary concept accompanied by insufficient support. Still waiting for some type of warranty resolution, but not holding much optimism."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N Kelsey",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T22:34:06.000Z",
          "Titre": "The idea of using the heat generated by…",
          "Contenu": "The idea of using the heat generated by the hard drive mining BC to warm your home is sheer brilliance! I think there was a bit of Ready, Fire, Aim for the initial launch however. Customer service is all but non existent in/ on the app. There is Support via email, but the turn around time is about 24 hours or more. Email customer support has a habit of merging ALL requests into one gigantic email string making the fixing of individual concerns all but impossible.There could be a bit more instruction on the use and trouble shooting included with the unit, or available online. For instance when you push the power button < than 1 second the button dims and nothing else occurs that I can see. It would be helpful to inform the user what is actually occurring. If you push the button longer than 1 second but less than 4 seconds, something else occurs. The only reason I found these things out was from a service request to CS. This could all be easily avoided with a more robust user manual greater than a single postcard with instructions printed on one side. Bottom line is if you gave just a bit more information to your customers, your customer support would not be so busy. Great idea, not so great of an  execution initially. I trust they will fix the bugs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Colling",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T01:29:15.000Z",
          "Titre": "I have owned the Heatbit for several…",
          "Contenu": "I have owned the Heatbit for several months, and true to its name it kept my garage comfortable during the winter months while mining between 12.9 and 14+ THs.  Difficulties were experienced during the initial setup and subsequent software updates, but a few hours and the problems were fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff McQuigg",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T17:36:53.000Z",
          "Titre": "Works as it is intended to do",
          "Contenu": "Works as it is intended to do - puts out a nice amount of heat.  There was some issues with the recent firmware upgrade (it just stopped running and the app remote control is now disabled) that took several hours to sort out, but I figure anyone that is into Bitcoin mining is technical enough to handle it.  I think they really went just a bit too far on the 'dumb appliance' scale by only having a single button and 1 status indicator light to let you know what's going on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathaniel Rees",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T19:45:40.000Z",
          "Titre": "The heater does a really good job and…",
          "Contenu": "The heater does a really good job and it's nice to be making money while it's heating my space. The biggest frustration is if the Wi-Fi goes out it doesn't automatically restart. It's a manual process to get it running again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig M",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T18:32:58.000Z",
          "Titre": "Heatbit in service and working well",
          "Contenu": "I put my Heatbit in service at the end of our cold weather months. I had a nice quite heater to kick on in the mornings and pretty soon had $5 worth of bitcoin in my account. Before I would have run another space heater and had no bitcoin. The only real issue I have had so far is the remote control in the app isn't functional yet, the team says they are working on it. I know they are working on the app, etc as both it and the firmware has been updated since I activated mine. They are responsive in the help function of the app. I have asked questions several times and have received friendly helpful guidance each time."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andy P",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T18:58:24.000Z",
          "Titre": "Heatbit delivers what it promised",
          "Contenu": "Heatbit is a good product.  It does what it promises which is generate heat and mine bitcoin.  User interface does need some improvements and hopefully that is forthcoming from the development team.There are also some minor setup and wifi connectivity issues that could be ironed out, but in the end, it does deliver.  For new users:  In particular it takes about 30 seconds to \"boot up\" which is something that is not mentioned anywhere, so at first it appears like it doesn't work, when in fact it is simply initializing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garrett M",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T19:26:28.000Z",
          "Titre": "Sleek, Simple and Solid performance",
          "Contenu": "Simple to use, quick customer support and the APP is very straightforward. Main issue so far has been connectivity issues after firmware updates and having to manually resync my heatbit to the app. But that will pass I'm sure. As far as performance, it was perfect for this past winter being in the north east. Only gripe is the remote feature in the app to cycle through power modes was initially to be rolled out in February 2023. Once that is up and running, it will be even more convenient to use. I would recommend for those who want a more realistic price entry into Bitcoin mining."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tian Zhao",
          "Nb_Reviews": 3,
          "Date": "2023-05-03T20:50:01.000Z",
          "Titre": "It's good",
          "Contenu": "It's good, but what about cooling 'cuz what about summertime???"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tori Hill",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T21:05:15.000Z",
          "Titre": "Love this heater",
          "Contenu": "Love this heater! Pulls less energy than our other electric heaters and makes some money back. The reason for 4 stars is setup was a b*tch. We have Starlink and had to contact customer service whose suggestions didn’t work. They were prompt to reply though and eventually we got it running through the manual setup in the help center. It’s been running great since achieving up to around 13 TH/s."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony Perlas",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T07:57:45.000Z",
          "Titre": "It's good and works",
          "Contenu": "It's good and works. Was mentioned by Elon Musk on using a miner as a heater.It looks good with a minimalist look. Has some usability bugs. Hope they can fix it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Ault",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T04:01:48.000Z",
          "Titre": "Not a review as much as a preview..",
          "Contenu": "Not a review as much as a preview.  I just ordered my Heatbit.  If I'm paying for electricity to run through wires and make heat, I might as well earn bitcoin at the same time.I expect I'll be very happy; but only one concern after reading reviews.  Some customers waited months to get their order.  If mine arrives after in March, that will not make me happy.  Are shipments still months behind?.... It looks like they are unable to ship my order.  It is one thing to have weeks of delay for a bitcoin miner, but I need the heat.  Lowering by one star and asking for a refund.  Stay tuned..Update 12/28: The heater shipped yesterday and should arrive tommorow.  Really not too bad considering the holidays.Excited again..12/29 Heatbit installed and running.  So far today $0.07 earned at the current exchange rate.  More importantly it is providing needed heat in a cold area (near our dogs pet door).  The bitcoin is just a bonus.  Additional benefit is talking with kids about energy and how it isn't destroyed but all converted to heat.  Naturally they pointed out the led (light) and fan (motion).Disappointed again:The rating roller-coaster continues (5 stars to 1 star).  The heater worked for about one month and stopped just before I was to get my first bitcoin payout.  I have received no useful assistance from the company in getting it working again and there are no manuals or guides online.  It is so disappointing that a product that could be so cool, is a let down because of bad execution.  I can't imagine this company surviving.  Maybe someone else will try later.  I suspect Heatbit is IBM Simon (Google it) not iPhone.  Now I just hope to salvage some of my investment.REPLY TO HEATBIT: I've emailed support and so far (many days) they haven't offered anything that has helped.  They keep suggesting that they will fix it remotely.  That would be impressive as I can tell from my wifi router it isn't connected to the internet.UPDATE:  Replacement unit has arrived!  Back up to four stars."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Anna-Maria Badura",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:47:41.000Z",
          "Titre": "It's a really good heater",
          "Contenu": "It's a really good heater, every detail is thought-out, you can feel how its creators made the effort to reinvent a very simple device and turn it into a statement appliance. Bravo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Hulse",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T17:11:52.000Z",
          "Titre": "My husband bought this heater last…",
          "Contenu": "My husband bought this heater last year, and to replace our old Dyson. I was skeptical at first, but can say with certainty now it does the job well and despite the higher price pays off."
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:09:53.000Z",
          "Titre": "This is the second season I'm using my…",
          "Contenu": "This is the second season I'm using my heatbit, and I have zero complaints. I've always been into innovative gadgets and loved the idea the moment I heard it. Unlike many other products with breakthrough ideas behind, Heatbit delivers on the promise: you get the unparalleled comfort together with monetary rewards. Insane engineering, easy-to-use and very smart"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T15:05:48.000Z",
          "Titre": "Innovative",
          "Contenu": "I think Heatbit is the biggest innovation in home devices since the invention of the remote control. It’s like there’s Heatbit - the only device that makes money vs all other devices that don’t. Very happy with my heater, can’t wait for new products"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:11:57.000Z",
          "Titre": "heat & money",
          "Contenu": "heat & money, 2 in 1Amazing concept, great execution, love the emails from founder with updates, shows the level of dedication"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Mariana Viana",
          "Nb_Reviews": 4,
          "Date": "2023-10-10T15:05:32.000Z",
          "Titre": "Love the idea of green computing and…",
          "Contenu": "Love the idea of green computing and using a single energy unit to do two jobs. It might sound a bit complicated but the device itself is simple. It's very easy to setup (took me 5 minutes) and you enjoy benefits from day 1. Great product, the airflow is very smooth and consistent, the cash rewards are a great bonus to offset electricity bills."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zafar Peeran",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T20:50:15.000Z",
          "Titre": "Well done!",
          "Contenu": "The only unexpected thing about my Heatbit was its size - slightly bigger than expected. Other than that - works just as advertised and made me $140 already though I'm not using it all the time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ryan",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T21:40:21.000Z",
          "Titre": "⭐️ ⭐️ ⭐️ ⭐️ ⭐️",
          "Contenu": "Heatbit is not just about the cool factor. Its commitment to efficiency and cutting-edge technology is what sets it apart. I've been using mine for several months now, it's a great product in every sense. I'm a bit sad they discontinued Heatbit One hopefully we’ll see it again down the line, but it also makes me feel like I'm part of an exclusive club :) Looking forward to getting my hands on the Mini as well can’t wait!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenika Peach",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T20:59:42.000Z",
          "Titre": "Great Heater",
          "Contenu": "This is a great heater for anyone to use especially during the winter time when temperatures really drop! It may look small, but the Heatbit Machine will keep you nice in warm while saving you some money on your heating bill! For those concern about noise with their heaters, this heater is nice and quiet so you won't have to worry about it's sound one bit! Another exciting thing about the Heatbit Heater too is it may make you a little bit of money in Bitcoin if you're into investing in Bitcoin as well!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gabriel Hanley-Dawson",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T16:34:37.000Z",
          "Titre": "Amazing product",
          "Contenu": "Amazing product. Can’t believe all these people complaining about minor defects of their devices. It’s a breakthrough concept and a great product. Obviously, some hiccups are inevitable, but from my experience team handles them with great speed and dignity. I’d recommend everyone get a Heatbit, no other heater would put money into your pocket, can’t wait to get my hands on second gen"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Craig Mallow",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T16:56:12.000Z",
          "Titre": "I have been using mi Heatbit One for…",
          "Contenu": "I have been using mi Heatbit One for over a year, and I'd say the only disadvantage is its size - the first generation is a bit bigger than necessary in my opinion. Performance-wise, it's a great device, helped me save around 100 pounds on heating already and shows no signs of slowing down"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Manglow",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T17:39:49.000Z",
          "Titre": "I purchased Heatbit One a year ago",
          "Contenu": "I purchased Heatbit One a year ago, and have been using it since. I must say, I am favorably impressed with its performance.The idea of combining home heating with Bitcoin mining is indeed innovative. The heat it provides is ample and comforting. As someone who's mildly interested in cryptocurrency, the idea of mining Bitcoin while simply heating my room seems almost too good to be true. It's a pleasant bonus, though I would advise potential buyers not to expect to get rich overnight. Nonetheless, it does offset some of the electricity costs, which is a sensible feature I've not seen in other heaters."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:38:38.000Z",
          "Titre": "My family really likes Heatbit…",
          "Contenu": "My family really likes Heatbit products. It's premium quality from materials to the app, and the only heater that can offset our bills"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T20:47:46.000Z",
          "Titre": "Beautiful and practical appliances",
          "Contenu": "Beautiful and practical appliances, great support team and very convenient app. Couldn't wish for more"
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "Blagoj Veleski",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T17:09:13.000Z",
          "Titre": "Great Heater",
          "Contenu": "I've been using Heatbit for over a year to heat my condo. I love the product and would recommend it to anyone looking for efficient and green solutions."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Aditya Chavan",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:11:53.000Z",
          "Titre": "Solution for Heat Or Eat",
          "Contenu": "The only solution for Heat Or Eat problem. Covers nearly 65% of my electricity bill and bitcoin is still far from its peaks. Imagine if bitcoin was at its peak. I am super excited about this product and will recommend anyone who looks to buy this."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Max Rembault",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T17:37:06.000Z",
          "Titre": "Perfectly happy with my Heatbit",
          "Contenu": "Perfectly happy with my Heatbit. The device was bigger than expected but it didnt bother me at all. The packaging was very nice, I properly enjoyed the unboxing. No problems whatsoever setting up my Heatbit - took around 5 min and it was quietly doing its job afterwards"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samarjit Singha",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T22:58:39.000Z",
          "Titre": "Worked like a charm!",
          "Contenu": "Wanted to get into mining for a while, but didn't really know how to get started. Naturally, this plug & play solution immediately caught my attention.Been using it for a month, and it has already generated 25$ worth of BTC without additional energy consumption. Also, really appreciate how it's quiet and also has an attractive and unique design.Loved it!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Julie De Mayer",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T11:11:38.000Z",
          "Titre": "I enjoy this device very much",
          "Contenu": "I enjoy this device very much. I have been using 3 Heatbits last winter in my large mountains house and they all did a great job keeping us warm and used less energy than our previous oil heaters. I would recommend heat it to anyone who likes cool gadgets, I think it’s great"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Felix",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T20:26:20.000Z",
          "Titre": "Happy as a clam with my Heatbit",
          "Contenu": "Happy as a clam with my Heatbit. I always loved getting innovative products before they hit the mass market, and I believe this one definitely will"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alex Brun",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T15:06:33.000Z",
          "Titre": "Brilliant product and team",
          "Contenu": "Brilliant product and team. I’ve been using the first generation model through 2022 winter, it never felt short of what was promised. My only regret is it wasn't available earlier as it would have saved me tons of money on my electricity bills. I've also preordered several Heatbit Minis, and cant wait to see what they come up with next. Cheers, team, keep up the good work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rj James",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T23:56:30.000Z",
          "Titre": "Amazing heater!",
          "Contenu": "This is an Amazing heater!, I love the sleek design, and it also works as a conversation starter  every time someone visits my studio!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Backwoods Baker",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T07:24:53.000Z",
          "Titre": "I absolutely love the orange and black…",
          "Contenu": "I absolutely love the orange and black Heatbit I bought for myself can't stop looking at it, the design is so amazing looking. Such a cool concept to heat up room fast and quietly and mine bitcoin at the same time while not consuming any additional energy. I knew I wanted bitcoin but the confusion and time it took me to mine my own was boring and a waste, this device does it all for me and mines a lot faster This is a great investment and gift for the winter. Stay warm"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andew Chen",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T22:39:54.000Z",
          "Titre": "Wonderful product",
          "Contenu": "I never thought I'd get into Bitcoin, but Heatbit changed that for me. They offer a high-end device that basically allowed me to offset my bills that doubled this year due to the energy crisis. It's a win-win product, and I'd recommend it to anyone who needs a heater"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Harry Edwin",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T22:44:44.000Z",
          "Titre": "A-m-a-z-i-n-g heater",
          "Contenu": "A-m-a-z-i-n-g heater, easiest 5 stars I’ve given. Next gen should be even better, can’t wait to get my hands on it 😜"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Arty",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T19:42:27.000Z",
          "Titre": "Cool gadget",
          "Contenu": "Cheers to the team for this gadget - very clever twist for a dull heater concept :) I’ve been using my HeatBit for a week now, thankfully it arrived before the onset of cold weather. As for the specs, it’s everything you expect it to be, and also good-looking, and very quiet for a mining device. I was concerned that it might consume more energy than the regular heater, but it doesn’t so I would recommend it to anyone who is into smart devices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rock",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T13:57:38.000Z",
          "Titre": "Heater works great in my bedroom!",
          "Contenu": "Heater works great in my bedroom! I turn the heat off in the house and use the HeatBit to keep my room at 72F. A great white noise generator too for falling asleep - about as loud as a refrigerator. And mines Bitcoin too. No safety issues and operates normally. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Javier Martínez",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T13:12:20.000Z",
          "Titre": "Very good product",
          "Contenu": "Very good product - I have one in my apartment and one in my office. Both work perfectly, and attract a lot of attention because of beautiful design and innovative concept. I'm very happy with this purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J.G.",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T15:40:49.000Z",
          "Titre": "Heabit is a great company and project.",
          "Contenu": "The Heatbit team has been very responsive with any issues and delivered an interesting new product to mine passively. Any new technology will have issues and delays, all part of growing the industry. Heatbit is definitely a real product, and keeps your room warm!"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T08:00:42.000Z",
          "Titre": "My only regret is I waited so long to…",
          "Contenu": "My only regret is I waited so long to get my Heatbit! It's been a game-changer for my home. Not only does it keep my place warm and cozy, but it also adds extra cash to my pocket. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M Malik",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T20:27:11.000Z",
          "Titre": "Brilliant idea and execution",
          "Contenu": "Never thought I would start mining, but here I am. Saw the ad and immediately fell for this device, I think the idea is just brilliant. There are not so many reviews so I decided to write one - the execution is just as good. The setup process is very straightforward, and they have an intuitive app to control my heater. The Wooden model looks great, even my wife loved it and it says a lot. I thought it was a little pricey but again it’s the only appliance in my house making me money, and I love checking my balance to see how much money it generates. Wish all the best to the team!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Alex",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T19:13:12.000Z",
          "Titre": "Not perfect but very good",
          "Contenu": "I can't say that my experience with Heatbit was easy but I still love my device. Can't wait for the next generation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DONALD",
          "Nb_Reviews": 3,
          "Date": "2023-04-23T06:51:02.000Z",
          "Titre": "I'll give them a 5 stars",
          "Contenu": "I'll give them a 5 stars. I'm in profit with the miner. Why pay for central heating with no way to profit? That's the selling point for heatbit. You won't get rich... well, maybe you will in several decades of mining bitcoin with heatbit.One thing they have to fix is that adjusting the heat on the app doesn't actually work.That said, they have been very nice and accommodating as I bought my heatbit, but put it on hold because I was on vacation, and when I came back, I told them it was OK to deliver it and they did deliver within the week.Oh, and if you want a video review, just search for DonaldLeeCrypto Heatbit Review. I don't do that for every product, but the ones I really like."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Matvey Levant",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T18:51:46.000Z",
          "Titre": "The product is the best!",
          "Contenu": "This product is great! Switching on is easy - plug and play concept works perfectly. The app has such a friendly-user interface, it’s simple and easy to use. This gadget is one of the best in my high-tech collection. Oh, my God, I am desperately awaiting for a winter! And this superb design of the heater! And this heater mines Bitcoin!!! Luckily, I got two Heatbit machines. Btw, delivery was fast while unboxing is something - very smart packaging! Thank you, guys! Very well done! Good job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Janke",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T21:00:43.000Z",
          "Titre": "Just got my two Heatbit heaters after waiting for a few months.",
          "Contenu": "I just got my two Heatbit heaters after excitedly waiting for a few months for them to arrive.  I got each out of the box and set up and running and mining Bitcoin in like 5 minutes. They each put out plenty of heat to keep my couple rooms warm just as advertised.  The app was a breeze to set up and operate too.  Great experience so far!!Cliff Janke, El Paso, Texas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doge House",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T01:54:27.000Z",
          "Titre": "After the firmware update I couldn't…",
          "Contenu": "After the firmware update I couldn't get my Heatbit to work. Got in touch with CS and got it up and running in a timely enough fashion for me. (3 weeks) Also those that have a concern about the cost of running your Heatbit, be sure you understand the future value of a Bitcoin. Be sure to factor that in. Last note: Happy to be part of the Heatbit Army."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lenny Cranny",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T20:29:52.000Z",
          "Titre": "Absolutely love my Heatbit",
          "Contenu": "Absolutely love my Heatbit. It’s the only device that generates me cashback, hope the team can make more appliances soon ☺️"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Eze Miori",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T22:29:05.000Z",
          "Titre": "Great design",
          "Contenu": "Great design, and it is excellent for people like me who aren't too into the crypto world. I can't wait to get rid of my dog's hair with the new Heatbit Mini."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Miller",
          "Nb_Reviews": 9,
          "Date": "2023-02-15T18:50:31.000Z",
          "Titre": "When I received my Heatbit",
          "Contenu": "When I received my Heatbit, it did not work. I contacted support and they gave me suggestions to try. After 2 or 3 trials they transtered me to a employee in the tech section. That employee had me go a couple of things and that did not work either. I was told that they would ship me a replacement unit. They did and the replacement unit arrived on Christmas eve. I plugged it in and ran the app. I took a couple of trys but it started working and has worked continuously since that time. It runs quitely. I am well pleased with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Austin",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T00:46:55.000Z",
          "Titre": "Heatbit is amazing",
          "Contenu": "Heatbit is amazing. Love how quiet it is, and warms up wherever I need. Plus, it’s mining bitcoin. Getting cash back while heating my living room during the cold months is a no brainer."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Victor Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T18:18:02.000Z",
          "Titre": "Love my Orange Heatbit",
          "Contenu": "Love my Orange Heatbit - the smartest device I've had :) It kept me warm through winter and made me over 100USD, looking forward to the new model. Thank you team!"
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T18:03:54.000Z",
          "Titre": "All good",
          "Contenu": "All good, no complaints. Note to the team: please make an air conditioner next 👨🏻‍🎤"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Luigi Rosato",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T14:05:49.000Z",
          "Titre": "Beautiful home appliance and it does…",
          "Contenu": "Beautiful home appliance and it does everything it promised. Very efficient heating, can’t wait to receive their air purifying model"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James S",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T16:41:10.000Z",
          "Titre": "Replaced my Dyson heater with Heatbit",
          "Contenu": "Replaced my Dyson heater with Heatbit - heats just as well and puts money in my pocket. Brilliant product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Johnathan Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T17:25:04.000Z",
          "Titre": "Works perfectly well for me",
          "Contenu": "Works perfectly well for me, love the innovation behind the idea and the great execution!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas A.",
          "Nb_Reviews": 4,
          "Date": "2022-10-27T06:23:29.000Z",
          "Titre": "LOVE HEATBIT",
          "Contenu": "LOVE HEATBIT!  Excellent product, exactly as described including easy set up, effortless use, warm, quiet, consistent minting with high TH/s.  I'm able to observe status and control device away from home using the app. Sleek.  The Heatbit team is fast to respond to questions, highly capable and very thorough.  The device was fully operational on delivery; the delivery was classy, really well packaged, and arrived fast after shipping was announced.  The setup was simple, effortless; plug in, power on, pair with app, enable wifi, start heating/mining bitcoin.  I had inexplicable failure of the app display five days into use; I wrote the team, the solution was fast, personal, and effective.  The heater is exactly as promised.  I am buying another for me, and intend to give as gifts this Christmas.  Thank you Heatbit, you are incredible.  Areas for improvement.  There is precious little information about this product.  The YouTube channel is empty.  My web searches reveal only dialogue in reddit comments; as this is a burgeoning project, this doesn't surprise or concern me.  There is \"FUD\" from tech pros describing this as overpriced, low yield; these critics direct me to explore home asic mining, which leads to questions of need for significant space, airflow, noise control, electrical hard-wiring, and fire precautions...Heatbit appeals to me because I am paying to heat my home, and this is the only plug-and-mint heater I've seen--Simple, effective, financially rewarding.  Heatbit will do well to promote customers are gaining any amount of bitcoin from energy otherwise lost to the single purpose of creating heat.  I'm pleased to be contributing to the network security by adding hashrate. The Heatbit is sealed, no easy access points to components, indicating to me, stay out.  There is no discussion of maintenance--vacuuming, cleaning vents, troubleshooting internal components; I'm unaware if performance component upgrades are possible, or is this a single use item?  I am very happy to use this product.  I will buy more of them.  The Heatbit team is excellent in responsiveness to inquiries, very good design, ease of use.  Highly recommend Heatbit."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrea De Longi",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:34:00.000Z",
          "Titre": "Lovely heater",
          "Contenu": "Lovely heater, very aesthetically pleasing and energy efficient"
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "Armen P",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T18:47:42.000Z",
          "Titre": "Very good quality",
          "Contenu": "Very good quality, great design, innovative concept"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Tom Andersson",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T21:05:09.000Z",
          "Titre": "Did wait for years for this",
          "Contenu": "Did wait for years for this. I got a heater 1 month ago and it works just like it should."
        }
      ]
    }
  ]
}