{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "heyabby.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesse Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T10:08:59.000Z",
          "Titre": "A Review to help New Buyers.",
          "Contenu": "Half and half 5 stars one box But 1 star on the other one. Well got 2 of them one of them is in excellent condition, no dings dents deformities door lines are correctly. Everything is perfect. However, the second one does have a defect within the metal in the inside on the lower bottom. The welding is separating from the door you can see from the paint. That’s not good quality control in my book, wood is smash on the back left side, thank God it does not affect installing the feet when I put them on. I’ve seen this on Discord from other users pictures the same deformity in the same spot. I don’t have the numbers of how many users this affect but I going to take a look into it and see if I can get some statistical numbers to see about this deformity in this particular location where the damage is. It’s more along the lines of quality control, and not damage. But it does cause light leaks which are visible which makes me feel bad and I don’t like to feel bad, and now have to buy some weather strips to fix a brand new item that came, think about that for a moment. Fixing a brand new item, maybe by their company standards this is a acceptable, but not for me it’s not I expect the item to come in the condition that it’s advertised in, not in any less especially for this type of money that paid. So know I have to wrap the box in a skin because I can’t stand the sight to look at the dent. It’s like looking at a dented Lamborghini off lot it really chap's my hide. I have seen other Abby box’s from the “Discord” and the damage was way more fare severe than mine, so I consider myself lucky. So if you’re thinking about ordering one of these you can “but just keep in mind” that there is probability of a 50/50 chance that your box that you ordered will have this deformity in the lower mid bottom of the door. I don’t want to send it back in fear of appraisal that the next unit I may get maybe in worse condition than this unit is in. So guess I’m just gonna have to live with, I shouldn’t have to though. Everything else synced up with the app works perfectly no hitch’s with both machines no problems at all whatsoever with the “APP”. I am happy that I didn’t order the OG or the Black edition considering, if the dent probability is gonna be the same, what would you wanna have dented Volvo or dented Ferrari? I like the company and I like the products that they sell, I will still do business with them, these review is for “NEW USERS” to make an educated intelligent decision on whether or not you should buy it or not. How do I feel about it? YES it’s worth it still even with the deformity, I would still buy it. But you may or may not feel that way about it that decision is up to you. There are on sale at the moment. I purchased two 420 boxes. Man I hope this helps new buyers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike mac",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T14:31:05.000Z",
          "Titre": "My brother and i  bought one hayabby…",
          "Contenu": "My brother and i  bought one hayabby and has nothing but problems and  will not replace the box with a good one or call him back.  The worst customer service i have emailed and call  so have my brother multiple time we feel that once they got our money hayabby dont care  # dont buy one you will be better off"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T18:33:05.000Z",
          "Titre": "The Company does not stand behind the product",
          "Contenu": "I received a defective box that the light never shuts off and goes into sleep mode. Hey Abby has had me try several fixes that have been unsuccessful.  At this time customer service and the technical team has stopped responding to my emails.  I have requested a replacement box and that this box be returned for the team to find out what the defect is.  Buying this Hey Abby box has been a huge time consuming hassle.  I regret it.  I would advise anyone reading this that IF there is a problem with a box that you buy.  You are on your own."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Harris",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T15:55:31.000Z",
          "Titre": "I ordered this unit about two months…",
          "Contenu": "I ordered this unit about two months ago and still have not got everything to it only a grow cam where's everything else at????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dree",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T13:10:25.000Z",
          "Titre": "Not worth it",
          "Contenu": "Edit: Hey abby - I couldnt finish growing my plant in the expensive Hey abby box. I would not deem that as successful! If customers thinking the product isn't worth it is fine.. I guess you won't last long. Not worth it. There wasn't anything for humidity control which is necessary for a healthy plant. I was told by support to put a towel over the box (didn't help) and mist. I ended up having to mist A LOT. I'm glad I waited to review after actually growing a plant because now there is humidity control, however, you have to pay more as its an add on. It should be included! It should have been in the ORIGINAL DESIGN. Also, THE BOX IS TOO SMALL. You can hardly fit a plant in there as is, now you have to fit accessories? It's not a good investment as it comes now. Our plant which was a smaller strain was getting too big. We consulted with support and they didn't even know what to do. We had to take our plant out (light burn) which grew even more so we couldn't even use the abby. The reminders and guides are very helpful (while the plant fits), however, everything else just makes it not worth it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mike levy",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:47:52.000Z",
          "Titre": "ORDERED 2 GROW BOXES . RECEIVED ONLY 1",
          "Contenu": "ORDERED 2 GROW BOXES , 2 SEPPERATE INVOICES. I RECEIVED ONLY 1. THEY INSISTED I CONTACT THE SHIPPING COMPANY , WHICH SIMPLY STATES THE SHIPPER NEEDS TO FILE A CLAIM. I NEVER HAD SUCH POOR CUSTOMER SERVICE IN MY LIFE. I WOULD NEVER IN MY LIFE TIME REFFER THIS COMPANY . I SUGGEST YOU PURCHASE YOUR GROW BOX ELSE WHERE. YOU WILL NEVER REACH THEM ON THE PHONE, AND NEVER RECEIVE A CALL.  DO YOUR HOMEWORK WITH THE BBB. SEVERAL BAD REPORTS . THIS COMPANY IS FLAT OUT TERRIBLE."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-11-29T19:02:12.000Z",
          "Titre": "Defective Box Hey Abby Does not stand behind",
          "Contenu": "My issue is that the light stays on and trying to repair has been a nightmare.  I paid over a thousand dollars for a product that has not worked as advertised since I received it.  The customer service it terrible.  Hey Abby has sent me parts to try and fox myself with no instructions.  I have stated that I want a replacement box.  Not my money back.  I want what I paid for.  Nothing….  I bought directly from Hey Abby I regret that I wished I would have purchased from Amazon.  My advice to someone reading is to contact the company with an issue before you buy to see how frustrating it is dealing with Hey Abby.  I understand that I got a bad unit.  I read the vastly positive reviews before I bought.  It’s a good looking box.  A bit louder that I expected.  Sounds like a fish-tank.Hey Abby reply’s of 1 on 1 support is not the issue. THE BOX IS DEFECTIVE.  The light does not go into sleep mode.  It has never turned off unless I turn the power off switch.  They are Not standing behind the product.  Before buying Beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Grateful Grower",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T10:41:50.000Z",
          "Titre": "Poor quality",
          "Contenu": "I would give zero stars if that was an option.  I have had issues since I purchased this machine.  The first unit arrived damaged and was unusable.  The replacement arrived dented and damaged but in working condition.  They bribed me to keep with free subscriptions.  Big mistake on my part.  Should have sent it back.  Within 2 months the temp sensors were not working.  So far I have replaced the board, the temp sensors, and the pump twice and it has been in use less than a year.  Now the machine has a buzzing sound so loud I had to put the unit in spare room and Abby is telling me it is not a quality issue.  How is it not a quality issue when the box is not working as intended.  They will not support me to full resolution on this issue and they tell me my box is out of warranty. Meanwhile the issue started when the box was in warranty and never resolved. They do not stand by their product.  I do not recommend.  Get the vivosun grow box!  The only thing they have going for them in the grow consultant.  He rocks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian S.",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T20:14:14.000Z",
          "Titre": "Terrible customer service, Damaged Product, Deceptive Marketing.",
          "Contenu": "Terrible customer service! Box came damaged. Was instructed to fill out a claims form and submit pictures. Told I would have a response in 48hours. It's been a week and no response. Ordered the OG box, the internals are not what's pictured. They just slapped the door with the window on the old box. Filed a dispute with the credit card company since they're not responding. Do yourself a favor and don't buy this product. Their response is disingenuous. They offered a $50 credit on a thousand dollar box and that’s only after 2 weeks of no response. These guys are terrible. The only way to get a response is to go on discord. I stand by my review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T22:59:36.000Z",
          "Titre": "Poor Customer support",
          "Contenu": "Poor Customer support, sucks big time!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T17:48:34.000Z",
          "Titre": "Dealing with a defective Hey Abby OG",
          "Contenu": "My issue is now going on it’s 7th week.  Still no resolve.  My Hey Abby OG light has never gone into sleep mode (turned off). The light has always stayed on since day 1.  First Hey Abby has had me take the back panel off.  (The screws are about the cheapest screws made.  If you were to have to do this task make sure that the Phillips screwdriver has a flat tip.) I was to check all of the connections. No resolve.  Then is was determined that I had to replace my door lock.  That requires taking half of the box apart.  Without any directions mind you. That was said to be the cause of my issues.  It was not.  Issue continues. Then the issue was thought to be some internal internet issues that also reported as the cause of the light staying on and said to have been repaired from the home office.  The issue still continues.  I would not recommend doing business with Hey Abby.  I have asked that I be sent a replacement several times and gotten no where.  They can have this box back and have the engineers figure out what is the cause. Not me.  Customer Service is Terrible.  All attempts to fix my problem is via email and can be several minutes to days later ( weekends) before you get a reply.  I am asking Hey Abby to make good on what I bought from them for over one thousand dollars.  I paid for a box that works. That is not what I was sent. I believe that this Box probably is what is what they said it is.  That’s why I bought it.  But dealing with this company is terrible.  You have been warned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T06:52:33.000Z",
          "Titre": "There are zero directions on how to…",
          "Contenu": "There are zero directions on how to work anything in this piece of crap.  I have to Google any knowledge I need to utilize the machine. I understand it is app based, however, it forces you to contact some chat to understand what is going on. Nothing has worked. I have had to utilize three seeds and I still don’t know if that one is even working and it was $100 for 6 seeds. This thing is stupid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen O",
          "Nb_Reviews": 4,
          "Date": "2023-09-02T01:51:10.000Z",
          "Titre": "Defective product, substandard customer service…",
          "Contenu": "So frustrated with this terrible product. It never worked. The light never turned off and the door latch was defective. They expected me to do the electrical repairs and when those didn't work they disappeared for days and didn't answer emails. Now they say that they will supply me a shipping label? I need a whole shipping box unless you want me to slap a label on the unit and send it back unprotected. This thing is huge and heavy. Terrible experience overall and I have wasted a month of my time on it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Loren Fitzgerald",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T14:03:54.000Z",
          "Titre": "Jake",
          "Contenu": "Jake Came through for meafter writing this review I found that when I really needed them because a clone that I had brought to me from Cal was in danger of dying I sent several emails requesting help not only with my box now not communicating with my network and my plant going into slow death mode.At this point I am now ready to sell the box as JUNK my plant appears to be dying. THANK YOU VERY MUCH FOR NO HELP!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kyle gustafson",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T03:26:41.000Z",
          "Titre": "There customer service has been bad trash…",
          "Contenu": "There customer service has been trash in my option.  I ordered 2 of them months ago and was never any mention of back order tell they took my money.  Which seems really bogus and not trust worth. Sense then it's been moved back and they've totally just give you a computerized message. I'd spend the extra money and choose a company that values there's customers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Rexroad",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T15:23:38.000Z",
          "Titre": "Don't even consider this junk",
          "Contenu": "Not worth the time or money. Kills more than it can possibly grow. Nutrients stunt and kill clones. Customer service is non-existant. Worst purchase I've ever made. What's the return policy?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david bunker",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:46:29.000Z",
          "Titre": "Misleading marketing and horrible customer service",
          "Contenu": "Boxes were delivered with latches that were not installed properly. App tells you the door is still open hours later. If you fill the water to the line where it says it ends up leaking and ruining your floor or any furniture next to it. I have water damage on my great grandmother's antique hutch now. Asked about a return and they ignored me. Customer service can take over a day to respond. They ignore your questions when they do respond. Every box includes a 3 month subscription, but when you buy a box + subscription you only get part of the subscription because they include the original included subscription as part of the deal. I only received 6 months of fertilizer when I ordered my box which includes 3 months + 6 months subscription. Asked about what they would cover for a return since the water issue is a build issue that they knew about and said they will address in future models, and the latch problems. They will not even talk to me about a return even though I reported problems in the time frame. Also took them a week to tell me where I could leave a review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duran Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T15:54:46.000Z",
          "Titre": "critical support lacking",
          "Contenu": "When needing critical support, response leaves much to be desired.  The device malfunctioned 3 weeks into a new grow.  Reached out to support for help and only received a “bot” response with general information - which is completely unhelpful.  😡"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The real deal",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:39:15.000Z",
          "Titre": "The company is owned by a money hungry guy who hates feedback",
          "Contenu": "Just buy the new viviosun tent system like this one. Get more for less money lol"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "An actual grower",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:42:37.000Z",
          "Titre": "Disappointing Experience with Automated Grow Box",
          "Contenu": "I recently purchased an automated grow box with high hopes for a hassle-free and efficient growing experience, but unfortunately, my overall experience has been far from satisfactory. I have to rate this product with just one star due to numerous issues that I've encountered during my time using it.The primary concern I have is the severely limited yield, maxing out at a mere 4 ounces. Achieving even this modest yield requires an excessive amount of daily attention and care. The promise of automation falls short, as the machine demands constant vigilance to maintain plant health.One of the major letdowns is the inability of the grow box to prevent root rot and mold growth. Despite weekly deep cleaning, these issues persist, making it an ongoing battle to keep the environment conducive to plant growth.Moreover, the unit emits strong odors even with the supposedly effective filters. This not only compromises the discreetness promised by the product but also raises concerns about the effectiveness of the filtration system.Light leakage is another significant problem I've encountered. The grow box fails to contain light effectively, disrupting the necessary light cycles for plant growth. This oversight is particularly troubling for those who require a controlled environment for their crops.The internal design flaw involving magnets for hooks is baffling. These magnets, intended to assist in organizing and securing items inside the box, instead leave behind unsightly scratches, diminishing the overall quality and aesthetics of the unit.Lastly, the nutrient solution provided has proven to be too harsh, causing leaf burn and further complicating the delicate balance of plant care. Adjusting the nutrient levels has been a constant struggle, leading to additional stress on the plants.In conclusion, my experience with this automated grow box has been marred by a multitude of issues that outweigh any potential benefits. I would caution fellow growers to thoroughly research and consider alternative options before investing in this particular product. It falls short on multiple fronts and does not live up to the promises made by the manufacturer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob Tulk",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T21:54:00.000Z",
          "Titre": "Can’t get anything to grow",
          "Contenu": "Can’t get anything to grow. Support is unhelpful. When selling your usb accessories you conveniently leave out the fact that you can only use one so I paid for 2 I can’t use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Calderon",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T19:32:01.000Z",
          "Titre": "The machine has dents on it",
          "Contenu": "The machine has dents on it. The accessories don’t work well. They don’t turn on at the desired temperatures and the costumer service is horrible. They are telling me to keep it when I didn’t pay for a dented hey Abby. They refuse to make it right. So I’m now in the process of returning the hey Abby for my money back. Wish I never got involved in machinery. It was a gift from my wife. Bless her heart but dam the hey Abby. Horrible piece of equipment"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T23:38:01.000Z",
          "Titre": "Update 11/ 16 / 23. Defective box",
          "Contenu": "I am having great difficulty in starting plants from seed in the box.  It is made for clone plants and not seed in my opinion. There are no written guidelines so If you are not a technical computer / app person like me probably not a good fit.  The pump makes more noise than expected. I don’t think the door closes quite properly. It’s a nice quality grow box otherwise.  If I were to do it again. I would pass on buying it. Just one of those expensive regrets you make in life.Update. After Three attempts at starting.  Come to fine out that the door lock is defective.  Two full days of multiple emails. The technical support is all done via email. So you may wait twenty min before someone reads and ask another question.  The customer support is terrible.  Again The customer support is horrible.  My advice to anyone is:  To before buying try and contact customer service.  1 out of 7 calls was answered.  I believe the customer service person to be someone who is working from home.  Sounds like kids yelling in the background.  I am sure that most people do not have issues with it he box. I have from day one.   All tech support is via email.  The device has its share of issues. Check out all of the template already made how to fix common issues.  I had given it two stars I have reduced it to one.   I did not pay to be on the floor unscrewing things, pressing wires and tabs Checking this videoing that,  not to mention the now 4 packs of fertilizer that has been waisted.  When I read reviews I read the best and the worst. My advice is to Try and contact with an issue before you buy and there is an issue. Mine was a lemon.  Otherwise the box looks good and seems well constructed.  Mine just does not work as advertised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Calderon",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T03:30:08.000Z",
          "Titre": "Horrible product with even worse…",
          "Contenu": "Horrible product with even worse customer service. Won’t respond to my emails. Abby was delivered damaged. I’m asking for my money back and they refuse to respond back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tobey Harris",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T07:06:47.000Z",
          "Titre": "Great product horrible team.",
          "Contenu": "After a bunch of emailing back and forth on when I would finally get my heyabby. I received an email stating that they were going to send me a p h meter for all of the trouble that I had to go through like sending multiple signatures of the same request because heyabby team lost it, not knowing if or when they were going to send it. I was almost about to cancel because I had to wait  three months to get it... ,but that is in the past, now today one month after they said they were going to send a p.h meter it never came.... horrible HORRIBLE COMMUNICATION.... I love the product ,but if I had to buy it again or recommend this product to someone else. I would say no.... save yourself the trouble of dealing with the heyabby team."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T06:20:48.000Z",
          "Titre": "Light leaks, dent, broken wood panel and more!",
          "Contenu": "Light leaks, broken wood, cracked plastic, more light leaks inside, lack of customer service even with subscription 1 on 1, bribes to take subscription instead of replacing broken box, water leaks, more light leaks, you have 0% control over the box, the humidity doesn’t hold, it is in no way climate controlled. Good thing, it looked good in my kitchen before having to buy black weather striping to seal the leak but that didn’t work so then bought white magnet strips. Definitely doesn’t look like the pictures. Not my first grow, I actually did 20,000 plants in my state with a university and own a business which I wanted to sell the Abby in. Not a chance, even if they did distribute wholesale which I wouldn’t ask at this point as I’m pretty sure they are all in china. They answer no earlier than 10-11pm est on discord and no earlier than 4:30am via email. I’ll use them until something else comes out since I suppose it still looks better than a tent in my kitchen. No issue has been resolved to date btw other than a small refund when I have 2 boxes that don’t work right. One doesn’t even drop the nutrients that come stuck together because the solenoid doesn’t work. Anyway, give it a year or two and if they are still around then buy with caution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Granger",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T22:48:10.000Z",
          "Titre": "Haven't even received the product",
          "Contenu": "Haven't even received the product, and I'm giving them one star. ordered The product was supposed to be shipped out in June.I still have not received it. I'm supposed to receive it on September 5th. Company acts like it's no big deal that.  The product has already been paid for, and I haven't received it yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T17:03:58.000Z",
          "Titre": "My mother continually told me that if a…",
          "Contenu": "My mother continually told me that if a person cannot say anything good they should say nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Krause",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T00:09:42.000Z",
          "Titre": "Support is TERRIBLE",
          "Contenu": "Support is TERRIBLE. Product is under developed and seems like beta test VS a production appliance. I would NOT RECOMMEND."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aj Farmer",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T18:42:03.000Z",
          "Titre": "Trash product",
          "Contenu": "Trash product, trash customer service. Font waste your money or time dealing with heyabby."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "April",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T15:04:20.000Z",
          "Titre": "I reached out for help",
          "Contenu": "I reached out for help.   Was prompted to pay AGAIN for the 1:1 support. I still haven't gotten it.  I read your bulll sh!t stuff.  Watched the videos."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T23:52:19.000Z",
          "Titre": "Piece of Trash don't recommend anybody…",
          "Contenu": "Piece of Trash don't recommend anybody to buy this just buy a Grow tent"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Duran  Johnson",
          "Nb_Reviews": 5,
          "Date": "2023-09-01T15:59:03.000Z",
          "Titre": "My grow box stopped working…",
          "Contenu": "My grow box stopped working and the support has been awful.  No one has even bothered to talk to me.  So sad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Krause",
          "Nb_Reviews": 2,
          "Date": "2023-03-31T12:50:14.000Z",
          "Titre": "Poor under-developed product",
          "Contenu": "Poor under-developed product. I do NOT recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kyle Gustafson",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T06:14:49.000Z",
          "Titre": "Horrible customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Mcquade",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T13:33:17.000Z",
          "Titre": "No communication."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "KaB BaM",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T17:51:17.000Z",
          "Titre": "Customer Service is Meh...",
          "Contenu": "Customer Service is Meh...I give two stars because I did get a response, but it wasn't helpful at all.I eventually figured it out on my own.Not sure the customer support cost is worth what they give you now."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Holt",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:54:50.000Z",
          "Titre": "Ordered the so called automated…",
          "Contenu": "Ordered the so called automated humidifier and behold it does not work as described. It does not shut off automatically so just burns through the water and continues to run till empty. They say they are working on it but let’s be honest they seem to be selling things they hope will work in the future which is a bit annoying. Nothing with this company is cheap and everything depends on the app which I am having doubts about for long term stability. App goes down and we are stuck with a worthless expensive machine. I have had several challenges from shutting the door which should be basic to understanding the real purpose of the very limited dial which looks nice but does very little for me. Twist to open and gives us the impression that it is valuable but still don’t see it. The instructions for this were terrible because they simply say automated by app. The app took a bit to get used to which is ok but things are backwards at times and not instinctive to the user. Took several weeks to understand about the expensive help that we pay for. Then the help was not reading my questions and giving me half answers. The window was stained when I got it and I think it is between the coating and glass. The main machine is cute and appears to be solid but all these failures and issues makes me believe it is just another Chinese made product in the end. Yes made in China."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NA",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T22:12:49.000Z",
          "Titre": "Damaged product",
          "Contenu": "•  Starts at 5 stars. Product looks nice and seems like it should function for what I need.  •  Product was damage during shipping (-1 star)  •  Customer service representative said \"Yes\" to providing me with 2 free subscriptions as compensation for the damaged product but then it was denied when escalated (-1 star)   • I now believe the grow box isn't functioning as intended, which could be from the shipping incident. The App said during the germination process, the light should be off for 18 hours. I haven't seen the light turn off ever and I believe it may be a faulty product (-1 star)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh Moore",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T13:37:45.000Z",
          "Titre": "Customer service communication sucks.",
          "Contenu": "Communication with customers is very lacking, my package has been in transit for a month now. They keep giving me the same auto reply. I won't be buying from this company again. Also all accessories come from china and it's about a 2-3 week wait for everything. Maybe even longer if shipping has issues like mind does."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DERRICK THOMAS",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T03:11:47.000Z",
          "Titre": "The trellis with the magnets don't fit…",
          "Contenu": "The trellis with the magnets don't fit properly.   The net does not stretch from corner to corner so I had to buy some hook extenders"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "julian Robinson",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T11:16:02.000Z",
          "Titre": "If all functions worked properly on the…",
          "Contenu": "If all functions worked properly on the hey Abby app and if customers service didn’t take like 4-5 days just for a simple question I’d give 5 stars other than that the box works decently not perfect but decent."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TM",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:12:13.000Z",
          "Titre": "Started Out BAD..has Changed to a...",
          "Contenu": "Will wait on review till issues are solved...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T00:37:57.000Z",
          "Titre": "Technical errors?",
          "Contenu": "So, I tried to purchase a subscription, but it wouldn’t let me. So I made other arrangements for nutrients. Then randomly 3 weeks later I get charged and an email saying it’s on its way. Luckily, not a problem. But I also thought I’d get the same package I got the first time with some of the accessories, but it was a slimmed down package for the same price. There also wasn’t info on how to add the subscription to my heyAbby account. $75 is pretty steep for what you get, so I’m not sure if I’ll do it again. Otherwise I really like my system, and am almost done with my 2nd plant."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kaitlin",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T16:30:52.000Z",
          "Titre": "Not worth the amount of money they charge",
          "Contenu": "No seeds will start in the Abby. Tried 10 different seeds. For something so expensive it should be able to hold humidity or come with something for it already. Honestly not worth that amount of money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben Zimmerlee",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T04:38:26.000Z",
          "Titre": "Your bringing up sore feelings about…",
          "Contenu": "Your bringing up sore feelings about you and the service so you flunked now reward me for your messup"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T14:16:01.000Z",
          "Titre": "The machine worked as expected",
          "Contenu": "The machine worked as expected. The subscription service is a waste. Between unreliable chemicals given and even worst customer support for first time growers you have to rely on other growers for help when you need it or have to wait 3 to 5 days for someone to reply."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Dillard",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T13:34:28.000Z",
          "Titre": "I got my hey Abby 420 it's okay the…",
          "Contenu": "I got my hey Abby 420 it's okay the voice control feature does not work. The door doesn't close easily. But other then that hey Abby is okay. Shipping was okay my package was to be signed for but the shipping signed it and left it under my carport I have cameras around my home so once I saw them delivered it I left work to pick it up. So watch out for it. It's the holidays and people like to steal products out of people driveways and carports."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Hampson",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T15:53:18.000Z",
          "Titre": "You need to issue a parts list with a…",
          "Contenu": "You need to issue a parts list with a schematic on how to tear down and put together !!  and at least 3 more usb outlets, and software to run the cammer ,fan, and humitfier. other than that the 420 box is perfect. Im on my first grow and it looks fantastic"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:08:53.000Z",
          "Titre": "Many issues with this grow box",
          "Contenu": "Many issues with this grow box. Only one usb device can be attached at a time using their smart options. The smart humidifier is to small and doesn't stay at a constant level, either over 68 or under 38. The on/off rarely works correctly. The sleep function for the external light and chime can only be off for 12 hours at a time. There should not even be a chime on this. The heat uses the temperature in the room for it's internal temperature. The drain feature pause doesn't work but you can self pause. There are good things about this. The self contained features are great and there is no smell.  The drain feature is a great option. In the future they need to have an internal humidifier and some internal heater"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 3,
          "Date": "2023-10-05T03:56:56.000Z",
          "Titre": "Good customer service but the fact that…",
          "Contenu": "Good customer service but the fact that I was missing the square growing sponge to begin with is a bit ridiculous."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul T",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T19:08:04.000Z",
          "Titre": "Hoping for a good end result",
          "Contenu": "After seeing many online ads, I decided this would be a good idea for me (buying 2 of the HeyAbby 420 edition boxes). Here are my pros/cons so far, but I am only at Week 3 Day 1 for my 2 boxes (seed has tap root but does not have roots and stem yet to be transplanted)Pros: easy to setup; app walks you through setup and stages with both video and bulleted steps; good size; quiet; Cons: 1) I ordered the 3 mo subscription for 1 box and a year subscription for the other box, by the time my boxes finally arrived I was informed that my subscription ended for the box with the 3 mo subscription, but the box just arrived. The subscription shoukd start on the day the box is delivered, not months before when my order could not be fullfilled due to limited stock.2) The box itself is nicely designed with 1 major flaw, every smart electrical accessory that is sold for the box connects with a USB cord but the box only has 1 USB port. If HeyAbby is selling/advertising to buy these accessories to improve the health of the plants, they should either sell a splitter too or be very clear, that only 1 accessory can be plugged into the box itself.I bought 3 accessories for each box, before the boxes were delivered so I had no idea...unfortunately I now eithet need to rotate out each accessory when not in use (which defeats the purpose of smart accessories), or I need to run cords between the door seems to plug in externally.3) When I reached out for assistance setting up my smart cam with my boxes, I recieved time out errors. I reached out to support for help with this, but all I was told is to read the manual and reboot my cameras. I did both, neither resolved the issue. I tried reaching back out to support and was given the manual to read again and was told it is a network error. I checked my network, it sees the cameras and shows they are receiving signals from my network. I do not feel the support is as good as it is advertised. I waited days to get my first response, the speed of the support is not good if it does not resolve the issues. If there is not a follow up, then the quality control of support needs to be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Duran  Johnson",
          "Nb_Reviews": 5,
          "Date": "2023-03-13T17:57:49.000Z",
          "Titre": "The device is great!",
          "Contenu": "The device is great!The support provided is too generic.  If I had to depend on the support provided, I may have lost my plant because the guidance is sorely lacking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leon Agee",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T04:24:22.000Z",
          "Titre": "Wish I knew",
          "Contenu": "The way it was presented, I thought I wouldn't have to do any work and everything would be fine. Not the case. I gotta go but more things just to have a fruitful grow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STUART SMITH",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T14:36:43.000Z",
          "Titre": "Everything was so so!",
          "Contenu": "I didn't like how when I ordered my OG box it stated that it was going to be shipped the 25th of this month and then all of a sudden somebody informed me from your team that if I ordered past April 19th or something that it wasn't going to be shipped till the 10th of next month but besides that everything's been pretty good except for when they said my humidifier was being shipped and actually the fan was shipped so I hope my humidifier will still come but besides that I have no other concerns"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan Benson",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T16:55:48.000Z",
          "Titre": "My package came and my Abby was cracked. My Abby also won’t open when I ask it to."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Oswalt",
          "Nb_Reviews": 3,
          "Date": "2023-03-01T16:36:43.000Z",
          "Titre": "Problems not solved!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Hogan",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:36:41.000Z",
          "Titre": "Had an issue with my abby disconnecting…",
          "Contenu": "Had an issue with my abby disconnecting to my router on its own and not connecting again when I try to connect it back to the system.  I contacted the hey abby team and they told me to a step-by-step for the system that wasn't on the tips page.  They responded in a timely manner so that it didn't affect my plant I had growing in the abby.  I really appreciated the fact that they where professional with the step by step support in helping me do so in the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyon",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:29:31.000Z",
          "Titre": "My 420 arrived today",
          "Contenu": "My 420 arrived today, as scheduled in perfect shape! I will say that the packaging is above average! Everything is synced with my app and working properly at this point. Five stars is hard to get!. 😊Years of retail!But good job so far!Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Hammon",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T04:35:50.000Z",
          "Titre": "Amazing machine",
          "Contenu": "Everything was explain perfectly and the problem was solved, would be 5 stars if the wait time for was a bit more expedited then it was but overall amazing experience with Jake and Rose. Sending positive energy and good vibe everyone’s way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Forester",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:10:13.000Z",
          "Titre": "Really love my Abby but…",
          "Contenu": "Really like my Abby however there are some downsides such as the app that is the biggest downside with this system. It can be buggy or flat out not work however the staff are very knowledgeable and are there to help I wouldn't call it a perfect experience but I would definitely recommend it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyon",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T23:54:01.000Z",
          "Titre": "Patiently waiting",
          "Contenu": "Hey guys, received my starter kit yesterday everything looks intact, still waiting on delivery of the Grow box, but being that it is post black Friday, I understand the delay, seedlings are ready, and we are excited"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason MCKENNA",
          "Nb_Reviews": 2,
          "Date": "2023-08-27T03:20:00.000Z",
          "Titre": "COMPANY IS STILL NEW 1ON1 COMPLETELY…",
          "Contenu": "COMPANY IS STILL NEW 1ON1 COMPLETELY POINTLESS FOR THE MOST PART MOST UNIT'S ARE DAMAGED IN SHIPPING TRANSFERRING ETC! YOU PURCHASE THE UNIT FOR 1K & HAVE TØØ PURCHASE HUNDREDS OF MORE DOLLAR'S IN ACCESSORIES ETC! 🤦‍♂️ 🤔 😡 😕 EVERY APP UPDATE EITHER LOCKS U OUTTA UR MACHINE OR WORSE! CAN'T BRAGGING RIGHT'S IN PRO MODE! SHOULD'VE MADE IT A FOOT TALLER TØØ! IN NORMAL MODE CANT WATER UNTIL YOU DO CERTAIN THINGS..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "thomas heins",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T00:38:51.000Z",
          "Titre": "My abby review…",
          "Contenu": "Very helpfull for a first time I love how easy it is and how quickly someone answers any questions and are friendly. The only thing negative I would say is the door isn't quite sealing and is slightly askew."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jay Malo",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T04:43:06.000Z",
          "Titre": "Overall I'm very pleased and would buy…",
          "Contenu": "Overall I'm very pleased and would buy another should the need arise. However there's still some small bugs with the app and website (unable to login, random crashes, no push notifications) that do cause frustration at times. I'm very hopeful for the future as there's still a lot of things that could be rolled out for an even better user experience. Hopefully the devs are keeping up on the user wishlist and keep making improvements. Support is for the most part is very quick to reply and their knowledge is very very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:26:55.000Z",
          "Titre": "The product is great for first time…",
          "Contenu": "The product is great for first time growers they make it easy with the app. If there’s any problem with your grow you just send them a message and they respond is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brittany Fank",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T22:20:14.000Z",
          "Titre": "The 420 grow box is awesome",
          "Contenu": "The 420 grow box is awesome! I’m starting from a seed so I haven’t seen all the features yet. The downside is that you’ll have to wait awhile to receive it (1 1/2 months) and know that all their accessories come directly from China so it’ll take close to 2 months to get to you (they transfer to USPS). When it arrived, it had damage on one side. Make sure to submit a damage claim to get a partial refund."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Harrop",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T23:32:12.000Z",
          "Titre": "Machine itself is awesome .",
          "Contenu": "Machine itself is awesome .. I have started growing and everything has been a really smooth transition. My only gripe is that the subscription is sent but I never got a code or anything confirming subscription and it tell me my subscription ends in 3 months when I bought the 12 month one. Otherwise an amazing product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T18:16:26.000Z",
          "Titre": "It's getting better over time",
          "Contenu": "Things have gotten better over the past 6 months. It's a newer company and they are going to learn from the mistakes and it's going to keep getting better. They do listen to feedback and make changes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory W",
          "Nb_Reviews": 6,
          "Date": "2023-08-08T18:53:23.000Z",
          "Titre": "Really Amazing",
          "Contenu": "First of all, this system is so fun and is working better than I thought it would. I'm in Maryland and we just became legal. I have been ' medical ' for a long time. So I purchased a Donny Burger #5 clone from California. Got her in the Abby and she is smiling up at the beautiful LED's growing like a weed!!I am very happy I picked this way to grow. I can't believe how fast she's growing. Sorry I was rambling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Terwilliger III",
          "Nb_Reviews": 3,
          "Date": "2023-03-15T18:36:41.000Z",
          "Titre": "Good product/should allow users to control more",
          "Contenu": "So far the product is good.  Only thing that I dislike about it is that you have no control over the lights!!!   Mabe in the future when they make enough money off their subscriptions they will allow you access to control your machine yourself.   The Plus side of this grow box is that it will educate you!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T12:22:23.000Z",
          "Titre": "It could be a little better…",
          "Contenu": "So far so good the only thing I would say could’ve been better was humidity control inside and the fans could be a lot better so that people don’t have to buy extra stuff but I get it, it’s the money game !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "luis torres",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:45:33.000Z",
          "Titre": "im still using the abby but i think a…",
          "Contenu": "im still using the abby but i think a lil more wider would have been perfect. more like a 6 inches"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Moyers",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T18:30:57.000Z",
          "Titre": "I bought like 3 items and 2 of them…",
          "Contenu": "I bought like 3 items and 2 of them were sent in a different package with a separate tracking number and they forgot to mention that, but other than that great experience."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Leera",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T07:34:56.000Z",
          "Titre": "I have a few suggestions.",
          "Contenu": "I have a few suggestions.As a person completely new to growing cannabis and hydroponics, along with a ton of mistakes I made I am offering the following suggestions.1. Instructions should be broken down step by step.  I watched the video for the water tank.  Nowhere in the video does it show you what you mean by “in between the sensors” or where the sweet spot is.  I was overfilling my tank by an inch.  I need a visual to help me understand what you mean, and I am sure I am not the only one.  The same can go for every video.  The only one I actually think covers everything is the recent smart humidifier post today.Water…..Yes the unit might for some be successful with tap water but dependent on where a person lives that could change success.  For example, my water has 300ppm before adding anything. So pouring in nutrients in reservoir makes what should be 1400 or less ec, becomes way over 1500.  PHing before adding nutrients does not accurately help the plant because the nutrients affect ph.  So nutrients should be mixed into the water prior to filling.Next.  Adjust ph and walk away from the medium for about 20 mins (the time it takes to clean everything after pumping out.  I feel this is a better method….so2. My suggestion:  Buyers should obtain a 5 gal pail, ph up and down, reverse osmosis bottle water (even if it is from a store as mine cost a $1 for 3 gallons), a ph/ppm/ec pen, and some good bacteria to support roots.  My experience, following your instructions I gave my clone two episodes of nute burn.  I struggled with balancing the water to get the numbers right. I added things which eventually affected the smell of my water.Tonight:  I changed the water, used reverse osmosis bottled water….. tested before doing anything and ppm was 11 ec was about 24…..ph 8+.  Adding nutrients (silver and gold) stirring alot, then Great White Premium Mycorrhizae.  Waited ten minutes and tested ph.  Ph was in range 6.01.  No adjustments needed (where before I was adding and adjusting).  Another tip: buyers should not add ph down and then back up….I didn’t know it could hurt the plant….I was too busy trying to get the right number and adding way too much.Shipping:  I already gave feedback to Jacob.  The shipping packages used by your distribution centre are plastic envelopes.  The boxes for the humidifier and fan I bought are as thin as gift boxes.  Same goes for the seed kit you sent me.  They were damaged, this will lead to you dealing with upset customers.  My unit (grow box) also was damaged where the straps rubbed against the cardboard and metal.  I have sent pictures.Support email help:  I find its harder to hear back in a timely way from your email for shipping claims and or support.  Discord offers immediate help when your staff are on.  I am still waiting to hear if the items agreed upon via email to compensate me for the damaged product are shipped.The staff on discord are great. I am sure I will have more feedback but…..somewhere you should have a disclaimer on app chat and in discord……advice provided by other growers is at the risk of issues.  I listened to someone who asked me why I didn’t top my plant.  As shown to Vee tonight and Jacob…it was a poor choice on my part to listen to the person, because my plant was too young and had already suffered shock twice.Regardless of the above feedback, I am enjoying the experience and would love to give the company 5 stars.  If you could try to do some of the following I could:1. Videos showing every step, just like the humidifier video you showed today (June 19, 2023).  Do one specifically showing water level in tank, one showing every step of changing the water. Etc etc etc2. Mixing nutrients before putting everything in the tank, followed by a ph test (a complete video of that, including using the tester).3. Suggestions on root support like hydroguard or good bacteria for those who want it (Canadians do not have easy access to hydroponic grown clones and deal with shock because we have to transition plants from soil to water).4. Shipping packages that protect the purchase, so you have less claims, and less unhappy customers who received damaged products5. Quicker responses to emails or people (like me) will default to asking staff in Discord6. Communication on replacement items, I am still waiting on my email asking about why the unit I received in May 2023 is not with the updated parts and updated nutrients, mine are stuck together7. Cautions about listening to other growers who do not represent Hey Abby and could lead to a poor experience for a newbieThat is all for now.  Vee was helpful tonight."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lola",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T13:52:00.000Z",
          "Titre": "Easy",
          "Contenu": "Simple to maintain and produce a lovely plant"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew James Strudl",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T10:25:21.000Z",
          "Titre": "stand behind what they advise!",
          "Contenu": "They stand behind what they advise! They said that they would refund my money if they did a holiday sale within 30 days of me making my purchase. They refunded me everything they said they would. My experience with this company has been nothing short of AMAZING!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Konstantin Tarnorutskiy",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T18:36:15.000Z",
          "Titre": "There was an issue with the app not…",
          "Contenu": "There was an issue with the app not working with multiple hey abby devices. I brought this to the attention of customer support and they were able to roll out an app update with 2 weeks to fix the issue. The teams customer support has a great track record of responding within hours or a day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICHARD",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T22:11:03.000Z",
          "Titre": "If the machine itself isn’t top notch…",
          "Contenu": "If the machine itself isn’t top notch the help center most certainly is. Very very knowledgeable and worth more than what you pay honestly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Arndt",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:39:49.000Z",
          "Titre": "Good customer service and aimed to please …",
          "Contenu": "Super nice customer service and without saying it, seemed like their number one goal was to please the customer. I was very pleased how fast they got in contact with me during holidays due to the hectic orders and stuff like that, but i have nothing negative to say about the product or the service they provide."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rahsaan",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:28:32.000Z",
          "Titre": "HEY ABBY is like “ Growing Medicine for…",
          "Contenu": "HEY ABBY is like “ Growing Medicine for Dummies”Anyone capable of following directions can have a successful growing experience. And if you do run into a snag during the process, 1 on 1 experienced support has got your back"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "steven mcvicker",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T11:36:19.000Z",
          "Titre": "Great customer service and support got…",
          "Contenu": "Great customer service and support got me up and running eventually. Took time but all good now 😁 👍"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "deepgoat",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T02:01:28.000Z",
          "Titre": "I decided to be one UKs first users",
          "Contenu": "I decided to be one UKs first heyabby grow box owners.As a consequence of not really knowing what I was doing, i became reliant on the expert help of the support team who helped me solve numerous issues.I feel confident now in starting a new grow in 2024 and am greatly enjoying the fruits of my work. A well-designed product and a solid support network!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Stan Ross",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T10:22:33.000Z",
          "Titre": "Service and support by the hey abby team",
          "Contenu": "Service and support by the hey abby team is amazingly good. It started at the point of purchase and continues on every day after receiving the product... thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HEATHER WOLFENBARGER",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:17:06.000Z",
          "Titre": "Me and my husband are first time indoor…",
          "Contenu": "Me and my husband are first time indoor hydroponic growers. We are very pleased with the HEY ABBY!! it arrived today and we were so excited. It arrived in perfect condition, and we are starting to get set up with it. We are really grateful you guys designed such a great product that enables us to grow indoors! Thank you for this opportunity!! We love it! It’s opened up a brand new world for us!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Burgett",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:14:50.000Z",
          "Titre": "I am a first time hydroponic grower so…",
          "Contenu": "I am a first time hydroponic grower so I don’t know much about it. However, Hey Abby has made it so easy to understand that I’m learning so much.My plant is growing great!I have run into a few problems but the Hey Abby team has gone above and beyond to make sure that my issues were resolved as quickly as possible.I want to thank the Hey Abby team for such an amazing service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:38:46.000Z",
          "Titre": "First timer to the Abby grow box",
          "Contenu": "First timer to the Abby grow box. So far so good. I received my grow box a day early and it looked amazing. No damage and everything inside was prefect. I’m looking forward to the new experience growing indoors and I can’t wait to see how it turns out. Thank you …  Happy growing everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sahar",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T02:20:43.000Z",
          "Titre": "Reliable Service",
          "Contenu": "I've had HeyAbby OG version for over a year now and it's one of the easier hydroponics systems I've used. I haven't had any issues with their customer service either. I've had to contact them twice so far. Once a few months ago for a connection issue that turned out was my fault, and another more recently for an inquiry about their sponge material as a growing medium. Each time I've gotten a fast response and a follow-up email to make sure my issue was resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frankly Frank",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:49:01.000Z",
          "Titre": "This grow has been a blast of fun and…",
          "Contenu": "This grow has been a blast of fun and learning. Thanks to Jake and Rose for answering all my questions cheerfully no matter how silly they are. Do yourself a favor and take the small leap into growing your favorite fruits, veggies or herbs with hey Abby. Cheers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Shumate",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:34:46.000Z",
          "Titre": "Ask a question and it got awesome…",
          "Contenu": "Ask a question and it got awesome answer from Jake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Axe",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:12:21.000Z",
          "Titre": "Outstanding Customer Support",
          "Contenu": "I received Outstanding Customer support from Jake and Rose until my problem was resolved! I can’t thank you enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T14:27:42.000Z",
          "Titre": "Customer service was prompt and…",
          "Contenu": "Customer service was prompt and pleasure able. I'm excited to get started with my first grow!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Underwood",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T13:54:42.000Z",
          "Titre": "There were two passwords on the router",
          "Contenu": "There were two passwords on the router. I entered the wrong one. I love my 420 bucks having a great time with my first sprout. Great service. Thanks, Jake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T03:45:17.000Z",
          "Titre": "Customer service and product is A1!!!",
          "Contenu": "Customer service and product is A1!!!! Let's work on them push notifications so a person doesn't have to constantly check the app to see if everything is good. Other than that this stuff is nicceeeee!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Judith",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T08:05:20.000Z",
          "Titre": "MY 420 IS SO COOL!!!",
          "Contenu": "Dear Aurora, Jake, Rose and Bismarck.What a clever, exciting and innovative device you guys have created, built and brought to market. My 420 is even better than I had imagined. I love it so much that I've just ordered another.Thank you for making Hey Abby available in Australia. The time difference makes communication slower, but you guys have really stepped it up and made it work. Your responses to messages and follow through has been so appreciated. You've helped make my Hey Abby experience enjoyable. Growing my first plant is so fun, exciting and rewarding. I look forward to a long and fruitful association with the Hey Abby team for many years to come.Warm regards,JudithOne very happy customer 😊Soon to be even happier thanks to you guys 🙏"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roadwyrm",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T19:02:29.000Z",
          "Titre": "We have had our Abby for well over a…",
          "Contenu": "We have had our Abby for well over a year and we love it! We had the original OG version and ran into some complications with it and Abby was quick to fix the problems. Great customer service and wonderful people on the Discord. One of the best companies I've had the pleasure to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "scott sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:58:38.000Z",
          "Titre": "These guys are great",
          "Contenu": "These guys are great, no messing around.  Definitely, top-notch customer service and support!!!Their grow boxes are also pretty cool.If you ever wanted to try growing, but like me, had no clue on how to start...  The Hey Abby product line is just what your looking for..I can't recommend this company or their product line enough.Try the Hey Abby grow boxes, you are in for a treat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Blakely",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:57:15.000Z",
          "Titre": "The technology to grow indoors has…",
          "Contenu": "The technology to grow indoors has always fascinated me. Im glad I get the opportunity to try it out with a super sturdy and beautiful piece that looks great in my office ;)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T22:38:05.000Z",
          "Titre": "Abby is the one source",
          "Contenu": "Abby provides quick help to your plant and hydroponics grow cabinet. I had a plant that was quickly on the way to dying. The help support with a quick picture was able to steer me in the right direction and now my plant is doing better than I could have hoped for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T05:54:26.000Z",
          "Titre": "I wasn't sure if I'd even get a…",
          "Contenu": "I wasn't sure if I'd even get a response for the question I had and when I did get a response I was told great info and they helped reset some things from their end wich I didn't know was possible... they also reached out a week later jus to see if everything was still going smoothly.  They go beyond the bare minimum wich is rare these days..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony  Elzy",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:04:27.000Z",
          "Titre": "Great company",
          "Contenu": "Great company, with dedicated people to help along the way with any question you have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew B",
          "Nb_Reviews": 6,
          "Date": "2023-12-16T17:12:48.000Z",
          "Titre": "A quick response back from support on…",
          "Contenu": "A quick response back from support on my inquiry"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Judith",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T09:47:45.000Z",
          "Titre": "I love my 420 SO MUCH!!",
          "Contenu": "I love my 420 SO MUCH!!I've had mine long enough to be 3 weeks into my grow and can honestly say I am incredibly happy with my purchase. It is super fun, the customer service is good. The Abby app guides you through each step The support is really helpful. Abby is so cool and worth every cent I paid for it. I highly recommend it to anyone wanting to grow with absolutely no knowledge. I finally found a hobby I really love. I never had the smarts to do it before Abby. Thank you Aurora, Rose, Jake and Bismark."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelvin Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:44:19.000Z",
          "Titre": "Notification words of truth.",
          "Contenu": "I was notified that it arrived here in Houston and once I found out what time they normally do deliveries it showed up right on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Tarantino",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:15:43.000Z",
          "Titre": "I had nothing but great experience with…",
          "Contenu": "I had nothing but great experience with Jake. Very knowledgeable. Answered quickly with my questions I had. The grow box is exactly what they said would be. Very impressed. Thank you again for being there for me and my first time experience. John"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T17:03:33.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "HeyAbby made a promise to honor some prices and when I contacted customer service they were friendly, fast, and delievered on their promise. I can't wait to have my shipment come in and be a part of the community!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory W",
          "Nb_Reviews": 6,
          "Date": "2023-11-09T08:35:40.000Z",
          "Titre": "Above and Beyond",
          "Contenu": "Bismark and Jake have been there for me for months. I thought I had a leak but found that condensation was the culprit. The beautiful base got infested with mold because of the moisture. My fault my problem? No! These guys are sending me another base and feet because they are good folks. Not because they had to but to make me happy. I have ordered another subscription and will be on my way again soon. Trust me Abby stands behind their customers. Always ready to help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "malvin eanes",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T00:01:59.000Z",
          "Titre": "Convergence of Technology & Cultivation",
          "Contenu": "I have been in the technology field for over 25 years, and I am simply amazed how they have converged cultivation & technology to an easy to grow format... I am excited to see how they progress in that journey.  They are young with some maturing to do, but I can say they are on the right path, as they are learning and building from the customer's experience and perspective.  Keeping your finger on the pulse of your customers needs is the key to growth and success. My only feedback is that I can see the growth is exploding and therefore demand is a hurdle point. Once again a path to maturity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dante Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:26:57.000Z",
          "Titre": "It just was nice getting help",
          "Contenu": "It just was nice getting help. Was supposed to get it last week but still waiting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon Agee",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T15:55:16.000Z",
          "Titre": "Account lost",
          "Contenu": "I couldn’t get into my account to check my subscription. Within an hour, I got a response and the issue was fixed. Never been happier with this team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Fuechsel",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T14:10:27.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Customer service at Hey Abby is superior.  I had a few issues from shipping damage to the unit not connecting to the home internet and other various small issues.  once I contacted CS the response was quick and the answers they gave me set me on the best possible journey for success.  Thank you to the Hey Abby organization for being a company that stands behind their product and genuinely cares they do an excellent job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Earl Grider",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T16:58:11.000Z",
          "Titre": "Prompt and courteous service from the…",
          "Contenu": "Prompt and courteous service from the staff and my problem was resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie Arroyo",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T13:24:54.000Z",
          "Titre": "Incognito grow",
          "Contenu": "Amazing app to go with system. Helps you from start to finish, gives you grow guides and guides for fixing issues. Also has an active community of growers and support agents are quick to answer any questions. Highly recommend to new growers and experienced ones. Only down side is the size , have to be careful not to let it grow too big but the app helps out a lot with size references for specific strains."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank  Sass",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T16:52:52.000Z",
          "Titre": "I was interested in hydroponics for…",
          "Contenu": "I was interested in hydroponics for some time and the Abby box offers an all in one home grow system.   I don't know what I would have done if it wasn't for Jake at Hey Abby, I was having difficulty getting the box to work with my router but, after all of the trying and steps suggested by Jake and the Abby team I was able to get them paired.   It's beginning to look a lot like this is going to work out just fine.   First baby and she is growing just like the weed she is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AUM",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T03:15:35.000Z",
          "Titre": "Sad but glad now!",
          "Contenu": "I was sad when my shipment arrived a bit damaged and concerned about how it will function, This company provided a solution that ended up working out and preventing me from doing a full refund, that says a lot as I am VERY PICKY when it comes to new things I purchase. With that being said this support team worked with me and was able to provide an awesome experience overall, thank you for that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T00:02:40.000Z",
          "Titre": "Great Experience/ Helpful Community",
          "Contenu": "My overall experience was pretty great. I debated for awhile on if the Hey Abby would be the right fit for me. After having some less than stellar yields with my home setup (spending more money than what a Hey Abby cost), I've decided to give it a try. Although I'm only starting my first grow in the box, I can tell that I made the right decision. The box was completely plug and play besides installing the carbon filters, which took about 45 seconds. Then i just downloaded the app and followed their instructional videos. Any question I have are answered in a timely manner through the chat option on their website. If its something I want to know fast then there is a whole community on discord giving out tips, tricks, and just overall experiences with the Abby. Makes it very easy for first time box growers to skip a couple of dumb mistakes. Its also a community that the owners are actively engaging with and keeping informed and updated on new models and app technology, while also holding events. I've been a member for a month and have already won a free hoodie through a Halloween give away. As far as the company and the product, they are exactly what they claim to be. I cant speak for results just yet but barring any user error, I have a feeling this might be exactly what I've been looking for in a grow box."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 6,
          "Date": "2023-11-13T15:54:52.000Z",
          "Titre": "PRO- There is actual help",
          "Contenu": "PRO- There is actual help. CON- Trying to find out how to access the help is a            little daunting for newbies and non-techie            people.The box is a great idea. The Hey Abby app is a cluster of confusion if you're not a active tech minded person. I'm convinced that if I had a visual outline of where to find the information I needed, I could have completed my first grow without any need to ask for help. As with most new products, there are almost always a glitch or two along the way. I accepted that and appreciated the fast response to my questions/issues. Some were software oriented that were dealt with quickly. Others were just my inability to locate the answers/procedures that were available on the Abby app if I had known where/how to find them. So all in all, after my frustrations and anxieties, I had a great first grow and I would do it all over again for the experience. If you do something right the first time, you haven't learned anything. If you pay attention, you will learn from your mistakes.  Things will only get better.Side note; the Discord message board. It brought back memories from the early 80's message boards that I attempted to use.  I am not a techie and gave up with trying to figure out how and where to post any questions/concerns."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rahsaan",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T15:58:01.000Z",
          "Titre": "Support is simply awesome!!",
          "Contenu": "Support is simply awesome!!Response to questions is usually within minutes, with real and practical solutions to the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Merlo",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T11:50:35.000Z",
          "Titre": "I am still on my first grow but am very satisfied.",
          "Contenu": "I am still on my first grow but am very happy with the quality of the Abby. As soon as it was unboxed I knew it was well built. The app does have some issues...but the care team does take care of things quickly so buying a HeyAbby grow box is a no brainer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Hills",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T00:51:38.000Z",
          "Titre": "I recently purchased Hey Abby 420…",
          "Contenu": "I recently purchased Hey Abby 420 edition. The device is very well made and very handsome. Just like a piece of furniture. It has been operating flawlessly. I had an issue with a seed dying and was expertly prompted into starting a new seed. The advice from Jake was as professional as it comes. I am looking forward to many harvests from this device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JP",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T16:19:53.000Z",
          "Titre": "So far this has been such an awesome…",
          "Contenu": "So far this has been such an awesome experience. Hey Abby has been very responsive, and even when minor mistakes were made they were very helpful in resolving them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Pectle",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T05:59:52.000Z",
          "Titre": "Hey Abby 420 edition",
          "Contenu": "I have only had my box for two days now, I will update later on after I’ve had a few grows but so far everything with hey Abby has been great! They have been very responsive and helpful with answering all my questions even before purchasing. Also still can’t believe how simple they try to make the whole process. All the step by step instructions, videos and the way you can just message on the app for support if you have any issues is much better then what I realistically expected. Great so far, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Sardina",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T20:35:44.000Z",
          "Titre": "When I made the decision to make this…",
          "Contenu": "When I made the decision to make this purchase I will say it was a little bit of a wait, but what they say, anything good is worth waiting for and I will say that’s the truth. So easy to set up and so great to learn from the HeyAbby team of experts from this new company I’m excited every day looking and the progress of my grow and the draining and replacing the 3 gallons of water really only takes less than 5 minutes. The few times I had questions I had a response in just a few minutes very fast never did the leave me holding the bag they have been there when I needed them. I wish I could afford another heyabby grow box. I would definitely recommend this new company to anyone that wasn’t to grow indoors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abndaddy",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T16:56:02.000Z",
          "Titre": "Best investment in awhile",
          "Contenu": "This thing is incredible and allows anyone to grow herbs.  The customer service that I experienced is second to none.  Overall great company and the way they have brought a community together is amazing!  Get one (or two)!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin LeClair",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T21:01:39.000Z",
          "Titre": "Out of tragedy comes friendship and focused goals",
          "Contenu": "To provide a good review you have to have a story in my opinion . I met Bruno from hey Abby back on 9/14/2023 that was assigned to my case , on an order # 6650 regarding a hey Abby grow box “OG” addition. This was my seventh Hey abby box it was damaged in transition to my residency during shipping. UPS had damaged the product so bad the top was separated from the core base triggered, having to send the box back to hey abby, this, of course, was upsetting and discouraging this took about three weeks to resolve during that time I ended up making a friend in the business. Bruno has answered all my questions, as well as put my discomfort to ease over the last five weeks. I wanted to send kudos, and a review that reflected the outstanding customer service he’s presented to me, this was a difficult and upsetting transaction when you’ve been waiting for so many weeks to receive the product only to find out that it is damaged beyond usage. I wanted to say great job and keep up the good work. I’ve really appreciated you and I hope this message proves my appreciation , thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Collington",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T18:21:19.000Z",
          "Titre": "Great support and reliable shipping",
          "Contenu": "Shipping wasn’t long and the product itself is extremely efficient. Since the hey Abby provides regular support from experts you will never be confused and always know what the next step to take is. Wether your confused on a specific step or if something is going wrong with your plant. Regardless the hey Abby team will help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 6,
          "Date": "2023-08-05T23:06:49.000Z",
          "Titre": "THIS MACHINE ROCKS",
          "Contenu": "THIS MACHINE ROCKS! I'll add more as \"Little Buzz\" grows. The only thing I suggest probably applies only to me. I learn best if I can understand the entire process before I get started. Then I can mentally prepare for what comes up next. I might not be looking in the right place but could not find an explanation of what is to be done until it needs to be done. I like being prepared. Other than that,,,,,,,,,(see review title below)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Pawlicki",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T14:38:18.000Z",
          "Titre": "So far so good.the hey abby ppl really…",
          "Contenu": "So far so good.the hey abby ppl really helped me out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanne",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T21:33:30.000Z",
          "Titre": "My experience with Hey Abby has been…",
          "Contenu": "My experience with Hey Abby has been very good to say the least, I have had a couple of issues that where resolved in a timely matter, Shoutouts to Bismarck, Bruno, And Aurora! Thanks for all your help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Hull",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T14:05:09.000Z",
          "Titre": "Abby Operations dept really helped…",
          "Contenu": "The Abby Operations dept really helped me out. Thanks again for the subscription help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary’s boyfriend",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:53:28.000Z",
          "Titre": "So far it’s been a very enjoyable…",
          "Contenu": "So far it’s been a very enjoyable experience. Very easy with instructions.At the 6 week point and all is well . She’s growing like a weed 😎"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryce McPherson",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T04:48:45.000Z",
          "Titre": "Unbelievable Support",
          "Contenu": "Anytime I have any concern about my plant or anything, the support is quick to respond and super helpful! I’ve never experienced this much support from ANY company. As a first time grower this has been such a fun process. Highly recommend this company and their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Turner",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T16:01:57.000Z",
          "Titre": "Hey Abby has the best customer service…",
          "Contenu": "Hey Abby has the best customer service I seen in a long time. It's hard to find a company with this type of response time and kindness. They made my dumb questions asked feel smart. Cant wait to get home and plug it in and get started.  Keep up the great work!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yolanda",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T05:42:26.000Z",
          "Titre": "During this new journey",
          "Contenu": "During this new journey, I have had the luxury of having Vee, and other wonderful cs agents to guide me. Their customer service along with their knowledge is top notch. I would recommend purchasing this My Abby to anyone. With their help it’s foolproof. 😉"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T20:12:44.000Z",
          "Titre": "So far so good y'all",
          "Contenu": "So far so good y'all. Everything came when it was supposed to. Unit is going to be late but I'm being informed on everything at anytime. Responses are nearly immediate. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew B",
          "Nb_Reviews": 6,
          "Date": "2023-10-10T18:06:04.000Z",
          "Titre": "The owner of the company personally…",
          "Contenu": "The owner of the company personally helped me obtain a new replacement lid for my DWC reservoir. Grower Jake sent the replacement lid out ASAP to me. Thank You for excelling in customer service and satisfaction again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T22:31:26.000Z",
          "Titre": "LOVING my Hey Abby",
          "Contenu": "So far I am loving this grow box. I'm only germinating my first seed but so far so good. Customer service has been AMAZING. They respond quickly and seem to really care how it's going and if I'm happy with my purchase. I will have more to say as I continue this process. So far .......LOVE LOVE LOVE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Blevins",
          "Nb_Reviews": 3,
          "Date": "2023-09-18T20:11:59.000Z",
          "Titre": "Support team is great!",
          "Contenu": "Support team is great. Always responds fairly quickly within several hours or sooner. Jake and Vee are both excellent people!! I've never had an issue they could not fix. I also like their product. The Abby box has been great so far"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Keffer",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T10:16:55.000Z",
          "Titre": "Fans quit working",
          "Contenu": "I have had problems with my Abby and am very pleased with the support team and their efforts to ameliorate any problems. I have dealt with both Jake and more recently Vee, and they have been great. Happy customers are an essential part of a successful business and I appreciate your efforts to make this customer happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T04:07:00.000Z",
          "Titre": "If you like terrible customer service this isn’t for you!",
          "Contenu": "The hey Abby grow box is an absolute joy! The customer service and the support team are top notch. They provide excellent tips and advice. Their support team are wizards! Very smart and very kind people. To put it in perspective Its Currently 10 pm on a Wednesday and I been chatting with an expert and sharing photos of my progress! It’s worth the money just from that experience alone. And i’m also a first time grower and my plant looks like i’m a veteran in the cannabis growing world.I love how it makes it feel like a science project!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian Suarez",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:33:48.000Z",
          "Titre": "Quick responses in a timely manner",
          "Contenu": "Quick responses in a timely manner, extremely helpful and Customer Service oriented! I look forward to receiving my Abby!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "LawOfQne",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T20:29:48.000Z",
          "Titre": "Passionate Service for passionate Customers!",
          "Contenu": "Great & personal Correspondence from the get go!No \"Company\" copy/paste Answers or delayed response-time but real People with the same Passion as myself!Aurora was a great and instant help!Chris (Germany)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judson   Williams",
          "Nb_Reviews": 5,
          "Date": "2023-06-22T22:15:05.000Z",
          "Titre": "Hey Abby does it again …",
          "Contenu": "Received my heyabby smart humidifier today as promised. No shipping issues at all. I’ll use it during cold months. I’m so happy I’m part of this community, can’t think of a better way to enjoy retirement."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T10:51:58.000Z",
          "Titre": "Extremely Helpful",
          "Contenu": "As a newbie to growing I have had numerous questions which have been answered quickly and with all the information I needed. Heyabby have been great to deal with and I’m looking forward to seeing what the grow ox can do :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Polly Agee",
          "Nb_Reviews": 4,
          "Date": "2023-11-26T02:00:05.000Z",
          "Titre": "highly recommend",
          "Contenu": "fast, accurate help like i've never seen. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gwen Cabreja",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T05:14:30.000Z",
          "Titre": "Exceptional/reliable customer service",
          "Contenu": "I was originally speaking with Jake, so I was expecting continued communication with just him, and delayed responses due to the automated response advising of at least a 24 hr turn around. However, I got quick responses from different team members like Vee, making sure I got the information I needed, as quick as I needed it, and changing the settings on my app and box, which were set wrong to begin with by me. Absolutely exceptional customer service! Based on my experience, I highly recommend purchasing the box, with the year subscription. It's a little bit more, but you absolutely get what you pay for! Thank you guys so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Ellison",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T15:51:07.000Z",
          "Titre": "This company is insanely well run",
          "Contenu": "This company is insanely well run, which, in this day and age is truly spectacular. I bought the OG unit just finished my first grow, and from my 10 years of growing experience in soil and Hydro this has got to be the most enjoyable, easy and fun way to grow cannabis. In fact, I love my OG unit so much. I’m currently waiting on my 420 unit which will be delivered July 20. The best thing about that is I will be able to be in a perpetual harvest. Can’t wait to get a guys keep up the great work.!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Lipstein",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T21:17:18.000Z",
          "Titre": "All though I had to cancel my order for…",
          "Contenu": "All though I had to cancel my order for the 420 grow box for legal issues, the service I received from heyabby was exceptional. A full refund was received in short order. I hope the restrictions on using the 402 will be eased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T23:40:04.000Z",
          "Titre": "Seed kit and grow box experience",
          "Contenu": "The Hey Abby team was quick to respond to replacing an outdated seed kit. Additionally, I'm having a great experience with my Hey Abby box having just completed my first grow. The box, the app, and the support team makes it super easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Elms",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T13:20:18.000Z",
          "Titre": "Between My wife",
          "Contenu": "Between My wife, sending back the package to UPS losing track of my package hey Abby is sending me a new box at no charge. These people know how to take care of there supports, love this company! Plus this is the way to go with cannabis. Going with this company all the way..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dennis batty",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T14:49:04.000Z",
          "Titre": "iphone microscope attachment",
          "Contenu": "Product did not work on my iphone model-went to refund process-went smooth and easy with full refund received-i would buy here again with confidence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew B",
          "Nb_Reviews": 6,
          "Date": "2023-05-25T12:43:21.000Z",
          "Titre": "What a great company and management team",
          "Contenu": "What a great company!  I was awarded a custom silk screen tee shirt, AND a Hey Abby Smart fan for the recent 420 celebrations just for growing and harvesting my plant. Now that’s what I call customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeanann Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T05:44:38.000Z",
          "Titre": "Great product",
          "Contenu": "Overall it's just been a really good experience!! Especially for someone who is so new with everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Dubs",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T17:30:28.000Z",
          "Titre": "Wonderful Experience!",
          "Contenu": "I reached out to ask questions about the initial set up and what to be mindful of during the first week after transplanting. Everything had been a wonderful experience so far and I'm excited to continue this journey with the hey Abby company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "scott arnold",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T05:32:17.000Z",
          "Titre": "Left acouple messages about moving",
          "Contenu": "Left acouple messages about moving, and needing adress changed so I can recieve my product at my new location. Was immediately changed without over the phone conversation, and continued to ask if there was anything else I needed. Great customer service with need to satisfy their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Keffer",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T09:19:28.000Z",
          "Titre": "The dial on my Abby went dark and the…",
          "Contenu": "The dial on my Abby went dark and the technical help I got saved me. I was diagnosed with a bad power supply and had one rushed to me, with a video of how to replace part.  All questions were answered and the Abby team was eager to get me up and running. Without this kind of support, the customer would be lost. I appreciate very much all efforts made by Abby to help me to continue my growing adventure. It is a great comfort to know that Abby ‘has my back’ and I appreciate the positive experience I had with what could have been a disaster. The Abby team is great."
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T22:50:13.000Z",
          "Titre": "I apperciate 6rowerj on discord so much…",
          "Contenu": "I apperciate 6rowerj on discord so much he has been very helpful through out the growing journey. I never write reviews, but this gentelman is just superb and deserves to be apperciated ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew B",
          "Nb_Reviews": 6,
          "Date": "2023-09-23T04:21:33.000Z",
          "Titre": "GrowerJ excelled once again at customer…",
          "Contenu": "GrowerJ excelled once again at customer service. He took control of my issue and provided me the best solution possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew B",
          "Nb_Reviews": 6,
          "Date": "2023-07-04T04:54:05.000Z",
          "Titre": "Great support and service was provided…",
          "Contenu": "Great support and service was provided to me through the app. It’s easy to use the support system to get answers to my questions. When I can’t find the answer I’m looking for, the support team has always responded in a timely manner to my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beau Brockhage",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T10:58:45.000Z",
          "Titre": "Every step of the way has been…",
          "Contenu": "Every step of the way has been convenient, there was any issues they are resolved. As a first time grower my results are much better than expected and I can't wait to start my next grow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Madison",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T05:06:15.000Z",
          "Titre": "Efficient and easy-to-use",
          "Contenu": "Efficient and easy-to-use, this weed growing machine produces high-quality buds. Perfect for beginners and experts alike. Highly recommended. The one on one support and community helped immensely. Love this machine!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Walters",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T14:40:53.000Z",
          "Titre": "Some of the best help this service in…",
          "Contenu": "Some of the best help this service in the business. I love how fast they respond to my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D E",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T20:10:54.000Z",
          "Titre": "support team is great",
          "Contenu": "the team support is great. any time u have a question someone is always on it right away. even on weekends someone will answer your questions. overall the box itself is awesome. works great. the app i think can be improved more. there should be a message area to click on in app. i dont like the slide to unlock features. u lose all your progress and have to start over. switching between pro and auto mode should be available without starting all over. when you are on pro mode from auto there is a red schedule thing that keeps poping up on the plant icon thinking your still on auto mode. it would be nice to still see grow schedule even on pro mode."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Robert Feldhoff",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T12:10:58.000Z",
          "Titre": "Very nice product and service 👍🏼!",
          "Contenu": "Very nice product, awesome service and very fast delivering. I hope my plant will grow fast and strong, but with full automatic system, nothing will go wrong 👍🏼!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RICHARD",
          "Nb_Reviews": 4,
          "Date": "2023-11-27T13:19:50.000Z",
          "Titre": "Very attentive and sympathetic",
          "Contenu": "Very attentive and sympathetic. Fixed my issue very very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fiction MeNot",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T15:19:24.000Z",
          "Titre": "I had an issue with my address",
          "Contenu": "I had an issue with my address, and contacting customer support was super easy to navigate and incredibly helpful. I can't wait for my product to come in the mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ysrael Larosa",
          "Nb_Reviews": 5,
          "Date": "2023-06-28T04:26:03.000Z",
          "Titre": "Hey 420 people don’t play with Abby she…",
          "Contenu": "Hey 420 people don’t play with Abby she do amazing things don’t wastes no time get 1 u gonna be absolutely happy about Abby"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vonn Walker",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:36:32.000Z",
          "Titre": "Jake was very helpful in providing a…",
          "Contenu": "Jake was very helpful in providing a solution to my problem."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "MKONE",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T21:46:43.000Z",
          "Titre": "Customer service is next level",
          "Contenu": "Customer service is next level. Finally a business that cares about its consumers and is there to help with quick and easy answers. Product 10/10, Customer Service 10/10"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Aravindh Panneerselvam",
          "Nb_Reviews": 4,
          "Date": "2023-06-12T15:36:35.000Z",
          "Titre": "Stunning Support",
          "Contenu": "Hey Abby's support team is really amazing in answering all the queries you need on time, Not just their product is great but also their team has been extremely pivotal in their brands success, i wish every company had the best service as Hey Abby's is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T04:28:46.000Z",
          "Titre": "VEE helped me get my membership back on…",
          "Contenu": "VEE helped me get my membership back on track with very little effort, stayed with me and informed me of any changes, with the help of the Abby App team, again great service. 5 Stars ✨"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judson   Williams",
          "Nb_Reviews": 5,
          "Date": "2023-01-17T00:10:08.000Z",
          "Titre": "Just received my second subscription…",
          "Contenu": "Just received my second subscription package and drying rack. Quick shipping and prompt service made this transaction a pleasure. Hi Ho, Hi Ho, it’s off to grow I go!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jammertime",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T14:24:44.000Z",
          "Titre": "Amazing customer support",
          "Contenu": "I have been with HeyAbby since the beginning. Their customer support is amazing and the grow community on discord is a great resource and super helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judson   Williams",
          "Nb_Reviews": 5,
          "Date": "2023-06-17T20:43:06.000Z",
          "Titre": "Being new to anything is so rewarding…",
          "Contenu": "Being new to anything is so rewarding when you have a mentor/team to help along the way. I feel confident my grow will be successful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ysrael Larosa",
          "Nb_Reviews": 5,
          "Date": "2023-06-25T08:47:59.000Z",
          "Titre": "I love my Abby now I’m get another for…",
          "Contenu": "I love my Abby now I’m get another for sure but I love the most is the support team the rite there with every single step thanks guys"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Todd Steinke",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T15:52:49.000Z",
          "Titre": "Hey Abby rocks!",
          "Contenu": "Hey Abby has been an excellent company to work with. The best at handling issues in a timely, friendly fashion. I  am so glad to be a part of this community!"
        }
      ]
    }
  ]
}