{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "hobohost.com",
      "Review": [
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Jude Miller",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T11:56:02.000Z",
          "Titre": "No migration strategy when toolset changed",
          "Contenu": "When the CMS interface changed I was sad there was no migration path to move my content into the new tool."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Daniel McGuiness",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:07:00.000Z",
          "Titre": "Great functionality and presentation at…",
          "Contenu": "Great functionality and presentation at a low cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 2,
          "Date": "2024-01-01T20:16:49.000Z",
          "Titre": "Great Service and Offers!",
          "Contenu": "Great Service and Offers!Straight forward and easy to setup a website(s) and excellent customer service with no downtime on the servers"
        },
        {
          "Note": 5,
          "Lieu": "ZM",
          "Pseudo": "John Lusumpa",
          "Nb_Reviews": 1,
          "Date": "2023-12-26T02:22:36.000Z",
          "Titre": "Reliable service, Great price, Excellent support.",
          "Contenu": "I've been using them for a couple of years now, for my personal and my clients domains / hosting (I'm a Web developer). System uptime is excellent, and response to queries is also quick and courteous, regardless of what support you need. Its really excellent service, for such a great price. I have no complaints with them whatsoever. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "RogerM",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:49:02.000Z",
          "Titre": "Highly recommended for a small web site.",
          "Contenu": "Once I'd found my way around the system it was easy to set up my web site with multiple MYSQL databases. I was also surprised at how quickly the system runs, appreciably more responsive than with another hosting provider. Highly recommended for a small(ish) web site."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "none",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:31:45.000Z",
          "Titre": "I had a little difficulty understanding…",
          "Contenu": "I had a little difficulty understanding and setting up the nameservers. It took me two days to get both the website and the domain name set correctly. But once that was done everything came together. For a starting package they are excellent. I'd used hobohost before It's that I've gotten a bit rusty..lol."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Panattoni",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T03:36:01.000Z",
          "Titre": "GREAT Customer Service!",
          "Contenu": "Although our club could only afford the lowest priced package, we were treated like we had their best package. Getting our page transferred from GoDaddy to Hobo Host was handled by Cody IN ONE DAY! He even called me (I gave them my ph#) in order to expedite the process and clear up issues. I can tell you that bases on this experience , I think our club will be very pleased with Hobo Host. Thank you Cody!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brent Brown",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T15:57:11.000Z",
          "Titre": "Good performance at a good price",
          "Contenu": "Love the pricing. I wasn't sure what to expect for speed, but it seems faster than my old hosting provider. It has all the features and capacity I need. I will be recommending Hobohost when asked about hosting providers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RH",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T04:56:53.000Z",
          "Titre": "This hosting service is the first step to scale your website.",
          "Contenu": "This hosting service is the first step to scale your website.Does not sell short its retail customers.  The price is realistic for the customer's needs and budget.  Navigation is straight forward with neither nonsense nor sales pressure."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-08-16T22:48:06.000Z",
          "Titre": "Good pricing and fast customer support",
          "Contenu": "I have done a lot of research and found their pricing to be highly competitive. Also, when we have any issues, their customer support team is quick to respond. This is something really important when you're running a small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Callsan",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T06:55:13.000Z",
          "Titre": "I have had Hobohost for a number of…",
          "Contenu": "I have had Hobohost for a number of years, they are very decently priced and their service is amazing! Every issue I have had they will answer in a timely manner and without hesitation fix my problem. I couldn't ask for anyone else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vinyl Siding Doctor LLC",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T21:22:32.000Z",
          "Titre": "Finally found a PERMANENT Hosting and Domain Home!",
          "Contenu": "After getting bare minimum service levels from Namecheap, Hostgator and others at wit's end, I finally found HoboHost! Amongst many reasons why I am a HoboHost customer for life now is the personal attention to detail. They will migrate your website FOR YOU as long as you share your credentials, which you can easily change the password to later for security sake. They have one employee in particular, \"CHAD\" who spoke with me on the phone and returned my voicemail after hours in like 5 minutes. He answered ALL my questions, clearly, and made sure I understand how to proceed  BEFORE I  SPENT A DIME. Mind....Blown! Then, after registering and sending in the needed credentials and a brief overview of what I needed done, it was CHAD himself who stood and delivered. No more bouncing around from one hosting provider to another. HERE TO STAY! Thank you HoboHost for running such a tight ship and employing people like CHAD! Peace be with you, from a happy retired Firefighter :)"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Antonio Nawaqavou",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T01:40:23.000Z",
          "Titre": "Been with HOBOHOST for over 13 years…",
          "Contenu": "Been with HOBOHOST for over 13 years and will never change for any other.top rated customer and service are top notch always online for any asistance and this is ideal for any small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:22:12.000Z",
          "Titre": "so far has been great service",
          "Contenu": "so far has been great service. everything has worked good and for the price is excellent"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DH",
          "Nb_Reviews": 8,
          "Date": "2023-09-23T20:01:39.000Z",
          "Titre": "Last night I found HoboHost on Google…",
          "Contenu": "Last night I found HoboHost on Google search. Very good prices so I decided to give them a try.Wow, the move was so easy, excellent service with a well configured website and instructions. A very big thankyou to HoboHost... Well done!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anthony Edge",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T11:51:51.000Z",
          "Titre": "Amazing value for money",
          "Contenu": "Amazing value for money. Moved 4 websites to Hobohost from host costing treble the price.Love cpanel just the same as my old Hostpresto.Well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Rathbone",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T05:12:54.000Z",
          "Titre": "Service and pricing is as advertised",
          "Contenu": "Service and pricing is as advertised.  I received a helpful response the couple of times that I asked a question.  I'm not aware of any down time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Gewirtz",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T04:57:48.000Z",
          "Titre": "What's not to like?",
          "Contenu": "It's low cost, the service works with reasonably fast servers. Support is responsive. What's not to like?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:11:09.000Z",
          "Titre": "These guys have been great",
          "Contenu": "These guys have been great. Whenever there is an issue (rarely) they quickly respond. Have been a customer for many many years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Runnels Networkcloud Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:54:51.000Z",
          "Titre": "outspend speed and support for a…",
          "Contenu": "outspend speed and support for a hosting company."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "Romel Vera",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T02:35:46.000Z",
          "Titre": "It works",
          "Contenu": "It works, the prices are cheap the support is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Wilkey",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T22:06:41.000Z",
          "Titre": "SImply the Best"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T15:38:23.000Z",
          "Titre": "It does the thing"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dominic",
          "Nb_Reviews": 5,
          "Date": "2023-07-21T16:55:02.000Z",
          "Titre": "Thanks everyone in the team !"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Carlos Verbelen openseazues",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T18:41:37.000Z",
          "Titre": "H3!_!_O W0R7D",
          "Contenu": "H3!_!_O W0r7!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Netizens Toastmasters Netizens",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T04:00:50.000Z",
          "Titre": "Great product",
          "Contenu": "Great product! Best prices!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Uyi Eddy",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T21:05:54.000Z",
          "Titre": "Stability and reliability"
        }
      ]
    }
  ]
}