{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "hughesnet.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Sword",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:16:21.000Z",
          "Titre": "Service is super slow and unreliable",
          "Contenu": "Service is super slow and unreliable. When we called about it they said it was our fault for the location.. Then every month we have to call because they over-charge us by $25 for a service we don't have but they say we do so it's a constant back and forth argument about what service we do have. Not worth the time or effort."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis Solley",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:05:22.000Z",
          "Titre": "Pathetic Customer Service",
          "Contenu": "When I opted for Hughes Net Gen 5 service, the name on my account was recorded by a very poor English speaker representative as Douglass. I didn’t know of the mistake until my statement arrived. That was three years ago!!!!! Apparently Hughes Net didn’t seem to care that three years of monthly bills were actually being paid on a Visa Card, ending in 1555 by me , Dennis not Douglass!!!!! Over the years , when I talked to representatives, I tried to get my name corrected but without success.  So now I wish to terminate my contract and have been asked to “prove” there is no Douglass in my house by sending personal documents via E-FAX to a fax number 5854193727. I submitted my documents repeatedly to this number and received error messages. First it was denied, then it was accepted, then it was denied. After 3/4 calls to Hughes service centre, they were unable to verify the fax had arrived, they were unable to look at my visa name to verify that it was Dennis paying for the service for the last three years, they were unable to provide another fax number, in fact they were unable to suggest anyway of resolving this simple but stupid problem after several hours!!!!! My wife even called the fax number and was told “ the e-fax  did not go through because someone answered the call” and that the number was a scam. So I called my ViSA company and put a block on my Hughes Net payment next month as a way of canceling this service on Jan 18th 2024.  I hope that Hughes will provide a box and shipping label so that I can send their equipment back next month. The Hughes Net service has been great, their service center in Rochester NY  has been appalling. Would not recommend them to anyone after this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:31:54.000Z",
          "Titre": "Your service is very poor it constantly…",
          "Contenu": "Your service is very poor it constantly buffers and now I am paying more for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Deml",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:06:50.000Z",
          "Titre": "Caveat Emptor",
          "Contenu": "I signed-up with Hughes net about a year ago. I live in the boonies so i have limited highspeed options. I bought the dish and related equipment and, when asked, i told people that Hughes was better than having no internet. I recently found a much less expensive hotspot service with unlimited highspeed and emailed ot cancel my Hughes service. I received a response by email informing me I must telephone to cancel servie. During that too long conversation i was informed there would be a $400 cancellation fee. Again, I purchased their equipment so they had no costs to disconnect my service. I asked repeatedly to speak with a supervisor and was not transferre.I was referred to the Hughes contract by text. There is a cancellation fee described in their legal docs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cliff",
          "Nb_Reviews": 44,
          "Date": "2023-12-05T02:22:42.000Z",
          "Titre": "HughesNet is TRASH!!",
          "Contenu": "HughesNet is a SCAM! I never got over 1mbps download and my service went out frequently. Their internet is not useable at all. I got starlink recently and now I average 150mbps download and can use it for everything including voice calling. Don’t fall for hughesnet lies and get blocked into a contract for two years and still have no internet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bradley Haney",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T02:14:51.000Z",
          "Titre": "Your tech was completely LOST did not…",
          "Contenu": "Your tech was completely LOST did not have a CLUE of what I was talking about & then HUNG up on ME! God Bless..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patricia Baronoski",
          "Nb_Reviews": 6,
          "Date": "2023-12-05T16:07:37.000Z",
          "Titre": "I have had nothing but problems since…",
          "Contenu": "I have had nothing but problems since connect I cancelled end of October. Asked for a finalBreakdown bill and a return box…. Also I’ve emailed several times. It’s December 5. Still no box!!! No bill. Now I’m told , after  they took equipment fees and cancellation yet never sent the box!l, that I need to go online to generate final bill cause it was paid.  I told them I have no access to a working printer …. They were rude.  I was told by different people different things. This company service and customer service is awful. I kept this writing short and sweet. You got the jist of it !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Feaster",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T21:50:56.000Z",
          "Titre": "Hughes net worse service I've ever had",
          "Contenu": "Hughes net worse service I've ever had. What's worse you stuck with them for 2 years with their fusion service. I will never ever recommend this service to anyone will be getting out of it just as humanly possible. So people that stream TV or have kids that play ps4 or ps5 don't even bother you'll run out of gigs before months end won't be able to do anything. So disappointed was told was best service for country living, lies lies lies"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vic",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T02:03:55.000Z",
          "Titre": "Worst internet I’ve ever had",
          "Contenu": "Worst internet I’ve ever had! Their employee lied to me about the monthly rates and cancellation fees. They swindled me into a two year contract and wanted hundreds of dollars to “cancel early”. The service itself is spotty, sluggish, and expensive! 81 dollars a month for internet that fails constantly. Good riddance!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrain Johnson Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:16:48.000Z",
          "Titre": "Installation No Show",
          "Contenu": "I was scheduled for installation today and no one showed up. I waited from 8am-12pm EST. I’m a little upset considering I paid over $170. I’m on the fence now and worried about future issues with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jefferey Dixon",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T21:11:37.000Z",
          "Titre": "I’ve contacted Hugh’s Net 3 times since…",
          "Contenu": "I’ve contacted Hugh’s Net 3 times since June to get reimbursed for the equipment that I sent back 1st call wouldn’t do anything because couldn’t find my receipt.  So called 2nd time after I found receipt and the guy told me I should have the $319.00 or whatever it is back in 24-48 hours and if not call back I waited for a week then called back the woman I talked to said she would have to check into it further and probably wouldn’t get it back but she would try to talk to Supervisor and call me back but she didn’t.  I’m on a fixed income and this is a lot of money to me.  The service was fine for the 3 or so years I had it but went a different route.  I could not get out on my roof to retrieve equipment because of 2 foot of snow on it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lesley KS",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:53:40.000Z",
          "Titre": "Unprofessional",
          "Contenu": "Slow, glitchy, too expensive for what they provided. On top of that they allowed/condoned an unprofessional relationship between the technician and a widowed elderly customer. When reported, nothing came of it for almost 2 months and nothing has changed even after the technician was informed of the complaint."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roland Grindle",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T11:12:51.000Z",
          "Titre": "I'm being debited for equipment I…",
          "Contenu": "I'm being debited for equipment I returned Oct 3"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cleon",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T04:42:21.000Z",
          "Titre": "I paid the bill in full for Hughes net…",
          "Contenu": "I paid the bill in full for Hughes net on December 7th for 147.00 then four days later they automatically took 116 dollars from my account without my authorization then when I called they refused to give it back they admitted to there mistake but refused refund they basically stole my money then laughed at me and offered me a discount on the next three months bills to stop me from complaining this company is crooked I filed a complaint with the FCC but this is crazy I see on many other complaints were they have robbed others the same way I think class action suit needs to happen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:43:32.000Z",
          "Titre": "Worst internet service I have ever saw",
          "Contenu": "Worst internet service I have ever saw! Do not get this service my girlfriend got it 2 months and you can't watch movies Samsung and it really is bad! No joke worst internet I have ever seen!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brent",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:28:37.000Z",
          "Titre": "The last 8 months I was using Hughes…",
          "Contenu": "The last 8 months I was using Hughes net, I had no internet connection. They blamed it on covid, stating more people were online.  Nothing in my house that needed internet connection would work.  Unfortunately I was under contract,  so for 80$ they would send a repair person. But when my contract was over they offered a to send a repair person for free. DO NOT RECOMMEND USING THIS COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dorian Henry",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:12:37.000Z",
          "Titre": "There service is terrible it does not…",
          "Contenu": "There service is terrible it does not work already when it storms even just rains now it just isn’t working in order to get some one to come you half to pay 150 for them to come fix there service it’s bad business and just plain out terrible I highly would not recommend this company to anyone"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T00:15:22.000Z",
          "Titre": "Totally incompetent",
          "Contenu": "Totally incompetent . Don’t sign up with this company. They set up an account for under someone else name but with my visa number . I just can’t tell yo y what a disaster this has bedn"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:26:19.000Z",
          "Titre": "I was a Hughesnet subscriber for several years.",
          "Contenu": "I was a Hughesnet subscriber for a total of 11 years. I can honestly say this is the worst internet provider I have ever had. You purchase their service and it will be okay for 1 month. After you have gotten past your 30 day window then your service is degraded to the other subscribers level. When you call customer service you will be speaking to someone you can hardly understand reading from a script to “try” to diagnose your problem. They will tell you everything looks good on their end and will ask how the weather is in your area. After this you may be issued a case number and be told they will turn it over to the engineering department and they will be back in touch with you. They will tell you that they are sorry and may either give you a little data or knock 10 dollars off your bill. Your speed may increase for a few days and then it will go right back to the way it was. If you decide you want to cancel your service they will send you to their “customer retention” department where you will speak to an American who will either say they will escalate your case and give you a rebate for a few months and some extra data if you will give them a chance to “fix” the problem. Hughesnet has oversold their service and there’s only one way to “fix” the problem, find another internet provider. I HIGHLY recommend Starlink if it is available in your area. The upfront cost is about $600 dollars but it is well worth it, especially compared to Hughesnet. There is no comparison between the two. Starlink has times when your internet slows somewhat due to congestion but you still have usable internet. I’m not saying Starlink is the best option but if you’re having to use satellite internet it is definitely worth looking into. If I can only save one person the agony of dealing with Hughesnet my review will be worth while."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Schwartzhoff",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:43:35.000Z",
          "Titre": "It took a month and five cancelled…",
          "Contenu": "It took a month and five cancelled installation dates before service was finally installed. Once installed a few days ago, upload and download speeds have been slow and worse than the provider I got rid of due to their slow speeds. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T22:25:18.000Z",
          "Titre": "I called to cancel my service because I…",
          "Contenu": "I called to cancel my service because I haven't been getting 25 mbps like I was told. I was on the phone with \"Mary\" for for about 20 minutes and she kept talking in circles on trying to make it right and keep me as a customer..  I requested a supervisor or a manager and she wouldn't put me through.  I reminded her that our conversation was being recorded.  She then stalled for another long while \"trying\" to put me through to the escalation line so I could talk to a manager.  Meanwhile she came back and told me that my service had been canceled and gave me the ID#.  Then said something to the effect of since the service had been canceled if I needed anything more.  I said I needed to still speak to a supervisor.  I'm still on the phone now and its been 54 minutes.  Customer service is very poor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T01:31:05.000Z",
          "Titre": "Extremely poor customer service",
          "Contenu": "I named my HughesNet network \"Slower than dial-up\" and that sums up the internet service. Very slow, nowhere near the speeds they advertise. Their customer service is even worse than their internet speeds. I have interacted with their customer service department multiple times and they are impressively bad. I have made changes to the account, which included faxing paperwork and speaking with them multiple times, but they never did get the changes made. The only reason to use this service is if there are absolutely no other options."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Crane",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:00:14.000Z",
          "Titre": "the problems",
          "Contenu": "the problems, i am having, with my service, i am still having, after a month of you trying to correct them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Crownover",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T12:27:34.000Z",
          "Titre": "I STILL HAVE POOR SERVICE, NO INTERNET LAST NIGHT!",
          "Contenu": "I CAN'T SEEM TO GET MY INTERNET PROBLEM RESOLVED. I INCREASED MY PLAN, BUT HASN'T HELPED. I AM OLDER PERSON, AND CAN'T UNDERSTAND FORIEGN TECHS DIALECT OVER THE PHONE. IT WOULD BE BEST IF YOU OFFERED TO SEND A TECH TO MY HOME TO RESOLVE THIS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ines woody",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T05:06:15.000Z",
          "Titre": "On Nov 10 I request a booster order…",
          "Contenu": "On Nov 10 I request a booster order number #22927337 today is Nov 19 and I still waiting for the booster. I have called a couple times I was told to wait until thanks giving day. How is possible if you ship through UPS you don’t have a tracking number. You disrespect a customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:45:29.000Z",
          "Titre": "No compassion",
          "Contenu": "I have had Hughesnet as my Internet provider for over 10 years. I live in the country and have no other option for Internet.  The service has not been that great, and the costs are high, but I stuck with it and paid my bills timely. Recently, my husband had to have any knee replacement and money has been very tight. I’ve had to takeoff work to take care of him. I called Hughesnet and asked for an extension to pay my bill at a later date which was only a week and a half. As time drew closer to the extended date, I realized that I could only make a partial payment so I called on two separate occasions to try to make a partial payment and schedule the rest to be paid on another another date a week later. This is the first time I have ever been late in over 10 years, Mind you. When I called these two times, I was told back to call back on the date that I had promised to pay and make the partial payment. When I called that day, they told me that they sent it to my bank to be paid and the whole bill was extracted from my checking account and it was overdrawn. If I was not told by two separate people from the Hughesnet  company that I could call on that date and pay a partial payment, I wouldn’t be so upset. When I called on the arranged date, they said it could not be done that my payment was already withdrawn and that basically they got their money and there’s nothing I can do about it. When a company has no compassion for their customers, they have no business being a company. Needless to say, I will be canceling my Hughesnet service, and will be sure to spread the word what kind of company this really is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Schmidbauer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T17:35:59.000Z",
          "Titre": "If I could go back in time…..",
          "Contenu": "If I could go back in time and do one thing, it would no longer be meeting my grandmother, but it would now be finding my husband and smacking him before he was able to set us up with HughesNet. It has been an absolute nightmare. The service never works. We have called time and time again and have been told our satellite is misaligned and we need to pay $150 for them to come out and readjust our satellite but the next time there is a storm, it’ll get misaligned and we’ll need to pay the fee all over again. I’ve had their helpline people yell at and be rude to me before and I’m sick and tired of paying over $100 a month for literally nothing. The moment we get home we have to take our phones off the internet and use our cellular data. The man that came out and installed all the devices mounted one to the window, and when there was a fire, I couldn’t get out the window of our bedroom and had to run through the smoke and flames to get out of my house. I’ve gotten everyone in our neighborhood to request GVEC fiber internet come to our street and until they do, we’re jumping over to GVEC wireless internet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sun Shine",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T18:43:05.000Z",
          "Titre": "Trash internet!",
          "Contenu": "Trash internet!! Only get if you want to be money gouge. We are from Texas this is the worst Internet I have ever had. Buffering & constantly have to add tokens this is 2023 their Internet is crap. We canceled & they stole 300 dollars out of our account without our consent. They expect you as a customer to climb on roof to get a part off that we have no idea & didn't install very crap service. Run the other way"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Easton Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T23:01:10.000Z",
          "Titre": "Don't do it...",
          "Contenu": "Unfortunately I have had nothing but bad experience with HughesNet. To start off, the most important thing I made clear is that I would need to make and receive phone calls, this does not work. On top of that, my data would only last five to seven days at the start of a billing cycle, that was with streaming Netflix three to four days a week,  maybe one to two hours, either way, fairly light internet use. Even when I did have data most streaming devices were pixelated and would not make it through an entire episode before freezing and disconnecting. I constantly had to unplug and reset the router. When I went to cancel my service I found out there was a $400 cancellation fee. You also have to return all the equipment yourself otherwise you will get charged and extra $300. I just switched to starlink and it works phenomenally for anything I want."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Madeline Brumfield",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T16:02:23.000Z",
          "Titre": "Absolutely the worst satellite service…",
          "Contenu": "Absolutely the worst satellite service available. Offline more than online. Can not load email sites online, can't load text only sites much of the time, can't fill out forms, can't order medicine prescriptions online, can't message my doctors, can't stay in touch with my family members by email, messenger, or streaming services. If it rains lightly here for 3 minutes the system goes off line entirely. It took 10 minutes to load this page to make this rating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Candice Swilling",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T00:22:09.000Z",
          "Titre": "If I could give zero stars I would",
          "Contenu": "If I could give zero stars I would. I went with Hugh's net cause it was the only internet company to service my area. We had it for less than 2 months. Service was horrible spent more time buffering than anything could watch tv for a solid 2 minutes and would buffer again. Was not informed about a contract when first signed up nor a fee for not returning equipment. When I called to cancel still did not tell me about being charged for cancellation and the lady I spoke with wanted to argue with me about canceling my service. Today I checked my bank and they had pulled out money when service had already been canceled months ago and had been pulling out money and refusing to refund since the cancellation. When I called they refused to refund my money and said it was a valid charge for me canceling. Be careful going through Hughs net"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "barbarajp",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T18:28:02.000Z",
          "Titre": "Order??? Today is 11-27",
          "Contenu": "I didn’t order anything—why did you send this message? Today I called because you sent a message about the bill not being paid and had to give a new credit card number. I hope this is not a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Lilly",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:15:56.000Z",
          "Titre": "I told the representative the money…",
          "Contenu": "I told the representative the money would not be in my account until the 15th. He extended the due date and the payment still went through before the 15th and my bank charged me a fee!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:33:48.000Z",
          "Titre": "HughesNet is used as a torture device…",
          "Contenu": "HughesNet is used as a torture device in third world countries. If I had to choose between HughesNet and death row, I would pick death. It took me almost 2 weeks to cancel HughesNet after using them as a last resort for 1 1/2 years. Children in Africa or on Mars have better Internet than what HughesNet provides. They tried to hold me to contracts that they blatantly stated were \"incorrect\", charged me over $300/month for a product that worked less than 70% of the time, provided \"support\" that could barely read let alone understand the script. I had to reset my entire network every morning and it would still take me more than an hour to have semi-functioning Internet, which would still drop periodically throughout the day. I had one tech explain to me \"space is really far away and it takes a long time for the signal to get there and back\" and tell me that the weather looked overcast in my area, while I was staring out the window at clear blue skies. It cost me $8000 to be able to use Starlink, and it was worth every cent to get away from HughesNet. The last week of dealing with them left me crying and shaking because it was so stressful and difficult. I will be setting that dish up with Tannerite, since it can't function for Internet anyway."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shelly Carroll",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T22:05:33.000Z",
          "Titre": "Make the people that answers the phones…",
          "Contenu": "Make the people that answers the phones do there jobs! I have called over 50 times to change phone number on my acct. I have given Hughes Net my banking information twice and was told today that I am due for disconnection for none payment and the money us in the account at bank . I have been told TWICE my acp benefit has been transferred (which I haven't done) so I'm being charged full price 140.51 . I think hughesnet is a scam. First install date the installation guy reported my landlord ran him off property which I proved was a bold face lie. All this has happened in just 30 days!!!!!! So last thing I told Lind( that refused to let me talk to supervisor ) is to shut off my service then I hung up . But I know that won't be done by my request but IT WILL BE FOR NON PAYMENT!!!!!! I am a heart patient n don't need this internet service put me in my grave. HUGHESNET SUCKS!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blop McBloppy",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:41:18.000Z",
          "Titre": "Slow internet service",
          "Contenu": "Slow internet service.  You cannot stream without interruption from buffering.  You cannot do wi-fi calling at all.  The customer service is terrible.  I was hung up on by the representative when I asked for credit for the days I had no service because the modum died.  I was told it was not their fault."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jubal duncan",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T03:22:00.000Z",
          "Titre": "🤮🤮🤮Service is horrible…All the way from…",
          "Contenu": "🤮🤮🤮Service is horrible…All the way from the satellite to the people working there. I was lied to multiple times by the employees, got no help and was also hung up on after being on hold for an hour and a half.  And the company will just let it happen with no repercussions to the employees. Also the company did not ever make the situation right. Thanks Hughes net🤮"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy  PATTERSON",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T05:59:56.000Z",
          "Titre": "Poor service",
          "Contenu": "Hugh Net promised to improve service for the past 3 years but nothing has happened.  When we have rain, snow, hail, or fog we get no service.  We have increased our service to the maximum and pay over $100 a month.  We have no other service to turn to and are dependent upon it for phone, TV, and internet.  Between 6 PM and 11 PM, our daily service is also poor.  WE has complained but nothing has been done.  During Joe Biden's inauguration, we had no problem with problems with coverage. Could someone help and get them to increase rural services to livable levels?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Dallas",
          "Nb_Reviews": 4,
          "Date": "2023-10-14T03:17:04.000Z",
          "Titre": "I expected at least 15 Mbps but get nothing close and lose connections…",
          "Contenu": "I just had the system installed this afternoon.  I expected at least 15 Mbps but only average 4Mbps and disconnects .  The modem is operational.  I cannot stream, I cannot check my financial accounts or complete work. The speed was maximum 7 Mbps and averages 4 Mbps and has disconnected completely three times -- all within the first hours of usage.  I called tech support and they blamed it on possibly the weather and said to wait 24 hours and try again.  If this is what I can expect from Hughes Net then I will need to cancel the entire account and go back to my original provider, which was not always reliable, but at least less expensive and more reliable than this!!  I am very disappointed and verging toward angry at this situation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa Woody",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T22:48:30.000Z",
          "Titre": "We have been a customer for 10+ years",
          "Contenu": "We have been a customer for 10+ years. Our service has never been very good, but recently a bird flew into our satellite dish and knocked the service out entirely.  We didn't even realize it for three weeks because we were so used to not having internet. When we finally called, we talked to one customer service manager that saved our account and sent us a new router, but unfortunately that did not fix the problem.  Long story short we decided to cancel our service and they can't even cancel it and send us a box to send their equipment back until the end of the billing cycle! How insane is that. We haven't had service since the middle of October and we can't get a box until the end of November. The inefficiency of this company is amazing.  I would not recommend them to anyone.  In fact before this I have always steered people away from them. If you live in the country and want great internet try T-mobile. It saved us $34 a month and no 15g metered internet limit!!! I wish we had found them sooner!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "giovanni",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T03:17:53.000Z",
          "Titre": "Wifis so bad they should be paying me…",
          "Contenu": "Wifis so bad they should be paying me to use it. At first it was good but now its so slow it’s unbelievable and then we still have to pay 100 a month dont buy this wifi its highway robbery"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Traci Logue",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T02:45:32.000Z",
          "Titre": "Hughesnet is absolutely the worst…",
          "Contenu": "Hughesnet is absolutely the worst Internet ever! Don’t even bother getting it because you’ll never get good service ever! I’ve never had more than one bar the entire time I’ve had it. The genius technician pointed the satellite through a bunch of thick trees! I can’t download anything, I can barely stream Netflix or anything on my phone. It’s absolute crap! Don’t get it you’ll be better off with nothing. Just use your cellular data on your phone and you’ll save yourself a lot of money and Frustration!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenda",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T18:06:49.000Z",
          "Titre": "Confusion and chaos setting up a new account",
          "Contenu": "When I called Hughesnet to explain that my husband had passed away and I needed to delete his name on the account and replace his name with mine. I was told that a new account had to be set up. So I was transferred to the sales dept. I was given a promo cost for internet service which I agreed to. Then a date was scheduled for a new modem and to check the outside dish equipment. When I called Nov 15, there was total confusion on the customer service side of Hughesnet. I had to explain numerous times to start my new account, giving my account number again and again. I told the representative that the technician had installed a new modem and I needed to ensure that my husband's account was cancelled and I had a new account which needed to be activated. I was told my account had been done incorrectly with my husband's name on my account.  No one at Hughesnet could find my account number. I kept telling everyone the account number that was my husband's needed to be cancelled. That I couldn't put my name on his account, I had a new account and kept telling the representative my account number, which he couldn't find. That should have been an easy fix, delete my husband's account and start my new account. I was totally confused and asked to speak with a supervisor. Only when I spoke to a supervisor at the account management dept did I feel the issues of starting a new account was resolved. Now I get another email scheduling a techician on Nov 20 to install a new modem. On Nov 15 the technician had completed this work and I signed the agreement the work was finished. I am now waiting for the box to return the modem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eli Baumgart",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T15:06:40.000Z",
          "Titre": "Worst internet on the planet",
          "Contenu": "Worst internet on the planted spend the money and get star link it will be worth it in the end. These people don’t care about you unless you’re signing up. You can do one google search a month if that’s what you’re looking for give it a try, but cancel in the first 30 days or you will be left with a hefty cancellation fee."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kay Bee",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T20:22:11.000Z",
          "Titre": "Hughesnet won’t remove dish",
          "Contenu": "Asked Hughesnet to come and remove their huge satellite dish in GA, too big to go in trash can, previous owner left in front yard. Customer Service rep in Philippines was not only difficult to understand but extremely unhelpful and downright rude. I will never sign up with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T05:24:22.000Z",
          "Titre": "Laughably poor customer service.",
          "Contenu": "I was sent two upgrade kits after I cancelled the order. I was told (twice) I could just drop it at UPS store and they would take care of it, they would not.  After trying twice to get information and order the Fusion package, technical support told me it wasn't even available at my location.  The sales associate did not even have the same information shown on website.  She told me repeatedly there was no discount for the Fusion package as I at in front  of my laptop looking at a 20% discount.  The package I finally agreed to was not on the website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T20:40:35.000Z",
          "Titre": "This is the worst internet service we…",
          "Contenu": "This is the worst internet service we have ever dealt with; the customer service is highly unprofessional. The service clearly doesn't work in rural areas; when calling customer service, there is nothing they can do in the response. Then cause we can't use the service they give you high fees to pay to leave, this is unacceptable. We use this for work and business. And we should not be penalized for paying for a service we can't use.Then when we went to cancel, the customer service agent was very rude and kept harassing my husband, trying to make him stay and then threatening the fees; I filed a complaint with the BBB and local offices. I had to scold the agent for harassing my husband when asked for a manager she is the manager, when asked to speak to someone over her she would just place us on hold for long periods of time, then come back no one is available to help us. I demanded she cancel the service and her name is Crystal her employee # is 655073."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CONSTANCE SCANLAN",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T04:51:45.000Z",
          "Titre": "We need someone to help us in English …",
          "Contenu": "We need someone to help us in English  !We would like to pay our bill with an automatic withdrawal. We cannot read any of your emails or texts …in Spanish We cannot get into our online account because they never recognize our email or phone number. We have had a terrible frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Irving",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T22:57:42.000Z",
          "Titre": "The control box for the Direct TV…",
          "Contenu": "The control box for the Direct TV stopped working and I can't get a service man for a week So i sit here for a week with no TV Been with them over 20 years and have a quick service plan I would hate to have regular plan."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sallie Farris",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T19:33:59.000Z",
          "Titre": "HughesNet is not consumer friendly",
          "Contenu": "When contacting HughesNet about internet service in my rural area. I was informed that once the equipment is installed on my property that I am responsible for any and all damage, including \"acts of God\". If the equipment is struck by lightening I am responsible for the full cost of it and repairs from the moment it's installed. There are numerous hidden fees and charges. HughesNet is not consumer friendly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stacy King",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T13:40:11.000Z",
          "Titre": "I called because my printer was unable…",
          "Contenu": "I called because my printer was unable to connect to wireless. The technical support said it was because I need more Gb. I told her I NEVER had that problem before. She convinced me regardless at an extra cost of &10/mth. She did something to get printer to connect, but next day it was back to not connecting. Shameful misrepresentation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brantley tinnin",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:24:18.000Z",
          "Titre": "Their people need training or to care",
          "Contenu": "When they hooked up my wifi they shut of the breaker hooking my solar into the system then neglected to turn it back on. My electric bill went from 14 to 500 but \"it's not internet or service related so there's nothing we (they) can do\". It took a month to get the bill and then almost another to find out the issue so there's 2 months of 500 bills that they caused and have zero interest in making right."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandie  Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T15:32:28.000Z",
          "Titre": "Absolutely worst company ever!!!!!",
          "Contenu": "Absolutely worst company ever!!!!!Terrible internet!! When you cancel they claim you didn’t send the equipment back and charge you. Then they won’t refund the money back to you unless you jump through a bunch of hoops!! Can’t talk to anyone that actually speaks English and you can understand and them understand you!! Never ever ever get service from this company! You will regret it!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Tully",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T20:21:46.000Z",
          "Titre": "Where's the dats",
          "Contenu": "is impossible. Have called twice. Cannot stream - always buffering. Have not used up quota - have only had Hughes Net for a week. Purchased 100mbps. Techs cannot find anything wrong. No trees, buildings or other issues that would block satellite reception."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victoria Sumague",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T16:20:47.000Z",
          "Titre": "Worst company in existence",
          "Contenu": "Worst company in existence. Scammers. You are better off moving if you need their service. They lied to me and signed me up for 2 years. Told me i could cancel after a year. Stopped charging me for one year and then one day started taking money from my account again. When i asked for proof of this “2 year contract” where i SIGNED they said they didn’t have that..I changed my debit card and somehow they obtained my new card numbers and tried to charge me again. I don’t even know how that’s possible without my consent. Just Move. It’s the worst anyway. It is worthless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacek Kras",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T00:46:08.000Z",
          "Titre": "my contact went out in the middle of a…",
          "Contenu": "my contact went out in the middle of a job and i lost the job how do u think i feel im pissed off and u still bill me for a month of internet service im look for a better service at this point"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KATHRYN QUESNEL",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T21:57:00.000Z",
          "Titre": "I can’t get anyone to help with rebate…",
          "Contenu": "I can’t get anyone to help with rebate gift card v I’m very disappointed in your company. I can’t wait for my 2 year contract to expire.  And I will not recommend your company to even my worst enemy   2 years can’t come fast enough!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy Fitsimmons",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T00:49:15.000Z",
          "Titre": "THEY WILL SCAM YOU!",
          "Contenu": "THEY WILL SCAM YOU!! I needed internet for my job while. when I was signing up I was making sure there was no fee for the cancellation as I was going to only be there for about 4 months. The internet NEVER worked and I called multiple times about it but they did nothing. I ended up canceling and now they are trying to charge me $461 for a cancellation fee even though they said I would have no fee. Now they are ruining my credit and I owe $461 for NOTHING. The internet NEVER worked and they promised no cancellation fee because I was going to be there for a short time. DO NO GET IT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A “Mommy” T",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T14:58:03.000Z",
          "Titre": "Company and service are pathetic",
          "Contenu": "Company and service are pathetic. Plain and simple! Severely lacking employees that provide good customer service. I guess it goes along with the lack of good internet service. Would never recommend to even my worst enemy.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kinley Shook-Chacon, MD",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T00:39:43.000Z",
          "Titre": "Literally the worst internet service",
          "Contenu": "Literally the worst internet service. The service worked perfectly for our first 30 days and then afterward now barely works at our house. Our streaming will not even play movies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy Dellana",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T17:10:42.000Z",
          "Titre": "Absolutely the worst internet",
          "Contenu": "Absolutely the worst internet I have ever had!!!! It never worked properly, cannot not stream TV for one TV or won't even run a cell phones wifi. My hot spot with my cell phone has better internet. Take my review as a warning and go with another company. The charges more than double the second month of service and this company is charging me a $400 cancellation fee. I cancelled service 8 hours after the 30 days that's ridiculous and of course and manger was not available to speak with me. I had to cancel my credit card just to keep them from continually to bill me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T01:36:47.000Z",
          "Titre": "Waste of time and money",
          "Contenu": "Waste of time and money. They lied about the speeds they could provide in my area to get me to sign up-only refunded me a portion of my money when I cancelled because I could never get efficient download/upload speeds. It’s a huge hassle to get them to put up the equipment and an even bigger hassle to take it all down yourself and send it back. Spent way to much time and money on this experience and would never recommend them to any I know. Customer service was nice all the times I had to call…guess that’s worth the one star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TARA",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T19:40:48.000Z",
          "Titre": "WORST EXPERIENCE EVER!!",
          "Contenu": "WORST EXPERIENCE EVER!!! DO NOT WASTE YOUR MONEY!! I HAD MULTIPLE ISSUES THAT NO FORIEGN REPRESENTATIVE COULD HELP ME WITH, THEY HAVE NO COMPASSION AND WILL LIE TO YOU 100 PERCENT. DAMAGES DONE TO MY HOME AT INSTALLATION AND STILL HAS NOT BEEN FIXED. DONT USE THIS SORRY SERVICE...EVER...TRUST ME"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve from Missouri",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T22:17:22.000Z",
          "Titre": "Hughes internet SCAMMED ME AND STOLE FROM ME",
          "Contenu": "Before signing up with Hughes internet, please see this YouTube video: Hughes Internet SCAMMED ME AND STOLE FROM METhis video discusses and shows proof in the form of a recorded call that Hughes Internet failed to honor, and STILL refuses to honor it's agreement with me. For the past 4 months, Hughes has been charging me $20.02 over the amount we agreed to on January 12 2023. Avoid Hughes Internet AT ALL COST! I wish I would have!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Buckles",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:28:19.000Z",
          "Titre": "If I could leave 0 stars I would",
          "Contenu": "If I could leave 0 stars I would. Not for the spotty service that was interrupted everytime there was the smallest cloud in the sky, not for the extremely low download speeds, not even for the poor quality whenever I did have a connection. No, this review is totally based on the severe lack of customer service we received when we decided to cancel our service to go with a different provider. On top of the ridiculously expensive disconnect fee, we were charged for 2 extra months of service, even after fully confirming that our service was canceled with confirmation that we WOULD NOT be charged for anything further. They were not helpful at all when trying to reach a resolution and I would suggest to anyone to steer clear of Hughes Net if they don't want to spend hundreds of extra dollars for a service they aren't even using."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam V.",
          "Nb_Reviews": 2,
          "Date": "2023-07-08T23:52:10.000Z",
          "Titre": "FAR Slower Than Advertised",
          "Contenu": "The internet speed was FAR slower than what HughesNet advertises. You essentially pay a lot for the worst service money can buy. Other satellite providers offer better speed. Don’t go with this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Hull",
          "Nb_Reviews": 4,
          "Date": "2023-10-26T18:57:23.000Z",
          "Titre": "My inter.net speed did not improve…l",
          "Contenu": "My inter.net speed did not improve after I spent a long time with a tech. In my area I amLooking into another source I believe I was told that a new satellite was put up but not yet conected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Iva M Romans",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T05:05:40.000Z",
          "Titre": "NOT happy with Internet Provider HughNET",
          "Contenu": "First of all, it's too expensive! Of all internet providers, HughsNET absolutely is the worse for rural internet. I lived on the Navajo reservation, I have had a good provider for the reservation location for 7 years. Moved to a rural area using another Navajo provider until policies changed due to location areas they provide. I am not happy with hughsNET, always running out of data usage before middle of the month. I never had to pay this much for using internet and running out of data in 12 days!!YES, I'm so dissatisfied with HughsNet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "R C",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T16:00:31.000Z",
          "Titre": "Absolute worst",
          "Contenu": "Can't stream. If you try and can tolerate the constant buffering ,  data is gone just a few days into the month. I have had several internet providers over the years . HughesNet is the absolute worst ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth B",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T16:48:52.000Z",
          "Titre": "Do better",
          "Contenu": "We canceled our service over a year ago and never received the return package to send back the equipment. Out of nowhere, we are charged like we still have service and we do not. We were told if we are refunded, we would be charged over 300.00 until equipment is returned but we won’t receive the package until the middle of august. It looks like we have to pay for a mistake someone else made in not sending us the return packaging and properly canceling our account. That’s dirty. Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer P Brown",
          "Nb_Reviews": 3,
          "Date": "2023-10-01T14:38:18.000Z",
          "Titre": "The company will fool you with promises…",
          "Contenu": "The company will fool you with promises of great internet service and connections. If you're a customer and you need a technician to come to your place to service anything you will be charged. If you have any issues with the service the phone representative is not able to communicate with you and will hang up upon being frustrated. I have been without service and no one was able to help. After resolving the problem myself, my next bill was increased by $30.00. When I called the representative told me it was the way that HughesNet bills. I will be having increased monthly payments for the remainder of the service. If it is inclement weather you will experience no service. If a rogue cloud passes you will have no service. If a bird flies over, you will have no service. You can look forward to the hours between 2a-4a(can vary) for free data. It isn't great during those times but, a little better than the other hours during the day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dean Martin",
          "Nb_Reviews": 57,
          "Date": "2023-11-04T20:15:42.000Z",
          "Titre": "In June of 2023",
          "Contenu": "In June of 2023, we canceled our subscription to Hughes net. That was six months ago. They are still hitting our bank account  for $145 a month. We have returned all the equipment they told us too."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Cotton",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:34:24.000Z",
          "Titre": "Modem received was defective",
          "Contenu": "Modem received was defective. Hughes representative said a return shipping label was on the shipping box, there was no return label. Representative said I would have to pay for return shipping. If Hughes wants the defective modem Hughes needs to come and get it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nivia D' Alba",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:29:03.000Z",
          "Titre": "Called to schedule service had…",
          "Contenu": "Called to schedule service had everything set up the date came and no show. I called and it had never been scheduled but they charged my card. I called the number provided for assistance on multiple occasions and they can’t find my account but they billed my card. Every time they transfer me I have to talk to someone else and repeat my story horrible company!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Holland",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T17:06:41.000Z",
          "Titre": "I watch my news in the morning and it…",
          "Contenu": "I watch my news in the morning and it will be interrupted by a green circle and takes a couple of minutes for the news to come back on, It does that to other channels, I wasn't able to use my cell phone with Hughes Net. I went back to my own internet and need to cancel Hughes Net"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Freels",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T09:57:15.000Z",
          "Titre": "As bad as the 1000s of reviews say it is",
          "Contenu": "We called 4 times.   The first agent had a solution that sounded reasonable.   We tried to problem solve.  The next 3 agents had different stories.  I feel like this company uses false advertising.  I can't work from home? It says I can...that's why I bought it? No live streaming? I wasn't told that by anyone at anytime.  The Google reviews were right...the service is terrible both customer and actual internet.  The web surfing was awful, 10 seconds between pages...if they even opened.  Just a joke.  I should have trusted the 1000s of awful reviews.Now I have to go on my roof and take down a satellite dish? Ridiculous.  30 day satisfaction guarantee is a lie.  Do not trust Hughes net.  You will regret it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Sjobeck",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:57:09.000Z",
          "Titre": "Waist of money",
          "Contenu": "First off at installation the guy left trash everywhere,  made a mess in my bathroom and the service was terrible,  I was never able to stream , couldn't use wifi calling COMPLETE WAIST OF MONEY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hughesnet sucks",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T21:39:16.000Z",
          "Titre": "This is the slowest Internet I have…",
          "Contenu": "This is the slowest Internet I have ever used in my life. Including dial up. I have had to cancel some of my streaming services because the Internet is too slow to use them. Downloads are 3 times faster on cell data. I would never recommend your service to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin c Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T02:45:02.000Z",
          "Titre": "My modem stopped working and I am…",
          "Contenu": "My modem stopped working and I am expected to pay for the delivery of my replacement modem. I had 3 days of use this year and the modem quit. This is very poor customer service. The agent, Mr. G,  did all he could do, but Hughes policy determined how this interaction was going to end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DIANA BEAUFILS",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T00:44:08.000Z",
          "Titre": "Reliability of the equipment",
          "Contenu": "Reliability of the equipment.  My internet was down, so called tech support.  They reset my system and everything was working for only a few hours, then went down again.  Called tech support and they decided to send a tech out to check on system.  Tech came out, got everything working.  Then a few hours after tech left the system went down again.  Surely your modems should be more reliable than that?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Ward",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T02:42:35.000Z",
          "Titre": "HughesNet SUCKS",
          "Contenu": "HughesNet SUCKS! You might as well not have internet. Paying almost $100/month for service that only works about half the time. Don't even THINK about trying to get on the internet while it's cloudy or rainy. You'd be better off watching paint dry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Freeman",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T23:45:33.000Z",
          "Titre": "Expensive and Slow",
          "Contenu": "It’s too expensive to keep buying tokens to stream a movie or play games. It’s so slow on our basic program that we don’t even bother with it unless we pay for all the extra tokens. Disappointing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eldridge Navrat",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T22:54:27.000Z",
          "Titre": "On September 4th terrible service",
          "Contenu": "On September 4th, I found that I had no Email. I called Hughes and connected to a young lady that kept me on the phone for over 35 minutes. She knew nothing about helping me, so I asked to talk to a supervisor. We got cut off so I called back. Again another young lady who kept me on the pone for over 35 minutes to no avail, WE got disconnected so I waited several hours and called back. This time I got a young man who again knew nothing about how to solve my problem. I waited and called the next day and got connected to a lady, who spoke better English and know how to solve my prblem. After about 10-15 minutes she got me connected and so far so good."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald Boyd",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:18:24.000Z",
          "Titre": "Have not received mg “ Free 5GB token”",
          "Contenu": "Hello:I purchased a 5 GB token from an email I received from Hughesnet for “ Buy one token get one token free” offer. I purchased the token on 10/31/23, at 11:55 pm, CDT. So,  the offer was still Valid when I purchased it (had not expired)It is now 11/8/23 and I still have not received my free 5GB token from HN. I have emailed them and did not receive a response back. I called them and the agent (who was very difficult to understand) told me I should receive it by 11/05/23. I still have not received my 5 GB “free” token. I’ve used HN for a long time and have not had any trouble like this before. Thank you**Edit:  this matter has been resolved as I have now received my 5 GB token.  Change from 1 star to 5 stars. Thanks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vincent Conner",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:40:07.000Z",
          "Titre": "Hughes billed me for services I did NOT…",
          "Contenu": "Hughes billed me for services I did NOT receive. I requested for my service to be suspended for three months. I was billed for full service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T21:21:55.000Z",
          "Titre": "My Internet has not worked very well…",
          "Contenu": "My Internet has not worked very well since day one. I was on the phone two different times for more than an hour at a time. I was told to be near my modem. I was actually sitting right beside my modem. There were no walls between me. Agent just did not seem to be able to help."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cathy McIntosh",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T14:32:50.000Z",
          "Titre": "I only receive 15gb of internet service…",
          "Contenu": "I only receive 15gb of internet service a month for 76.63. So when that runs out...you are out! I called about it and was told I could increase to 50gb for 79.99 a month. Well that sounded like a better deal than what I was paying for so I said lets do that. THEN they tried to charge me 20.00 extra a month to send me an invoice! Can you believe that....20.00 for a slip of paper that they send their customers! They wanted me to have it charged to a credit card to avoid it. SO needless to say I am currently shopping around for a new ISP.  Highway robbery. I reported it to the FCC."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brittany Akins",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T22:14:09.000Z",
          "Titre": "The service is way to slow for the…",
          "Contenu": "The service is way to slow for the price. I could get out of the contract without paying I would cancel the plan now. I asked not to be put on automatic draft and they did it anyway so now my account is in the negative and they won't do anything to fix it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cory Roughton",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T20:03:10.000Z",
          "Titre": "STAY AWAY FROM HUGHESNET!",
          "Contenu": "Everything has been horrible since I called to get service. I Was told 100GB per month was more than enough with a Fusion plan for streaming services. I stream everything at my house and within 20 days I had already reached 100GB. When I called, I Was told that nobody would ever say that and the lies began.I have called 6-7 times in 4 months because the internet was extremely slow and no matter what was tried, nothing got better.After 4 months, I Was told (after replacing the original modem) that the Fusion was never configured 100% after they finished setting it up 3 times. I asked if I Can just cancel it and still stream and do what I needed and was told yes. When I called back again, they said I will continually have streaming issues (even video calls) because I cancelled the Fusion service and that was my issue, They DO NOT WANT TO FIX ANYTHING! They blame the customer for everything that goes wrong with the service and can not accept any accountability for what the customer reps tell the customers. I have been hung up on multiple times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Isaacson",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T04:48:39.000Z",
          "Titre": "AVOID THIS COMPANY AT ALL COST!!",
          "Contenu": "We got this for our cabin and have had nothing but problems; unreliable connection, slow download speed, broken equipment, etc. When they came (late) to install I was enjoying a beer on the deck. The installer, half done, bummed a beer from me … weird! Every time you turn around they charge you for some unexpected item,. You have to manage the data you use. If you go over the service just stops working until you call and pay up … usually costs $50-$75 to get service back up after waiting a long time to speak to an agent. They charge $20 to send you a box to return your equipment and won’t stop billing you at the time you cancel. If you have any other option, take it. I’m happy I won’t have this company in my life going forward!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee Nanners",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T17:45:00.000Z",
          "Titre": "This provider was too expensive and not…",
          "Contenu": "This provider was too expensive and not upfront about data limits and cancellation fees. Doing business with them was the biggest mistake I ever made."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darrell Hammett",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T17:41:43.000Z",
          "Titre": "No one wanted to do their job and did not know how.I followed instructions with my new…",
          "Contenu": "I followed instructions with my new modem calling for 1 hour to boot.  I called the help desk after that did not work and the rep said it takes 3 hours to boot.  That not working I called again and a new rep said it takes 4 hours to boot. I just left it on all night and still not working, and called back.  After a long time on the phone they sent a tech out.  The tech fixed it very fast saying many modems are improperly programed. The help desk should have been aware of this so it would not have taken 5 days to get a new modem running.  No service excellence, only under performance!!  Hughes is a communication company yet they have no internal communication.  Long time customer but not a happy one right now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa McNiel",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T16:40:00.000Z",
          "Titre": "Slow to no service after upgrade",
          "Contenu": "Slow to none! Started off w/50gb.. had no issues. Upgraded to 100gb w/all being depleted in a few weeks. Then I upgraded to 200gb at night time w/customer service saying the next day it had all been used w/in 24 hours of getting it?!? It wasn’t even used. They gave me credits & upgraded my account after me letting them know I was going to cancel their service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joyce S",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T22:01:31.000Z",
          "Titre": "We have had Hughesnet since 12/29/22",
          "Contenu": "We have had Hughesnet since 12/29/22, I would not recommend them to my worst enemy. We had nothing but bad service, movies buffer every day of the month, but they can only tell us that it is because we have run out of gb’s. But are unable to give us a reason for the buffering on day 1 of our service. They only want to help us out by selling more gb’s. Who wants to pay for more, when you don’t get good service on what you are already paying for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:32:00.000Z",
          "Titre": "The did not credit me for $40.00 for 4…",
          "Contenu": "The did not credit me for $40.00 for 4 months and also did not apply my $30.00 for assistance even though you said it would be applied. Steven"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SHERRY FOWLER",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T19:12:22.000Z",
          "Titre": "Our internet will not pick up when we…",
          "Contenu": "Our internet will not pick up when we try to get on Netflix or streaming on the TV gaming is totally out ,it will work sometimes but most of the time  it doesn't"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "all is good",
          "Nb_Reviews": 106,
          "Date": "2023-07-17T05:09:49.000Z",
          "Titre": "Well it was fixed by a rep were I could…",
          "Contenu": "Well it was fixed by a rep were I could do so much of my payment and junly 31 I could finish paying it you could fix it were my signal is stronger not buffing so muchDate of experience: July 14, 2023"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leopard",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T02:45:59.000Z",
          "Titre": "PLEASE DO NOT BUY....",
          "Contenu": "PLEASE DO NOT BUY..... this is the worst internet conpany there is... my speeds are the slowest... always are refreshing... NEVER WORKS AND ALWAYS LOSING SIGNAL.... THE WORST INTERNET COMPANY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Morris",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:54:44.000Z",
          "Titre": "They misrepresented what they were…",
          "Contenu": "They misrepresented what they were selling now in a 3 yr contract but only leaving here for a yr.  Horrible speed and quality my wireless 5g phone does better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roscoe Burrows",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T21:22:58.000Z",
          "Titre": "Don't Do It",
          "Contenu": "Totally agree with the other reviewers about the buffering.  It's constant and varies little from the first day to the last day of your billing cycle. And then they try to sell you more gbs or some other kind of service.  If they're your only choice, stream through your phone.  There is a thumbdrive type device called the ScreenBeam Mini that really helps the connection from phone to TV.  Stay away from HughesNet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles and Brenda Tyler",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T22:14:46.000Z",
          "Titre": "I was forced to pay $823 dollars for…",
          "Contenu": "I was forced to pay $823 dollars for two months of internet service which I didn’t mind, the other 600 dollars were for tokens that I didn’t order!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly Tobola",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T02:01:59.000Z",
          "Titre": "Nothing Has Changed in Twelve Years",
          "Contenu": "Every couple of months I have to call the technicians because the service is too slow or not going at all. Then I’m doing business in the phone and need to do several functions with a client, it is really embarrassing and frustrating because my phone or laptop is stuck on buffering. Seriously, I’ve had a new modem and dish put in within months and here I am again waiting for service. My neighborhood is having fiber optics installed, and I can’t wait until it’s complete. It’s been 12 frustrating years with your company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurel Brandt",
          "Nb_Reviews": 5,
          "Date": "2023-12-04T00:09:14.000Z",
          "Titre": "I wasted a whole afternoon getting my…",
          "Contenu": "I wasted a whole afternoon getting my voice/text back on my cell phone because the sales lady NEVER told me that I would need to have a different carrier for voice/text.  Hughes ONLY provides a landline for voice.  Otherwise, they are just a satellite internet provider...& that sucks too...don't get a good connection sometimes & slow speeds.  I was with Spectrum but they raised their rates & weren't willing to go down much...so I switched.  Even tho I hate Spectrum for their high rates I have to admit they provide the best internet connection...I have no idea about cell phone...but assume it's fine.  I use Mint Mobile...just $15 bucks a month!....16.76 w/fees."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shirley Baker",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:31:25.000Z",
          "Titre": "I haven’t been able to get on the…",
          "Contenu": "I haven’t been able to get on the internet in 2 weeks and lights are white on modem.  Fed up"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOHN THOMAS",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T22:07:34.000Z",
          "Titre": "Hughes really let me down on high speed.",
          "Contenu": "I have talked to chat four days now to correct my slow internet speed.  they have said that by buying tokens or whatever that it is fixed and yet each morning it is back to slow.  I am handicapped and must have high spped constantly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert McKnight",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T19:01:18.000Z",
          "Titre": "streaming movies, series and live Tv sucks..",
          "Contenu": "Same problem as always.. Can't strem movies, series, with out it buffering, Either 10 - 20 minutes into movie, or it just logs me out of app after minutes of buffering..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sharon S Horsley",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T18:37:01.000Z",
          "Titre": "It took 3 contacts to HN tech support…",
          "Contenu": "It took 3 contacts to HN tech support to fix an obvious problem on your part. We still are having streaming interruptions. Not sure we are going to keep the service .  We feel I home live person tech support would be very helpful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janice Whitaker",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:01:05.000Z",
          "Titre": "I have upgraded my plan so I don't have…",
          "Contenu": "I have upgraded my plan so I don't have to experience buffering and I still continue to have this problem. I can't really afford to pay so much for Internet but I'm a student and I must have it. But for what I'm being charged I'm not satisfied with my service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ALFREDO LOPEZ",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T13:39:17.000Z",
          "Titre": "Just confused on how I pay for…HYPE",
          "Contenu": "Just confused on how I pay for supposedly reliable technology that doesn't work as hyped. TV adds are misleading."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carla Sligar",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T17:03:34.000Z",
          "Titre": "Poor speed",
          "Contenu": "The speed of this is terrible, & I was not aware that the plan had a limit!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joyce Johnson",
          "Nb_Reviews": 5,
          "Date": "2023-08-03T18:26:08.000Z",
          "Titre": "Problems with Hughes Internet",
          "Contenu": "Speaking with various people at your tech site, they all have different solutions.  As soon as I hang up the phone the internet goes off again.  I have other things to do besides stay on the phone with your experts (?)  Every day there's outages, usually when I'm doing something relating to my recent heart attack.  I cannot deal with this.  Surely there's an answer out there somewhere.  Besides, I'd appreciate dealing with someone whose English speaking I can understand without having to have everything repeated numerous times.  Friend says she just got rid of Hughes for similar problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie cifaldi",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T18:32:55.000Z",
          "Titre": "I was given no notice that my bill was…",
          "Contenu": "I was given no notice that my bill was due, my account was overdrafted, after contacting support I was told I was given an extension but here I am 3 days later and my account has not been updated. The total I got for my problems was $10 off of 3 months to cover the $60+ in overdraft fees that could have been avoided with a minimal effort at communicating"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Hammontre",
          "Nb_Reviews": 3,
          "Date": "2023-01-04T17:46:06.000Z",
          "Titre": "I thought everything had been resolved",
          "Contenu": "I thought everything had been resolved, however, your employee - Ceasar - stated that I would need to be assisted by a \"professiona\"  no explanation was given as to why or when.  I now find that I am disconnected for the internet often and two different speed test result in not getting any upload data.  Several apps on my cell phone will no longer function with your internet but will run if I use my data.  I will be back to you soon if you don't contact me asap"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sportsolley",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T05:22:31.000Z",
          "Titre": "Internet is Terrible",
          "Contenu": "Sorry to pay& sorry to say- Internet is terrible. Goes in & out. I’m home 22 days a year with my job. I got the service earlier this year & was promised better connection & service by the end of the year for my area (more cell towers being built) but no. The people who I’ve spoken to though- have been wonderful!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T01:54:48.000Z",
          "Titre": "SLOW complaint!!",
          "Contenu": "I just called recently complaining about the inter being so slow, they said they increased the speed a bit for me , well it is still slower then ever , can;'t open most videos, and opening a new website takes forever it is ridiculous, I usually hace to get on to my Grandsons T-mobile to get any work done.. very disappointing.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lois Jornlin",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T00:27:00.000Z",
          "Titre": "We are back home and hughes net…",
          "Contenu": "We are back home and hughes net restarted.  Supposed to be better than ever.  It is so slow!  Cannot get anything done in a  hurry.  Billing reads like we're paying for 5 gb and getting 2.  This is supposed to be the best service for our area.  I was quoted pymt to be about $58 and with all your extras almost 100 for poor service.  Very disappointed again!  Lois Jornlin"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edward Valkenaar",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:54:44.000Z",
          "Titre": "You people have no way of keeping my…",
          "Contenu": "You people have no way of keeping my records straight I have ACP credit and you let it run out without letting me know I called them and they told me it is not expired I went through 2 hours of phone calls and email and online support to try to get you people to understand I need my ACP credit it took 2 hours for you people to get it right I'm not happy with you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DIANNE SMITH",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T20:11:40.000Z",
          "Titre": "Internet is always slow",
          "Contenu": "Internet is always slow, with constant buffering.Internet has gone out 3 times within the last 6 weeks and I have to sit on the phone for at least an hour while technical support troubleshoots."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jesus palacios",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T18:39:29.000Z",
          "Titre": "Service sucks too expensive…",
          "Contenu": "Service sucks to expensive and limited internet once you finish your data plan it will not work even on slowest rate doesn’t work anymore so what they called a bonus is more like crap because it will not work at all Custumer service is good but other than that service and price sucks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ralph Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T00:59:06.000Z",
          "Titre": "The setup was fine but the service we…",
          "Contenu": "The setup was fine but the service we have is horrible. I have called twice to restore good internet but that hasn't happened yet. Pages load slowly and videos buffer for long periods of time. I would not recommend  Hugh's foe internet to anybody. R. BENNETT."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T18:58:50.000Z",
          "Titre": "Poor Service. Poor Customer Service",
          "Contenu": "The service was poor. We could not use our telephone if the television was on the internet. When a more reliable service became available in our area, we signed up. Hughes.netk customer service was very rude and upset when we did not agree to continue with their service with their options offered. This was very disappointing. I regret  using Hughes.net."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elliott Caldwell",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T15:18:46.000Z",
          "Titre": "The installer did not install outside…",
          "Contenu": "The installer did not install outside cable properly. I didn't check it until after he left. It was installed loosely running along base of home. Should have been installed running along top, under the eve.He also has cable running under front door,which is a tripping hazard."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RPS",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T17:29:18.000Z",
          "Titre": "Called regarding the data cap",
          "Contenu": "Called regarding the data cap, did not fully understand when signing up.  Customer representative was very helpful.  HughesNet itself is not what I expected!  Speeds are slow, some webpages just will not load, (do not try to look at the weather radar as it will not load) and apps like Netflix are often slow and very difficult to rewind."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MELVIN JENNINGS",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T01:57:11.000Z",
          "Titre": "The technical support reps should know how the hugesnet system works.",
          "Contenu": "I experienced no internet serivce even though the tests I ran stated otherwise. The rep kept asking me to disconnect the modem and reconnect. He stated that since the tests stated there was a problem there was nothing he could. The real problem was that the satellite was having problems. I found this out after my third call to Hugesnet techincal support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peggy",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T20:28:57.000Z",
          "Titre": "Streaming is difficult for your rural customers",
          "Contenu": "I am paying a bunch of money for service which I think are less than acceptable.  I should be able to stream movies from a few places that I have access to but the BUFFERING makes watching anything off the internet frustrating.  Yes they lowered my rate and increased my speed but it is not apparent.  I only watch TV late evenings for about 2 hours.  Otherwise it is too slow and I don't have time to sit for connecting to the internet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lois Davis",
          "Nb_Reviews": 3,
          "Date": "2023-02-12T03:07:17.000Z",
          "Titre": "The person I spoke with seemed very…",
          "Contenu": "The person I spoke with seemed very knowledgeable and professional. However we are still experiencing the same problem with our new phones. We cannot make or receive calls without cutting out or sounding garbled.  Our Wi-Fi setting is showing no internet service consequently our phones can’t make a call. Very frustrating"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Ana g Guizar dominguez",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T19:29:42.000Z",
          "Titre": "the speed is not stable",
          "Contenu": "the speed is not stableto make the paumnet every month is a disater, you rsend reminders, when we try every month to make the payment via  acredit card , and oit take several days until your systems accept it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rebecca Gearhart",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T13:16:32.000Z",
          "Titre": "Service is often spotty with frequent disruption of service.",
          "Contenu": "Service is often spotty with frequent interruptions for buffering. Loss of service entirely happens frequently as well. Monthly rate is too high for unreliable service. I understand how the weather could affect service. However, loss of internet occurs nearly every day even in perfect weather. I am a senior citizen & a shut-in. Due to high cost of tv service, my only media at present is my access to the internet--streaming, facebook, emails, games, news, searching /downloading music, craft & crochet patterns--so I rely heavily on being able to access the internet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carrie Grossman",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T20:35:44.000Z",
          "Titre": "Poor service",
          "Contenu": "Our internet went out on 12/22 and was not restored until 12/29 at about 7pm at night. My husband and I called in 8 times to resolve the issue. After  technician did not arrive at our home on 12/26 as scheduled we learned it was a Hughesnet error. I had planned to be on vacation from work and just check in intermittently, but this caused me to go to a coffee shop, spend money on a coffee, and work for 2-3 hours each business day. When asked to share my frustration with a supervisor I was told they were not available to speak to me after waiting about 20 minutes to speak to someone."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Randall Unger",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T02:02:08.000Z",
          "Titre": "poor modem performance",
          "Contenu": "I have noted that my LAN ports on the back of my modem are MAJORITY yellow and orange; I have complained about this but have received no response. The modem from my previous provider was majority green for its ports. Thus far, I've received no feedback or resolution to this issue: ergo, my 'two stars' for this review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 3,
          "Date": "2023-06-22T12:58:48.000Z",
          "Titre": "Your support staff is always helpful BUT....",
          "Contenu": "Your support staff is always helpful.  Our challenge is how often we have to contact them!  We have to reset our equipment nearly every day and even then we don't always have service or lots of \"pauses\" after many resets.  Very frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Drema Montgomery",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T15:01:47.000Z",
          "Titre": "Data Usage numbers all over the place.",
          "Contenu": "After calling and trying to understand once again-  I got no answer as to why my connected device's data usage ( where it breaks down how much each device uses in data in 24 hours) is way less ( 5 gb) than what data they say I used? I upgraded my service to 100 gb a month and watched a movie, and went to bed. Only to wake up to it saying I've used 17 gb of data over night.  The technician basically said \" oh your devices still use data when you sleep\" even though the connected devices' numbers don't support 17 gb of usage , and its never used that much over night. I got a brick wall and a repetition of the same explanation without any questions actually being answered. It feels like their data usage evaluation is aa scam and in no way accurate. Considering data is what I pay for - this is a huge problem. After y 12 month contrast is over I'm switching to something else."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis Luttrell",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T00:44:07.000Z",
          "Titre": "The installation went fine with no…",
          "Contenu": "The installation went fine with no problems but the download and upload speeds are not at all consistent at all. At times under 5 download and under 2 upload speeds. Please correct asap. Your company is not living up to our agreement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paige Collise",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T18:53:33.000Z",
          "Titre": "NEVER AGAIN",
          "Contenu": "The people are great they really try their best and I couldn't appreciate it more.The internet however is TERRIBLE for us.I have the highest/fastest package you can get through them for my area and I can't even use it majority of the time, it stops working regularly, and when it finally does work it so slow I can even load a single page for my work or classes. I rely heavily on my phone data in over to get anything done and I just HATE this internet, and they've already sent a tech out once and did diagnostics and attempted to correct it 3 Times over the phone. I genuinely just can't stand the service and will be going with a different provided as soon as possible.The people do their best and are really friendly, just the internet it self is horrible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JIM FISHER",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T21:31:52.000Z",
          "Titre": "Installed the new Hughes Net Fusion…",
          "Contenu": "Installed the new Hughes Net Fusion system which is advertised as having speed of 25mbs or better. The last three days have produced the following speed per hughesnets own speed test.Day 1 30.0, 17.4,13.56 and 26.88Day 2 9.0, 14.78, 8.76 and 8.48Day 3 5.66, 12.65, 9.61 and 10.79These reading are the same as the HughesNet service was before installation of the fusion system. Leaves one to wonder if this is a scam program by HughesNet.Jim Fisher"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "julie skinner",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T04:13:31.000Z",
          "Titre": "I had to call 4 ti.es just to cancel…",
          "Contenu": "I had to call 4 ti.es just to cancel service, all calls took a long time. I got installation equipment, instead of an empty box and charged an installation fee."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Elbert Washington",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T23:48:01.000Z",
          "Titre": "Every time it Rains or storms the Wfi…",
          "Contenu": "Every time it Rains or storms the Wfi goes out, my wife be very upset, She can’t get on her zoom meeting, it be a lot of buffing going around."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Dennison",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T17:20:42.000Z",
          "Titre": "It took 4 days to get Fusion up and…",
          "Contenu": "It took 4 days to get Fusion up and running and several phone calls to some other country with people who barley speak English. who hung up on me 5 times on 5 different calls,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Alice Long",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T17:38:33.000Z",
          "Titre": "Poor reception two days ago in the p.m",
          "Contenu": "Poor reception two days ago in the p.m. Trying to watch normal TV stations -- pixels all over the screen. After calling your Techs - was told a storm in Washington state cause of poor reception. Wish there had been other options ... Lot's of rain now -- will that happen again ~"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sharon Pomeroy",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T19:03:08.000Z",
          "Titre": "Internet going in and out every other…",
          "Contenu": "Internet going in and out every other second. Person trying to help was very good, patient, tried everything she could but nothing worked. We still are not able to hookup new TiVo Edge. Do you see why I am very upset"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NADIA KLEIN",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T03:41:10.000Z",
          "Titre": "We received the new modem",
          "Contenu": "We received the new modem, installed it and booted up. After about 4 hours the system, transmit, and receive lights were not on.Reinstalled old modem and all lights came on within 2 minutes and the internet is working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doug Fordham",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T22:59:10.000Z",
          "Titre": "Fusion upgrade was not able to be…",
          "Contenu": "Fusion upgrade was not able to be installed due to Hughes reliance on an inferior cell network. They requested that I return all the components of the Fusion system and said they would send a shipping box for the return. They never sent it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SUE VERDIN",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T19:30:08.000Z",
          "Titre": "Upgraded to 50 mb. I watched 1 movie today. Everything I put on to watch I can’t watch. Y’all just take the money but Iget nothing in return. Just about had enough of the famous HughesNet services.",
          "Contenu": "Please help me keep HughesNet. I’m on Social Security Income. I don’t my moneys worth because it’s always telling something went wrong. I will be forced to go back to satellite if my problem can’t be resolved. Thank you, Sue Verdin"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonny Ochoa",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T04:18:43.000Z",
          "Titre": "Good pricing but GARBAGE INTERNET",
          "Contenu": "For people that use games and streaming, I recommended you to not use this internet service. Even if you get 100gb you'll lagg so much that point its not funny...I was in the voice call with my friends in discord, I had 689 ms, it made no sense...I was trying to play multi-player on pc. I lagg the entire day...I'm switching to Verizon...guess this internet service I'd for Elders I don't know...but this is trash."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Hunter Hensley",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T15:21:39.000Z",
          "Titre": "I was told I would receive a new modem…",
          "Contenu": "I was told I would receive a new modem in 3-5 days.  After a week and one half, when no new modem was in the mailbox, I contacted support once again and was put on hold for several minutes after a 30 minute call with the associate.  Then the call went dead.  I still have no new modem.  The associate assured me my system was OK.  I really don't know if the system is OK or not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan Epperson",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T18:58:25.000Z",
          "Titre": "My service",
          "Contenu": "I received another device to help with connecting to the internet.  I still have a problem connecting to the internet.  It sometimes will not connect.  I need the internet for my grandkids for school."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lee Alley",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T19:10:16.000Z",
          "Titre": "I haven't gotten better internet…",
          "Contenu": "I haven't gotten better internet service from the so-called \"upgrade\" they said I would get.After the call dropping several times, and speaking to a new associate each time, it was frustrating that I couldn't be  transferred back to the original person I was talking to.Also, I should get a confirmation email stating what changes I am getting , which I haven't received."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Blevins",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T03:33:37.000Z",
          "Titre": "Upload/Download speeds are not as…",
          "Contenu": "Upload/Download speeds are not as advertised, and agents seem to have trouble getting the difference between total data and speed.  Telling me I have 75GB of data is great, but not if it downloads at 100k per HOUR!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JIM PHILLIPS",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T00:57:37.000Z",
          "Titre": "Issue was HUGHES web site would not…",
          "Contenu": "Issue was HUGHES web site would not allow me to log in because no capital letters could be in name and password.  Agent was unable to help, just changed the subject.  I still cannot log in."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gregory Cortner",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T22:16:50.000Z",
          "Titre": "I recently moved the only thing…",
          "Contenu": "I recently moved the only thing available was satellite. I had fiber at my previous home so this seems like I've gone back to dial up internet!Slow but better than nothing!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SHEILA RITTER",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T01:10:57.000Z",
          "Titre": "I called 10 days ago about slow…",
          "Contenu": "I called 10 days ago about slow connections, he uploaded update to modem.  Still getting slow speeds, today having to use my cellular data plan."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Bernard",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T21:04:20.000Z",
          "Titre": "Slow internet service",
          "Contenu": "Slow internet service. The dish is blocked by a big oak tree. I have called customer support 3 times with no results. They said the tree should not affect my service but I beg to differ"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john m ruzicka",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T14:16:55.000Z",
          "Titre": "You should have more employees such as…",
          "Contenu": "You should have more employees such as the lady I spoke with concerning paying your company. Perhapsthen navigating channel selection might become farmore user-friendly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANN BARNES",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T05:40:30.000Z",
          "Titre": "Call to set up date to take out payment…",
          "Contenu": "Call to set up date to take out payment and was suppose to be on the 3/3/2023 and it was taken out on the 27th which had a 35 dollar over draft fee not very happy with what happened.  Very unprofessional in option."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "brian evans",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T11:25:08.000Z",
          "Titre": "My internet  sucks",
          "Contenu": "My internet  sucks,  I'm paying  a 100 a month  and  it's always  buffing. I only  had  for  2 months  it's the  worst."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ed Courtright",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T21:17:30.000Z",
          "Titre": "Cost just keeps going up because of the Major Networks just keep dogging you'll!",
          "Contenu": "It's a catch 22 situation!  You keep raising your fees because the major networks keep dogging you'll!  It's a crying shame ! I don't need them because they ate liars!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Griffitts",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T20:36:16.000Z",
          "Titre": "Trying to get support services on the…",
          "Contenu": "Trying to get support services on the phone was almost impossible. It took 4 calls to get someone on line. Even when I tried to get an operator."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremiah Knox",
          "Nb_Reviews": 3,
          "Date": "2023-10-08T00:10:16.000Z",
          "Titre": "They will not read fund any portion of the fees they charge you for their \"service\"",
          "Contenu": "Out my HughesNet went out and they told me that the router was bad. They sent me a new router for me to install, which I did. I still did not have any HughesNet working so they said they were going to have to send a check out see what was wrong. When he came out, he immediately told me that the router was bad. I asked him how's that could be since I just put the new one in. He said sometimes they get a bad router and they mail that to people. So he replaced that router and it worked fine. They still charge me an arm and a leg for him to come out. Seems to be a nice racket they have. Send out a bad product have the tech come out and charge big bucks for that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "martha hale",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T23:57:38.000Z",
          "Titre": "Youtook money out of my account to…",
          "Contenu": "Youtook money out of my account to early Im on a fixed income and then want I can't pay on the 16 of the month I have no money to give it will be able 4th of each mo there no money in my account till 4th of each month so please change the due date"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GARY FORD",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:35:36.000Z",
          "Titre": "The first 3 week’s internet was good…",
          "Contenu": "The first 3 week’s internet was good after that internet low and slow not good after trying to fix still not fix"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T18:38:17.000Z",
          "Titre": "I canceled my service back in July and…",
          "Contenu": "I canceled my service back in July and I still keep getting emails and texts that I owe you money.  The equipment has been sent back and everything should be closed out.  Stop sending emails and texts!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deb P.",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T08:25:16.000Z",
          "Titre": "We only got 3 channels ever.",
          "Contenu": "We only ever got 3 channels. They usually came in good and if you ever wanted to watch something else, like streaming, it usually buffered so much, you turned it off."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tracey Reinmuth",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T12:57:40.000Z",
          "Titre": "Sorry customer service",
          "Contenu": "When you have a flashing light on your voice box you need voice help! Not try to up sell internet!  But your phone operator kept trying to up sell! Not help"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela Stepp",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T01:36:13.000Z",
          "Titre": "Awful!",
          "Contenu": "I have had experience with this company lately!My bill went up in october!Ur employee said it would be fixed back at what i have been paying!He said to pay Nov.Dec.Jan..with that lowered price..I asked about oct.Ur employee told me to pay reduced price for that month too!I called 3 times this month!Due to threating em-mails & texts!I can only pay what i am told..I have never been late..and threaten to turn off my internet...Wow!Over 20$...well..i got a letter last week,with the same threats...Highly disappointed...This has hopefully..not harmed my credit.. i worked at a bank & can find this out!We have another internet coming thru our area..What r u going to do to make this customer HAPPY?I take care of my 80 year mother.don't have time for nonense..thank u..I just filled in a date...have called hughes net at least 4 times since oct"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ray Dunlap",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T02:04:47.000Z",
          "Titre": "My internet has been out most of today…",
          "Contenu": "My internet has been out most of today (9-01 23).Resetting did nothing. Very disappointed in Hughesnet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AC Hedge",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T20:38:59.000Z",
          "Titre": "Hughesnet was charging me double what I…",
          "Contenu": "Hughesnet was charging me double what I should have been charged but only upon me bringing it to their attention did they immediately reduce my monthly payment??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy Grabek",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T22:11:51.000Z",
          "Titre": "Auto billed in error, still waiting for my refund",
          "Contenu": "The service in my area is not what I need.  In Nov when I tried to cancel I was talked into placing my acct on a 6 month seasonal hold and was told my automatic CC payment would be removed.  Fast forward to March, I am charged $258 with no notice.  When I call in on 3/19 the automated system says I am on auto pay again.  I speak to a rep and I am told I am receiving a refund because she can see that what I am saying is accurate.  On 3/30 I still have not received my refund.  When I call in I am told that Michelle did not leave any notes.  Talked to several people and spent over 40 minutes trying to get this taken care of. The 'Acct Manager' kept putting me on hold just saying they are looking into this.  Then he tells me he can only credit me one month of service, and only credit my Hughesnet account not my credit card. I had to ask for a supervisor, wait another 10+ minutes, then got my refund on my card.  This is a very poor way to run a business.  The only reason I am giving 2 stars is because the 2nd person I spoke to today was very nice, thorough, and understanding.  If we had not been disconnected I don't think it would have taken over an hour."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debra Mosolovich",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T00:14:39.000Z",
          "Titre": "I am not happy about the cost of…",
          "Contenu": "I am not happy about the cost of Hughes. I thought $78 was a bad price but now my bill is up to $98.  For the just a hook up yo the internet this is highway robbery.  I am looking for a different service. I don't want to be locked in for any lo her than necessary."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LINDA RUGG",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:39:06.000Z",
          "Titre": "Tooo expensive!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sheila Allen",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T03:43:04.000Z",
          "Titre": "The operator that helped me was very…",
          "Contenu": "The operator that helped me was very helpful. But the way you guys take data from people is just shameful. We barely was on the internet and now we have no data left and that's just plan nuts to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Reed",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T03:03:53.000Z",
          "Titre": "Data limit",
          "Contenu": "I wish there was no data limit for high speed all the other companies around us have unlimited high speed internet and have 3 kids that stream and getting ready for school I am going to have to really watch everything with them having virtual days 200gb just don’t last long"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arthur G Sewell",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T02:21:06.000Z",
          "Titre": "Our internet had been out for several…",
          "Contenu": "Our internet had been out for several days. We live in an area with absolutely no cell signal without a Verizon extender working off the internet. When the internet went out, the VOIP home phone went out. So I had to drive to Fort Leonard Wood to get signal to call HughesNet. Customer service tried to assist, but told me I had to be at the modem in my home for them to talk me through the process of fixing the issue. Again, I could not do that because of no means to call them from the location of the modem. Shortly after the conversation I had to travel to a funeral and haven’t had time to follow through. The representative did tell me that it would cost me $150 for a service call if they sent someone out. Since we recently established HughesNet service and a representative came out multiple times to work on the system because of a problem HughesNet detected, and we still have an issue, that HughesNet would not charge for a service call."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dianne Perfater",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T04:37:02.000Z",
          "Titre": "With upgrade",
          "Contenu": "With upgrade, my service is pretty much the same. Why is my signal cut drastically at night? That is why I contacted in the first place. Nothing changed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Torris",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T23:56:44.000Z",
          "Titre": "My service was great after the recent…",
          "Contenu": "My service was great after the recent up grade. Now my internet barely works. My home in Oceano is where the probe are. I am only there about a week a month. I live in Bakersfield ca"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elizabeth Herod",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T00:52:18.000Z",
          "Titre": "Salesman and Installer..then more MORE $",
          "Contenu": "We spoke to Tony  1-21-23 who sold us on HughesNet, great pricing,very friendly and professional. Installer, same experience and explained what he was going to do. I (Mrs.Herod) asked if they had small dishes,Tony said yes. He got a HUGE dish, and placed on a pole. We can live with that.Our 1st bill we paid with a Debit card not our creditcard. No one told us how our next bill would be coming,so used our Debit card which we did not authorize and got a note that they cant use it. I was waiting for an invoice but no one TOLD us our monthly bill comes on line. So, now we need to pay $5.00 a month for an INVOICE, PLUS they charged us $25.00 for the pole. I gave them my MasterCard for that only but future payment will be by a check when I receive my monthly bill. I also want to be notified when my two year contract date is to expire. It does not cost $5.00 per mo to mail an invoice.  No one informed us about that extra $60/per yr from the beginning. Not sure if I want to continue this after the two year contract expires. Anymore surprises in the billing in future best NOT HAPPEN unless advance notices thru the mail. Elizabeth Herod"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "nathaniel hoover",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T18:27:10.000Z",
          "Titre": "The internet or Wi-Fi is strong enough…",
          "Contenu": "The internet or Wi-Fi is strong enough or im not getting good internet service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Douglas Behr",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T03:19:58.000Z",
          "Titre": "A nice polite professional agent but it…",
          "Contenu": "A nice polite professional agent but it takes too long to reach a live person and the service sucks poor quality slow speed and every you tube I watch it hesitates I am very very disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TW",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T04:06:27.000Z",
          "Titre": "Signed up for the new Fusion…",
          "Contenu": "Signed up for the new Fusion plan...supposed to be so much faster and more reliable.  When it works it usually is faster, (most of the time) but no more reliable.  It goes out for no apparent reason.  It may not stay out for long, but it does go out pretty often and it doesn't have to be storming. The main issue I have is the price.  When I signed up for the Fusion there was 2 options, 50G/Month & 100G/Month.  I wanted to start with the 50G/month to see if we would be able to stream movies, etc. and if not, they said I could change the plan.  They offered a discount on the 100/month plan for 6 months, so I opted to go that route; however, since we still can't stream movies I wanted to go back to the 50/Month plan...No Longer Offered!  Now the 100G/Month plan is their base plan for Fusion and the price is 196.00/month - ridiculous.  I appreciate the internet service because we live in an area where we don't have a lot to choose from and I work from home, but I wish I would not have changed at all.  As soon as my new contract is up I will be changing to a different provider."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WILLIAM CWIRLA",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:30:02.000Z",
          "Titre": "Expensive, Uneven, Slightly Better Than DSL",
          "Contenu": "Expensive, uneven speeds, low data caps. Better than DSL, but only marginally so."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DIANE Ray AUTH USER",
          "Nb_Reviews": 2,
          "Date": "2023-01-16T16:57:30.000Z",
          "Titre": "We are having trouble with our cell…",
          "Contenu": "We are having trouble with our cell phones being connected to the internet.  We are using cell phones data when we have internet with you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leta Greer",
          "Nb_Reviews": 3,
          "Date": "2023-04-13T11:47:42.000Z",
          "Titre": "I don't know what it would take to get…",
          "Contenu": "I don't know what it would take to get better service but this is the slowest Internet in the world"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dee Pace",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T20:52:46.000Z",
          "Titre": "Hateful representative",
          "Contenu": "The person I spoke with was hateful! Seriously,yall are supposed to HELP customers. Well he did NOT!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CHARLES",
          "Nb_Reviews": 4,
          "Date": "2023-03-06T02:57:07.000Z",
          "Titre": "Slow internet",
          "Contenu": "This is the slowest internet service I've ever seen. For $85.00 a month I expected more or better"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josie Hart",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T17:25:37.000Z",
          "Titre": "buffering",
          "Contenu": "It has been buffering more then usual. Not happy with that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dane & Jean",
          "Nb_Reviews": 4,
          "Date": "2023-06-22T16:50:53.000Z",
          "Titre": "You never reset the data usage and are…",
          "Contenu": "You never reset the data usage and are constantly trying to sell tokens. What kinda junk is that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RICHARD LEGLER",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T17:08:26.000Z",
          "Titre": "Terrible internet service",
          "Contenu": "Terrible internet service. Keeps going down. We were also told the cost would be $55 and because the service is so poor we had to pay more $90 to get a higher speed service. Still not working correctly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DANNY",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T04:30:27.000Z",
          "Titre": "I raised my contract from 30 gb to 100…",
          "Contenu": "I raised my contract from 30 gb to 100 gb. I am trying to stream some movies & it just cannot cut it!!!Totally discussed w/ your product!!!This marriage won’t wast!THANKS,Danny Deen"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "silvia lucas",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T21:08:31.000Z",
          "Titre": "Plans doesn't works for me",
          "Contenu": "The representative was very helpful but the plan that I changed didn't works for me, again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Louis",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T03:14:28.000Z",
          "Titre": "Not impressed....My service goes in and…",
          "Contenu": "Not impressed....My service goes in and out...Not happy. If keeps happening I will demand a refund and cancel subscription..I pay for 24 hour service,,NOT work when it wants to...It is NOT my computer...Believe me. Date of experience below and OTHER Dates...Good Luck.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "paddywack",
          "Nb_Reviews": 3,
          "Date": "2022-11-11T19:16:28.000Z",
          "Titre": "I was NOT told...",
          "Contenu": "When I first subscribed I was NOT told it was a TWO YEAR contract!!!! I find connections are often slow. I would change providers if I could. My most recent experience? It took more than ten of my cell phone minutes to change my payment method/provider. I am NOT a happy camper!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "garland seegert",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T02:23:07.000Z",
          "Titre": "I was supposed to get a $30 discount…",
          "Contenu": "I was supposed to get a $30 discount for three months. I only got a $20 discount! My regular rare is $100.67 now there taking $80.67  !Why?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darion Walker",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T01:48:47.000Z",
          "Titre": "The internet is slow and it suppose to…",
          "Contenu": "The internet is slow and it suppose to be fastest one you got! It works some what but a lot of the time it doesn’t"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis Glover",
          "Nb_Reviews": 3,
          "Date": "2023-03-26T19:21:45.000Z",
          "Titre": "Data is being pulled even when not in…",
          "Contenu": "Data is being pulled even when not in usePulls more data than expectedCost was more than expected"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RICHARD KOKER",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T00:54:06.000Z",
          "Titre": "My one complaints is Netflix is to…",
          "Contenu": "My one complaints is Netflix is to slow. And once I get it on, it's say can't put the movie on or try again. I try again and again. Then I call Netflix to help me, everything on their end is good. Then I thought I tightened up the cable, the white one. And it's went on. The white cable don't tightened like it should. So, once the movie come on, it's blurry. I called again, she wanted me to go on line for the troubleshoot. And I am a senior citizens and I can't figure it out. I am sorry. I give up.☹️"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Bechel",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T23:15:24.000Z",
          "Titre": "The internet speeds are NOT as…",
          "Contenu": "The internet speeds are not as advertised. Not even half as fast. I was told that you couldn't play the first person games because of the lag times, but streaming moves was ok. Not true on the moves. I can't even watch a YouTube video without major lag."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Mayhew",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T05:25:31.000Z",
          "Titre": "The information I needed was never…",
          "Contenu": "The information I needed was never given. Total waste of time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bonnie Konczak",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T22:43:27.000Z",
          "Titre": "I have been having trouble with my…",
          "Contenu": "I have been having trouble with my TV's. The internet is real slow and can't get my channels to come in half the time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sabrina Ewers",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T04:20:31.000Z",
          "Titre": "Our internet is always buffering we…",
          "Contenu": "Our internet is always buffering we can’t watch Netflix completely, YouTube or anything because it keeps buffing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tipton Powell",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T04:11:49.000Z",
          "Titre": "Bad Experiences with HughesNet",
          "Contenu": "Our ability to stream anything is extremely limited and sometimes even times out. We constantly relieve warnings of our network being unable. It takes forever for pictures to load and our smart home devices are slow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "WILLIAM DELAMAR",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T04:25:52.000Z",
          "Titre": "Concern",
          "Contenu": "I was told that if I wanted to get a statement of my final expenses that I needed to FAX to a number. I let fax go years ago. Don't you email?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Odle",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T17:18:15.000Z",
          "Titre": "I called with a question about WiFi…",
          "Contenu": "I called with a question about WiFi strength (because of buffering in a room where there is no modem) after talking to Lupe and telling him my TV located in the room with the modem never buffers (in on decreased GB speed) now I can't stream TV in my room with the modem because it buffers continuously.  He did tell me there is a new Hughes net coming before the end of December and my name is on the list to sign up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samuel Queen",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T02:18:53.000Z",
          "Titre": "They could not fix my problem with my…",
          "Contenu": "They could not fix my problem with my e-mail. Still having some small issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kim Stanley",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T10:14:51.000Z",
          "Titre": "My phone always stopping and tell him I try again in the middle of a movie",
          "Contenu": "I don't like went in the middle of the movie it just stopped and then I have to wait for it to reload and reload real slow and then it'll say try again or close that that's crazy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NANCY STANEK",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T18:02:24.000Z",
          "Titre": "Service wait time too lengthy",
          "Contenu": "I could have given a better rating if it hadn't taken 3 weeks to get the service completed. The serviceman was great,friendly and helpful. Unfortunately, he's the ONLY serviceman for the entire St Louis area. I live in the country and get poor cell service at home. That means I rely solely on the internet at home so having no service for 3 weeks was more than a little inconvenient. I did call and thankfully received credit for this. Thank you.I realize there's no easy solution but this issue needs to be resolved. I'm sure I wasn't the only one without service."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Yvonne Mendez De Jesus",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:15:25.000Z",
          "Titre": "At times the signal tends to be slow",
          "Contenu": "At times the signal tends to be slow, with a lil rain - internet is down , seems like while I’m not using it( very rarely I use it ) my gb/mg seems to get used( I have cable tv - no need for internet) if I’m not mistaken- I’m the only one using the internet in my home"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Connie Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:39:01.000Z",
          "Titre": "My Internet don't work half the time my…",
          "Contenu": "My Internet don't work half the time my phone won't stay connected it spends half the time loading and it's not very fast at all"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Irene Fitch",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T14:21:05.000Z",
          "Titre": "Ok but runs slow for satellite internet.",
          "Contenu": "The gentleman who installed my hughes,Net was polite and worked quickly. I wasn't told that I was apparently getting the smallest and slowest version of hughnet. The data runs out very quickly which then either doesn't run or runs so slow it take hours to download anything while on the internet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paula Bass",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T02:57:46.000Z",
          "Titre": "My assessment of the HughesNet experience",
          "Contenu": "I liked the swiftness with installation, helpfulness of billing and technical support, and the seemingly overall eagerness of everyone I came in contact with, to be helpful. What I dislike is that it seems to buffer frequently, and for no apparent reason."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Albert Tretter",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T21:27:09.000Z",
          "Titre": "????…",
          "Contenu": "I did not purchase anything  merely put service on vacation pause ( for second time as I thought that was done in October) I paid Hughes $106  that I received no benefitNo surprise I am not thrilled with Hughes atPresent . No complaints on internet service Though ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Cowan",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:16:29.000Z",
          "Titre": "I thought I had entered autopay info by…",
          "Contenu": "I thought I had entered autopay info by needed deadline.  Unknown to me the info was not transmitted to Hughes.  I lost my service on 11/10/23. When my server still was off on 11/12/23 I called Hughes and got matter corrected and got back online.  On 11/14/23 I received an untimely snail mail indicating my service would be cancelled if no payment received.  Had I known my payment had not been received, I would have corrected the matter promptly so as not to lose my service!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T00:50:16.000Z",
          "Titre": "I honestly don't remember",
          "Contenu": "I honestly don't remember but I'd just like to say it kind of stinks that we have to pay to use a certain data amount, why not just charge at the end of the month for the amount of data we use?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathryn Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:28:09.000Z",
          "Titre": "Bad experience from start to now.",
          "Contenu": "Bad experience from start to now.When setting up in my home, Young man didn't stay till setup was finished and up to now the service is poor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jodi",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T00:30:13.000Z",
          "Titre": "I pay $79.99 per month for 15 gigs of…",
          "Contenu": "I pay $79.99 per month for 15 gigs of data, and it is always used up before the end of the month. I am not online an excessive amount of time each day; I purchased my own equipment; and being in a rural area means that Hughesnet is pretty much my only option. Service is not particularly reliable, and I think for this amount of money for internet connection only, I should be receiving unlimited data, not being requested to purchase tokens for additional gigs when my data runs out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LaRee Pedro",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:48:13.000Z",
          "Titre": "Arrived on day and time promised",
          "Contenu": "The installer arrived on time. I am a \"caregiver\" and was called to leave for an emergency medical appointment. So, I had a neighbor come and stay through the completed project. Upon my return the installer had completed the installation and left our home. I called HughesNet for a review and installation explanation, but the customer service representee was less helpful. I asked if they could send someone (at their convenience), to go over the installation information with me, and was told \"no one was available\" then referred me to the \"Welcome guide, Tools & Resources support brochure\". I still have some \"cords and wires\" behind my desk that go nowhere. Sorry, I'm an 85-year-old \"Senior\" who still likes to get a \"physical\" explanation and help when needed!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MARTIN VON DUYKE",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T19:15:57.000Z",
          "Titre": "First of all",
          "Contenu": "First of all, I was not informed of certain things that I had to change later. And getting on your website is next to impossible. When I did get on I was ask a security question that I was never asked in the first place. The last time I called for information, I was given the wrong information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debra Patrick Brownlee",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:36:49.000Z",
          "Titre": "Live Hughes netNothing went wrong this time",
          "Contenu": "Nothing went wrong this time. The rep was helpful and knowledgeable  about discounts and as a senior citizen how I can get more taken off my bill. Wonderful experience. The only thing I think you should do replace equipment that we already rent after many years. I'm still using rhe old one from 9 years ago when I lived down the driveway and brought it with me 4 years ago. All in all I am very pleased with my service and my ability to connect quickly. Always getting a signal except in bad weather.  Love hughes net."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 5,
          "Date": "2023-11-07T21:38:13.000Z",
          "Titre": "I called because of the constant…BUFFERING!!!",
          "Contenu": "I called because of the constant buffering when we try to stream something.  Went through several steps with the woman on the phone.  The buffering stopped and I said it looks like it is fixed.  We hung up and ten minutes later the buffering started again.  Every time I call about this problem I'm told different things.  I would just like to be able to stream a movie without buffering."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pearly Landero",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:09:17.000Z",
          "Titre": "Don't like that the internet runs…",
          "Contenu": "Don't like that the internet runs slow,and they trouble shoot it its ok for awhile and then just before payment it slows down"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Buretta",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:49:24.000Z",
          "Titre": "Phone home networks no longer work.…",
          "Contenu": "I found out my home phone jacks no longer work.  Only the portable phones plugged into the Hughes modem work so I will not be able to use my hard-wired phone system in my bedrooms etc.  I also found that my older computer with no wifi works plugged into the modem, but it will no longer print to my HP printer as it did on the Century Link system.  Tech support did help me request my current number to be ported to the Hughes sustem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "lynnmillerut",
          "Nb_Reviews": 3,
          "Date": "2023-10-28T19:23:07.000Z",
          "Titre": "Our phone internet service does not work well",
          "Contenu": "Our phone internet service does not work well.  It is very sketchy and sometimes we can’t use it at all.  We got this service, at a remote mountain cabin location, mainly for emergency phone service and we can’t depend on it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T02:04:12.000Z",
          "Titre": "Discount?!",
          "Contenu": "I was told over the phone that I am receiving a discount of $25 on my monthly bill. When I looked online, I see that $74.99 is the monthly rate for the 50 GB plan which I have now and in fact I am not receiving a discount. I had been paying over $100 for a 30 GB plan which isn’t even an option anymore. Some discount!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SHARN STRICKLAND",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:22:56.000Z",
          "Titre": "Thought conversation weren’t well and I…",
          "Contenu": "Thought conversation weren’t well and I understood every thing. Agent was patient and helpful. Made notes of every thing and confirmed my upcoming year price quote per month( as in my notes) closed transaction. BUT then my next years bill and info was text to me next day! NOT THE PRICE QUOTED! Seems she forgot a  fee!  Tried to get price quoted but to no avail! Asked for higher manager but she would not transfer further. Been a customer for years and now extremely disappointed in our arrangement!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Doris Edie",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:41:36.000Z",
          "Titre": "Followed directions for installation and still couldn’t get it to work.",
          "Contenu": "Followed directions for installation and it still wouldn’t work.  Had to have a visit we don’t think we should pay for. The man thought something was odd and then said they should have told us how to do something over the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacquelyn Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:11:40.000Z",
          "Titre": "I dislike the the service of not…dislikes",
          "Contenu": "I dislike the the service of not contacting the customer directly. Many of your customer are over the age of 65, and they are using cell phones because home phone are quickly becoming a thing of the past . Many seniors are not able to use the internet with the effect as are younger persons,  so a friendly call rather that a text message would be appreciated ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mikaela marple",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T01:21:52.000Z",
          "Titre": "I called because I lost service",
          "Contenu": "I called because I lost service.  The call taker had an extremely strong accent and I had to have her repeat herself multiple times just to answer a question.  Was placed on multiple holds, some longer than others.   Her tone of voice was pleasant, I just feel as if I spent way to much time on the phone.  Fortunately it was a satellite issue which resolved in an about an hour.  Otherwise, this score would be much lower."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PENNY PIPHO",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T00:24:58.000Z",
          "Titre": "Hire Americans pleased",
          "Contenu": "Couldn’t understand the person speaking the first time I called, so I called back and talk to another person who was a little easier to understand. The severe accents are not pleasant when you’re trying to get information. It is too easy to mix up what they’re trying to say because some of their words are not in the correct order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alexis Soto ItsGuitar Styles",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:20:56.000Z",
          "Titre": "The Thing I Like For This Internet I…",
          "Contenu": "The Thing I Like For This Internet I Can Wacth Movies And Series in Online But The Thing I Hate About This A Can Play My Favorite Game Online Is The Hates internet for gaming oh please I Have To Way So I Have wait so Many Time To Cancel This Internet To Find A Good One For the one I Can Play My Favorite Game In Online."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martha Bettis",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T00:12:37.000Z",
          "Titre": "When I enrolled in a contract with your…",
          "Contenu": "When I enrolled in a contract with your company several year ago, I was under the understanding that what I was paying for the service was covering my home's TV, computer and phone.  I started receiving emails about tokens.  I contacted Hughes and purchased 30 Tokens.  I feel that you are comitting . fraud."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kimberlee",
          "Nb_Reviews": 3,
          "Date": "2023-09-30T20:48:35.000Z",
          "Titre": "well i had an issue with my bill",
          "Contenu": "well i had an issue with my bill. we tried to move up and get more data but for three months i paid a higher price but still didnt get the extra data. and this last month they did credit my account for the extra amount paid but it caused issues with my signal. and i am having to reset my billing cycle as our income dates have changed. and because of those changes i have been late paying my bill. but we couldnt change it until tomorrow due to the issues occurring with my account over the amount being credited back to my account. hope all of this makes sense and thank you for listening."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MERILEE DYMACEK",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T16:49:48.000Z",
          "Titre": "Incomplete installation",
          "Contenu": "The installer removed the satellite dish from my previous internet company and told me I could throw it away, which I did. He did NOT remove the TRIA (transmitter)  on the end of it that was to be returned to that company and since I hadn't done this before, I didn't realize it until I got the box from that previous internet company. Luckily I was able to retrieve the dish and had to call on someone for help to remove the TRIA and hope that it hadn't been damaged!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cliff Payne",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T03:34:36.000Z",
          "Titre": "The efforts of the Hughes net team and the field techs",
          "Contenu": "The efforts of the Hughes net team and field techs were very good. My issues lie within the elements that, since basically being forced into upgrading to the 5G network, my internet isn’t working any better or faster than my old 4G router did, yet, my bill has raised $23 and change! You’d think that a 5G network would be far superior in performance than the performance of my old 10 year old 4G router, but, it isn’t!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Len",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T02:01:31.000Z",
          "Titre": "We've been using HughesNet for a long…",
          "Contenu": "We've been using HughesNet for a long time for both personal and business computing and have found it to be both good and bad.  Good because we can't get cable and bad because the weather can create problems.We went off the air a couple days ago and called for service and spent an hour on the phone without a cure until we talked to Jacob who did an excellent job of correcting our problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Blanche Domingo",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T05:44:32.000Z",
          "Titre": "We are experiencing difficulties with…pictures being pixelated and shows having to refresh.",
          "Contenu": "We are experiencing difficulties with pixelated pictures. It keeps having to refresh the show we’re watching. I don’t know how else to resolve issues. I will customer support again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rum",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T18:07:04.000Z",
          "Titre": "Still slow, but a little better w/ Fusion",
          "Contenu": "My wife works from home and is required to have reliable internet for medical coding through a VPN.  Unfortunately, we live in an area with limited internet. Well after an hour-long technical tweaking we had to upgrade to Fusion.  Now we are able to achieve 5 mbps download during prime-time. We had two days with 20 mbps, but it looks like we will never have the advertised 25 mbps. Moving to a location with faster internet or changing jobs will probably be the only solution."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry Sinnett",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T10:55:42.000Z",
          "Titre": "could get some decent internet not like…",
          "Contenu": "could get some decent internet not like dail up slow as a snail. charge 100.00+ for so called fast internet and then most everytime you on it, it either gives you this site cannot be reached or it will do nothing just set there and grind! Very poor internet service for what you all call fast and reliable internet. NOT"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Mccreary",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T00:16:23.000Z",
          "Titre": "I did not like the customer service…",
          "Contenu": "I did not like the customer service line tried connecting to find out about a letter I received.   Well every time I called punched in the information it hung up on me!!!    Feel for the money I am paying I should be able to talk to a live person.   There are other internet providers maybe I should get one that cares about me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Shook",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T00:09:33.000Z",
          "Titre": "Installation was OK but didn’t Your office people are not very good at explaining things when you call for help explain…",
          "Contenu": "Installation was OK but didn’t explain the difference between the 2G and 5G. Also didn’t have a wifi booster. Your office people are not very good at explaining things when you call for help. Horrible reception. Horrible customer service. But it’s the only thing available and they know it. Could never understand a word they are saying. Services from a foreign country"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alfred",
          "Nb_Reviews": 5,
          "Date": "2023-11-17T21:04:55.000Z",
          "Titre": "Many time when I turn on my email I see…",
          "Contenu": "Many time when I turn on my email I see the notice \"no internet connection\" and  there is no storm"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles Poulton",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T23:35:59.000Z",
          "Titre": "The satellite service review",
          "Contenu": "The satellite service is poor at best.  Speed is slow.  Constantly dealing with buffering on TV and I-pads.  Constant interrupt of intranet making it very hard to many times complete task on line such as paying bills.  The only plus I have found is your customer service has improved in recent months.  i am sorry I have nothing else positive say."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue Rearick",
          "Nb_Reviews": 2,
          "Date": "2023-11-12T20:23:50.000Z",
          "Titre": "Service",
          "Contenu": "Trying to get to talk to a person and not a machine to get some answers....should be a button to just talk to a person right off the back when calling....."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Hjorth",
          "Nb_Reviews": 9,
          "Date": "2023-05-13T14:32:06.000Z",
          "Titre": "Not The Best, Not the Worst",
          "Contenu": "The internet service is not the greatest, and when I stream it buffers often.  When I access something as simple as Sudoku, WordWipe, or a Crossword puzzle, often it would take as long as 10 minutes to load.  As a result, I would go use my monthly alloted minutes earlier.  After contacting Hugesnet for assistance more than once, internet response is faster, but not impressive."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "MILDRED FELIX",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:09:15.000Z",
          "Titre": "Need to lower prices",
          "Contenu": "I was charged too much. Thats not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "richard callicoat",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T22:08:14.000Z",
          "Titre": "Good support",
          "Contenu": "Great help from CSR.only negative that I have is the somewhat lagging in bandwidth.at times for some reason I experienced connection and downloads at almost DSL levels?.could e heat wave , sun etc?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anna K",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T03:57:15.000Z",
          "Titre": "3 stars",
          "Contenu": "Not a fan of the tokens. Also last time we paid the bill but it wouldn't connect until we called and spoke to a representative. Other than that, wifi works great and the only internet service provider that could connect us in \"remote\" \"bad signal\" area."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tammy Jarnagin",
          "Nb_Reviews": 9,
          "Date": "2023-08-15T23:53:37.000Z",
          "Titre": "I am mediately received a bill that…",
          "Contenu": "I am immediately received a bill that they said would be adjusted. They had put me as a cancellation instead of a pause and are trying to charge me $300 for it and then I’ve got something today saying that you were denied to take it out of my account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "suzanne grim",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T20:51:56.000Z",
          "Titre": "I called 3 weeks ago to smy Visa…",
          "Contenu": "I called 3 weeks ago to say my Visa card was compromised, and I would call back with the number of a new card as soon as I got it. During that time I received 2 emails from HughesNet that my service would be discounted  without payment. I called back the day after Labor Day with the new number, and accomplished nothing after a half hour on the phone. The fella kept asking me questions, and then said I would have to call a 3 digit number then star. This didn't work. Talked to him further until I said I was done. He had the new number, I was too frustrated to talk any further.A week later a got a letter stating my service was soon to be discounted. I called again.This time I think it was resolved. Wouldn't be surprised if I get another letter or service disconnected."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra Ober",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T00:35:36.000Z",
          "Titre": "Was disappointed Hughesnet was charging…",
          "Contenu": "Was disappointed Hughesnet was charging me so much for such a long time and only now offered to lower my rate !   However service has improved"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Childress",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T12:08:42.000Z",
          "Titre": "The only reason I am giving 3 stars is…",
          "Contenu": "The only reason I am giving 3 stars is because the internet is not that good. Customer service was great and the installer was wonderful. Just not happy with internet speed. I had Spectrum for years and it was wonderful. Had no idea that this service would be so much slower. We are able to have Netflix, however sometimes slow to load or it will say unavailable. Only changed to Hughesnet because we moved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 3,
          "Date": "2023-10-06T20:47:31.000Z",
          "Titre": "I wish you didn’t have contracts",
          "Contenu": "I wish you didn’t have contracts .I was told I would have a lot more down load and up load speed.I don’t have 2mega bytes of download speed and upload is about .27 I can’t send more than 1picture at a time and then over half the time it times out before it sends.Sometimes it takes me 20 minutes to pay one bill online My internet is almost useless I have to keep this for another year before I can try someone else. Don’t even try to find out why it is so slow and uses so much data.They say they will send someone out but will charge extra I just can’t afford it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DEB",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T03:24:53.000Z",
          "Titre": "I was not happy that they could not…",
          "Contenu": "I was not happy that they could not refund my money. Were they overcharged me for this month because it put me in a spot with my other bills they said they was going to credit it to November’s bill but I needed the money now but I guess it is what it is. Thank you. And they take it auto pay which goes out right away, so why can’t they refund right away? I never did understand that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank J. Oblak",
          "Nb_Reviews": 5,
          "Date": "2023-09-02T00:07:30.000Z",
          "Titre": "Your employees are fine",
          "Contenu": "Your employees are fine. I still am not impressed with the constant repeat of not being on wifi when I actually have it. The speed is not what I would expect. This is an ongoing problem that I reported"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Tabb",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T19:01:30.000Z",
          "Titre": "Installer was efficient and fast, but...",
          "Contenu": "Installer was efficient and fast. Seemed to do what he was supposed to do well. We had problems with understanding how to get our new technology to do for us what we wanted. The installer was rather cold and matter of fact with, poor clueless customer skills. We still can not function in the things we were looking to do, Zoom. Need someone people friendly to do follow ups."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dotti Alden",
          "Nb_Reviews": 3,
          "Date": "2023-08-30T22:37:57.000Z",
          "Titre": "I attempted to resolve my problem with…",
          "Contenu": "I attempted to resolve my problem with your automated system but half way through it stopped and put into a menu for services. Then I had to wait over ten minutes for a service representative."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mrs. Jameson",
          "Nb_Reviews": 5,
          "Date": "2023-05-30T16:26:54.000Z",
          "Titre": "I've had HughesNet before and slowly my…",
          "Contenu": "I've had HughesNet before and slowly my bill rose to $155 per month on autopay. When I discovered it I was enraged and cancelled them. Unfortunately, the service I changed to is worse than Hughes, so in picking the lesser of the evils, I decided to go back to Hughes. Again, unfortunately, as of this date, 5/30/23, I still am waiting on Hughes to restore my account..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BRYAN STORM",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T00:44:44.000Z",
          "Titre": "My first call did not go well the lady…",
          "Contenu": "My first call did not go well the lady that I spoke with did not apparently know much about availability of HughesNet and how the billing system works she was of no help whatsoever. I called again and got a nice young man who tried to work with me and help me get my bill lowered which I truly appreciated I do not like how it just creeps up and creeps up every month. I will give this some time and if I still have the same issue there are other options available for me. I have had HughesNet for over 20 years and really never had any problem till the past few months."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Seamus Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T21:17:19.000Z",
          "Titre": "Service ok but NO Customer Support number",
          "Contenu": "The service is relatively reliable and the speed ok for the format. Customer Service almost non-existent given the phone numbers listed for same. I had to call sales and threaten to cancel before I got an actual person on the line. However, once connected he was very good at helping me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Lenzen",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T23:17:11.000Z",
          "Titre": "I still have buffering problems at…",
          "Contenu": "I still have buffering problems at night despite a 500 mgs of data . I am currently exploring other sources for internet providers due to Hughes inability to solve this issue.Your rep was very patient and had an answer for all my questions. My buffering issues are almost always at night."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ELLEN GANO",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T21:34:23.000Z",
          "Titre": "I am assuming that this is related to…",
          "Contenu": "I am assuming that this is related to my internet service.  Erica, the young lady I spoke with on the phone was wonderful and assisted me in increasing my limit.However, the internet service has not been very good for some time.  I can look at some websites but the  download speed is frequently slow.  5G will rarely load at all; and 2G is frequently very slow.  We can not stream anything unless we use our phones (Verizon) so it is useless for that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James w Merriman",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T14:58:40.000Z",
          "Titre": "Didn't help the problem at all.",
          "Contenu": "Didn't help the problem at all.Our service with Hughes net is terrible.  If i am on my phone, I would say about 98% of the time I have to dissable internet on phone for anything to load up. I have to use my phones data and then it loads right up. Also while watching movies, I get frustrated and usually just turn the movie off, because of all the buffering. So I'm wondering why ì am paying for something for nothing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Krohn",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T23:07:05.000Z",
          "Titre": "No notification of new upgrades",
          "Contenu": "New upgrade is great but they never notified me it was available until second call about how slow my connection was.  Turns out to be outdated equipment.  Wish they would have replaced it sooner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lana Terman",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T17:02:45.000Z",
          "Titre": "I called because I could not play…videos",
          "Contenu": "I called because I could not play videos on Facebook, particularly bad in the “watch” tab.  Your employee convinced me that increasing the mb (?) from 25 to 30 should solve my problem.  Unfortunately, it didn’t help at all, so I don’t want to be paying for the 30 when it didn’t change anything.  When I first got Hughes Net, the videos played fine.  Please respond.  Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dimitri Polimenakos",
          "Nb_Reviews": 4,
          "Date": "2023-04-14T23:25:46.000Z",
          "Titre": "Smooth installation, bad performance.",
          "Contenu": "The installation technician was fantastic. He explained everything and got the system working before he left. The problem is with the system performance and pricing. The pricing was higher than what I was quoted upon signing up. The performance is 1/3 of the speed I was told the system would handle.Specifically, I was told it would be 75 MBPS but my testing only produced 20-30 MBPS. Furthermore, I need to use a repeater for adjacent rooms. The signal is often lost and a reset of all related equipment is needed to restart. This is connected to DIRECTTV streaming, and the other computers using the internet are extremely slow when streaming. The ping is over 1000 ms and that does not support gaming at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlotte Matthews",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T03:23:09.000Z",
          "Titre": "Upset in Dixie",
          "Contenu": "Well, I asked a rebate lady about 3 months ago, I called about your rebate of 300.00 credit card and I went thru several of your associates until I finally got a 30.00 discount on my bill until I got the amount.  I talked to one of your rebate people to get it multiple times. Now, I been told by Verna tonight that I could not get it.  Come on people keep up with your customer's conversations on the computer, so you will know what's going on or get competent people to handle what's going on.  If it was'nt for having to pay a 190.00 leaving fee.  I'd drop you in a \"New York Minute.,\" I still want my 300.00, the one that your customer service never told me there was an expiration date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sylvia Romo",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T23:50:17.000Z",
          "Titre": "1st month",
          "Contenu": "I liked the prompt availability for installation. The technician arrived a day later than scheduled. I don’t like that I have to pay a rental fee for the router. That should be included in the monthly fees, or be given the option to buy it so that we reduce the monthly cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond Mcelhiney",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T22:33:01.000Z",
          "Titre": "This internet experience is no what i expected. t what I…",
          "Contenu": "This internet experience is not what I expected.  For the money I pay, there is way too much buffering and slow streaming to suit my needs. I can't wait for my contract to end. All internet and TV streaming in my area lacks integrity."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marilyn Harasick",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T04:16:10.000Z",
          "Titre": "our true experience with Hughes",
          "Contenu": "we have our internet with them and we have purchased their highest whatever and yet our internet service stinks.  Our neighborhood do not use Hughes and they all have lived here all their lives and they all say Hughes is not what they use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CSM - Santa Fe",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T18:56:36.000Z",
          "Titre": "Generally not elated",
          "Contenu": "Generally, I am not elated with the service - its seems to be unreliable.  Plus it won't work with my security cameras for some reason.  Up load is too slow also.  Expensive for mediocre capability."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Irvin",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T11:52:48.000Z",
          "Titre": "False Advertising",
          "Contenu": "In August of 2022 Hughes Network advertised a $300 visa gift card for signing up so I did and never received my card. I was told that it would be mailed after 6 months of on time payments I then called and was told that I needed to print out a rebate form there is no rebate for the $300 visa card this was all false advertising there never was a $300 visa gift card. I have contacted the BBB"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 3,
          "Date": "2023-07-22T23:17:53.000Z",
          "Titre": "Satellite is the issue",
          "Contenu": "Customer support was great. But it’s the actual satellite that’s the problem. I lose my internet connection every time there is a storm. And this July we’ve had a lot of storms! My power doesn’t go out, but my internet does."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PETER RAINE",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T16:41:16.000Z",
          "Titre": "I have been using Fusion for about 2…",
          "Contenu": "I have been using Fusion for about 2 weeks and it has been a somewhat disappointing experience. There are times when the service seems faster and more reliable. However, at other times it is much more spotty and downloading is much slower."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "pamela olszewski",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T17:57:31.000Z",
          "Titre": "Some good",
          "Contenu": "Some good, some bad. I liked the rep who helped me with my initial problem, but when I asked him to send me an email confirmation, I was transferred to another person who did not answer my call. I waited a long time and finally gave up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carolyn Quin",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T22:33:24.000Z",
          "Titre": "I contacted the company to see if I…",
          "Contenu": "I contacted the company to see if I could get a reduced monthly charge, as I am on a fixed income and just $64.98 to $86/38  Instead of giving me an answer, I was told to go to a government program to see if I qualified for a reduced.  I am on a fixed income and my husband is retired also.  I have been ill for about one year.  I do not use the computer hardly any now.  Can I please get an answer from you without having to fill out government forms,etc?  I completed the gov. form with the exception of uploading pics, etc., which I do not know how to do (this prevented me from finishing form).  Iam not that computer saavy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yvonne Dolence",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T16:36:18.000Z",
          "Titre": "Paying over $100.00 a month",
          "Contenu": "Paying over $100.00 a month, got your new internet service and still buffering... My 18 year old left, so she isn't using it constantly and still buffering..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gerald Wells",
          "Nb_Reviews": 3,
          "Date": "2023-10-27T18:59:11.000Z",
          "Titre": "confusing to me on the $50.00 per month…",
          "Contenu": "confusing to me on the $50.00 per month stop and restart ant time that I was promised..now I am told nothing is guaranteed and charges may very?????  not the simple plan I was sold..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-08-30T00:53:55.000Z",
          "Titre": "The price difference is not worth the drop in speed.",
          "Contenu": "The price is too close to other services that do not cut speed to make the speed difference not worth the small price saving.  If I had to do it over, I would pay the higher price to maintain the speed all the time. I will probably change at the end of the year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MAB",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T11:36:45.000Z",
          "Titre": "After card fraud, changing my auto payment wasn't easy",
          "Contenu": "I was hit by card fraud and had to change my payment option on file. It took 3 different log ins to be able to change the card on file. 2 of those were thwarted by the payment system being \"unavailable\" which was a pain. One of the log ins was right after Hughesnet sent out a notice that my payment had failed. If a company is going to send notice they should TRY and have the system available for at least 24 hours!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Douglas Findley",
          "Nb_Reviews": 4,
          "Date": "2023-10-17T13:34:28.000Z",
          "Titre": "The internet connection is troublesome…",
          "Contenu": "The internet connection is troublesome even on a sunny day.  It is something I have to live with where I live.  I also have Dish and it seems to stay up more than the internet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T23:00:32.000Z",
          "Titre": "WIFI is very slow",
          "Contenu": "WIFI is very slow. I get disconnected frequently.  For the monthly cost I would expect better.  Buying extra \"tokens\" to keep speed up is ridiculous.  I would switch carriers if I could."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MARION MITCHELL",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T12:29:27.000Z",
          "Titre": "Service is problematic in my area",
          "Contenu": "Service is problematic in my area. Cost is unreasonable for what you recieve. I can say the agent who addressed my problems was very helpful trying to assist me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald Funderburg",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T06:03:38.000Z",
          "Titre": "Standard entry level internet",
          "Contenu": "Weĺl, if you need to have internet the service is ok.  Being a satellite company, i dont see why the service isnt exceprional.  However, in my area, it is sub par.  Why? I have nothing to obstruct my line of sight,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jedana Hook",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T19:18:59.000Z",
          "Titre": "I have not had good reception since…",
          "Contenu": "I have not had good reception since this was installed. I want to go back to Century Link but I cannot because of the two-year clause. There are two other desktop computers in the house. Their reception is spotty. I don't like Hughes Net."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mell Buenger",
          "Nb_Reviews": 3,
          "Date": "2023-06-19T21:05:41.000Z",
          "Titre": "We are well pleased with our Hughes net…",
          "Contenu": "We are well pleased with our Hughes net service, however we recently had a change in our credit card and needed to change it for Hughes.net.  It was almost impossible to complete the change due to the heavily accented person.  I asked to speak to someone who had English as their first language.  This did not happen!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "karla uccellini",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T16:12:39.000Z",
          "Titre": "For the most part I’ve been satisfied…",
          "Contenu": "For the most part I’ve been satisfied with the service however, I still get pixelated pictures from time to time. I can’t tell you exactly the date of the experience since it happens at least 3times a month."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pamela Pomanto",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T13:09:21.000Z",
          "Titre": "Timely updates that are requested",
          "Contenu": "Seems like it's taking a long time to fill my request to update my request. I'm trying to use a smart tv and am unable to get full service because of your internet services? Why?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aldo Lombardi",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:24:55.000Z",
          "Titre": "Sometimes the speed is quite good but…",
          "Contenu": "Sometimes the speed is quite good but at times it seems to hang up and the response is pretty slow!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carol Buckner",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T21:46:00.000Z",
          "Titre": "The main thing that was wrong was the…",
          "Contenu": "The main thing that was wrong was the agent said I would have a $19 credit I did not get a credit they took $19 from my checkbook!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T01:04:27.000Z",
          "Titre": "My internet has been slow for sometime…",
          "Contenu": "My internet has been slow for sometime and we can’t stream our tvs at all. So I’m having DISH put in and keeping the internet that I currently have. I talked to someone at HughesNet and tweaked my service a bit and hoping to have it work better. We will see."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lorna McCarthy",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:34:55.000Z",
          "Titre": "Wanted to remove wifi from my television",
          "Contenu": "the first young lady from the Philippines was very cordial and pleasant as we spoke on the phone and she helped me with the cost also. I appreciated that a great deal.I chatted later after I had called my TV provider and the manufacturer to see if they could help me remove wifi from my TV as I do not need it and it was causing me to lose data that I did not need to use on wifi...twice I was disconnected and the 3rd chat person was unable to help me with the solution but offered a department I could call within HughesNet that could disconnect my wifi and reset it all over again..maybe.  I was so tired of dealing with it all day that I just ended the chat and put it all on the back burner so to speak...I have always had very pleasant people when I have called..but my issue was not resolved that day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fritzie Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T01:35:54.000Z",
          "Titre": "While trying to watch a buffering every minute !!!movie on tv my…",
          "Contenu": "While trying to watch a movie on tv my internet was so slow it stopped and buffered every minute! Exhausting. My husband keeps telling me I made a mistake by switching! Uhg"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CRISTAL WILDMAN",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T00:21:31.000Z",
          "Titre": "My acct was fraud which it wasn’t I had…",
          "Contenu": "My acct was fraud which it wasn’t I had 2 debit cards hacked and I have been using my new debit for months so they said it’s fraud I have been a loyal customer for over 8 yrs still no internet . It’s in review ! I’m not. Happy camper believe me !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MURIEL CAMPBELL",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T23:52:29.000Z",
          "Titre": "IT TOOK THREE TRIES TO FIX BUFFERING…",
          "Contenu": "IT TOOK THREE TRIES TO FIX BUFFERING PROBLEM.  EACH PERSON WAS VERY POLITE, ETC.  AND THOYGHT THEY HAD FIXED THE PROBLEM.  THE LAST TECH FIXED THE PROBLEM, BUT DIDN'T KNOW WHAT HE DID THAT FIXED IT.  HOPE IT DOES NOT HAPPEN AGAIN."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Lyn",
          "Nb_Reviews": 5,
          "Date": "2023-05-13T23:30:42.000Z",
          "Titre": "Satellite",
          "Contenu": "Because of where I'm located satellite is the only option. Consequently the price for wifi is  extremely high. This is subject to cloud coverage and bad weather."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Ferrando",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T23:24:24.000Z",
          "Titre": "HughesNet Review",
          "Contenu": "The service from HughesNet was actually good.  Why I cancelled was because the voice did not work very well in our area.  I called a couple of times to report the issue,  but they didn’t seem to resolve it.Also their internet speed was all over the place and seldom at 25 mps.   Starlink came around and I decided to go with them.John"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GARY MAGIE",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T14:24:17.000Z",
          "Titre": "Speeds are seldom as fast as…",
          "Contenu": "Speeds are seldom as fast as advertised. I’m glad it’s available but you must be patient when using."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue short",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T01:28:20.000Z",
          "Titre": "The little blue circle never stops…",
          "Contenu": "i have a problem trying to watch any movies or shows.”, a little blue ring comes on and just goes round and round on just about every thing i want to watch and i finally give up and never get it to work"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "nancy",
          "Nb_Reviews": 4,
          "Date": "2023-09-02T23:27:36.000Z",
          "Titre": "i cannot watch live events more than 20…",
          "Contenu": "i cannot watch live events more than 20 minutes before buffering interferes i have to wait till recorded wifi slow"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lorraine Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:28:37.000Z",
          "Titre": "Slow connection...to channels.",
          "Contenu": "Slow connection...to channels.First time trying a satellite 📡 Internet. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JCB",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T23:49:20.000Z",
          "Titre": "The people you sent were very nice",
          "Contenu": "The people you sent were very nice, but one left me with a hole in the wall, which he did sparkle. We live in a brick house.  Also, ended up costing way more than I expected. Didn’t know we were buying all the equipment up front($1,200). Also didn’t realize it was all ala cart. Thought I was getting just what was included in the package.? But it’s all good. On a farm, no one can hear you scream. Lol."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelley Cuevas",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T21:33:01.000Z",
          "Titre": "I like the fast speed with the initial…",
          "Contenu": "I like the fast speed with the initial hookup. I don't like it when periodically I have no internet access. Don't understand why."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "V. McLaurin",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T10:12:46.000Z",
          "Titre": "Customer service I experienced was…",
          "Contenu": "Customer service I experienced was excellent.  The young man was very helpful.  My concern is that the internet service is not as strong as I have experienced in the city.  I had hoped for a better/more powerful internet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARY HUNSINGER",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:38:02.000Z",
          "Titre": "this wasn't the installers fault  i…",
          "Contenu": "this wasn't the installers fault  i didn't know that a roku box works with the internet and the router has to face the roku box which is connected to the tv with a short cord      maybe the installers could ask if the csrs have roku or something else that needs the router"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia b Reinhardt",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:34:45.000Z",
          "Titre": "The representative helped me navigate…",
          "Contenu": "The representative helped me navigate the problem and it wasn't due to Hughes.net problems. Blame it on solar flares!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doc",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T23:42:04.000Z",
          "Titre": "The technician was great!",
          "Contenu": "The technician was great!!  However the internet service is slow, you have to wait for sites to come up when browsing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Crupi",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:56:46.000Z",
          "Titre": "I got the job done to correct my…satisfaction.",
          "Contenu": "I got the job done to correct my account.  The girl was quite helpful and pleasant, only issue I usually have is that when placing the call, the menus are not always the easiest to get through"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Soliday",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T18:42:08.000Z",
          "Titre": "Still have questions…",
          "Contenu": "You have a good product and the man who installed our service was very good.  However I am very concerned that I can't get accurate information about my usage.  I did a chat with customer service and I was not satisfied with their response.  I also still have some buffering on my TV."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "roni carl",
          "Nb_Reviews": 10,
          "Date": "2023-12-19T18:21:14.000Z",
          "Titre": "The guy I talked to was very…",
          "Contenu": "The guy I talked to was very helpful.resolved my problem..I found out why my data was going so fast.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WYNNE WALTERS",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:25:06.000Z",
          "Titre": "You resolved the issue promptly over…",
          "Contenu": "You resolved the issue promptly over the phone. Tech operations were polite and responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAVID HAGUE",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:22:03.000Z",
          "Titre": "They resolved my situation with a money…",
          "Contenu": "They resolved my situation with a money saving solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sara griffith",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T15:40:38.000Z",
          "Titre": "Might not have local channels been your doings but it…",
          "Contenu": "Might not have been your doings but it definitely was not my doings that for MONTHS WE could not watch our local channels and I think we should get a big discount on our bills for all those months"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JG in Nathrop, CO",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T03:39:07.000Z",
          "Titre": "HughesNet is my internet provider",
          "Contenu": "HughesNet became my internet provider when CenturyLink discontinued service in my area. They also have Voice service, not exactly a landline; and it has been a disappointment to me. Dropped calls and a dead line without dial tone. A new Phone adapter was sent out; so HughesNet is trying to make this new customer happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal Wacklerle",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T14:18:30.000Z",
          "Titre": "Cannot understand employees …",
          "Contenu": "Would have been 5 star but sometimes you cannot understand your employees even though you think they can speak English. I hang up and call back several times. Very frustrating!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 9,
          "Date": "2023-11-23T17:53:42.000Z",
          "Titre": "We’ve never had a problem with…",
          "Contenu": "We’ve never had a problem with connectivity or internet speed. And the service rep, Lee, is very helpful, efficient, & knowledgeable.  We live off-grid & very remote, so we realize how important getting in touch with technical assistance is.  Calling the customer service reps is the only negative; long wait time & assistants that are hard for us to understand. But we’re grateful that you provide a great internet service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Marinos",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:51:11.000Z",
          "Titre": "SERVICE CHANGES",
          "Contenu": "AFTER SELECTING THE CORRECT OPTIONS, THE REPRESENTATIVE WAS KIND AND PROFESSIONAL AND PERFORMED THE REQUIRED ACTIONS FOR OUR ACCOUNT."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Odom",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:30:24.000Z",
          "Titre": "The representative I spoke to was very…",
          "Contenu": "The representative I spoke to was very helpful.  The whole problem was HughesNet's fault.  I had updated my card information the month before and just assumed it would stay updated, but it did not.  HughesNet turned off my internet and I had a hard time getting it straightened out, but the representative helped me and was very nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T20:02:07.000Z",
          "Titre": "My Rep",
          "Contenu": "My Rep. was very professional, she listened to my concern and resolved the issue quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeanne Irwin",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T06:15:10.000Z",
          "Titre": "I got done what I needed to do DISPITE…",
          "Contenu": "I got done what I needed to do DISPITE having to talk to Filipinos and have to have them repeat Several time and slower so I could understand them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "W S.",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T20:49:20.000Z",
          "Titre": "In post part the Billing department…",
          "Contenu": "In post part the Billing department needs to understand that it was their modem and radio was going bad, and it was eating up my DATA.  I felt I should be reimbursed. and also some free tokens.  So I give them a 4.     As Our Tech, was A (10 Star ), deserves a raise, and very knowledgeable.  Smiled looked you in the eye and explained a lot. did call , and was on time. Also, his vehicle should be replaced, as windows don't work, and it was Raining hard."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn Knotts",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T05:01:44.000Z",
          "Titre": "Always cutting out",
          "Contenu": "Always cutting out. Losing Internet every couple days. Women on the phone was professional and courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail Reed",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:30:42.000Z",
          "Titre": "I requested a discount to help me…",
          "Contenu": "I requested a discount to help me through a rough patch .. the agent worked with a supervisor to offer me a 3-month discount .. thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T17:24:28.000Z",
          "Titre": "Helpful",
          "Contenu": "Helpful, respectful.  Only little issue is day or two late.  No big deal though.  I'm happy with everything.  Just not sure what I need to do to get 100.00 card.  Seems kinda difficult."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "valencia Jackson Mcmurtry",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T04:57:40.000Z",
          "Titre": "So far I've been happy with my service…",
          "Contenu": "So far I've been happy with my service only thing when the weather is bad the satellite knocks out the Wi-Fi"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "P.S. Kent",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:45:47.000Z",
          "Titre": "The computer end of it was awful; the person was very good",
          "Contenu": "The computer end of it was awful. Difficult to understand what I was doing to synchronize my new phone to the satellite internet. The password was an issue as the one on the box per the picture didn't work and neither did the password the original installer had replaced it with. But the service rep who helped me \"fix\" the problem was patient and professional and knowledgeable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RICHARD Harris",
          "Nb_Reviews": 3,
          "Date": "2023-11-05T13:18:12.000Z",
          "Titre": "The technician was very polite and…",
          "Contenu": "The technician was very polite and professional. He kept us informed and was very knowledgeable in his job. He acknowledged exactly what was wrong immediately and let us know that he had to order a part and when we can expect it to be in. He should be considered for a raise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NB",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T06:57:12.000Z",
          "Titre": "Technical support always tries to be helpful",
          "Contenu": "Technical support always tries to be helpful, but don't always understand what I am trying to communicate.  They are fixated on the amount of data I have remaining when speed was not my issue.  This is a continuing problem no matter who I talk to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cecelia Carr (wife of Arthur W Carr)",
          "Nb_Reviews": 8,
          "Date": "2023-11-25T00:38:18.000Z",
          "Titre": "Be More Understanding",
          "Contenu": "In all honesty I can not say my recent experience would rate a 5 star.  In the beginning the representative was not very kind or showed any empathy but seemed to be a bit condescending and this really upset me. I had been enduring my issue for a while, I’m an on-time, no payments missed kind of person and I just feel in the beginning I was not receiving the support, understanding I deserved as a loyal customer. Nevertheless, we finally got the issue dissolved with my paying MORE money for the service i really wanted. I don’t mind paying for what I want but I feel like if there’s a problem the representative should check their attitudes and make sure they’re being patient, kind and understanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Horinek",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T06:58:32.000Z",
          "Titre": "Personnel are pleasant and helpful",
          "Contenu": "Personnel are pleasant and helpful.  They are knowledgeable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose Sager",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T20:42:33.000Z",
          "Titre": "Internet down",
          "Contenu": "I think it would have been a good idea for Hughes Net to let their customers know that they would be switching to another satellite.  I understand that this did cause issues for customers.   I needed technical assistance to get my internet back up and running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betty Miller",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:52:39.000Z",
          "Titre": "Internet went out - May be back up in a couple of days.",
          "Contenu": "My internet went out and when I called, I was told that it was probably weather related and it would probably be back up in the next couple of days. Not a very good answer in my opinion. In researching to call a number to report, found out that the discount they was given in the beginning had expired and no other discounts were available. Not very happy since it was being charged to my credit card and I did not get a notification of the $20 a month increase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda  Loydg",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T01:45:51.000Z",
          "Titre": "I rely on Hugh’s net for my internet…",
          "Contenu": "I rely on Hugh’s net for my internet service, on a whole the service is good, even better than most in my area. The only draw back to it is that there is not enough high speed service, unless you buy extra tokens.  I no more than pay my monthly bill and 2 days later I get an email telling me I’m out of high speed usage and you slow down the service, I won’t pay for extra tokens, because I don’t think I should have to for the amount I charged monthly, so I put up with the slow speed, which gets exasperative!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BETTY THIES",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T19:03:32.000Z",
          "Titre": "When the installation  occurred",
          "Contenu": "When the installation  occurred, everything went very well.  But  the first installation appointment was totally missed without any notice to me!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mildred Diehl",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T17:23:10.000Z",
          "Titre": "I just wish I didn’t have to call in to…",
          "Contenu": "I just wish I didn’t have to call in to see about any special prices to keep my bill from always going up in cost-it seems to go up automatically anyway."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Harry",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T08:32:49.000Z",
          "Titre": "The person explained things in detail…",
          "Contenu": "The person explained things in detail the questions I asked. Very helpful & experienced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dale Williams",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T22:25:40.000Z",
          "Titre": "HughesNet was understanding when I…",
          "Contenu": "HughesNet was understanding when I needed it. My debit card number was stolen, so my account was frozen for a time, resulting in a missed payment. They extended the pay date  until my bank could issue a new dcard."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "anet",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T15:23:57.000Z",
          "Titre": "Having Hughes net allows me use my email.",
          "Contenu": "Having Hughes net allows me use my computer.  It is not strong enough to work from home.  Sometimes I lose the signal and that is unacceptable to clients."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Stanulewich",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:03:27.000Z",
          "Titre": "they fixed the problem on phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy Berkey",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T12:48:55.000Z",
          "Titre": "HughesNet over all is a good satellite…",
          "Contenu": "HughesNet over all is a good satellite service. There are times that the signal is very poor, even though there is only one device using the service. It's at those times I think about looking for another provider, but I do have flex ability with HughesNet to postpone service for 6 months when we are not using it since we only use the service for camping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EVA",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T01:34:01.000Z",
          "Titre": "I had Hughes service before and it was terrible. Now couldn't ask for any better.",
          "Contenu": "I had Hughes service before and it had a lot to be desired. Bad reception and customer and billing a few other things. Now, it's wonderful like a different company. I love my Hughes. I'm very impressed with Hughes at this point. They will be my Internet provider as long as things don't start getting crazy again. Thank You Hughes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sandy stead",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:16:11.000Z",
          "Titre": "Installation was great",
          "Contenu": "Installation was great Our tv buffers during shows - not good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAMES DOWNEY",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T21:49:19.000Z",
          "Titre": "Hughes Net served me well",
          "Contenu": "I live in the country where cable is not available. Hughes Net has provided reasonably good service for some years, especially after we got a new modem six or seven years ago. I am moving now to a senior living facility where cable service is available. I was pleased with a representative with home. I spoke today. Many thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sylvia Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:14:51.000Z",
          "Titre": "Needs improvement",
          "Contenu": "I didn’t like the fact that I had to threaten to cancel my service before the supervisor had to step in and walk me through online to keep my service. It’s still needs some attention somewhat. It’s better than the first 2 months"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "linda redmond",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T03:26:34.000Z",
          "Titre": "Keep up the good work.",
          "Contenu": "The representative was very helpful in giving me information which helped lower  my bill each month."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ian",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T14:49:11.000Z",
          "Titre": "HughesNet Rating Has Improved",
          "Contenu": "HughesNet treatment of its customers has improved since the competition from Starlink has forced it to do so. Also, the sale of data tokens at discount prices has improved the value for customers. HughesNet, in my opinion, therefore deserves an upgrade from a poor rating to a moderately good one"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tamara belcher",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T02:17:10.000Z",
          "Titre": "I have problems in the evening trying…",
          "Contenu": "I have problems in the evening trying to watch tv, and that is the only time we really watch it , their is a few time we watch in the morning or afternoon but not a lot"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim GoodlNd",
          "Nb_Reviews": 3,
          "Date": "2023-08-24T01:39:10.000Z",
          "Titre": "Hughesnet support solved my issue",
          "Contenu": "I have been a Hughesnet subscriber for years and have experienced some buffering while watching movies.  I ran an internet speed test and saw I was only getting 7 mps instead if the 15 I expected.   I called support and explained the issue, they upgraded me to a plan that provides faster speed at no extra cost.  I’m now getting speeds up to 35 mps and no buffering.  If they wouldn’t have made this available I was thinking of going over to Comcast which recently became available in my area.  I’m staying with Hughesnet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 5,
          "Date": "2023-11-13T19:15:09.000Z",
          "Titre": "when I call I get someone that cares",
          "Contenu": "when I call I get someone that cares!  I have been very lucky with my call ins in getting a great assistant.  Then maybe HughesNet has great attendants to do this. It is nice to get someone that cares and will go that extra mile in helping you.  Thank You HughesNet...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joni SHEPHERD",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T02:19:09.000Z",
          "Titre": "Great people. Stupid computers",
          "Contenu": "The person I talked to helped out I had so many questions.  He helped out. But he could NOT explain why your system keeps telling me to register my account. Which it isPeople are great. Computers are a pain. Hate them. And i already gave my review of this experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krystal Grady",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T20:36:59.000Z",
          "Titre": "I still need a little help",
          "Contenu": "What I like is that you ask my opinion, and my experience. I like that you gave clear instructions as to what to expect when the service man came to our house to install the satellite dish. Unfortunately, we sometimes turn on the device and find we do not have the Internet. So we have to re-program the device. Usually it comes on after that. Another puzzling thing, is that my desktop can get to the Internet by Microsoft Edge but not by Google. When I try to get into Google, it says I do not have Internet. I’m open to suggestions as to how to correct these two issues. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Scott",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T03:24:28.000Z",
          "Titre": "When i sign up for hughesnet was told…",
          "Contenu": "When i sign up for hughesnet was told that id never run out of GB just streaming that was a lie from the person i talk to. But when i call the tech the other night he got it start and put on new plan it higher then i want to pay but cheaper then DTV the tech was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHUCK & KATHY NICHOLS",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T22:13:46.000Z",
          "Titre": "Because of a change with my bank",
          "Contenu": "Because of a change with my bank, it was necessary for me to change my credit card information.  Though I had trouble trying to correct my information on the website, once I was able to speak to a human representative things went very smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "james wallen",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:09:09.000Z",
          "Titre": "questions asked answered right away"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Peeples",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T22:15:17.000Z",
          "Titre": "I am a new customer",
          "Contenu": "I am a new customer and I have experienced good internet service so far. There has been a few times that my service went to buffering shows. We only got this service for the internet. Time will tell. Actually I am waiting for the new satellite to come on board."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PATRICIA M.",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T14:28:13.000Z",
          "Titre": "I was happy to see my internet back up…",
          "Contenu": "I was happy to see my internet back up and running, I was about to leave hughesnet because I been having so much problems and it stays off more than I used it. So now I'm gonna see how long it's going to work this time. But overall  the technician was great and very aware of the problem, and very polite!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gerald harpt",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T23:28:49.000Z",
          "Titre": "I think that our reception is good and…",
          "Contenu": "I think that our reception is good and we just upped our coverage to 50 gigs. The reason I didn't give Hughes 5 stars is because of the man who installed Hughes. He never buried the cable that runs across the grass from our dish to the house. I called him about it and he acted like he didn't understand my concern. Ironically, he wasn't afraid to ask me for a tip when he was finished installing. I mentioned about the exposed wire to a gal from Hughes. She said that Hughes would come do it at a cost. I think the buried cable should have been part of the original installation. Other than the exposed wire, I would have given Hughes five stars. Gerald Harpt N3231 River Drive 49893"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Woodruff",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T14:18:04.000Z",
          "Titre": "I was informed about new updates to my…new offers updates and discounts.",
          "Contenu": "I was informed about new updates to my service that actually saved me money on my monthly bill and for once I didn’t feel I was being pressured into any commitment that I was not comfortable with!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NEIL MUSTOE",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T21:59:58.000Z",
          "Titre": "When I still have minutes of usage…",
          "Contenu": "When I still have minutes of usage during a month, Hughesnet is good.  During later in the month, their support stink.  I believe $99.99 per month should buy me enough usage minutes to get me thru the entire month.  I & my wife have become use to the degraded connectivity when we have heavy cloud cover.  We just wait a bit for the weather cell to pass on and our dish and your satalite get their signals back together."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Walker-Sykes",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T02:50:36.000Z",
          "Titre": "Internet access problems",
          "Contenu": "The problem I had was explained and handled expertly. I’m still having trouble accessing the the internet during prime time hours with the programming buffering and dropping programs when I do access them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RUSSELL L McMAHAN",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T01:00:05.000Z",
          "Titre": "Get unlimited plan",
          "Contenu": "The agent did a good job. I'm dissatisfied with the fact that I have to keep adding tokens to make my streaming smooth and uninterrupted. I'm paying $136.00 for 200 gigs. My suggestion is that you have an unlimited no buffering plan at a great price. Forget about the tokens plan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jill Leroux",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T18:50:59.000Z",
          "Titre": "HughesNet made access to govt.assistance easy",
          "Contenu": "I finally applied for the government assistance I thought I would be eligible for. This helps pay $30.00 of my internet bill each month. Hughes net made this process really easy for me and I appreciate that. I’m looking forward to a smaller bill this month."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T22:25:01.000Z",
          "Titre": "Transaction went well",
          "Contenu": "Transaction went well. Upgrade service by phone was great. What should have been a website upgrade was non-existent. Would have saved a lot of time using the website instead of having to wait for a HughesNet Agent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joyce Holdread",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T05:37:46.000Z",
          "Titre": "Beginning experience",
          "Contenu": "I have not had HughesNet service for long, but the sign-up and installation went well. The customer service reps. when I've called on questions, etc. have always been very helpful and friendly in regard to my issues as a senior. I really appreciate that!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marvin Zielinski",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:40:43.000Z",
          "Titre": "I’m in my 70s and not quite up to a…",
          "Contenu": "I’m in my 70s and not quite up to a computer age so I have a lot of trouble using the proper buttons as my fingers are too small without hitting more than just one button at a time I keep trying to use my iPad which is easier to get my finger on the right button But I end up using my phone because it’s easier to get to"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin J",
          "Nb_Reviews": 3,
          "Date": "2023-09-28T18:44:13.000Z",
          "Titre": "I am glad that you exist",
          "Contenu": "I am glad that you exist. Having said that we all need more bandwidth. I am a HEAVY user. I cannot criticize your business model. I just hope that it continues to grow. I am still exploring all of the things I can and can't do with your service. Data restrictions aside. I will be playing a game head to head tonight with my nephew. I hope thing go well. I noticed that you speeds can be choppy. I guess it is the nature of the beast. Still you are much better than Bright speed (more like a shot in the dark) has ever been so far. I am of course reserving judgement till I Have had time to further evaluate your service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KENNETH FISHER",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T10:29:34.000Z",
          "Titre": "Hughes Net Rural Service",
          "Contenu": "Hughes Net service has been realizable. Not many options available for rural areas. HN has maintained its presence to service the needs of the rural community where I live."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "shirley poland ?",
          "Nb_Reviews": 4,
          "Date": "2023-11-12T23:23:37.000Z",
          "Titre": "Up grade",
          "Contenu": "I haven't seen much faster on my cell phone, but it hasn't been that long either. So I will continue to watch and see what happens."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KM",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:33:50.000Z",
          "Titre": "Upgrade",
          "Contenu": "My request to upgrade to Fusion 100 was quick & easy, not as costly as I thought it would be for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ohmstede2ltd%",
          "Nb_Reviews": 6,
          "Date": "2023-12-11T18:33:10.000Z",
          "Titre": "they resolved my issue"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Engberg",
          "Nb_Reviews": 3,
          "Date": "2023-09-28T22:44:32.000Z",
          "Titre": "Didn't know I was outdated on Giga…",
          "Contenu": "Didn't know I was outdated on Giga bytes.  Y'all upgraded me to 50gb from 30gb and I am paying the same price.  I still feel however, internet service anywhere is a very high cost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T14:55:16.000Z",
          "Titre": "Great customer service and quick…",
          "Contenu": "Great customer service and quick solution to my data plan request. Data speeds are very slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHERYL Hertle",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T20:18:34.000Z",
          "Titre": "Very helpful and professional",
          "Contenu": "Very helpful and professional. The only thing is that when you have promotional adds. Your loyal customers should be able to get in on it. Not only new customers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janice Kozma",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T01:10:57.000Z",
          "Titre": "The person did a good job and solved my…",
          "Contenu": "The person did a good job and solved my problem. However, you are still asking to speak to my husband, whose name is STILL on the account even though he died 3 years ago. I would appreciate it if you would fix my account to show that he is no longer alive. Thanks, Janice Kozma"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "edward moore",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:56:12.000Z",
          "Titre": "Seems to be reliable and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T01:53:54.000Z",
          "Titre": "Order and install went great",
          "Contenu": "Order and install went great; my only concern is speed.  For example, I got \"your internet connection is unstable\" during an important Zoom meeting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "semetrica arrington",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T20:08:16.000Z",
          "Titre": "Didn’t like the dish by the front door",
          "Contenu": "Didn’t like the dish by the front door. Haven’t gotten my infusion box don’t know how to work it or if it will work.The fact of returning and waiting to get another box. I don’t know what address you are sending it to or if I will get it because I just moved"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becky B",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T19:14:00.000Z",
          "Titre": "much better than Marble Falls company",
          "Contenu": "HughesNet internet service is much better than the one that I had (from Marble Falls).  There are times that I lose connection but it comes back pretty soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ERNESTINE HOLLIMOM",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T23:17:27.000Z",
          "Titre": "food network",
          "Contenu": "to watch history channell and the company been good to fix my computer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave from rural NC",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T17:41:42.000Z",
          "Titre": "Improved service",
          "Contenu": "I. called to complain and was helped getting updated to a new plan with more data cap and less cost.  I gave them a 4 for improving their service 100% from what i was calling about.  The changes took effect immediately.  Good work!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melvin Hall",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T01:32:20.000Z",
          "Titre": "Fusion Upgrade",
          "Contenu": "With Fusion upgrade we are streaming with no to little delays. Loading circle is all but gone and buffering is not interrupting a movie."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trudi Pousson",
          "Nb_Reviews": 5,
          "Date": "2023-08-17T22:11:43.000Z",
          "Titre": "\"Bob\" was very helpful",
          "Contenu": "\"Bob\" was very helpful. My internet service is beyond slow after 6 pm, even after changing channels on the Dish and doubling our data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CATHY Priebe",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T16:27:19.000Z",
          "Titre": "Worked with me to honor my budget needs.",
          "Contenu": "Your customer service team work with my needs to help with my request. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "byron",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T16:40:37.000Z",
          "Titre": "Inexpensive slowdown prevention.",
          "Contenu": "Overuse causes slowdown, a very adult accommodation. Purchase of overflow tabs, also adult. And discount promotions make purchases cost effective."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARIA DOWNING",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T15:54:34.000Z",
          "Titre": "Was done very quick and the technician…",
          "Contenu": "Was done very quick and the technician was helpful in setting it on my devices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN BURKE",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T14:06:15.000Z",
          "Titre": "Customer Experience Response",
          "Contenu": "The process seemed to be smooth and the customer service rep was very helpful and professional. It has improved. I wish the pricing would."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael O’Keeffe",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T16:27:18.000Z",
          "Titre": "Not “great”",
          "Contenu": "Not “great”, per se, OK for the most part. Have trouble finding accessible sweet spots here on my property. For internet access & calls"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nanny",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T16:38:43.000Z",
          "Titre": "Can't c satellite.   Liking job makes a differencent.",
          "Contenu": "Your techniqution was nice. He simed happy doing his job therfor he went above and beyond 2 explain what he was doing and why.  2 me that is great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Clemons",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:35:47.000Z",
          "Titre": "they listened and appeared to be…",
          "Contenu": "they listened and appeared to be concerned"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Corbin",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T19:22:57.000Z",
          "Titre": "Quality employees dedicated to their job.",
          "Contenu": "The installer was on-time, professional and courteous. He answered all my question and completed the task in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Billie Przybylski",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T03:24:11.000Z",
          "Titre": "Slow internet",
          "Contenu": "Tech was efficient, knowledgeable and quick.  Problem answered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathleen Saelens",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T20:17:31.000Z",
          "Titre": "Billing department",
          "Contenu": "Austin, in your billing department,  was very helpful on updating my billing file."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-08-30T21:28:21.000Z",
          "Titre": "So far good for rural areas",
          "Contenu": "So far good for rural areas. I never received th100 dollar gift card I was promised but took it as sales gimmick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Blaschko",
          "Nb_Reviews": 7,
          "Date": "2023-08-25T02:06:02.000Z",
          "Titre": "Experience as a whole was great",
          "Contenu": "Experience as a whole was great. Your representative was able to help me in a short time and I received an answer to my question ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wanda O. Vaughan",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T02:06:45.000Z",
          "Titre": "The problem was disconnection",
          "Contenu": "I had a real time. The only problem I had for disconnection. I contacted November 2022 it was August 2023 before I was finally able to get it settled."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Skinner",
          "Nb_Reviews": 6,
          "Date": "2023-08-10T23:58:07.000Z",
          "Titre": "Affordable connectivity program",
          "Contenu": "The girl I talked to was aware of the program for Veterans and she applied it to my bill which made it much more affordable for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bebe Porterfield",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T22:32:01.000Z",
          "Titre": "A good choice for where I live",
          "Contenu": "HughesNet is a good choice for where I live way outside of town.  I think the price is fair.  There are some times of day (late afternoon) when the service is very slow, but most of the time it's okay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlene Maximenko",
          "Nb_Reviews": 6,
          "Date": "2023-09-27T07:15:52.000Z",
          "Titre": "I had two experiences with HughesNet…",
          "Contenu": "I had two experiences with HughesNet reps. Thefirst was a distaster, but the second was great and took care of my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "asid JOHNSON",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T22:52:14.000Z",
          "Titre": "must go  thru billing cycles, to insure double billing ism corrected, thanks",
          "Contenu": "was able to get corrective action, but took two days and several calls / chat-- to get corrective action-- double billing on my account"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kam yuk leung",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:50:49.000Z",
          "Titre": "I can see church program and YouTube"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dawn towe",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T00:30:26.000Z",
          "Titre": "the agent i talked to was very helpful…",
          "Contenu": "the agent i talked to was very helpful . the agent know what i was talking about and kbew what to do to help me with my problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurel Brandt",
          "Nb_Reviews": 5,
          "Date": "2023-11-21T04:33:39.000Z",
          "Titre": "Good customer service",
          "Contenu": "She was very helpful and explaining things to me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "paul",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T03:04:54.000Z",
          "Titre": "It’s a struggle to keep my internet up…",
          "Contenu": "It’s a struggle to keep my internet up with my phone and I don’t use it much at all"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DARREN MOUTON",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T03:06:37.000Z",
          "Titre": "Great installation service",
          "Contenu": "Install tech was on time and knowledgeable and connected everything as it should be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Bradshaw",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:45:19.000Z",
          "Titre": "Long time user",
          "Contenu": "The person that helped me was very nice although my internet doesn’t work any better than before. The only thing now is my payment is more. I’ve been a loyal customer for many years but can’t afford the plan that would make it where I could watch movies, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T05:16:08.000Z",
          "Titre": "Hughes Great Work**",
          "Contenu": "The main reason that I changed companies, was the internet was off line than it was on. Since I went with Hughes I have never been without the internet, Thanks from the old goldwinger49"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Parpart",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T17:32:22.000Z",
          "Titre": "I had a very nice person to talk to and…",
          "Contenu": "I had a very nice person to talk to and she helped me right away. I had never called before and she gave me all the information I needed and in a very friendly manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Posusta",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:43:27.000Z",
          "Titre": "Hughes Net has really great reception…",
          "Contenu": "Hughes Net has really great reception for rural areas. I rarely ever have any issue or need any assistance from customer service, but every time that I have called Hughes Net the customer service has been exceptional. They always help me with whatever my concern is, and resolve my issue completely, or as in my last call the woman who assisted me far exceeded my expectations. She not only helped me, but went above and beyond to give me the best possible customer service that I could ask for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nita Hamilton",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T08:00:43.000Z",
          "Titre": "Why did my device start slowing drastically?",
          "Contenu": "The technician finally asked me if I was running any new programs, and I thought...oh yes! A privacy protector that checks the site I'm at to be sure it's the true site. That must be it. And since she led me down the correct path, my speed on HughesNet is back to normal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Purdom",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:44:34.000Z",
          "Titre": "Just joined HughesNet",
          "Contenu": "Just joined. Pleased with cost of subscription, prompt installation, startup support, telephone support for questions. Internet speed improved, streaming adequate for us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen Chadwick",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T07:49:25.000Z",
          "Titre": "Installation was fast and profe…",
          "Contenu": "The installation was fast and the person who did the work was very professional and kind. He answered all the questions we had and the installation went smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Ernst",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:10:37.000Z",
          "Titre": "Hughes net always makes things right on…",
          "Contenu": "Hughes net always makes things right on all occasions. Whether it be service or billing without arguments"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vicki johnston",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:06:11.000Z",
          "Titre": "Courteous, patient and knowledgable assistance",
          "Contenu": "My experience with the person who helped me was great. She was so sweet and helpful. She is a great asset to your company.However, I wish Hughes were up to the standards, the consistency in the service, I was accustomed to in Texas before I moved here. I'm so weary of the turning wheel, stop,start, stop, start video playing in the evening. Neighbors have left Hughes because of experiencing the same thing. I assume too many people have been signed onto too little bandwidth. We are considering Starlink as an alternative. I hope this note reaches someone who can and will make improvements. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J.W.K.",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:41:00.000Z",
          "Titre": "I love support like this!",
          "Contenu": "The technician was kind and courteous, along with being patient. She figured out the problem and was able to fix it and get the system back on-line the first time she worked on it. I love support like this!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Gould",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:37:58.000Z",
          "Titre": "Your representative let me know about…",
          "Contenu": "Your representative let me know about the new programs are going on and I was very graceful so I changed some of the programs cause I usually don't do it and so that's all I want to find out about increasing my MG so I'll talk to you later.From twin towing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Devlin",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:00:26.000Z",
          "Titre": "The Rep was very helpful and provided…",
          "Contenu": "The Rep was very helpful and provided the service I requested. I live in a remote location (off grid) and HughesNet is very valuable to me. Thank-you for the service you provide."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Smith Bu",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:48:10.000Z",
          "Titre": "Hughes Net is the only internet…",
          "Contenu": "Hughes Net is the only internet provider in the rural area we're in. The service is somewhat expensive but provides quality service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reni Ballard",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:07:04.000Z",
          "Titre": "The representative was very helpful, language caused frustration.patient",
          "Contenu": "The representative was very patient, very friendly and solved my problem in a short period of time. I had a hard time understanding the rushed, \"run together\" type of language. It helps when you ask them to slow down, but for only a minute. Example: The \"rep\" kept repeating \"skittled.\" Finally asked him to spell it, he couldn't. It's a frustrating guessing game, but I finally realized the word was \"scheduled\" and we both laughed. Wish that could be better, but everything else worked out well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacquelene Cerquettini",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T06:10:37.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "My representative was kind and very friendly. Answered my questions thoroughly. She also double checked some things that were outside of the spectrum of the call. She helped me with trying to figure out the best plan that was available and offered me other resources that were also available. The call was clear and precise and I really liked her personality. You’ve done a great job with hiring this representative to represent your company. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra a Lyon",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:01:02.000Z",
          "Titre": "Service is very good",
          "Contenu": "Service is very good. Customer service is very good. There's straight to the point honest about pricing and pricing for tokens. A little expensive but where my husband and I live. When it's the only internet choices you pay for what you get sometimes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alden r Colby",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:52:19.000Z",
          "Titre": "Return 0f funds…",
          "Contenu": "The company representative told me over the phone That he was going to close out my account and refund my 315.50 within 24 hours. I check with my bank this morning and your company did what the representative said over the phone. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arturo Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T23:24:13.000Z",
          "Titre": "With the previous company I had issues…",
          "Contenu": "With the previous company I had issues about twice a month and so far I haven’t had any issues with Hughes Net."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Stanco",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:27:57.000Z",
          "Titre": "Great value",
          "Contenu": "Great value.  Salesperson did not explain everything.  No  mention of rebate, taxes being paid from my debit without my knowledge, data cycle as relates to billing, but she was very friendly.  Installer was awesome.  Very knowledgeable and efficient.  Answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irene Klepper",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T21:22:20.000Z",
          "Titre": "Professional",
          "Contenu": "HughesNet representative was very professional, patient, pleasant, polite, and articulate.  He resolved the issue without transferring me to another technician. I ended the conversation with a smile on my face.  Thank you HN for keeping good quality rep.  They are assets of the company.  Thank you kindly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly C C",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:39:35.000Z",
          "Titre": "Getting the job done.",
          "Contenu": "The agent understood the problem and knew what to do. The problem was corrected during the call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Authorize userHelene Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T03:04:00.000Z",
          "Titre": "The install went very well",
          "Contenu": "The install went very well. Fast and efficient. Was given a review of the router and what I needed to know and where I could find any other info if I needed it in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BOBBY JESSE",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:43:51.000Z",
          "Titre": "Its Not Great",
          "Contenu": "Its Not Great! I have more Data But My signal is still too weak to  go  fast anywhere! I dont have a good enough connection to stay in my card games. makes me lose cause I lose connection all the time. Everything runs way tooooooo slow!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Mchugh",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:42:04.000Z",
          "Titre": "Great sales ,excellent technician",
          "Contenu": "Great sales ,excellent technician, but I still haven't got my 100.00 gift card  the internet is very spotty and always blinking out . But every one i talk to have been great 👍 still would like my gift card"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NANCY VERBRUGGE",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T20:17:42.000Z",
          "Titre": "The girl helped me really fast to get…",
          "Contenu": "The girl helped me really fast to get my bill paid. My old credit card was expired so now I’m on track and I appreciate your service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kenny webb",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:25:14.000Z",
          "Titre": "A very good experience with HughesNet",
          "Contenu": "The representative knew what she was doing  too solve  the problem.The residences in customer service know what they are doing to fix a problem they are very good at it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kathy",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T14:35:33.000Z",
          "Titre": "The installer did a very good job",
          "Contenu": "The installer did a very good job. So far everything has been good . I really like how easy it is to check my account and usage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John C",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T18:27:15.000Z",
          "Titre": "Friendly helpful phone service",
          "Contenu": "The phone representative made the process of placing my account on hold seamless. Great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "glenda debondt",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:06:26.000Z",
          "Titre": "Finding the perfect level for your use.",
          "Contenu": "I found that I was using my 50 gb at a faster rate than anticipated and was not able to view everything that I wanted on-line, so I called Hughes Net and spoke to a representative and together we decided to increase my gb to the next higher level, 100 gb per month. So far things seem to be working out just fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dee mcdade",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:08:37.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! The installer that they contracted, Dillon, was informative, friendly and professional. The monthly cost for internet is 1/2 of what I was paying."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN C HALLOWELL",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:36:13.000Z",
          "Titre": "HughesNet Customer Service",
          "Contenu": "The customer service representative was quite knowledgeable and helpful. I was able to successfully achieve my goal while speaking to her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Groy",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T13:57:40.000Z",
          "Titre": "Seasonal suspension of service",
          "Contenu": "Was able to get to a person right away. She was very knowledgeable and worked quickly to resolve my issue. It was our first experience with suspending our service for a seasonal property. I hope the process to reactivate is just as easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T15:08:20.000Z",
          "Titre": "The ability to go the extra mile!",
          "Contenu": "The customer service rep responded to my request to explain any available discounts/credits that might bring my bill lower.  She did and I was appreciative..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cordelia Dickens",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T17:39:16.000Z",
          "Titre": "Taking time to listen and understand",
          "Contenu": "Taking time to listen and understand, what a person trying to ask even though not saying what to they're trying to say. Patience is definitely needed and thanks for your patience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Baby Satan",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:47:56.000Z",
          "Titre": "Luis Flores helped me and let my tell…",
          "Contenu": "Luis Flores helped me and let my tell you that man deserves a raise.  He was patient, helped my understand stuff I didn't get, helped make my service better and even talked disney with me. 10/10 super nice, hope if I need help again Luis is the one who answers, THANK YOU 😊."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RAY COPELAND",
          "Nb_Reviews": 7,
          "Date": "2023-12-03T23:43:40.000Z",
          "Titre": "When I changed from my old account in…",
          "Contenu": "When I changed from my old account in Oct. from Hughesnet and to my new account price cheaper with my Government funds from $91.00 down to $39.98 a month and a lot better service, because for the first 4 years I got good service, BUT for the last 3 years I was getting poor service, just one laptop I would be without internet half the time and I called them several times, but now I'm getting a lot better service, sometimes I lose internet for a few min. but then back on, but not very often."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda Butcher",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T02:02:37.000Z",
          "Titre": "That the agent was very helpful and…helpful and nice.",
          "Contenu": "That the agent was very helpful and nice and that the rebate form was easy to fill out and I love the service that you have its fast and affordable thanks so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kristine thomas",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T17:22:50.000Z",
          "Titre": "Everyone goes above what is expected",
          "Contenu": "Everyone goes above what is expected. They make you feel as if you've solved the problem effortlessly..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Washington",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T20:19:03.000Z",
          "Titre": "Christopher was great",
          "Contenu": "I thought I completed this already but Christopher was very knowledgeable and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:36:55.000Z",
          "Titre": "Very pleasant customer service agent",
          "Contenu": "Very pleasant customer service agent, fully understood why I called."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Turner",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:11:17.000Z",
          "Titre": "Understanding how they talk",
          "Contenu": "The man on the phone was very helpful and very nice.  I had called 3 other times they said didn't know how to fix it call back  one said 3 days next said 3 next said a week  when I finally called back I got that very nice man  he took his time and got it all taken care of"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID HONOLD",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:20:15.000Z",
          "Titre": "Had an issue",
          "Contenu": "Had an issue , agent contacted AFTER going through the automated system , issue was handled in a most timely and professional manner , WITH a live person .Add an option to the automated system to go DIRECTLY to someone , not all issues in in/on the automated system . All in all , great service . DPH"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "micheal siebe",
          "Nb_Reviews": 6,
          "Date": "2023-12-13T16:51:26.000Z",
          "Titre": "the representative was able to explain…",
          "Contenu": "the representative was able to explain what my billing concerns were and worked with me to get some relief."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:30:15.000Z",
          "Titre": "The person helping me his name was…",
          "Contenu": "The person helping me his name was Marcus from the he was from the Philippines"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Mathein",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T19:05:38.000Z",
          "Titre": "Both representatives were given",
          "Contenu": "Both representatives were great. The second person I spoke with fixed the mistake of the 1st. I asked for 50G. She put me on 200G accidentally. The second person was great. He put it on the right plan. Thank you. They were both totally helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Materne",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T17:09:25.000Z",
          "Titre": "Great internet service.",
          "Contenu": "Great customer service. Could not be better"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:53:17.000Z",
          "Titre": "Very Polite",
          "Contenu": "Very Polite , could understand her,,,, and she was very pleasant to talk to ... and she helped me with what I needed and more ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T13:52:05.000Z",
          "Titre": "The new modem you sent is not able to…",
          "Contenu": "The new modem you sent is not able to be set up by the home owner Must have app that only technician has. So then the $150 service fee. Not right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri V",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T22:26:53.000Z",
          "Titre": "Customer service has improved",
          "Contenu": "I have had a ton of difficulty in the past with hughesnet customer service.  My experiences this year, however, have been very positive.  Before, it seemed like every different person i spoke with had different ideas of how things should work and no one was communicating.  My problems recently have been solved easily and i really appreciate whatever you have done to improve your customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Usey",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:36:33.000Z",
          "Titre": "The person I spoke with was able to…",
          "Contenu": "The person I spoke with was able to answer my questions and was very concerned about resolving my issues.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Genier",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:50:47.000Z",
          "Titre": "The installer that came to the house…",
          "Contenu": "The installer that came to the house called to say he was on his way.   He was friendly, answered all questions we had.    He was efficient and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrell",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T01:59:53.000Z",
          "Titre": "Was easy and the agent was very helpful",
          "Contenu": "Was easy and the agent was knowledgeable and very helpful in getting me through the process and was very pleased with the outcome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GLADYS COPLEY",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:12:09.000Z",
          "Titre": "very helpful…. TERRI REID",
          "Contenu": "Your representative was very helpful and made my experience very easy.  I was very glad I had no problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SANDRA LOPEZ",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T03:46:28.000Z",
          "Titre": "The representative that helped me was…",
          "Contenu": "The representative that helped me was so knowledgeable and helped me apply for a discount as well as informed me of a lower rate for more GBs. I am very happy with this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald Lee Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:52:01.000Z",
          "Titre": "Your guy is the reason I’m staying and…",
          "Contenu": "Your guy is the reason I’m staying and trying to figure out my problems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl W",
          "Nb_Reviews": 9,
          "Date": "2023-12-15T14:54:31.000Z",
          "Titre": "Caring",
          "Contenu": "The gentalman that installed our service was very kind and helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Duke",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T22:43:13.000Z",
          "Titre": "Good customer service prompt and…",
          "Contenu": "Good customer service prompt and courteous technicians so far just a really good experience. The speed does leave a little to be desired but I we are recommend HughesNet to other people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KATARZYNA JURKOWSKA",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T13:26:08.000Z",
          "Titre": "Called regarding suspending my service…",
          "Contenu": "Called regarding suspending my service for the winter at  a seasonal cottage and it was taken care of efficiently with friendly clear speaking staff. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard a Blackaby jr",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T01:13:17.000Z",
          "Titre": "The person with whom I spoke with wasErick…",
          "Contenu": "The person with whom I spoke with was knowledgeable and quickly solved my problem. Problem was with my payment method and I chose go use another route."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Clark",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T15:08:40.000Z",
          "Titre": "Excellent service!!!",
          "Contenu": "Excellent service! I am soooo happy with HughesNet!!! 12/15/2023"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorinda Elardo",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:01:35.000Z",
          "Titre": "Easy to work with",
          "Contenu": "Easy to work with. Technician showed up on time, was professional and friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colleen D Sarnowski",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:56:54.000Z",
          "Titre": "clear voice we laughed at things said…",
          "Contenu": "clear voice we laughed at things said she was very pleasant to speak with the request was done well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL MILLIGAN",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:26:26.000Z",
          "Titre": "the ease of doing business with the…",
          "Contenu": "the ease of doing business with the tech's they get right to the problem when you have one and tell what to do and most of my problems were because I didn't understand how to fix what I did wrong in the first place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teresa Sisco",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T13:18:59.000Z",
          "Titre": "very helpful understood what i needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Edward Cosper",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T21:29:51.000Z",
          "Titre": "Your customer service rep had great…",
          "Contenu": "Your customer service rep had great people skills and she listen to my concerns"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Adams",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T19:27:31.000Z",
          "Titre": "Your agent was knowledgeable and solved…",
          "Contenu": "Your agent was knowledgeable and solved my issue is a short amount of time. give him a raise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassandra Dale",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:03:09.000Z",
          "Titre": "For the pass weeks",
          "Contenu": "I just had enjoyed my service for last pass weeks and I hope it continues being great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T14:38:27.000Z",
          "Titre": "Called to suspend my service till end…",
          "Contenu": "Called to suspend my service till end of March and that’s what Hughesnet did for us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawna",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:15:28.000Z",
          "Titre": "The rep helped me with my need to…",
          "Contenu": "The rep helped me with my need to extend my payment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Kessler",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T15:42:25.000Z",
          "Titre": "Never an issue with any loss of signal",
          "Contenu": "Never an issue with any loss of signal. Great customer  service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Hogan",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T21:39:45.000Z",
          "Titre": "Happy with service",
          "Contenu": "Happy with service , install was great , satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-12-12T23:17:17.000Z",
          "Titre": "Everyone was very helpful and took care…",
          "Contenu": "Everyone was very helpful and took care of my issue fast. I refer all my friends to you. I recommend you highly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CALVIN UMBARGER",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T00:48:43.000Z",
          "Titre": "i needed to update my payment…",
          "Contenu": "i needed to update my payment information. the receptionist was exceedingly helpful and guided me step by step through the update process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CAROLYN MEFFORD",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T18:39:27.000Z",
          "Titre": "the workers were nice",
          "Contenu": "the workers were nice, took care of everything did a great job and was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew K. Barnett",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T18:14:36.000Z",
          "Titre": "Quick easy access and proper…",
          "Contenu": "Quick easy access and proper responses.Good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CHERYL STONE",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:47:20.000Z",
          "Titre": "The person I talked to was very helpful…",
          "Contenu": "The person I talked to was very helpful in resolving my problem in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edwin Ferguson",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T04:32:19.000Z",
          "Titre": "I was helped and treated nice and with…",
          "Contenu": "I was helped and treated nice and with respect. The agent was very kind, courteous, and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn Jenner",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:49:04.000Z",
          "Titre": "Listening to my concern in finding a…",
          "Contenu": "Listening to my concern in finding a way to make me happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kippi Laster",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T09:14:52.000Z",
          "Titre": "Its great except the speeds of Internet…",
          "Contenu": "Its great except the speeds of Internet you guys need to do better because when it goes out that's it and some of us can't afford 10 or 15$ more for extra tokens but otber thab that y'all are great especially to wait on my payment as much as y'all do"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Grove",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T13:56:06.000Z",
          "Titre": "Well the installer did a great job…",
          "Contenu": "Well the installer did a great job putting it up where I wanted it.Works like a charm.Plus the $30.00 I get taken off sure do help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARGARET HILL",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:35:15.000Z",
          "Titre": "Our installation technician was very…",
          "Contenu": "Our installation technician was very personable, proficient, and respectful while in our home. He was very knowledgeable with regard to HughesNet and how you operate. Definitely would recommend you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAVID PUTNAM",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T04:39:04.000Z",
          "Titre": "The person I talked to was polite and informative.",
          "Contenu": "The person I talked to was polite and answered my questions and solved my problems in minimal time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "julie zoch",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:00:43.000Z",
          "Titre": "The rep who helped me,was knowledgeable…",
          "Contenu": "The rep who helped me,was knowledgeable on my concern snd helped me with it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Sweatman",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T01:34:01.000Z",
          "Titre": "THE COSTOMER SERVICE AGENT STACY WAS…",
          "Contenu": "THE COSTOMER SERVICE AGENT STACY WAS TRULY AWESOME TOOK CARE OF ME VERY WELL,THANKYOU,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:16:45.000Z",
          "Titre": "Always helpful when I need assistance…",
          "Contenu": "Always helpful when I need assistance with anything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcia Behnke",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:52:15.000Z",
          "Titre": "Fixed for now",
          "Contenu": "Fixed for now until it goes out again.  I wish the internet didn’t keep leaving me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Davis",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:27:47.000Z",
          "Titre": "WFI IssuesWhen I called about my WFI issues the…",
          "Contenu": "When I called about my WFI issues the person who helped me did a wonderful job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon Berryhill",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T20:14:46.000Z",
          "Titre": "Excellent",
          "Contenu": "They did their best to resolve my connectivity issues. In the end the issue resolved itself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GLENDA ADCOCK",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T19:58:42.000Z",
          "Titre": "Just the patience to help resolve"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CAROL BARRETT",
          "Nb_Reviews": 6,
          "Date": "2023-12-10T22:35:08.000Z",
          "Titre": "She solved my problem with getting the…",
          "Contenu": "She solved my problem with getting the internet back"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Iretta Crewse",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:35:51.000Z",
          "Titre": "He answered my question"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BOB MCFARLAND",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T14:20:57.000Z",
          "Titre": "The repairman fixed the problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suellen Mahanay",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T04:05:10.000Z",
          "Titre": "the rep talked me into another plan",
          "Contenu": "the rep talked me into another plan. My only complaint is that is extremely slow for 100.00 a month."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Castel",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:58:02.000Z",
          "Titre": "The lady was very helpful and courteous"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denis Pace",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:10:33.000Z",
          "Titre": "He took the time to explain what needed…",
          "Contenu": "He took the time to explain what needed to be done.  He seemed to know what he was doing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Valentine",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T17:53:08.000Z",
          "Titre": "Rep was helpful",
          "Contenu": "Rep was helpful, polite and knowledgable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T20:17:54.000Z",
          "Titre": "Rep was very helpful and kind and very…",
          "Contenu": "Rep was very helpful and kind and very patient.Help me resolve my issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Peoples",
          "Nb_Reviews": 4,
          "Date": "2023-12-09T23:49:12.000Z",
          "Titre": "Helped me attain the results I was…",
          "Contenu": "Helped me attain the results I was looking for. She was professional, knowledgeable, and respectful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Della Hardy",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T12:23:51.000Z",
          "Titre": "We're so patient in took time out to…",
          "Contenu": "We're so patient in took time out to answer all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lynne gerhardt",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T19:04:41.000Z",
          "Titre": "Very helpful customer service and…",
          "Contenu": "Very helpful customer service and willing to provide information on new products but no pressure"
        }
      ]
    }
  ]
}