{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "idshield.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T01:12:30.000Z",
          "Titre": "I thought you would help me with my…",
          "Contenu": "I thought you would help me with my Fraud charges on my credit cards - but you said that was the banks problem not yours"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teza Searcy",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T23:19:04.000Z",
          "Titre": "Lack of communication.",
          "Contenu": "Failed to let me know I needed to setup Alert in order to get alerts, yet IDShield process payments each month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T20:06:00.000Z",
          "Titre": "DON'T use ID Shield",
          "Contenu": "We chose to pay for the legal \"benefit\" through my husband's employer, and our 22 year old daughter needed to file bankruptcy, so she paid ID Shield $1400 and Jeff didn't even help her understand that loans with a cosigner won't be forgiven- they'll just become the sole responsibility of the other party. That loan was the ONLY reason she filed, and all Jeff can say is, \"uh, sorry.\" The paperwork asks about co-debters, but she didn't know what that meant, and he didn't walk her through it, or take the time to explain or describe anything to her. If a bankruptcy lawyer asks even ONE question, he/she should ask if the loan the client wants forgiven is in anyone else's name. That would have been a very simple question for her to answer. She said that he had her on the phone for 2 minutes and he was in a big hurry to get her off the phone. He was negligent. He does this every day. Our daughter doesn't. He screwed her over. And we later learned of another firm that charges a flat fee of $749. So, she was swindled out of an extra $650, her credit is ruined for 10 years, and the debt she needed forgiven wasn't. DON'T use these guys. They're incompetent jerks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dorothy Craft",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T17:32:27.000Z",
          "Titre": "Disappointed, No agent support",
          "Contenu": "Too vague! Don’t pay for something you can do for yourself! Go to each Credit Bureau site and sign up for FREE!I’m very disappointed with this Website,  navigation is so confusing, lacks flow and of course there’s no LIVE support to help on weekends. You don’t know that until you pay, even though they advertise 24/7 support multiple times. Waste of money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T03:17:42.000Z",
          "Titre": "I don't understand what happened to ID…",
          "Contenu": "I don't understand what happened to ID Shield.  I've been a member for several years now with and had no issues with them. They had a decent website and good service.  Now they updated their site and locked me out.  The Customer Service Rep I finally managed to get ahold of was abysmally unprepared to help me on what should be a very simple matter. Eventually, my case got forwarded on and I've apparently been forgotten altogether. Just about ready to cancel.  They've gone from Good to Horrible in under one year."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Vic",
          "Nb_Reviews": 2,
          "Date": "2022-08-15T22:59:09.000Z",
          "Titre": "ID Shield is a piece of junk",
          "Contenu": "ID Shield is a piece of junk. We signed up last month. Their website is glitchy, the links don't work. I've tried ID Shield customer support and got varied responses. My Safari and Google browsers are up to date, history, cache and cookies cleared and still the same garbage. I've spent numerous hours on the phone with them. Calling customer support is a waste of time. The most valuable piece of information I received is to go to (my dot lsengage dot com forward slash technicalsupport) and enter information along with screen shots. I can't believe the response is to use the phone when all their IT people have to do is fix their links."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Not My Real Name",
          "Nb_Reviews": 2,
          "Date": "2021-05-28T15:50:56.000Z",
          "Titre": "Incompetent service",
          "Contenu": "Incompetent service - Cannot even do a simple thing as reset a passwordI tried to reset my password and never got the link. So I called customer service who still could not reset the password and had to open an IT ticket for response within 3 business days. And the customer service guy on the call was on hangover. Seriously? And these guys are protecting from identity theft?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Steele",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T21:35:48.000Z",
          "Titre": "they failed to notify us or protect us…",
          "Contenu": "they failed to notify us or protect us when both my husband and my social security and iD was used to open fraudelent accounts and damaged our credit.  very disappointed in their service.  we cancelled.  they had 17 months to notify us and they are not a good service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ichibangeebo",
          "Nb_Reviews": 4,
          "Date": "2022-01-04T22:01:23.000Z",
          "Titre": "Slimy Operators",
          "Contenu": "The service is very basic.  The subscription was originally given to me free for two years from a company that suffered a security breach, then I decided to pay for the service.  Over the years I subscribed, it never revealed any information I didn't already know.  Customer service is AWFUL.  I am writing this as I try to cancel the service.  Initial rep had to transfer me \"over there\" to cancel service, and I was on hold for 16 minutes, 54 seconds, then told \"they\" were busy, and I could call back, or get an email address to submit for cancellation.  Sound like how you want to spend your time?  As another reviewer said, what legitimate company makes you jump through a bunch of hoops to cancel?  Automobile service contracts come to mind.  Slimy operators.  No value.  Would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Williams",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T14:54:56.000Z",
          "Titre": "Because I have never been able use it…",
          "Contenu": "Because I have never been able use it since I signed up with you guys. I wrote you and all the credit company a note saying someone is using my information and I got nothing back from anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kate Meyer",
          "Nb_Reviews": 2,
          "Date": "2022-05-09T20:49:54.000Z",
          "Titre": "Duplicate SSN Not A Concern",
          "Contenu": "I thought I had a duplicate social security number because pulls on my credit were returning two separate identities. The issue was preventing me from opening bank accounts, applying for credit cards, etc.ID Shield was unable to help me or discover the cause of the problem (I did reach out to support). Through *extensive* work on my end I discovered that a company in California had a typo in the SSN of one of their employees' 401K accounts, and Fidelity was able to resolve the issue internally."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lou",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T23:25:58.000Z",
          "Titre": "Very disappointed!",
          "Contenu": "I signed up with id shield a few days ago.  The sales person said I would receive a welcome email the next day.  When I  didn't receive it I  called back and found that the person had my email address wrong.  I got it corrected.  I was again told I would receive a welcome email.  That didnt show up.  I also asked for a call back and that didnt happen.  Hmmmmm.  So....I  called back.  I was out on hold.  That lasted 20 minutes.  THEY DISCONNECTED ME!!!!  I gave one star and that was ONLY because that was the lowest you could leave."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "william oldham",
          "Nb_Reviews": 1,
          "Date": "2020-05-16T18:08:41.000Z",
          "Titre": "you site is difficult fix it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Ojeda",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T15:36:48.000Z",
          "Titre": "This is not what I was looking for.",
          "Contenu": "This is not what I was looking for. They said it was a 30 day free trial then I was charged immediately. In order to cancel you must email them with the word cancel and your member number. Very disappointed. The app is very basic and basically gives you free information you can already find online. The agent on the phone said if I want to check my credit score to go somewhere else like freecreditreport.com. Why would I go somewhere else when I am trying to pay for Fico scoring."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Irma M Benavente",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:54:37.000Z",
          "Titre": "I am not able to log in",
          "Contenu": "I am not able to log in. System tells me that I am NOT A MEMBER.  I have paid two months??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Doe",
          "Nb_Reviews": 6,
          "Date": "2023-08-15T13:46:22.000Z",
          "Titre": "Starting two weeks ago",
          "Contenu": "Starting two weeks ago, your people could have told me what I needed to know, but instead did not.  This cost me 5 phone calls and two hours yesterday for no reason.  Your people stink.  My biggest problem nowadays is I just people would do their JOBS!  There was no reason for wasting my time yesterday."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T16:24:42.000Z",
          "Titre": "I usually do not like to complain but…",
          "Contenu": "I usually do not like to complain but this needs improvement now if they care about consumers' reports! Recently, I found so much spam, calls, texts, and emails and was wondering what /why not my ID shield is doing for me? I call them, It appears I have an old number card and the number changed without letting me know, they changed after partner separation. I do not receive any alert or email anymore and my account does not exist, I have to create a new one and provide again all security info again, but I have back payments on my statement every month since 2013. . They called me only when my card expired to take a monthly payment. Customer support was unable to connect me to a \"higher authority\" Manager to answer my questions about what I am paying for what is their promise to comply.? What kind of protection do I have if they do not update my personal information,  keep me informed, alert me, and what would happen If I had ID theft, they could not find me in the system? I really hope that they will do something about it and comply with what they promised to provide safe and reliable protection so my money is worthed from 2013,  paying faithfully to them. If something is not right say it, and be e careful,   Please do the right thing always! Promised must be kept."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T23:29:18.000Z",
          "Titre": "I got hacked 3 times in the last month"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Billie Jones",
          "Nb_Reviews": 2,
          "Date": "2023-04-14T22:07:15.000Z",
          "Titre": "Not sure if better than lifelock",
          "Contenu": "Was a little shocked that when I called to check on an alert that I received that the agent (April) did not see any of the data breeches that Credit Karma had notified me about.  She said the only thing she saw was late payments and over my limit alerts. She was very professionally and pleasant but could not explain why those items were not showing and advised me to order a copy of my credit reports and look them over and if I saw anything abnormal to call back for them to investigate. I had switched from lifelock to ID shield because I thought it might be better but I may have been wrong."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Geraldine Vega",
          "Nb_Reviews": 4,
          "Date": "2023-02-14T18:20:44.000Z",
          "Titre": "I do  no like they helped to protect my…",
          "Contenu": "I do  no like they helped to protect my social security number but I don’t like that they aren’t part of Facebook or Instagram. It’s hard to get that fixed because scammers go through this and can get social security information and stealing your money through banks or anything. Thanks, anyway."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MICHELE PETERS",
          "Nb_Reviews": 1,
          "Date": "2020-11-01T14:40:45.000Z",
          "Titre": "THANK YOU AGAIN EVEN FOR BEING DESCENT…",
          "Contenu": "THANK YOU AGAIN EVEN FOR BEING DESCENT DURING THE COVID 19 PANDEMIC. MY BIGGEST PROBLEM IS THE PRIVATE SECTOR AS MAYBE THE FDLE.COM HAS IT LISTED. AND TRYING TO DEAL WITH STATE TRIBE AND LOCAL VOTES OR CONSTITUENCY OR SOCIAL MEDIA FOLLOWING..EVEN FACEBOOK TO BE EXACT. I AM LIVING HERE IN A PRIVATE GATED HOUSING DEV...I WAS ASSAULTED INSIDE HERE. IT IS GOLF TENNIS DINING. AMENITIES, ON CAMPUS AND GOLF STORE., CC BRAND REP.; CROWN COLONY GOLF  & COUNTRY CLUB. IN A US MILITARY CITY; LEE COUNTY (FORT MYERS FLORIDA0 I HAVE NO IDEA WHERE I WAS DRIVING TOO YEARS AGO DURING THE IRAQ WAR. I NEEDED HELP...COULD NOT DIFFERENTIATE THE TV MEDIA ADDS FOR LIKE ID PROTECTION EVEN FOOD ANYMORE..IT BECAME HARSH AND LIKE ON INTERCOM CYBER STALKING SO TO SPEAK OR COVERT/ OVERT BRASH, NEGLECTFUL AND ABUSIVE. I HAVE NO ROTC AND NO ADULT MILITARY OR EVEN BOOT CAMP LIKE TRAINING. I RELY AND STILL DID HOPING TO GAIN SOME TIME TO START WATCHING TV AFTER OR DOING THE TV MEGA CHURCH ERA OF MARILYN HICKEY AND JOYCE MYERS, AS STRONG WOMEN ROLE MODELS WAS A FARCE. WHY ME."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Madge Becker",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T23:34:35.514Z",
          "Titre": "Nothing Works",
          "Contenu": "Everytime I try something it does not work. Just tried getting my credit reports and had issues with trying to get Equifax. Not even sure if my other 2 went through. Disappointed as I was hoping this would be easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bettie",
          "Nb_Reviews": 2,
          "Date": "2020-05-24T19:42:33.000Z",
          "Titre": "I have been a member of  IDShield for…",
          "Contenu": "I have been a member of  IDShield for the last 5 years. I really appreciate the end of month summary of monitoring activities. The Push Out  alerts are valuable for me to stay abreast of any changes that have occurred with my account. Would not be with out it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "stephanie bell",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T09:34:54.000Z",
          "Titre": "I just completed the payment and…",
          "Contenu": "I just completed the payment and account information. I have not received the email with my account info etc."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T00:35:16.000Z",
          "Titre": "This incident has been enlightening to…",
          "Contenu": "This incident has been enlightening to me as it has left me wondering how often this might have happened to me or my family in the past and not been aware of it. It also has given me peace of mind that should it happen in the future it will be brought to my attention"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dianne P",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T23:19:41.000Z",
          "Titre": "6 emails identifying problems",
          "Contenu": "It notified me with 6 emails, and a number to find out the details, and advised corrective action to undertake to resolve the issue.This is the 1st time I received a notification fro IDShield of a problem.Thank you so very muchDianne P"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerAlbert C Burns",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T23:56:36.000Z",
          "Titre": "helpfull employees but disapointrd in…",
          "Contenu": "helpfull employees but disapointrd in attonery involvment. very unhelpfull"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathryn Ervin",
          "Nb_Reviews": 4,
          "Date": "2023-08-15T10:53:36.000Z",
          "Titre": "Being able to talk to someone why can…get issue take care of with one call",
          "Contenu": "Being able to talk to someone why can always answer your question"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KY in NE",
          "Nb_Reviews": 10,
          "Date": "2021-12-02T17:55:41.000Z",
          "Titre": "Undecided",
          "Contenu": "Edit on 12/2/2021:A member of the IDShield team called us this morning to apologize for our previous experience and provide advice and assistance for our current situation. I don't know what happened before but Tommy took good care of us today. Original Review on 11/29/2021:My husband's social security number was stolen and used to open a PayPal account and charge $5000. IDShield told us to dispute it with the collection agency. They could not have cared less. We do NOT have access to \"certified and Licensed Private Investigators for consultation and full restoration services\" as promised."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea Harrison",
          "Nb_Reviews": 4,
          "Date": "2023-08-28T23:43:13.000Z",
          "Titre": "Although ID Shield is limited with how they can help in terms of social media hacking, they do an excellent job will providing tips with how to avoid a future incident.",
          "Contenu": "Although ID Shield"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Odamise Tanelus",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T00:45:21.000Z",
          "Titre": "It’s  important for everyone who…",
          "Contenu": "It’s very important for everyone who knows the value of the product and everything it’s covered for a lil amount of money I just love our products and recommend to all my family and friends in the world"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roosevelt Weems",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T13:56:51.000Z",
          "Titre": "I never use this yet this app it'll be…",
          "Contenu": "I never use this yet this app it'll be my first time using it so I can't really say much about it until I experience it but I believe it's to be a good app you can help me through my security system and protect my phone better and I think this company for the great job that you're doing and it's truly appreciated. Sincerely Roosevelt"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. WALDRON",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T03:19:23.000Z",
          "Titre": "The person I talked to was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAMES KELTY",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T20:28:04.000Z",
          "Titre": "The name ID shield is confusing and not…& no Norton",
          "Contenu": "The name ID shield is confusing and not the one advertised. Registration is easy but not offered Norton which I wanted too."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 5,
          "Date": "2023-05-17T02:24:20.000Z",
          "Titre": "You listened and took action fast"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodd Wheeler",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T15:49:39.000Z",
          "Titre": "Thank you for being there for all of us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Hardin",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:41:41.000Z",
          "Titre": "The IDShield investigator was very helpful and knowledgeable.  …",
          "Contenu": "The IDShield investigator was very helpful and knowledgeable.  She gave me good guidance on what to do to solve my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valrie White",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:24:26.000Z",
          "Titre": "I was impressed the Representative’s Help",
          "Contenu": "I was impressed with how the representative, Tony Hodges, kept in touch with me while I had questions.  He even came over to my house to see if I had set things up correctly.  He then called the main office and helped me ask the questions I needed to ask concerning the takeover of my Facebook takeover.  He was extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keighley",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T14:11:23.000Z",
          "Titre": "Fabulous customer service!",
          "Contenu": "The employees that I had the pleasure to talk to during the times I have called were helpful and patient. They were understanding. They took the time to walk me through everything and answered all my questions regardless of how silly they may have been. I feel more confident about my family and their safety. I know we are protected and IDShield is only a call away. I would recommend their services to everyone! They really do make a difference"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T-B",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T16:44:03.000Z",
          "Titre": "They answered questions about my credit.",
          "Contenu": "They answered questions about my credit report and explained how even when you are doing everything right, your score can go down. such as emergencies with unusual spending during that time and two credit cards changing banks, which closes two accounts and opens two new accounts, all with in a couple of months has a big impact. Even when you pay everything in full. They helped give me piece of mind and walked me through on checking things and were very patient with me."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chris A.",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T17:26:01.000Z",
          "Titre": "What I love about this program",
          "Contenu": "What I love about this program is how fast I was notified that my passport had been compromised and was located in five areas of the dark web.  It told me when it was compromised, where and by who.  I would never have known until likely too late."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Reaux",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T16:35:24.000Z",
          "Titre": "FRAUD AND ID THEFT IS ON THE RISE …",
          "Contenu": "FRAUD IS ON THE RISE AND ID THEFT IS ON THE RISE. WITHOUT I.D. SHIELD AND OTHER MONITORING SERVICIES WE'RE EXPOSED TO A WORLD OF THEFT. THRY DO A REMARKABLE JOB MONITORING AND NOTIFING TO PROTECT MY FAMILY AND MY BUSINESS."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Sharon",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T01:42:43.000Z",
          "Titre": "A job well done.",
          "Contenu": "The issue notification arrived properly.  I called in and was not kept on hold or sent around the IVR for too long.The representative was polite, knowledgeable and helpful.  She knew exactly what to do and accomplished the tasks quickly and efficiently.   The whole process could have been a nightmare but instead was a non-event."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ravi",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T00:31:17.000Z",
          "Titre": "Legal and ID shield is valuable",
          "Contenu": "We signed up for legal/ID shield a few years ago when IRS contacted us to say that someone had tried to file our tax return. Since then, we have always been notified if our email ids or other details have been found in the dark web. We immediately change our passwords. We do feel more secure with legal/ID shield."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Allen",
          "Nb_Reviews": 4,
          "Date": "2020-05-16T20:15:53.000Z",
          "Titre": "IDShield has saved me countless times.",
          "Contenu": "IDShield has saved me countless times.They watch everything that counts. I've gotten notices about problem issues that needed attention with my email account, my social media, even my home address. And naturally, several times regarding things that appeared on my credit report. Very powerful protection at a great cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 2,
          "Date": "2020-05-18T06:36:51.000Z",
          "Titre": "Most comprehensive protection for less money..",
          "Contenu": "Most people don't understand what identity theft is nowadays nor what is adequate protection..  IDShield offers the most comprehensive protection on the market because thieves don't want your money anymore, they want your IDENTITY to commit crimes because your ID is a fountain of money.Thieves are getting smarter and banks and your credit report won't catch 80+% of what ID theft is nowadays.. Do you care about your family, your good name, and want peace of mind? Then this is a no brainer. Better value, more protection, lower price..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T20:12:08.000Z",
          "Titre": "This is my story",
          "Contenu": "This is my story. ID Shield contacted me to let me know that someone had opened up two credit cards in my name, having caught this activity as fast as they did, and helping me through all fraud paperwork, I was able to stop this crime very fast. Without ID Shield my credit would be all but gone by now. There team of employees are wonderful to work with, they are very knowledgeable, and very helpful in getting my issue resolved in a very timely fashion."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael from Atlanta, GA",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T15:57:56.000Z",
          "Titre": "Teen daughters and IDShield",
          "Contenu": "I love the IDShield app, I appreciate receiving alerts when there is activity.  I entered my personal information, and had my covered family members do the same. IDShield is monitoring it for me. We have teenage daughters and one of many benefits, is the social media monitoring.  This makes me feel good knowing we have a \"watch dog\" looking over their shoulders making sure everything is okay.  That's peace of mind for a parent. Thank you IDShield, we are members for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheryl Powers",
          "Nb_Reviews": 2,
          "Date": "2017-09-15T22:16:06.000Z",
          "Titre": "most user-friendly service we've had …",
          "Contenu": "most user-friendly service we've had with everything through the tap of an app, live people to help us and LOVE LOVE having the full restoration by licensed fraud investigators at KROLL.  We don't have to worry OR pay for anything more than our ID coverage service.  Signed - Resting Easy...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DIANE GRAY",
          "Nb_Reviews": 5,
          "Date": "2022-11-25T02:04:53.000Z",
          "Titre": "ID Shield is on the Job!",
          "Contenu": "I was notified by ID Shield that our email address had been compromised and some of our information was found on the Dark Web. I called the ID Shield phone number and spoke with a representative who was very helpful. She explained how this matter was discovered and what actions we should take to protect ourselves.The guidance was very helpful and I am so glad that we have ID Shield to guide us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Rushing",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T04:22:17.000Z",
          "Titre": "Stolen Wallet",
          "Contenu": "I contacted I.D. Shield on November 17th immediately after wallet was stolen. My representative I spoke with was extremely helpful and reassured me all that she was going to do to help make sure the right things were done to protect my identity and my accounts.  I was very thankful that I had this service and was able to quickly talk to a real person rather than a never ending automated service.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard C",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T01:45:00.000Z",
          "Titre": "I have had IDShield for over 16 years…",
          "Contenu": "I have had IDShield for over 16 years and they have always been responsive when I had questions and concerns. I trust them and their ability to protect my identity information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CUSTOMER",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T22:35:22.000Z",
          "Titre": "Stolen Identity",
          "Contenu": "My Identity was stolen to buy a trailer that cost over $10k, I was confused and didn't know where to turn or how to fix the mess it created on my credit report. I certainly didn't buy the trailer and wasn't going to pay a nickel toward the debt. I initially reached out to law firms for help. No one wanted to help me and told me I can fix all of this alone.My HR Rep told me about ID Shield. It is worth every single penny regarding the monthly fee. The agent that handled my case, Tommy Long, made the entire process about as easy and painless as can be. Believe me there were tons of hurdles and and additional paperwork. Tommy is still available to email with a quick response regarding anything including dumb questions and piece of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Jodoin Maher",
          "Nb_Reviews": 3,
          "Date": "2020-07-12T17:08:50.000Z",
          "Titre": "Protects like nothing else.",
          "Contenu": "Protects like nothing else.I was sitting in the finance office when buying my daughters car and got an alert before we were even done. The finance guy was so impressed he asked about the service and how he and his wife could sign up.  Love the app, and the quick response time when you call in for advice or help.  The free consultation is Unlimited which is Unreal. The folks at IDShield are professional, knowledgeable and so nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Blum",
          "Nb_Reviews": 2,
          "Date": "2020-06-25T17:39:32.000Z",
          "Titre": "Data Monitoring",
          "Contenu": "I have been enrolled in IdShield for about 7 years. They have over 30 pieces of my personal information, including social security #, driver's license, medical id, credit card and banking info, and my social media accounts. They alert me if they see my id's in places where they do not belong, or send me a monthly email that all is well. I went ahead and purchased the service for my two children. I figure that it is just a matter of time before we are all compromised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:25:02.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "The Customer Service Representative was knowledgeable, professional and friendly.  They were able to answer my question in a timely manner, which is very important to me.  If I could give him more stars I would!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "pat",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T13:28:17.000Z",
          "Titre": "I received an alert from ID Shield and…",
          "Contenu": "I received an alert from ID Shield and I was very concerned, panicked.  I contacted the company immediately. They responded (Live) immediately.  The representative took the time necessary to explain the alert, in that it was minor and I was not in danger.  He further helped me to understand the different levels of reports which I was calmed and the panic gone.  In addition, he explained the many ways I can be pro active in protecting myself as well.  I feel completely safe and confident in the ID Shield Service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Redondo",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T02:40:04.000Z",
          "Titre": "My entire family is a member 10+ years A+++",
          "Contenu": "My entire family has been members for almost 15 years. We are all very satisfied and happy with the customer service and the quality of the product. WORTH EVERY SINGLE PENNY AND THEN SOME.The more you learn to utilize these memberships (ID SHIELD and LegalShield) the more you will remember how wise of an investment in yourself and your family it was.A+++ and getting better all the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla Urtz",
          "Nb_Reviews": 1,
          "Date": "2020-08-07T16:14:16.000Z",
          "Titre": "Fraudulent Account Opening",
          "Contenu": "My husband's ID was stolen through the hacking of a company with whom he used to have a credit card. The hackers opened an account in his name. We got an IDShied notification immediately allowing us to contact the company within hours of the open and before any damage was done. The hack occurred through no fault of our own but IDShield has given us the option to be proactive in our credit health."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Smith",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T03:46:10.000Z",
          "Titre": "Document Search/Needle-in-a-Haystack!",
          "Contenu": "I was totally frustrated by the docs required for me to prove \"my identity\" so I can get a passport or Real ID!  Because I was adopted by my stepdad, two marriages & divorces, going back to my maiden name in between, the task was daunting!  Finally, remembered to call IDShield to seek help!  Shawna was great & sent links to portals to aid in my search!!! Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefania Langle",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T21:03:51.000Z",
          "Titre": "I am glad that my accounts are…",
          "Contenu": "I am glad that my accounts are monitored. Also phone support is very helpful. Recently I received advise to freeze my credit reports."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Hubbard",
          "Nb_Reviews": 2,
          "Date": "2020-06-27T17:58:37.000Z",
          "Titre": "ID Shield's app provides peace of mind",
          "Contenu": "ID Shield's app alerted me that our son's credit bureau was being accessed. The problem was that our son was only 14 and didn't have a credit bureau. We called the service and they advised us to lock down his social security number which we did. This service gives us peace of mind because they have our family's back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Aleman",
          "Nb_Reviews": 5,
          "Date": "2022-11-23T22:23:41.000Z",
          "Titre": "The power of ID Shield",
          "Contenu": "My experience was excellent my Investigator called a source that tried to collect $88 that they claimed was medical. They reported this as a major derogatory rating on my credit report. We called the Law firm, they realize their error and advise to not be concern. I want to thank ID Shield for assisting me with this matter. The empowerment of ID Shield is needed i encourage those that wonder if its worth having ID Shield is worth having to just get it for the peace and Mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Hester",
          "Nb_Reviews": 2,
          "Date": "2020-07-23T16:39:46.000Z",
          "Titre": "My wife received a collection call demanding...",
          "Contenu": "My wife received a demand call from a major credit card provider (rhymes with symphony) demanding payment for a $1,500 series of charges via PayPal for electronic equipment.  Since she does not have accounts with either we called IDShield and provided them with the information.  After over 45 days and various phone calls and documents provided to the credit bureaus, her account is cleared and accounts with those entities are closed!  All at no cost or worry from us!  They did the work and all she did was provide some basic documentation to support her position!  And we had 1 professional at IDShield to deal with on each contact!  Thank you, IDShield!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elsie Smoluk",
          "Nb_Reviews": 3,
          "Date": "2020-05-16T19:51:42.000Z",
          "Titre": "Data Base Breaches",
          "Contenu": "My husband and I had our personal information compromised through a breach of the SC Dept of Revenue. As a result, there were fraudulent tax returns filed in each of our names. I immediately called IDShield and was advised how to proceed with the IRS. There have been no consequences to us as a result.  And currently an investigator is working on two fraudulent credit cards established in my husband's name.  We became aware of them because of the alert sent to us by IDShield as soon as the accounts were opened."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RimaSue Lumley",
          "Nb_Reviews": 3,
          "Date": "2022-12-15T22:14:07.000Z",
          "Titre": "Legal Shield has always had my back",
          "Contenu": "Legal Shield has always had my back.  It is a relief for me to know that I have an attorney available to me for legal matters such as speeding tickets, even if they are out of state. This time, I got a toll violation in NJ where I was traveling for work, even though I had the proper EZpass.  My attorney communicated quickly and clearly with me, and took care of everything so I didn't have to!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Pearish",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T00:02:46.000Z",
          "Titre": "Excellent monitoring services",
          "Contenu": "They provide excellent monitoring, better than any free monitoring service. If I have an issue, they are supposed to fully restore my credit. I hope I never have to use those services. But having everything from 1 company helps me sleep better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2020-06-14T22:58:41.000Z",
          "Titre": "We recently moved to a new state and we…",
          "Contenu": "We recently moved to a new state and we received about 6 notices because of credit checks. One of the notices was suspect, and came from the dark web. Thanks to IDShield we were notified of the issue and able to talk with a security expert about what to do regarding the notification. IDS provides my wife and I continued peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T02:10:59.000Z",
          "Titre": "Protect your identity",
          "Contenu": "The staff's knowledge about the Dark Web. She explained why it happens and how to better protect my identity. Having IDshield protection is better than no protection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey Muhammad",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T17:26:50.000Z",
          "Titre": "My info exposed on the dark web!",
          "Contenu": "I was received several notifications that my info was exposed on the dark web and wasn't really sure what to do.  I talked with one of the IDShield specialists who walked me through what each category meant and what I needed to do as well as how it possibly happened.  I have taken the steps to help limit any additional exposure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Wann",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T18:34:12.000Z",
          "Titre": "As a comedian I keep an Instagram…",
          "Contenu": "As a comedian I keep an Instagram account.  One night after a show back in my hotel room laying on the bed I noticed my 'painted' toe nails, done by my 9 yo daughter.  Took a picture and labeled it 'when you take your socks off...\"  The next day IDShield alerts flagged it as  potential sexual content.  Even though it was my own post they flagged I was happy they were on it trying to protect my image on social media."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lin Schussler-Williams",
          "Nb_Reviews": 2,
          "Date": "2020-06-25T03:17:11.000Z",
          "Titre": "I have been a member of IDShield for…",
          "Contenu": "I have been a member of IDShield for over 7 years.  I'll never forget when my family  - all 5 of us - were victims of the Anthem Insurance data breach.  I was freaking out because my children's permanent information (DOB, socials, etc) were part of the information stolen.  My IDShield investigator gave me such peace of mind and confidence.  When my children turn 18, on their birthday, they get their own IDShield, because it would be silly to be without it.  Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kari",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T20:07:18.000Z",
          "Titre": "Amazing Experiance",
          "Contenu": "If you aren’t a member of IDshield, please sign up today. I was informed of a possible fraud situation and same day I reached out to IDshield. Immediately, they helped me and navigated me through next steps. I feel completely safe and secure knowing they are watching out for me. I was able to take a deep breath, relax and move on with my day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April Gillespie Hurst",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T03:55:03.000Z",
          "Titre": "I absolutely love the IDSHIELD APP",
          "Contenu": "I absolutely love the IDSHIELD APP. I have a 10-year-old daughter and it gave me such  tremendous peace of mind when my ID shield app told me that a new registered sex offender was now living in my neighborhood. I was so grateful to know that information. Protecting my family is the most important thing to me and IDShield helped me to do that better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Beck",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T18:10:51.000Z",
          "Titre": "Helped with driver’s license fraud restoration!",
          "Contenu": "I was so thankful to have this coverage when I found out I was a victim of drivers license fraud. Someone had been messing with my identity in NC, when I live in CA! They managed to rack up 3 years of fines and penalties linked to me. My private investigator took on my case, and restored my driving record and identity in 2 weeks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MrMike Bishop",
          "Nb_Reviews": 7,
          "Date": "2020-05-17T01:18:22.000Z",
          "Titre": "My Federal Tax Return was stolen.",
          "Contenu": "My Federal Tax Return was stolen.I was half-way across the US when I got a call from our CPA telling us they could not e-file our taxes because someone already had! I called the ID Shield and the investigator checked my credit and locked it down, they checked my wife's credit and locked it down, and they told me the next steps and what to expect. It was such a peace of mind and so much easier having an expert to handle it verses my trying to do it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Dial",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T14:40:48.000Z",
          "Titre": "Amazing peraonnel",
          "Contenu": "Personnel are always willing to go out of the way to help resolve your issues.  They are always respectful and polite. And you always talk to the same person that is handling your case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Scantlin",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T14:50:54.000Z",
          "Titre": "Just this year I receive a disturbing…",
          "Contenu": "Just this year I receive a disturbing alert about 4 or 5 public records that I did not recognize. I immediately called into IDShield and was connected to a specialist to assist. Come to find out, the local county was updating its records to digital triggering the alerts. Though it was a false alarm it was nice to know that IDShield was there and would handle things on my behalf if my identity was compromised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rod John",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T15:17:24.000Z",
          "Titre": "Can't beat the price and service",
          "Contenu": "Can't beat the price and service! I knew that my information was compromised in the Equifax Data Breach.  I wanted to get the best ID Protection in the market and found IDShield was the only one that Included Restoration. Since I signed up and downloaded the app, I have received multiple alerts about credit inquiries and attempted address changes that wasn't me.  I have been able to speak to my Private Licensed Investigator everytime about it, and they resolved the issue for me before it turned into a flat out theft.  The monitoring features are amazing, and the peace of mind that I have Restoration in case I am ever a victim is well worth $9.95!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Young",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T18:39:09.000Z",
          "Titre": "Great Caring Service Focused",
          "Contenu": "I’ve had to contact IDShield twice due to alerts that IDShield had called to my attention, they have been great!  Their representatives have been friendly, caring, very professional and customer focused.  I’ve been impressed and happy that I chose IDShield."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Pearson",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T14:52:52.000Z",
          "Titre": "I love Identity Theft Attorneys !",
          "Contenu": "The attorney that worked with me walked me through the process of how get my issue resolved. She was able to answer all of my questions. She seemed genuinely concerned about what I had been through. When I went through knowing that someone had open bank accounts in my name I was devastated and didn't know what to do. I realized I had Identity Theft pr otection.so I phoned them. It was a great surprise that they walked with me and they did so in such a pleasant, effective and efficient way. I say kudos to them and would recommend this service to anyone. I have had to contact them on two separate occasions. I am not sure of the actual dates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2020-05-18T17:02:13.000Z",
          "Titre": "Since becoming a ID Shield member",
          "Contenu": "Since becoming a ID Shield member, I have peace of mind to know that my Identity is being overseen and if it's breached it will be restored back to pre-beach status. When it has been breached on Social Media, it was restored. If I had to do it by myself it would have taken at least 800 hours and not knowing exactly where to go. Thank you IDShield"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T00:51:39.000Z",
          "Titre": "I don’t remember what happened on Aug…",
          "Contenu": "I don’t remember what happened on Aug 14 but I caught someone try to get information and had my sister track it down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Cooper",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T15:51:15.000Z",
          "Titre": "They gave me priceless help!",
          "Contenu": "They gave me priceless help when I needed it. My identity was stolen, and on the 22nd and 23rd they gave wonderful suggestions and gave me practical support in clearing my path. I can say that tonight I can rest easy knowing EVERYTHING has been taken care of. If I could give them 6 stars, I would!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominique Tapplar",
          "Nb_Reviews": 2,
          "Date": "2020-05-25T18:46:32.000Z",
          "Titre": "Awesome Service",
          "Contenu": "IDShield has provided with a peace of mind for the past 15 years. They send me monthly summaries at the end of each month. They notified me immediately when the find anything suspicious such as the time they found an issue that occurred several years ago and brought it to my attention. Although, I was aware of the issue, a paid traffic ticket, it was satisfying to know that they were monitoring everything that matters to me because I have been a victim of driver's license identity theft in past."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "A “Elleca”",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T21:25:30.000Z",
          "Titre": "The first time I sign up here in…",
          "Contenu": "The first time I sign up here in IDShield they help me a lot to protect my identity, they give some knowledge how you protect yourself for fraud. Thank you Jennifer for giving me  good advice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Aleman",
          "Nb_Reviews": 5,
          "Date": "2020-04-29T15:54:30.000Z",
          "Titre": "ID Shield has been their for my wife…",
          "Contenu": "ID Shield has been their for my wife and I so manny times, moments of our cards being compromised a few times. People trying to purchase goods with our credit. Etc we are well pleased with our identity theft company and services...The fact we have private investigators and not a call center is crucial..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Willis",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T16:36:53.000Z",
          "Titre": "It's such great peace of mind",
          "Contenu": "It's such great peace of mind to have this affotdable service knowing that any identity theft question or situation is going to be fully addressed by the investigators. Plus, I always know what's going on with my credit rating. Great value, great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Wilder",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T15:30:50.000Z",
          "Titre": "Email and Password Compromised",
          "Contenu": "I received an email that I should not have opened.  Clicking on this email, I immediately released it was a scam.  Within a few minutes, I received an alert that my email address and password was compromised and suggesting that I immediately change my password information.  These alerts give me peace of mind knowing that my information is being monitored to catch things as quickly as possible!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo Adams",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T19:59:59.000Z",
          "Titre": "Great Advice, Caring Attorneys",
          "Contenu": "I needed help with a legal situation involving my mother and Legalshield got back with me quickly. I got great advice from the attorneys, who spoke with me several times, which helped resolve the situation. If I had not had Legalshield I would not have know how to handle the situation. They also followed up to make sure that I was able to resolve the situation. They showed that they cared about me as a person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dayna Dickman customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T18:35:16.000Z",
          "Titre": "They helped me when I was so UPSET AND",
          "Contenu": "They helped me when I was so UPSET ANDmade me feel that they would take GREAT care of my situation. Jennifer and Rhonda were so helpful and KIND! I will for certain tell others how honest, helpful and caring I was treated.  Thank You All So Much!!!Dayna Dickman"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dani Goeden",
          "Nb_Reviews": 2,
          "Date": "2020-06-25T01:44:30.000Z",
          "Titre": "An old email address of mine was…",
          "Contenu": "An old email address of mine was compromised. When I called in, they said it was associated to a child porn website! They cleared it up in an hour! Then a year later, about 150 people in my area were arrested for child port, and I was informed my email was originally associated with all that! I couldn't imagine if I hadn't had this service to catch that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Banks",
          "Nb_Reviews": 2,
          "Date": "2020-05-25T03:31:46.000Z",
          "Titre": "I've had the service for 10 years",
          "Contenu": "I've had the service for 10 years. I love that I can have all of my identifying information monitored and if something was to happen I have licensed investigators to get my life in order. I remember buying a car a few years ago and when they ran my credit, within a minute I got an email asking me did I do this? If not contact Idshield, all I can say is peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenyatta Turner",
          "Nb_Reviews": 3,
          "Date": "2020-06-01T04:30:04.000Z",
          "Titre": "Identity theft is out of control and I…",
          "Contenu": "Identity theft is out of control and I am so glad that I have IDShield and this handy app on my phone.  All of my info is monitored and I get notifications if anything looks weird (which happens).  I love the peace of mind that when something needs to be fixed, that IDShied will take care of it so I don't have to.  I don't have the time or the capacity to monitor my entire digital identity, so it's great to have a service that has my back!  I love IDShield and I would never cancel this service.  In today's ultra digitized world, a service like this is a REQUIREMENT.  IDShield for LIFE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruthann",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T17:16:07.000Z",
          "Titre": "Twice Rescued!",
          "Contenu": "This is the second time ID Shield has come to my rescue. An email alerted me that someone had used my credentials to get a credit card in my name at a bank I do not do business with. I was stunned they used my address from 20 years ago! The card was to be mailed to a second address (a vacant house on the market). Thank goodness ID Shield could help me contact the bank and cancel the card before it landed in the perpetrador's hands. Then they contacted the credit bureaus and placed a fraud alert. I completed the circuit by calling my banks and notifying them. ID Shield is like having my protective dad watching my back. They are my eagle eyes.And to think, I originally bought this plan to support my friend who is a rep for the company. Who knew it would be my financial salvation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terrell Duckworth",
          "Nb_Reviews": 2,
          "Date": "2020-06-13T18:50:49.000Z",
          "Titre": "I got this service focusing on criminal…",
          "Contenu": "I got this service focusing on criminal identity theft, medical identity theft, or taxes.   I never thought someone would try to take out two payday loans in my name at $1500 a piece.   They walked ne through what i jeed to do and the problem was gone.  My record is clean and im thankful i signed up for this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Hall",
          "Nb_Reviews": 5,
          "Date": "2020-05-18T05:04:23.000Z",
          "Titre": "What a lifesaver",
          "Contenu": "What a lifesaver! I got this plan almost 17 years ago not thinking much about it. It was so inexpensive that I thought I was just doing someone a favor. But then the alerts started happening. I was amazed at how much my identity effects everything I do from getting a job, to buying a car, to buying a house and even getting insurance. My identity is my financial mealticket in the world today and letting someone else steal it could cost me a fortune. Thankfully, ID Shield has stopped numerous attempts to steal my ID. Today my wife and kids are all covered on my same family plan. The peace of mind is priceless."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Gil Alpert",
          "Nb_Reviews": 2,
          "Date": "2022-04-30T00:19:16.000Z",
          "Titre": "Exactly achieved what I hoped for!",
          "Contenu": "I had an ongoing issue where substantial amount of money was owed to me that I been battling for over 2 years to have it resolved. Once I reached IDShield, they were able to connect me with the right legal team who gave me the right advice. I was able to proceed from"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T15:11:30.000Z",
          "Titre": "Representative Misty was very…",
          "Contenu": "Representative Misty was very professional in her approach to assist me and my wife with our situation. She quickly provided for us a solution, which for us was quite helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2020-05-17T22:33:03.000Z",
          "Titre": "I had several credit cards reported on…",
          "Contenu": "I had several credit cards reported on my credit report that were not mine. I called my ID shield advisor and was put on the phone with a licensed private investigator. They reviewed my situation  and call the credit card companies as well as the credit bureaus on my behalf and had all Credit cards that were not mine removed from my credit report. Excellent service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hasnain Khaku",
          "Nb_Reviews": 3,
          "Date": "2020-07-06T08:24:23.000Z",
          "Titre": "Peace of mind",
          "Contenu": "I was happily surprised to know they monitor court records nationwide as well. We refinanced our home recently, and applied to different mortgage companies. Every time they ran our credit, we were notified. Peace of mind !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamika Mattox",
          "Nb_Reviews": 2,
          "Date": "2020-05-16T19:43:24.000Z",
          "Titre": "Having been a victim of identity theft…",
          "Contenu": "Having been a victim of identity theft in the early 2000s, I know the importance of being proactive and having a team of professionals on standby to answer your questions and make you whole again if necessary.  With the onset of the Coronavirus I have been getting frequent alerts from my IDShield monitoring and have been able to call into my licensed private investigators.  Boy-oh-boy, WHAT A DIFFERENCE that makes!  With identity theft being the humongous threat that it has been for the past 18 years now, it makes too much sense to put yourself in a place of proactivity and protection. Don't wait until the worst happens, because trust me, it can be devastating!Thank you IDShield!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Ballback",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T22:46:18.000Z",
          "Titre": "Personal info left my stolen truck.",
          "Contenu": "I called to report my truck was stolen and it had personal paperwork in it. The lady that helped me, got fraud alerts on all 3 credit bureaus while we were on the phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dorothy D.  Gray",
          "Nb_Reviews": 4,
          "Date": "2022-08-18T20:09:50.000Z",
          "Titre": "Warning",
          "Contenu": "I had received a warning from ID Shield that I had something unusual.  I called to check what it was and what I needed to do.  The investigator told me what it was. I was relieved that it was a new account I had just opened. I appreciated the fast response given me to this change in my financial portfolio.   I am very pleased with ID Sheild."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Suepke",
          "Nb_Reviews": 2,
          "Date": "2020-05-16T19:41:20.000Z",
          "Titre": "Peace of mind",
          "Contenu": "Peace of mindThere are so many data breaches out there.  I don't worry anymore because I know that if ANYTHING happens to my personal information, IDShield has my back!Bill & MichelePuyallup, WA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MrMike Bishop",
          "Nb_Reviews": 7,
          "Date": "2022-03-23T17:53:30.000Z",
          "Titre": "I got an alert from my ID Shield…",
          "Contenu": "I got an alert from my ID Shield service so I called in and found out that someone had applied for a Chevron credit card in my name. My ID Shield invesigator got us on the phone with the bank, we explained the situation, and it was taken care of. They then sugested a fraud alert, I agreed, and all three bureaus are now more secured for a year.  It was all done on one phone call thanks to ID Shield."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Morehart",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T23:40:12.000Z",
          "Titre": "The Best Identity Service I have ever used",
          "Contenu": "Thank You for providing service with excellence from the app, to the email correspondence, to protecting what matters the most! Every aspect of ID Shield is top notch quality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Udy",
          "Nb_Reviews": 3,
          "Date": "2020-05-17T01:41:34.000Z",
          "Titre": "ID Shield protecting my SS#",
          "Contenu": "A few years ago ID Shield notified me that my Social Security Number was Being used in Michigan, Well I called the Licensed Investigator with ID Shield immediately. Let them know I haven't been to Michigan in over 30 years, I gave them a limited power of Attorney to act in my behalf. He went to work 2 Days later I received a phone call from this investigator tell me it was fixed. i asked what had happened, he told because of privacy laws he could not give me details, only that it had been taken care of. Now I'm a retired Cop I know who these guys are but i really wanted to know what happened, So i called a few friends in law enforcement on the federal level... What I found out is, yes someone did try to use my SS # but it was a typo not a malicious attack just a mistake. knowing that someone is watching over me my good name and all my info with the ability to FIX IT... is an Amazing peace of mind Mark"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MrMike Bishop",
          "Nb_Reviews": 7,
          "Date": "2020-06-04T19:19:57.000Z",
          "Titre": "My Tax Return was Hacked.",
          "Contenu": "My Tax Return was hacked. When I was traveling out of state on business I got a call from my CPA saying that they could not eFile my Taxes because someone already had. My first call was to ID Shield and within a few minutes, I had a licenced investigator on the line who offered to check my credit report for any red flags, which I approved. He then offered to file the report that would lock down my credit, which I approved. He then offered to check my wife's credit report and lock down her credit as well, which I approved. He then explained the process that I would have to go through with the IRS now and in the future. What would have been a nightmare turned into a 15 min phone call with an expert so I could go on with my life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2020-05-03T17:25:29.000Z",
          "Titre": "What a great comprehensive protection…",
          "Contenu": "What a great comprehensive protection IDShield provides for me, my family, and it's more affordable then other protections.  I have contacted the IDShield support team on many occasions, and they have been nothing but helpful.  They even connected me to a private investigator to review my account, and put an alert on my credit.  I am so happy I chose IDShield!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-04-04T22:31:38.000Z",
          "Titre": "I had my identity stolen",
          "Contenu": "I had my identity stolen. I called IDShield to report it and they helped me with everything I needed to do to protect myself . They told me ways to help better protect myself from identity theft.  I felt so relieved on what to do after I talked with them and knew I would be fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2020-05-18T01:59:04.000Z",
          "Titre": "I love that one plan covers my whole family",
          "Contenu": "I love that one plan covers me, my husband and our four kids. I use the service to monitor all our info and have received guidance on how to handle many different situations from possible fraud to credit issues. It’s so simple to use. One call and you’re speaking to a real person tht is happy to help you. I wouldn’t be without it in today’s world."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Williams",
          "Nb_Reviews": 2,
          "Date": "2020-08-15T21:01:42.000Z",
          "Titre": "Great Service!!!",
          "Contenu": "My name is Ashley Williams! I'm a fairly new to IDSHIELD!!.I too have this app and I use it up to my advantage.I put my whole family under this protection and my experience has been Awesome!!!Thanks IDSHIELD!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michel Hancock",
          "Nb_Reviews": 5,
          "Date": "2020-05-18T15:24:01.000Z",
          "Titre": "Vehicle loan alert",
          "Contenu": "While I was out i received an alert about an application for a new car loan. Upon checking in to the alert I found out my wife was applying for a vehicle loan 2min prior. Thankfully I got the alert right away even though it was my wife, it could have just as easily been an identity theft issue. Thanks for the alert."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Annie M Joiner",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T23:23:25.000Z",
          "Titre": "Legal Shield and IDTheft Defense are great!",
          "Contenu": "Legal Shield and IDTheft Defense are excellent affordable services. I am extremely impressed with their attention to detail and cx svc skills. Kudos keep up the excellent work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 3,
          "Date": "2020-05-17T01:24:13.000Z",
          "Titre": "I got a super scary email",
          "Contenu": "I got a super scary email, that I won't share all what it said, but it SCARED me.  It was Saturday and IDShield was there to help comfort me and told me what was going on.  They also was being proactive, and put Fraud Alerts on all 3 bureaus, just in case.  I felt SO much better.  I think this COVID thing has brought out these predators."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie Udy",
          "Nb_Reviews": 2,
          "Date": "2020-05-16T20:35:43.000Z",
          "Titre": "I will never cancel this protection",
          "Contenu": "I will never cancel this protection!  EVER!!  I had 2 things show up on my report, got an alert, said I opened 2 new accounts!  Not me!  Called the IDSHIELD investigator, they researched & discovered someone had ALL my info. I was even buying a new house!  NOT!!!  They reassured me & went to work!  Got it all sorted out and stopped!  Good credit restored & life still in tact!  If you’re looking at IDShield protection, get it!  It works!  Peace of mind!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melly Ann",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T01:58:10.000Z",
          "Titre": "I normally don’t do reviews",
          "Contenu": "I normally don’t do reviews, but this experience deserves one for sure! Unfortunately, these days we live in a world where you and your personal information needs to be protected. Let’s just say I’m so glad I had this service in place when I woke up to a an alert that my information was used to try to open an account with my credentials. It took one phone and me speaking with two of the most helpful, representatives from ID Shield they literally held my hand every step of the way, they even called the company in question on a conference call, and assisted me with all the steps I needed to take to make sure something like this would not happen again in the future. I also wanted to say this is just not a monitor service they offer quite a few member perks. You might not think this could ever happen to you … but in today’s world just never know. I can’t thank this company and the reps enough, I’m able to sleep with peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelton Young",
          "Nb_Reviews": 2,
          "Date": "2020-05-16T22:01:14.000Z",
          "Titre": "My personal information was compromised…",
          "Contenu": "My personal information was compromised from a company that I came across that advertised them-selves as an legitimate company. Long story short, I reached out with the emergency access button on my IDShied app and got in contact with a private investigator. They walked me through everything I needed to do along with themselves to get things back to normal in a timely-peaceful manor!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel S.",
          "Nb_Reviews": 2,
          "Date": "2020-04-29T16:56:00.000Z",
          "Titre": "A few years ago I had tax fraud!",
          "Contenu": "A few years ago when I filed my taxes, my accountant told me someone else already filed taxes in my name. I was a victim of tax fraud. I called my IDShield and they gave me piece of mind knowing I had a professional fixing it for me. After a few months everything was resolved and I received my tax refund."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T01:02:30.000Z",
          "Titre": "Excellent Customer Seevice",
          "Contenu": "My calls are always answered very quickly and my issues resolved timely. I appreciate the time that is taken to resolve my issue especially when it is usually a sensitive situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommy S.",
          "Nb_Reviews": 2,
          "Date": "2020-05-01T06:17:25.000Z",
          "Titre": "I received a credit card in the mail…",
          "Contenu": "I received a credit card in the mail that I did not apply for.  I contacted IDShield and was connected with an investigator whom assisted me and contacted the credit company and placed alerts with the credit bureaus for me. This gave me Peace of Mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nadine Kidd",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T16:13:35.000Z",
          "Titre": "I have been a member of ID Shield for a…",
          "Contenu": "I have been a member of ID Shield for a long time now and as far as i can remember ID Shield have always came through. It's good to know you have someone positive to call upon NOW DAYS.If you're not a member Please join you would be so very PLEASE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BK Brumley",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T20:32:07.000Z",
          "Titre": "Responsive & Professional Service",
          "Contenu": "The representative listened to my concerns, and then called the banking institution with me, staying on the line as a consultant during the call to ensure the proper questions were asked and answered. She also provided  additional guidance after the call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Molly",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T20:41:39.000Z",
          "Titre": "So worth the peace of mind! It also allows you to check each month, for any updates.",
          "Contenu": "Its a great system! I have peace of mind, knowing things are being monitored.  Getting a summary of where I am, once a month, keeps me informed and on track. I love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Katzenberger",
          "Nb_Reviews": 2,
          "Date": "2022-10-06T02:50:36.000Z",
          "Titre": "I am delighted to be able to call and…",
          "Contenu": "I am delighted to be able to call and receive advise in a short time frame. I also enjoy the searching the social medial platform and keeping me safe"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Porter III",
          "Nb_Reviews": 2,
          "Date": "2020-05-22T18:01:32.000Z",
          "Titre": "The power of ID Shield",
          "Contenu": "2 days ago I received an email from a consulting firm for a place where I did business. My account / activity with this company had been flagged because they discovered that others had gained access into their computer system whereby my account was compromised. I called ID Shield immediately and spoke to the representative who immediately investigated. We reviewed my account together over the phone and He recommended that I place fraud alerts on my accounts as a preventative measure. He called the credit bureaus with my permission and placed all  necessary alerts. I felt so empowered and thankful for having access to this service via my ID Shield monthly membership."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin vondrak",
          "Nb_Reviews": 2,
          "Date": "2020-04-30T19:15:14.000Z",
          "Titre": "Peace of Mind",
          "Contenu": "I am so grateful I found ID Shield.  I know of no other way to protect my identity any better than this. Their customer service is also outstanding!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andrew",
          "Nb_Reviews": 3,
          "Date": "2023-08-28T20:55:51.000Z",
          "Titre": "Keep informed",
          "Contenu": "You need to know the moment something happens so you can take damage control measures"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Owens",
          "Nb_Reviews": 2,
          "Date": "2020-05-16T21:36:19.000Z",
          "Titre": "My identity was compromised through the…",
          "Contenu": "My identity was compromised through the theft, transposing the last two numbers of my social security number and becoming me.  So she proceeded to make purchases everywhere, all the name brands, to the tune of $26,000 with now 17 pages of derogatory credit issues against my perfect 720 score.  I was so distort that I actually forgot that I had The IdShield Benefit, it is just that big of invasion of your privacy, and course your financial future.  I immediately contacted my Idshield , Private Investigators, who within seconds, with his calming voice, assured me not to worry, that he had my BACK.. I started to calm down even more, as he told me, every step of what I should do and what he was going to do to restore my credit, back to it's before theft status.  When in hours, he had done exactly, what he professionally knew to do, and I was back to my peace of mind, and could continue on with my life without the distraction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Complacency Warning",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T19:39:38.000Z",
          "Titre": "I never thought I'd need help with…",
          "Contenu": "I never thought I'd need help with protecting my identity. As a Gen-X'er I grew up pre-internet, MS-DOS programs, AOL online discs with that horrendous electronic dial up sounds. Complacency definitely scared me back to reality. IDShield is one of the benefits that the company I work for provides. I cannot say enough positive things about them as my online information has definitely made its rounds. Let's just say I had scam callers throughout the day calling to \"verify my information\".  I made the mistake one day of actually confirming my bank information. Realized it was a scam and immediately called customer service at IDShield. Although I felt like the biggest donkey, the rep immediately went to work, got my information, placed a fraud alert with the credit bureaus and advised my next steps to mitigate and/or prevent any damage. I received a follow up call not too long afterward to make sure that I was ok and that I followed the recommended steps. They were patient, calm, professional, empathetic and knowledgeable. I ended up posting on my Facebook and recommending them to all my friends and family. ~ Lifetime Member Now"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T02:08:15.000Z",
          "Titre": "idshield helped me",
          "Contenu": "I had an issue with social security number being compromised.  I got good advise and also the websites for the 3 credit agencies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T22:19:38.000Z",
          "Titre": "ID shield went out of their way to call…",
          "Contenu": "ID shield went out of their way to call me back when a fraudulent CC aplication was filed in my name."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Malicott",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T04:46:33.000Z",
          "Titre": "The ID Shield representative was Cheyenne and was professional, knowledgeable, and provided exceptional service",
          "Contenu": "The ID Shield representative, Cheyenne, was extremely professional and knowledgeable.  She clearly understood my issue and worked diligently to correct the problem. Unfortunately, she was unable to correct the problem. I suggested maybe there was something on my end and I would contact my IT specialist to see what they could find.  She gave me her direct number and I told her I would contact her after my IT specialist investigated.  After just over and hour, my IT specialist found a few issues with my computer and corrected them. I then attempted to correct my ID Shield issues and low and behold, it made the correction indicating that Cheyenne could not have fixed it.  It is important to note, that without Cheyenne’s exceptional service and expertise, I issue would likely still exist making me very irritated without justification.  Thank you for such wonderful service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roxanne",
          "Nb_Reviews": 2,
          "Date": "2022-02-06T06:07:24.000Z",
          "Titre": "I can't give IDShield enough stars",
          "Contenu": "I can't give IDShield enough stars. I have had other services, but when I needed them to work for me they let me down. I work in an industry where we talk to people everyday who have been victims of fraud so I'm VERY careful. But, like so many other people, I fell for a scammer posing to be with AT&T/DirecTV and since I had recently contacted DirecTV about my bill, I thought it was actually them calling. They were offering me a discount. They needed my 4 digit passcode to verify my account and I gave it to them. Then they said something about my balance, and I asked what it was, and they gave me the wrong amount so I hung up. It was a weekend, so I called the emergency number and got help! They told me what I needed to do for the time being, then advised me to call back Monday to speak with someone in more detail. The thing that sold me on IDShield is knowing they are US based with US based private investigators! That alone gives me great peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Joe K",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T00:55:45.000Z",
          "Titre": "The information shared allowed me to…feel safe from additional identity theft",
          "Contenu": "The information shared allowed me to feel comfortable with an approach to take after my 7 year fraud alert because of identity theft expired."
        }
      ]
    }
  ]
}