{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "indifferentbroccoli.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Huw",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T12:21:13.000Z",
          "Titre": "Can’t get server to start",
          "Contenu": "Can’t get server to start. No list of mods, very unimpressed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Lyle Wood",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T03:13:25.000Z",
          "Titre": "Long time user leaving now. Toodles, it's been real.",
          "Contenu": "Have been a long-time subscriber. Can't stand the constant interruptions and crap performance. I've upsized, rebooted frequently, done everything support said. Damned thing constantly fails and frequently doesn't bother showing in the server list. I just can't anymore. Server was laggy with only two players on it and constantly needed fiddling to keep it online and working properly.Maybe my instance was on a lemon but nobody in support ever lifted a finger to figure out why it sucked so bad.Enough chances, on to the next host."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blaine Kitchen",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T00:43:46.000Z",
          "Titre": "Terrible Service",
          "Contenu": "Terrible Service.  Bought my server and it took over an hour to start it and once it did I changed the config to my liking and it went to restart and never started.  I ordered it over 3 hours ago and I cannot get in contact with a single person to help me.  I saw he was on discord when I was told to message him and I did 3 times when he was online and then he went offline without a single answer.  Thanks for nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NevZed",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T10:53:01.000Z",
          "Titre": "No Communication",
          "Contenu": "Wanted to rent a larger server after my free trial. There was no option to rent the larger one, only the free trial one. Tried to reach out to figure out how to go about it (email and DM), as I didn't want to lose the server. Happened on a Saturday night, presently 6 hours later and no response. Trail was up and no one can play. Frustrating losing a weekend of gaming like this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T02:02:39.000Z",
          "Titre": "The server was extremely slow to start…",
          "Contenu": "The server was extremely slow to start and restart. I made some changes and went to restart the server and it just never came back on so I went with a different host."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Strange Odyssey",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T00:09:03.000Z",
          "Titre": "Do NOT use these guys for server…",
          "Contenu": "Do NOT use these guys for server hosting. They have no problem deleting your server if you decide to take a break and go inactive for a brief period of time. I have never encountered a server hosting service that is so quick to delete the files from their server. They don't even store a backup or anything. They just delete, poof, gone, sorry. Wild. You can do SO much better."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Cecilie Brude Rishaug",
          "Nb_Reviews": 5,
          "Date": "2021-09-06T19:43:53.000Z",
          "Titre": "Tried to open a server for ARK here",
          "Contenu": "Tried to open a server for ARK here. Sadly, we were given the same IP as another server, and couldnt connect to the server we were given. Slow support aswell. Server has been up for 2.5 hours, and still not able to connect, since its someone elses server."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T18:31:13.000Z",
          "Titre": "VALHEIM: Inferior choice to competitors on every point",
          "Contenu": "VALHEIM did not work. No way to edit config on website or upload without FTP. No SFTP so sending my password in the open. Higher costs than competitors that work and allow edit and upload and have SFTP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Sawyer",
          "Nb_Reviews": 2,
          "Date": "2021-09-17T16:32:56.000Z",
          "Titre": "I think your company is a joke",
          "Contenu": "I think your company is a joke, starting with your name, all the way down to providing an actual Rust host that does the various things a server host needs."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Shadowhel l Shadowhel",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T12:44:10.000Z",
          "Titre": "Satisfactory server awful experience",
          "Contenu": "Tried to host a server for the game Satisfactory, it constantly crashed and performance was awful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T15:14:35.000Z",
          "Titre": "No support",
          "Contenu": "I try to have help with support and never got a reply. I cancelled subscription and lost a month of service. Don't loose your time AND money!"
        },
        {
          "Note": 1,
          "Lieu": "VE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T09:21:10.000Z",
          "Titre": "the server is offline",
          "Contenu": "the server is offline, always i can't get it started"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Victor Sanz",
          "Nb_Reviews": 4,
          "Date": "2021-08-05T01:09:30.000Z",
          "Titre": "did not work",
          "Contenu": "did not work even with help from ds adminEdit to answer ; Lma o, you cant even get the game rightYe ye sure and the thing bug and this too and everything bugs and nothing works :)"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T05:19:31.000Z",
          "Titre": "It sucks and jenuinly doesn’t work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T17:44:22.000Z",
          "Titre": "Server never even connected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zombie Virus",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T18:37:39.000Z",
          "Titre": "Not a good Control Panel.",
          "Contenu": "Not a good Control Panel and could not get Allocs and csmm to work, and I have to have it. could not find the port to the map. Never got to really test how it runs because of trying to get the map to work."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "MG",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T08:25:03.000Z",
          "Titre": "Deleted my server and savegame, no backup",
          "Contenu": "Indifferent Broccoli deleted my Satisfactory server the minute my payed subscription ran out. No backup. support could not help.No warning about the subscription ending anywhere.The savegame is 2.5 MB in size, I image a solution could be found. Or keep the server for a day or something :/"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 3,
          "Date": "2022-08-07T03:23:09.000Z",
          "Titre": "Too complicated to setup for Project…",
          "Contenu": "Too complicated to setup for Project Zomboid, mods are impossible to install, you also have to edit your own Server INI files, the control panel is horrible. If you are new to all this avoid as this service is cut rate and very basic"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T05:07:14.000Z",
          "Titre": "Disappointing options",
          "Contenu": "Easy to get a server up and running. But there is limited options for Conan Exiles and I would assume other games too. The file structure is not accessible so loading in a prior save, backing up the server, changing advanced settings in the server are not possible. In my opinion those are rather critical to making the server in the first place. Why would one pay for a server and not want to customize it at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T17:21:34.000Z",
          "Titre": "(Conan Exiles Server) Initial purchase…",
          "Contenu": "(Conan Exiles Server) Initial purchase was simple, and straight forward. However, 24 hours later I was never able to get the server setup. Initial server setup failed, and a server wipe caused the server to stall in the \"setting up\" phase for hours. Support was lacking and delayed."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T03:43:54.000Z",
          "Titre": "Mediocre Hosting Service.",
          "Contenu": "Panel was quite basic and not a lot of guidance on what needs to be done, on top of that, there is no second verification for making purchases so you're more likely to make accidental purchases."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T23:18:25.000Z",
          "Titre": "Server was laggy and DC’d players"
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T13:17:13.000Z",
          "Titre": "It takes so long to restart the server."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T18:26:33.000Z",
          "Titre": "Exceptional service.",
          "Contenu": "Previous: (While customer service was quick and painless, unfortunately the server itself is the problem. With Satisfactory specifically it will crash constantly after a certain point.Not worth the money.)Update: After seeing the review there was a very rapid response and near instant emailing back and forth to try and get my issue solved. Unfortunately we weren't able to fix it, but the effort was clear, and without even asking for it I was offered a refund.I likely wouldn't try to rent a Satisfactory server again, but for a lighter game I could see myself going to Indifferent Broccoli once more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T00:10:45.000Z",
          "Titre": "Set up was easy but server lacks stability",
          "Contenu": "Set up was easy, but the server stability has been very lack luster."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-02T18:52:39.000Z",
          "Titre": "Wanted to give it a chance but no GUI…",
          "Contenu": "Wanted to give it a chance but no GUI or stats for server settings was a dealbreaker"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T22:10:51.000Z",
          "Titre": "Wasn't able to play the version of Ark…",
          "Contenu": "Wasn't able to play the version of Ark due to not enough RAM."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ M",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T05:11:02.000Z",
          "Titre": "solid host for satisfactory",
          "Contenu": "Setup and payment was quick and easy, the two day free trial sealed it for me.  Nice little try before you buy without any steps between. They have almost all of the management features I might want. Missing a few polish points in the dashboard though like how long since server last rebooted and what version of the game server is currently running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dillan D'Lorian",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:05:30.000Z",
          "Titre": "Helpful Professional Staff",
          "Contenu": "OK...so...the only reason this experience wasn't five stars was because It took me around twelve frustrating hours to get everything up and working.  HOWEVER the staff deserves five stars for professionalism and being on task with assistance for users in need of guidance.  It took some time but we got my server up and running with my personal favorite map and one fantastic mod."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chef T",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:33:35.000Z",
          "Titre": "Indifferent Broccoli's servers are…pretty good",
          "Contenu": "Indifferent Broccoli's servers are really easy to keep running and are fairly straightforward. The only thing that I do not like is that when I pay for the service, I get a charge for across the border interactions. I am already paying for my server, so getting a hidden fee, is kind of annoying. Beyond that, I do love them and plan to stick with their servers for the foreseeable future."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Dutch gamer",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T23:19:47.000Z",
          "Titre": "The automation is good, the game is not stable yet.",
          "Contenu": "The automation is good, but we suffered quite some issues with Satisfactory during the 48 hour test period. In all fairness, I think these were issues with the game (it's still not released!) so I do not fault the service provider for that. However, there were some frequent server connection issues where the game could not find the server (that might not be just the game), some weird teleporting, instant death and crashes. Some of these I have noticed in peer-to-peer games as well, and some others were new. Overall, I will try again once the game is stable and released. And Yes, I would try again with Indifferent Broccoli."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Efe",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T14:57:54.000Z",
          "Titre": "In general, I'm happy with the service",
          "Contenu": "I'm using the service for Satisfactory. Sometimes I have connection problems, but in general very stable. Sometimes, when I disconnected forcefully, I start with a new character, have to find myself, kill myself and get my bag back. I don't know if it's related with the service or the game."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yce",
          "Nb_Reviews": 1,
          "Date": "2021-06-27T02:23:41.000Z",
          "Titre": "Smooth gameplay and helpful staff",
          "Contenu": "Once I was registered, the server was setup quickly and without issues.  The 2-day trial period (before providing any billing information) was nice to make sure gameplay was smooth and no issues connecting or using the server.Support staff reached out proactively to welcome me and was quick and helpful in responding to a payment issue I had.  Only a few days into playing, but so far there have been no issues with gameplay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CarDudesPlayARK",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T17:24:13.000Z",
          "Titre": "It's a good server hosting service",
          "Contenu": "It's a good server hosting service, decent price, just  wish some of the basic Ark settings other server hosts have listed in the control panel were listed on here as well. But I will be continuing to use their service as price and performance of the server is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pavemnt",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T06:35:19.000Z",
          "Titre": "Near flawless!",
          "Contenu": "Server resets itself every couple of hours but beside that is a stellar service!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T22:57:58.000Z",
          "Titre": "Support",
          "Contenu": "Hello,I have sent an email and have not received an answer to this day.you have a processing time of 4 hours but in this case i have been waiting for more than 24 hoursi need to update my review it was a technical problem because of the new year and i now have contact to the support system"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T00:06:40.000Z",
          "Titre": "Everyone was friendly and the price is…",
          "Contenu": "Everyone was friendly and the price is right.  The only drawback was lack of support for cross play so I had to use a competitor service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "gilaet",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T19:36:35.000Z",
          "Titre": "Easy and intuitive",
          "Contenu": "It's a very easy setup and very intuitive.I would like to see start/stop server buttons instead of restart and wait."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T23:25:00.000Z",
          "Titre": "great ark server and nice…",
          "Contenu": "great ark server and nice crossplay/option"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Jurojin",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T02:49:13.000Z",
          "Titre": "Reliable and easy to use",
          "Contenu": "Sometimes the server has lag, but it's very good and easy to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer August  Boston area",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T08:03:36.000Z",
          "Titre": "Provided feedback on Satisfactory…",
          "Contenu": "Provided feedback on Satisfactory server performance, room for improvement on a small 3-4 person server."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T22:40:04.000Z",
          "Titre": "Fast support",
          "Contenu": "Fast support, good servers."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Client",
          "Nb_Reviews": 12,
          "Date": "2023-09-03T22:48:24.000Z",
          "Titre": "Somes crash but it works fine"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "RagingHamstr",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:11:17.000Z",
          "Titre": "THEY ARE THE BEST, YOU WONT GO LOOKING ELSEWHERE.",
          "Contenu": "This is the best hosting staff I ever dealt with. They are quick fast and go above and beyond, when dealing with requests or issues. The name is tricky. it says indifferent, but they truly care. its nice being able to get quick replies. thank you staff of Indifferent Broccoli."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gritphilm",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T22:42:04.000Z",
          "Titre": "The rust server was up and running…",
          "Contenu": "The rust server was up and running quickly."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Gio",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T16:29:58.000Z",
          "Titre": "Amazing all Around",
          "Contenu": "Indifferent Broccoli is great all around, from a well played marketing gimmick to what really matters, their services. The price and the stability of the servers they offer is great, with their customer support shining the most. They are always willing to assist in setting up a server, going with you through every step needed on discord."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Barnett",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T22:29:34.000Z",
          "Titre": "Intuitive and amazing customer service",
          "Contenu": "This is my first time using a dedicated server, and using a Indifferent Broccoli made the process so easy and intuitive. My friends wanted to play Valheim together, but couldn't find a hosting service that met their needs. I used the free trial and found the Indifferent Broccoli was just what we needed. The FAQs are incredibly clear and helpful, but the online support is even better. Thanks Jake for making my first time using a dedicated server so easy!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "MasterBroccoli",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T08:48:47.000Z",
          "Titre": "Great!",
          "Contenu": "Free trial with fully functioning server, stable servers, and Discord help. Setup is quick and easy, and doesn't require payment info. Pricing seems very fair. Also, Broccoli is awesome!P.S. While my name is, and has always been, MasterBroccoli, I am not affiliated with Indifferent Broccoli in any way. I chose them because I loved the name, and am very happy with my choice."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Weico",
          "Nb_Reviews": 2,
          "Date": "2022-10-30T00:32:49.000Z",
          "Titre": "Fastest support i ever seen",
          "Contenu": "I decided with friends to buy project zomboid server. Broccoli was our choice and i'm very happy about it. Server was perfect (it sometimes didn't render all chunks but it was because of masive list of mods) and setting it up was really easy. I had problems with canceling my subscription but after asking support for refund on email they responded to me after literally 2 minutes with proof of refund.I definitively recomend this host for everyone who need server running 24/7"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T16:59:30.000Z",
          "Titre": "amazing personal service",
          "Contenu": "Super friendly and helpful in setting everything up for the first time, but the 48 hour, try before you buy option on your first server, was the absolute best. It lets you truly see what you will be getting and the support felt as if I was already a customer. Aside from the free trial you still have 7 days to cancel and get your money back if you are not satisfied. To be honest I paid for a full server rental before ever logging in, just based on the support to help setup a modded server, it was amazing. Truly a Five Star experience from the start."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mick",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T18:45:06.000Z",
          "Titre": "Great Hosting option!",
          "Contenu": "First time hosting a server myself to get a MP Project Zomboid server going. I was hesitant but saw good reviews for Indifferent Broccoli and the pricing tier plans were also appealing. It was a really smooth process! base world was up right after paying. I have minimal \"coding\" knowledge so editing the files and adding mods was simple once you get the hang of all the locations of things that are different from hosting from inside zomboid's UI. I had one server support issue that was caused by a coding error on my part. I joined the ID Discord and someone helped me right away and told me what was erroring on the server. Would recommend to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Wizard Shabocky",
          "Nb_Reviews": 2,
          "Date": "2023-02-01T21:51:34.000Z",
          "Titre": "Groovy People, great company",
          "Contenu": "I run a Project Zomboid community, had been having a hard time finding a good provider until I found Indifferent Broccoli. Compared to other server providers, they are the best I have used. Friendly and knowledgeable admins in their discord, the owner is a solid human being. Made it easy to transfer ownership from one account to another, and has been all around helpful and very courteous. I highly recommend getting your servers through them, they are soooo much better than Gportal or *gags* Nitrado."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sk",
          "Nb_Reviews": 2,
          "Date": "2022-05-06T17:35:14.000Z",
          "Titre": "Great for Valheim",
          "Contenu": "Quick setup, reasonable pricing, and very responsive support team via email and Discord.We imported a rather large Valheim world from a personal server so a friend would no longer have to leave his PC on. Performance is pretty good for 5-6 players at a time and we haven't had any major issues in the 4 months it's been up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Ipema",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T16:05:38.000Z",
          "Titre": "Give it a try",
          "Contenu": "I used IndifferentBroccoli for Valheim for a few months. Their support is quick and gets the job done. I never had a problem with their servers. Jake is a trustworthy businessman who is passionate about what he does. You may be wary about the name and not having a PayPal option for security reasons, but Jake is working hard at developing support for more games and making the website better. For now, some functionality is basic, but for most people's needs, it works wonderfully."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krytera",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T08:27:27.000Z",
          "Titre": "Super easy to get a server going",
          "Contenu": "Super easy to get a server going for Project Zomboid with mods on. Any issues I had were quickly solved by the help of the small but extremely helpful support staff. I easily recommend using these guys if your game of choice is available as an option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DeAnna Highfield",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T00:38:02.000Z",
          "Titre": "Beyond Expectations",
          "Contenu": "What an awesome server host. The price is great (cheaper than my previous server!), set up was quick and super simple, and their response time to requests is beyond expectation. I needed some help setting up operator and adding some mods. They answered me within minutes and were working on my requests immediately after I told them what I wanted. Our mods were loaded and working within 20 minutes. My group really didn't expect to play with mods until the next morning!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diche Bach",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T19:39:16.000Z",
          "Titre": "Truly Impressive Customer Service!",
          "Contenu": "Buddy and started a heavily modded coop session. We decided to transition to a 24/7 server and I setup a 48-hour trial server on indifferentbroccoli.com. After setting up the server, I wasn't able to log in to my pre-existing character from the coop session, so I joined their Discord to get assistance. It took several hours of troubleshooting, but their support staff kept trying different things and solved the problem! My friend and I are able to continue our coop session on our new server! Not too many host providers I've worked with would put in that much effort to get a user set up with a pre-existing save file on a new server. TRULY IMPRESSIVE!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Glue-Eater",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T17:17:29.000Z",
          "Titre": "No BS, just good inexpensive servers",
          "Contenu": "The only legitimately \"no-hassle\" trial period I've seen in years.  Intuitive UI and simple & reliable FTP service on the backend, good ping (30-45) and steady service on frontend.Would highly recommend, at least for Rust servers."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "shedaxz",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T05:18:13.000Z",
          "Titre": "It's amazing how well it works",
          "Contenu": "It's amazing how well it works, I definitely know why they let you do the trial without putting any card, the service is so good they know you'll stay haha10/10Also I forgot to pay and I did it a lil later, the server and the world was all still there all perfect"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Cowman",
          "Nb_Reviews": 4,
          "Date": "2022-01-02T09:50:23.000Z",
          "Titre": "Great choice for servers with friends",
          "Contenu": "Have now had a Valheim server for around a week. Just myself and a couple of friends playing on it, but performance has been great so far and the initial setup was extremely quick. Quite like the control panel too - everything I need, but keeping it simple and responsive unlike some I've used in the past.Currently wouldn't hesitate to try them again or recommend them to friends in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. T",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T07:00:21.000Z",
          "Titre": "Solid Server Host",
          "Contenu": "I have used multiple service hosts in the past. The staff has always been the most flexible utilizing Discord to message us when we have questions directly. Not only do they show us what's wrong, but they show us how to figure out the problem in the future. Whenever someone asks for a solid server host, I recommend indifferent broccoli. Crossfate is always professional and helpful when I have questions. My only concern about the server host is the inability to send server donations from members directly to the server hosts and needing help adding other players to help administrate the server VIA indifferent broccoli's website dashboard. Besides that, I rate it a 9/10, and I'm glad I have gone this route."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Ross",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T23:07:19.000Z",
          "Titre": "The best customer service I ever received",
          "Contenu": "Hands down the best customer service I have ever received. The guy who helped me spent a ton of time explaining things and answering my questions. Never once showing any signs of rushing me or being annoyed at my lack of knowledge with the topic. They gained a customer for life if they keep this attitude and approach on running their business. I tip my hat to all of them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arno",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T02:52:04.000Z",
          "Titre": "Astoundingly Incredible Server Provider",
          "Contenu": "Server hosts are great people! They'll help you anytime you need it, with responses pretty quick in Discord. Easy to use file system, as well as awesome prices. I bought a Project Zomboid server, and it has been working awesomely! I fully recommend them, as they are a hardworking and helpfully kind team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Michael Perea",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T16:38:30.000Z",
          "Titre": "Extremely happy customer",
          "Contenu": "One of the best experiences I’ve had with hosted servers. I’ve had exactly two issues that were either resolved or looked into almost immediately. I really enjoy the simple UI for configuring and managing the server. Price point is on par with other providers but the customer service puts them above the rest."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MonteT",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T18:33:51.000Z",
          "Titre": "Customer service genius",
          "Contenu": "The speed and accuracy of what was wrong with setting up a new custom 7 days server was phenomenal. @bawss and @indifferentchicken helped me identify and correct the settings and files that needed to be fixed in order for my server to be online and working perfectly."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Jarl Kara",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T06:21:51.000Z",
          "Titre": "This is an amazing host!",
          "Contenu": "This is an amazing host. The owner and staff are so very friendly, helpful and professional.I'm located in Asia, and the owner did his very best to get me the best possible ping, by personally finding me the best server location.  Every question was answered promptly, helpfully, and all my problems were always resolved.A fantastic host. I wholeheartedly recommend Indifferent Broccoli!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Culo Muncher",
          "Nb_Reviews": 3,
          "Date": "2021-05-07T01:02:28.000Z",
          "Titre": "A whole new level of customer care",
          "Contenu": "I used to run my Minecraft server on G-Portal back in the day. But those guys always felt so impersonal, never looking out for the little guy like me. When I started playing Valheim I was on the lookout for a new provider. Indifferent Broccoli changed the game. These guys are always there for me even when I don't deserve it. If you want a company who who always has your back, Indifferent Broccoli is the way to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clark Dorer",
          "Nb_Reviews": 3,
          "Date": "2021-05-07T17:30:55.000Z",
          "Titre": "Awesome experience",
          "Contenu": "Awesome experience. Every time I need help with my server, service is quick and easy. They provide the easiest user interface to setup and mess with your server. Most times I didn’t even have to change confit files or anything to edit my game world in 7 days to die. Valheim worked super well too!  I will always check and see if indifferent broccoli hosts a game I want to purchase a server because of these things. They also tend to cost the same or less than competitors. Can’t think of a negative thing to say!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "andrew",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T04:01:16.000Z",
          "Titre": "The absolutely best Project Zomboid…",
          "Contenu": "The absolutely best Project Zomboid server host! Very fast and responsive support. They are the best in the industry right now. Check em out!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Ingle",
          "Nb_Reviews": 2,
          "Date": "2021-05-08T12:55:09.000Z",
          "Titre": "5/5 Top Notch Customer service!",
          "Contenu": "5/5! New to dedicated servers, started using their 48 hr trial for Valheim to help me and my friends try it out, and we love it! Easy sign up and definitely worth the monthly fee for a persistent world you and your friends can drop in and out of. Server was online in minutes and their customer service is top-notch. They are super responsive and make sure everything is taken care of. Would definitely recommend. I’ll continue using indifferentbroccoli.com as long as I’m playing Valheim or any of their other hosted games."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T19:28:18.000Z",
          "Titre": "Was with Indifferent Broccoli for a few…",
          "Contenu": "Was with Indifferent Broccoli for a few months and had zero issues. The only reason I cancelled was because my friends and I no longer play Valheim. Once we pick the game back up though we would more than likely just continue with IB or for their other available games. Everything was smooth and easy, with very quick support for questions."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Panda Poop",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T20:04:25.000Z",
          "Titre": "Wouldn't use anyone else.",
          "Contenu": "Every single time I have asked for their support, they have answered within a couple of minutes (if that!) always friendly and helpful. They are able to access your server and resolve the problem without being intrusive on your privacy. I had a nightmare with trying to set up a new save for my project zomboid server, after 4 hours I was getting no where and I wanted to swiftly ram my head through my monitor at this point. One of the support workers VeRgZ offered their support and completely set up a new server for me easily and quickly with continued helpful and friendly support. I can not recommend this team enough and the work that they do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blake Clark",
          "Nb_Reviews": 1,
          "Date": "2021-08-28T16:53:59.000Z",
          "Titre": "Fast, streamlined set up and very helpful owners.",
          "Contenu": "Simple set up, very attentive help for issues that arose during server set up with mods. No complaints. Server isn't listing on in game browser yet but will be patient before worrying."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Notrel",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T14:45:15.000Z",
          "Titre": "Solid server service",
          "Contenu": "Server runs smoothly, without any performance or connection issues. Control panel area is simple enough for even me (zero background in IT) to understand. No issues so far, and I have confidence that any future issues will be easy to resolve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emry Kinney",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T23:45:57.000Z",
          "Titre": "Clean Experience and Responsive Staff",
          "Contenu": "So, I'd been looking around for servers to use and found low.ms from a youtuber. After some reddit reviews it seemed fine so I picked it up. It was fine, but I needed to do some troubleshooting and found Indifferent Broccoli, holy cow, this is WAAAAAAAAAAAY miles on miles way nicer than the other services I was looking at.It looks like a service aimed at adults, not a ton of advertising listed around, just a few clicks of \"lets get you started.\" Had some issues with getting my Satisfactory server being used and they had pinned solid info and tutorials and provided clarifications when I asked. This was all done in the free 2-day window which I really hope they keep to let folks see how clean and easy their setup is.100% moving game hosting options to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T02:31:50.000Z",
          "Titre": "Guidelines for setup were very clear",
          "Contenu": "Guidelines for setup were very clear. Server runs very smoothly and prices are very competitive. Unlimited RAM per server tier is an added bonus."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Trow",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T17:07:46.000Z",
          "Titre": "7 Days to Die Server",
          "Contenu": "I rent a 7 days to die server with these guys, they are great! Amazing customer support, no lag issues either (playing large modpacks, 8k map size usually). Their control panel is easy to use & as a plus looks nice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Tarr",
          "Nb_Reviews": 1,
          "Date": "2021-08-01T22:35:49.000Z",
          "Titre": "Best Provider EVER!",
          "Contenu": "This is by far the best provider I have dealt with ever. I cannot say enough how happy I am with the service provided. Not to mention the prices are very reasonable. I highly recommend Indifferent Broccoli to everyone who needs a server provider. Indifferent Broccoli is amazing! Give it a try and you'll see."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zac",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T15:37:47.000Z",
          "Titre": "Easily the easiest, what else is there to say.",
          "Contenu": "Literally don’t know how much easier it could get to setup a server for you and your friends. It’s a little more expensive than other options but it’s been a breeze to setup and get right into playing."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Bladegreek",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T16:30:29.000Z",
          "Titre": "Great service fast reply",
          "Contenu": "They helped build the server ask all my question when i reach Them at discord pretty fast great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron N",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T04:31:45.000Z",
          "Titre": "The server setup was super super easy",
          "Contenu": "The server setup was super super easy. The immediate email asking how my new server is and following up on the purchase was inviting and great. The price point for a server is pretty great too. All in all A+ so far would get other game servers from."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Capt MacDougall CaptMacDougall",
          "Nb_Reviews": 1,
          "Date": "2021-08-22T21:02:31.000Z",
          "Titre": "Server works as advertised",
          "Contenu": "Server works as advertised. easily hosted, and easily edited game server settings for 7 days to die. no issues. customer support through discord server, ask a question get a response within an hour or two at the latest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TheeBomberr",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T14:09:20.000Z",
          "Titre": "Amazing and very happy with my experience",
          "Contenu": "Indifferent Broccoli has the best customer response time I have ever seen, they responded to my issue within the hour usually less than thirty minutes and resolved the problem and even when my world got changed they were able to reset it back to where is was before. Amazing customer support. 10/10 Cooperation and good prices for the servers."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daisy",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T19:33:18.000Z",
          "Titre": "Absolutely top notch customer service",
          "Contenu": "Absolutely top notch customer service, going well above and beyond what I might expect for what I'm paying.  I have used other hosts before and I've never had such a positive experience as this one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lost Toasted",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T22:46:27.000Z",
          "Titre": "Fastest customer support I have seen",
          "Contenu": "I have used a couple different bigger name hosts in the past. waiting 24 hours or more for a ticket to be solved is a drag when your friends want to play 7 days to die right now. when I asked indifferentbroccoli questions I was given honest answers through their discord in 5-10 mins. when I needed a server transfer to a different location it was done in 45 min with the same save file intact. our ping is the same if not better per player vs the big names. the control panel for 7 days is easy and full of all the options you need. even has the option to enter a seed name. my first two days were through a free trial right on their site. But the awesome service and support made me pay into the first 24hrs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stewart McIntosh",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T09:38:15.000Z",
          "Titre": "Try their trial. It just works.",
          "Contenu": "Plan 16 player $16/month.After 2 weeks of frustration with another satisfactory server provider, I decided to take Indifferent Broccoli up on their 48-hour trial.  After loading in our current save game, 6 hours later I had entered my card details and was happily playing lag-free, with no rubber banding, and no items doing random stuff on belts.Apart from the standard to be expected Satisfactory dedicated server bugs you will feel like you are playing a game locally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaleb T",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T00:15:18.000Z",
          "Titre": "These guys are honestly Awesome!",
          "Contenu": "These guys are honestly Awesome! I have had servers for a few years now and these guys have been the first that I was skeptical about when I first started. A server that allows you a free trial? like where can you find that? So gave it a shot and wow the servers are great for rust. I heavily mod my servers and I threw all I had at the server and it was my game that crashed before the server did. This is the first server that has done that. Color me surprised because I am talking 50 mods plus 60 attack helicopters and me shooting fire rockets plus the helicopters attacking me. 10/10 would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Torval",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T15:58:36.000Z",
          "Titre": "Project Zomboid Hosting Bliss",
          "Contenu": "I've been using IB for almost two months now and my experience has been nothing short of great.  I've received quality hosting, not suffering from the typical Project Zomboid hosting issues of RAM insufficiency (even on hosts that claim you can have scaling RAM this has been an issue).  In addition, support has been very fast any time I have needed it and my server's uptime has been literally 100% aside from when I have taken it down to do something.  The value IB offers for the prices they charge is unmatched anywhere else I have tried.  I have used at least three others hosts prior to IB and if the services continue as they are today, I'll never go anywhere else for my PZ hosting needs.Special shoutout to VeRgZ, who has spoken with me directly each time I have needed support, and has typically been able to respond to me within minutes of my question/ticket."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "PT",
          "Nb_Reviews": 2,
          "Date": "2021-11-17T03:48:21.000Z",
          "Titre": "Exactly what I wanted.",
          "Contenu": "Using them for a Valheim server. Setup was super easy. Any questions are quickly resolved via their discord support. Could use a few more features but they appear to be actively working on adding more. Very happy so far and have had zero lag or drops."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T16:30:53.000Z",
          "Titre": "Been using this service for almost two…",
          "Contenu": "Been using this service for almost two weeks and its been really smooth. Great interface, ftp compatibility to install my own mods and make my own backups, and better customer service. Fast, efficient, and was quickly moved to a different server when I had latency issues with one of the other players."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Parkercito",
          "Nb_Reviews": 2,
          "Date": "2022-08-01T20:07:22.000Z",
          "Titre": "Thanks so much!!",
          "Contenu": "I did not know this company, but after speaking with them through discord I can only say good words. Their customer service is fast and efficient. They help you with everything and offer you a free trial so you can check their services for yourself. From 10 /10."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T18:25:52.000Z",
          "Titre": "I used the 2 day free trial",
          "Contenu": "I used the 2 day free trial, and it was absurdly easy to my game up and running. The support staff were also great in answering my queries very quickly and effectively. Will definitely be using the service in the future.10/10 would recommend. Even if just for the trial"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryn-Rhys Banks",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T19:23:37.000Z",
          "Titre": "A simple to use and easy service",
          "Contenu": "A simple to use and easy service, perfect for novices to host their first time vanilla terraria server. All of my questions were answered in Email by Jake who pre-emptively reached out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Taraba",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T06:03:39.000Z",
          "Titre": "Best Game Servers Ever!",
          "Contenu": "Honestly the best server rental service I have ever used. Zero lag, easy to use, and super friendly staff. Recommending to all my gaming homies."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "August J",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T18:20:20.000Z",
          "Titre": "This is an amazing server hosting for Rust 10/10",
          "Contenu": "This is an amazing server hosting for rust. I have tried like 3 different hosting services and all of them have had awful support and many issues, But this one has very impressive support and a the servers are at a very good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2021-09-19T13:28:29.000Z",
          "Titre": "Super easy setup and server is stable…",
          "Contenu": "Super easy setup and server is stable during gameplay. Comparable price to any other hosting service. Saw a post on Reddit from the person running the site that gave me confidence in the service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "human person",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T23:39:27.000Z",
          "Titre": "Genuinely awesome and helpful",
          "Contenu": "Fast, to-the-point responses, near-instant fixes when it was out of my control.Need a game server hosted and MIGHT need help getting it up and running? Yeah, this is your best option."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Dickey",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T00:33:01.000Z",
          "Titre": "This company is outstanding. Use them.",
          "Contenu": "First off to Vergz and Crossfate, the people that support the discord. Shout out to these fine folk.I've had my new server on Project Zomboid for a few days. I'm knowledgeable enough to add my own mods, but the more you add the more chances for issues.The previously mentioned scholars of server setup were amazing in helping me get everything figured out. No more error codes, no lag, no conflicting mods.They see this stuff on the daily, and I wasn't able to stump them with any of my issues. They always had an answer, and even looking at their discord shows how amazing they are at what they do.I used G-Portal before Indifferent Broccoli. Server was okay, but lagged, the customer service was okay, but they had an atrocious payment system that frustrated me every time I went to cancel. Never again.I.B. has a simple interface, the customer service is just impressive, and WOW does the payment system favor us (the customer).If you want the best, look for that straight faced superfood. Indifferent Broccoli or bust."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Douglas Onewithtrials",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T08:53:22.000Z",
          "Titre": "Been with other companies and…",
          "Contenu": "Been with other companies and Indifferent Broccoli 🥦 is 100% the best out there plus the lowest prices too.  The support is amazing! So fast to reply and intelligent replies. No robots 🤖"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pete Wilson",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T17:00:16.000Z",
          "Titre": "Very happy with experience using…",
          "Contenu": "Very happy with experience using Indifferent Broccoli to play Valheim, server was up and running fast and my gaming group had no issue connecting and playing 24/7. Server dashboard has a simple and clean presentation and all relevant information is easy to find. Billing cost are simple and easy to understand (Unlike some competitors).Already planning to use them again with another game."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T13:43:14.000Z",
          "Titre": "These guys are amazing",
          "Contenu": "These guys are amazing! Any problems I had I never waited longer than 10 minutes from the time I sent an email! I have NEVER experienced support/service like this before, close but these take the 1st place for sure!! AMAZING!!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Leonardo",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T13:10:12.000Z",
          "Titre": "Easy setup and tutorials",
          "Contenu": "Our server setup was really easy. They also provide easy to follow instructions on how to migrate existing map/save to the server."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-09T19:21:17.000Z",
          "Titre": "I had a problem with importing save…",
          "Contenu": "I had a problem with importing save files from previous service.Jake insisted to do everything in his power to help me and eventually it worked!Friendly interface and great support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jason mather",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T17:20:51.000Z",
          "Titre": "Best 7Days to Die host",
          "Contenu": "Their wikis are good and setup was simpler than any other 7 days to die hosting I've tried. Support is very quick to help with any issues."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Robbie Campbell",
          "Nb_Reviews": 2,
          "Date": "2021-09-17T18:36:01.000Z",
          "Titre": "Perfect server and customer service is 110%",
          "Contenu": "I was dubious about using a company I hadn't heard of before to host a new Valheim server. MY fears were completely unfounded. I started with the free trial and even though I forgot to add payment details once it had expired they still saved my world and gave me time to decide if I wanted to continue with the paid version. They didnt just delete it right away. I have been using them for 2 months now without a fault and yesterday there was a slight issue with the server. My card had some attempted fraud on it so they couldnt take the initial payment and so the subscription was paused. Once they took the payment The server didnt restart immediately. I posted a message on their discord asking why I couldnt access my server config on their website and within seconds they were on top of it. les than 5 minutes later my issues (which wasn't even their fault) was resolved and they even helped update my server with the new H&H patch.Their site is easy to use and the customer service team are fantastic - dont hesitate to give them a try!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yenneth",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T21:12:23.000Z",
          "Titre": "Zomboid for YouTube",
          "Contenu": "My small YouTube channel wanted to play Project Zomboid together so I started one with another company.  Every night I logged in and we went off to do something together at least once or twice during the night we faced desync issues.I have since swapped to Broccoli and had no issues at all.  I used the guide to migrate my server from the old host to this one and while it was confusing I managed to get both the world and player database working on your servers.I also enjoy that I am paying for slots and not RAM.  I know Zomboid doesn't use a crazy amount of RAM but it is a relief to not have to do any math to figure out how much RAM we might need for the server to function and for someone like me who isn't too keen on server specifics it's peace of mind to not have to worry and just buy the slots.Don't even get me started on the discord bot that comes with the server.  I looked at a guide to make a bot and no thanks.  It's nice to let people reset the server whenever they need even if I'm not aroundThank you for everything!"
        },
        {
          "Note": 5,
          "Lieu": "EE",
          "Pseudo": "Herman Proosa",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T03:00:36.000Z",
          "Titre": "Capabilities and my positive experience",
          "Contenu": "This hosting service appears to be allocating plentiful computing resources to my game server, which gives me great reliability, versatility and ease of mind about the server's prospects. I'm also quite happy with the server management options, including the file system utility. There have been a few strange behaviors I've noticed in server automation and management but nothing that didn't resolve and nothing too serious. I also feel that the pricing is very reasonable and the support is proactive, future-oriented and helpful. I kind of didn't appreciate being repeatedly asked to provide this feedback because my experience so far is still quite short-lived and I don't much like being told what to do. Generally though, a very positive experience."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T00:31:42.000Z",
          "Titre": "Easy, fast and friendly.",
          "Contenu": "The free trial that Indifferent Broccoli offers is unlike anything I have seen from any similar company, just enter an email address, a password, and hit the button and you have a 48 hour trial with none of the horrible auto-renewal that is the standard elsewhere.Beyond the free trial I have had no issues with ping, lag, or poor performance and the dashboad is easy to understand and use. I have been thinking about hosting a Valheim server for some friends and if I do then I will definitely be using Indifferent Broccoli."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gage Lucas",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T16:34:05.000Z",
          "Titre": "Best In Class Support & Performance",
          "Contenu": "I got a new Zomboid server set up with them. I messed it up with mod issues. They went in and downloaded the right re-requisite mod, fixed my settings files and backed up my server all from a single request within a few minutes. Best service hands down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T22:19:37.000Z",
          "Titre": "Super easy and quick to set up",
          "Contenu": "Super easy and quick to set up, they even give you 2 days hosting free before they ask for pay info so its easy to try out for yourself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randall Cass",
          "Nb_Reviews": 1,
          "Date": "2021-08-21T18:09:06.000Z",
          "Titre": "I am using the Viking Server Hosting…",
          "Contenu": "I am using the Viking Server Hosting service. Great server, fast and reliable!~ The customer service is top notch! Great service, friendly, and helpful! I definitely recommend this service and server for anyone looking to host a Valheim server! 100% happy with this service! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leif “ame” Kysar",
          "Nb_Reviews": 1,
          "Date": "2021-06-05T21:23:37.000Z",
          "Titre": "I had a 7 Days to die server for…",
          "Contenu": "I had a 7 Days to die server for several months. The customer service was fabulous. Have used other hosting services and no one comes close to the response time I received with their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T09:08:57.000Z",
          "Titre": "Customer Service Report on the Discord",
          "Contenu": "Customer service support on the Discord was excellent and was able to solve my issue! So far I’m very impressed w/ the support and feel like I made the best choice choosing Indifferent Broccoli to host my dedicated Valheim server."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "christopher cowan",
          "Nb_Reviews": 1,
          "Date": "2022-06-12T06:01:29.000Z",
          "Titre": "Good affordable server with great customer service.",
          "Contenu": "I have poor internet to begin with so it is hard for me to find lag free servers for my friends and i to play on and with the 2 day free trail figured i'd give them a try and to my surprise there was no lag and when my card wouldn't work on the website they sent me an invoice on paypal and got it taken care of at 10pm my time. so all in all they are a great server host with excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Dirk",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T21:46:39.000Z",
          "Titre": "Very satisfactory",
          "Contenu": "From the first day we, very easily, settup the satisfactory server we had no problems at all. Easy updates, smooth restarts."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Piam Kiarostami",
          "Nb_Reviews": 2,
          "Date": "2022-06-24T05:09:07.000Z",
          "Titre": "The best lightweight sever hosting in…",
          "Contenu": "The best lightweight sever hosting in the business.Always there to answer questions via email and discord.If you are not using them you are paying more for less."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T15:12:54.000Z",
          "Titre": "Super Simple",
          "Contenu": "It was very easy to set up a server and transfer my local save. I ended up keeping a subscription on another account."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Lenny",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T22:39:29.000Z",
          "Titre": "First time paying for a server",
          "Contenu": "After trying to run a 7D2D server on my computer while playing on the same computer, I came to the realization that I needed a different solution. A quick Google search lead me to Indifferent Broccoli. Pleased at the idea of 2 day trial without needing to enter credit card info,  I signed up. Within 3 minutes I got notification the server was up and running. Using the website, I adjusted some settings and restarted the server. Then set out to give the game a test run. I was happy to see the provided link launched the game for me and connected automatically.  Just had to put in the selected password. The game loaded up just as quick as if I was playing solo on my own computer. Ran around for a few minutes and experienced no lag. Next I tested the option to wipe the server. Worked quicker than it estimated.Everything was set for a 2 hour gaming session with a friend who had never played 7D2D before. Got them the link and everything went smoothly. Good time was had and the next day we agreed to continue and to pay the monthly fee. During the process, I received a couple emails asking how I was doing and offering any assistance. They were not forceful or pushy. Very pleasant and polite. Overall, a great experience, would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-11T17:08:47.000Z",
          "Titre": "They are really great my server was…",
          "Contenu": "They are really great my server was down and the looked into it and got it back up the same day and they updated me as soon as they fixed it love it great service."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "Alberto",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T21:46:23.000Z",
          "Titre": "this is my first time renting a PZ…",
          "Contenu": "this is my first time renting a PZ server, it amazed me how fast it was... But it has been a struggle for me to learn hoy to code, your instructions are on point, but im not that \"Coding Saavy\" that said. Fast and simple, would recomend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Potato",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T23:35:24.000Z",
          "Titre": "Server runs great!",
          "Contenu": "Server runs great and support staff are very friendly. Staff member went out of their way to help get my payment through when my bank flagged the purchase as fraud. 10/10 and will look here first for future servers!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Adam Snook",
          "Nb_Reviews": 3,
          "Date": "2022-04-07T13:06:20.000Z",
          "Titre": "Simple and fast setup at a fair price",
          "Contenu": "Incredibly simple to set up a Satisfactory server and it was up and running in no time at all.Very reasonable and fair pricing too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Zalnau",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T22:42:05.000Z",
          "Titre": "Good server hosting",
          "Contenu": "Good server hosting, have had no problems while using it for a Valheim server. Easy setup and could start playing quickly with my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oldham Family Adventures",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T22:14:23.000Z",
          "Titre": "Indifferent Broccoli's support staff is PEOPLE!  Its made of PEOPLE!",
          "Contenu": "Indifferent Broccoli's support staff is truly next level.  They recognized simply through my Discord post that I had no clue what I was doing and offered to assume the burden of transferring my server data from where we had been playing to their hosting service. I had tried other hosts like Shockbyte for my Project Zomboid server before I found Indifferent Broccoli and my Players all suffered for it.  Lag spikes, server crashes and chat-bot customer support.  Cant drive fast or you hit a blackout roadblock! load to many zombies with the Customizable Zombies Mod and you get a slide show. Get booted in one spot only to log back in yards back surrounded by zombies!  That is what my players where willing to put up with so they wouldn't have to start over one more time, to lose any of their progress... All because I an not a good admin and I have not the skills to transfer our game data to another server.  I.B. and their HUMAN support staff took my information directly and transferred all our game data: players, progress, map and mods.  My players where back in the game within TWO HOURS!  All without ever asking for my credit card number.I.B. took care of the computer nerd stuff so I could get back to the gaming nerd stuff!  My players are happy and slaughtering zombies with delight and I still haven't even filled out any billing information! (I'll go do that now!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2021-09-11T00:48:25.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Set up a valheim server for me and a few friends and it couldn’t have been easier. Customer service reached out to make sure everything was going smoothly the very next day. Great team and great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben DeVitto",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T13:34:19.000Z",
          "Titre": "Fantastic Customer service",
          "Contenu": "I was having some really concerning issues with my payment not flagging me as having well, paid, and Indifferent Broccoli got back to me within 10 minutes of me posting that i needed help, he fixed my issue no problem and was all around super pleasant. I've been using his services for a while now and he has never been anything but Excellent in his customer service."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Xbox Gamer",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T13:10:41.000Z",
          "Titre": "Great server to use",
          "Contenu": "Great server to use, staff are awesome at helping. Had very little problems, any that i did face were solved that day. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Ressell",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T07:53:12.000Z",
          "Titre": "Great customer service via discord",
          "Contenu": "Great customer service via discord. Above and beyond on my server move. Highly recommended for your V Rising server!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lime",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T22:24:17.000Z",
          "Titre": "Superb customer service!",
          "Contenu": "By far the fastest customer service help I’ve ever experienced! Incredibly helpful and friendly, my issue was resolved within about 10 minutes of messaging them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SelkieKezia",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T19:31:31.000Z",
          "Titre": "First time hosting a server",
          "Contenu": "First time hosting a server. This service was great, and customer service was very responsive with help on the multiple occasions that I needed it. Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T02:44:51.000Z",
          "Titre": "Great performance and easy setup",
          "Contenu": "Everything was setup in minutes and didn't get any lag. Website is intuitive and professional. Would use again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T21:24:05.000Z",
          "Titre": "Great server",
          "Contenu": "Great serverMy previous server host was rubbish, I am really impressed with this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dorian",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T16:17:38.000Z",
          "Titre": "Great | 7D2D Server",
          "Contenu": "Using 7 days to die server, so far the server runs great, helpful support, and easy setup.  Haven't had any complaints yet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Coc",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T22:19:32.000Z",
          "Titre": "Price and ease of configuration are the…",
          "Contenu": "Price and ease of configuration are the top reasons that I like this hosting service. I will use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T02:22:13.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service! Server up and running quickly and running flawlessly. Admins were very helpful with setting up a server location transfer as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Watson",
          "Nb_Reviews": 1,
          "Date": "2021-11-13T02:44:23.000Z",
          "Titre": "Fantastic",
          "Contenu": "Fantastic, prompt service; does what it says on the tin; no complaints at all. Would recommend again and again!"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Ragai Awad",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T20:29:24.000Z",
          "Titre": "Great service with great price !",
          "Contenu": "I didn't imagine such a service would exist ^^The prices are reasonable and the performance of the servers is great !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T20:09:17.000Z",
          "Titre": "YOU SHOULD SWITCH TOO",
          "Contenu": "I used another service and had constant problems. I switched to indifferent broccoli, and it’s perfect ever since!!"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Sir Luk",
          "Nb_Reviews": 3,
          "Date": "2021-05-11T19:40:39.000Z",
          "Titre": "Best service",
          "Contenu": "Best service , they are very friendly and prompt in requests , and they are always there to help with any questions :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colin",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T14:42:03.000Z",
          "Titre": "So far so good!",
          "Contenu": "I've only used the server for two days but I haven't experienced even the slightest hiccup"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SpoopyShade",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T16:28:20.000Z",
          "Titre": "As close to a one click and go setup…",
          "Contenu": "As close to a one click and go setup and you can get honestly. Fare prices. A few small things here and there that confuse me, but otherwise a very smooth system. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Key Spazz",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T18:36:41.000Z",
          "Titre": "I wish company's were ran like this one…",
          "Contenu": "I wish company's were ran like this one 10/10, plus the support for the service is immaculate."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T00:12:35.000Z",
          "Titre": "Honesty couldn't have been smoother to…",
          "Contenu": "Honesty couldn't have been smoother to set up. Best hosting service i have ever used"
        }
      ]
    }
  ]
}