{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ioffer-movies.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CARL DEPRIMA",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T03:59:12.000Z",
          "Titre": "Very poor video probably taken from a…",
          "Contenu": "Very poor video probably taken from a low quality TV program with a cheap camera or VCR"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T15:49:20.000Z",
          "Titre": "Ordered over a month ago-still haven't…",
          "Contenu": "Ordered over a month ago-still haven't received.  Sellers communication is slow.  Didn't even ship it till almost a month after ordering it-apparently ships from Israel so unsure if it will even play in my DVD player if it arrives."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Alisha",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T23:54:42.000Z",
          "Titre": "Unsure.",
          "Contenu": "First of all, When you pay almost 40 dollars for shipping to get product shipped quicker is a let down.It's been almost a month and i still haven't received the two dvds. All up this cost me 80 dollars which i spent almost more on the shipping! Communication was really bad, no one actually responded to my question about getting a refund on the shipping costs. I definitely won't be buying off this company again. Really really angry.Just hope my package arrives soon as it's for a birthday present which now has to be a very late present."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tina bevan",
          "Nb_Reviews": 92,
          "Date": "2022-11-10T05:35:51.000Z",
          "Titre": "Very upset",
          "Contenu": "What can I say? After being a loyal customer for a long time and always giving top reviews I am sad to say this has changed massively. My most recent orders have had missing episodes, sometimes half a season's worth. For the first time in my life I am being 'ghosted'!! Have emailed etc many times absolutely no response, I thought the company had stopped trading but I see the website is up and running and their are recent reviews so obviously it's just me. What a disgraceful way to treat a loyal customer, one who has spent hundreds if not over a thousand dollars/pounds on this company. Very upset."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "T Law",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T10:26:49.000Z",
          "Titre": "thanx for the opportunity to give my…",
          "Contenu": "thanx for the opportunity to give my feedback. the discs arrived and i happily started to watch the show, however the disc would not play properly the first time, and if i replayed the scene it would play properly (sometimes) the second time. so i cleaned my player, several times to make sure that wasnt the problem, but it continued to happen. i then tried the second disc with varying similarities to the first disc. i am VERY disappointed, especially because how much it cost me. wont do this again. all true."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Christopher Atkinson",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T10:53:42.000Z",
          "Titre": "No Customer Service available",
          "Contenu": "Ordered DVD of Rush on my birthday 25th October and assuming reports of 33 to 45 days for delivery thought that i would receive this before Christmas. NO sign of any delivery and all the site says is that it has been dispatched. Pretty much non existant customer service available. My money has been taken and there would seem to be NO resolution."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kim Drady",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T15:56:56.000Z",
          "Titre": "Didn’t actually get the item that was…",
          "Contenu": "Didn’t actually get the item that was an expensive purchase and nobody from ioffer responded to multiple queries asking where items were. Out over $100 dollars as a result and will never use them again for any purchases"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Salaba",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T01:06:00.000Z",
          "Titre": "Subtitles",
          "Contenu": "My DVD was supposed to have English subtitles. It did, but there were TWO sets of subtitles, one obscuring the other, making it impossible to read them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "George Heinricj=h",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T00:20:50.000Z",
          "Titre": "Purchases did not work",
          "Contenu": "Purchases did not workTried to make purchase 2x -> once physical (copy never turned up), then online (link never worked)Repeated attempts to contact never worked. STAY AWAY!!!!"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Sue",
          "Nb_Reviews": 6,
          "Date": "2023-08-17T03:29:10.000Z",
          "Titre": "They are not honest about anything to…",
          "Contenu": "They are not honest about anything to do with getting my SeriesThe postage is enormous , the cheaper option is nuts as it would take a month to get here I’m not impressed"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Margaret LeGuier",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T12:02:05.000Z",
          "Titre": "I was really happy with the first 4…",
          "Contenu": "I was really happy with the first 4 series of The Repair Shop, but I am utterly disgusted that series 5 and 6 have been mostly made up of episodes that have been recorded in prior series.  I will definitely not be buying from here again nor will I recommend them."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T07:56:38.000Z",
          "Titre": "Pirated movie",
          "Contenu": "I paid \"top dollar\" for a DVD that appeared to be a pirated copy - it was a blank/generic DVD with no label. The movie contained on the disc didn't even have a sub-title file - this is most unusual for a 2015 movie."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ann Oyed",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T06:49:27.000Z",
          "Titre": "Full series? Um. Not even close",
          "Contenu": "AVOID if you really want the full series because you won't get them. Half of season 5 was missing entirely and nine of the fourteen episodes of season 6 were just repeats from other seasons. Easy enough to look up the episode guides to make sure. Not as promised. Don't buy."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "HCCV",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T08:33:22.000Z",
          "Titre": "never again",
          "Contenu": "1. The movie quality is the incredible bad.. I am not kidding..you barely see whats happening..2. Provider is not answering to my complaint3. The shippment was not stamped enough, so I had to post-pay extra"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carole Shebby",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T18:34:14.000Z",
          "Titre": "The cd’s did not load for several…",
          "Contenu": "The cd’s did not load for several minutes, approximately 10 minutes. When we tried to view it the cd kept stopping, and it became impossible to view. We tried many times to get it to work, but eventually gave up. We decided that it was defective."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Mrs L Lucas",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T23:36:20.000Z",
          "Titre": "I was very disappointed with my…",
          "Contenu": "I was very disappointed with my purchase. I ordered a tv series (Red Rock, 3 seasons) the dvds were in envelope sleeves only and without any way of knowing what series or episodes were on the discs. They were not professionally done (i.e. for retail sale) as I was expecting. Would not purchase from this site again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Virginia Sonnier",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T21:38:51.000Z",
          "Titre": "My sister Willa Hoffpauir sent you the…",
          "Contenu": "My sister Willa Hoffpauir sent you the money for Our Son The Matchmaker which was said to be shipped in 24hours. It's been over a month now and nothing was done, you didn't let her know when it would be delivered."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andrée Larocque",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T15:59:13.000Z",
          "Titre": "ZERO STAR actually...",
          "Contenu": "Zero star because the item I ordered was never shipped. I wrote Ioffer twice about it but they never bothered to answer me. However, they certainly did NOT forget to charge it on my credit card. Thieving is the word that come to mind."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Lorraine Lister",
          "Nb_Reviews": 15,
          "Date": "2022-09-15T03:51:36.000Z",
          "Titre": "no reply to message",
          "Contenu": "I sent a message a week ago asking if they could provide a series I was after.No reply received so sent a follow up 5 days later asking when could I expect a reply from them but still no reply?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Diane Louis",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T13:50:46.000Z",
          "Titre": "Good service... right up until they have your money!",
          "Contenu": "Service is good until you make a purchase.  After-sales service is non-existent.  Find another company to deal with unless you are happy to take the risk."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "James Fraser",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T02:46:12.000Z",
          "Titre": "Haven't had order confirmation",
          "Contenu": "Haven't had order confirmation, no notice of where / how my purchase can be downloaded, so maybe start with that."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Linda Barker",
          "Nb_Reviews": 7,
          "Date": "2023-04-18T12:19:49.000Z",
          "Titre": "We’re not proper movies they didn’t…They were pirated copies",
          "Contenu": "We’re not proper movies they didn’t come in cases that just look like pirated copies I was very disappointed with them"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bryan",
          "Nb_Reviews": 24,
          "Date": "2022-11-16T16:21:12.000Z",
          "Titre": "Are you still operating ?",
          "Contenu": "Bought from them before with no issues. Have tried to order again on four occasions but my emails are not responded to.Have they gone out of business ?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 3,
          "Date": "2022-12-21T04:21:54.000Z",
          "Titre": "The 1st series 2 disc",
          "Contenu": "The 1st series 2 disc, started out OK, then it was over ridden with some loud French language and you can hear English in the back ground, company hasn't responded to replacing disc, others are OK"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Ehud Eilon",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T08:55:41.000Z",
          "Titre": "No order and no answers",
          "Contenu": "I've been told my internatonal order was shipped and to expect it in 35-45 days. It's 56 days and there's no sign of it yet. My email query was ignored. If this was not a scam site to begin with, it's really poor costumer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jim Thomson",
          "Nb_Reviews": 20,
          "Date": "2022-07-07T13:53:12.000Z",
          "Titre": "Not what I ordered.",
          "Contenu": "Worried about the integrity of this company. I spent $39 on DVDs that were erroneously advertised. Complained with no response or refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Beran",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T17:05:28.000Z",
          "Titre": "Very unhappy with your service I tried…",
          "Contenu": "Very unhappy with your service I tried reaching out to you several times told you that the link that you sent me does not play very unhappy"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "T T",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T15:06:39.000Z",
          "Titre": "Terrible quality picture clarity",
          "Contenu": "Terrible quality picture clarity, so blurry faces can hardly be made outDVD quit halfway through each episode Will not ever buy dvds off of this sight again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayla Brooke Tate",
          "Nb_Reviews": 3,
          "Date": "2022-08-08T00:40:36.000Z",
          "Titre": "They a fraud the disc do work but the…",
          "Contenu": "They a fraud the disc do work but the covers on the disc are just stickers the discs are burned go on bluray.com most of the movies they sell was never even made on a Blu-ray Disc"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brent Masterton",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T00:01:15.000Z",
          "Titre": "WEB page errors for addred,",
          "Contenu": "WEB page errors for addred,2 months or more on delievery !!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Warren Thompson",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T01:46:23.000Z",
          "Titre": "I received a link to download the…",
          "Contenu": "I received a link to download the series, but the link just leads to a 500 -  Internal server error."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "MtN",
          "Nb_Reviews": 3,
          "Date": "2022-08-10T08:42:42.000Z",
          "Titre": "Incorrect selection of disks were…",
          "Contenu": "Incorrect selection of disks were sent,first 2 disks sent twice, parts 3 and 4 missing."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MISSANNEGODWARD",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T23:33:52.000Z",
          "Titre": "The content wouldn’t download and got…",
          "Contenu": "The content wouldn’t download and got no response from e mail sent. Complete waste of money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebekah Staal",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T18:05:48.000Z",
          "Titre": "5 out of the 16 episodes I could not…",
          "Contenu": "5 out of the 16 episodes I could not watch....4 had no sound and 1 said it couldn't play. I bought the download version on my phone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stuart Johnson",
          "Nb_Reviews": 4,
          "Date": "2022-11-06T18:09:36.000Z",
          "Titre": "Ordered a DVD box set to be sent as a…",
          "Contenu": "Ordered a DVD box set to be sent as a download was never dispatched"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KEVIN WALTH",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T05:31:56.000Z",
          "Titre": "Movies are just copies proportions are…",
          "Contenu": "Movies are just copies proportions are not right"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "RICHARD SMITH",
          "Nb_Reviews": 5,
          "Date": "2022-02-22T15:55:23.000Z",
          "Titre": "Bought a box set and THREE days later…",
          "Contenu": "Bought a box set and THREE days later my order is \"still on hold\" they have not even replied to my THREE Emails either. Their page does NOT allow a live chat or to \"contact them\" I will NOT buy anything from these again and I am now going to DEMAND they cancel my order, crap company and no communication so BEWARE OF THESE PEOPLE !!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T01:00:12.000Z",
          "Titre": "not helpfull service will not shop again"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Diane Louis",
          "Nb_Reviews": 8,
          "Date": "2022-01-11T12:38:48.000Z",
          "Titre": "Appalling after-sales service",
          "Contenu": "Appalling after-sales service.  Answered my questions readily enough prior to purchase, but once I had purchased (and they had my money), and had a problem with some of the products I had bought, not a word from anyone despite my many requests for assistance.  Will never use again and would not recommend.  Only wish negative star rating was possible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2021-10-13T22:34:15.000Z",
          "Titre": "Hard to contact i-offer directly",
          "Contenu": "Well, impossible, actually. Everything I did sent me to 'trustpilot' and I never found a path to i-offer. The items offered said to look at reviews - no options; ask question - no options; check vendor - no options. The series I did buy came OK and scanned to be working so everything good there but I consider myself lucky as I could not access the vendor directly.VERY, very frustrating - I didn't want to deal with trustpilot, I wanted to reach i-offer but found no way to do that.Maybe i-offer could show me the way ?????"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leah",
          "Nb_Reviews": 17,
          "Date": "2021-07-22T08:08:35.000Z",
          "Titre": "Great dvds but poor response to problems",
          "Contenu": "Great dvds but poor response to problemsPaid $80 for Les petits meurtres d'Agatha Christie seasons 1, 2, 3, 4, 5, 6 and 7. Received incorrect order 7 weeks later. Did not receive Season 2 - received season 4 twice incorrectly labelled as both season 2 and 4. Messaged seller to resolve. No response from seller."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "DEREK BEE",
          "Nb_Reviews": 4,
          "Date": "2021-08-02T05:49:03.000Z",
          "Titre": "Three times I attempted to contact…",
          "Contenu": "Three times I attempted to contact i-offer re; item received not as stated on the i-offer site, sadly no reply from i-offer!  Most companies do have the decency to acknowledge their customers complaints and queries, but alas it seems that once they have got your money,i-offer 'switches off ' !!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ronald  Pace",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T13:45:42.000Z",
          "Titre": "i been waiting a very long time for my…",
          "Contenu": "i been waiting a very long time for my order spouse to only take 3 days sent a email didn't get a reply all most 2 weeks later saying ill have the link in 24 hrs. and here it is 2 more weeks gone by lest say almost a month now wait on a link that was to be there to download in 2 to 5 days not very happy with the server and the relies that ended up that they didn't keep there word"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2022-01-05T11:15:25.000Z",
          "Titre": "Still waiting for my dvd I ordered back…",
          "Contenu": "Still waiting for my dvd I ordered back in November, was meant to have arrived 28th December - 2nd January but hasn’t arrived, so frustrating as don’t understand why it’s taking so long, I ordered a dvd from New Zealand and that was here within two weeks"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "gilles keromnes",
          "Nb_Reviews": 1,
          "Date": "2020-10-14T20:10:32.000Z",
          "Titre": "I ordered \"Spring Tide\" season 2",
          "Contenu": "I ordered \"Spring Tide\" season 2 : I received my order BUT it is a COPY, it is not the original. I thought I would receive the original DVD and I am disappointed. I just tried to watch the DVD on my computer with VLC app and it says the DVD is empty :there is nothing to see ! Can I please send the DVD back to you ? Thanks foryyour answer. Gilles Keromnes (France)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janet Bloom",
          "Nb_Reviews": 6,
          "Date": "2022-09-16T14:58:54.000Z",
          "Titre": "My order has never arrived!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Bartlett",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T17:53:22.000Z",
          "Titre": "Awful company to buy from not interested in customer care.",
          "Contenu": "Awful company to buy from they are really slow getting back in touch.I have a problem with my order and they do not seem to be helping me at all if I knew how bad their customer service was I would have not purchased from them.Your dvd can come from anywhere in the world mine was from Israel.The subtitles are faulty just like their customer service experiences.Not interested in customer care I will have to take my complaint up with my bank as the company is doing nothing to rectify my concerns."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Guthrie",
          "Nb_Reviews": 3,
          "Date": "2021-06-09T23:48:33.000Z",
          "Titre": "I ordered three (3) DVDs of season 1 of…",
          "Contenu": "I ordered three (3) DVDs of season 1 of The Kids Are Alright, but I never received them. And on top of that, season 2 of The Kids Are Alright DVDs are always sold out. I got in touch with WABC NY TV to try to obtain DVDs of season 1 and 2 of The Kids Are Alright, but I never heard from them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Hay",
          "Nb_Reviews": 8,
          "Date": "2020-05-14T14:51:58.000Z",
          "Titre": "Ordered my 2 items on the 30th March…not arrived 14th may",
          "Contenu": "Ordered my 2 items on the 30th March extreme makeover home edition and wahlburgers but after 45 days still no items seller contacted me once and said took a bit longer to prepare and will be with me shortly fit after another 15 days no items email again no reply after 14 days and emailed again and at the moment still no reply will have to contact PayPal to get my money back first time buyer will not use again not a safe site"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Katelyn",
          "Nb_Reviews": 2,
          "Date": "2020-05-31T18:04:40.000Z",
          "Titre": "Order#10884",
          "Contenu": "Order#10884Writing a second review regarding this contact due to the extreme lack of service received for this vendor. I was informed that my order for dispatched and was shipped however I pay for a download link as this was the better option. I sent a follow up email and no reply in 2 weeks. Find this service shocking will not be ordering from them again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edwin Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T08:00:14.000Z",
          "Titre": "I taught I was buying 4 seasons as…",
          "Contenu": "I taught I was buying 4 seasons as stated. Instead I only got 10 episodes on 4 DVD'S. If I had know it was 10 episodes I would not have paid that much. I was disappointed because most seasons usually have anywhere from 15 to 25 episodes. I probably will not buy from you again..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mark F",
          "Nb_Reviews": 6,
          "Date": "2020-05-29T06:44:23.000Z",
          "Titre": "Order #10276",
          "Contenu": "Order #10276I am really disappointed with the service of this online seller. I ordered a music DVD on 13th April and received a text message the following day advising delivery will take 13-16 days. I have heard nothing since.I have submitted enquiry emails on the iOffer Movies website and two texts but still no reply. Crap service for an online seller."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "thomi wroblewski",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T16:34:36.000Z",
          "Titre": "I purchased a set of dvds  Wallander",
          "Contenu": "I purchased a set of dvds  Wallander - Rolf Lassgard and paid for them  - - -  they have NOT ARRIVED  and the site has not answered except to say they were shipped in mid June.   I AM PATIENT - BUT ITS AUGUST 12TH  - THEY HAVE NOT ARRIVED = and being asked if i could download the titles or get a refund  =  THEY HAVE NOT REPLIED"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Robin Barker",
          "Nb_Reviews": 1,
          "Date": "2020-06-27T06:16:26.000Z",
          "Titre": "Pathetic",
          "Contenu": "Similarly to others here I ordered and paid for Baron Noir Seasons 1 and 2 with English Subtitles in April, which haven't arrived.Ioffer is impossible to communicate with. No contact info works.I understand Covid is causing problems and would be prepared to wait, however, the company doesn't seem to be able to respond to queries or at least notify customers of delays. Pretty poor. No wonder the despised Amazon does so well. Never any problems with them, Covid or no Covid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ellya Jeffries",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T15:16:48.000Z",
          "Titre": "It is July 13 and I submitted my order…",
          "Contenu": "It is July 13 and I submitted my order on May 29th...+28 days of waiting. No shipping confirmation number either.  Please respond in the next 48 hours otherwise I will have to dispute the charges made with my credit card company .  Please please let me know what is going on.  I've emailed 2x already."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gary Machen",
          "Nb_Reviews": 6,
          "Date": "2022-11-17T00:52:49.000Z",
          "Titre": "Really bad copy could have just gone on…",
          "Contenu": "Really bad copy could have just gone on YouTube"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Thomas bartlett",
          "Nb_Reviews": 9,
          "Date": "2021-04-15T18:26:03.000Z",
          "Titre": "The dvd is faulty.",
          "Contenu": "The dvd is faulty and the company does not want to know or do anything about it.I have messaged them and they have not got back to me so I am left with a faulty item and twenty six lines out of pocket I would not recommend this company in any way very poor service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don B.",
          "Nb_Reviews": 3,
          "Date": "2021-06-16T22:38:56.000Z",
          "Titre": "Never received order.",
          "Contenu": "The basics, I never received the set I ordered.  It has been well past the longest due date by over 2 months.  Even worse, when I have contacted Ioffer Movies about this (multiple times), there has been no reply.And this is a shame since I have been happy with orders in the past both the quality of what I received and in the shipping time.  I can understand things getting lost in the mail, especially when it is international, but the complete lack of any response to my inquiries is not understandable.  It would take a miracle for me to order from them again, or to recommend that anyone else does."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Ann Roberto",
          "Nb_Reviews": 2,
          "Date": "2020-05-25T04:49:45.000Z",
          "Titre": "Two attempts to rectify incorrect order…",
          "Contenu": "Two attempts to rectify incorrect order have failed  Ordered Hudson & Rex season 2 received season 1 instead  contacted  iOffer and received email saying that I would receive my correct order.  HOWEVER I again received season 1    PLEASE PASS THIS ON TO SOMEONE WHO CAN HELP Mary Ann Roberto"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Leah",
          "Nb_Reviews": 17,
          "Date": "2020-07-08T09:17:30.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Paid $80 for Les petits meurtres d'Agatha Christie seasons 1, 2, 3, 4, 5, 6 and 7. Received incorrect order  7 weeks later. Did not receive Season 2 - received season 4 twice incorrectly labelled as both season 2 and 4. Messaged seller to resolve. No response from seller."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "CArol Scantlebury",
          "Nb_Reviews": 1,
          "Date": "2020-07-13T22:39:54.000Z",
          "Titre": "I paid $150.00 and waited",
          "Contenu": "I paid $150.00 and waited  3 months for my order ..got this package from Israel of all places opened it up expecting brand new disc set. To my surprise I had burnt copies. Highly illegal wouldn't you say. I will be taking this further. This is an illegal scam."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Geoff KINKADE",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T00:45:33.000Z",
          "Titre": "Ordered Wisting DVD series",
          "Contenu": "Ordered Wisting DVD series. Took over three weeks to arrive. First episode played well, second episode pixilated then froze ten minutes from the end and third episode resulted in the disc error message before the machine(s) spat the dvd out.Waste of time and money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jane Mallen",
          "Nb_Reviews": 2,
          "Date": "2022-04-03T20:56:56.000Z",
          "Titre": "I ordered the 4 seasons of Not The 9…",
          "Contenu": "I ordered the 4 seasons of Not The 9 O’Clock News. The first disc was really poor quality, we couldn’t watch it, the background noise was terrible and the picture quality was awful. Discs 2 & 3 were just about watchable. Disc 4 was supposed to be series 4 but it was actually a compilation of the first 3 discs so series 4 was missing. I did contact ioffer and was advised that the series was recorded in 1978 and has never been remastered but that ioffer strive to get the best copy they can. If this was the best copy it shouldn’t have been sold. I don’t like leaving bad reviews but this purchase was a complete waste of money and I’m very disappointed. I understand that old recordings are difficult to copy but at the moment there are better quality videos of the same show on YouTube."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maureen Frazier",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T16:54:16.000Z",
          "Titre": "I ordered $92.00 worth of DVDs on March…",
          "Contenu": "I ordered $92.00 worth of DVDs on March 31st.  5 weeks later the order arrived, but was missing 2 episodes.  Multiple e-mails back and forth have failed to get those episodes, which were already paid for, sent to me.  On May 3rd, I ordered $62.00 worth of DVDs.  Now nearly 6 0r 7 weeks later I have not seen or heard a thing from this company about these DVDs which were already paid for.  They have not responded to my emails asking where the merchandise is.  Needless to say, I will not be using this company, Ioffer Movies, ever again.  I believe they are simply defrauding the public and should be ashamed of themselves."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Roberts",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T03:38:21.000Z",
          "Titre": "I was happy this company offered a…",
          "Contenu": "I was happy this company offered a ‘hard to find’ foreign video but it has yet to arrive.  Ordered well over 5 -6 weeks ago.  So disappointed as it was a birthday gift for my daughter. I would either like the item I ordered or my money back."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Wayne Perry",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T06:31:20.000Z",
          "Titre": "Don't bother.",
          "Contenu": "After 10 weeks and 3 emails with no a response, my Firefight Australia 2020 DVD finally arrived.The picture quality was very poor and continually froze.     Consequently it was unwatchable and went out with the garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Sigurdsson",
          "Nb_Reviews": 2,
          "Date": "2020-12-02T16:56:26.000Z",
          "Titre": "pretty bad",
          "Contenu": "it’s a slow system.  the subtitles are most of the time bad. also l didn’t get all the episodes from one of the series that l ordered. all over, the page is pretty bad. searching options are horrible."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "CeeBee",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T20:02:53.000Z",
          "Titre": "Where's my order?",
          "Contenu": "I'd love to give a better review, however, since I placed and paid for my order on May 9, 2020 and still have not received it as of today, June 15, 2020, Ioffer Movies is getting a bad review from me."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Lesley Seymour",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T21:24:45.000Z",
          "Titre": "I couldn’t be more unhappy with your…",
          "Contenu": "I couldn’t be more unhappy with your service I have emailed you a few times to tell I have NOT received my movie with no reply however this is the second time you have asked for a review please contact me"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2020-08-08T19:38:44.000Z",
          "Titre": "Undelivered.",
          "Contenu": "I've been invited to review a DVD which has not (yet) been delivered to me. Couriers give feedback to shippers, so how has this happened?And where is the DVD I ordered many weeks ago?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Mears",
          "Nb_Reviews": 1,
          "Date": "2021-03-02T00:19:21.000Z",
          "Titre": "Shambles...",
          "Contenu": "Shambles.... emailed seller after problem with download 15 times no reply.  More than happy to remove this review if I get item I paid for. Next step reporting credit card failure"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Derek Stuart-Clark",
          "Nb_Reviews": 4,
          "Date": "2020-07-15T17:15:47.000Z",
          "Titre": "Very poor service",
          "Contenu": "I received your invitation to review last week but, as I hadn't received my order, did as you suggested and waited till I had. A week on and I still haven't received it. I bought my purchase on 3rd June, it was shipped a week later and I was told to allow, initially, a couple of weeks, then, a month. After a month of hearing nothing, I asked Ioffer to look into where my parcel had gone: I heard nothing. I emailed again a week later: still I heard nothing. Not only have I not received my purchase, I have had no apology, nor has anyone made any effort to contact me. Maybe if this awful review is read, it might prompt some action. I just want my purchase or my money back. I can't advise possible customers, but I shall certainly not be dealing with Ioffer ever again."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T00:52:57.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "Items did not arrive within the required timeframe and when they did come, they are not even genuine DVD's. They are a copied discs in paper sleeves......lesson learned, buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "ANGELES",
          "Nb_Reviews": 3,
          "Date": "2022-11-08T09:19:05.000Z",
          "Titre": "Undelivered",
          "Contenu": "I haven t received movie after 35 days"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sophie Blackmore",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T06:39:29.000Z",
          "Titre": "Don't buy anything from this site. It is a scam",
          "Contenu": "I ordered a movie on May 29, 2020. There is no sign of it or any contact from iOffer Movies. I have just read a whole bag of reviewers saying the same thing...Save your money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Roth",
          "Nb_Reviews": 1,
          "Date": "2020-05-12T20:53:47.000Z",
          "Titre": "Disappointed",
          "Contenu": "Bought a French DVD set (Spiral) supposedly with English subtitles but the subtitles were largely incomprehensible ... suspect the French was translated into English by a bot"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Erwin Huls",
          "Nb_Reviews": 20,
          "Date": "2020-06-08T15:55:18.000Z",
          "Titre": "Double payment",
          "Contenu": "I am still waiting for a refund from my Creditcard society.this company has debited $57 from my account twice! That's why i contact my bank to get the money back"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Neil",
          "Nb_Reviews": 4,
          "Date": "2020-12-23T23:07:43.000Z",
          "Titre": "This is a scam",
          "Contenu": "This is a scam. I have paid and the money has gone through. There is no download on the site for me to use. I have contacted the site, but have received no reply."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Josephine Chuks",
          "Nb_Reviews": 2,
          "Date": "2020-11-19T06:11:02.000Z",
          "Titre": "Awful experience they took my money and…",
          "Contenu": "Awful experience they took my money and didn't give me what I paid for, after several email complaints I never heard from them again.  Do not use this website."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bobby Jay",
          "Nb_Reviews": 1,
          "Date": "2021-03-26T07:40:08.000Z",
          "Titre": "So disappointed",
          "Contenu": "So disappointed. Placed an order in January. Emailed a couple of times to follow up. Nothing! Paid my money but never received anything. What can you say?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary Hammersley",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T12:55:07.000Z",
          "Titre": "You sent the first video of season 4…",
          "Contenu": "You sent the first video of season 4 the last two videos were from Sean 3 very disappointing. Will never get another product from your web site"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Mario",
          "Nb_Reviews": 4,
          "Date": "2022-01-08T06:35:50.000Z",
          "Titre": "I payed for the dvd more then a month…",
          "Contenu": "I payed for the dvd more then a month ago,but I DID NOT RECEIVE IT. Terrible,they ARE NOT reliable and they are not replying to emails."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "MaggieEss",
          "Nb_Reviews": 1,
          "Date": "2020-06-20T05:01:46.000Z",
          "Titre": "This is the worst company I have ever…",
          "Contenu": "This is the worst company I have ever dealt with.  Ordered DVD 25th March, still hasn't arrived, no replies to numerous emails.  Will never use them again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Bentley",
          "Nb_Reviews": 2,
          "Date": "2021-02-10T20:33:11.000Z",
          "Titre": "Purchased a digital download of Wiseguy…",
          "Contenu": "Purchased a digital download of Wiseguy TV series and have not received a viable download link. Have not been able to get new details from iOffer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "philip steffensen",
          "Nb_Reviews": 4,
          "Date": "2020-07-28T10:12:23.000Z",
          "Titre": "poor standard of order supply",
          "Contenu": "it took 20 days just to get my order of dvds and was told it will take 28 days to arrive and iam still waiting . i will not use this company again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Melton",
          "Nb_Reviews": 2,
          "Date": "2019-09-02T17:51:55.000Z",
          "Titre": "The guaility",
          "Contenu": "The guaility of what I got was not good I don't know if all of the movies are like that or not but I don't know if I will order from them agin"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Irene",
          "Nb_Reviews": 10,
          "Date": "2022-01-15T14:17:19.000Z",
          "Titre": "My order is missing one disc..Still…",
          "Contenu": "My order is missing one disc..Still trying to get them to fulfill my order.. The disc value is pence .. Yet still I wait.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "2nd.A",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T12:57:47.000Z",
          "Titre": "Ordered over a month ago",
          "Contenu": "Ordered over a month ago, just received it.  Obviously a bootleg copy.  plain case, plain disc.  Only an address label on disc to tell the name."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Warren Stolmack",
          "Nb_Reviews": 3,
          "Date": "2020-08-13T01:23:34.000Z",
          "Titre": "No show",
          "Contenu": "Still waiting for my order to arrive ! Several emails have not given any response.Two months overdue is just too much. Not a word from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ann Wothers",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T13:17:13.000Z",
          "Titre": "My 3 sons",
          "Contenu": "The one season with Barbra gives dinner party it called table for 8 does not play it like someone take beginning of cd on top of it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis McGrath",
          "Nb_Reviews": 1,
          "Date": "2020-10-04T23:51:28.000Z",
          "Titre": "I ordered season 2 of Hudson and Rex",
          "Contenu": "I ordered season 2 of Hudson and Rex, and was billed, but never received my DVDs.  Billing date was 6 Sep 2020.  Please reply.  Thank you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shelley Arrowwood",
          "Nb_Reviews": 1,
          "Date": "2020-07-11T18:44:47.000Z",
          "Titre": "It's been 6 weeks and the DVD has not…",
          "Contenu": "It's been 6 weeks and the DVD has not arrived!!! I emailed asking about the order and no response. Guess I've been ripped off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven McCarthy",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T23:04:18.000Z",
          "Titre": "They want my review never received order",
          "Contenu": "They want my review but it's 60 days since they supposedly shipped my order. Still have not received the order."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "RJ",
          "Nb_Reviews": 2,
          "Date": "2021-11-19T22:31:10.000Z",
          "Titre": "I placed my order in January",
          "Contenu": "I placed my order in January. It’s now November. I have emailed regularly but no response. It’s all a real con."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Katie Cox",
          "Nb_Reviews": 2,
          "Date": "2020-07-08T11:22:49.000Z",
          "Titre": "Ignored 2 emails I sent them and still…",
          "Contenu": "Ignored 2 emails I sent them and still have not receive my item. Overpriced. I believe it’s a scam site. Will never use again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T19:30:40.000Z",
          "Titre": "The DVDs arrived and the video and sync…",
          "Contenu": "The DVDs arrived and the video and sync are way off. Still waiting on a reply from their customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LEE POTTER",
          "Nb_Reviews": 2,
          "Date": "2021-11-09T16:30:08.000Z",
          "Titre": "It has been 10 weeks since purchase",
          "Contenu": "It has been 10 weeks since purchase. Have not received anything. They will not respond to emails. Scammers."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "SM",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T21:22:44.000Z",
          "Titre": "I ordered a DVD and my credit card was…",
          "Contenu": "I ordered a DVD and my credit card was hacked - awesome!Now I am without a card during the corona virus - what low lifes!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas Bench",
          "Nb_Reviews": 2,
          "Date": "2020-11-03T01:26:46.000Z",
          "Titre": "I returned the DVDs as illegal copies",
          "Contenu": "I returned the DVDs as illegal copies. I received no response from my email response or credit for returned product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T20:08:54.000Z",
          "Titre": "Haven’t received order",
          "Contenu": "I haven’t received my order from over a month ago and no one is getting back to me about the shipping information."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Rachel Quarrell",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T04:31:55.000Z",
          "Titre": "The Two Of Us Starring Nicholas Lyndhurst",
          "Contenu": "Don't buy the Two of Us,the picture quality is awful and the same with the sound quality.At the start of each episode you will get a couple of minutes of whatever show was before followed by voice over saying\"You are watching Granada Plus\"."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Beth Acheson",
          "Nb_Reviews": 8,
          "Date": "2022-12-12T17:08:10.000Z",
          "Titre": "Problem with visuals",
          "Contenu": "Unfortunately, there was a time stamp running throughout like a countdown. On the first DVD it was at the top of the screen and I got used to it! On the second, however, it was on both the top and bottom and the DVD was very hard to watch as a result. The quality was terrible, as bad as on YouTube."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mavis DICKERSON",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T14:55:48.000Z",
          "Titre": "I RECEIVED THE WRONG MOVIE AND HAVE NOT…",
          "Contenu": "I RECEIVED THE WRONG MOVIE AND HAVE NOT  BEEN MAILED THE CORRECT MOVIE YET"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Bryan Perras",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T07:17:34.000Z",
          "Titre": "Only if you're desperate.",
          "Contenu": "I bought a TV series.  It was the entire series of a show.  The quality I'd rate at 3/5.  All of the episodes were mislabelledand out of order and some episodes were included twice.  One episode was missing entirely and 2 episodes had the video squished on the horizontal.  I emailed them regarding all of this and got no response.  That said, it was the only place I found that offered this series."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dismayed",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T15:37:35.000Z",
          "Titre": "A failiure",
          "Contenu": "I was surprised to see that someone had the \"bits\" for such an old and obscure show. I have acquired several shows from the same era recently (Tales of the Gold Monkey, Vega$, etc.) from various sources, and all were professionally boxed and the media was top quality. Admittedly, shows were much lower resolution that current HD/4K/8K fare that we have gotten used to. However, from what I can tell, the discs were burned rather carelessly and are positively unwatchable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher Serio",
          "Nb_Reviews": 1,
          "Date": "2021-11-07T15:45:43.000Z",
          "Titre": "I honestly don't scrutinize product…",
          "Contenu": "I honestly don't scrutinize product descriptions as well as I probably should. Having said that:This item came as unmarked, unlabeled discs that appear to be copies made on a computer.  CDROM maybe? Certainly not retail quality dvd. Haven't even tried them yet because I'm 90% sure they're  crappfukkingolla and I've been ripped off.  If they work. I'll be surprised.... and somewhat apologetic.  But there won't be any excuse for the lack of packaging and amateurish final product"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Alan Place",
          "Nb_Reviews": 3,
          "Date": "2020-06-24T09:35:31.000Z",
          "Titre": "A change of opinion",
          "Contenu": "I am updating my evaluation because I ordered Major Dad nearly two months ago, and despite taking my money there is no sign of the goods and no reply to my emails.I also ordered two more series (La Zona/ Non Uccidere) and there is again no news of what/if anything is happening.The same thing has happened with a friend I recommended the site to in Sweden."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mrs Coates",
          "Nb_Reviews": 20,
          "Date": "2020-11-01T20:50:10.000Z",
          "Titre": "How is this even legal?",
          "Contenu": "Received my order after quite a wait but I’m very disappointed. They have clearly been filmed off a tv as they show an old SKY logo. The picture quality is poor - even for an old 70s series and they are certainly not worth the £26 I paid. Were intended as a gift but I would be embarrassed to give them. To be fair, having read other reviews I wasn’t expecting a reply to my email but I have had one and been offered an alternative title. Still not sure how this is legal so don’t think I will use in the future."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Julie McKay",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T00:13:07.000Z",
          "Titre": "Missing Episodes not happy",
          "Contenu": "I received my dvds safely but when I checked not all episodes that I purchased were sent.  Only received 106 episodes out of 130 that I paid for. The seller does not respond back to any emails to fix the matter.Probably will not buy from again.Very disheartened and not happy to pay for something and not received."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Claude Jalbert",
          "Nb_Reviews": 1,
          "Date": "2020-05-10T12:38:23.000Z",
          "Titre": "Not very satisfied",
          "Contenu": "It took almost a month to get my download link. The series is not complete. Only 12 out of 15 episodes. In addition, episode 4 is missing. I was planning to order the whole series, but I'm going to change my mind. Like I said, season 1 suppose to you 15 episodes like you can see on watchonline guide."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Erwin Huls",
          "Nb_Reviews": 20,
          "Date": "2020-05-28T19:31:40.000Z",
          "Titre": "Paid twice and Taxes costs",
          "Contenu": "Hello,I ordered a music DVD a 8 hours concert for $ 18, it's now been shipped on May 11th and i paid totally $ 57 for fast delivery with UPS Now it's been 2 times $ 57 written off my credit card  while I ordered 1 time, but now i see i must payt again Euro 20,35 for taxes costs!so totally i have payt $ 134,35 for one dvd from $18This is not good, i hope you refund me the money and taxes costs.Update:  i have now contact my bank and hope they are refund me the $57 back on my creditcard, i waiting now for it..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jena Hayes",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T03:45:17.000Z",
          "Titre": "They tried...",
          "Contenu": "I received 2 seasons of my favorite show but when I sat down to watch them some of the episodes were cut short and some were missing. Two episodes were recorded twice making them out of order. After contacting customer service, they were nice enough to send a replacement disc of the episodes that were missing or messed up but now when I go to binge watch, it’s a huge pain not having them in order and have to change out the DVD’s and figure out where I left off. Would have preferred to just have a whole new set sent with everything corrected so I can just sit back and enjoy it. Not sure I will order again..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Kohl",
          "Nb_Reviews": 4,
          "Date": "2021-01-05T22:14:02.000Z",
          "Titre": "Incomplete delivery",
          "Contenu": "Anthony Kohl301 North 3rd StEmmaus, PA 18049Order # 22222Total cost $145.00I received two earlier emails from you - 12/7 telling me my order was received, 12/8 telling me it had  been shipped. I received my order Mon 1/4/2021, but two of the items I ordered and paid for (and that were listed in your emails) were not received: Masterchef Australia Professionals 2013 and Celebrity Masterchef UK Series 9.Also, you sent one set that I did not order:Masterchef UK Professionals Series 1.I am hoping that this matter will be rectified and that the missing (and paid for) items will be sent ASAP.In the mean time, I will keep the unordered item as a consolation."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patricia Brady",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T18:51:47.000Z",
          "Titre": "I’m sorry to say that the quality of…",
          "Contenu": "I’m sorry to say that the quality of the DVD was wanting...the picture was not sharp and neither was the sound.  you could make the package more attractive by putting a picture on the cover.  No more purchases from me!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leon Thurston",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T16:21:15.000Z",
          "Titre": "I really liked the movie",
          "Contenu": "I watched this movie on youtube, I really liked the movie, but did not like viewing this movie watching the actors looking short and fat. Somehow when this movie was recorded it came out bad! That's why I only gave a two stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christina Kozlowski",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T22:50:28.000Z",
          "Titre": "I was supposed to receive all 5 seasons…",
          "Contenu": "I was supposed to receive all 5 seasons of Bill Nye the Science Guy, but I only received season 1.  I emailed customer service twice about this, but I never received a reply."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T18:17:32.000Z",
          "Titre": "Some of the videos were missing the…",
          "Contenu": "Some of the videos were missing the beginning or the ending. I emailed you with a request to resend the specific episodes but never got a response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mi6",
          "Nb_Reviews": 2,
          "Date": "2021-05-08T01:15:46.000Z",
          "Titre": "The disc appeared to be a generic copy…",
          "Contenu": "The disc appeared to be a generic copy and not originals.  The dvd disc came in a sleeve, and not in a jewel case, with no printed materials."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Nick Siaflas",
          "Nb_Reviews": 2,
          "Date": "2021-01-13T09:13:22.000Z",
          "Titre": "I've still not received my movies that…",
          "Contenu": "I've still not received my movies that i ordered.Not sure if its due to covid or its been delivered to the wrong address."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chelsey Getty",
          "Nb_Reviews": 2,
          "Date": "2020-06-08T18:21:10.000Z",
          "Titre": "I still have yet to receive and email…",
          "Contenu": "I still have yet to receive and email back regarding my order. It has been almost 2 weeks and after multiple emails still nothing"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Heath Romine",
          "Nb_Reviews": 1,
          "Date": "2021-10-04T16:41:56.000Z",
          "Titre": "Several of the discs would lock up…",
          "Contenu": "Several of the discs would lock up forcing me to fast forward and miss several minutes of the episode."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashley Fithian",
          "Nb_Reviews": 1,
          "Date": "2020-04-11T21:51:14.000Z",
          "Titre": "Cut scenes",
          "Contenu": "There are subtitles on half the discs, and some scenes are cut out from the show on the discs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marilyn Fitts",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T18:06:57.000Z",
          "Titre": "the picture is to small and not clear…",
          "Contenu": "the picture is to small and not clear very disappointed waited a while to receive them"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Gregory Pretty",
          "Nb_Reviews": 3,
          "Date": "2020-10-11T20:02:19.000Z",
          "Titre": "Poor service have not recieved any…",
          "Contenu": "Poor service have not recieved any movies been long time waiting"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Gregory Pretty",
          "Nb_Reviews": 3,
          "Date": "2020-09-09T02:23:24.000Z",
          "Titre": "Poor",
          "Contenu": "to long to wait  over month still waiting"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Leona Swanson",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T04:47:34.000Z",
          "Titre": "Didn't like how some of the episodes…",
          "Contenu": "Didn't like how some of the episodes are missing in season 1 episode 9 and season 6 episodes 4,8,9."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Richard Healey",
          "Nb_Reviews": 4,
          "Date": "2023-07-30T11:28:14.000Z",
          "Titre": "Early 1970's Australian series \"Bony\".",
          "Contenu": "I ordered the Bony series'. (an old Australian detective series), which is incredibly difficult to find and it arrived as described. However, the video and audio quality of the each episodes is very poor and detracts greatly from viewing pleasure - but, better than nothing!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathryn",
          "Nb_Reviews": 4,
          "Date": "2022-07-10T17:30:40.000Z",
          "Titre": "Season 1 of Professor T…",
          "Contenu": "I received Season 1 of Professor T (original Belgium DVD) sooner than expected.  I was looking forward to viewing it and did play all discs.There was one problem.  Three episodes would freeze and then skip.  Unfortunately, the one most damaged was \"The Trial\". I never got to see the final outcome. The others were fine.  Thank you for asking."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristine Klaiber",
          "Nb_Reviews": 3,
          "Date": "2023-05-22T16:38:49.000Z",
          "Titre": "Usually the dvds are fine but we have…",
          "Contenu": "Usually the dvds are fine but we have had several damaged ones (season 19 of Silent Witness). The prices are great and have been able to get some hard to find dvds, like Dr. Finley. I was not able to get in touch with anyone to return damaged ones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Hyman",
          "Nb_Reviews": 8,
          "Date": "2023-05-05T16:27:20.000Z",
          "Titre": "Unfortunately...",
          "Contenu": "Unfortunately, my copy fails to correctly render the audio track, especially during the latter half of the series. There was also image distortion or break-up throughout. I recognize it's a very old series and didn't expect a high resolution, but the interruptions are annoying. Nice to remember this underrated series, though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emily N",
          "Nb_Reviews": 5,
          "Date": "2022-12-20T10:02:05.000Z",
          "Titre": "Include \"disc 1 of 4, 2 of 4, etc\" to show how many discs in season, etc = helpful. Blurry but watchable. Random subtitles?",
          "Contenu": "I wish you'd write/include on your disc labels (this is poor example) \"survivor season 99, DISC 1 OF 4\"Emphasis on the: \"OF 4\" !That'd really help! Makes sense too. It would be nice to know & have that clarity that, \"oh, I see - this season has 2 discs, because label included \"DISC 2 OF 2\" etc.Would love for that to be standard.The images for all discs/shows were a bit blurry, otherwise okay.I noticed in an episode (maybe more?) that subtitles showed up on the screen randomly. Which is fine but would want them on OR off not out of the blue/random or sporadic."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Lorraine Lister",
          "Nb_Reviews": 15,
          "Date": "2022-07-20T22:02:31.000Z",
          "Titre": "Contacting IOffer",
          "Contenu": "Usually quick responses but this time I have sent 3 messages to IOffer but have not received any replies."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry Moody",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T12:29:33.000Z",
          "Titre": "I want Aquavino Nora from Queens season…",
          "Contenu": "I want Aquavino Nora from Queens season one and two and three if there is one big Freedia queen of bounce season one and two season one and two is most important And then three and four all one deal one package  One order I am still waiting haven’t heard anything back how long will it take you to make it"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Anthony Martinuzzo",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T00:07:41.000Z",
          "Titre": "No provision to call you directly on…",
          "Contenu": "No provision to call you directly on the telephone to discuss issues with the purchase"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Patricia Pratt",
          "Nb_Reviews": 8,
          "Date": "2022-08-05T12:58:02.000Z",
          "Titre": "Very quick service",
          "Contenu": "Very quick service. But poor communication as they don't reply to emails."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Brian Hansen",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T23:42:37.000Z",
          "Titre": "Great Service, Poor Resolution",
          "Contenu": "Your company did a wonderful job of sending this series, and thank you for the pocket calendar, my wife loves it.My issue is with the resolution quality.  The reason I ordered these DVDs was to get a better visual than what YouTube was providing, and it was essentially the same; I can pick through the story but it looks like I don't have my glasses on while watching the series.Thanks for taking time on getting my feedback!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sandra Porter",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T20:22:48.000Z",
          "Titre": "DVDs are great but i was charged twice by mistake",
          "Contenu": "We did receive the dvds and they worked perfectly. They were a gift for my parents and they were elated. However I emailed twice to your company to explain I had a problem with the order:  my order went through TWICE, once for actual DVDs and once for the download.  I asked for a refund on the download charge of $16USD. My request has been ignored and that is very unprofessional. I do have the receipt and can see the two charges on my credit card. I would appreciate a response to my request and a refund."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "pogo4prez",
          "Nb_Reviews": 1,
          "Date": "2020-07-11T20:45:14.000Z",
          "Titre": "Could have been quicker",
          "Contenu": "Insufficient communication with me after my order -- I needed to send an email prod asking about it after a while -- and the download link (my chosen delivery option) was set up a lot later than I thought it needed to be.  But when it finally showed up the email with the link was suitably apologetic, showing awareness that things could have moved a little faster.  And I couldn't find the show anywhere else."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Michael Kenny",
          "Nb_Reviews": 7,
          "Date": "2020-05-07T22:25:11.000Z",
          "Titre": "Order not received",
          "Contenu": "Can't offer any comment because as of today (5 May 2020), some 55 days after dispatch, my order has still not arrived. Not surprising as most of the world's airlines are not operating at present. I have a low expectation that my order will arrive anytime soon! Just a victim of circumstances, I guess! I will contact the supplier about the non-arrival if my item has not arrived by mid-June."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Gary Chapman",
          "Nb_Reviews": 20,
          "Date": "2020-03-12T21:35:30.000Z",
          "Titre": "Dvd ok but simple format",
          "Contenu": "Although the dvd content is as expected, I expected an a copy of a original dvd in a case, not a copy made on a home-made version. I admire your enterprise and for the cost would have expected the price to be lower considering the product presentation. I think the format that you supplied this item should have been explained at the point of purchase. Apart from that everything is ok."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nigel Edwards",
          "Nb_Reviews": 6,
          "Date": "2020-07-31T05:50:12.000Z",
          "Titre": "Ok'ish And Would Use Again For Download Only",
          "Contenu": "Ordered mine as a download only as I don't use a dvd player. The order was a week late for download, however the download was fast and easy. The only issues were, the English subtitles were a literal translation from the Belgian Dutch, and therefore some lines didn't quite make sense and there were 3 episodes missing from the final series. However, I immediately contacted them and received them the next day. I will probably use them again if no other source is available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joel Siegel",
          "Nb_Reviews": 3,
          "Date": "2021-10-05T15:08:06.000Z",
          "Titre": "I appreciate the opportunity to get…",
          "Contenu": "I appreciate the opportunity to get more of the original Wallander episodes with Rolf Lassgard from Ioffer However, disc#1 was a very poor quality transfer, and disc#2  stopped playing about 20 minutes in, even though i have a high end DVD player"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darla",
          "Nb_Reviews": 2,
          "Date": "2020-09-13T22:37:53.000Z",
          "Titre": "Adequate",
          "Contenu": "While it's true that this set is a VHS-to-DVD copy/transfer and not expected to be perfect, S2E5 looks like the heads were dirty on the source VCR, with a lot of video clutter and bad audio. There have been bits of the same on some of the other episodes, this one seems to be the worst."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "LesleyJ",
          "Nb_Reviews": 1,
          "Date": "2019-09-17T00:42:08.000Z",
          "Titre": "Took a long time to arrive",
          "Contenu": "Appears to have been recorded off a tv broadcast of the film. Part 3 started several minutes in. No print material about the film, not even a photocopied DVD jacket. Shipping took 6 weeks. But it’s rare to find the uncut version of the film, so I’m happy to have it."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Henning",
          "Nb_Reviews": 3,
          "Date": "2020-04-02T06:21:46.000Z",
          "Titre": "Nice but...",
          "Contenu": "Very nice that I got it, but the quality wasn’t very satisfying and that it’s just personal recording without any extras like cover etc. should at least be mentioned. So it’s much too expensive, but thank you anyway!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ramona Alex",
          "Nb_Reviews": 1,
          "Date": "2020-12-08T02:16:50.000Z",
          "Titre": "I love the DVDs of Love Thy Neighbor",
          "Contenu": "I love the DVDs of Love Thy Neighbor, but I expected to get the whole 117 episodes, so if there's anyway I could get the rest of the episodes would be loving, but everything else was great. Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lori Ann Selch",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T14:36:45.000Z",
          "Titre": "Had to keep inquiring about when the…",
          "Contenu": "Had to keep inquiring about when the download would be in my account. The website said three days, it was more like a week.  You need to stand by what you put on the website."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Annemieke",
          "Nb_Reviews": 3,
          "Date": "2020-11-05T22:54:00.000Z",
          "Titre": "It took surprisingly three days tot…",
          "Contenu": "It took surprisingly three days to handle my purchase. In Holland I'm used to direct response and quick delivery."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Elizabeth Nicholson",
          "Nb_Reviews": 27,
          "Date": "2021-07-12T09:22:35.000Z",
          "Titre": "Picture mode problem",
          "Contenu": "I was pleased with the service. However, I cannot find out how to get the picture in the right mode."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michelle Williams",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T13:42:04.000Z",
          "Titre": "The guy I bought Mountain Monster…",
          "Contenu": "The guy I bought Mountain Monster season 6 off of he was missing an episode. The episodes missing scenes."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alison Williams",
          "Nb_Reviews": 4,
          "Date": "2020-08-02T08:03:39.000Z",
          "Titre": "It took a while and a bit of tooing and…",
          "Contenu": "It took a while and a bit of tooing and froing,but eventually I got what I wanted. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "William Johnston",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T09:07:00.000Z",
          "Titre": "COVID really knocked around the…",
          "Contenu": "COVID really knocked around the delivery guidelines. I got the package 115 days after order"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Geraldine Bourn",
          "Nb_Reviews": 5,
          "Date": "2019-10-08T10:35:00.000Z",
          "Titre": "dvds dont come in a case .it takes a…",
          "Contenu": "dvds dont come in a case .it takes a lot longer to get from shipping,about three weeks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sparky",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T00:05:05.000Z",
          "Titre": "Don't trust shipping time..movies are…",
          "Contenu": "Don't trust shipping time..movies are copies of pirated video coming from israel"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "solomon tadesse",
          "Nb_Reviews": 4,
          "Date": "2020-09-13T05:22:09.000Z",
          "Titre": "I just got this on September 12",
          "Contenu": "I just got this on September 12.  And i ordered it in July. But glad i have it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KaTie",
          "Nb_Reviews": 2,
          "Date": "2020-11-01T14:42:00.000Z",
          "Titre": "Life below zero",
          "Contenu": "Great to get this program, but having some technical issues with last order."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "NOVICA UROSEVIC",
          "Nb_Reviews": 1,
          "Date": "2020-10-17T21:53:40.000Z",
          "Titre": "If anything goes wrong with your order…",
          "Contenu": "If anything goes wrong with your order it is impossible to contact them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Connors",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T12:41:29.000Z",
          "Titre": "Well first off the TV show \" ship to…",
          "Contenu": "Well first off the TV show \" ship to shore\" I was lookin for this show nearly 10 years or more. Amazon, ebay, Walmart all them didn't carry the entire series.. the show now apocalypse is one I love as well. So I will continue looking for shows on here if they are hard to find shows. ( note: hardtofind.tv) didn't even help me find what I needed. So thank you so much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loyal Millett mormonbuddhist",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:23:59.000Z",
          "Titre": "My Only Problem is Shipping",
          "Contenu": "I've ordered from this site several times now because they have what I want and the prices are reasonable.My only problem is the length of time it takes from ordering to shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHARLES ECKENRODE",
          "Nb_Reviews": 4,
          "Date": "2023-07-06T19:25:45.000Z",
          "Titre": "I got my package within a reasonable…",
          "Contenu": "I got my package within a reasonable amount of time. However, I got them as a future Christmas present for someone and have not played these movies and cannot comment on their quality or condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Connors",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T10:12:37.000Z",
          "Titre": "Well I have wanted this show since the…",
          "Contenu": "Well I have wanted this show since the 90s, 1st time I ever seen it. I am very grateful to u, for finally finding this and ordering it. One problem 1st season , last episode is very messed up, other ones seem fine thou. But I glanced threw, not really watching the entire thing. But from what I seen they seem fine. Thanks again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie Dooley",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T01:18:44.000Z",
          "Titre": "Four stars only because a complete…",
          "Contenu": "Four stars only because a complete season of the show was implied before the order was completed.  Three episodes were missing and not available.A substitution was offered, which was a great resolution.If I could do 4.5 stars, I would."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "david emily",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T11:42:54.000Z",
          "Titre": "arrived in timely  fashion",
          "Contenu": "arrived in timely  fashion.  good   price.   however,  i  didn't   like the station logo  starring me in the face during the  whole   viewing.other than that it was great. no  errors neither."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gerard Doyle",
          "Nb_Reviews": 35,
          "Date": "2022-10-04T00:37:36.000Z",
          "Titre": "Hi item arrived very quickly,only…",
          "Contenu": "Hi item arrived very quickly,only little problem third episode on disc one kept stopping in the last 30 minutes,otherwise good quality disc's."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bernie Burke",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T02:41:52.000Z",
          "Titre": "DVD review",
          "Contenu": "They had what I wanted which I couldn't get anywhere else so that was good but maybe a tiny bit expensive"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Rice",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T18:04:55.000Z",
          "Titre": "Came quick good quality only problem so…",
          "Contenu": "Came quick good quality only problem so far was the first episode was dubbed in some other language an couldn't watch it"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cary Anne Conder",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T19:46:56.000Z",
          "Titre": "Package arrived in good order and good…",
          "Contenu": "Package arrived in good order and good condition.  Our one quibble is that we felt the content should have been \"remastered\", as it is really grainy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loretta Wish",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T17:34:01.000Z",
          "Titre": "Thanks for the memories",
          "Contenu": "Thanks to you, I'm enjoying a binge-watch of a series I never thought I'd see again: the underrated AfterMASH"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter K.",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T19:34:45.000Z",
          "Titre": "Great Selection & Prices",
          "Contenu": "The selection is wide and interesting, the pricing good to excellent. The only imperfection is the lack of information about resolution. Most times it was entirely satisfactory, but occasionally it was terrible. One solution to this would be the availability of a downloadable sample, or sample episode. This might also nudge more customers toward buying by downloading, surely a preferable business model for Ioffer Movies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T04:22:36.000Z",
          "Titre": "Great company!",
          "Contenu": "I had a problem with one of the seasons worth of discs (too dark), let them know about it and they replaced without asking me to send back old discs!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DONNA LAFERRIERE",
          "Nb_Reviews": 4,
          "Date": "2022-08-08T13:04:29.000Z",
          "Titre": "Blank title",
          "Contenu": "Everything was great in my ordering of my movie, except it would have been nice to have a label on the dvd instead of a blank black dvd case."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Brian Lister",
          "Nb_Reviews": 8,
          "Date": "2023-01-08T20:34:47.000Z",
          "Titre": "The order was processed and emailed…",
          "Contenu": "The order was processed and emailed promptly.However I am now in correspondence with IOffer as there is a problem in viewing it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter K.",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T06:41:42.000Z",
          "Titre": "Close to perfect",
          "Contenu": "Everything was fine, downloading was flawless as usual, only the price was a little less advantageous in this instance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Bronner",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T04:53:32.000Z",
          "Titre": "Very pleased to find a super…",
          "Contenu": "Very pleased to find a super hard-to-find complete series of a show I've been looking for, for some time now. Received promptly. I feel priced right and will peruse more of what they have to offer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. Sweeney",
          "Nb_Reviews": 3,
          "Date": "2022-12-18T16:18:43.000Z",
          "Titre": "good service",
          "Contenu": "I get no responses to email inquires, but I get what I order in a very timely manner. Will purchase again from ioffer"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lorraine Harrower",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T18:32:10.000Z",
          "Titre": "got delivery quickly did feel a little…",
          "Contenu": "got delivery quickly did feel a little disappointed as I was expecting boxed items but on reading the web site after the discs were delivered I found that the mistake was mine however I felt that the quality of the discs was good   and all work  so thanks for that"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyssa G.",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T07:34:39.000Z",
          "Titre": "Small Town Christmas download",
          "Contenu": "I bought a download version of Small Town Christmas. I didn't get access after three days, but once I emailed they got back to me in a day or two and the download was great. Good quality too. I would use this site again. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda F",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T16:26:04.000Z",
          "Titre": "The DVDs would not play in my DVD…",
          "Contenu": "The DVDs would not play in my DVD player so I had to play them on my computer. Not ideal. I'm glad I was able to view them and everything else about the experience was good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rita",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T22:58:48.000Z",
          "Titre": "Received dvds in a timely manner",
          "Contenu": "Received dvds in a timely manner. Picture quality is good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kevin",
          "Nb_Reviews": 5,
          "Date": "2023-03-15T15:35:41.000Z",
          "Titre": "The only one I could find.",
          "Contenu": "Shame this is a poor quality pirate copy.  But I suppose it does the job."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lance",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T23:49:11.000Z",
          "Titre": "Would certainly use them again."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Clive Biddulph",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T00:31:05.000Z",
          "Titre": "Quality not great but old tv show",
          "Contenu": "Quality not great but old tv show. There service was good."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rod Scott",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T04:49:23.000Z",
          "Titre": "One episode was missing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emily N",
          "Nb_Reviews": 5,
          "Date": "2022-03-29T02:40:23.000Z",
          "Titre": "I ordered bunch, got the dvds right!",
          "Contenu": "I ordered a lot of seasons, so got a lot of episodes and DVDs all at once that could have easily been mixed up - and they got them correct. Correctly labeled and everything - appreciate that, (because it'd be awful to be watching a show and then realize there are episodes missing or mixed up!). The labels telling you show and season for a few sets were stuck on the actual discs - which isn't ideal, it worried me they wouldn't play or have issues but none yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Ewert",
          "Nb_Reviews": 3,
          "Date": "2021-08-15T13:06:36.000Z",
          "Titre": "Didn’t expect dvd burns :(",
          "Contenu": "My first purchase didn’t go through, but I didn’t get notified. It took several emails and a bit of digging to find out that there had been a payment problem. We finally figured that out and DID receive our DVDs but they are burns :( the resolution suffers a bit. I didn’t know they’d be burns. I assumed they would be first run copies. Anyway, the discs do play and we’re enjoying the content.Thank you"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dick Barton",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T17:42:42.000Z",
          "Titre": "It all worked and delivered on time,",
          "Contenu": "It all worked and delivered on time,Thankyou.."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Lorraine Lister",
          "Nb_Reviews": 15,
          "Date": "2021-02-11T01:08:46.000Z",
          "Titre": "Communication between myself and IOffer…",
          "Contenu": "Communication between myself and IOffer for Spiral series 8 was good although there was a few days gap between me receiving the message that it was ready to download and the download link appearing.Sadly, a recent query about Rake series 3, 4 & 5 that I have sent about availability has not been replied to despite a follow up prompt.Brian"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis J Hartnett",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T10:33:42.000Z",
          "Titre": "I am happy to finally be watching…",
          "Contenu": "I am happy to finally be watching Laguna Negra again. Thanks for having it.One curious thing is happening, though.I am using VLC and unlike other series, I have to change the aspect ratio quite often from episode to episode. Do you have any idea why that would be happening? Sometimes it's 16:9, sometimes 4:3 or 5:4."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "brittany adkins",
          "Nb_Reviews": 3,
          "Date": "2020-03-07T17:50:03.000Z",
          "Titre": "I was pleasantly surprised",
          "Contenu": "I was pleasantly surprised. The movies play well. Great quality. The only thing was the shipping took several weeks which I went back and it does say that on their page. I also didn’t get tracking because I didn’t upgrade shipping. I will definitely buy from them again! I will just order way earlier than I need or want it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tracie",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T16:06:36.000Z",
          "Titre": "Repeat Customer",
          "Contenu": "I would love to give 5 stars, but the download said 3 days turn-around time and it was a little over a week before the download was ready.  That being said, I love that they had exactly what I was looking for, with multiple options!  I am a repeat customer!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret M",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T21:03:07.000Z",
          "Titre": "It took a bit of time for my purchase…",
          "Contenu": "It took a bit of time for my purchase to get to me, however, I was able to email my concern and someone got back to me right away letting me know that my delivery was on schedule. It’s really helpful to have a concern or question and know that if you send it email someone will get back to you with an answer. Thank you very much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bicycle Village",
          "Nb_Reviews": 4,
          "Date": "2021-12-12T21:13:03.000Z",
          "Titre": "Da Vinci’s Inquest Recording Quality Review",
          "Contenu": "Generally, the video quality was excellent. The first three seasons had probably 1080p quality because only those seasons were distributed as DVD’s. Seasons 4-7 had a lower quality (720p) since they were copied from mainly the Chicago TV station of WGN. But that was the only way to get a copy of these seasons.The price of $71 was excellent. Buying DVD’s for only the first three seasons would have cost way more.Only one episode had bad skips, even after I tried to clean it. So, it was basically unwatchable. But given that there were 13 episodes per season and 7 seasons, one bad  episode recording out of 91 is pretty good.So, overall, I’d recommend iOffer."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lewis Chapple",
          "Nb_Reviews": 16,
          "Date": "2021-07-11T16:16:56.000Z",
          "Titre": "Order was late, but arrived!",
          "Contenu": "At first my order did not come on time and I thought I was being scammed. I contacted support and they responded fairly quick saying to wait a few more days for it to process (it was an online digital copy of a tv show I ordered that I could download), I waited and it still didn't come. After about 5-6 days (delivery time was expected within 3 days) I finally got the download link and I now have my order. Happy days.Depending on if I have any issues with the series I downloaded, I will update this review. I will consider buying from them again if the quality of the content delivered reaches my expectations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aikwan Chong",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T21:27:07.000Z",
          "Titre": "A good resource, especially for hard-to-source series",
          "Contenu": "My purchase was delivered quite timely, and it was easy to download the episodes. The only hiccup was that there were no captions encoded, since mine was a series in English. It took a few messages to customer support to figure this out, but I think I understand correctly that subtitles and captioning won't be available if the series or movie is in English, but there will be subtitles if the film isn't in English. Hopefully, this helps those who are hard of hearing like me, or American (also like me) trying to listen to a Yorkshire accent and keep up!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dixie Bartkus",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T04:37:52.000Z",
          "Titre": "Season 11 of Life Below Zero DVDs",
          "Contenu": "I was disappointed that the Season Series DVDs I ordered were not enclosed in a regular plastic DVD container.  Each DVD was just placed in a separate paper white sleeve with a label telling which episode was inside.  It would have been easier to store one plastic DVD container holding all the discs together rather than having several separate paper sleeves that could easily be lost, stepped on or broken, since I have no place to store them safely separately.  The product itself was  satisfactory and I would purchase again from iOffer Movies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 2,
          "Date": "2020-08-11T22:57:52.000Z",
          "Titre": "Unique Selection",
          "Contenu": "They had  season 6 of my favorite show that I could not find anywhere. This was the only place it was available. The price was okay but the shipping took an extremely very long time. But it finally arrived and I am happy with Ioffer Movies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 2,
          "Date": "2020-04-07T14:13:23.000Z",
          "Titre": "Overall satisfied",
          "Contenu": "DVD’s did take a little longer than expected to arrive (almost a full month from ship date), but they got here. Quality is decent, a little choppy but not terrible. Overall I’m happy because I could not find this tv program anywhere else!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RICK S. SITAR",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T23:54:15.000Z",
          "Titre": "GOOD SERVICE"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lindsay",
          "Nb_Reviews": 43,
          "Date": "2019-11-23T12:56:17.000Z",
          "Titre": "arrived quickly",
          "Contenu": "arrived quickly, one disc wouldn't play of the 8 but didn't need it as I had those episodes, otherwise i'm sure there would be no problem getting a replacement. otherwise all  good quality and prompt posting"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Betsy",
          "Nb_Reviews": 3,
          "Date": "2022-03-09T23:13:14.000Z",
          "Titre": "Quick delivery, but…",
          "Contenu": "Got the download quickly and the quality is good, but one episode is missing from the season. I contacted them via email several times, but never got a response."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kirsty Grice",
          "Nb_Reviews": 2,
          "Date": "2020-05-18T16:58:08.000Z",
          "Titre": "Buying was easy",
          "Contenu": "Buying was easy, and my order was dispatched quickly. Due to the pandemic, delivery was delayed but that's nobody's fault. My initial email querying this was responded to quickly.Will buy again."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Lorraine Lister",
          "Nb_Reviews": 15,
          "Date": "2020-10-15T00:40:03.000Z",
          "Titre": "Good service from IOffer-Movies",
          "Contenu": "Order took slightly longer than I had hoped but apology received from supplier for the delay and a prompt response and correction made when I notified that an error had been made to the order."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sandy",
          "Nb_Reviews": 1,
          "Date": "2019-08-19T23:03:28.000Z",
          "Titre": "I would have given 5 stars except I do…",
          "Contenu": "I would have given 5 stars except I do not like the bit of paper with title stuck on the disc as that can unbalance the disc over time. otherwise the discs were fine. I would buy from you again."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ann Flynn",
          "Nb_Reviews": 4,
          "Date": "2022-01-02T17:01:42.000Z",
          "Titre": "good quality recording but adverts annoying",
          "Contenu": "The quality of the recording is excellent but the pop up TV ads are very annoying and detract from the movie. I will keep looking for a non advert version"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David McLean",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T18:19:39.000Z",
          "Titre": "Satisfied Customer",
          "Contenu": "Good, fast service at reasonable price. Problem with a disc repeatedly stopping, but thankfully resolved by cleaning disc. Very satisfied with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Alan Johnson",
          "Nb_Reviews": 8,
          "Date": "2022-02-24T10:40:31.000Z",
          "Titre": "Subtitles, please!",
          "Contenu": "Very good service, but it would be helpful if your DVDs could all be subtitled, as is increasingly required - and I am hard of hearing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helena Ribeiro",
          "Nb_Reviews": 1,
          "Date": "2020-09-13T20:14:20.000Z",
          "Titre": "Four DVDs received in good shape, recorded well on test run.",
          "Contenu": "Received the four DVDs yesterday and it looks great.  I’m glad they were received unbroken because they were stacked up in an average strength padded envelope.  I’m guessing it’s more economical for vendor to replace any broken DVDs rather than pack the dvd in individual holders. Maybe DVDs are very solid and don’t crack, I’m wary of postal people dropping a heavy box on it and crack it.  Anyway they were received fine and I think four DVDs stacked one on top of another forms a solid mass. I like the way it’s recoded, three episodes per disk and easy to use.  I will definitely order more from this vendor in future.  It would have been five stars but I’m a tad wary of the packaging, putting it in a stronger envelop or small box would give me more confidence.  No breakage though.  (Perhaps shipping just one dvd may have a different packaging.)  Anyway DVDs themselves - 5 Stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amzonjene",
          "Nb_Reviews": 2,
          "Date": "2020-05-13T13:03:56.000Z",
          "Titre": "Pretty quick on the delivery",
          "Contenu": "Pretty quick on the delivery,  Not new in box, unsure of number of episodes or quality of production.  Can give better review a little later😒😞"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gone South",
          "Nb_Reviews": 1,
          "Date": "2020-08-07T14:12:51.000Z",
          "Titre": "Great service for hard to find videos",
          "Contenu": "Great service for finding hard to find videos.  The downloads worked just fine. I'll use again when I cant find a movie or series anywhere else."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Martin",
          "Nb_Reviews": 4,
          "Date": "2023-07-21T01:15:11.000Z",
          "Titre": "Great except for unremoval hearing…",
          "Contenu": "Great except for unremoval hearing impaired captions"
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Sarah",
          "Nb_Reviews": 2,
          "Date": "2021-03-10T09:54:47.000Z",
          "Titre": "I was very happy that ioffermovies were…",
          "Contenu": "I was very happy that ioffermovies were able to source some old series for me. I couldn't find them anywhere else. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Bryan",
          "Nb_Reviews": 24,
          "Date": "2021-04-20T12:40:17.000Z",
          "Titre": "Quality good,delivery on time but sub title issues",
          "Contenu": "Quality good,delivery on time - unfortunately whilst one disc was perfect I have had problems with sub titles on the other."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dominic Tom",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T22:14:38.000Z",
          "Titre": "DVDs are of very good quality",
          "Contenu": "DVDs are of very good quality. I have not finished watching all the shows yet. But I am happy with this product so far."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Petree",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T09:44:08.000Z",
          "Titre": "A little bit later than expected but I…",
          "Contenu": "A little bit later than expected but I loved Hudson & Rex and the quality was great...would definitely buy again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-10-10T19:46:53.000Z",
          "Titre": "Your idea of selling DVDs is great",
          "Contenu": "Your idea of selling DVDs is great. I hope you follow through with their respective seasons."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katy Lady",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T13:02:35.000Z",
          "Titre": "Found old movie I wanted",
          "Contenu": "I was looking for a particular movie and found it on Ioffer Movies.  The price was very reasonable"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VB",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T20:05:49.000Z",
          "Titre": "Quality on one movie was only fair but all the rest of the movies I ordered were very good quality",
          "Contenu": "Quality on one movie was only fair but all the rest of the movies I ordered were very good quality."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Lorraine Lister",
          "Nb_Reviews": 15,
          "Date": "2020-10-22T17:46:32.000Z",
          "Titre": "I wrote a mainly positive review at the…",
          "Contenu": "I wrote a mainly positive review at the time I received my order - so what happened to it?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Emily Kent",
          "Nb_Reviews": 2,
          "Date": "2020-03-08T18:29:35.000Z",
          "Titre": "DVD has come but I have no idea what…",
          "Contenu": "DVD has come but I have no idea what region it is. Could do with some instructions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jean-Pierre Boule",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T16:44:06.000Z",
          "Titre": "I eventually received my 3 DVDs",
          "Contenu": "I eventually received my 3 DVDs. The quality is excellent. Would use them again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen S.",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T15:22:57.000Z",
          "Titre": "Bought first two seasons of Professor…",
          "Contenu": "Bought first two seasons of Professor T.  Great quality, unbeatable price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sheila Jorstad",
          "Nb_Reviews": 4,
          "Date": "2020-08-09T17:29:11.000Z",
          "Titre": "Took awhile to receive",
          "Contenu": "Took awhile to receive. But, good quality movie 😊"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Mr David Darkin",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T13:33:26.000Z",
          "Titre": "Product all good",
          "Contenu": "Product all good, just took awhile to arrive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sc",
          "Nb_Reviews": 4,
          "Date": "2021-08-11T21:13:59.000Z",
          "Titre": "Received my items quick and fast.thank…",
          "Contenu": "Received my items quick and fast.thank you"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Judit Elisabet",
          "Nb_Reviews": 10,
          "Date": "2021-04-17T18:35:07.000Z",
          "Titre": "Homoside hunter",
          "Contenu": "Nice and fast.. Thank you for the calender"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Nikolaus Gieschen",
          "Nb_Reviews": 2,
          "Date": "2019-12-09T15:38:11.000Z",
          "Titre": "Qeen of Hearts",
          "Contenu": "Great: DVD delivered as described"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "me",
          "Nb_Reviews": 1,
          "Date": "2020-02-09T22:41:00.000Z",
          "Titre": "Great service as always",
          "Contenu": "Great service as always. thanks!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tonja Fortune",
          "Nb_Reviews": 16,
          "Date": "2021-03-11T18:51:10.000Z",
          "Titre": "Excellent value for money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "monte gillam",
          "Nb_Reviews": 6,
          "Date": "2022-02-13T23:37:08.000Z",
          "Titre": "Great job",
          "Contenu": "Great job, thanks!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Graeme Wright",
          "Nb_Reviews": 9,
          "Date": "2020-12-09T16:40:35.000Z",
          "Titre": "No sub titles available"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2019-09-08T20:58:16.000Z",
          "Titre": "Good experience, no issues",
          "Contenu": "Good experience"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mark stevens",
          "Nb_Reviews": 12,
          "Date": "2023-12-14T21:01:43.000Z",
          "Titre": "Superb service",
          "Contenu": "Superb service, an amazing amount of movies these guys can source, especially good for hard to find and tv movies.Excellent customer service as well.Recommended to all."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Marilyn White",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:39:55.000Z",
          "Titre": "My dvd arrived when id",
          "Contenu": "My dvd arrived when it was promised and excellent picture quality"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Brian Lister",
          "Nb_Reviews": 8,
          "Date": "2023-12-07T05:00:11.000Z",
          "Titre": "The entire order and despatch process…",
          "Contenu": "The entire order and despatch process was handled very weii - as it usually does."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lois",
          "Nb_Reviews": 5,
          "Date": "2023-11-20T00:43:53.000Z",
          "Titre": "Grateful for the shows you offer",
          "Contenu": "I've ordered multiple times always got what I ordered If there's a way to ask about difference shows I'm looking for I've not found out how to do that and also once you order you can't go back to cancel it I've ordered same thing not realizing I had ordered it before  I tried cancel got no reply had to buy it again but overall I'm thankful  there's shows I've found here I couldn't find elsewhere so big thanks!!! I'll always be a customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TMB",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:04:25.000Z",
          "Titre": "Prompt delivery of hard to find itme"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Yvonne Whiteman",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:18:57.000Z",
          "Titre": "Both times I ordered the item came…",
          "Contenu": "Both times I ordered the item came sooner than was told."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "S. Cantuniari",
          "Nb_Reviews": 7,
          "Date": "2023-12-06T18:35:31.000Z",
          "Titre": "The site is great",
          "Contenu": "The site is great, the support is quick and friendly, Ioffermovies has many titles that can't be found anywhere else. Many thanks."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "robert cardno",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:16:14.000Z",
          "Titre": "Great selection of tv series and…",
          "Contenu": "Great selection of tv series and movies.doco's etc. I wish I had discovered this site sooner.I have managed to purchase dvd's of tv series that I haven't been able to purchase anywhere else.I have requested dvd's of certain tv series that aren't attainable on the dvd format but streaming only and they manage to track down all requested items for me to purchase, over the moon. Will be requesting if many more titles I can purchase in the future.Lastly, postage of the above dvd's took only 3 weeks to get to Perth, Australia.  very good.I highly recommend this website to anyone 5 STARS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Zoolander",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T08:54:34.000Z",
          "Titre": "Great Experience!",
          "Contenu": "Had a tv show that I've been searching for for ages and couldn't buy anywhere else. Awesome!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dorry B",
          "Nb_Reviews": 18,
          "Date": "2023-11-04T00:21:52.000Z",
          "Titre": "Always happy with this service!!!",
          "Contenu": "I have now placed 43 orders through iOffer Movies and, as always, am thrilled with the speed of delivery and with the quality of the digital movies. Thank you so much for offering this service, iOffer.... Although my frequency of orders has slowed, it is because I have already bought most of those I want but will continue to order new movies as they become available.  Thank you again!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven White",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T17:16:18.000Z",
          "Titre": "Last year VS this year.",
          "Contenu": "Last year, from time to time, I would receive a bad disc, or bad episode, like perhaps an Audio Glitch. But you have always been fair with me, and you always Replaced Bad episodes.Thank you (Anthony or Michael),For all that you do for me,  over the last 2-3 years.Keep up the Great work.I haven't had any complaints from my customers on Season 3, for over nine months now.Thank you for being so professional and for keeping such high standards. Warmest regards, Steven R White 256-679-6455 18947 Sewell Rd,  Lot 3,Athens,  Alabama 35614."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mark stevens",
          "Nb_Reviews": 12,
          "Date": "2023-11-04T19:26:08.000Z",
          "Titre": "Recommended",
          "Contenu": "Bought from these guys a few times, VERY helpful and friendly service and they really care about you coming back so give excellent customer support.Especially good service for hard to find items"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wrbtu",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T01:45:39.000Z",
          "Titre": "Fast Arrival Considering the Situation",
          "Contenu": "Communication was excellent, my questions were answered. Item is as described by seller. Amazing that it took only 18 days to arrive despite \"An emergency situation...has delayed delivery\" (per UPS- yes, a War). Highly Recommended seller."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mathew Russo",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T11:45:47.000Z",
          "Titre": ".AVI files were given, and they are the easiest format and highest quality - wonderful!",
          "Contenu": "Item exactly as described and made it very easy to download - no log in hassles, tech support or anything else needed.  Just AVI files in a dropbox-like link.  A+++++ Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Maureen",
          "Nb_Reviews": 3,
          "Date": "2023-10-28T02:08:13.000Z",
          "Titre": "Satisfied customer.",
          "Contenu": "As always, my order was fulfilled exactly as I requested. My queries about whether items were available were answered promptly.Items delivered on time.Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Christian",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T03:57:07.000Z",
          "Titre": "Good website with a decent range of titles.",
          "Contenu": "The title requested was downloaded quickly and efficiently. The seller was polite and communicative. A good service, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C D Jones",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T19:07:11.000Z",
          "Titre": "prompt service",
          "Contenu": "prompt service, the movies are clear and sharp with excellent service  with wide range of english subtitles."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alexander De-Marco",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:06:26.000Z",
          "Titre": "Great seller and great negotiations and…",
          "Contenu": "Great seller and great negotiations and altogether a great purchasing process and experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Kachik",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:18:20.000Z",
          "Titre": "It was a good series",
          "Contenu": "Fast service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy S.",
          "Nb_Reviews": 14,
          "Date": "2023-11-14T06:25:53.000Z",
          "Titre": "Rest of the Show Found Here",
          "Contenu": "I was able to find the rest of the show I wanted when it wasn't available anywhere else.Fast shipping & no damage to the product a big plus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAMES",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T16:40:01.000Z",
          "Titre": "Great seller on hard to find movies or TV series",
          "Contenu": "I've been looking for years for a good copy of Holmes inspection Series. When I saw this was an option to buy from this site, I'm not gonna lie. I was a little hesitant because I wasn't sure how legit they were. However, I did go ahead and get the direct download purchase and I couldn't be happier. Outstanding seller and very respectful."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mrs Cheryl Vida Fitzgerald",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T13:19:38.000Z",
          "Titre": "I have not had any problems at all with…",
          "Contenu": "I have not had any problems at all with iOffer Movie's. Either with the Quality or the Customer Service over all.I have had a lot of medical issue's and Internet Problem's to attend to. I have been dealing with iOffer for many year's and find their DVD's and Customer Service Excellent.Yours Sincerely,Mrs. Cheryl Vida Fitzgerald"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Maureen",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T04:51:10.000Z",
          "Titre": "Excellent service!!",
          "Contenu": "The special requests I made in the \"notes\" area were followed exactly.  Made the ordering and payment process run very smoothly. Whenever I submit a query it is always answered promptly, with instructions on how to complete my orders.  Very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven White",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T16:43:50.000Z",
          "Titre": "They Strive for 100% Customers Satisfaction.",
          "Contenu": "I often request changes to certain orders,  and they always comply with me. I let them know of any issues that I find in my orders, and on occasion,  I Request Replacement Dvd's,  due to faulty ones I received,  like bad, or NO audio Issues. They always cheerfully replace bad dvds, with New ones.This makes All the difference in the world 🌎."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Christina Allen",
          "Nb_Reviews": 7,
          "Date": "2023-07-12T23:08:16.000Z",
          "Titre": "Ice cold murders/ Rocco Schiavone",
          "Contenu": "I have been searching for three years for Rocco Schiavone series with English subtitles that will play in my region so I was absolutely delighted to order from you series 1-2-3-and 4 with excellent translation and a quick delivery. Very pleased with my purchase.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trish",
          "Nb_Reviews": 6,
          "Date": "2023-08-10T23:38:10.000Z",
          "Titre": "Fantastic service",
          "Contenu": "iOffer has always provided fantastic service over many years with a huge range of titles available.  Again, they have provided what I requested, and as always I am very grateful for this!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Judith N.",
          "Nb_Reviews": 40,
          "Date": "2023-02-02T22:27:02.000Z",
          "Titre": "Old BBC series on DVD",
          "Contenu": "I was delighted to find that Ioffer Movies had an old BBC series on DVD which was unavailable elsewhere and I am very pleased with the purchase. As stated, it came without an original DVD cover sleeve (so I guess it is just a copy) but a blank DVD case was included. This was not a major concern and I would search the Ioffer Movies website again. The order arrived as expected."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dr K.Coates",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T09:10:04.000Z",
          "Titre": "Very good company for coming up with…",
          "Contenu": "Very good company for coming up with those lost films or seemingly unavailable tv series - particularly in \"Foreign Film\" category. Prompt and efficient."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Yvonne Haynes",
          "Nb_Reviews": 5,
          "Date": "2023-10-12T00:52:04.000Z",
          "Titre": "The ones I ordered were FABULOUS  and…",
          "Contenu": "The ones I ordered were FABULOUS  and exactly what I wanted.  They are professional and helpful.  My only complaint it's a long wait if you live in Australia."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Christensen",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:19:25.000Z",
          "Titre": "I found things I’ve been looking for…",
          "Contenu": "I found things I’ve been looking for years with no luck. I have a list of DVDs to purchase in the future. Love the foreign offerings."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Donna",
          "Nb_Reviews": 33,
          "Date": "2023-06-24T10:39:22.000Z",
          "Titre": "I had never heard of this company and I…",
          "Contenu": "I had never heard of this company and I checked to see if it was legit ( which it is) and to be honest I was skeptical that I would get what I wanted but i took a chance as this was the only place I could get the dvd I wanted. Placing an order was very easy and I was kept informed of its progress and the dvd arrived in good time and I’m really happy. I wouldn’t hesitate to use this company again and I would recommend it too."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Brian Lister",
          "Nb_Reviews": 8,
          "Date": "2023-10-12T22:38:12.000Z",
          "Titre": "A good and easy order",
          "Contenu": "As always, good and prompt delivery service. The new website also helps to make the ordering process a lot more easier."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "S. Cantuniari",
          "Nb_Reviews": 7,
          "Date": "2023-04-18T18:02:45.000Z",
          "Titre": "Ioffer Movies is a great and very…",
          "Contenu": "Ioffer Movies is a great and very useful site where I found what I couldn't find elsewhere and they are very kind and helpful. For example, they found something I was inquiring about, that wasn't listed yet on the site. The prices are very reasonable. Prompt delivery. Very happy customer. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Conetta",
          "Nb_Reviews": 5,
          "Date": "2023-11-10T00:38:33.000Z",
          "Titre": "Ioffer movies review",
          "Contenu": "Item I purchased arrived on time in good condition. Very satisfied. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cara MacDonald",
          "Nb_Reviews": 5,
          "Date": "2023-04-13T14:20:40.000Z",
          "Titre": "Thank you very much IOffer Movies  and…",
          "Contenu": "Thank you very much IOffer Movies  and I appreciate your brilliant customer service when the a issue happenedYour quickly righted the wrong Very quick responses much appreciated I look forward to using your company again for ordering dvds Thank you Very much"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2023-05-14T06:48:31.000Z",
          "Titre": "TOTAL JOY",
          "Contenu": "The product was even better than hoped, worked perfectly, arrived safely and far quicker than promised. It was also a TV series I long dreamt of seeing again, but wasn't available, so I was truly delighted to have and enjoy it again.  Excellent!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "customer Rex Fleming",
          "Nb_Reviews": 2,
          "Date": "2023-05-21T03:04:25.000Z",
          "Titre": "The item arrived promptly",
          "Contenu": "The item arrived promptly, and was accurately described, playing well on my region 4 DVD player, despite being an American import.  Thanks, I will keep you in mind for future purchases of DVDs which are hard to obtain by other means."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Miss Emma Gaughan",
          "Nb_Reviews": 7,
          "Date": "2023-09-08T23:42:15.000Z",
          "Titre": "Great seller",
          "Contenu": "Really happy with I offer movies. Great communication. I took a chance and am glad I did. It is good site if your looking for a series that is hard to come by. I have ordered from them twice and will Defenitely be ordering again. Very pleased with their service."
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Liv",
          "Nb_Reviews": 9,
          "Date": "2023-06-23T16:06:24.000Z",
          "Titre": "Secure site, and a very good store and seller",
          "Contenu": "Secure site ( my experience ) and checkout/payment.I choose the option ”Other payment methods” When making the order, and attach the message ”please send a link to pay-PAL” Works perfectly.The seller, to my experience, is very service-minded,and we’ve had very functioning and nice correspondence. The shipping cost is very reasonable ( ask the seller If you have any wishes about it ). Good packaging. Shipping time about 30 days. The movie selection is just so great; so many wonderful titles I’ve found here. The picture/recording quality is mainly good ( not HD of course ). I’ve purchased about 20 and was not pleased with two maybe three of them ( with two of them It was not a big deal ). With many titles It’s both such a pleasure of finding/watching them On DVD, such good films, and the nice clarity and colour tone of the picture. For Some of the 1960-80:s movies the old colour tones, and with some a certain graininess ( for example with the Canadian movie Sonatine from 1984 ) is just a pure pleasure watching.Skickat från min iPad"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2022-12-18T18:29:48.000Z",
          "Titre": "I purchased 1 thru 6 of the repair shop…",
          "Contenu": "I did purchase the Repair Shop 1 thru 6 dvd set. So far, I have been able to watch the first two. As time goes by, I will find time to watch the remaining dvds ( Very busy Christmas Season).Very good quality video, no problems so far. There is a directory on each dvd😊, but no artwork😩.I would have paid extra for tracking the shipment, since there was a long shipping times.Suggestions; DVD artwork.How many total hours on each dvd set or have it included on the website.Mail tracking.Direct contact with the vendor.I have purchased the repair shop season 7, it would be nice to see improvements.It would be nice to get notification when season 8-10 becomes available."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "S. Cantuniari",
          "Nb_Reviews": 7,
          "Date": "2022-12-12T20:37:12.000Z",
          "Titre": "Happy I found a few rare DVDs…",
          "Contenu": "Happy I found a few rare DVDs unavailable elsewhere. Quick delivery in very good conditions, with good protection. Quality of DVD R is OK and the DVDs are labelled individually, with care. No complaints. Many thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Sanchez",
          "Nb_Reviews": 4,
          "Date": "2022-12-03T20:24:22.000Z",
          "Titre": "I ordered a set of movies for my father…",
          "Contenu": "I ordered a set of movies for my father and when he received them they did not work so I contacted customer care and even though it took a bit they responded and sent my dad a new set of dvd's and they all worked just fine. Keep in mind these people did everything they promised no questions asked and delivered with 100% accuracy and that in my book is worth everything especially keeping there promises.  This company is legit and they will deliver with 100% satisfaction.  I'm a Army veteran and I would never point anyone in the wrong direction. If you wish to order quality movies at a great price order from here you will not be disappointed.  I give them 20 stars if I could ✨️ 😌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina S",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T02:53:52.000Z",
          "Titre": "Great way to purchase unavailable titles",
          "Contenu": "Very quick delivery on downloaded TV season.  Video quality was high.  There was an issue with one episode, but I opened a help ticket and received a very quick response and resolution.  Thank you for the great customer focus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miles Watson",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T03:21:05.000Z",
          "Titre": "Found it",
          "Contenu": "I found an obscure TV movie I've been looking for for years, and got it via digital download (it was also available as a DVD). Picture quality was excellent. Price was reasonable. My long search is ended."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dorry B",
          "Nb_Reviews": 18,
          "Date": "2023-05-11T02:13:36.000Z",
          "Titre": "I love this vendor!!!",
          "Contenu": "I have just placed my 27th order with iOffer and will continue to use this amazing vendor. He offers a great service and is very accommodating when it comes to dealing with my fussy needs. Thank you so much!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Thelma Cheeseman",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T21:54:30.000Z",
          "Titre": "Everything was exactly as described",
          "Contenu": "Everything was exactly as described,  and arrived earlier than expected. Would definitely buy from Ioffer again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Kohl",
          "Nb_Reviews": 4,
          "Date": "2023-05-25T01:20:40.000Z",
          "Titre": "Everything arrived totally intact and…",
          "Contenu": "Everything arrived totally intact and quickly and at prices so inexpensive it can’t be believed.I really  wish they were more up to date on MasterChef Series offered….."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Diane",
          "Nb_Reviews": 15,
          "Date": "2023-01-29T13:07:30.000Z",
          "Titre": "Swift Response and Great Product",
          "Contenu": "Thank you for your prompt response and action when I encountered delivery problems.  You advised that my order was reissued and I received this a few days later.  The DVDs are good quality and I was able to access the required subtitles."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Vinny",
          "Nb_Reviews": 5,
          "Date": "2023-06-16T15:46:41.000Z",
          "Titre": "Great experience",
          "Contenu": "When messaging the seller I always get a quick response to any questions I ask. Discs are copies but always in an excellent condition and top quality. I have ordered many times from this seller."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "djs",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T01:47:29.000Z",
          "Titre": "Excellent source",
          "Contenu": "I have ordered 16 hard to find dvds several times. They were shipped  quickly and arrived in excellent shape. I wouldnt hesitate to order again therefore I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "SDW",
          "Nb_Reviews": 8,
          "Date": "2023-08-04T11:32:30.000Z",
          "Titre": "Baby Daddy all seasons",
          "Contenu": "Ordering online was simple and secure. My purchase was delivered promptly and I am very happy with the service. I highly recommend ioffer to anyone looking for something special."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "HERBERT MALPASS",
          "Nb_Reviews": 9,
          "Date": "2023-05-02T20:45:26.000Z",
          "Titre": "Been searching for years",
          "Contenu": "I have been searching for years for Noahs Ark. Found it at last on ioffer movies. I reluctantly ordered the download.  I'm not very good at this,  but I was pleasantly surprised.  3 day delivery as stated and the files opened on my phone without having to download any new software.  Amazing service,   thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Price",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T22:40:12.000Z",
          "Titre": "Harry and Chums",
          "Contenu": "Since this show was an older title- it was very hard to find on dvd - specially since we live in the US.  Checked around and looked at reviews from others before deciding to purchase.  Arrived at a decent time frame.  We used a region free dvd player…played it just fine."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dorry B",
          "Nb_Reviews": 18,
          "Date": "2023-08-04T03:36:00.000Z",
          "Titre": "Order #40 - WOW!!",
          "Contenu": "My 40th iOffer order is done and dusted and I'm so happy once again. I love my digital movies. Thank you, iOffer for your wonderful service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MRPAULMCCUSKER",
          "Nb_Reviews": 4,
          "Date": "2023-01-01T14:28:36.000Z",
          "Titre": "yes i was a member years ago i ordered…",
          "Contenu": "yes i was a member years ago i ordered top of the pops all great to watch still watch this day have rejoined to get the first 48 hours brilliant show great site keep up the good work...."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lee Perkins",
          "Nb_Reviews": 10,
          "Date": "2023-06-18T22:08:01.000Z",
          "Titre": "A great place to find obscure movies…",
          "Contenu": "A great place to find obscure movies and tv shows not currently available 'mainstream'.I've used many times and never been disappointed."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dorry B",
          "Nb_Reviews": 18,
          "Date": "2023-06-25T06:16:27.000Z",
          "Titre": "Best vendor ever!!",
          "Contenu": "I have just received my 33rd order from iOffer Movies and will continue to order from them. The service is great. the stock fantastic and the quality of the digital movies is fabulous. Thank you iOffer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T22:55:58.000Z",
          "Titre": "I LIKE I OFFER--REALLY GOOD PRICES ON…",
          "Contenu": "I LIKE I OFFER--REALLY GOOD PRICES ON DVDS THAT I HAVE BEEN SEARCHING EVERYWHERE FOR--SHIPPING WAS FAST AND PRODUCTS GREAT--I WILL USE AGAIN IN FUTURE IF I CAN..."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dinah O’Dell",
          "Nb_Reviews": 13,
          "Date": "2023-09-23T10:42:02.000Z",
          "Titre": "I got in touch with Ioffer Movies",
          "Contenu": "I got in touch with Ioffer Movies , because I hadn’t received order. They emailed back straight away and my order came shortly after that. Very pleased with this company."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "ANGELES",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T09:11:37.000Z",
          "Titre": "This is not my first experience with…",
          "Contenu": "This is not my first experience with them. They do their best to find unusual movies and they did find one for me again this time.   They are a serious company, I always get the delivery promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trish",
          "Nb_Reviews": 6,
          "Date": "2023-04-25T07:03:58.000Z",
          "Titre": "Amazing service from iOffer Movies",
          "Contenu": "Amazing service from iOffer Movies as always!  Very speedy delivery of shows, great quality and huge variety available.  Thank you again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marg Harrison",
          "Nb_Reviews": 14,
          "Date": "2023-02-10T13:32:21.000Z",
          "Titre": "Can only recommend this company.",
          "Contenu": "Found them by accident really and what a good find it is. The only place offering what I was looking for. Kept me up-to-date with how my order was going. Arrived sooner than expected. Well packed. Can't fault it. Worth ever penny."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Reilley",
          "Nb_Reviews": 3,
          "Date": "2022-11-19T17:49:24.000Z",
          "Titre": "Item was shipped fast!",
          "Contenu": "Item was shipped fast!! But it was hard to communicate with them as I sent several messages to them But did not receive any Response to my E-Mail and could not figure out how to see their response through the ticket that I turned in, They need better communication with the customer!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jane Brezinski",
          "Nb_Reviews": 5,
          "Date": "2023-04-09T18:04:29.000Z",
          "Titre": "My second purchase",
          "Contenu": "This was my second purchase from iOffer Movies and I couldn't be more satisfied. Each disc is sent in its own sleeve - no bulky cases. The quality is great and they arrived in a reasonable amount of time. I am confident I will be back for more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2023-10-22T00:50:02.000Z",
          "Titre": "I am not sure I received the entire…",
          "Contenu": "I am not sure I received the entire series I ordered.  how do i contact Customer Service?"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "John Magann",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T11:26:06.000Z",
          "Titre": "Mountain monsters",
          "Contenu": "I can't get the show anywhere else so thanks i watch it over and over again so keep up what you are doing well i only need series 7 now and I will have the lot"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "S. Cantuniari",
          "Nb_Reviews": 7,
          "Date": "2023-07-31T20:50:11.000Z",
          "Titre": "Very Good Site",
          "Contenu": "I'm very happy with all the purchases from Ioffer Movies, great site, very reliable, friendly and I need to thank them for providing even a few titles that were not yet on the site. Thank you so much."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Brian Lister",
          "Nb_Reviews": 8,
          "Date": "2023-09-22T04:04:11.000Z",
          "Titre": "Purchasing a TV Series",
          "Contenu": "Painless experience as always. Help staff very helpful with product sent within the promised time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Egon",
          "Nb_Reviews": 3,
          "Date": "2023-02-08T04:17:10.000Z",
          "Titre": "Movie & tv shows on Dvds",
          "Contenu": "So far anything in a DVD I wanted I was able to get, even when not listed in catalog.Just ask & it's made available. Shopping & Shipping is quick, so at least for me I am completly happy shopping at Ioffer-movies.com.5 Star ☆☆☆☆☆ All the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 4,
          "Date": "2022-12-04T10:22:09.000Z",
          "Titre": "Great Vendor",
          "Contenu": "I've purchased from this vendor before and without any problems whatsoever.  Shipping is very prompt.  I will continue to purchase from him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lois",
          "Nb_Reviews": 5,
          "Date": "2023-03-03T02:26:05.000Z",
          "Titre": "I've gotten multiple  shows that I…",
          "Contenu": "I've gotten multiple  shows that I couldn't find elsewhere very happy all good experiences every time will get more awesome!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy T.",
          "Nb_Reviews": 6,
          "Date": "2023-07-02T20:11:37.000Z",
          "Titre": "Ioffer Movies is the Best!",
          "Contenu": "Ioffer Movies is the best!  I've been a customer for years and I always receive incredible products and amazing customer service every time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "william sirk",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T13:49:02.000Z",
          "Titre": "The dvds were great",
          "Contenu": "The dvds were great! Unfortunately your company cannot get the dvds for the next (4th) season of Hudson and Rex, not sure why."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S. Sweeney",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T16:02:42.000Z",
          "Titre": "Got exactly what I ordered in an…",
          "Contenu": "Got exactly what I ordered in an extremely timely manner. Will definitely be ordering from Ioffer again! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven White",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T18:07:57.000Z",
          "Titre": "Because You made my wife and I's dream…",
          "Contenu": "Because You made my wife and I's dream come true by asking me to be able to go on a carnival cruise for the 1st time in our life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 4,
          "Date": "2023-10-24T08:56:18.000Z",
          "Titre": "Everything about this seller is great",
          "Contenu": "Everything about this seller is great.  I've purchased from him many times.  He promptly responds to any questions I have and he ships very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Block",
          "Nb_Reviews": 5,
          "Date": "2023-04-05T20:11:23.000Z",
          "Titre": "mike communicates well and is very…",
          "Contenu": "mike communicates well and is very patient ,also very helpful!! i enjoy purchasing from him! waiting on a large order to arricve , 3rd purchase since discovering website."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ian Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T07:32:23.000Z",
          "Titre": "The Knock.",
          "Contenu": "The Knock was on Australian tv many years ago, but I came to it too late to properly enjoy it. I had searched  online for many years, but all I could find were the first two seasons. One day I Googled and found your site. You had the complete set of episodes, so I ordered it straight away. I'm so happy you were able to help, even though the postage was horrendous. Many thanks, and I will see you again. Ian."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dorry B",
          "Nb_Reviews": 18,
          "Date": "2022-12-07T03:06:13.000Z",
          "Titre": "Great service..",
          "Contenu": "Great service... thank you!! I have placed multiple orders and find iOffer to be swift and efficient. I will be a loyal customer always!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TonyU",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T22:13:18.000Z",
          "Titre": "Married at First Sight Australia Tv…",
          "Contenu": "Married at First Sight Australia Tv Show do not seem to on on regular dvds in stores. These are a good second choice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mike",
          "Nb_Reviews": 4,
          "Date": "2023-09-06T01:52:39.000Z",
          "Titre": "I always enjoy dealing with this…",
          "Contenu": "I always enjoy dealing with this gentleman.  I always get what I order and delivery is very fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Swift",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T20:34:01.000Z",
          "Titre": "They are GREAT!",
          "Contenu": "They are GREAT!! at answering questions. Every DVD has been done very well!!!"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Mark",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T11:06:21.000Z",
          "Titre": "Excellent service and follow up",
          "Contenu": "Excellent service and follow up.  Programs available to download within 2 days.Quality as described and very pleased to watch!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dorry B",
          "Nb_Reviews": 18,
          "Date": "2023-07-22T08:59:26.000Z",
          "Titre": "Great transaction once again",
          "Contenu": "Great transaction once again. Ordered one day, delivered the next. Digital is the only way to go!!! Thanks again, iOffer!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ellen ross",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T23:01:15.000Z",
          "Titre": "Responsive and timely.",
          "Contenu": "The company was timely in sending my purchase, and in following up with me to be sure I was satisfied. In our email communications, the company was very responsive, and this was much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Duntley",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T00:45:03.000Z",
          "Titre": "I purchased a download of a mini series…",
          "Contenu": "I purchased a download of a mini series I wanted to see again..have thoroughly enjoyed having it to view!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tina bevan",
          "Nb_Reviews": 92,
          "Date": "2022-10-22T04:31:59.000Z",
          "Titre": "Great service as ever",
          "Contenu": "Great service as ever, delivery was very slow this time but expected due to royal mail strikes. Thanks guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marilyn Griesemer",
          "Nb_Reviews": 4,
          "Date": "2022-12-01T18:25:29.000Z",
          "Titre": "Secret Santa and Edge of the Garden DVDs…",
          "Contenu": "I was quite satisfied with the DVDs that I received.  Everything received in a timely manner.  Thanks for taking care of my order and your prompt response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Pryor",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T17:05:35.000Z",
          "Titre": "Ioffer had the DVD set I was searching…",
          "Contenu": "Ioffer had the DVD set I was searching for, whichI coldn not find through other sources."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "e.winkler",
          "Nb_Reviews": 3,
          "Date": "2023-09-13T20:31:26.000Z",
          "Titre": "Order was filled correctly",
          "Contenu": "Order was filled correctly, shipped quickly and arrived on time - excellent!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dorry B",
          "Nb_Reviews": 18,
          "Date": "2023-05-17T05:55:42.000Z",
          "Titre": "Order #27 done and dusted",
          "Contenu": "My 27th order is done and dusted. Thank you iOffer Movies - excellent service as always!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Christina Allen",
          "Nb_Reviews": 7,
          "Date": "2023-07-15T23:55:54.000Z",
          "Titre": "I have already given 5 stars in my…",
          "Contenu": "I have already given 5 stars in my review I submitted last week for my purchases.C. Allen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "james spiller",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T19:16:49.000Z",
          "Titre": "Thank you ....Thank you for filling…",
          "Contenu": "Thank you ....Thank you for filling orders of who knows what it could be. Thank you for the extra special added item.  Well appreciated.. Dee"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dorry B",
          "Nb_Reviews": 18,
          "Date": "2023-04-04T00:19:11.000Z",
          "Titre": "Amazing vendor!!!",
          "Contenu": "Fantastic vendor for hard-to-get movies. Service is fast and turn-around is amazing. Thank you, iOffer :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clark",
          "Nb_Reviews": 4,
          "Date": "2023-04-24T20:37:21.000Z",
          "Titre": "The DVDs for Zone Blanche came quickly…",
          "Contenu": "The DVDs for Zone Blanche came quickly and were in playable condition. And the English subtitles were in place as needed. No problems!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tina McNamara",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T22:20:07.000Z",
          "Titre": "Great service",
          "Contenu": "Easy to order,  reliable service, reasonably fast delivery,  also. My favourite place to buy movies, from now on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melody Krause",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T16:12:49.000Z",
          "Titre": "Not everyone in america has streaming",
          "Contenu": "Not everyone in america has streaming.  My brother payed over 600 bucks and a lot of headaches to get his.  I am so fond of this website.  I got two awesome series.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Conlan",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T07:13:10.000Z",
          "Titre": "Dog beth on hunt season 2 3",
          "Contenu": "Awesome service full dvd season 2 3 episodes dog beth on hunt thank you again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Ulrich",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T19:18:46.000Z",
          "Titre": "The quality of my dvds was…",
          "Contenu": "The quality of my dvds was excellent!!!! The picture and sound were great. I will always order from this website. Thank you for doing a great job. I was pleased 100%."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "angela",
          "Nb_Reviews": 4,
          "Date": "2022-11-23T20:47:33.000Z",
          "Titre": "I was easy to order the dvd's I wanted…",
          "Contenu": "I was easy to order the dvd's I wanted they came in a timely manner.  I have spoke to a couple of people from Ioffer movies and they were always friendly and helpful"
        }
      ]
    }
  ]
}