{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ionos.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "BO",
          "Pseudo": "Ivette",
          "Nb_Reviews": 5,
          "Date": "2023-12-21T14:40:35.000Z",
          "Titre": "IONOS owes us more than an apologize",
          "Contenu": "IONOS owes us more than an apologizeWe chose Ionos for his reviews and now we are paying for our decision in trusting you with our bussines.We lost clients and credibility. Now we are speaking about legal consequences.We pay these weeks  what Ionos requested, they (IONOS)  even extended us credit notes because they charge us more than they should have, and know they are blaming Google. We don’t have a direct contract with them, we have a contract with Ionos.We even call several times, not only wasting money with you but time and effort without results.We pay already two days  ago paid AGAIN for the second time an additional license, and today we received another request for the same thing??  Shame of you!  IONOS have to deal internally their business and with their providers or resellers. We us clients don’t need to suffer for that and it speaks poorly of you when you blame others."
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Tamjid Sabbir",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:56:07.000Z",
          "Titre": "I don't know why but I had the worst…",
          "Contenu": "I don't know why but I had the worst experience with ionos.recently I bought a hosting service from Ionos which was an unlimited hosting. When I was buying that hosting I asked one of their agent will I get an SSL certificate for my all domain names or if I had to buy SSL for each domain name on the answer she told me that SSL would be provided with the package. I also had the audio recording of that conversation.But I bought two domains yesterday and didn't get any SSL certificate. when I called them today they said that I have to buy SSL for each of my domains specifically.Isn't it an unethical way to do business by misleading people like this?Please consider my issue as soon as you guys can otherwise I have to complain about you guys."
        },
        {
          "Note": 1,
          "Lieu": "BO",
          "Pseudo": "Ivette",
          "Nb_Reviews": 5,
          "Date": "2023-12-20T00:17:35.000Z",
          "Titre": "Ionos beyond poor Service",
          "Contenu": "Ionos beyond poor ServiceAfter scalating Level 2, there is still no results.We strongly recommend not working with IONOS, they leave you stranded."
        },
        {
          "Note": 1,
          "Lieu": "BO",
          "Pseudo": "Ivette",
          "Nb_Reviews": 5,
          "Date": "2023-12-18T15:56:18.000Z",
          "Titre": "terrible Service frió IONOS",
          "Contenu": "terrible Service from IONOSLast week we had a problem with the service and we did not have technical support on time.today again with the same problem. And there is no solution because the Ionos page has an error to buy licenses.Terrible service!"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Tanveer Sherazi",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T13:41:18.000Z",
          "Titre": "I ordered hosting service they can two…",
          "Contenu": "I ordered hosting service they took two days for reviewing then cancelled by support, They told me order was placed outside USA. then I placed order within USA, The order again cancelled now they told me to reorder'' Their reply\" As per checking with security they do not see any pending order on the account, more likely when the order was place the flag on the account was not been removed yet, we are advise to re order it again today. We do apologize for the inconvenience.\"\""
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Сергій Гончаренко",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:48:12.000Z",
          "Titre": "Currently, they do not serve Ukraine.",
          "Contenu": "First they took the money in advance, then in 20 minutes they blocked my account without sending a single message to my email. After writing to support, after 5 hours I received a message that they do not serve people from my country, Ukraine, although I was able to select Ukraine from the list."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith Prinkey",
          "Nb_Reviews": 5,
          "Date": "2023-12-19T22:16:39.000Z",
          "Titre": "I would NEVER recommend using this…",
          "Contenu": "I would NEVER recommend using this hosting provider for ANYTHING!! Their dedicated servers are NOT truly dedicated and does not have dedicated IP address?? Not only that but the server I bought never worked right from day one and it has been nothing but a battle trying to get a working server or my money back. I requested a refund for over 8 months worth of charges on a server that did not work properly and was given $200 out of over $1000 charged. IONOS is based in Germany and they have different laws and IONOS is operating their servers under German law and have no regard for U.S Consumer laws. They charge for services they never render properly or never rendered at all. Their website has bugs in it and caused my user table to get corrupted and their response was to create a new account, rather than fix the underlying issue causing the corruption.  I will never again buy anything from this German Company and their customer support is horrendous. You call them when your hosting/services do not work and they blame the customer (I have never seen this from a hosting company before) and tell the customer the configuration of their servers, is on the end user?I am not even sure I want to leave my contract ID for fear of retaliation from IONOS. They have once already illegally locked me out of my data with no prior reasoning or communication. They did not even bother contacting me, that is not happening again. This company needs to be investigated, PRONTO!!"
        },
        {
          "Note": 1,
          "Lieu": "BO",
          "Pseudo": "Ivette",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T22:01:56.000Z",
          "Titre": "They have terrible customer service",
          "Contenu": "They have terrible customer service. It's been five days without service and they don't give a solutionThey said: Callback agent and headphoneTemporarily unavailableIONOS Live chatSorry, all our advisers are currently helping other customers. Try again later.Although this morning we received an email with apologies and with the information that the problem was solved, this has not happened and we continue with the same problem without a solution and without Ionos support. a real shame. We do not have our couriers and it causes economic damage."
        },
        {
          "Note": 1,
          "Lieu": "BO",
          "Pseudo": "Ivette",
          "Nb_Reviews": 5,
          "Date": "2023-12-13T02:06:44.000Z",
          "Titre": "The technical support is a real shame",
          "Contenu": "The technical support is a real shame. Today they sent an apology and yet they did not solve the problems, the technician could not solve it, and he has to go up to another technical level and we again have to wait another 48 hours. We have been without support since December 7th. It's been 6 days without their service, and they are ashamed to say that they care about the company?So far no solution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RAUL",
          "Nb_Reviews": 10,
          "Date": "2023-12-14T19:25:23.000Z",
          "Titre": "It was a hassle to cancel",
          "Contenu": "I received an invoice from Ionos stating that I was going to be charged for a yearly renewal (which I thought I had already cancelled) so I tried to cancel online but I had to call them in order to do so. After cancelling I received a confirmation via email and thought that it was settled but the next day I was still charged for the invoice which put my bank account in the negative so I had to rush to the bank before work to deposit funds. Then I called customer service again and I was told that they would refund the charge but I only received a partial refund so I had to call them a third time. And for some reason I received the rest of my refund in three separate increments."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Tctt it Admin",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T14:39:00.000Z",
          "Titre": "Ionos locked me out of my account…",
          "Contenu": "Ionos locked me out of my account because one of my server is \"abusing\" its service. all the server i owned are created for well known organizations in UAE. i had 12 + clients working with me and my entire client websites and service went down. i have been calling the customer care there is no response i have spend $30+ on call only because im doing an international call. there is no real support from company.just because one of my server had issue they locked out everything. i will never trust this organization ever"
        },
        {
          "Note": 1,
          "Pseudo": "Darrell Wilson",
          "Nb_Reviews": 33,
          "Date": "2023-12-01T22:30:23.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "They are always pushing for you to buy but can't support you when you call.  Call for cancellation has taken 30 minutes on hold. Got connected to a non-american who I could not understand and then re-connected to someone who cancelled the contract. They had no idea how the extra product got connected to my account.  This company places you on hold for a long time hoping you will hang up and the billing continues."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Vinnie Ford",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T05:39:23.000Z",
          "Titre": "Worst company",
          "Contenu": "Worst company . It tries to swindle the users by posting wrong invoices. Beware of this service provider. Suddenly from nowhere an invoice will arrive without prior notitifications and they ask you to pay illogical fees or money. The customer support is very very nasty and not proactive. Not at all recommended."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charlie   Watkins",
          "Nb_Reviews": 4,
          "Date": "2023-11-29T23:29:44.000Z",
          "Titre": "I am a currant customer of this company…",
          "Contenu": "I am a currant customer of this company with no website experience. I been with them 2-3 years and things started off great with customers calling and business is great. Lately I get more calls from other hosting companies want my business for better ranking on Goggle. I contacted Ionos and they are trying to up sell me other products. I will be be looking for another web hosting company."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ERo",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T02:28:04.000Z",
          "Titre": "Kept charging me after I cancelled",
          "Contenu": "They kept charging me for web hosting after I had cancelled. Then charged me $80 for SSL despite the fact that I had cancelled. So difficult to get them to refund the money. Always difficult to get any help if there’s an issue. Strongly recommend against using ionos."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Renerio Jr",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T09:30:39.000Z",
          "Titre": "They changed the DNS of my domain without my permission!!!",
          "Contenu": "Was a longtime customer of 1&1 (IONOS) until they really messed up. A cancellation of 1 of 3 contracts with them didn't push through while the other 2 did and so they cancelled my account preventing me to login and manage my domain names. Later they changed the DNS of one of my domains to sedoparking without my permission (yes they did that) even though my domain has not yet expired.And this could have been prevented if they allowed me access to the domains that were active and paid for. Instead, they disabled my customer id. Their customer management architecture is from the 2000's.That was the last straw.Oh and they don't offer email support or at least it doesn't show up on their website. Yes, they really are a business from the 2000's.IONOS is going backwards. Good riddance really. I'm happy with porkbun."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kumar Eklavya",
          "Nb_Reviews": 3,
          "Date": "2023-11-23T05:30:07.000Z",
          "Titre": "Its my 3rd review and ionos people…",
          "Contenu": "Its my 3rd review and ionos people really don't care, they will pretend to be very helpful to customer by posting a very supportive response here, but in reality they are pathetic, they never reply to follow up email. Its been 23 days ans still my service activation is pending. They are just playing with my time and emotion."
        },
        {
          "Note": 1,
          "Pseudo": "David Mabelle",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T21:24:57.000Z",
          "Titre": "Account security team",
          "Contenu": "Account security team - cancels accounts their customerr service team sets up without telling the customer what happened."
        },
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Angie Lister",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:49:36.000Z",
          "Titre": "Incompetent support",
          "Contenu": "Incompetent support. Don’t read emails, ask for info they already have in the email, close tickets as resolved without resolving them, absolute waste of time with no sense of ownership on an issue within their own system and outside our control."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Guy Nawy",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T18:28:53.000Z",
          "Titre": "IF YOU YOU NEED A LITTLE PAIN IN YOUR…",
          "Contenu": "IF YOU YOU NEED A LITTLE PAIN IN YOUR LIFE SIGN UP TO IONOSI have been with them for years (opened an account in France over a decade ago). I have since had just about every issue possible with them. Most recently Visa declined automatic payment because of a security breach they discovered with Ionos. Since automatic payment was not working we tried calling to pay over the phone. Would you believe that the company does not accept credit card payment and forces you to pay via Paypal? The other alternative is bank transfer. We transferred funds - and 10 days after the transfer, their agents were still unable to see if they had arrived. We created a paypal account especially to pay them a second time and were still told repeatedly that it would take them approx 2 business days to get back to us. In the mean time and despite payment, and our repeated calls, they cancelled our contract (how nice)... I have since spent hours on hold with their agents asking to speak to a manager is like telling them a joke. And now they want more money to retrieve our sites from backup because of the mess they created in the first place. We are agency and sent other companies to IONOS - a very painful experience that looked very bad on us. Steer clear unless you love a struggle."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Musial",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:14:02.000Z",
          "Titre": "IONOS service started amazing BUT…",
          "Contenu": "IONOS service started amazing. 24hr support, little to no “hold” times, easy user interface, and great performance regarding e-mail server service. However, when issues began to surface with Outlook compatibility we hit a roadblock. We’ve been working on the issue with IONOS for the past 3 months and the issue remains unresolved. We understand some issues take time but what is the most disappointing is the fact that you CANNOT talk to any supervisor or  level 2 engineer, even though your issue has been assigned to them. And to be clear, we support this protocol however when an issue remains unresolved for months on end, it may make sense to pivot.  Through this experience we also realized IONOS struggles with continuity. Every call is with someone new. It would make more sense to wait until the same representative is available. IONOS offers great products/service WHEN they work. However, if you’re looking for customer support and the ability to talk to a supervisor/engineer, you may be best served with another company."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Catalin",
          "Nb_Reviews": 5,
          "Date": "2023-11-19T04:52:14.000Z",
          "Titre": "do not waste your time with this…",
          "Contenu": "do not waste your time with this comany, they are not smart enough to distinguish between the client and hacker attacks ! their security department is worst than dropping the soap in the showers in prison... Absurd demands, that compromise the identity of clients ! Do not make the mistake to work with them ! Do not make my mistake !!! Now i have to, compromise my identity to a security department thats dumb enough to not recognize an attack , yet want a copy of my documents !!!! INCOMPETENT !!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Gil Cossette",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:29:12.000Z",
          "Titre": "After 8 years you decide to change the…",
          "Contenu": "After 8 years you decide to change the IP causing nothing but problems..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 7,
          "Date": "2023-11-29T05:52:39.000Z",
          "Titre": "NO NO NO to IONOS",
          "Contenu": "I recently tried to get out of a hosting plan I no longer needed but decided to keep my domain registrations with Ionos. Big mistake. I talked to customer support and clearly cancelled these other services, yet they keep charging me for them. They love to bury your information in \"contracts\" that are impossible to understand, and seem to throw in random charges just for the hell of it. Unfortunately, they have no live text chat support but you can call their support line (a number listed without any breaks or punctuation, likely to make you hesitant to dial or just because it's some weird standard based on their German roots) where you'll be put on hold with annoying distorted music obviously intended to make you hang up. After a long wait, I finally got someone on the phone and actually felt sorry for the agent having to take calls from customers angry over her employer's incompetence and fraud. She said she would take care of the problem and issue a refund, but because they didn't follow through last time, I'll believe it when I see it. Learn from my mistake and stay far, far away from these scam-meisters. If I could give them a negative five stars, I would."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kumar Eklavya",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T22:15:27.000Z",
          "Titre": "Its been 20 days and still no work done. Ionos team…",
          "Contenu": "Its been 20 days and still Ionos team is just misleading me with my service activation. From 20 days they have not started my service. After communicating to 8-9 support people, some supervisor still they are just playing with my time. They are just mentioning the case is in 2nd level, 3rd level. But not resolving it. And they are mailing that from 1nov, 2023 to 20 nov, 2023 is just 9 business days. They even don't know how to calculate. It is the worst service provider on the internet. Beware of Ionos."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Hadi baalbaki",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T14:41:54.000Z",
          "Titre": "my account has been canceled with not refund",
          "Contenu": "i purchased the lowest tier vps just to test out their services. the money has been withdrawn from my card and when i try to login it, i get an error saying my account has been canceled. and the money is not refunded. so i though maybe it was a small problem so i tried with a different email and purchased with a different card and the same has happen. account canceled no refund. and the only way to contact them is by phone."
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "Abel Ragira",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T14:03:00.000Z",
          "Titre": "On my ionos panel help area the only…",
          "Contenu": "On my ionos panel help area the only option i get is a phone call, from where i am thats not possible due to unreasonably high charges, and since i don't have a live chat option, i cannot get help in whatever way, i have a serious problem but i can't get help, this Alexcil pilares guy from ionos is useless to me, why can't i just get a live chat or email."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kumar Eklavya",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T21:50:58.000Z",
          "Titre": "This company really don't care about customers and they are scamming",
          "Contenu": "This company really don't care about time, Its been 16 days and till now my service has not started. Every customer service has different answers. They are not giving me exact when my service will start. Very pathetic service from IONOS."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Oskar",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T08:35:54.000Z",
          "Titre": "Beware, This company unreliable. Terrible service and support.",
          "Contenu": "Beware, This company unreliable. Terrible service and support.I bought vps uk data center contract 1 year. After ordered, I received only \"Order Confirmation email\" status showing \"Your order is currently being reviewed\" and I can't login to client area.20 hr passed, I sent email to Support, Billing, Info and try to contact through facebook, X. But terrible support I have not received a response from this company.Today 36 hr passed, I checked my credit card statement, There refunded and canceled my order without explain anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Flummoxed",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T14:43:54.000Z",
          "Titre": "Completely Incompetent",
          "Contenu": "I've been registering domains for decades and registration has always been instant. But IONOS charged my credit card and never registered the domain. I was transferred around and spoke with 5 IONOS reps across 2 days, had my case sent to their \"back-end team\", got multiple promises and written \"confirmations\", but the domain still wasn't  registered.So I registered the domain through another registrar and that worked instantly. Meanwhile, IONOS still had an active order on my account for the same domain.Pathetic and unacceptable. What's the point of being able to reach live agents and having a personal \"consultant\", when they can't even do the most basic of basics?Would never recommend them for anything ever.UPDATE: After I posted this review, IONOS flagged it as fake and it was taken down. I've since provided Trustpilot with evidence everything I said was true so this review was reinstated and marked \"verified\". Just be aware that IONOS is trying to get negative reviews taken down."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T18:13:46.000Z",
          "Titre": "IONOS Customer Service Reps are Rude, Lazy and scammer",
          "Contenu": "Two customer service representatives did the same thing and disappeared without connecting me to tech support after they asked me for my ID and PIN.  You think it is a joke.  That's why I gave you 1 star.  If there was 0, I would have chosen it.  All I needed was the instruction to change the server address for web hosting by another company.   Not recommended at all.  Crazy, rude, and jokers are working here.  Now they are asking TrustPilot to delete this review and they gave me 3 days to give my personal and account information to take revenge.  Otherwise, Trustpilot will delete this review.  You see how they try to suppress the truth??"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Indrajeet Saikia",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:14:24.000Z",
          "Titre": "Real pathetic customer service",
          "Contenu": "Real pathetic customer service. I purchased 5 domains in one transaction. So they put me in one contract. I needed the domain for my sales campaigns, but since it was a single contract I only got 1 email account included for all 5 domains. My query that if I would have gone for 5 different transactions and hence 5 contracts I would have paid the same amount but would have got 5 email accounts included. So why the disadvantage for anyone making a bulk purchase since they are not even getting a discount. No one had an answer."
        },
        {
          "Note": 1,
          "Lieu": "BA",
          "Pseudo": "Sasa Vuksan",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T10:21:48.000Z",
          "Titre": "Paying problem and delete of all data",
          "Contenu": "From my control panel I lost complete contract with hosting and databases. Paying problem was happening for last 6 months. Several retryes made from PayPal and Visa ways of paying. Support did not even try to solve the problem, I got mail from billing that suggested wire transfer that did not go through. A lot of  another details but with this situation and data deletion definetely switching to another provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay Baker",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T21:51:25.000Z",
          "Titre": "Bait & switch",
          "Contenu": "After going through several salespeople and several support technicians, there appears to be a bait and switch policy.  I was told I could lock in pricing for two existing domain transfers for 5 years for less than $150.  The salesman has called to apologize that 5 years locked in pricing is only good for new domain purchases, not existing.  I had already obtained the transfer authorization codes and sat at my computer for hours waiting for them to respond.  I can't believe anything Ionos says anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruno Fernandez",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T18:51:53.000Z",
          "Titre": "poor services",
          "Contenu": "poor services,  jumping with my problem with different phone number, too many contrat for one services,You need learn from godaddy,  it ry with your company  but is hard working with your.respectfully"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Mosu Sina",
          "Nb_Reviews": 2,
          "Date": "2023-10-20T07:22:21.000Z",
          "Titre": "They are domain stealers my domain is missing from months now",
          "Contenu": "\" Contract 61115966 \"They are domain stealers, total thiefs I had my domain with them they changed the company name from 1and1.com to ionos and trasnferred my account to ionos mexico, now when I try to contact ionos mexico they say we cannot speak english and transfer my call to ionos usa where they say we can't do anything, it's been over 2 months back and forth tracing this company.My domain is still missing  Contract 61115966. I need immediate help otherwise I will be taking them to court BBB and every where with FDA with local , state and federal every where."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Zeleniak",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T18:44:44.000Z",
          "Titre": "This message was completely…",
          "Contenu": "This message was completely unnecessary. If this person actually checked my profile they should have seen I have only received a few messages over several years. Archiving those messages is not important to me at this time."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Rahul Dinesh",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T17:55:55.000Z",
          "Titre": "Ionos support is terrible",
          "Contenu": "Ionos support is terrible. They are not just unwilling but adamant in not giving any kind of support. They don't display support email id's on website, instead display phone numbers for ISD calling (in 21st century for hosting support), no chats available on any time of the day. In case you somehow get to their support, they will do absolutely nothing for you. It was cheap so I initially tried it but it is too unreliable for live websites and too much a headache even for a standby server. I think better options are available like name heap VPS which may be little expensive."
        },
        {
          "Note": 1,
          "Lieu": "BJ",
          "Pseudo": "Amad",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T06:02:32.000Z",
          "Titre": "IONOS has the worst website builder on…",
          "Contenu": "IONOS has the worst website builder on the market right now. They completely change the website editor full of AI everywhere. You don't have the freedom to customize your website. They place button everywhere, to edit a simple text you need to click on two buttons. There is no longer website code source. HTML codes on webpage don't update to the last line of code. There is no way to switch to the old version of the website editor. Really frustrating to use."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "MEME Bhai",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T11:31:42.000Z",
          "Titre": "worst customer support",
          "Contenu": "ionos is having worst customer support, i contacted them through email, and live chat.On livechat they said that they are only sales deptOn email they said do not email to this mail, also they said we are 24x7 available, i mean what the hell is this???????where is 24x7 support??????My issue is to install ioncube loader in my web server and i also read their help articles but they are also worst like their support.. Totally disappointment!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mohammed Ibrahim",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:28:59.000Z",
          "Titre": "Friendly and supportive support BUT Server Still DOWN",
          "Contenu": "Friendly and supportive support, did his best to help BUT unfortunately my Server is still DOWN and unreachable for over 2 Days.I was told a ticket to the Data Center team will fix it soon BUT since then, I'm receiving the worst careless support and my SERVER Still DOWN for over 2 days. Connection Timeout for 2 days !!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 39,
          "Date": "2023-10-30T17:33:52.000Z",
          "Titre": "Website down, losing business, not being fixed",
          "Contenu": "Website oldswords.com and dadsvdads.com down now for many hours, not a lot of communications either on when it will get attention and fixed, causing a lot of issues for customers."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Aaa",
          "Nb_Reviews": 8,
          "Date": "2023-09-01T23:52:06.000Z",
          "Titre": "Impossible to place an order",
          "Contenu": "Although the US phone customer service has been nice to me so far, it is pretty much impossible to become a customer. I've made in total 5 orders at 2 separate branches, and still can't use any of their services. The US branch at least tried to explain why they got cancelled, and solutions to fix it.Their email customer service has been absolutely useless though. They don't even answer my questions, I just get generic responses about a different subject."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "William Saunders",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T15:35:45.000Z",
          "Titre": "I will never do business with Ionos again.",
          "Contenu": "There is not enough space or time to write everything I experienced while doing business with these people.  I've been charged when I shouldn't have been charged, I've lost valuable data that cannot be replaced, and unless you get very angry you can't get customer service.There are SO MANY other very reputable companies who can far exceed the terrible incompetence of Ionos.  I have documented proof of my claims here.Update: Despite Ionos attempt to look helpful below.  Both situations they referenced, were so completely far from being “helpful” at all.  And they fail to mention the interaction back around January 2023, that had me reaching out to 3 separate departments for assistance and not getting any response until I threatened to cancel everything.  Not very helpful that time…."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Jay Suthar",
          "Nb_Reviews": 5,
          "Date": "2023-11-04T20:20:48.000Z",
          "Titre": "We have had a rather challenging…",
          "Contenu": "We have had a rather challenging experience with the service provider. Regrettably, none of the contact numbers listed on their website seem to be operational. Our only means of communication has been through email, and we have encountered significant delays, often waiting for 7-8 hours to receive a response. As a result of these technical issues, our entire workforce is currently unable to carry out their duties."
        },
        {
          "Note": 1,
          "Lieu": "IQ",
          "Pseudo": "Muhammad Kanhan",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T22:18:27.000Z",
          "Titre": "I regretfully inform you that IONOS is SCAM",
          "Contenu": "I regretfully inform you that IONOS Hosting Company scammed me. They deleted my account after processing payment. Beware of their dishonest practices.I paid 12$ offer host + domain for 1 year on IONOS then after payment they deleted my account and said this is prevention system and some false things i paid using my own card if thee is something wrong why don't they let me pay! so be careful and this is my customer id 890212580."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Moses",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T19:20:39.000Z",
          "Titre": "I purchased a domain and was supposed…",
          "Contenu": "I purchased a domain and was supposed to have a “personal assistant” help build me a website. I opened the account back in March and here we are in September and all they’ve done is made sure they debited my card on the correct date every month. My personal assistant isn’t very personal as I’ve never spoken to the person. Anyways, I tried to build the site myself and all they do is push upgrades on me and never let me build the site. So for 6 months, I’ve paid for nothing! Thanks IONOS and their security site Acronis doesn’t even mention them anywhere. Starting to wonder if I’m having the rug pulled. Anyways, the attorney general and BBB will be hearing from me!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Shearer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T22:12:28.000Z",
          "Titre": "Customer Service Was Not Listening",
          "Contenu": "It was clear the customer service rep was not listening, or it was AI handling my inquiry.  We will be finding a new company to host our email.  Too many problems to continue to deal with them."
        },
        {
          "Note": 1,
          "Lieu": "IS",
          "Pseudo": "Daniel Maślany",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T03:57:27.000Z",
          "Titre": "They closed my account my account",
          "Contenu": "They closed my account my account, after purchasing a domain for a year. No explanations, nothing. After trying to login unsuccessfully I wrote them an email saying, something is wrong with my account. I've tried numerous times to login, thinking I mixed up the passwords, login, just thinking what went wrong. At the end I got an email response saying my account got closed due to \"security reasons\". Which I understand is a straight up reason to close someones account without any notification or reaching out to resolve the issue they're having. So if you're looking for a service that won't cut your domain off in the middle of the night, look somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Y",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T21:56:24.000Z",
          "Titre": "READ THIS BEFORE PURCHASING ANYTHING FROM IONOS",
          "Contenu": "Before reading any reviews, first click on \"FILTER\" then check the box for \"VERIFIED\" reviews so you are only reading the verified reviews.IONOS is partially responsible for losing my domain costing my company thousands of dollars. They even admitted that their customer service rep was partially at fault for what happened and then offered me a $50 credit towards future business with them.....SERIOUSLY!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Dyck",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T15:57:57.000Z",
          "Titre": "IONOS used to be amazing, but steer clear.",
          "Contenu": "IONOS used to be amazing. I've hosted dozens of domains with them for over a decade. After paying the company thousands of dollars and having never had an issue with billing, they suddenly sent my account to collections and cancelled my contact when my credit card expired. I come to find out that they were sending notices to an old email address I had on file.  I had changed that email address to a new one, but sounds like the change didn't stick or they ignored this change.  I called their 1800 number and the agent spoke with me for a few minutes, then without saying anything put me on hold. That was 15 minutes ago. Every few mins I heard a number pressed, but nobody is returning to the line. I feel disrespected. I finally called back and connected to Kim who was able to find my domains and help me transfer them out of IONOS.I will never do business with this company again. They turned me from from a happy customer who has sent them a lot of referrals over the years into an unhappy one."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Pavel Antonovs",
          "Nb_Reviews": 6,
          "Date": "2023-10-31T10:00:12.000Z",
          "Titre": "Money, Money, Money",
          "Contenu": "First of all, pay attention to the 1 and 2-star rating it is 20+% - SIMPLY DON'T!Escape communicating with the sales department via phone. Let them write you your offer via email. Otherwise, you will be in a situation, where they will sell you via phone, and your 12 months in \"jail\" starts there.They will sign you up and squeeze your money.My story is short - tried the product, didn't work for me, didn't like the customer service and approach in general and all this was in one day after signing.Conclusion - can't cancel anything.IONOS message - We don't care! You signed as a business our termination terms are: \"to squeeze you and your money for the next 12 months contract\". Btw, you have 1 day prior to renewal to cancel your agreement, we hope you will forget it.This review will cost me 720£ gents!Well done IONOS! I hope no one will be in this trap after reading my review.ESCAPE!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M.",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T05:55:25.000Z",
          "Titre": "My projects involving my current…",
          "Contenu": "My projects involving my current website reservations have been delayed. You keep calling me to ask how you can do better... I've told you for the past FIVE phone calls... Don't call me, I'll call you.  you were my first choice, but honestly your aggressiveness is putting me on edge.  Dial back your phone snipers.  Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T16:48:21.000Z",
          "Titre": "Bounced around",
          "Contenu": "Bounced around.   Tried to blame on developer which was inaccurate.  Site was down for weeks until resolved.  Now issue starting all over again."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Matiz Rio",
          "Nb_Reviews": 2,
          "Date": "2023-06-18T20:07:17.000Z",
          "Titre": "Scammed me exactly 14+14=28$",
          "Contenu": "Scammed me exactly 14+14=28$When i request refund for my 2 purchases they locked my acc instead of refunding :D:D biggest scam in world.. stay away guys... if you request refund even 1 day of your purchase.. u will get only ban xDD .. worst hosting ever, they never will give you cpanel access! be careful. also you can't use external domain! this is just manipulation, they don't sell anything. go buy hamburger with my 24 usd."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T17:26:50.000Z",
          "Titre": "Since February I Made the Worst Decision moving to IONOS",
          "Contenu": "Since February, when I shifted my domain to IONOS, I haven't had a moment's peace. I purchased a one-year hosting plan, yet attempts are made to charge me monthly. Upon reviewing my Contracts and Subscriptions, I observed that in addition to the domain I transferred, there is an \"Instant Domain\" option that I don't recall requesting. At present, my domain is active at least until mid-next year, yet the \"Instant Domain\" is demanding $45 after having debited me multiple times previously. This is so unprofessional for a company like yours. I regret knowing you guys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Moreta",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T15:38:38.000Z",
          "Titre": "I had a terrible experience with this…",
          "Contenu": "I had a terrible experience with this company. Their sales team sent me a written offer via email, but when I spent almost two hours on the phone with them to confirm the details, the offer was not honored. Despite their sales rep verifying everything three times and ensuring that what he said could be provided, I was disappointed.I contacted the Customer Service Department, Escalated Support Team, and their Legal Team to resolve the issue. Still, unfortunately, none of them could help me, even after listening to my recorded call and reviewing the email sent to me.This company fails to fulfill its promises!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Guillemot",
          "Nb_Reviews": 7,
          "Date": "2023-09-23T11:54:34.000Z",
          "Titre": "IONOS seems to be almost scamming…",
          "Contenu": "IONOS seems to be almost scamming customers.I purchased a domain which at the time seemed a good price. I then went to use their simple website builder. I do not recall at any time being made aware of any extra charges for this service. They then proceeded to set up monthly billing with a one year contract which \"they cannot cancel\" until the end of the period. I have contacted support and am yet to receive any satisfactory cancellation.UPDATE - I was called back by a supervisor who was able to cancel one of the two? Website contracts set up for the (single) domain and discount the other contract by 50%. The reason for my review is that the process does not at any point make it clear that it is charged as an extra monthly fee and with a fixed renewing contract of one year on top of that.."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Don Ammar",
          "Nb_Reviews": 17,
          "Date": "2023-09-18T16:35:03.000Z",
          "Titre": "that's not a way to deal with customers !",
          "Contenu": "It is no longer possible to log in with these access credentials.If you have cancelled your IONOS contract, the cancellation is now active and your IONOS login has been deleted.that's not a way to deal with customers !"
        },
        {
          "Note": 1,
          "Lieu": "LK",
          "Pseudo": "Romesh Gamadikari",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T17:14:20.000Z",
          "Titre": "Don't buy this worst hosting.",
          "Contenu": "Don't buy this worst hosting.. IONOS hosting provider is not good for startup. I purchased 1o1 wordpress plan they say pay more for install wordpress customer service didn't reply emails, finally i refund it they're no money i received right now. i lost my money don't by this ingenuine hosing.. shame on you, i'm very sad please refund it  !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kurt w",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T18:34:24.000Z",
          "Titre": "Poor UI/UX",
          "Contenu": "Their interface is extremely convoluted and confusing, with things in places that make zero sense. Locating services to manage them is difficult, and identifying contracts and what's contained in them is difficult.Want to cancel your contract? Better make sure it's not just the domain that no longer resides with them! \"You canceled just your domain,\" I'm told. How can I cancel a domain that doesn't exist with you? I moved it to an entirely different registrar. Am I just getting old and confused by things? Perhaps. But I consider myself pretty capable after being in tech for the past 15 years. They need to tighten up the process and make it more clear on what is happening. If I'm canceling contract # 123456, that better be for the entire thing, not the $7 piece that no longer exists in their environment."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "drweb",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T10:25:09.000Z",
          "Titre": "they billed me twice",
          "Contenu": "they billed me twice - locked my account deleted it saying the billing was done in confusion - change support manager - dashboard glitches - they are eating money just i am scared they will deduct my payments several times as of other users. on mail they ask me for verification haha on backend they deleted my account. wth is this system. please avoid them"
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "Quinn",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T11:48:55.000Z",
          "Titre": "\"24/7 support\"",
          "Contenu": "This is literally my only way of contacting this company?No email on the website.Live chat is indefinitely closed.All phone numbers are outside my country.I created an account. Payed the subscription.When I log in it says \"It is no longer possible to log in with these access credentials.\"When I try change my password it says \"The login details you provided are incorrect. You can enter your Customer ID or your domain name.\"literally never even logged in once to this account. Can't even log in to unsubscribe.please respond"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nina Vig",
          "Nb_Reviews": 12,
          "Date": "2023-05-20T17:59:21.000Z",
          "Titre": "Terrible, cannot log on to my website!",
          "Contenu": "Terrible, extremely slow , all day today I could not log in , I have tried calling 4 times I am currently on wait right now but nobody’s answering.I have lost a full day of work today because I cannot get to my website’s bookings , this is a real disaster.Save your money, go with anyone else but ionos total scammers…. Destroying people’s businesses…"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Cristian Castilhos",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T16:11:27.000Z",
          "Titre": "Paid but didn't received Linux VPS",
          "Contenu": "I ordered a VPS Linux Server and they instantly charged my Credit Card but after 10 hours I did not received an email, contract or login acess to control panel. Support seems to be impossible to reach and nobody answer the call.Please, cancel my order and give my money back or release access to my VPS server."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Waqas Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T07:17:24.000Z",
          "Titre": "Extremely nonsense is kind of dirty…",
          "Contenu": "Extremely nonsense is kind of dirty service. I don't have words to describe their nonsense service. I bought RDP from them. Until the payment was made, it was just right, but then he took his scammer. I pay them twice on payment whenever I log in the account, speak that your account has been deleted. Customer service personnel also did not receive any rehearsals. Eating my money, the Forbidden eaters closed the account. I'm not able to give 0 star yet, otherwise I give them 0 star.Worst experience ever"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Usama Ameen",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T19:16:05.000Z",
          "Titre": "They Are Scammers i dont know how they…",
          "Contenu": "They Are Scammers i dont know how they got 5 star reviews i purchased my hosting from ionos on 1st may and they cancelled my contract after 3 days without any reason. I tried many times to get support from ionos but they didn't replied me and never refund my money back."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Jenn",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T13:47:05.000Z",
          "Titre": "No longer a loyal customer",
          "Contenu": "I was a loyal customer of IONOS for years. However, I recently asked for a cancellation & refund on one of my domains. They told me they would credit my account, which was fine. However, I went to log back in and my ENTIRE account was cancelled. I still have active domains with them. I sent them a message regarding this & now they are actually refunding my money. Or at least that's what they're telling me. But I cannot access my existing domains, not even to transfer them to a better company. Shockingly unprofessional behavior"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pawhause Team",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:28:36.000Z",
          "Titre": "GETTING AN ATTORNEY",
          "Contenu": "Getting an attorney due to the fact that I have contacted customer service multiple times and they do NOTHING! I keep getting charged and now they sent me to collections LOL. I already have a dispute with Paypal for money taken out of my account without permission and so many written emails confirming this. This company is run by clowns and they do what they want and have overseas customer service who doesn't know anything about domains or hosting or billing for that matter."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Erica Bruskin",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T13:48:33.000Z",
          "Titre": "Php extention",
          "Contenu": "You sign up to pay a certain amount per month, but super often they make you update to a new php. They charge you extra for php extended support even after you upgrade to the latest php version. You have to do this dance all the time with them, and you end up with super high fees. Do not use Ionos!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Hailey",
          "Nb_Reviews": 3,
          "Date": "2023-04-25T20:12:09.000Z",
          "Titre": "Horrible Customer Service and Fraudlent Charges",
          "Contenu": "Horrible customer service. Purchased basic email a year ago. had to cancel because my INIOS emails were going to my customers junk mail. Problem could never be resolved so I cancelled the email service and switched over to GoDaddy. A year later Im being billed for Microsoft 365 and Web Hosting, two services I didnt even order. 10 phone calls and numerous emails later and the issue is still unresolved. Customer service talks in circles and answers questions with more questions. They continue to bill me for services that I have never ordered. Exhausting. STAY AWAY!!! Use American Based Companies!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ahsan Chaudhary",
          "Nb_Reviews": 6,
          "Date": "2023-05-19T08:13:36.000Z",
          "Titre": "They are scammers dont buy anything",
          "Contenu": "I purchased a domain from Ionos they charge monthly so my payment failed for 1 month they canceled the contract. now I can't log in to my account contacted them multiple times very pathetic service they are saying to contact via phone call i tried no body pick the callvery disappointed stay away guys they are scammers"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Michael O'Callaghan",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T10:08:14.000Z",
          "Titre": "Dissapointing I have to use trust pilot…",
          "Contenu": "27/Apr/2023 update: still now word from them on email, chat or phone.We are looking for another UK host now...25/Apr/2023Disappointing I have to use trust pilot to reach out to ionos. They have no contact details, a robot bot chat and not a single phone number to reach out. Server went offline for 4 hrs due to internal network fault in Ionis network, no warning, no apology, no contact, status status page does not report the outage, our client is unhappy and wants a reason. We are stuck in the middle..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Lance Manning",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T09:14:01.000Z",
          "Titre": "Absolutley terrible experience",
          "Contenu": "Absolutley terrible experience. Multiple request from contact page, and also from \"account manager\" absolutely not one time did they try to contact. Then went to cancel contract and thought I will give them another try with a callback, guess what NO CALLBACK. absolutely TERRIBLE customer service...... ZERO support. DO NOT TRUST anything you see about this company being a reliable business... NOT TRUE..."
        },
        {
          "Note": 1,
          "Lieu": "TW",
          "Pseudo": "JEROME",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T18:56:53.000Z",
          "Titre": "894029239",
          "Contenu": "Customer ID : 894029239Placed an order this morning, took ages, got no VPS and the best, they refunded me and closed my account.I've got no message, no reason.This is the most unprofessional behavior I have ever seen, what's wrong with them ??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Corin Price",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T07:07:44.000Z",
          "Titre": "They should pay you for their \"service\"",
          "Contenu": "If I could give them less than a star I would. I tried to work with these evil Richards for 2 years. Their customer service doesn't want to talk to you, and on those rare occasions when they actually answer the phone they offer no assistance, just want to talk down to you and hang up. I finally transferred my services elsewhere and these money-grubbing wallet demons didn't want to let me go, even used some shady techniques to keep my domain. Now they keep trying to bill me for services they instantly stopped providing the moment my domain moved. They did succeed at getting an extra month of payment for a month of non-existent service. I hope their business burns or freezes in whatever hell they believe in."
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Nuruddin Shohan",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T16:24:06.000Z",
          "Titre": "I can't reinstall the operating system…",
          "Contenu": "I can't reinstall the operating system on my VPS, and the customer support couldn't assist me either. I think for vps provider it is an essential feature to have so that user can reinstall or change os of the vps when ever they want."
        },
        {
          "Note": 1,
          "Lieu": "VI",
          "Pseudo": "Gimi",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T22:50:50.000Z",
          "Titre": "I'm having trouble comprehending the…",
          "Contenu": "I'm having trouble comprehending the source of these rating stars. while It's been over an 30 hour since I submitted my Order, yet my domain remains unreserved. Despite reaching out to customer service, I was informed that it might take nearly 48 hours for the contract to be activated. This extended delay is quite perplexing, especially considering the approaching weekend when operations are halted for vacation. if so, Waiting an additional four days seems unduly challenging.Adding to my bewilderment is the fact that my domain still appears available when I search for it. This situation has left me feeling truly disheartened."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Akhil Chada",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T20:22:52.000Z",
          "Titre": "Misled subscription in form of trial",
          "Contenu": "They asked to purchase a trial for website hosting when purchased DNS as a trial and actually misled to buy 1-year subscription after the trial which was not noticeable on screen. Now they don't open support tickets because the account is locked and deal with DCA. At least check the logs if I have used it in trial/when misled subscription would have been good"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Conybeare",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T23:45:58.000Z",
          "Titre": "Infuriating process to get website back live",
          "Contenu": "Nearly a month has past and can't get website back online after missing an email to renew URL subscription. Multiple calls on hold, emails that bounce and with a waste of a response in reply. Sent the wrong details to me to pay and get back live and still not back live even though I have paid twice into two different wire transfers. Infuriating!"
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Wasim Alturki",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T08:08:13.000Z",
          "Titre": "The connection to the server is completely disconnected",
          "Contenu": "They have very fast and excellent serversBut I encountered a problem, that is, the network connection to the server is disconnected every dayAll of a sudden, the sites stop working, and I can't access ssh, whm, or even the console in their server control panel.I sent them an email about it three days agoThey only answered me once and said the problem is not with the server or their serviceThey told me that I can log into the consoleI answered them and explained them more than once, but there are no responses or solutions yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacqueline H.",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T02:12:04.000Z",
          "Titre": "I was going to purchase Ionos, but reading reviews scared me",
          "Contenu": "I was going to purchase Ionos, but now I am scared after reading the reviews. I know absolutely nothing about setting up a website, and reading the negative reviews has scared me away from making my purchase today even though when reviewing different companies I chose Ionos as my first choice. Is this even recommended for a beginner?"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "yak adnane",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T10:17:07.000Z",
          "Titre": "Evil company",
          "Contenu": "if you cancel your contract they'll confirm the cancelation after 2 months from the day you asked them to do it"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Lucia Hargasova",
          "Nb_Reviews": 22,
          "Date": "2023-09-22T13:39:22.000Z",
          "Titre": "What a disaster",
          "Contenu": "What a disaster. I have had a change in my bank card as my credit card expired, after I called to pay with Paypal while my new card arrived (using business one), they disconnected my website. On 3 calls with customer service that is unhelpful and just has no idea. So my business has no website since 3 weeks  and there is no accountability or explanation.On top of all of this they now confirmed they deleted all by details website without informing me and I get a message from their local team I should be moving the review? Surely they should be picking up the phone and calling their colleagues to sort it and not rudely replaying to review. It just shows you should stay away from a company that takes no accountability for their errors which has dramatic impact on people’s business I am based in London uk Business has now confirmed they have deleted without warning all data and just said they are sorry. That is simply not good enough"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron Mullen",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T18:19:46.000Z",
          "Titre": "Loyal customer for years and years, no more",
          "Contenu": "Loyal customer for years and years, recommending them to many clients.  Then I had my credit card stolen so I cancelled it and didn't think to update my details with them.  Only one month after I finally remembered and updated and paid my invoices.  Then they still did not fix the issue and forced me to pay a \"redemption charge\" on top of everything.  I will not be recommending them anymore and once this contract is up I will be moving to another service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Favour",
          "Nb_Reviews": 2,
          "Date": "2023-04-25T13:36:56.000Z",
          "Titre": "DO NOT BUY. TERRIBLE CUSTOMER SUPPORT",
          "Contenu": "Why will you automatically add web hosting exert to my contract without my approval. the web hosting expert that doesn't even reply to me.Your customer support is so terrible. i called and was kept on wait for nearly an hour before i got frustrated and ended the call. i sent a message to one Chito to deactivate the web hosting expert  subscription i never made two months ago which i never requested for and he didn't deactivate it only to discover my domains were now locked. very terrible and i won't even recommend to enemies.Note: they also cut off calls when you call them just so they can run away from what they do."
        },
        {
          "Note": 1,
          "Lieu": "AZ",
          "Pseudo": "Kamran Ata",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T13:10:37.000Z",
          "Titre": "Blocked my money",
          "Contenu": "I like their website. I wanted to buy a hosting package. I entered my Paypal account, the payment appeared, but then it did not continue because it gave an error. Currently, the amount appears to be blocked in my account. Chats are not working so I can contact. There is no e-mail either. Calling their numbers will cost me more than what I pay for hosting"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Albert Nel",
          "Nb_Reviews": 5,
          "Date": "2023-04-24T08:55:04.000Z",
          "Titre": "What an utterly frustrating and…",
          "Contenu": "What an utterly frustrating and terrible experience. This companies administration is useless and incompetent to say the least.  They cock up their invoices, then charge you insane amounts of money, then lock all your paid up contracts due to them not rectifying anything on their end.  They are totally useless and you will lose money and your businesses that are hosted with them will just simply be blocked and turned off. Their customer support is useless. I have been trying to rectify this issue for over a month now every day. And you get the same tone deaf dumb automated responses from their support, cancellations, and client retention departments. DO NOT RECOMMEND. You have been warned."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Naryan",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:48:30.000Z",
          "Titre": "Will attempt to charge you extra fees…",
          "Contenu": "Will attempt to charge you extra fees (£33 in my case, simply for not needing the service anymore), they will class it as a \"late payment fee\" and sell your debt to thuggish 3rd party debt collecting agencies such as 'Arvato Financial Solutions' who will attempt to bully you unlawfully into paying, sending letters to your registered addresses etc.If you want to deal with a company who doesn't try and take the mick out of its customers on the back end then this one probably isn't the one for you."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Tarvinder Singh",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T07:11:59.000Z",
          "Titre": "I purchased a domain last year",
          "Contenu": "I purchased a domain last year, but I canceled this year. Even After they diduct my money from my Credit card. Even I dont have account. I just want to be my money refundend. My domain was Phantomxmedia.in"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T23:21:02.000Z",
          "Titre": "You've lost a customer."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Yves",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T05:52:59.000Z",
          "Titre": "This company is a FRAUD",
          "Contenu": "I finished all the verifications with sms and everything, they charge the VPS and then I cannot login to the account and it says it's cancelled."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stewart Kennedy",
          "Nb_Reviews": 13,
          "Date": "2023-08-26T16:28:50.000Z",
          "Titre": "Go to GODADDY and save yourself the hassle",
          "Contenu": "I Initially gave IONOS a good rating however after placing the order and providing feedback then being charged no contract was forthcoming and having to contact via their chat which was like drawing back teeth told it can take 24-48hrs for further security. When it was put to them that the domains were still available to be purchased on other domain sites their response was yes.So the effort it takes to open a business your website dreams could be taken away in 48hrs when someone buys the domain before IONOS reserve the domain. Went to GODADDY and the service was instant, the service a lot better and customer friendly. Website design I found far better.  IONOS needs to take a good look at themselves. All you are is a company that sells names and hosts websites something that I can do on a synology server. Ironically after I canceled the transaction and received refund I received email claiming the transaction had been rejected due to issue with the payment.Clearly a company that doesn’t know what its doing.  Your service is poor and will not buy from you again."
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "hassan amehry",
          "Nb_Reviews": 3,
          "Date": "2023-07-02T08:36:30.000Z",
          "Titre": "Scammers : Stay away from this scammers",
          "Contenu": "Scammers :i have bought a Plus hosting plan but i haven't received anything , the worst part is that you can't even contact them , total waste of time i don't recommend it , i was trying to buy hosting plan but instead i got scammed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Dean",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T21:52:37.000Z",
          "Titre": "IONOSO IS DISHONEST AND CORRUPT. THEY LITERALLY STEAL MONEY FROM YOU!!",
          "Contenu": "I have never had the contempt for an organization as I have for IONOS. Their mission is clearly to authorized charge as much money as they can and mislead you as much as possible in order to make those authorized charges. I was offered a dedicated game server for $33.00/ month. Not only was the server  not compatible to meet my need, AS I WAS TOLD IT WAS, I received duplicate 'authorizations'  for over a total of $150.00. After 11 calls to agents and 3 supervisors. I have yet to get my $150 back and its been a week now. I will be filing a complaint with the Better Business Bureau and the State Attorney Generals Office. I would never recommend dealing with such a corrupt organization."
        },
        {
          "Note": 1,
          "Lieu": "BD",
          "Pseudo": "Md Ariful Islam",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T12:41:01.000Z",
          "Titre": "They took my order didnt give service and not refund",
          "Contenu": "They took my order successfully and Deducted my card amount. And said they will take 48 hours to process my order. But after passing that 48 hours they says they couldn't process my order and show me a cause of billing address. Even if they don't refund my amount and close all of the options to contact them."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Stin Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T07:01:51.000Z",
          "Titre": "VERY BAD.",
          "Contenu": "When I tried to sign up with them, they instantly deducted my money for their hosting package. However, I was unable to complete the sign-up process as they sent an error page. How crazy is that?! I have been waiting for the account for the last two days, but there is no option to contact them from my country, the UAE. I haven't received an \"IONOS Customer ID\" to chat with them, and there is no phone support available here. If you don't care about customers from places like Dubai, it would be better to block your website in our country. I had been using HostGator for over 10 years before trying IONOS, and I must say HostGator is far better in terms of customer support and hosting. I will definitely dispute this charge on PayPal. Thank you for this amazing experience."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Horrct",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T20:32:39.000Z",
          "Titre": "The company where you pay twice for your VPS",
          "Contenu": "Ordered a 1GB VPS on Ionos for something I needed to host, paid in full, was like £2, though it took around an hour and a half to deploy my VPS, and then about a day later they tried to get me to pay the invoice for a second time. Now that doesn't make much sense now does it? Would recommend staying away from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dagim",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T03:16:03.000Z",
          "Titre": "SCAMMERS",
          "Contenu": "They processed a refund, left a reminder for my refund bcz I needed to update my card, now they are claiming they can’t give me the refund and want me to send them proof of transactions/bank info. They attempted an unauthorized charge and when that didn’t work they are saying they never took any money because that charge declined, but this charge was a seperate charge from the one that was supposed to be refunded. These guys are 100% scammers"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Bassem KM",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T19:49:37.000Z",
          "Titre": "Worst website to use",
          "Contenu": "Worst website to use. Just subscribed and paid their basic package and got an error \"It is no longer possible to log in with these access credentials.\". Its a scam and there is no support whatsoever. Avoid."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Manny Sarmiento",
          "Nb_Reviews": 12,
          "Date": "2023-12-17T18:41:21.000Z",
          "Titre": "IONOS continues to add Unwanted Charges to My Hosting Packages!",
          "Contenu": "IONOS continues to add PHP support without my permission on several of my hosting packages and domains. I was charged for months without notice over $10 for PHP Support They keep raising prices and fees and adding additional services without asking..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael F.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T04:36:39.000Z",
          "Titre": "The person I worked with was very…",
          "Contenu": "The person I worked with was very professional and polite, but he was not able to answer my technical questions. I asked if I could speak to someone with python experience and after a brief hold he told me no one at the company had the capability to help me with my python application. That's hard to believe since python is installed in my web space by default. I needed help with a Linux/python problem and was unable to get it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Claudia Clemens",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:11:48.000Z",
          "Titre": "I was told by Lamar to call my bank due…",
          "Contenu": "I was told by Lamar to call my bank due to the reservation fee and have them release the hold. I called the bank and the bank advised me that Ionos needs to reverse the authorization so I was on the phone for a second time resolving the issues that Ionos created."
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "Zohaib",
          "Nb_Reviews": 4,
          "Date": "2023-11-08T20:57:04.000Z",
          "Titre": "Upfront Payment, No Service",
          "Contenu": "I opted for IONOS trial service with 30 days back money back guarantee. I was charged one month fee upfront however I have not been provided sign up details yet. There is no customer support available except calling them which I cannot call. It's been 2 days, I am eagerly waiting to use the service which I payed for. Unfortunately IONOS disappointed me"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Paul Wilson",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T02:46:48.000Z",
          "Titre": "Outside US do not bother",
          "Contenu": "For someone in New Zealand - this company is no more than a scam merchant. I gave it two as the services offered worked - barely. But come the time to move on - oh how IONOS have used the scammer's playbook to the full. I a, currently 1 hr 30 mins into queueing to get authorisation from them to cancel my own contract.  Disgraceful customer service and why I won't invest any more time or money in them. All I want to do is cancel my contract - and yes you make it impossible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Landon Shelpman",
          "Nb_Reviews": 2,
          "Date": "2023-11-05T18:16:28.000Z",
          "Titre": "It is a good starter program but does…",
          "Contenu": "It is a good starter program but does not allow the accessibility or ease to run a medium scale operation. I will be moving to another platform next year but content with what I have now."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "MR K",
          "Nb_Reviews": 7,
          "Date": "2022-12-29T12:49:54.000Z",
          "Titre": "Worst Webhosting Ever.",
          "Contenu": "Very difficult to contact and ask for help. I would prefer live chat support. WORST OF THE WORST. There is no 24/7 support and I do not know what are they doing as I am just buying the domains and some weird hostings that did not belong to me appear.*NEW UPDATES*So far, 2 people called me. 1 of them just hung up and never called back. The other kept having bad reception. I am desperately looking for help, and they have no 24/7 live chat support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raymond",
          "Nb_Reviews": 5,
          "Date": "2023-08-29T14:33:15.000Z",
          "Titre": "Awful billing",
          "Contenu": "Awful billing.  When I cancelled my vps services, they screwed up my invoices and kept charging me.  This caused serious hassles and a ridiculous amount of my time wasted having to call them several times."
        },
        {
          "Note": 2,
          "Lieu": "PE",
          "Pseudo": "Alessandro Fonseca",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T05:38:22.000Z",
          "Titre": "Hidden charges and a never-ending contract",
          "Contenu": "Used the service for a while. Normally they attract you with a good price and then charge you for really basic services like SSL. They don't allow you to use free services for example. I'm giving 2 stars because they did reimburse me when canceling my contract but they keep sending me charges over a terminated service. I have to enter and cancel contracts that have been already canceled over and over again. I had to cancel the credit card because they will never stop charging me. A nightmare."
        },
        {
          "Note": 2,
          "Lieu": "MZ",
          "Pseudo": "Edilson Geraldo Gilberto Ernes",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T10:48:14.000Z",
          "Titre": "No support in Mozambique",
          "Contenu": "Look, the services are great but lake coverage in some countries. In this case Mozambique. As Mozambican, I had to fake South Afrikan Address to get your services.I know many who quit because they don't have or don't know any South Afrikan Address"
        },
        {
          "Note": 2,
          "Lieu": "PK",
          "Pseudo": "DRobox Team",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T19:40:06.000Z",
          "Titre": "Sign up",
          "Contenu": "I heard about IONOS and thought to give it a try, butI am not able to access it yet and have signed up also, payment has been made and deducted from my account but still I haven't got any response yet or access. I am getting this error:\"It is no longer possible to log in with these access credentials.If you have canceled your IONOS contract, the cancellation is now active and your IONOS login has been deleted.\"As a new customer, It's kind of disappointing as new to see first impressions and never experience such with other hosts. My payment is also not be reversed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Henley",
          "Nb_Reviews": 2,
          "Date": "2023-02-10T21:56:42.000Z",
          "Titre": "Didn't care at all",
          "Contenu": "I had a domain in a subdomain, and I asked them to delete my subdomain. Somehow my main domain got deleted I lost my entire website, which was a big ordeal cost me some business for several days and 100 hours of work they seem to not really care. I moved my business to go daddy and couldn’t be happier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Thomas",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T17:51:45.000Z",
          "Titre": "too many changes",
          "Contenu": "too many changes to make your site \"pretty\" instead of functional and easy to navigate to where I need to go, and your \"help\" is very poorly explained.I have had 1and1 for over 20+ years, and frankly it was easier to use in the beginning.... looks like your employees are bored, or trying to keep their jobs with all the changes .Also, used to be more option without costs, now you charge extra for everything. I am looking seriously at going to another provider."
        },
        {
          "Note": 2,
          "Lieu": "BD",
          "Pseudo": "sanwar",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T10:12:46.000Z",
          "Titre": "BAD BAD customer service",
          "Contenu": "Bought My 3rd VPS,I suffered a lot at my 1st VPS with their poor customer service. then i bought my 2nd one but the 2nd one was smooth experience as they didn't do any weird security check manually which takes eternity!my this time im really sad and pissed with their service.I emailed their support yet no respond like the previous one.I bought my vps 12 HOURS AGO!!!its still setting up!So i know you guys always check your reviews. then please knock your customer service section and tell them to solve my goddamn issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "LFB",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:35:34.000Z",
          "Titre": "Frustrating",
          "Contenu": "Don’t think the agent had any idea what I was trying to find out!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ginna S.",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T02:09:37.000Z",
          "Titre": "Email replies undeliverable with 'permanent error'",
          "Contenu": "Suddenly my email replies to my sister and other friends are bouncing back as having 'permanent errors'. This is happening to the point that I have to preface every email reply by saying 'Please let me know if you got this.\" I logged into my email account and looked everywhere for contact information for IONOS support. Instead, I kept getting directed to the same list of FAQs which did not apply. When I finally found a support phone number (I had to do a google search in order to find it!), I was asked for my PIN - no way to get one, as it turns out, because my husband is the account holder. It's a ridiculous maze to go through to get help! Anyone who is on the account should be able to get assistance without having to jump through hoops.   The only thing that saved this from being a one star review is that the person I got in touch with was actually really nice and provided me with an email address for the postmaster to resolve my situation."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Zooed Zudster",
          "Nb_Reviews": 8,
          "Date": "2021-01-18T16:58:14.000Z",
          "Titre": "This domain may not be transferred",
          "Contenu": "Constantly get \"This domain may not be transferred.” when trying to transfer my domains from my old host to ionos. I contact the host with the domain and they say nothing is locked. I have the Domain Authorization code but cant get past that message! this is the 2nd time trying to transfer to ionos."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Vickers",
          "Nb_Reviews": 2,
          "Date": "2023-05-15T13:58:28.000Z",
          "Titre": "Delay in use due to second email not arriving.",
          "Contenu": "Giving a 2 because I purchased a domain yesterday morning and I am still waiting for email with contract so I can start use. Email says \"Shortly\". So far not a good start."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacquelyne Allen",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T01:39:47.000Z",
          "Titre": "No title",
          "Contenu": "One of your agents actually talked me out of buying from you. Everything is sold alacarte. You need some packages. I need a domain, hosting and building ability in one package. I ended up getting what I need but it took 4 phone calls."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Anil Reddy",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T08:03:14.000Z",
          "Titre": "Big Scam",
          "Contenu": "Update-2: I wrote an email to their social media team and they helped me in transferring the domain. But they are not able to help me to restore the website. I have an account with namecheap and they are happy to restore my website even after 2 months of expiry. I expect that level of customer service from brands like ionos which looks like a farfetched expectation.Update: After I posted this reviews, they have asked for details. I have provided the same but haven't yet received reply. They even stopped replying to emails. I beg every one not to loose your money, time and efforts by trusting fraud companies like these. I have disable auto-renewal of my web hosting plan. I do have a domain registered for 2 years. Now they have deleted my account completely because I have disabled the autorenewal of my hosting plan. Does that make any sense? Inspite of emailing the support team multiple times, they are repeating the same thing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Ross",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T15:11:55.000Z",
          "Titre": "I have been working on reactivating our…",
          "Contenu": "I have been working on reactivating our domain name since 10/18/22, it is now 11/8/2022.  Explanations of the process have been almost zero.  My expectation that since this is a web based company it would be a much faster and  easier process.  When I contacted customer service, the back ground noise was so loud I could not hear the representative."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fred Reyes",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T04:02:59.000Z",
          "Titre": "I upgraded from My Website Now to My Website Creator",
          "Contenu": "I upgraded from My Website Now to My Website Creator and it said this could take several days. That's not acceptable when a small business has a mission started and now has to wait for upgrade completion. Not good for any business to have to wait. Regretful upgrade if it takes days as stated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frankie Breedlove",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T01:44:24.000Z",
          "Titre": "The quick start templates are limited",
          "Contenu": "The quick start templates are limited, as they cover a very small percentage of website possibilities.  I purchased a website for a retail shop and none of the templates are related to online purchasing of any type of consumer goods."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T22:14:15.000Z",
          "Titre": "At the moment, not impressed",
          "Contenu": "They have been running me around for 4 days now trying to figure out an issue with a server that is crucial to my website. Everyone is passing the buck and no one has any idea what is happening or the status of the matter."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Athorn",
          "Nb_Reviews": 2,
          "Date": "2022-11-09T19:32:08.000Z",
          "Titre": "Same as always",
          "Contenu": "Like always with you guys, I spent as much time declining your attempts to upsell me as I should have had to spend in total."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adrian",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T03:42:17.000Z",
          "Titre": ":(( asdf",
          "Contenu": "it was not clear that I was going to have only 1 google user for the emails"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcin Ludowicz",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T03:58:44.000Z",
          "Titre": "I keep on using you since I am to busy…",
          "Contenu": "I keep on using you since I am to busy to do anything with my websites. At some point if they earn $$$ I might use you more but at this point I find you cumbersome to use. I own one site on godaddy.com and it was for some friends and not for future earning $$$. I might start using them for all my websites. I have not decide yet."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Kilpatrick",
          "Nb_Reviews": 3,
          "Date": "2022-09-05T16:58:35.000Z",
          "Titre": "Unclear Instructions; Best Tech Support",
          "Contenu": "Ionos has the best tech help because it's outsourced to a land where people believe in working for a living and earning their pay.  Which is good, because you will need it as Ionos makes it hard to figure out how to set up a WordPress website, and even harder when you need multiple websites.  Ionos please post easy-to-find simple directions - include that link when you send those emails letting people know the site is ready. And take the time to make a step by step video.EDIT - there you go - same old stock and canned reply Ionos gives to everyone. I have to take away a few stars for this nonsense.  Ionos makes website development hard labor."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "G a c h a T e a",
          "Nb_Reviews": 5,
          "Date": "2022-11-03T07:28:07.000Z",
          "Titre": "We need a cpanel like feel",
          "Contenu": "We need a cpanel like feel, like the old cpanel navigations that are easy and straight forward."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Bob",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T10:41:57.755Z",
          "Titre": "Servers are fast but very limited…",
          "Contenu": "Servers are fast but very limited resources such as easy back ups, installers etc. Support is ok but no ticket or chat app options. Very heavy on the spamming in your user area. File manager is very slow and small window space and reverts back to root folder every time you view a file.You can get good server space that runs very fast for the first year. I do not suggest for novices though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Mayfield",
          "Nb_Reviews": 2,
          "Date": "2022-04-09T23:59:25.000Z",
          "Titre": "I like your service potential",
          "Contenu": "I like your service potential.  You appear to have much technical support potential, but I need someone to walk the process with me.  I am a senior citizen with little experience in computer technology.  I want my web page to help increase my income providing training and selling my books.  My web site is called extreme poverty eliminated.com and I cannot tell if anyone is looking at my web page at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "What a hassle",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T22:55:41.000Z",
          "Titre": "I forgot to use a referral link",
          "Contenu": "I forgot to use my friend's referral link and will have to cancel to get it associated correctly. I'm trying to cancel, that is to say. The cancellations department is overwhelmed and after 2 transfers I ended up hanging up and sending an email.If this was not my fault I'd have given 1 star. It is a frustrating experience to have to cancel just to get an account referral straightened out.Bumping it down to 2 stars for the hassle it takes leaving a review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nickolaus Kell",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T19:59:51.000Z",
          "Titre": "Worst call center of people!!!! Insulted me calling me a liar.",
          "Contenu": "Worst call center of people who don't listen to anything I'm saying and just let me go on and on about everything to just tell me every thing I just told them and for them to tell me they have no idea what they are doing and won't tell me what they can do for me only what they can't i swear they work for tmobile too it was a nightmare with the same type of help from call center. I paid $12 for the website builder plus for the year this is after I thought I purchaced it the day before but my card was never charged so I did make sure it went through this time and I was doing fine designing my site then I hit publish and went out of the editor for a minute and when I went to go back to it I was unable to locate the page and when I was suppose to be redirected to it, then it just never did. I'm unable to find away back to edit my site that I was working on and Noone seems to understand anything I tell them and proceeds to insult me with making me repeat myself over and over and being treated like I'm dumb and that it's my fault and then I was a liar when I told the guys I purchaced the web builder and he told me \"no you didn't\" I have PROOF ON MY CREDIT CARD. I've never been treated so badly and like I was a liar like that before. I'm beyond upset and I'm afraid to call again to get this resolved because I'm not going to be treated like I know what I'm talking about and I'll have to sit through someone ignoring everything I said and then tell me I didn't purchase anything and it's not showing in my account which I know all this, I called to tell you that and for you to figure it out. I was also denied my request for a supervisor when he refused to find my credit card that was charged in your system for the web builder because I wanted him to find the proof and paper trail of my purchase to find out why its not showing in my account I was denied any type of effort or remedy to my issues. I can only imagine what today is going to be like when I call."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "Moh Rif",
          "Nb_Reviews": 5,
          "Date": "2022-06-18T13:22:59.000Z",
          "Titre": "Slow webmail, useless editor, slow or no fixes, just sad",
          "Contenu": "Terrible hosting if you intend on having a website with good traffic. Having opened multiple websites due to the low prices, I have begun to migrate every single one of them. One more is left and I need to migrate it asap. The problems start with the domain hosting itself. When I use the Wordpress editor there is 500 Error for over a month. Customer support can reproduce it and they provide a temporary solution which is also frustrating to use. The webmail is terribly slow on forwarding essential emails and the process to reach your inbox is like hunting treasure with a treasure map lolFixes are extremely slow, but charges to your card are perfectly on time though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Mcabee",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T11:49:45.000Z",
          "Titre": "I registered my domain yesterday as a…",
          "Contenu": "I registered my domain yesterday as a package deal. I received a confirmation and all of a sudden my domain is no longer a part of my portfolio? So I had to pay another $10 to retrieve it. Really Ionos it is best to practice what you advertise and confirm."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy Logan",
          "Nb_Reviews": 5,
          "Date": "2021-12-24T18:57:19.000Z",
          "Titre": "Avoid if possible…",
          "Contenu": "Service is fairly cheap for the first year. But aft wards it gets pricey. No refunds on services you no longer want. Control panel is complicated. Hosting service is even more complicated... Recommendation: Register your domain and then transfer it to a hosting provider that has cpanel..."
        },
        {
          "Note": 2,
          "Lieu": "KH",
          "Pseudo": "Savongz Lyna",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T13:30:04.000Z",
          "Titre": "I am a new customer",
          "Contenu": "I am a new customer. I do not have any experience with IONOS, yet.But I see that IONOS has no 24/7 Support Team. Like this time, I have to wait till 9:00pm CST and at your site will be 9:00am EST. Which at this time sometimes, I am going to bed already."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NotLovingIonos",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T23:33:59.000Z",
          "Titre": "Always upselling you",
          "Contenu": "Always upselling you, always making you dig into fine print to get things like PHP Extended Support removed.... The best help I received from them was from their Facebook / Social Media Team. But every time I log into Ionos to buy another domain, I worked up because I know I'll have to go looking for whatever bloat they are selling me behind the scenes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Philip Lawson",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T21:03:23.000Z",
          "Titre": "There are a few TRICKS when I try to…",
          "Contenu": "There are a few TRICKS when I try to renew my domain. The renew gets automatically reset to 2 years , instead of the 1 year I always choose. Also, Auto-renew gets set back on, when I NEVER choose auto-renew. I then have to go into the setting to change it. However, it tells me that changing the settings is temporarily down, so I have to wait a day and come back. If I find a company that doesn't employ this tricks, I'm transferring my domain."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Jesus Rocks",
          "Nb_Reviews": 2,
          "Date": "2022-07-28T20:56:13.000Z",
          "Titre": "Refunded",
          "Contenu": "Edited: Thanks to Tara Willis who assisted in getting me a refund. Wish it was done before needing to write such a negative review. I’ve added a star for the effort to help satisfy this unhappy customer. Hopefully Ionos will improve the way they do some things. Thiefs & liars is all I can say. Charged me for a domain that I transfered and said it renewed before the transfer. Then I refused to pay they blocked my account which still had another domain of mine. Then the story changed and they said the charges is for the remaining domain and they will unblock account. Paid the amount. Could still not get into account and then got notice that the remaining domain is due for renewal. I tranfered immediately but still was out $15 which was supposed to be for that domain."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "I Love Journey",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T21:44:09.000Z",
          "Titre": "Do not buy",
          "Contenu": "Their prices are really good but do not buy into the hype! As soon as I made a purchase they put it on hold and requested immense amounts of documents and IDs... never seen before on any host. they give FAX as option in 2021! They collect huge amount of data (even entering your account settings is a chore as they require additional data)Their customer support helped with understanding what was wrong with my account well so one star goes to them. Not so blazing fast but OK."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Uyeshitia",
          "Nb_Reviews": 2,
          "Date": "2022-03-17T14:54:32.000Z",
          "Titre": "your services are good",
          "Contenu": "your services are good, however the billing and the contract set up is not customer friendly.  i have inquired about having all of my contracts combined to on single due date and was told that I would have to redo all of my contracts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Les Pio",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T23:53:44.000Z",
          "Titre": "The performance checker is either fake…",
          "Contenu": "The performance checker is either fake or does not work, I have linked my site to other sites, and have many likes on Facebook but it shows none. Then all the site does is offer me more things to buy as if I don't already have this working. I have contacted Google and yelp and other sites on my own to check these facts, Bing is another that helps. I get better information off Google and Bing for free the Ionos for pay. I have 2 sites on here. So my overall opinion is you don't supply your clients with truthful information. I company would think you would want your clints to be at the top of the list."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brady Hale",
          "Nb_Reviews": 3,
          "Date": "2021-07-21T18:22:20.000Z",
          "Titre": "Yesterday the system would not even…",
          "Contenu": "Yesterday the system would not even allow me to register new domains. Errorcode: 103001. Today I have screenshots that it SAYS it was successful but it still froze, got caught in a loop when I was trying to purchase through shopping cart, and now domain isn't even showing up in domain list."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diego Leon",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T20:09:27.000Z",
          "Titre": "your system took my oldest info and…",
          "Contenu": "your system took my oldest info and prefilled the domain registrar with that. I tried to change it before the order, but still it did not allow me to do so, when I unchecked \"use this info with your registrar\" it took me to a new page to add the new address info, but when finishing it took again the old information and did not allow me to change it. Either I start the process again and enter the same loop, or I lose the domain, had to accept the wrong information. Improve your system forms!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Eric Pfrot",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T03:37:34.000Z",
          "Titre": "Difficulty processing my payments both…",
          "Contenu": "Difficulty processing my payments both for recurring payments (it assumes if my card bounces a payment I must have a new card because well aren't we all perfect in times of corona?) and doesn't auto attempt again it sends it to collections, or for new payments (the website just backtracks for everything if you miss a single section and you end up doing everything like 5 times to complete it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scates PE",
          "Nb_Reviews": 1,
          "Date": "2020-05-22T00:59:49.000Z",
          "Titre": "Too much \"Don't you want to buy more\" screens",
          "Contenu": "I have used 1and1/ionos for years, but today when I needed to register a new domain, I hit a dead end on their iPhone app. Could add to cart, but could not buy. So I went to full computer to purchase, and it forced me to click through 5 or 6 screens of \"don't you want to buy something else\" screens before finally completing the purchase.It is not a good idea to annoy your long-term customers."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Scott Kingdon",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T03:03:07.000Z",
          "Titre": "Your website is VERY confusing",
          "Contenu": "Your website is VERY confusing. I have never understood how to navigate it, order new products, make changes to existing products that I have. I can't even find out a clear idea of what products I am paying for and what they do. Nothing about your site makes any sense."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mich",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T03:46:32.000Z",
          "Titre": "Pros & Cons.  Summary: Up-sell nightmare navigating site.",
          "Contenu": "Pros:Low/competitive pricing for basic hosting services.Cons:Navigating the site & control panel to do basic things to set up is a total nightmare- you have constantly dodge subtle up-sells for every action, and backtrack.  I do not recommend this service others trying to make their own site, unless they are an expert.  Even then  I still dont recommend.  too much time has been wasted navigating and dodging up-sells"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raquel Velez",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T15:01:17.000Z",
          "Titre": "1&1 used to feel like the maverick of…",
          "Contenu": "1&1 used to feel like the maverick of the web space to me. Not anymore. The website is slow, cumbersome and excruciating to use. This is 2020. No registrar of domain names should be oblivious to their own web presence. The only reason I came back to ionos.com is because I have secured other web addresses with them from the past. I know it's not necessary, but it makes record-keeping simpler. I have no reason to recommend their services above  anyone else's right now. I wish I did."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phillip Gilliam",
          "Nb_Reviews": 5,
          "Date": "2019-08-06T16:56:06.000Z",
          "Titre": "I almost accidentally agreed to private…",
          "Contenu": "I almost accidentally agreed to private registration because you try to push the add on features. When I want to buy a URL, I just want the URL. I don't want to struggle how to buy something when I am paying for a service. Make it easy and clear what I am getting and if you want to offer add on products, fine, but make it easy and clear how to simply buy what you desire without confusion."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 2,
          "Date": "2019-11-04T17:51:54.000Z",
          "Titre": "Good prices but poor service at front end",
          "Contenu": "Good prices. Poor service at front end. The agents over the weekend on Customer Service line gave me incorrect information about plan term length that I could get longer if i called back to speak to retention. Agent this morning was abrupt and not helpful. I cannot readily navigate page to find the product type names and she wouldn't probe to assist."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike T",
          "Nb_Reviews": 2,
          "Date": "2019-07-23T18:05:52.000Z",
          "Titre": "Easy to set up an account, misleading time frame",
          "Contenu": "Easy to set up an account, but the sales pitch is misleading.  They say a VPS can be set up in about 55 seconds.  When you get through the payment and log in to your account, that 55 seconds turns in to 48 hours.I will give them credit for quickly answering questions on the phone before ordering a VPS.  If their support is as good after the fact, then I'll be impressed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elijah Reeves",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T06:46:24.000Z",
          "Titre": "I wanted a separate package",
          "Contenu": "I wanted a separate package, separate credit card and name information and something easy to use and all my domains are together. Now I probably have to call to try and get it separated if possible. This is a separate business with different names. I thought that when I logged in that I would have a choice to go to one or the other package but they are all together. Also, to even send an opinion you have to jump through hoops."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kandice Heller",
          "Nb_Reviews": 5,
          "Date": "2019-04-26T16:58:34.000Z",
          "Titre": "I am very confused about this and don't…",
          "Contenu": "I am very confused about this and don't understand what I am paying for.  i feel like I was talked into this by the person who contacted me and I have no idea what I am doing and what this does for me.  I just want my Etsy shop to be able to be found using this domain name and not my old domain name.  I hope I am no longer paying for two domain names and I think I am.  I am so confused."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremiah Ebenzee Spence",
          "Nb_Reviews": 2,
          "Date": "2019-11-10T15:07:40.000Z",
          "Titre": "Link to my.ionos.com",
          "Contenu": "There needs to be a link to get back to Websites & Stores and other My.Ionos.com products after a purchase. I noted this link was not available on the customized view, which shows my order confirmation. I also noted that I was signed out of Ionos.com after I made a domain name purchase.  This is inconvenient and should be addressed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DaveT",
          "Nb_Reviews": 1,
          "Date": "2020-04-04T18:41:35.000Z",
          "Titre": "Ionos Customer Service is Poor",
          "Contenu": "I was trying to downgrade my service and I tried twice contacting customer service and while their email responses were full of helpful attitude they ultimately failed to do anything.  I finally figured out how to do it myself on their web site without as much as a pointer on where to start.  The only thing that keeps me with them is the hassle to change over my domain to another provider.  Fortunately their price is competitive within the industry, otherwise I would have changed for sure."
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "Scott",
          "Nb_Reviews": 5,
          "Date": "2019-04-20T22:19:36.000Z",
          "Titre": "Been with 1&1 for about 10 years now",
          "Contenu": "Been with 1&1 for about 10 years now - I've slowly been migrating my domains to another company - I'll be glad when I'm done with them - customer service is horrible, websites are slow, control page is a mess, basic things don't work (I can't even update my address because the 1&1 database thinks it knows my address better than I and won't allow a suite number).  I'll be so glad when I'm done with 1&1."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RWE",
          "Nb_Reviews": 2,
          "Date": "2019-08-21T02:10:38.000Z",
          "Titre": "Hard to find domain tools that allow…",
          "Contenu": "Hard to find domain tools that allow you to manage payments.  If you don't know where they are, you have to wade through a bunch of sales pitches to find anything.  Also, if you want to disable the auto-renewal on a domain, the tool is not always available.  I'm not real crazy about the way they run their business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zachary Guidry",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T12:00:48.000Z",
          "Titre": "Ionos switched me to an 'upgraded' plan…",
          "Contenu": "Ionos switched me to an 'upgraded' plan (more expensive) without my input. Suddenly I had a project. I expect any provider to make my job easier. The website hosting is fine, but the control panel could be easier to use. Changing my plan and price without my input is not an outstanding move."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Albert",
          "Nb_Reviews": 1,
          "Date": "2021-09-06T20:12:36.000Z",
          "Titre": "Forced to Upgrade?",
          "Contenu": "I feel like I've been strong-armed into upgrading my shop.  I'm a new business owner and just starting out and because I want to enter the dimensions on my items in order to accurately reflect shipping for my customers, I'm forced to upgrade yet AGAIN.  At this juncture, it seems more prudent to leave and go to Shopify, as they charge $29/month for their basic package and I don't have this bait and switch stuff to deal with.  I've used Ionos for years, and I'm happy with everything, despite the learning curve, but today I'm upset with how I was misled to think this plan would help me launch a business."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ERA",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T18:02:25.000Z",
          "Titre": "Expensive and do not give the option to…",
          "Contenu": "Expensive and do not give the option to protect our information from the worldwide webWhen signing up did not give a 3 yr renewal option - only 1 year - interface could be more intuitive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mr Springest",
          "Nb_Reviews": 2,
          "Date": "2020-06-05T22:37:33.000Z",
          "Titre": "Generally good",
          "Contenu": "Generally good - although twice in the last week when I tried to 'check-out', my order (using Firefox) produced an error and I lost all my order details and had to start all over using MS Edge - this worked - but obviously there is system-error condition at work ?!?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sean Epps",
          "Nb_Reviews": 1,
          "Date": "2021-01-04T21:52:23.000Z",
          "Titre": "Hinderance in order process",
          "Contenu": "My contact information was shown incorrectly even after correcting it. The order feature also needs to be adjusted to allows customers to correct information at the order page if incorrect as opposed to removing all items from their cart and starting again."
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "Надежда Перемен",
          "Nb_Reviews": 2,
          "Date": "2019-06-08T22:30:42.000Z",
          "Titre": "Prices for services change every day",
          "Contenu": "Prices for services change every day, if you want services for a long time, I highly do not recommend ionos, ordering a service today for $ 1 after the completion of a contract, the cost of this service may increase several times, and if you have an automatic payment you will lose your money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "illusioNtv",
          "Nb_Reviews": 1,
          "Date": "2019-08-22T17:07:57.000Z",
          "Titre": "Interface is not what you would…",
          "Contenu": "Interface is not what you would expect...I ordered one domain and then I also ordered business web hosting because they were doing a promotion for $1 plus a free domain. The domains were set up fast as well as the web server, only to find that they were experiencing web host issues and some users websites were unavailable.. Overall the interface was clunky, slow, and basic. Does not even have actual cpanel. I had to cancel within a half hour after placing my order. Now I am waiting for my domain to be available so that I can repurchase at GoDaddy."
        },
        {
          "Note": 2,
          "Lieu": "TT",
          "Pseudo": "Trinidad and Tobago",
          "Nb_Reviews": 1,
          "Date": "2019-08-22T03:12:09.000Z",
          "Titre": "I got some great deal but pricing is…",
          "Contenu": "I got some great deal but pricing is not transparent and it's impossible to search for the same package that I used already. I clicked on a domain. Once to purchase and there was an affordable cost. I tried it again and it gave me the domain for free. This see fishy to me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vesta",
          "Nb_Reviews": 2,
          "Date": "2020-06-07T13:10:16.000Z",
          "Titre": "First..when i call and try to get help…",
          "Contenu": "First..when i call and try to get help and i get a team member of my consultant Tom whoever.  The men i have talked to talk to me like im stupid. One said to call back when i baaically get it together before i call back. SecondYour site is a lil confusing"
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Jesus Antonio Moreno Ortiz",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T03:37:54.000Z",
          "Titre": "It's not fair to pay again an ionos domain to be migrated",
          "Contenu": "I didn't know was necessary to pay again when the domain is going to be migrated to another ionos account In spite of I have paid all the year the domain before from the original ionos account.I don't think is fair."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marshall Baker",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T15:08:27.000Z",
          "Titre": "Been with ionos/1and1 for years",
          "Contenu": "Been with ionos/1and1 for years - they keep making contract changes without advance notice and make it difficult to change contracts without effecting other contracts and other domains.  Would not recommend."
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Ludimila Theodora Rimoli De Medeiros",
          "Nb_Reviews": 1,
          "Date": "2019-09-17T18:40:17.000Z",
          "Titre": "i can´t pay using my international…",
          "Contenu": "i can´t pay using my international prepayd card ( mastercard ) i can´t select a new contract and so, i can´t have all benefits for 1 year free domain and 1 month U$ 1,00 web host. i don´t know whats happen.thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luke Scherba",
          "Nb_Reviews": 6,
          "Date": "2019-09-24T18:18:39.000Z",
          "Titre": "The 1&1 IONOS  control panel is very…",
          "Contenu": "The 1&1 IONOS  control panel is very slow. Domain cancelations are near impossible. I have used them for 13 years and have somewhere between 50 and 100 domains with them, including hosting and email accounts. So I don't want to migrate away. However, I would not recommend them anymore. I wish they would improve their control panel speed and stop making it so difficult to turn off the auto-renew on domains.They do offer good customer support. They are always quick to fix my issues or answer my questions. Though they always seem a little annoyed when I call. I just have to remind myself that they are nerds, not social butterflies."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deisy Suarez",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T16:50:29.000Z",
          "Titre": "While registering domains is very easy…",
          "Contenu": "I do NOT recommend their Hosting serviceWhile registering domains is very easy and reasonably priced the actual management of those domains once you purchase them is made incredibly difficult if you also use their hosting services."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rowan Smith",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T01:02:32.000Z",
          "Titre": "Overcharged significantly without apology or reimbursement",
          "Contenu": "The company, first as 1&1 and now as IONOS, billed me for months at different levels FOR THE EXACT SAME SERVICE despite 3 conversations with representatives to stop it (including the support rep who actually discovered the problem and told me about it).  They even twice sent one of my accounts to a collections agency when I wouldn't pay 3 times for the same thing.  To this day I have still not gotten an apology, much less a refund.I rated it 2 stars instead of 1 because they provide a decent technical service.  It is their customer support that failed; outsourced or not (as was their argument) the company is responsible for their representatives actions and decisions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom Cole",
          "Nb_Reviews": 4,
          "Date": "2021-02-02T02:51:19.000Z",
          "Titre": "Less than thrilled with Ionos",
          "Contenu": "I have been using Ionos (previously 1 and 1) for years and find them adequate in most areas. Recently I have been less satisfied with their service. According to their support team, their email system does not support DKIM. This is ridiculous for a business focused provider. DKIM, along with DMARC and SPF are the gold standard for email delivery. Without DKIM configured properly, many MX servers simply drop your email. Almost every email I send to a Gmail user ends up in their SPAM folder. Emails to Microsoft and Outlook.com accounts are  lost completely and never delivered. I am moving my email to another provider and is things don't change I will be moving all my other domains elsewhere as well."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T15:02:44.000Z",
          "Titre": "Hosting packages and webspace are badly…",
          "Contenu": "Hosting packages and webspace are badly and confusingly marketed giving misleading information. Webspace packages are poorly explained and require 3rd party hosting which is not explained. Also difficult to navigate and manage."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Mauro",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T00:59:51.000Z",
          "Titre": "It wasn't clear I needed to transfer…",
          "Contenu": "It wasn't clear I needed to transfer the domain to another contract to get it to work. You should highlight that better or make the text in that section bigger."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jason Temple",
          "Nb_Reviews": 1,
          "Date": "2019-08-24T08:38:10.000Z",
          "Titre": "Their vps are stated as being managed",
          "Contenu": "Their vps are stated as being managed. But they aren't.Help with dns as their system doesn't automatically add basic records when you add a domain? No chance. Your site doesn't load despite all configurations and server logs saying all is OK? They ignore you.Canr connect via ftp even though you're using the right settings, no chance. And that's if you can find your ftp login details, as the on site help points to a page in your control panel that doesn't exist. Very good packages, but this is UNMANAGED vps hosting. So if you don't know how to set up plesk and don't want to ssh into apache to sort stuff out, then you're screwed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alicia McKenzie",
          "Nb_Reviews": 2,
          "Date": "2020-10-02T22:26:57.000Z",
          "Titre": "Prices are high and no option for 5 or…",
          "Contenu": "Prices are high and no option for 5 or 10 yrs at a discount. Also, I have to order domains one at a time.  Frustrating.....I only go through this website because my son will not let me use Godaddy which I love."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joshua Fowle",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T19:03:43.000Z",
          "Titre": "Customer Service Failed",
          "Contenu": "I really did not mind this company until I realized that my payments didn't make it through. Same day my stuff was canceled they gave me the run around, wouldn't let me pay with my card on file and shut me down for days over a simple $16 error. This was no issue to pay but they refused to use the card I had on file and made me go through paypal. In return they shut my site down for 3 days maybe more to verify the funds. While I get it, I don't. It's $16 which is not a lot and it could have easily been handled over the phone but instead they told me the only way was via paypal and a 3 day wait. Now my company and site are down for an entire weekend which are my best times for clients."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MJ",
          "Nb_Reviews": 4,
          "Date": "2019-07-16T19:51:01.000Z",
          "Titre": "I'm still with them because I do not…",
          "Contenu": "I'm still with them because I do not have the time to transfer everything away.  When I do have the time, I will be gone. Too many errors and miscues.  Seems like they are down a lot lately. Not much to keep me here."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Long time customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-06T17:27:16.000Z",
          "Titre": "Many many rate changes over the years",
          "Contenu": "Many many rate changes over the years. Each change has required losing security features or storage features unless you pay more. Makes it difficult to have confidence in a basic website like a blog or portfolio."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MD",
          "Nb_Reviews": 3,
          "Date": "2022-10-30T22:41:32.000Z",
          "Titre": "Buttons don't work sometimes",
          "Contenu": "Buttons don't work sometimes. Navigation is unclear."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robin",
          "Nb_Reviews": 1,
          "Date": "2021-06-13T09:54:46.000Z",
          "Titre": "I have been with IONOS for many years…",
          "Contenu": "I have been with IONOS for many years and never had any problem with their service until recently. I downgraded my package to a less expensive one because I am on a fixed income. They told me they would transfer my files and database to my new package and there would be no extra charge for that. Apparently they didn't transfer all my files which caused my website to not work. After calling them they told me I would have to pay $70 to have my website restored. They are charging me for the mistakes THEY made! I couldn't believe it. It was their responsibility to transfer my files...not mine. Unfortunately I have to pay the fee because I have no other ways to get my files and database. Once my contract with them is up I will be finding a new company to host my website."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "James Pasden",
          "Nb_Reviews": 4,
          "Date": "2019-10-26T14:12:20.000Z",
          "Titre": "I like the previous version of your…",
          "Contenu": "I like the previous version of your website. This one has to many buttons to click to get to where you want, or back to where you started. This was an annoying process today compared to previous purchases."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "John Kemic",
          "Nb_Reviews": 3,
          "Date": "2019-05-25T09:22:48.000Z",
          "Titre": "Was unable to edit my address during…",
          "Contenu": "Was unable to edit my address during purchase.  Will instead need to waste at least a half hour my time and that of customer service do this simple task at a later date.  Simple things should be simple."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Callan Richardson",
          "Nb_Reviews": 10,
          "Date": "2020-10-15T15:36:36.000Z",
          "Titre": "LONG TIME CUSTOMER",
          "Contenu": "LONG TIME CUSTOMERDisappointed in receiving no support regarding the referral programme. I have been a ling time customer of 1 and 1 and I have never been informed of a referral programme in which I could earn commission for recommendations. I spoke to customer service who said nothing can be done despite me signing up 4 people in recent months and it needs to be done before. If they are successful recommendations that can be proven I really don't see the difference whether it's done before or after. 1 and 1 just don't want to hold up their end of the bargain.The person I spoke to was happy for me to cancel all my accounts and move on so that's what I'll be doing - I don't know whether to be sad about leaving after years or laugh at the shocking service!"
        },
        {
          "Note": 2,
          "Lieu": "MT",
          "Pseudo": "Alex James",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T13:24:34.000Z",
          "Titre": "Manual renew for multiple domains is a pain!",
          "Contenu": "Manual renew for multiple domains is a pain! With other providers you can do it in one click. ionos takes forever and thousands of windows."
        },
        {
          "Note": 2,
          "Lieu": "LK",
          "Pseudo": "Janaka Wijeyesinghe",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T07:21:00.000Z",
          "Titre": "The site is not user-friendly",
          "Contenu": "The site is not user-friendly, as a website display consultant I found it extremely difficult to navigate through the site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Miles Perry",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T19:15:21.000Z",
          "Titre": "The terms of the online store deal were…",
          "Contenu": "The terms of the online store deal were unclear and now im paying extra for a domain advertised as a part of the deal for my store."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ionos customer",
          "Nb_Reviews": 4,
          "Date": "2020-12-11T16:21:13.000Z",
          "Titre": "Too many upsell options",
          "Contenu": "Too many upsell options. Also, the mobile app only partially works when purchasing stuff it wants everything in a desktop layout instead of mobile making it hard to navigate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Necdet Kurul",
          "Nb_Reviews": 1,
          "Date": "2019-06-20T10:21:05.000Z",
          "Titre": "Cancelling unwanted packages (which…",
          "Contenu": "Cancelling unwanted packages (which were added when I was not looking) is made difficult. Very slow. The pages are designed to get me mistakenly add packages I don't want or need."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Michael Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T06:02:28.000Z",
          "Titre": "Why are domains $1 for the first year…",
          "Contenu": "Why are domains $1 for the first year before I log-in to my account....but then $10 for the first year after I log-in?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven D",
          "Nb_Reviews": 4,
          "Date": "2021-09-27T11:32:55.000Z",
          "Titre": "6 pages to register a domain because ur…",
          "Contenu": "6 pages to register a domain because ur  trying to pimp all kinds of add ons... Then more ads and more offers.... this is no longer for developers anymore"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Robinson",
          "Nb_Reviews": 1,
          "Date": "2021-06-15T15:45:35.000Z",
          "Titre": "Site is not easy to navigate nor user…",
          "Contenu": "Site is not easy to navigate nor user friendly I simply wanted to get en email/ Domain name and 45 minutes later I am still trying to verify that it is complete"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Eric Laflamme",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T11:18:54.000Z",
          "Titre": "1 week and can't say I'm impressed…",
          "Contenu": "I'm a client of IONOS for not even 1 week and I've seen bug over bug with aquiring domain to making a credit card paiement I'm giving them a last chance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Bruce",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T18:18:09.000Z",
          "Titre": "Your mobile web experience is horrible",
          "Contenu": "Your mobile web experience is horrible. In just trying to navigate to see if a domain was available the top menu was blocking my screen and nothing was responsive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Felix",
          "Nb_Reviews": 3,
          "Date": "2022-12-03T03:24:58.000Z",
          "Titre": "the most user-unfriendly experience in…",
          "Contenu": "the most user-unfriendly experience in my 20+ years of hosting websites for myself and others. I would give 1 star, but for $12/year it was worth trying.Username - u831030261Database name - db646157968etc. - you got the pointFor some reason only one database in MySQL db instanceNo support for PKI (passwordless) authentication. Does *anyone* use passwords any more???And many other weird ways to make user life miserable. I can go on and on!Oh, and for some reason - I am now getting IONOS commercial every 10 minutes."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Woods",
          "Nb_Reviews": 2,
          "Date": "2022-09-14T04:26:51.000Z",
          "Titre": "Email stopped working after one week.",
          "Contenu": "Email stopped working after one week.Will contact them tomorrow and see what's up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Capt'n Mike",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T21:15:50.000Z",
          "Titre": "Help - Not Here!",
          "Contenu": "I have several contracts with Ionos - recently I purchased a new domain for an upcoming concert.  For over a week, it has shown I am locked out of the account.  I have called three times, each time given a different story and told to wait.  Today on the third call, the agent said it was an issue on their side, he could not tell me when it would be fixed.  He then stated, and you can probably still go buy that domain ... I bought the domain a week ago......  After advising that was unacceptable - he asked me to hold where I remained for over an hour, never to be reconnected - I have to say customer service with experience - not there.  Non U.S. support centers - they feel is okay to leave you hanging or just not to return to the call.  Now I own a domain (I THINK) and being hosted by IONOS (I THINK) they are having me pay for - when they can't even get it to work."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Rise Company",
          "Nb_Reviews": 7,
          "Date": "2023-12-05T17:39:30.000Z",
          "Titre": "IONOS Don't Serve Egypt !",
          "Contenu": "IONOS Don't Serve Egypt ! why ?We want to buy a dedicated server from IONOS but we can't because they don't list EGYPT in their registration form.We Know that IONOS is a good company provide high quality, reasonable price and 5 stars support, Hope to see you accept Egypt one day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "M. Anthony Lopez-Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:11:41.000Z",
          "Titre": "solutions/support take many iterations",
          "Contenu": "solutions/support take many iterations; ultimately get solved but in mini-steps with a lot of interaction"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Cassilly",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:47:48.000Z",
          "Titre": "This person was very polite and…",
          "Contenu": "This person was very polite and helpful. I would suggest that she get a greater mastery of the English language."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Cook",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T00:32:01.000Z",
          "Titre": "Hard for new customer",
          "Contenu": "Hard for new customer. Support is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryce Bernard",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:06:45.000Z",
          "Titre": "Email went down too often",
          "Contenu": "Email went down too often. My emails were constantly blocked for spam reasons though I don't use my email for such things. I attempted to convert to a 365 account through Ionos customer support and followed their instructions, however it never worked. Hosting service seemed fine though I felt the price was high for a basic WordPress site. Customer Service, when used, seemed to bounce me around quite a bit. Was a customer for around 20 years but problems and lack of solutions made me search for alternatives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T19:23:15.000Z",
          "Titre": "The rep great. company policy not so much",
          "Contenu": "The rep was absolutely great. I don't like the company raising rates suddenly without any warning."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Sean Terzi",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T19:10:54.000Z",
          "Titre": "The problem of this company is the website",
          "Contenu": "The problem of this company is the website.I already noticed that the website of this company dosen't work well and is really fragile and not secure. I will honestly review the website since I found multiple errors:- Logout when the product is clicked - Multiple accounts, accounts based on costumer ID instead of email and with one email you can create thousands of account but still can log in with one without the costumer ID- Difficult to reach the Web Chat to talk to the costumer service. Even thought you can easily call them is hard to find the web chat to talk to the costumer service. Since I will pay to call an American Number I prefer writing but is really hard to find the chat.Even thought the company have some structural errors offers really good products and I will still use them but please fix the errors I showed you."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Rahul Dinesh",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T06:33:26.000Z",
          "Titre": "Deceptive help and support system",
          "Contenu": "You can barely contact customer care. I am unsucessful in many days. I have purchased their plan and this is what their conatct page say. 1. Instead of giving their email id it displays: \"Do you doubt the authenticity of an email from IONOS?Check the authenticity of a IONOS email\"2. Landphone number without ISD code (They have offices in multiple countries yet do not show ISD code for support staff.3. Live chat (never available): Displays \"Temporarily unavailable IONOS Live chatSorry, all our advisers are currently helping other customers. Try again later.\"Even though I liked their plan and features and the cost, their help and support system is deceptive. They are purposefully avoiding customer contact. You cannot contact them for emergency."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T11:44:41.000Z",
          "Titre": "Order canceled without follow-up",
          "Contenu": "Bought yearly plan and was charged for first month, since 2 weeks trying to login without success. Emailed support, no response. I thought they are reputed, but seems it's a scam. Blocked my card, just in case.UPDATE: After submitting my review here, IONOS support emailed me and explained that the contact details I provided were not accepted. The transaction was cancelled. However, I would have appreciated an explanation upfront, there was no follow-up besides the order confirmation. Tank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LadyHolly",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T01:48:38.000Z",
          "Titre": "online better than on the phone",
          "Contenu": "the representative was a little confusing and hard to hear. He specifically changed information I had already entered on the web. I am happy with the current promotion but that took a half hour for no reason. Also CashApp cards not being accepted should mcome up as a warning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kal",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T00:26:16.000Z",
          "Titre": "Web is brilliant",
          "Contenu": "Web is brilliant, but getting to talk to tech support people who are fully trained did not work out.  This was my first call, so I am going to call back and try again, hopefully with someone else."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:56:49.000Z",
          "Titre": "I love that I can talk to a real person…",
          "Contenu": "I love that I can talk to a real person and get answers and help. Aysaha is great and helpful. Not happy with the fact that what I saw advertised online was a $1.00 a month for a yr and then $12. a month the following year and the contract sent to me says, $1. for 1 month and then $14.00 per month. THAT IS NOT What was shown online nor what we discussed. So already I have to resolve an issue. Not what I expected and now a bit leery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VALUED CUSTOMER",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T04:03:42.000Z",
          "Titre": "Needless file reloading",
          "Contenu": "When editing a file online and saving it, the entire process of reloading it again must be done if you do another edit. Very inconvenient."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "spiros mitzinis",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T20:58:49.000Z",
          "Titre": "Great service but one thing i don't…",
          "Contenu": "Great service but one thing i don't like is how i can't see what I will be charge for renewal online."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jose Dieck",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T19:59:56.000Z",
          "Titre": "Consultant was able to help but abuse…",
          "Contenu": "Consultant was able to help but abuse management was unreachable to help with my issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Harris",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T22:10:26.000Z",
          "Titre": "Confused and struggling",
          "Contenu": "As soon as I setup my account, there is no agent to speak with online, why?  I received my domain, uploaded my files but the image is not appearing as it does on my desktop, why?  I have a consultant but no way to chat with them but by calling a number, why not online?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaime Villasenor",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T23:53:32.000Z",
          "Titre": "my domain is not online yet?",
          "Contenu": "Had a small issue but got a an email right away and fixed my problem  in a politely and quick manner thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Blake",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T20:59:51.000Z",
          "Titre": "Reinstalling images literally takes 5 hours…",
          "Contenu": "Reinstalling images literally takes hours...  and for some reason I've had to sit through these 5 hour reinstalls because it just would stop letting me connect to it.  It would say its online but I couldn't do anything with it, so I just decided to reinstall the image so I can even use it.I really like the millions of features but I think I was given a really buggy server, I don't know what's going on but I haven't gotten to use my server at all yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eli Aronoff",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T22:46:58.000Z",
          "Titre": "I did not like having to call to cancel…",
          "Contenu": "I did not like having to call to cancel my contract."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mekonnen Mohammed",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T04:09:07.000Z",
          "Titre": "The tools are not easy to understand",
          "Contenu": "The tools on this app are not easy to use and understand. I CREATED a domain and STRUGGLED to connect with droplets DNS server but it takes long time and till not working. I have tried to follow some you-tube videos to understand the IONOS platform.I just deleted all subscriptions, and I am not using any IONOS product now, but they took 119.00 from my credit card on November 27, 2022,  so I like to ask IONOS  please refund my money"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peltro",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T22:30:11.000Z",
          "Titre": "Good but...",
          "Contenu": "The site offers a lot of features but it is confusing to navigate.It is also not always clear what you are buying or signing -up for."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "TheHonestPrussian",
          "Nb_Reviews": 63,
          "Date": "2023-04-13T19:05:32.000Z",
          "Titre": "I have always found Ionos to be really…",
          "Contenu": "========================================Update: Just as I left them a glowing review, they go down hill. All their inbound email communications are blocked, I'm getting payment reminders for contracts that have been cancelled (only to be inaccurately told that the payment reminder was for another  completely unrelated contract that I have with them - which was not in arrears either), and now I can't update the domain Admin-C and Reg-C information as the information I'm providing is apparently inaccurate. Evidently there's something going on with this company and they're having major teething problems. =======================================I have always found Ionos to be really good, I have used them for several instant domain and web hosting packages for a number of years, and they all live up to expectation and in all honesty, I can't think of any using any competitor of theirs.  Although one time, years ago, I did try using Microsoft Azure as a web hosting provider where you end up selling your sanity just to get one web page on the 'interwebs' never mind a whole site! However, with Ionos, it's literally a new clicks of the mouse, and boom, website is online!"
        },
        {
          "Note": 3,
          "Lieu": "BQ",
          "Pseudo": "Betty Wills",
          "Nb_Reviews": 4,
          "Date": "2023-01-19T11:44:17.000Z",
          "Titre": "Don't fully understand what we are…",
          "Contenu": "Don't fully understand what we are purchasing or how to access it without going further into the website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe R.",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T15:31:30.000Z",
          "Titre": "Domain registration is a little more…",
          "Contenu": "Domain registration is a little more than other places and there is no discount for multiple years. SSL is an extra $20/year, which is more than the domain itself."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Kilpatrick",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T01:36:57.000Z",
          "Titre": "Hard to Set Up",
          "Contenu": "Ionos makes the user guess each step in buying a URL and hosting space. They don't even provide video to show you how to get it set up. It's ridiculous. However, they still get 3 stars because the overseas help desk they contract with is very good. I've used them plenty to fix things that Ionos's carelessness brokes"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roberto Jose Jimenez Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T23:31:14.000Z",
          "Titre": "I have constantly problem with my…",
          "Contenu": "I have constantly problem with my access page in can you contact me Please"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rob Burross",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T01:30:24.000Z",
          "Titre": "The website isn’t very intuitive",
          "Contenu": "The website isn’t very intuitive. In addition, I chose to add the “free” domain quill-enterprises.online domain, yet haven’t seen it mentioned anywhere."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Holly Machado",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T19:13:01.000Z",
          "Titre": "Hard to navigate the website & made me…",
          "Contenu": "Hard to navigate the website & made me continue payment multiple times"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy Turner",
          "Nb_Reviews": 3,
          "Date": "2023-09-04T18:03:48.000Z",
          "Titre": "I can't find a good template for my…",
          "Contenu": "I can't find a good template for my ministry. You don't have enough to choose from."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JH",
          "Nb_Reviews": 2,
          "Date": "2022-11-23T23:49:54.000Z",
          "Titre": "I had much better black friday deals…",
          "Contenu": "I had much better black friday deals until I logged in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence Daressa",
          "Nb_Reviews": 4,
          "Date": "2022-10-19T00:41:29.000Z",
          "Titre": "Not a Smooth Start",
          "Contenu": "1) Inflexible address registration (apartment before street address)2) site inverted street address (street before number)3) Business hosting option hard to find4) Server down first time I tried to register"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda Poe",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T21:05:17.000Z",
          "Titre": "Attn: IONOS!",
          "Contenu": "Honestly, I’m having a hard time. I can’t sign in on my tablet, I can’t properly edit and create my website because the view doesn’t work on my phone. I purchased a domain but when I tried to make an email it says I don’t own one so this purchase is just so I can try again. It was remarkably easy to purchase this but so far, all I’ve done is hemorrhage $ for products I CAN’T USE… This is not what I envisioned from IONOS."
        },
        {
          "Note": 3,
          "Lieu": "UG",
          "Pseudo": "Unonymous",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T09:40:17.000Z",
          "Titre": "everything is good till need customer care",
          "Contenu": "everything is good till need customer care... especially for us in other countries. Send an email and are replied to after over 12 hours, to complete a single issue may require over 4 days for a mere three to and fro communication. would be better if had a direct chat service, cause even calls overseas are costly."
        },
        {
          "Note": 3,
          "Lieu": "ID",
          "Pseudo": "Aristidis Giorginis",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T07:48:13.000Z",
          "Titre": "confusing",
          "Contenu": "I ordered a domain, got a congratulations message, but the new domain is not there under my account. I tried reordering the domain and the domain is still available!? The interface is different from when I ordered the first time even though it's just 15 minutes difference. overall it's very confusing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Full Stack Developer",
          "Nb_Reviews": 3,
          "Date": "2022-10-22T18:38:30.000Z",
          "Titre": "Some of the pages don't walk or guide…",
          "Contenu": "Some of the pages don't walk or guide you through the process,  so you wind up going to the navigation bars to add certain options to your domain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John DeMarco",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T05:59:39.000Z",
          "Titre": "TOO MANY upsell offers",
          "Contenu": "TOO MANY upsell offers. Slows down the process and too confusing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dustin Vinger",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T15:34:51.000Z",
          "Titre": "Good",
          "Contenu": "All good. I liked how you have everything where a monkey could do it"
        },
        {
          "Note": 3,
          "Lieu": "CG",
          "Pseudo": "Sarah Gosselin",
          "Nb_Reviews": 1,
          "Date": "2022-11-24T16:53:03.000Z",
          "Titre": "Great",
          "Contenu": "Great web hosting services"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PearlM",
          "Nb_Reviews": 2,
          "Date": "2022-05-15T16:16:40.000Z",
          "Titre": "Definitely thought I was getting a…",
          "Contenu": "Definitely thought I was getting a domain for $1. But when I logged in it became $10. The website is wonky on my phone.  I got so frustrated I almost went to another company. There is a overlay at the top so you have to reduce your screen so that it’s so tiny you can’t read it. They really do need to adjust their site for mobile. After all they create and sell websites, it’s not great that they can’t get their website going."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tab W",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T18:58:34.000Z",
          "Titre": "Not user friendly via navigating…",
          "Contenu": "Not user friendly via navigating purchase.  Price changed after I signed in."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Partho Sarkar",
          "Nb_Reviews": 3,
          "Date": "2022-10-01T05:32:26.000Z",
          "Titre": "Was good, not so much now.",
          "Contenu": "I used Ionos for a year and have loved their service, especially their promotional offers.UPDATE: Their service was really good a year ago. Recently, before the expiry of my contracts, the login page has shown multiple failures.And now that my contract has expired, I have to pay $100 just to get my domain and website out of IONOS."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Zulueta",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T17:21:13.000Z",
          "Titre": "In spite of complying with everything…",
          "Contenu": "In spite of complying with everything customer service told me to do, my domain transfer to IONOS was constantly delayed due to an IONOS issue. It’s unacceptable. My time is valuable and every time I had to call customer service for an issue that the previous rep said was handled - it wasn’t."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Cormier",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T02:47:50.000Z",
          "Titre": "Just did not seem intuitive to purchase…",
          "Contenu": "Just did not seem intuitive to purchase domain and related email. inadequate explanation around email products. Will also be creatng website would have like to be a more inclusive for all things necessary to assemble such a common package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen in Vero",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T17:17:37.000Z",
          "Titre": "My server acts up",
          "Contenu": "My server acts up.  It slows down to a crawl then gives error messages that are wrong.And does not notify me of the problem.Very disturbing for today's technology.I even went through the pain of a new upgraded server within the last 12 months and still have the same issues.I am selling off my websites so I no longer have to deal with this."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "thomos page",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T14:19:19.000Z",
          "Titre": "Not up to the mark",
          "Contenu": "Not up to the mark, please activate chat support, you guys always deactivate which is not fair.the website always shows this error: even have activated performance level 3 shows this error: Error 503 - Service UnavailableThe server is currently unavailable.I troubleshot by myself as I am an expert but still there is no solution. More than 500 Per month traffic and still this problem , i deleted almost every single plugin .i changed theme but problem is still there ,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Gravatt",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T03:59:29.630Z",
          "Titre": "This rating may be more about me than…",
          "Contenu": "This rating may be more about me than it is about IONOS.  I just purchased multiple domain names and now have more than one account. This is making it difficult to connect my webpage with my preferred domain.  I am sure I will feel better once I get more knowledge and skill."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sergio Torres",
          "Nb_Reviews": 2,
          "Date": "2022-07-04T15:43:56.000Z",
          "Titre": "It took me several trials to get it done",
          "Contenu": "I had to go through the entire process at least 5 times in 12 hours to be able to finish it successfully.Your system kept saying \"Unfortunately, the requested payment method is not available for this order...\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Big Time",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T02:00:12.000Z",
          "Titre": "Upcharge upcharge upcharge",
          "Contenu": "They work and my sites are doing well but they upcharge for everything, monthly.  May be inexpensive to choose hosting package and domain name but everything else such as ssl cost more money-  literally no services except BASIC hosting included.  I might go with a more inclusive package possibly with another company next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rion Wolf",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T04:24:55.000Z",
          "Titre": "false unlimited storage actually has 260k file limit",
          "Contenu": "1 thing i am upset about is you sold me the service with unlimited storage yet once i paid and opened the account portal it said limit of 260k files, this is false advertising and fraud!!!!!!! i have only 2 websites up and its half used already but only 3.5 gb of actual data!!! for future you should disclose this file limit prior to selling the \"\"unlimited\"\" plan!!! I had considered contacting an attorney about this as I am sure others have!!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dawn White",
          "Nb_Reviews": 3,
          "Date": "2022-03-08T05:00:23.000Z",
          "Titre": "Easy to navigate, Difficulty setting up",
          "Contenu": "Easy to navigate, but unable to locate my domain, I paid for. It shows on my credit statement the money was taken, ionos only shows payment for email. It's been frustrating because without my domain, I can't set up my email for my business. Difficulty setting up my business email"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Abdelkader Soudani",
          "Nb_Reviews": 11,
          "Date": "2021-12-22T11:21:45.000Z",
          "Titre": "Solid hosting but you need to pay more than you thought you need to",
          "Contenu": "Solid hosting, but they offer only one email per account, no matter how many domains and they offer one SSL certificate per account (shared hosting) you will need to pay for the rest, which are quite more expensive than normal rates for something other hosting companies offer FOR FREEI won't be renewing with them for sure"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ethel Curley",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T15:01:51.000Z",
          "Titre": "Web builder is not flexible enough",
          "Contenu": "Your prices are good But your services for me are limited. I was hoping to use the web builder but is is not user friendly so I moved to Wix where it is not so difficult to change the fist page of a site. Very disappointing.I build sires every day. Some are only up until their house has sold,Your product is not flexible enough"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nikita Solomon",
          "Nb_Reviews": 2,
          "Date": "2021-11-18T01:11:27.000Z",
          "Titre": "Is it just me or do I keep ordering domains witout access to any of them",
          "Contenu": "I feel like i keep ordering and or paying for the same thing over and over again. I dont now how many domains I ave at this point, I do know however that i cant access any of them. Good sevice minus all the extras. Its honestly just too much for a beginner like me, overwhelming. I think you guys should hold off on pushing so many side add ons, until you know that a customer knows the use for that product right now,  how to get the most out of that product.ThanksNikita Solomon"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Stéphane Maltais",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T14:22:32.000Z",
          "Titre": "Update (case resolved after speaking with agent on the phone)",
          "Contenu": "Initiated a domain transfer 1 month before expiry. 2 weeks later transfer was not completed. Tried multiple times to reach out to customer support with no answer. Now with 5 days left before expiration I learn that my contract is cancelled without notice. They say I have to process the order again while the price has doubled since the first order. Very poor customer experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LH",
          "Nb_Reviews": 5,
          "Date": "2022-01-05T07:31:24.000Z",
          "Titre": "Linux Servers and database servers are…",
          "Contenu": "Linux Servers and database servers are too slow. Limit of number of files on the server is very limiting.The service, especially in the last few years, is pretty reliable and uptime is good.Control panel is not cpanel, and is pretty slow.Database size limit is, well, limiting.Customer service s very responsive, though first level support knowledge leave some to be desired, and their limited direct communication with higher level support can be frustrating .Domain volume discount is desired.Unlimited SSL product is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N/a",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T03:47:54.000Z",
          "Titre": "Need acceptable telephone number format."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Lynch",
          "Nb_Reviews": 3,
          "Date": "2022-03-13T17:38:37.000Z",
          "Titre": "Just had another phone call with Ionos…",
          "Contenu": "Just had another phone call with Ionos trying to sell me ranking coach and the person calling was very rude. I've decided to move all my accounts somewhere else.This is a very hard decision because they have the best customer service I've ever had to use. I've been with them for a few years and have over 20 domains and mail accounts. I have initiated the transfer of everything for now and we'll see how that goes. I can see me coming back just for the customer service alone, there's none better. I've changed the stars just because the customer service is that good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Teresa Marshall",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T23:34:16.000Z",
          "Titre": "Hidden costs",
          "Contenu": "A little disappointed that all the costs are not upfront.  It seems like every time I hit another button there was something else to buy.  I would appreciate it if the total cost was displayed on the front page then I would not have been trapped halfway through paying for items I did not know were a separate cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Cornelison",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T20:08:04.000Z",
          "Titre": "Too many extraneous marketing screens make ordering a hassle",
          "Contenu": "New extraneous marketing steps add confusion to the ordering process. Why must is be so complex and so many clicks to order a domain? The main purchase path through the IONOS website is too complex - all the \"Special Offers\" annoyances do NOT add value.Also domain pricing is cheaper elsewhere, even with the included private registration which is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "She said",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T02:48:49.000Z",
          "Titre": "This is far easier to get charged for…",
          "Contenu": "This is far easier to get charged for than it is to use. And the 24/7 assistance is pretty vague after dark altho the girls that called me that first day were on point.. I still don't have a usable work email much less a website & it's just not what I hoped."
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "Alaister Leung",
          "Nb_Reviews": 4,
          "Date": "2021-08-12T13:15:08.000Z",
          "Titre": "My contract is locked, but money is deducted from my card",
          "Contenu": "I purchased a Virtual Server Cloud XL. Ionos sent me a email telling me that my order had been rejected. They also deducted $2 from my credit card. I can't cancel the service or request refund because the contract is locked.Update: I received the refund. I hope I will be able to order a server from my country."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Roh",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T14:46:11.000Z",
          "Titre": "Some of the things were confusing and…",
          "Contenu": "Some of the things were confusing and would be helpful if mail and other necessities were included just to keep it on affordable side, especially people on small budget and just starting out"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "pi-r-squared",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T05:35:43.000Z",
          "Titre": "It was a really confusing process..",
          "Contenu": "It was a really confusing process... I am a very tech savvy person and it took me several times to order my domain from my control panel and then to pay for it.  I did not notice you did not take Visa. But so far I am happy with your product, just not the layout of your website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Superior Wash - Iowa",
          "Nb_Reviews": 2,
          "Date": "2022-04-09T22:13:20.000Z",
          "Titre": "More of a feedback than review?!",
          "Contenu": "Well… Been with you a little while. Had a few rocky spots but mostly ok-good. Main complaint is that I can’t pay ahead for all the services. That single month thing is killing me! I became “woke” and pulled the plug on Gmail Stalker©️. And migrated away from all things Google. Just found out I could use an email in my package to receive billing notices. That helped in a small way but still burdened by the monthly billing.Unfortunately, because of the hours spent on the phone, plus the service interruptions for a $4 outstanding balance; I’m always searching for a new provider. As I read back through this I realize this was a review. Oh well… kind of the same."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Derrick Duehren",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T17:20:06.000Z",
          "Titre": "It's \"OK\"",
          "Contenu": "I've been a customer for ten years.  Its \"OK\" does the bare minimum of what I need, email and simple (no-sales) websites.  I just went to edit my business site and found that the host (RiverviewPlaceApartments.com) was dropped.  I don't understand why.  I just re-acquired it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T17:49:21.000Z",
          "Titre": "I like the ease of building a website",
          "Contenu": "I like the ease of building a website. The issue I have with 1&1 is the pricing. It seems like no matter which package you choose, there is always more to pay for. I feel that a lot of the \"extra\" features should be bundled into a package so that you're actually able to set up the website and get started, as opposed to setting up, then continuing to have to add products to the package in order to utilize the services available. It starts off at a decent price, but once you add everything that is actually needed, the price is far higher than it would have been if you simply built the website with another website builder."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Anthony Read",
          "Nb_Reviews": 8,
          "Date": "2021-04-29T05:12:38.000Z",
          "Titre": "Started off ok but every month seemed…",
          "Contenu": "Started off ok but every month seemed to find something else you needed. Then it became just a money drain. Cancelled four weeks ago what I thought was the whole package turns out there were loads of other little packages so now find them removing money from my account for services I thought I’d cancelled. No one replied to any emails regarding this. Really just a waste of time and money with these people who just bog you down with endless buy this, try this on you signed up for this prattle."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce Quimby",
          "Nb_Reviews": 6,
          "Date": "2021-10-22T17:18:53.000Z",
          "Titre": "No problems other than when I set up…",
          "Contenu": "No problems other than when I set up WebMail all of my browsers mysteriously got set to use MS Edge as my default mailto: link handler.  MS Edge was set to launch WebMail.  I certainly didn't do this by accident.  If IONOS did this it was NOT GOOD and very presumptive."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Ken Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T00:43:16.000Z",
          "Titre": "Using Safari 11.1.2 which still works…",
          "Contenu": "Using Safari 11.1.2 which still works for online stores, banking and many other sites, pages here did not load quickly or indicate that anything was happening, causing me to reload and repeat my transactions.Otherwise I'm happy with how easy it was to find and purchase my domain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim McKibben",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T22:37:41.000Z",
          "Titre": "The move from the EOL services to the…",
          "Contenu": "The move from the EOL services to the newer services has been okay at best, there are DNS configuration settings (and mail) that we are having to remake ourselves, not ideal.Other than this, their support has been quite good, and their up time is also quite good. Pretty soon here I'll know how good their API is."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Chris CGB",
          "Nb_Reviews": 4,
          "Date": "2021-02-19T11:16:15.000Z",
          "Titre": "I have been with 1&1 (IONOS) for many…",
          "Contenu": "I have been with 1&1 (IONOS) for many years and to date support has been adequate but yesterday I wanted support on my hosting options and was transferred to  the hosting specialist, the line was awful, breaking up and together with a strong accent was impossible to understand! I asked to be called back, I thought she responded that she would but the fact that I heard nothing, probably not so.So today I will be looking for a provider that at least has UK based support and doesn't rely on VOIP!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Arpan Sheth",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T07:02:49.000Z",
          "Titre": "Cannot cancel",
          "Contenu": "Update: Tara from ionos reached out to handle the issue. They have taken off the charges. I am keeping my fingers crossed that there won’t be any more threatening emails for sending to collection will come. Changing from one star to three. Still taking two stars away because this was made unnecessarily hard. ——-I have cancelled the service, got the refund but they keep on sending me emails with invoice pending. Today got another email that they will send it to collections. Tried logging in but the account doesn’t exist. They tried to renew account last year as well. Not sure what to do."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Pk Agrawal",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T12:47:09.000Z",
          "Titre": "Please check your renewal pricing and…",
          "Contenu": "Please check your renewal pricing and offers, for me to be associated to you for long terms kindly make  affordable renewals a marginal rise in cost upto 10% is acceptable in renewals not 10 times."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Johannes R. Fisslinger",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T19:12:24.000Z",
          "Titre": "Ok but dishonest pricing",
          "Contenu": "Ok. ... but what's upsetting is that most of the time with new domain registrations it says $1 for the first year and then at the end of the checkout it shows $10 (no way to get the $1 offer back). STRANGE to say at least."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave V",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T13:34:26.000Z",
          "Titre": "I have used 1&1 for several years",
          "Contenu": "I have used 1&1 for several years, on and off.  Their services are good.  Their prices are good. Their website is kind of terrible.  I don't do auto-pay and it is next to impossible to figure out how to renew and pay for my items when I choose."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Rodrigo Matos",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T20:11:57.000Z",
          "Titre": "My contract was canceled, but now has a good explanation",
          "Contenu": "Okay, I currently accept your excuses. I think I have mentioned hard words, but if you have explained that issue rich in details as you did now, I would be satisfied. Your grade as 3 stars I will persist because there are 2 things I felt unsafe navigating by IONOS portal: You don’t provide a close account button and there is no way to exclude my personal credit card from there. These are essencial resources any user ought to have under its control. By the way, I changed to another web hosting provider because I needed to improve the speed of registration and to upload my website. Thanks a lot!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scott Silverman",
          "Nb_Reviews": 4,
          "Date": "2021-06-12T01:27:48.000Z",
          "Titre": "godaddy web site can kiss my ass",
          "Contenu": "godaddy web site can kiss my ass.  they are absolute rip off...but your web site is somewhat of a pain in the ass to use.  thank god godaddy has competition.  i only register domain names so i can eventually resale for lage mark up.  at least im honest"
        },
        {
          "Note": 3,
          "Lieu": "MU",
          "Pseudo": "Nicolas Frichot",
          "Nb_Reviews": 2,
          "Date": "2021-07-01T16:22:04.000Z",
          "Titre": "IONOS Poor Support: Resolved",
          "Contenu": "Update 2: Refund was received. Issue resolved.Update: IONOS has contacted me via email for a refund of the test charge. I will re-update review as received.Message 1: I purchased a .COM domain name at IONOS via PayPal. As I did not receive my domain in the dashboard, I contacted support via live chat. They stated that I had a previous account with uncleared balance. I kindly confirmed that this was an already cancelled contract and that IONOS support (Rulio Oscar) confirmed that invoice was cancelled. Even though, my domain was never delivered and neither refunded. I have emailed then twice since, and they are not even replying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christopher Wood",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T16:33:05.000Z",
          "Titre": "In the past few years",
          "Contenu": "In the past few years, I believe that a one-size-fits-all approach to customer service has been taken.  For the record, my business with 1&1 goes back over a decade."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PB",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T20:07:59.000Z",
          "Titre": "Disappointed with the basic store…",
          "Contenu": "Disappointed with the basic store templates. Difficult to edit templates. Will keep the .com domain and add a .de one. I like 1&1 they are very reliable. I have experience with them in Germany."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lewis",
          "Nb_Reviews": 3,
          "Date": "2022-12-06T03:12:29.000Z",
          "Titre": "I suggest you add better labels/links…",
          "Contenu": "I suggest you add better labels/links to your website"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patient Best, LLC",
          "Nb_Reviews": 4,
          "Date": "2022-03-05T14:29:55.000Z",
          "Titre": "Very confusing to purchase a domain",
          "Contenu": "Very confusing to purchase a domain.  The CHECKOUT symbol is a tiny little basket (cart) placed inconspicuously.  It needs to go on the bottom of the page and be larger so we can find it."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Miriam Lopez",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T07:11:09.000Z",
          "Titre": "i can't sign in into my account even…",
          "Contenu": "i can't sign in into my account even with the right password i saved to my google account, I'll have to input the same username and password several times before it will accept"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer for eighteen years.",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T16:51:13.000Z",
          "Titre": "Was way easier before they made…",
          "Contenu": "Was way easier before they made mistakes.Lost several of my premium domains because of their customer nonservice.The people were not the problem.  It was their phone system that was completely static noise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "yair keshet",
          "Nb_Reviews": 1,
          "Date": "2021-01-28T19:23:55.000Z",
          "Titre": "IONIS HAS HUGE PROBLEMS WITH MS OUTLOOK…",
          "Contenu": "I am revising this to 3 stars since the problem seems to have gone away after a few days of massive issues. However, I do strongly suspect the Ionos was the at the core of the problem that cost us two days of productivity. All outgoing email was getting rejected by Outlook addresses as \"Access denied, banned sender\". Gmail from the same IP had no issue, and microsoft forums single out 1 & 1, so it's clearly something sloppy, or a bad business practice that raised Microsoft's flags. Look at the numerous other complaints here... It's not just us... Fix your security, clean up your act, and stop causing us downtime and embarassing bounce backs. This is is serious."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Howard",
          "Nb_Reviews": 1,
          "Date": "2021-12-26T18:59:49.000Z",
          "Titre": "Slow admin site - no easy plan comparisons",
          "Contenu": "Slow admin site.No clear comparison page of individual packages.My converted contract from my old one was much more expensive. Glad I finally changed it. Will shop for alternatives."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ian Shaw",
          "Nb_Reviews": 4,
          "Date": "2022-03-22T07:27:56.000Z",
          "Titre": "New domain promo price $5 for first yr…",
          "Contenu": "New domain promo price $5 for first yr then $11 per yr afterwards, but when it came to pay it was $8.50 instead of $5. Not a huge issue but confusing and annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KTom",
          "Nb_Reviews": 2,
          "Date": "2021-12-30T22:23:42.000Z",
          "Titre": "Navigation is bad",
          "Contenu": "Navigation is bad. I had to repeat steps and the explanation of add-on products is just fair. Couldn't make an informed decision at the time of sale. That cost you money."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Arvind Kumar",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T23:13:40.000Z",
          "Titre": "good company"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James Nicoletti",
          "Nb_Reviews": 3,
          "Date": "2021-01-20T18:26:55.000Z",
          "Titre": "Website is slow",
          "Contenu": "Website is slow, finding information about plans is not straightforward.  Annual billing instead of monthly does not seem to be an option, or if it is it's not easy to find on the website."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "N S",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T02:51:59.000Z",
          "Titre": "it is still hard to navigate",
          "Contenu": "it is still hard to navigate, had to go back 3 times to finf link for transferring domains. It should be on drill down menu.Could not transfer multiple domains in one entry"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Warner",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T02:27:30.000Z",
          "Titre": "Have to transfer domain instead of simply assigning it to included domain.",
          "Contenu": "The domain was already in the same contract. It would be easier if allowing domains to be assigned to the included domains instead of having to do a transfer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patrick Peterson",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T03:36:23.000Z",
          "Titre": "Took four tries to purchase domain",
          "Contenu": "Took four tries to purchase domain. Kept saying country and state were invalid entries."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NC",
          "Nb_Reviews": 6,
          "Date": "2021-09-13T18:19:31.000Z",
          "Titre": "Online Chat Support Not Great",
          "Contenu": "Ionos in general is great. The last online chat help was not great. She kept disappearing for long periods and not responding. The entire call to do one thing took 30 min."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jena Kincheloe",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T22:10:13.000Z",
          "Titre": "I don't know",
          "Contenu": "I don't even know. It seems like they said a bunch was included but now I'm being charged for each. Its still really affordable but a little frustrating"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "papi chulo",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T18:26:05.000Z",
          "Titre": "needs online support i dont want having…",
          "Contenu": "needs online support i dont want having to call be my only option for support. and its a major pain in my behind trying to activate my domain"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 7,
          "Date": "2021-08-23T14:25:57.000Z",
          "Titre": "Overall satisfactory",
          "Contenu": "Overall satisfactory, but sometimes it's difficult to navigate the site, since their page examples don't always match what I see on my computer desktop..."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Henrik Steen Hurra Larsen",
          "Nb_Reviews": 42,
          "Date": "2022-06-17T21:53:36.000Z",
          "Titre": "Lots of problems, but...",
          "Contenu": "Lots of problems, but Chin in customer service was competent enough that I am taking a chance on continuing using them...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anon,",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T04:10:54.000Z",
          "Titre": "I feel like somehow I'll get cheated",
          "Contenu": "I feel like somehow I'll get cheated. Like with GoDaddy. Everything looks okay so far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith Prinkey",
          "Nb_Reviews": 3,
          "Date": "2022-12-02T22:28:46.000Z",
          "Titre": "Support is horrible and disrespectful",
          "Contenu": "Once my hosting account is fixed, I will change this to a 4. The only reason it is NOT a 5 is because some of their representatives when you call just put you on hold without permission, even while your in the middle of talking which is a concern for me because it took me almost a week to reach a reprensentative in the hosting department that told me she would call me on Monday.I signed up online and bought the web expert windows hosting plan but the transaction did not go through so I had to call and I think the rep I spoke with thought I was referring to their Linux web expert hosting plan. Which also means the rep did not listen because I specifically said windows lol.Beyond the horrbile support, I like IONOS. I like the website and the way things are setup. Their hosting webspace allows you to direct all of your domains towards specific folders that can house applications and for instance that is where our Umbraco 10 project sits, is on the webspace in a folder call 'App'. But, since it only shows .net 4 as the framework (Umbraco 10 requires at least .net 6) most of the features of my site are not working on IONOS hosting but does work on my previous hosting that I still have until the end of next month. I suggest IONOS clean up their mess and fix my hosting account before I cancel for the 30 day money back guarantee!!!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Aram",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T18:52:51.000Z",
          "Titre": "The support was great",
          "Contenu": "The support was great so 5 Stars on that . But their plans are a bit wired, for example within the same company if you own two accounts you can not push a domain name from one to the another with hosting unless if you pay for 1 extra year, so 4 star for that !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:44:55.000Z",
          "Titre": "CS was excellent",
          "Contenu": "Overall i would rate this a 5 for services I currently use. I was switching to them for email hosting, but i have awhile left on my hosting on another provider that starts with go and ends with they stink....So i will likely be switching that to ionos also. But my only drawback was i had to contact CS to setup my email since the domain was on another provider and i couldnt find the settings to do that thru help. The agent set it up and all i had to do was change my mx record and it all worked great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Recent Install",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T21:31:58.000Z",
          "Titre": "David P",
          "Contenu": "David P. was very helpful in helping me understand builder options for my woefully out of date website. Give him a raise out of the 12 years of hosting fees I paid for please."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 5,
          "Date": "2023-12-11T19:47:52.000Z",
          "Titre": "I would like to be able to cancel my account online without calling",
          "Contenu": "The website made it easy, however I would like to be able to cancel my account online without calling. I know you want to try and save the business, but I object to Take Overs. The person I talked to was professional and didn't pressure me to stay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diego Delfino",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:26:28.000Z",
          "Titre": "Excellent customer service marred by a broken interface for iPhone",
          "Contenu": "What made the experience great was that Raymond managed to get what I needed done, even if I could barely communicate with him! The chat, however, is useless on the iPhone app: The screen crops all the messages, leaving you to figure out the meaning of what was said only with a few words."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy Ng",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:35:50.000Z",
          "Titre": "Quick and to the point",
          "Contenu": "Quick and to the point addressing the billing issue I inquired."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:52:17.000Z",
          "Titre": "Neil seemed surprised that I was just…",
          "Contenu": "Neil seemed surprised that I was just asking whether it was possible to get a domain and then host with another service (not IONOS). I found his reaction unprofessional. That being said, he was friendly most of the time and answered my question. Hence a 4 start instead of a 5 star review"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly Huckaby",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T07:24:34.000Z",
          "Titre": "I appreciate the options for contacting customer service!",
          "Contenu": "I appreciate the fact that they are now willing to work with me via email. As a hard-of-hearing person, I dislike trying to interact on the phone.I also appreciate that they have someone available on a holiday. This is my time to work on my site, so having help now is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WJ Goodman",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T18:27:26.000Z",
          "Titre": "Some buggy products but superior support",
          "Contenu": "I had recently submitted a very negative review about a few bugs encountered while setting up a new site. However, what sent me into a blind rage was the sudden onslaught of messages and calls from Indian web developers and marketing firms, all trying to sell me their goods. I mistakenly attributed it to IONOS selling my phone number to the marketers. However, after calming down and thinking it through, I realize I was wrong. All the while developing the site (under a temporary URL), things were quiet as I worked through the issues. It wasn't until my new domain was propagated to the web w/registration that the onslaught began. This is NOT something under the providers control. Even so, they did their best to minimize my interruptions and for that I am grateful. Since I ranted, their support staff have been great in helping me deal with the remaining issues and my site is benefitting greatly. I apologize for my prior rant and assign no blame to IONOS for the fine job they are doing. I should have realized what was actually happening but I haven't been doing any coding for about 15 years and forgot how this process works."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T01:30:02.000Z",
          "Titre": "Grateful for Customer Service Basic Troubleshooting",
          "Contenu": "I appreciate that they were available and did what they could when I ran into something that needed troubleshooting.The problem was eventually resolved.I am grateful for their chat and phone service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashtangakasha",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T23:06:05.000Z",
          "Titre": "Pretty fast response",
          "Contenu": "Pretty fast response, but I solved the problem internally."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Quinn Kurenda",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:21:00.000Z",
          "Titre": "he was helpful",
          "Contenu": "he was helpful. and great. the one issue was that the previous person I got was slow to react, and finally timed out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Ukonu",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:35:15.000Z",
          "Titre": "quick service but ionos payment portal…",
          "Contenu": "quick service but ionos payment portal and processing time (real-time) sucks"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Fracis Mbofoa",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:49:25.000Z",
          "Titre": "Great Service @very affordable prices"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pepe Lepew",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T22:29:39.000Z",
          "Titre": "empty email address error",
          "Contenu": "The problem I caused was explained to me and I corrected it. The popup error hasn't occurred again.Thanks Jennivie."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dude with questions",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T20:56:24.000Z",
          "Titre": "I've been with IONOS for years...",
          "Contenu": "I've been with IONOS for years. My experience, for the most part, has been very positive. Maybe my expectations are too high...but the one area I do find a tiny bit frustrating, is what seems like IONOS inability to respond to concerns outside of IONOS defined solutions. For example, I recently expressed a concern regarding billing, and asked if it is possible to be billed annually as opposed to monthly, or, is it possible for IONOS to indicate the amount owning on the invoice, in both $USD and 4CDN dollars.  IONOS responds quickly, and very politely – but the responses are generic. IONOS seems to be unable to respond to my specific concern, if my concern falls outside of the present solutions IONOS is able to provide. That said, I would absolutely recommend IONOS: 4.73 out of 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fred Vetter",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T23:40:56.000Z",
          "Titre": "Tech was good",
          "Contenu": "Tech was good, particularly helpful to those not computer geeks. Emotionally cool even when things were not going well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Luhrman",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:49:37.000Z",
          "Titre": "No upsell",
          "Contenu": "No upsell, that was AWESOME.  LONG HOLD TIMES!So the overall experience is 4 Stars, but the actual person helping me is 5 stars.   Really wish you guys would seperate that in your ratings."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Cătălin Cucu",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T17:06:30.000Z",
          "Titre": "Almost impossible to cancel contracts",
          "Contenu": "Update: Finally, the problem and my dissatisfaction have been solved. I don't understand the \"need for a cancellations department\" if it used to be simple and hassle-free in the control panel interface. Anyway, the problem solved. Thanks :)---It is getting harder and harder to cancel contracts you no longer need. I have contacted the online support, and they can't help me. The only chance is to call or be called by the \"enabled\" department. This is bulls**t! I will never use IONOS services again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Sopko",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:32:43.000Z",
          "Titre": "The customer service rep was very nice",
          "Contenu": "The customer service rep was very nice. Your actual service though not so much if I am trying to keep a business alive I would never be able to upkeep with all the drop outs in service. Again as for the rep very nice and professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elizabeth Rohr",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T00:54:12.000Z",
          "Titre": "I actually connected to a person within…",
          "Contenu": "I actually connected to a person within 15 minutes and the problem was resolved on their end"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Jorge Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:36:15.000Z",
          "Titre": "He really helped me",
          "Contenu": "He really helped me! good attention :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Konetski",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T20:05:43.000Z",
          "Titre": "Kudos to Janice",
          "Contenu": "I was assisted by Janice during my call. We arrived at a point where she was unable to resolve my situation. Yet she took it upon herself to find a way forward. Thank you Janice for your solution that saved us all from a drawn out process."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Marianne G",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T16:50:19.000Z",
          "Titre": "Love the real humans on the phone, and easy access to…",
          "Contenu": "I love that it's easy to phone for help instead of go through a chatbot first, and that there is a real, live human able to help who answers the phone. Clean looking, easy to navigate dashboard on the back end is a wonderful change from cluttered and clunky cpanel interfaces. Feels like Ionos is truly taking the goal of  making a positive and convenient customer experience to heart."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Coyle",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T06:02:04.000Z",
          "Titre": "The staff was very helpful",
          "Contenu": "The staff was very helpful, professional and makes up for my only issue with Ionos aside from the random unprovoked calls. The other issue which is major in my opinion is the cancellation system, it's overly complicated and is too pushy on not allowing you to easily cancel. I understand some push but theirs is far too much. Other than that I have zero complaints and once my life is less filled and I have some free time I will go back to them even with my concerns."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Damilola Francis",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T23:19:58.000Z",
          "Titre": "Feedback and special request",
          "Contenu": "I appreciate your quick response and detailed information. However, the exchange rate of dollar to Naira in Nigeria is extremely high (almost 1,000 Naira per 1$. I’m tempted to move my website to a cheaper platform. So I will appreciate information on how to make money with my website though it is still at developing stage. Also, I don’t mind if there could be reduction in dollar rate for customers like me in Nigeria.Thank you very much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Estella Ferree",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T23:34:37.000Z",
          "Titre": "I received great help and assistance…",
          "Contenu": "I received great help and assistance from them. I just get frustrated by all the necessary upgrades to protect the site and create something basic. But this seems to be true of most hosting sites.It's just that no one ever tells you that until after you've signed up. There's no transparency."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rams M",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:07:29.000Z",
          "Titre": "Customer service was great",
          "Contenu": "Customer service was great.  Mr. Teo was very friendly and solved my issue patiently."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T16:01:16.000Z",
          "Titre": "No Payment Receipts",
          "Contenu": "The operational aspects of IONOS have served me very well for over 10 years: uptime, pricing, customer support, etc.  There is one big exception when it comes to accounting.  They cannot provide a receipt for invoices you have paid.  That is fine until you get audited by the IRS.  IONOS only can show a $0 balance but not provide an invoice as being paid.  How hard can that be??"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Mohammed",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T18:31:32.000Z",
          "Titre": "overall it is a very good service",
          "Contenu": "The first day to use IONOS domain name, the setup and UI are easy and straight forward"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dion West",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T07:00:47.000Z",
          "Titre": "Customer service was totally awsome!",
          "Contenu": "Customer service was totally awsome!! The issue was not knowing why both times I created an account, it was canceled along with the payment. Another issue was the password. I couldn't sign in with email, but I could with the domain name. I figured due to the previous issue with the account, the email some how kept the cached  password, even after clearing my cache"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Schade",
          "Nb_Reviews": 3,
          "Date": "2022-11-27T03:58:14.000Z",
          "Titre": "To Which Contract Is My Order Being Applied?",
          "Contenu": "So I couldn't tell to which of my two contracts my domain orders were being applied. This is not clear at all during the order or checkout process. I have two contracts with IONOS, and I want to ensure the domain orders are applied to specific ones. This needs to be a part of the checkout process."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "SEM RA",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T02:40:46.000Z",
          "Titre": "Good and fast hosting service, but with support problems",
          "Contenu": "Ionos provides a very fast and automatized workflow. I only had two insues. The first was the lack of direct contact in website. I don't believe that trust pilot is a good place for it. So I hope this change this on future. The second was that when I was trying to get refund to change to other plan they answered me using a template email for balance credit pefarps to credit card refund. While I understand the necessity of use email template for fast costumer support. Use the same template for different answers type create non necessary negative and confusing experience. I hope they also expand their number of email templates in the future. If you want a very good and fast web hosting service and don't care with these two problems they have on the moment of review. So go ahead, ionos is one of bigger and better web hosting service in 2023."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Kronstain",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T21:48:20.000Z",
          "Titre": "Prompt and clear on-demand live…",
          "Contenu": "Prompt and clear on-demand live customer service. Solved the problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "squabbled",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T06:27:48.000Z",
          "Titre": "great cheap hosting and domains with awesome bonuses",
          "Contenu": "I originally went with Ionos since they had good cheap domains with private registration, but wow, they offer great features for cheap. They give a free 2GB email server with every domain which is awesome, and infinite forwarding domains to forward to that email address and allows for infinite aliases through that. Their customer support has always been available and ready, although I haven't really needed to contact them. Works great with my Github site. Their VPSes are very cheap compared to the competition, and are very reliable and work just fine for everything I throw at them. 2 cores and 6GB for only 15$ is awesome!! Only issue I have is lack of locations, and only having East Coast servers. Other than that, Ionos has been very great for hosting my game servers, and I will be back for all of my hosting needs :3"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G L Maxwell",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:51:15.000Z",
          "Titre": "John was very polite and took just a…",
          "Contenu": "John was very polite and took just a few minutes to solve my problem.  Thanks So Much. GLM"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T09:23:52.000Z",
          "Titre": "Great Company",
          "Contenu": "Ionos is a great company with excellent support - highly recommend! The only criticism is to make it easier for users to navigate and self serve so it is not always necessary to call support."
        },
        {
          "Note": 4,
          "Lieu": "MT",
          "Pseudo": "Vlad",
          "Nb_Reviews": 6,
          "Date": "2023-03-03T19:35:22.000Z",
          "Titre": "It's ok",
          "Contenu": "My domain atlascapitalinvesting.com was blocked without any notification. Once I provided document to unblock, there is zero action from the company. Completely disappointed.Update: lowering my rating, since security team refused to unblock account, even after new proof of address was provided. They keep asking for more and more info.Update: issue resolved. Rating at 4, because the way their security team approached situation was below expectation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yossarian",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T22:49:21.000Z",
          "Titre": "Hosting Package rate adjustment",
          "Contenu": "The rate adjustment I received after talking with Customer Service and Customer Retention solved the issue very well.  Both agents were polite, patient, and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sayless Enterprises Llc",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:17:42.000Z",
          "Titre": "Isaiah was amazing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Kuracina",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T20:45:38.000Z",
          "Titre": "Appreciate the discount for a new…",
          "Contenu": "Appreciate the discount for a new domain name. Had issues completing the payment, but after 4 times the transaction was successful. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff McLain",
          "Nb_Reviews": 5,
          "Date": "2023-04-18T04:42:47.000Z",
          "Titre": "I moved my Wordpress site from another…",
          "Contenu": "I moved my Wordpress site from another host and purchased a new domain and one year host service. They were helpful in getting my Wordpress site moved and working properly. The charges for this service were reasonable in my opinion. It has been more than a month and my site has been up on Ionos with no interruptions.  A few weeks after signing up, an aggressive salesman called me on my cell and sold me some add on services - Ranking Coach and others. I cancelled some of them right away and decided to try Ranking Coach. Overall it was helpful, however it required a lot of my time to implement changes to my site and time is short right now. When I called customer service for help they often couldn't help me with technical Wordpress maters and the wait times were not great. I also received several pushy sales pitches for more services during calls for help which I don't appreciate. It was difficult to cancel Ranking Coach. I tried canceling once and they invoiced me for another month - despite the fact that I called back per their requirements. I called a second time back they promised to cancel and waive the invoice fee. I hope it sticks this time. I intend to continue with Ionos unless problems continue. Hopefully I can give them a 5 star review at some point."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Skilton",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T03:57:46.000Z",
          "Titre": "Patient technician who helped answer…",
          "Contenu": "Patient technician who helped answer questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan S.",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T18:04:17.000Z",
          "Titre": "Raymund helped me solve my problem",
          "Contenu": "Raymund helped me solve my problem, they were patient with this non-technical person."
        },
        {
          "Note": 4,
          "Lieu": "KW",
          "Pseudo": "Anees Syed",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T09:39:09.000Z",
          "Titre": "I have a website for 1 year cost $12…",
          "Contenu": "I have a website for 1 year cost $12 great price but now to carry on will be $80+ this is too much. Also to cancel I need to phone but this is not practical. Why not just cancel with click of button? So I cancel my credit card with bank and move to another site builder."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Flory",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T10:22:50.000Z",
          "Titre": "after all the headache i had at first i…",
          "Contenu": "after all the headache i had at first i went much smoother, although i am still trying to figure some things out"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Austin Texas",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T23:19:05.000Z",
          "Titre": "Competent and courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Royce Hermens",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T19:45:42.000Z",
          "Titre": "Getting the necessary password and…",
          "Contenu": "Getting the necessary password and credentials update completed with the help of a patient informative individual from IONOS."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jim Simpson",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T17:35:33.000Z",
          "Titre": "good products and people",
          "Contenu": "good products and people.  mostly reasonable prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vincent Gladue",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T02:52:03.000Z",
          "Titre": "This is like a Family coming together for the harvest of there labor..",
          "Contenu": "The creators of this business knows, or has an understanding of the STRUGGLE some of us deal with to just get here..to explore the greater fundamentals of the web universe and its technologies, helping our skills/money one could spare.. this is my guess or thought because the awesome gifts they offer are spot on for my need being a out of work dad barely making any money to spare.. so I can atleast afford the tools so i can work on my dream my goal to be a successful Affiliate Marketer / entrepreneur as I gain the ins and outs..world wide web. There awesome in all there dealings and works, show for there harvest is growing and will exceed there own capabilities.. as there generosity will show through there fruits.. of the agape love they share.. thanks guys..Tools and knowledge are as easy as 123..simple and easy to navigate..through"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christiana Gass",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T01:02:24.000Z",
          "Titre": "Great job Mike",
          "Contenu": "Great job Mike, fast and quick customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guy Cummings",
          "Nb_Reviews": 3,
          "Date": "2023-03-27T17:36:12.000Z",
          "Titre": "Great customer service. Will stay with you until the issue is corrected.",
          "Contenu": "If you need to build a site and am a nube such as myself, you'll get the support needed to get up and running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl F…",
          "Nb_Reviews": 3,
          "Date": "2023-08-31T05:31:20.000Z",
          "Titre": "Exceptional in every way",
          "Contenu": "Exceptional in every way - as is the usual norm for Ionos."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Matt Kacur",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:25:12.000Z",
          "Titre": "Good service",
          "Contenu": "Good serviceThe rep was knowlegable and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Trueluck",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T23:11:54.000Z",
          "Titre": "I’m still learning and trying to…",
          "Contenu": "I’m still learning and trying to understand but this has been a great help in making me see what I need to start learning."
        },
        {
          "Note": 4,
          "Lieu": "TZ",
          "Pseudo": "Benedict Rumisha",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T21:09:47.000Z",
          "Titre": "By far the best place to buy domains…",
          "Contenu": "By far the best place to buy domains and get assistance. I really like the fact that the account manager is really available to you. I am really enjoying my experience, and I really cannot wait to see what comes next."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dion Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:33:24.000Z",
          "Titre": "Customer Service Rep was attentive",
          "Contenu": "Customer Service Rep was attentive, patient and literally worked the issue."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Francesca Frate",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T22:55:46.000Z",
          "Titre": "I was trying to cancel my ownership of…",
          "Contenu": "I was trying to cancel my ownership of a Domain as I have never used the Domain and I wanted to stop renewals of the Domain on file."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TC, City EmComm Operator",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T03:41:08.000Z",
          "Titre": "IONOS on-line order form was seriously broken",
          "Contenu": "On-line order form to pay for new domain, hosted service, and finalize purchase is completely broken."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neal Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T18:58:58.000Z",
          "Titre": "simplicity",
          "Contenu": "simple application. No added sales pitches or added years of service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "eric sonntag",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T21:16:58.000Z",
          "Titre": "Your team is persistent in trying to…",
          "Contenu": "Your team is persistent in trying to deliver customer service. And, reasonably good at thist oo."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jennifer Kronstain",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T18:48:29.000Z",
          "Titre": "Good for people who know a bit about this",
          "Contenu": "It takes a little inherent knowledge, but if you're not a novice, it's easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T23:13:41.000Z",
          "Titre": "Jose was very helpful and courteous"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samantha Bohan",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T01:09:55.000Z",
          "Titre": "I would have given 5 stars but…",
          "Contenu": "I would have given 5 stars but WordPress isn't starting correctly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sergio Torres",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T01:49:31.000Z",
          "Titre": "Tech support is friendly and…",
          "Contenu": "Tech support is friendly and knowledgeable, the service works flawlessly almost always."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wise Wolf",
          "Nb_Reviews": 26,
          "Date": "2022-11-06T03:58:51.000Z",
          "Titre": "Good VPS services",
          "Contenu": "I currently have 3 VPS (S tier) with Ionos for $2 each per month which is a very good deal. I have the VPS's running anonymous search querys to earn crypto rewards for performing this service and on average the success rate of the querys is about 85-90%. I love how I can choose the server location to different locations in Europe, I wish they had more locations in Asia though. Overall I would recommend their services the only improvements I would recommend that they make would be to add servers in Asia (like in Japan) and for people that have multiple VPS servers it would be awesome if I could consolidate multiple contracts into a single monthly payment instead of having separate $2 payments for each contract every month on my credit card."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allyson",
          "Nb_Reviews": 3,
          "Date": "2023-11-25T22:04:59.000Z",
          "Titre": "The agent was patient and handled my questions very proficiently.",
          "Contenu": "The agent was patient"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "William",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T15:02:07.000Z",
          "Titre": "Excellent set of tools",
          "Contenu": "Excellent set of tools. Only complaint is the excessive push to additional cost services"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Mozzam Ahmed",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T20:26:21.000Z",
          "Titre": "Good.",
          "Contenu": "Most required info is available. Response to issues is prompt."
        },
        {
          "Note": 4,
          "Lieu": "HT",
          "Pseudo": "Johnny Duvivier",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T19:14:50.000Z",
          "Titre": "Fair price",
          "Contenu": "Fair price, but control panel not user friendly at all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Blake",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T03:24:12.000Z",
          "Titre": "It is cost effective and easy to build",
          "Contenu": "It is cost effective and easy to build. It takes the hassle out of knowing computer language."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T20:05:19.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  I use outlook for business and will forget I can send mesages via browser with Ionos"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dionne Lewin",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T15:49:26.000Z",
          "Titre": "Very knowledgable about the product I…",
          "Contenu": "Very knowledgable about the product I was requesting."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lea Fisher",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T19:33:42.000Z",
          "Titre": "Error Fixed!",
          "Contenu": "Well, I had an error right out of the gate, but once I figured out how to start a live chat, tech support fixed it effortlessly. I do wish the beginning dialogue didn't say I've contacted \"IONOS sales\" - I was trying to get tech support! But that IS tech support. So the automated stuff is a little confusing to navigate, but the people are great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Shapovalov",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T17:43:18.000Z",
          "Titre": "Thanks John Lourd for the help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Garner",
          "Nb_Reviews": 4,
          "Date": "2023-09-15T01:36:32.000Z",
          "Titre": "great quality products and service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barry Mathis",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T19:50:22.000Z",
          "Titre": "Stop UpSelling",
          "Contenu": "Stop trying to up sell me everytime I buy a domain name , I have bought hundreds from you , I do not want the add ones and it slows down the check out process , while at the same time making me think that you do not appreciate that I bring you my business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John T. Weaver",
          "Nb_Reviews": 3,
          "Date": "2022-09-24T01:17:27.000Z",
          "Titre": "Been with this company a long time…",
          "Contenu": "Been with this company a long time (over 20 Years?) since they bought out the other guys that I was using.  Company is very good and the pricing is fair.  Like any company they do try to get you to upgrade and add on monthly paid services.  Some are good if you need them and some are just revenue generators, but I don't fault them for that.  Business... Service is good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Knowles",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T01:27:44.000Z",
          "Titre": "The tech was very helpful and got…",
          "Contenu": "The tech was very helpful and got things all fixed up."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Peet Potgieter",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T14:47:46.000Z",
          "Titre": "Instructions are clear and easy to…",
          "Contenu": "Instructions are clear and easy to follow!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Snyder",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T23:46:54.000Z",
          "Titre": "Helpful agent was able to quickly fix…",
          "Contenu": "Helpful agent was able to quickly fix the email problem."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Maxym Paquin",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T14:53:31.000Z",
          "Titre": "I like the support",
          "Contenu": "I like the support, i dislike the speed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Haley",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T22:14:38.000Z",
          "Titre": "Signing up for business hosting with an…",
          "Contenu": "Signing up for business hosting with an existing domain to be transferred for free was a bit confusing. I had to call into support. They had to cancel my initial account and I had to re-sign up so I could transfer the domain for free.Also, the whole domain transfer and renewal fees were a bit confusing. Normally the domains are up for renewal each year at the same time. This process changes the renewal date, but that wasn't clear."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Angelo",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T17:54:36.000Z",
          "Titre": "Always professional and courteous",
          "Contenu": "Always professional and courteous, ready to explain and assist. I seem however to be getting information in bits and pieces so have to come back and chat more than once to fix an issue or complete a task. But I cant expect ionos staff to seize up all my project needs on the first try so it makes sense that I may not be getting all the info at once on the first try. April O. was very helpful and thought ahead, anticipating my next question. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Saventy Joshua Tyra",
          "Nb_Reviews": 1,
          "Date": "2022-08-28T15:41:31.000Z",
          "Titre": "Top tier customer support",
          "Contenu": "Cancelled my contract without notifying me. Definitely would not recommend IONOS 1&1 services 👎🏻 EDIT: Changing my review to 4 stars from 1 star because the customer support is very fast and was super friendly to transfer the contract and resolve the issue quickly for me. Definitely top tier customer support and wish the service was the same for 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Klika",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:37:09.000Z",
          "Titre": "Customer service was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Errol Sharpe",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T05:24:11.000Z",
          "Titre": "Happy to stick around...............",
          "Contenu": "May not be the greatest with customer support, but they have the pricing game in the bag. I went shopping around looking for better pricing. Guess what I found? NOTHING!!! That's right, a big fat NOTHING. Seriously, I did not find one that came even close to the value that IONOS offers. They have great value in both the product and the cost. I almost made a mistake and left. Happy to stick around..........."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Toussaint",
          "Nb_Reviews": 3,
          "Date": "2023-06-12T20:12:36.000Z",
          "Titre": "Help with a difficult situation with…",
          "Contenu": "Help with a difficult situation with WordPress tempory login."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T18:52:25.000Z",
          "Titre": "Survey report",
          "Contenu": "HiI am happy to report that all of my issues where dealt with. I also found out that you have additional services that I am going to look into, like SEO. Thank YouScott Smith"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cande Baker",
          "Nb_Reviews": 3,
          "Date": "2023-05-28T07:13:06.000Z",
          "Titre": "They are there for you EVEN ON A…",
          "Contenu": "They are there for you EVEN ON A HOLIDAY!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lillian Quiles",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T01:09:00.000Z",
          "Titre": "My experience with IONOS Reps.",
          "Contenu": "The first representative had a little trouble understanding my request as I was not explaining myself clear.The second representative was extremely helpful and directed my concerns for resolution.The third representative was also very helpful as she even assisted me in finding additional information as to a plugin I was hoping to find. Thank you so much for the help."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "elena",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T14:22:15.000Z",
          "Titre": "the website is a bit confusing but the…",
          "Contenu": "the website is a bit confusing but the costumer service is great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thanking Chris",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T18:10:43.000Z",
          "Titre": "If the first two had been as good as Chris, I'd have offered 5 stars.",
          "Contenu": "I had to call three times before I reached Chris, who solved my problem: 5 stars! The previous two had incomprehensible international accents, despite the fact that I asked them to speak as clearly as they could; the second one just hung up on me. You might want to listen to the recordings."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leland Caraway",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T08:14:05.000Z",
          "Titre": "My experience was good",
          "Contenu": "My experience was good, but too many quick offers to buy more stuff"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DJ Marvin",
          "Nb_Reviews": 4,
          "Date": "2022-06-22T00:56:09.000Z",
          "Titre": "Consolidating all my domains under one…",
          "Contenu": "Consolidating all my domains under one contract. I had to pay for the domains again so I need to find out if this is correct. All the domains are already with IONOS, they are just in two contracts. Transfer process was easy and I have used IONOS for years (17 years I think). Every now and then I check other companies and none offer anything that makes leaving IONOS worth the effort."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scale Model Contests",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T02:48:05.000Z",
          "Titre": "IONOS is THE BEST at what They do!",
          "Contenu": "Overall... this was a SIMPLE process to find and order the products/services I was wanting to acquire from IONOS.There was one issue I had during the ordering process that \"confused\" the order processor, requiring me to have to re-enter the order several times before the shipping cart correctly reflected what I wanted to.. and had.. ordered from Their store."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mikchael",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T23:27:15.000Z",
          "Titre": "customer service was awesome very…",
          "Contenu": "customer service was awesome very patient and helping me with everything I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corrine Duncan",
          "Nb_Reviews": 2,
          "Date": "2022-09-18T19:44:15.000Z",
          "Titre": "Easy, inexpensive, reliable and quick secure of domain name.",
          "Contenu": "A couple click process to search for and secure a needed domain name.  Have other domains with  this same company and renewals are easy and reasonably priced. Feel secure here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DJ Marvin",
          "Nb_Reviews": 4,
          "Date": "2022-08-25T23:25:48.000Z",
          "Titre": "Knew what I was looking for and took…",
          "Contenu": "Knew what I was looking for and took care of it quickly. Only criticism - ionos site times out every time I go to another  page in the website. Doesn't happen on other sites so I don't know why."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Bill Oehlke",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T21:13:00.000Z",
          "Titre": "Patience and some solutions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connie McQuade",
          "Nb_Reviews": 10,
          "Date": "2023-12-21T03:11:59.000Z",
          "Titre": "Neil was expertly knowledgeable about…",
          "Contenu": "Neil was expertly knowledgeable about my technical issues and how to fix them. He was also an expert about the Ionos platform and WP interface for the many products I have as an Ionos customer since 2008. The best part of working with him by phone during the past two hours was his kindness, patience, and sensitivity to my needs along the journey to get me fixed up and back on track again. Thank you, Neil Kevin!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mim Eisenberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:32:17.000Z",
          "Titre": "Jerome B. is an excellent customer support agent!",
          "Contenu": "I could not have lucked into a better customer support agent than Jerome, who was knowledgeable, friendly, and extremely helpful. In fact, the information he gave me convinced me that in March 2024 I will be contacting IONOS to transfer my current private and domain registrations to you. Give him a pat on the back and maybe a bonus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edwin Cobb",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:38:18.000Z",
          "Titre": "Megan made my experience really great",
          "Contenu": "Megan made my experience really great, her listening ability is amazing and it allows me not to have to repeat myself time after time, which can be very frustrating.What I would love to see is how to integrate the website with the mobile website. Because, if I change the font size on the website, it will mess up the formatting on the mobile site.Thanks Megan, You Were Awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Buhrer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:51:18.000Z",
          "Titre": "Thank you and goodbye.",
          "Contenu": "I did not expect such a great level of cooperation in the process of closing out the account and ending the website of my band, which has been around for over fifty years but has finally played out. Vincenzo DeVita was friendly and extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Thacker",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:54:53.000Z",
          "Titre": "I’ve always had a good experience with…",
          "Contenu": "I’ve always had a good experience with Ionos.  I had updated my credit card information with Ionos last week but apparently it was not updated on all of my accounts.  I spoke with John Siran who was exceedingly polite and we got everything sorted out.  Thank you John, Thank you Ionos."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Peter Rychlik",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T22:25:23.000Z",
          "Titre": "Jason was a superior Customer Support…",
          "Contenu": "Jason was a superior Customer Support RepI was very pleased with his thorough and engaging service.  He double checked everything to make sure I was getting the exact right information, offered me cloud services, and patiently walked me through a screenshare to set up my Webspace Explorer and FileZilla.  Overall, fantastic professional experience! Thank you, Jason!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Charles Funk",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:46:22.000Z",
          "Titre": "My Support call was answered promptly",
          "Contenu": "My Support call was answered promptly. The Support Specialist helped me configure my domain correctly, took time to answer my questions, and pointed me in the right direction. Great Support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joyce Short",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:23:24.000Z",
          "Titre": "Truly Exceptional service",
          "Contenu": "I am commending Brit for his 6-star (yes, 6-star) service. In just a few minutes he determined the source and nature of the problem and clearly communicated my options.  He then recommended the fastest solution.   He is a true professional, courteous without being condescending.  His communications skills are exemplary.  The clarity of thought and insight was impressive and rarely experienced."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "S C V Digital Services",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:49:30.000Z",
          "Titre": "I have been working  with Ionos, for…",
          "Contenu": "I have been working  with Ionos, for the past 4 years.And I have to say so far my experience has been incredible. One thing I have to highlight because I think it's the most important aspect of this partnership and it is also the reason why I recommend this company for every startup or small business like myself. (That has to deal with everything on their own) I have to say they support team are very helpful and incredible fast. In all these years every problem that I had with the system or products has been greatly solved very fast.  I would hope for the future that  Ionos always keep these high quality service and customer care.The prices are very competitive, maybe in the medium high end. But for everything else that you are getting I think it's okay.I would also want to mention, the very special deal that they have for the first year as an offer that's very helpful for startups to start. Thaaaaaaaaaaaaaaaaaaaaaaaaaanks!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "T. Howard",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:07:46.000Z",
          "Titre": "Corrected quickly",
          "Contenu": "When I contacted the first time, I was told that I had to go to a bank to do a wire transfer, for 2.10But in contacting back, the experience was WAY better and it was resolved in minutes. It was greatly a better experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lucas Alvarez",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:27:58.000Z",
          "Titre": "The gentleman was amazing at explaining…",
          "Contenu": "The gentleman was amazing at explaining what the problem was. He was kind and patient, very knowledgeable about the issues I was having and he articulated the process very simply for me understanding. He fixed my issue and I am grateful for him."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "John Cook",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:55:36.000Z",
          "Titre": "My ONLY complaint is with late payments…",
          "Contenu": "My ONLY complaint is with payments (LATE PAYMENTS) to be specific.PayPal loves to punish its users if they are overseas, I already lost 1 account because of it.my only request is more payment options.Other than that I have 0 problems with IONOS, great customer service, and I have never noticed my site down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Woodman",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:52:30.000Z",
          "Titre": "Ciani Richardson is by far the best…",
          "Contenu": "Ciani Richardson is by far the best customer service representative I have spoken to to date. Ionos is a great company, however, when it comes to customer service Miss Richardson it the real deal. Had it any other representative, I'd likely be mad, sweating, very upset. She does her job and goes far beyond the call of duty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry W",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T00:09:36.000Z",
          "Titre": "John Lourd was amazing!",
          "Contenu": "John Lourd was amazing, knowledgeable and literally resolved 2 of 2 problems for me in record time. He was poised when I drilled him with a few questions, and came back with answers and resolutions to my months' long issues with my domain and subdomains like a champ!  Please give this man a raise IONOS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Colin Strutt",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:29:59.000Z",
          "Titre": "I called with two questions related to…",
          "Contenu": "I called with two questions related to a recent invoice.Both questions were answered promptly and to my satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Livingston",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:35:05.000Z",
          "Titre": "Kevin was very helpful in resolving my…",
          "Contenu": "Kevin was very helpful in resolving my questions regarding invoice notification email. English is his second language, but he speaks better English than most Americans that I know. I think he is a great asset to your company."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Saury Jorge",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:49:43.000Z",
          "Titre": "It was a 5-star service",
          "Contenu": "It was a 5-star service, Vincenzo answered all my questions calmly and helped me with everything I needed, it made me feel happy to continue working with you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:19:34.000Z",
          "Titre": "Ford is an excellent listener.",
          "Contenu": "Ford is an excellent listener.He understood our problem and help me to resolve it.Thank you Ford !"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Peter Do",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:30:56.000Z",
          "Titre": "I had some queries about my hosting and external domains. Luckily, Chito T. (support customer) has been there and gave me so much useful information as quickly as possible",
          "Contenu": "I had some queries about my hosting and external domains. Luckily, Chito T. (support customer) has been there and gave me so much useful information as quickly as possible. Thats really good effort from CS team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roussel Claude",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:56:12.000Z",
          "Titre": "The previous agent help out a lot by…",
          "Contenu": "The previous agent help out a lot by noticing the wrong document was sent to me. And the agent went the extra mile to help me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:30:48.000Z",
          "Titre": "Lecille V is the best thing that ever…",
          "Contenu": "Lecille V is the best thing that ever happened to IONOS.  I’ve worked with other representatives over the years, but non comparison to Lecille’s level of customer service and professional expertise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Grantham",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:52:14.000Z",
          "Titre": "My problem was strange",
          "Contenu": "My problem was strange.  My passwords were unrecognized after years of always working.  I was receiving mails on my Ionos web mail account except from Ionos.    Mr. Auman walked me through a reset using an unrelated email account.  It took awhile to fix but I am happy with the outcome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Dennis",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:10:53.000Z",
          "Titre": "Unbelievable Transformation: From GoDaddy Chaos to IONOS Success – Julie L. Saves the Day!",
          "Contenu": "Working with Julie L. was an outstanding experience; she assisted us in navigating and resolving all the necessary steps to manage our account seamlessly. Transitioning from GoDaddy to IONOS proved to be one of our most beneficial decisions. The fact that I could communicate my issues clearly and directly, without dealing with overseas representatives, made the process even more efficient. Julie's expertise in addressing and fixing our concerns was truly commendable. Excellent work, Julie, and thank you for your invaluable assistance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pierre & Sandra Cajuste",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:11:12.000Z",
          "Titre": "Excellent customer service!!!",
          "Contenu": "Excellent customer service!!!! Isayah Young-Burke was well-spoken patient and transparent, We believe he helped us to the best of his ability. He also sent correspondence to the design team even though he was in sales.  That to me is probably the best characteristic of a team player."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Ashley",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:20:51.000Z",
          "Titre": "Transferring my email and domain to…",
          "Contenu": "Transferring my email and domain to Ionos was very lengthy and complicated due to my prior host. Jed (and Reivina before him) remained steadfast to get the job done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:19:22.000Z",
          "Titre": "Professional and courteous customer service.",
          "Contenu": "I needed assistance with a procedural issue and requested a call back. Vincenzo called me promptly and was able to process the requests that I had. Vincenzo was polite, professional and personable. He genuinely listened to what I needed and was knowledgeable in terms of how to get it done. Vincenzo stayed past his finish time to ensure that my request would be taken care of. All-in-all, great customer service from Vincenzo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Tennis",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:46:51.000Z",
          "Titre": "High COMMENDATION for Jason!",
          "Contenu": "Jason was incredibly wonderful to work with. He helped me with providing details for every question I asked. This customer service is very hard to find now days. He was soft spoken & very articulate."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kyle Fraser",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:23:38.000Z",
          "Titre": "Great!",
          "Contenu": "Agent I was speaking with, Joshua Sanchez was amazing! So kind and helpful one of the best customer service experiences I have had"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jenn S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:59:34.000Z",
          "Titre": "Vincenzo DeVita was extremely helpful",
          "Contenu": "Vincenzo DeVita was extremely helpful, and really friendly. I had a great experience with him, more so than anyone else I've spoken to at IONOS thus far. Vincenzo helped me resolve issues I was having with my invoices, and made me feel confident that my problem was being taken care of completely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leon",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T22:19:31.000Z",
          "Titre": "John did not ask for a pin number that…",
          "Contenu": "John did not ask for a pin number that I probably chose 8 years ago and had no idea what it was.  That was great!  I needed to update my credit card and he did that very well.  Mission accomplished!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Desi Palmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:03:57.000Z",
          "Titre": "This woman went above and beyond…",
          "Contenu": "This woman went above and beyond assisting me this morning. If I could request her as my permanent operator for the duration of my contracts I most certainly would have her. You guy have a great employee in this one. Treat her right so your company can continue to give such great experiences !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andreas Lehnhofer",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T05:59:04.000Z",
          "Titre": "A structured platform with excellent…",
          "Contenu": "A structured platform with excellent Technical Service if needed at any time. I transferred all my business needs to IONOS simply because they have the best systems available to me. The tech group is extremely customer friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phyllis A Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T23:15:59.000Z",
          "Titre": "They have always been helpful but today…",
          "Contenu": "They have always been helpful but today was the best yet.My confidence in this company is why I have been with them so long."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:36:58.000Z",
          "Titre": "IONOS, helping others to be successful.",
          "Contenu": "I spoke with a gentleman by the name of Byron, he was very helpful and I felt very comfortable and confident knowing that I was working with him.Angela Martinez"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ilya Brusovanik",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:05:37.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experienceVincenzo was very patient and understanding of my needs.  all my questions were answered in clear manner.  products were reviewed and Vincenzo did his best to try to find the product that would suit my needs instead of just selling me something.  much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amos Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:05:27.000Z",
          "Titre": "Outstanding customer service",
          "Contenu": "Outstanding customer service. I can tell he didn't want me to leave. He offered a lot of alternatives but was concise at giving me what I requested. David P is a good customer service rep and coming from someone who rarely leaves reviews it means a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:32:14.000Z",
          "Titre": "Ionos hires and trains well",
          "Contenu": "Ionos hires well and clearly trains its staff to help with all sorts of issues. Their reps are always very polite and able. Ralph was no exception. He helped me work through a current issue as well as guide me on a domain and email transfer question as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Damico",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T03:15:22.000Z",
          "Titre": "Ciani Richardson is a valuable asset to your team.",
          "Contenu": "Ciani Richardson was very thoughtful, thorough and informative during our call. She advocated for the customer while sympathizing with my complaints. She did everything in her power to retain me as a customer and to excite me about what she was able to offer. It's very rare to talk with anyone on a technical team who has the exceptional customer service skills that Ciani has."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Fabrizio Amaral",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:23:14.000Z",
          "Titre": "Someone please give him a raise. :D",
          "Contenu": "Jason was with me on call for over 2 hours and was patient enough to listen to me guide me through the process. What I really appreciate is that fact that he had the same energy through out the call. He was very courteous too. He is an asset to Ionos team. P.S: Someone please give him a raise. :D"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kelly Austin",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:06:43.000Z",
          "Titre": "David P is an AWESOME customer Service Agent",
          "Contenu": "Hi, I had to arrange for the payment of 2 domain name renewals, till the 12/22, because I landed up with an $850 vet bill.David P was my customer service agent and he was awesome beyond words.  He was so kind and understanding and so polite, which was so great, because it's been such a stressful week.  I would really like to request that you give David P a great Christmas bonus, because it is so important to recognize, support and reward great employees.  Blessings and have a magical Christmas,Kelly Austin"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald and Christa Shepherd",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:09:54.000Z",
          "Titre": "Eric did a great job helping me better…",
          "Contenu": "Eric did a great job helping me better understand the invoice and contract! Thank you so much!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 9,
          "Date": "2023-12-14T16:47:21.000Z",
          "Titre": "Called about contractual pricing and…",
          "Contenu": "Called about contractual pricing and Joe was fantastic. He was calm, thorough, and very detailed. Gave me options and fixed every issue so I don't have to call back. Amazing work Joe!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Corey C",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T01:09:13.000Z",
          "Titre": "I will start by saying",
          "Contenu": "I will start by saying, I never received the help I needed until I got John/Bert from on the line. Once I got a competent worker, he went above and beyond to help out and showed sympathy for my situation. Very easy to talk to and settled my problem as quick as humanly possible. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Marek",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:59:33.000Z",
          "Titre": "Thank you, Megan!",
          "Contenu": "Called to cancel a MyWebsite account since we already have a hosting account. Megan was super informative and knowledgeable with her responses. Her customer service was above and beyond. She gave useful tips and all the information I needed and then some."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mingo",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:41:38.000Z",
          "Titre": "Carl Michael Linawan is The BEST!",
          "Contenu": "Carl Michael Linawan was so thorough and helpful to me.  He walked me through the entire process and he was so nice to me at the same time. I'm completely new to this and have no idea what to expect and he was beyond great in making me comfortable with using ionos.  I feel like I'm going to recommend ionos to everyone I know.  The process is so seamless and prices are really user friendly for all audiences and it's such a nice interface and everything.  And with people like Carl on the phone to help me through everything, its like golden.  Thanks so much Carl!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Olivera",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:11:28.000Z",
          "Titre": "John Lord has been great and helped me…",
          "Contenu": "John Lord has been great and helped me resolve the issue of my wordpress site login and my account problems.Thank you John I appreciate your time and your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donalda Mulrooney",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:07:46.000Z",
          "Titre": "The representative was kind and…",
          "Contenu": "The representative was kind and patient. He was able to grasp the situation and help us find a solution within the company policies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Celeste",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:32:59.000Z",
          "Titre": "Lemar was very helpful and quickly…",
          "Contenu": "Lemar was very helpful and quickly processed my request.  He sent me the proper emails very fast, and everything was updated in a matter of minutes.  I appreciate the quick service and the fact that Lemar really know his job very well.  He was very polite during our telephone call.  Thank you~"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Martin Gevers",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:48:15.000Z",
          "Titre": "Junrelan Dumanon's service was perfect",
          "Contenu": "Junrelan Dumanon's service was perfect! I had two major problems to be fixed and within half an hour they were both fixed! I am so happy about that. His English sounds exactly like that of a Canadian person which I am, so that made it so easy too. He cares about getting it all right and being nice about it. I give him full marks."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Hilal Tech, LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:41:52.000Z",
          "Titre": "Jeff at Ionos was awesome",
          "Contenu": "Jeff at Ionos was awesome! He helped me cancel extra hosting, moved my domains around, and fixed things super fast. Really nice guy and made everything easy. Definitely 5 stars!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joan Ibbotson",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:09:35.000Z",
          "Titre": "Vincenzo worked very well at addressing…",
          "Contenu": "Vincenzo worked very well at addressing the issues I was calling about..Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Very Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:20:56.000Z",
          "Titre": "I received excellent service from Vincenzo…",
          "Contenu": "I received excellent service from Vincenzo who took the time to help me understand the products and what we should be paying for and what not.He obviously knows the products well and he was able to tailor them to our needs.My next step is to move our webite to your location."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Stuessel",
          "Nb_Reviews": 4,
          "Date": "2023-12-14T18:33:34.000Z",
          "Titre": "John Lourd did an outstanding job…",
          "Contenu": "John Lourd did an outstanding job asssisting me today with my email issue.  He was polite, and very helpful.  He went above and beyond the call of duty.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Argedawa S",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:59:49.000Z",
          "Titre": "\"Exceptional experience",
          "Contenu": "\"Exceptional experience! From the moment I entered, the staff was incredibly welcoming and attentive. The quality of the product exceeded my expectations, and the attention to detail in customer service was outstanding. I'm genuinely impressed and look forward to returning for future purchases. Highly recommend!\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole Rebentisch",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:18:06.000Z",
          "Titre": "Vincenzo DeVita was awesome",
          "Contenu": "Vincenzo DeVita was awesome. He was professional, polite, and helpful. He made my experience so stress-free and quick. I look forward to continuing to do business with Ionos, and great customer care specialists like Vincenzo make that an easy choice."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Courtney Silvera",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:18:58.000Z",
          "Titre": "As i was much difficult with an…",
          "Contenu": "As i was much difficult with an individual in billing for something that had been over looked. This representative make my hassle free. I appreciate his patience and clear assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Evenson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:46:21.000Z",
          "Titre": "Sheila provided excellent service",
          "Contenu": "Sheila provided excellent service. She listened to my needs and was very helpful in getting my new service set up. And she valued me as a long time customer. Thanks Sheila!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathie Wong",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:19:53.000Z",
          "Titre": "The person helping me was very patient",
          "Contenu": "The person helping me was very patient, kind and understanding.  She took the initiative to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pamela Hatch",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:06:40.000Z",
          "Titre": "Support was very helpful",
          "Contenu": "Support was very helpful in clarifying some memos I had recently recieived about changes to the mail service. I also had questions about setting up mail on my new PC and the agent was very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vivian",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:05:49.000Z",
          "Titre": "Great Service",
          "Contenu": "♦️Very happy with the helpful assistance to transfer 3 domains. David P was very patient and called at our scheduled time.♦️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenny Price",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:36:24.000Z",
          "Titre": "Had trouble with the phone pin to my…",
          "Contenu": "Had trouble with the phone pin to my email but got account verified using another method really quick and got my payment processed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laisa Ruiz Negrete",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:45:22.000Z",
          "Titre": "Lemar was very helpful and really nice",
          "Contenu": "Lemar was very helpful and really nice. He worked very fast and efficiently, and helped me out with everything I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andreas Lehnhofer",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T00:10:28.000Z",
          "Titre": "The technical support agent is very…",
          "Contenu": "The technical support agent is very knowledgeable, He help me with all of my issue. He resolve my website and email issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maxine Krasnow",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:17:27.000Z",
          "Titre": "i found Lemar to be kind and helpful",
          "Contenu": "i found Lemar to be kind and helpful.  I was completely satisfied with his service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MFlanagan - Tracery McVicker",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T01:51:22.000Z",
          "Titre": "John Lourd was absolutely awesome",
          "Contenu": "John Lourd was absolutely awesome! He helped me through the entire process which made me very very happy. I have been so unhappy with IONOS for a couple of years now, but I'm still trying to refer business and use your services."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Bill Lamp",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T01:52:41.000Z",
          "Titre": "Lamar resolved thorny issues",
          "Contenu": "Lamar stayed on the phone for more than one hour resolving several thorny issues. He did a great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Rhodes",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T12:16:36.000Z",
          "Titre": "Best service!",
          "Contenu": "The customer service is second to none. They take as much time as you need to resolve your issues and follow up with you just in case to make sure your problems are resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "th tck",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:43:27.000Z",
          "Titre": "The support people are phenomenal",
          "Contenu": "The support people are phenomenal! I have been extremely happy with the knowledge the support folks have on not only their own products but on the industry itself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "satisfied customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T01:26:21.000Z",
          "Titre": "Your technical service is excellent",
          "Contenu": "Your technical service is excellent. After 16 yrs with Ionos (formerly 1and1), I have no complaints. Thank you for helping me with every problem! Great web hosting service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard A",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:55:11.000Z",
          "Titre": "Great support",
          "Contenu": "Great support when ever I need it.  Always quick AND accurate.   Been using Ionos for a few years and have never been disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benoit Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:36:34.000Z",
          "Titre": "I had trouble passing the security test…",
          "Contenu": "I had trouble passing the security test ( new card no pin #, blank screen but I got through and thanks to your helper Mr. Eskimo. he fixed me up. Ben Brown"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph McIntosh",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T07:15:42.000Z",
          "Titre": "Very knowledgeable team, so thankful for them.",
          "Contenu": "Kris helped patiently guide me through resetting my website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chloe",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:34:13.000Z",
          "Titre": "He was very thorough",
          "Contenu": "He was very thorough, and patient when helping me migrate my website to another platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Mireles",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:25:36.000Z",
          "Titre": "Ciani Richardson was AMAZING",
          "Contenu": "Ciani Richardson was AMAZING. Best customer service hands-down! Thank you for helping me with clear information and direction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Cordero",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:33:30.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Customer service solved my issue efficiently and with understanding. I was in the wrong and they gave me the benefit of the doubt. Well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roy Bronson",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:57:00.000Z",
          "Titre": "This customer service rep",
          "Contenu": "This customer service rep, Alex was able to help me correct many issues with my wordpress site. Best help i could hope for!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Cousins",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:34:48.000Z",
          "Titre": "Raymund was very helpful and polite",
          "Contenu": "Raymund was very helpful and polite. Quick Responses and Solutions."
        },
        {
          "Note": 5,
          "Lieu": "TC",
          "Pseudo": "Eric Stubenberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:50:04.000Z",
          "Titre": "Outstanding support from friendly and…",
          "Contenu": "Outstanding support from friendly and knowledgeable staff! Best in the business."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Khalid Fahd",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:44:11.000Z",
          "Titre": "Crisp",
          "Contenu": "Crisp, swift resolution by EricKindly consider adding a direct paypal payment link accessible to clients in our personal accounts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Hewlett",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:57:36.000Z",
          "Titre": "Agent was great!",
          "Contenu": "The agent was good at what he did. Answered all of my questions immediately and precisely. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Hasan Ali",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:06:53.000Z",
          "Titre": "They provide many good email service…",
          "Contenu": "They provide many good email service and hosting with the best price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chintan Patel",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:52:25.000Z",
          "Titre": "Customer service representative was…",
          "Contenu": "Customer service representative was very helpful. Got everything done for me and one phone call."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Khawaja Roomi",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:56:11.000Z",
          "Titre": "Kevin is very professional and…",
          "Contenu": "Kevin is very professional and knowledgeable and was able to resolve my issue quickly. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:58:02.000Z",
          "Titre": "Great customer service",
          "Contenu": "Thank you so much Jerome for helping us on our website concern"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy Rosenbluth",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:22:18.000Z",
          "Titre": "John Lourd has been very helpful in…",
          "Contenu": "John Lourd has been very helpful in migrating my email under very difficult circumstances.  Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Téléphone Fix Mobilix",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:20:32.000Z",
          "Titre": "Staff was very helpful and very…",
          "Contenu": "Staff was very helpful and very patient, thank you so much for your help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Orr",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:56:39.000Z",
          "Titre": "Megan/Meghan was very helpful and…",
          "Contenu": "Megan/Meghan was very helpful and pleasant and informative"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Idan Yatziv",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:08:02.000Z",
          "Titre": "Great Assistance",
          "Contenu": "Great Assistance. He was kind and very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted Chmura III",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T22:42:59.000Z",
          "Titre": "Another agent was not able to help me…",
          "Contenu": "Another agent was not able to help me but Jed knew exactly what needed to be done and did it in 2 minutes. Thank you, Jed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Olson",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:44:04.000Z",
          "Titre": "Quick Resolution",
          "Contenu": "David was quickly and efficiently able to resolve my issue. I appreciated his efforts and the information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tomwademd",
          "Nb_Reviews": 7,
          "Date": "2023-12-16T00:11:08.000Z",
          "Titre": "You guys are great.",
          "Contenu": "My consultant, John Lourd, was incredibly helpful.He was very patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Hand",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:57:37.000Z",
          "Titre": "Vincenzo DeVita was very helpful and…",
          "Contenu": "Vincenzo DeVita was very helpful and professional. You’ve got a great employee there!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Ferlisi",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:51:06.000Z",
          "Titre": "Jufel was extremely helpful and patient…",
          "Contenu": "Jufel was extremely helpful and patient with all of my questions! He helped me tremendously!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jiannan Xiang",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:51:35.000Z",
          "Titre": "I am glad to work with her to resolove…",
          "Contenu": "I am glad to work with her to resolove my issues. I talked to three representives, she is the best one and only take about 10 min."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Spell",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:22:25.000Z",
          "Titre": "John Lourd was very knowledgable and…",
          "Contenu": "John Lourd was very knowledgable and quickly assisted with the issue I was having"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Fordham",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T22:17:27.000Z",
          "Titre": "I see huge improvement in customer…",
          "Contenu": "I see huge improvement in customer service. Tiffany M was excellent! She is a \"keeper\" :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie W",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:41:24.000Z",
          "Titre": "Raymund Temple was just AWESOME",
          "Contenu": "Raymund Temple was just AWESOME!  Knowledgeable, friendly and a joy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonster",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T18:40:35.000Z",
          "Titre": "I was treated with respect and the team…",
          "Contenu": "I was treated with respect and the team seemed to want what was best for me. I am very happy with the support and suggestions that I got from Vincentzo."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reinhold Schmitz",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T16:12:03.000Z",
          "Titre": "The IONOS Team member was friendly and…",
          "Contenu": "The IONOS Team member was friendly and was able to resolve the issue right away"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Abraham",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:14:16.000Z",
          "Titre": "Amazing guy",
          "Contenu": "Amazing guy! Sooooo helpful; very knowlegable; with a lot of patience to a 'dummy' guy like me... Thank! Dr. Joe"
        }
      ]
    }
  ]
}