{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ipowerresale.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GH",
          "Pseudo": "RAGE",
          "Nb_Reviews": 3,
          "Date": "2023-06-29T04:54:54.000Z",
          "Titre": "ALL IPOWER RESALE SUPERVISORS AND…",
          "Contenu": "ALL IPOWER RESALE SUPERVISORS AND REVIEW TEAM ARE FOOLS.THEY CANCELED MY ORDERS FOR NO TANGIBLE REASON AND THEY TRIED TO KEEP MY MONEY..I HOPE YOUR COMPANY COLLAPSES. YOU ALL ARE CRIMINALS WORKING HAND IN HAND WITH THE SCAMMERS TO RIP OFF CUSTOMERS..FOOLS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CU Angry Elf",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T01:30:20.000Z",
          "Titre": "The gift I wouldn’t give - EVER",
          "Contenu": "I purchased the product as a gift through Walmart. It was never expressed as an “open box” item. It was also sold for full price (purchased a brand new identical item from Best Buy for the same price). The open box was filthy and not suitable as a gift."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2022-02-22T15:54:53.000Z",
          "Titre": "I ordered a iMac with small chips on…",
          "Contenu": "I ordered a iMac with small chips on the edge of glass when I got it the screen was cracked all over I sent an email and never got any response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CU",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T19:31:54.000Z",
          "Titre": "Shipping 800.00 laptops in thin cardboard boxes... brilliant",
          "Contenu": "You sent the wrong laptop and you shipped it in a freaking cardboard box with no protection.  Just the dumbest thing I've ever seen."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T00:02:06.000Z",
          "Titre": "EXTREMELY deceitful practices.",
          "Contenu": "I have bought a couple of items over the years through BackMarket.com.  It appears their main reseller is iPower Resale.  I will honestly say that the previous items I've bought (apple powerbook, apple watch, and samsung watch) I've never had an issue with.  The problem started when I had an issue with a macbook (it would arbitrarily not charge..it wasn't a block or cable issue because I tried two other known good cables/blocks).  I returned it to iPower for diagnostic.. prior to returning to them, they sent me their policy warning me to back up my data in case of loss.  Knowing that I did not have the ability to back up my data (as the computer stopped recharging and would not turn on) I taped a letter to the laptop asking that they not delete any data, and if a data reset was needed, to send it back to me instead so I could retrieve the data through professional means). They got back to me and said there was no power issue with the computer and it was working fine, so I told them to send it back to me.   Then a day later they suggested they provide a replacement.  I said I would only agree to that if they could transfer my data.  They replied it was against their policy to do that.  So, I again, asked them to send my computer back.  2 days later they said they could transfer the data.  I had no faith they could, so again, I asked them to send me my computer back.  4 days later I received a different computer.  This computer was set up with someone else's admin name and password (although none of their data was present on the computer).  I, again, asked them to send my computer back. Over the next 2 weeks they refused to talk to me, and finally admitted to deleting all my data and selling my computer.  In my opinion, what this company did was criminal.  It is akin to my bringing my car to the dealer for a warranty fix, them selling it, and providing me with a new car that doesn't have any keys.  Stay FAR away from iPower."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HC",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T17:41:41.000Z",
          "Titre": "Purchased a mac pro that crashing…",
          "Contenu": "Purchased a mac pro that was crashing frequently. iPower refused to accept a return after just over a month. Frequent attempts to have it exchanged or serviced were impossible, as they only reply to emails once a week, or less. Brought to the Apple genius bar who wanted $1200 to fix it, as it had the wrong CPU installed, declined that. Ultimately had to have my credit card involved, and it's now a very expensive paperweight."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard E. Buchli Jr",
          "Nb_Reviews": 1,
          "Date": "2019-01-26T23:39:57.000Z",
          "Titre": "Save your money",
          "Contenu": "Customer service was ok, but the computer I had (MacBook air, early 2013) died after 14 days of using it so I couldn't return it. After sending it back twice, I gave up losing my important files on a consistent basis and they refused to replace it with a working model.I was out the $750 or so I paid for it, but I learned a valuable lesson.Never buy a refurbished mac. Especially one with an SSD."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrayana Mason",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T21:56:06.000Z",
          "Titre": "This company is a Fraud",
          "Contenu": "This company is a Fraud, they took my money but wouldn't send me the product Christian is very racist and doesn't like the fact I'm black purchasing a high end item, the most full of bs, worst company I've ever dealt with I'm highly pissed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Twitch: Krsn310",
          "Nb_Reviews": 1,
          "Date": "2019-01-24T09:20:41.000Z",
          "Titre": "Waste of time and money",
          "Contenu": "Purchased an apple that went dead within days. Customer service was rude and refused my full refund. Only agreed to a partial refund if I removed my bad rating from Amazon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Gordon",
          "Nb_Reviews": 1,
          "Date": "2019-01-25T03:21:26.000Z",
          "Titre": "Top of the line refurbished 2012 Mac Pro arrives with unfixable problems does not work like it is supposed to!",
          "Contenu": "I spent a lot of money on a 2012 mac pro maxed everything, to this day, the ONLY way to start it up is to hold in the power button until I hear a beep. Researched alot about passing post and bad switches - checked ram is good, know it takes a while to check, I have 30+ years experience in computers, for the life of me can't figure this out, and feel I shouldn't have to deal with a finicky mac and feel that is what I get for buying refurbished! Originally bought the mac pro 1,1 and loved it. Upgraded it til I couldn't anymore. I thought the final version would be the best, but have not noticed much speed difference between the 1st generation and last generation. The mac I bought even had that fancy fastest ever hard drive - which I removed to troubleshoot the problem starting up, sleeping, and startup - did NOT make a difference, still need to hold in power button to start/come out of sleep."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Lee",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T15:43:42.000Z",
          "Titre": "Product defective after 6 months",
          "Contenu": "Product defective after 6 months.  Company unwilling to help repair unless spending hundreds of more dollars on a warranty.  BEWARE!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-11-19T19:05:40.000Z",
          "Titre": "Did not received my item 1,000$ value.",
          "Contenu": "Did not received my item 1,000$ value.No one at ipowerresale can explain what happened and wants to help."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-11-29T19:43:41.000Z",
          "Titre": "doesnt come with the stand",
          "Contenu": "doesnt come with the standand 1 of the keystroke was missing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T02:51:44.000Z",
          "Titre": "Very slow to respond to email",
          "Contenu": "Very slow to respond to email. Not shipping when promised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-14T06:43:16.000Z",
          "Titre": "I got a malfunctioning MacBook ..",
          "Contenu": "I got a malfunctioning MacBook ... cost me 2600$"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emmanuel Munguia Tapia",
          "Nb_Reviews": 1,
          "Date": "2021-09-30T04:59:17.000Z",
          "Titre": "Computer got damage and no warranty…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie Mendoza",
          "Nb_Reviews": 3,
          "Date": "2020-08-26T23:33:26.000Z",
          "Titre": "i would not go near this company. THEY SOLD ME A LEMON",
          "Contenu": "I would not go near this company. The sold me a Leon and will not exchange it or repair it for free. Through amazon,i have emailed them four times telling them my computer died with only using it for college studies for 7 months. i asked Amazon to get involved about this and the seller avoided replying back to me within 48 hours required by Amazon. This seller is of no help to customer problems and sell lemons. On that i kindly asked for an exchange of product as i have a short window to get my computer working as i start college within nine days and all Apple and repair services are slowed  down terribly with Covid. With Apple closed means i have to put about $900 out of pocket as two authorized repair facilities had  said the issue is with the Logic Board. you would think that when a seller sells you in good faith a product that is close to $2000.00 they would stand behind their product. They wait days before each response even though i stated i have limited time window to get this device fixed as my college engineering Cours of study begins and this computer has all. My summer coding and homework on it. . STAY AWAY. NO Support, and arrogant like, telling me they need to follow policies set by their refund division as opposed to help a college student with no income on unemployment. Since I did not buy extended warranty that it is my problem. Frankly, they SOLD ME A LEMON. THIS IS THERE PROBLEM. THEY WANT TO TAKE YOUR MONEY AND NOT HELP. We all know they buy parts wholesale and could solve my problem for a fraction of retail that iI will have to pay. BAD BAD SERVICE!!! On sixth email to them, they responded: I will diagnosed for free, but will not fix it for free. You have a chance of buying a lemon from them.There are plenty of other resellers out there. Pick one that cares. Especially since they get parts for wholesale. No computer that costs $1,700 should fail in 7 months. The unit was not dropped, no liquid was spilled on it. It had  just college use and left in a good home environment and not even committed around."
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-03T17:22:06.000Z",
          "Titre": "Not goog seller they will scam u"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T02:32:02.000Z",
          "Titre": "My face id doesn't work"
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-19T11:49:45.000Z",
          "Titre": "Laptop with mechanical damage to the…",
          "Contenu": "Laptop with mechanical damage to the case. I thought the condition (A / B) would be better.The problem with the cooling system. The laptop is noisy and heats up even under light loads. I cleaned the cooler and replaced the thermal paste - it did not help. I will not recommend the store to my friends"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-28T12:02:26.000Z",
          "Titre": "Communication issues",
          "Contenu": "Communication issues, agreed to purchase three units with a certain discount, ended up with two units at full price. Every message they \"forgot\"  the previous ones. Not easy to do business with"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phil Riutcel",
          "Nb_Reviews": 1,
          "Date": "2019-01-31T01:48:46.000Z",
          "Titre": "I bought a refurbished MacBook Pro for…",
          "Contenu": "I bought a refurbished MacBook Pro for well over a thousand dollars.Two years ago.Hard drive crashed, spent a lot of money just to get back online.  Major files missing...Screws keep falling out of the back of the computerBattery and re charge system has cost me major money because it is refurbished.  When I pull out the jack the internals are ascued.Seriously...2 stars is generous.  This is a 2011 model that has been in the shop all the time and apple will not recongnize it.I moved from Santa Barbara to San Diego and have been told that this computer is not worth keeping and the people who sold it to me ...Knew so?Not happy, sad.Phil RiutcelGeneral \"B\"Building ContractorOwner of Ono Building ConstructionOwner of Ono custom wood productsOwner of Rancho de Los Robles805 883-8745"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2019-03-18T16:37:41.000Z",
          "Titre": "Excellent value"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CU USATOLEBANON",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T19:05:39.000Z",
          "Titre": "Prices are on the higher end but…",
          "Contenu": "Prices are on the higher end but overall the quality is very goodI had a problem with few macbook. One of them had 130 cycles which qualify as used not open box. And, few macbook had damage boxes."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Juuso Hämäläinen",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T09:18:34.000Z",
          "Titre": "i like it",
          "Contenu": "ok i liked the. omåany nd the service thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CU older&wiser",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T19:50:27.000Z",
          "Titre": "MacBook Air M1 working well but",
          "Contenu": "The MacBook Air M1 is working well. I purchased it on November 25, 2022, and I received it quickly in four days. But it shows a warranty expiration of January 29, 2023 (only two months, not one year). I called Apple Support and they couldn’t change the date. iPower Resale advertised it as “new/open box”. I believe this is deceptive advertising, and request compensation.After reading iPower Resale's response, I talked to LeeAnne on 12/12/22, around 4:50 pm ET. I said I assumed that an item described as “new / open-box” would be like a new item in all respects except for the open box. I said my “new” computer only had a 2 month warranty. I asked if iPower Resale could cover warranty costs for an additional 10 months. She said No. She said iPower Resale provides a 12 mo warranty for direct sales. I asked if they could provide that to me. She said No. I said the purchase was thru the Walmart website. She suggested buying a warranty from Walmart. I said I didn’t feel I should have to buy a warranty for a new computer. I said iPower Resale then should say in their descriptions that “new” computers have less than a 1 year warranty."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CU Greg Ochs",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T17:56:22.000Z",
          "Titre": "The wrong product was advertised",
          "Contenu": "The wrong product was advertised, you all shipped a 7-core GPU for my MacBook Air as opposed to the 8-core that was advertised"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 2,
          "Date": "2021-10-01T14:01:48.000Z",
          "Titre": "Long shipping times, overall good product.",
          "Contenu": "I would have given 4 stars had it not been for the cosmetic scratch on the screen of the phone I received that was not in the description of the item at purchase. I paid a fair price and I'm still using the phone, a year later so I have no big complaints. I do wish the shipping had been faster- I waited over a week to receive the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T22:32:04.000Z",
          "Titre": "I purchased i mac 27 inches and i…",
          "Contenu": "I purchased i mac 27 inches and i shipped international when my bro open the box the mouse was missing even i purchased track pad by paying extra i have called abt mouse missing they told me they will reply me today tuesday i hope i will get my mouse soon n the quality of imac the service is 5 star really satisfied only mouse issue but i hope they will send me replacement soon so i can send backhome"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T23:32:36.000Z",
          "Titre": "The sales staff was very friendly and…",
          "Contenu": "The sales staff was very friendly and informative, it was hard to always reach them or get a call back but they worked with me to complete the purchase. Unfortunately, my laptop arrived without the configuration I requested, and it was dirty. When I ordered it I expected a refurbished laptop to be cleaned and in like new condition, mine was covered in dust and dirt, the screen pretty heavily smudged."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "SebA",
          "Nb_Reviews": 1,
          "Date": "2019-09-19T17:01:23.000Z",
          "Titre": "Undisclosed small defects on monitor",
          "Contenu": "The eBay listing neglected to mention that there were small defects on the monitor (condition was simply listed as \"used\") -- a visible patch of 'smudged' pixels in the two bottom corners of the monitor. Otherwise, the computer is in good working order. It's not enough of an issue for me to return the computer, but I would definitely ask some detailed questions before buying from iPower Resale again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "marvin",
          "Nb_Reviews": 1,
          "Date": "2019-03-11T21:47:18.000Z",
          "Titre": "I did place a bid of 350 dollars",
          "Contenu": "I did place a bid of 350 dollars, but the sellers remark  could've been  more reasonable due to the condition of what 350 dollars  will get me. but you ask me to place a bid so any way,l paid  you what you ask 400 dollars  and the Apple machine turned out to be  in good condition  thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2020-03-23T21:25:39.000Z",
          "Titre": "I was very disappointed That there was no keyboard or mouse included",
          "Contenu": "I was very disappointed that this iMac did not include keyboard nor mouse, essential pieces to operate the computer.  I went back to look and cannot find that it was specifically mentioned that the iMac did Not include the mouse or keyboard.  I did see the items for sale, but cannot find them specifically excluded.  Had they been included, as was on the original iMac, then you might have had five stars, at least four.Otherwise, the package came on time with only one corner with a small tear.  Computer was not damaged and it functions as I would expect.Thank you Carl"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "glenn lauren",
          "Nb_Reviews": 6,
          "Date": "2019-01-31T13:43:45.000Z",
          "Titre": "I bought  a refurbished iMac with…",
          "Contenu": "I bought  a refurbished iMac with extended warranty.  The 27 inch Mac went sideways  and it was not an easy job both in getting I Power to look at it, send it back at my expense,  but in the end, after weeks, it was replaced with a slightly newer model. I now look at what  they have to offer, and the terse treatment  I  received the first go around keeps me from buying again. My iMac is dieing a slow death, I want to replace it,  BUT so far I cannot get myself to go back to iPower Resale. Not happy with their customer service at all. My advice? If you going to do business with them, buy the extended warranty.  To me three stars is generous, two is more like it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shane Lewis - Rincon Recruiting",
          "Nb_Reviews": 1,
          "Date": "2019-09-03T17:10:10.000Z",
          "Titre": "One of the two computers we purchased…",
          "Contenu": "One of the two computers we purchased recently had a pretty serious cosmetic flaw that I don't feel like was in line with the rating we purchased. Both computers work fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "donald adams",
          "Nb_Reviews": 2,
          "Date": "2020-07-01T00:52:43.000Z",
          "Titre": "I asked for a perfect screen and didnt…",
          "Contenu": "I asked for a perfect screen and didnt care about the back or sides.I received the opposite. The screen is horribly scratched and the back and sides are flawless."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2019-10-15T03:15:36.000Z",
          "Titre": "Not the greatest",
          "Contenu": "First the positive.  Excellent response time to any questions or comments.  The negative. Unfortunately there was a big mistake in the order from the beginning.  I ordered and paid for a configured IMac.  The one that was delivered to my house had the wrong operating system and 8GB of ram instead of the 32GB I ordered.  The help I received was not satisfying.   A link to an article that kind of described how to downgrade the OS.  So I spent hours and had to spend  $30 on a flash drive to make a bootable OS drive.  The person I communicated with just didn't get it.  Kind of like, \"yes, we screwed up, sorry. Here's how to fix it yourself\"  Didn't feel like there was a sense of taking responsibility for getting the order all wrong and wanting to go the extra mile to make things right.  Anyway the computer is fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Young",
          "Nb_Reviews": 2,
          "Date": "2020-06-15T20:40:10.000Z",
          "Titre": "I noticed too many scratched and dents",
          "Contenu": "I noticed too many scratched and dents. Keyboard has also a scratch and some scratches are on the screen. I do not recommend buying a mac from here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Atkinson",
          "Nb_Reviews": 3,
          "Date": "2019-01-31T02:05:36.000Z",
          "Titre": "The used mac was sent to me with…",
          "Contenu": "The used mac was sent to me with problems and they would not take it back and send me a working unit - which interupted my work productivity."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elvira",
          "Nb_Reviews": 4,
          "Date": "2020-05-05T22:32:48.000Z",
          "Titre": "You came highly recommended by a dear…",
          "Contenu": "You came highly recommended by a dear friend.  Handling and shipping was fine as well as condition of the desktop.  My huge disappointment was trying to connect the computer and get up and running.  This purchase came with no instructions.  I called your support desk and the woman on the line was not even sure what I bought.  I explained and all she said was to keep trying because it was funky at times.  A week after arrival I gave up and called an expert to come and help me.  We manage to resolve the issue by buying a keyboard at Staples to complete the installation.  The wireless keyboard did not allow us to do the installation neither the CS person was telling us that when called.I am fine now, using the computer, I highly recommend that you are more supportive of your product and also include some basis information for the installation.  I am not stupid, my husband is good with computers but we incurred in extra expenses that could have been resolved with some instructions included up to telling us that we needed to have a regular keyboard  to install and get up and running.ThanksElvira"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Warren",
          "Nb_Reviews": 2,
          "Date": "2019-01-24T16:03:38.000Z",
          "Titre": "They just don't address problems…",
          "Contenu": "They just don't address problems when they arise and there is no follow through unless you call them."
        },
        {
          "Note": 4,
          "Lieu": "GE",
          "Pseudo": "CU Elena Zaugolysheva",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T06:12:58.000Z",
          "Titre": "I did get an item fast as described",
          "Contenu": "I did get an item fast as described, but with a wrong cable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T08:29:50.000Z",
          "Titre": "Would have gave 5 stars but the mouse…",
          "Contenu": "Would have gave 5 stars but the mouse and keyboard were dead (wireless) NO cable to charge with which I had to buy. Cable was no big deal and the ad said ship with no cables but the power supply cord in their defense. BUT it would have been nice to have a mouse and keyboard charged so I didn't have to go to town in the recent chain of events, (covid19), right out of the gate. Couldn't be happier with the unit, and timely shipping. THANK YOU iPOWER RESALE!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence Welton (Ensight Records Inc).",
          "Nb_Reviews": 1,
          "Date": "2019-04-17T02:31:36.000Z",
          "Titre": "Would have given 5 stars except i…",
          "Contenu": "Would have given 5 stars except i received a damaged shipment and out of Common Courtesy, another should have been shipped to me right away but i was told to wait to have the damaged shipment picked up and inspected by UPS which took almost a week for them to finally pick this shipment up, Christina in tech support was very helpful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Bycel, Attorney at Law and writer",
          "Nb_Reviews": 1,
          "Date": "2019-01-24T18:48:00.000Z",
          "Titre": "I'm a Luddite and computers scare the…",
          "Contenu": "I'm a Luddite and computers scare the hell out of me.  When I walk into your store my fear lever immediately decreases because I know one of the capable and friendly employees(or owners) will calm me down and do everything to help me, even if I purchase nothing at that time.Thx.Ben Bycel, Attorney at Law and writer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-07-25T16:15:16.000Z",
          "Titre": "Got the right iMac for the right price!",
          "Contenu": "Great transaction and communication. Would definitely buy my Macs from them in the future. A little slow getting here, but with COVID-19, I can't really complain. The iMac I bought fit my needs perfectly at the right price point. And it was in perfect condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TexasBuyer",
          "Nb_Reviews": 1,
          "Date": "2019-09-26T15:36:37.000Z",
          "Titre": "Seller Cooperates and Works with you",
          "Contenu": "Great seller, had a problem that was not described in the product page. Seller tries one time to justify the problem but after one statement saying that his justification was unacceptable, he understood and took steps to rectify the problem. I would buy from this seller again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom K.",
          "Nb_Reviews": 1,
          "Date": "2020-01-13T22:48:58.000Z",
          "Titre": "Liked everything about dealing with…",
          "Contenu": "Liked everything about dealing with iPower Resale.The only reason I didn’t give them a 5 star rating was that there was a lack of post purchase communications. I had requested a certain firmware update and didn’t get any confirmation that it had been performed until I received the unit and powered it up. Yep, it had been done, just fine. I would have preferred to have been notified prior to shipping, that all requested upgrades had been performed.Great folks, fair pricing, quick servicing/upgrading and getting it out the door. I would definitely do business with them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GearHead",
          "Nb_Reviews": 3,
          "Date": "2020-04-20T18:41:28.000Z",
          "Titre": "Great service! Quick shipping. Excellent price.",
          "Contenu": "Great service!Computer I purchased has a big ding in the corner, but works as expected. I knew the condition was supposed to be A/B quality, but it would have been good to see actual photos of the specific machine and it's flaws before purchasing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christophe",
          "Nb_Reviews": 2,
          "Date": "2020-04-26T15:58:20.000Z",
          "Titre": "The product I received was as expected but ...",
          "Contenu": "The product I received was as expected. I didn't rate it 5 stars because they allow people to make offers for their products on eBay. That by itself is great but it is blocking the potential buyer for 24 hours and in my case (and a lot of others I could see online), they didn't care to either accept, deny or counter my offer. This is disappointing as we are not only proposing but also committing to buy the product at a proposed price and it would be fair to receive an answer rather than wasting 24 hours waiting for it. If they don't bother to answer offer, they could turn that feature off on eBay."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dominique Bassal",
          "Nb_Reviews": 6,
          "Date": "2019-01-24T18:19:15.000Z",
          "Titre": "The computer works fine",
          "Contenu": "The computer works fine, and the contact with the salesman was adequate, but the prices are not so great. A little too close to the price of the same item new, so many people could be tempted to just go to the manufacturer and buy peace - which is not granted either..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T08:23:18.000Z",
          "Titre": "the ipad pro 10.5  is great",
          "Contenu": "the ipad pro 10.5  is great, looks like so new, but the battery drained so poor about 3 hours only when running some apps such like youtube, safari or gaming, I will pay the battery replacement when the repair store open later,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T20:29:20.000Z",
          "Titre": "Pretty great",
          "Contenu": "Computer came well bubbled-wrapped, fully functional, and in great shape. There was some residue between the keys that was easily cleaned but as far as it goes so far, seems to be all in working order. Hurray."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T08:53:59.000Z",
          "Titre": "ipower Mac pro",
          "Contenu": "Ordering was fast and easy. So far the Mac Pro is doing all its suppose to. A slight problem in that one the apple drive sleds was replaced with a after market SDD.  I would of liked to had the original sled included."
        },
        {
          "Note": 4,
          "Lieu": "AZ",
          "Pseudo": "Nargiz Asgarova",
          "Nb_Reviews": 1,
          "Date": "2020-06-06T16:38:14.000Z",
          "Titre": "Macbook pro 13, Mid 2019 release",
          "Contenu": "Recently I purchased Macbook pro 13, 2019 Mid release. It was my first Macbook. I used to Windows system and while choosing where to buy, I almost did research in every website every platform and even tried to but refurbished one from Apple website. But considering all positive feedbacks i finally decided to buy it from iPower Resale. Delivery and quality is satisfying. But when I opened the box I was shocked. I purchased for Silver and 256gb SSD but got Space gray and 128 GB SSD. I dont know how it is possible to confuse such specs but at the end they immediately replied to all my questions and compensated the difference between the one I purchased and the one I received. Macbook works great. Just such a disappointing experience for me (((."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2021-09-30T02:37:26.000Z",
          "Titre": "Complex story that did not need to be",
          "Contenu": "Complex story that did not need to be.  In the end, I am pleased to have worked with iPower Resale.  But:I purchased a MacBook Pro from NewEgg that was supplied by iPower.  This computer arrived defective.  Following the instructions in the shipment, I contacted iPower, not really knowing who they were.  After brief discussions about how to fix the problem, they agreed to send me a new one if I first purchased the replacement from them.  Then I needed to get NewEgg involved because they needed to send me the RMA and shipping label and Newegg needed to refund my original payment.  NewEgg, at first, was uncertain as to what their role was.  In the end, I did get the refund.  But, to me, I had to be the business interface between the two companies to resolve who's role was who's responsibility.  All could have been avoided if a pre-shipment quality acssurance check had been done on the first shipment."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Vihaan Amble",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T13:51:13.000Z",
          "Titre": "iPad Air 1 9.7 Silver 32B is a great…",
          "Contenu": "iPad Air 1 9.7 Silver 32B is a great piece of gadget. The product arrived very fast. The customer service works pretty good as expected, no problem at all. Overall I highly recommend iPower Resale"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Booth",
          "Nb_Reviews": 2,
          "Date": "2020-01-07T17:20:26.000Z",
          "Titre": "Everything to Specification.",
          "Contenu": "Everything arrived as expected, and to specification. Cost was within budget, and the device is performing as expected. Very pleased. Only wish it came with keyboard and mouse, which it did not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "K B",
          "Nb_Reviews": 1,
          "Date": "2019-01-27T15:38:36.000Z",
          "Titre": "Great products/pricing",
          "Contenu": "Great products, fair pricing. They included a free laptop sleeve. One of my two orders was delayed without explanation for about a week after promised, which is why I'm not giving them 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T18:53:49.000Z",
          "Titre": "My MacBook Pro came as described but…",
          "Contenu": "My MacBook Pro came as described but had a different operating system from what I had requested. I was able to update this myself but was a hassle. Overall, pleased with my experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-15T21:46:20.000Z",
          "Titre": "Ipower listed the computer as a solid…",
          "Contenu": "Ipower listed the computer as a solid state drive. It says it’s a fusion drive. Ipower responded to my inquiry to assure me that it’s a SSD. But I don’t know if it truly is..."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Thinh Nguyen",
          "Nb_Reviews": 1,
          "Date": "2019-11-12T03:49:49.000Z",
          "Titre": "I was supposed to received it in 3 days…",
          "Contenu": "I was supposed to received it in 3 days but it took about 11 days. Beside that, everything else is good. The computer was in good condition and was packed very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T21:46:20.000Z",
          "Titre": "First laptop they sent me broke on me…",
          "Contenu": "First laptop they sent me broke on me within a week it would not turn on, but they were very understandable about it and sent me a replacement ASAP."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Analyst01",
          "Nb_Reviews": 1,
          "Date": "2020-04-12T17:12:47.000Z",
          "Titre": "Do be aware.....",
          "Contenu": "While the purchase of the refurbished iMac machines was a breeze, what the seller's ebay listing lacked was any kind of warning, advising that the buyer would need to acquire charging cables for the Bluetooth wireless keyboard and Magic Mouse 2 (both sets of peripherals arrived as uncharged, unuseable devices). Perhaps the seller made an assumption that the buyer (me) was someone familiar with Apple products and would know beforehand that these peripherals would arrive charge-less and required advanced charging before use. One of the iMacs I purchased has been out of commission since it was received on April 1st because of this oversight on the seller's part; I had to employ one set of wired k&m just to get by. It would have spoken volumes about this seller, and would have added significant value to this transaction, had they gone the extra mile by including such charging cables in the boxes. Hence, only 4 stars were awarded from this buyer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T22:02:10.000Z",
          "Titre": "The box was damaged but didn’t know if…",
          "Contenu": "The box was damaged but didn’t know if it was in the description before I bought the item besides that all excellent 👌🏽"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Fiala",
          "Nb_Reviews": 8,
          "Date": "2021-09-30T00:04:43.000Z",
          "Titre": "the price was reasonable enough to…",
          "Contenu": "the price was reasonable enough to upgrade the components for proper application of my personal use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russ M",
          "Nb_Reviews": 1,
          "Date": "2020-03-03T22:36:27.000Z",
          "Titre": "Quality product",
          "Contenu": "Worked fairly well. It did shut down a few times the first few days. It has been functioning well since that time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LUKE S",
          "Nb_Reviews": 4,
          "Date": "2019-01-24T01:38:48.000Z",
          "Titre": "I think this is a very nice computer…",
          "Contenu": "I think this is a very nice computer for the price. It's very fast. Nice packing and fast delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Moore",
          "Nb_Reviews": 2,
          "Date": "2020-03-11T19:27:00.000Z",
          "Titre": "only Issue was packaging",
          "Contenu": "My only suggestion is the packaging.  It was a little skimpy but the iMac survived."
        },
        {
          "Note": 4,
          "Lieu": "BH",
          "Pseudo": "Taha",
          "Nb_Reviews": 1,
          "Date": "2019-07-25T07:29:22.000Z",
          "Titre": "Product is in very good condition so…",
          "Contenu": "Product is in very good condition so far, but the shipment was late for 2 days"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gail S Steelemoyer",
          "Nb_Reviews": 2,
          "Date": "2019-01-24T04:06:50.000Z",
          "Titre": "Excellent service for 12 years",
          "Contenu": "Excellent service for 12 years. Tried and trusted. This company is a class act!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-04-09T21:22:51.000Z",
          "Titre": "Broken first",
          "Contenu": "First Mac was broken but probably shipper’s fault. Replacement works great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-15T18:51:59.000Z",
          "Titre": "Very good customer service",
          "Contenu": "Very good customer service. I look forward to additional purchases"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Mills",
          "Nb_Reviews": 2,
          "Date": "2020-02-06T18:39:58.000Z",
          "Titre": "Great product Would be nicer with a bit…",
          "Contenu": "Great product Would be nicer with a bit more software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-07-22T16:49:32.000Z",
          "Titre": "Perfect iMac as described",
          "Contenu": "Perfect iMac as described. Price was a little high."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hans K.",
          "Nb_Reviews": 3,
          "Date": "2019-01-24T11:29:57.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping , great product , as advertised ,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-09T02:35:52.000Z",
          "Titre": "Devicd was in great condition works…",
          "Contenu": "Devicd was in great condition works perfectly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 6,
          "Date": "2019-01-31T01:46:59.000Z",
          "Titre": "Excellent service and quality products."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-21T16:00:08.000Z",
          "Titre": "Great customer service. Very cooperative",
          "Contenu": "Great customer service very satisfied"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-07-17T03:05:49.000Z",
          "Titre": "So far everything's working great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen Harryman",
          "Nb_Reviews": 1,
          "Date": "2019-01-24T01:17:49.000Z",
          "Titre": "👏VERY SATISFACTORY👏",
          "Contenu": "👏GREAT COMMUNICATION👏"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Foran",
          "Nb_Reviews": 1,
          "Date": "2019-01-31T13:22:10.000Z",
          "Titre": "Good experience",
          "Contenu": "Used iPad like new, as advertised!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse McMinn",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T00:35:13.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Great customer service!Tobias helped me out"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "CU Aleksei Nesterenko",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T08:48:31.000Z",
          "Titre": "Tobias",
          "Contenu": "Tobias - my manager, responsive and fast!Absolutely on all issues went my way and tried to make my purchase easy.I recommend, I recommend, I recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 4,
          "Date": "2023-03-30T15:38:10.000Z",
          "Titre": "Always a 10/10 experience",
          "Contenu": "I’ve bought multiple computers from iPower over the years, and every single one has been excellent. Great customer support, and great quality control. I will always purchase Mac items from this site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irene Tirella",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T15:22:57.000Z",
          "Titre": "This ain’t my first rodeo",
          "Contenu": "Ten years ago I ordered my first MacBook from iPower Resale and it always served me well. When it was time to buy another, I knew I’d return there to get my next one. RIP old work horse but I am excited to explore the possibilities of this new one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G.A. Terry Mills",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T18:36:08.000Z",
          "Titre": "IPower Resale has never failed me with…",
          "Contenu": "IPower Resale has never failed me with there refurbished products.  In my experience, after purchasing 3 Apple devices I could not be more pleased.  For every device purchased, I couldn’t tell if the device was not new!  I would urge anyone who has found this company to make their purchase.  Excellent products and customer service.  *****+ Stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgine Jurdan",
          "Nb_Reviews": 3,
          "Date": "2022-07-29T07:34:22.000Z",
          "Titre": "Beautiful Computer!!  Very Satisfied!",
          "Contenu": "The computer arrived on time, looks beautiful, in box like new. I needed an adapter plug to use my cables and had back up problems with my Old 2012 MacBook Pro. However today, everything uploaded perfectly and I am LOOKING FORWARD to using this much newer 2020 MacBook Pro machine! Clean, Beautiful, Monterey appears to be perfectly installed. So far very good! Wonderful experience!! Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mariana",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T14:51:03.000Z",
          "Titre": "We are very pleased in dealing with…",
          "Contenu": "We are very pleased in dealing with iPower specially our direct contact (Lauren Smith) is fantastic and great to work with. iPower is one of our favorite suppliers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 2,
          "Date": "2022-04-27T17:33:17.177Z",
          "Titre": "Just like new at a fraction of the…",
          "Contenu": "Just like new at a fraction of the cost.  Couldn't be happier.  Fast shipping all the way across country to DC.  Computer, again, is pretty much brand new in perfect working and physical conditions.  No fingerprints or any other signs that indicate the computer I received is any different than the exact description of the computer I purchased online.  After losing my original book, hope to never do business like this again. But if I do, I'll be coming back to iPower."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T19:07:20.000Z",
          "Titre": "The Absolute Best Aftermarket Apple Company.... Period!",
          "Contenu": "I have bought at least 6 custom builds from Christina & her gurus over the last 10+ years. Their products are like new, their customer service is from a long lost bygone era and my soup to nuts experience is always flawless. In simple British.... They Are Bloody Brilliant!!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Wai Tham",
          "Nb_Reviews": 2,
          "Date": "2022-12-03T00:48:36.000Z",
          "Titre": "100% excellent customer service",
          "Contenu": "It's not the first time I have purchased from iPower Resale, this last purchase is my fourth purchase of MacBooks from iPower Resale.  The key element here has been the support of Christina is assisting the purchase, and also helping very much in coordinating the purchase.  Great customer service as well.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Gaetano",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T03:21:37.000Z",
          "Titre": "Lauren Smith is great really on top of…",
          "Contenu": "Lauren Smith is great really on top of it really helpful / i had a bunch of memory issues when i bought my new iMac_that came as a surprise and she gave me direction in what to do _so i did it and it worked out great. She sent me a bunch fo support articles from Apple that covered some of my problems_so she's great and i really appreciate her help_ and my new iMac is happy too!!!_nick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU mericiana howard",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T02:40:36.000Z",
          "Titre": "Hard to find words for my appreciation…",
          "Contenu": "Hard to find words for my appreciation for their sincerity to fix the problem of the wireless keyboard connective issue.  After spending 4 hours communicating with Apple, and unable to resolve the problem, they agreed to take the computer back and fixed the problem.  Be sure you have a cable enclosed with your computer to connect with a wireless keyboard.  Even my wired keyboard would not connect and it was indeed frustrating.  Power Resale was open to accepting my computer back and paid for the shipping charges.  They then fixed the problem and was open to communicating with me in a timely manner.  I appreciate their sincerity in resolving the issue.  This is a great Mac and love that I have a computer that works great.  Thank you iPower Resale."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2022-05-25T05:00:27.000Z",
          "Titre": "iPower has always provided topnotch…",
          "Contenu": "iPower has always provided topnotch equipment at reasonable prices. I have purchased 5 Macs from them over the years and all have performed (and even looked) like they were brand new. The latest Mac came promptly, was in pristine condition, and is running perfectly. Once again, a completely satisfied customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Mike Sipiora",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T20:05:56.000Z",
          "Titre": "First rate products and service",
          "Contenu": "Friendly, helpful, knowledgeable staff who assisted me in picking the right computer for my needs, transfering my data, and providing the auxiliary hook-ups to my current monitor. Quality Apple products at fair prices. I have bought several devices from them over the years and have always been happy with the purchases and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony A",
          "Nb_Reviews": 1,
          "Date": "2022-05-19T07:04:18.000Z",
          "Titre": "The computer was in great condition",
          "Contenu": "The computer was in great condition. It appeared to be new, except that it was delivered in non Apple packaging. It is now being used hard by my son & has performed perfectly during the two weeks we have had it. It comes with a 1 year warranty so that is always a plus. The staff was great, putting the order together quickly & allowing me to choose local pickup instead of delivery, as I reside close enough for the trip. I even received simple verbal instructions about how to migrate the user account from my old machine to the new one. Who gives basic live, free, & accurate technical support any longer. My answer is iPower Resale. Well done. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stever",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T00:06:42.000Z",
          "Titre": "Great company and experience",
          "Contenu": "The renewed computer I received was great. Low (3) battery cycles and in great condition. All the accessories were included, and it even came in the original packaging. I had a need to contact iPowerresale and their customer service was absolutely stellar. They were responsive, ready to help and able to resolve my issue quick and to my satisfaction. I was concerned about getting a renewed computer from a company other than Apple but after this experience I recommend iPowerresale with confidence. All this good experience plus I was able to save hundreds of dollars compared to my other options, that also makes me happy!"
        },
        {
          "Note": 5,
          "Lieu": "GU",
          "Pseudo": "Wes Gima",
          "Nb_Reviews": 1,
          "Date": "2022-05-15T08:39:26.000Z",
          "Titre": "I had a problem with the RAM on my Mac…",
          "Contenu": "I had a problem with the RAM on my Mac Pro purchased from iPower Resale. Christina Prins was very helpful in helping me solve the problem by sending me a replacement at no charge (Note: do the extended warranty!). Everything is working fine now. She even included a printed return slip and a bag for the return of the old RAM. I'm very happy with iPowerSales' response and solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Caleb Lehman",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T20:07:23.000Z",
          "Titre": "MacBook Pro arrived in perfect condition!",
          "Contenu": "I ordered a refurbished MacBook Pro with an M1 Pro chip from this company through Walmart. I’m not the biggest fan of used items, but it was a good deal for the price, so I was like sure, why not. The item ended up arriving early and in amazing condition. I could barley tell it was used, and came with the box, instructions, charger, and everything. Also, the battery health was 100%. Super pleased with my experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Randall Re",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T16:58:24.000Z",
          "Titre": "Apple support and sales team has all…",
          "Contenu": "Apple support and sales team has all been positive.  I am not sure who I spoke with on November 14 but in the pass I have emailed and spoke with Christina Prins who has been very helpful in all matters.  Even trying to get me a Apple Gift Card for my purchase on the 14th from the promotion of November 25 to 28.  Speaking with Apple sales who would horror the request but we or Apple could not find my purchase order even at the iPower."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer P.",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T07:26:59.000Z",
          "Titre": "The whole process was effortless",
          "Contenu": "The whole process was effortless, processing of order and shipping was extremely fast. Very satisfied with everything. The package Arrived a week earlier than promised, easy tracking and the best of all the product worked right out of the box. Never had a problem!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Gabrielli",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T21:35:36.000Z",
          "Titre": "If you have a problem these guys are who you want.",
          "Contenu": "I recently purchased a computer from them and had a problem with it.  They immediately shipped me another and made the buying experience and return as easy as it should be.  I would purchase from them again because when you buy an expensive piece of equipment you want a company that stands behind the product.  They did!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerardo Rodriguez DJ",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T21:40:31.000Z",
          "Titre": "IPower has been my go-to location for…",
          "Contenu": "IPower has been my go-to location for all my repair and maintenance needs for all of my OS/x needs for well over 7 years.    I’m what some would consider a HARD/ power user. With me needing new machines about every 3 years, they’re also my stop for refurbished machines"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Zimmerman",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T15:40:34.000Z",
          "Titre": "The folks at IPower are always patient…",
          "Contenu": "The folks at IPower are always patient and willing to spend as much time with me as I need when I am making buying decisions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Dolister",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T22:16:05.000Z",
          "Titre": "Excellent products and service!",
          "Contenu": "Excellent products and even better customer service! I've trusted and worked with iPower Resale for 10 years now and they always provide the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2022-04-11T17:52:53.000Z",
          "Titre": "What I received was basically brand-new",
          "Contenu": "I purchased the iPad pro 12.9 from Power Resale because I wanted the larger screen to pair with my Macbook, but I did not want to pay the retail price.  What I received came in the original packaging and it was basically brand-new. It still has 10 months of warranty with Apple and I received 12 months of warranty from Power Resale. Best of all, I received it within 2 days of ordering."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mateus Dalmeida",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T22:47:42.000Z",
          "Titre": "4th Mac from iPR, five stars",
          "Contenu": "This is the 4th computer I bought from iPowerResale, and I have nothing but positive things to say about the company and it's reconditioned macs. Computers are consistently as described cosmetically, and in great shape, and the company has great customer support (I've been on the phone with them a dozen times, great people out there). The first one I bought was in 2016, a mac pro with a previous generation iOS (in order to run my old version of pro tools). That one is still running great, in my home studio. SInce then I got two laptops for family members (both still running great), and recently I upgraded to a 2019 i9 macbook pro (with previous gen iOS and RAM upgrade). Smashing!One hundred percent satisfied, will keep giving iPowerResale my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shan",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T19:45:12.000Z",
          "Titre": "iPower Resale stand behind their…",
          "Contenu": "iPower Resale stand behind their products and support customers with direct contact with sales reps.  They go above and beyond to provide a great customer experience.  I'll definitely shop with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince C",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T16:25:34.000Z",
          "Titre": "Fabulous service",
          "Contenu": "Fabulous service, great pricing, super fast shipping. Shipping where the shipper actually obtained the signature, which is rare these days. Would absolutely purchase from iPower again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Sera",
          "Nb_Reviews": 3,
          "Date": "2022-04-07T11:36:23.000Z",
          "Titre": "Great Laptop and Good Price",
          "Contenu": "I've purchased several computers from iPower Resale and they've worked well and continue to be problem free. The one MacBook Pro that we had an issue with was rectified quickly with minimal downtime. Thanks Again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Tseng",
          "Nb_Reviews": 1,
          "Date": "2022-03-03T20:58:15.000Z",
          "Titre": "Happy Return Customer.",
          "Contenu": "My latest MacBook Pro M1 was my second order from iPower Resale. The laptop worked like one. Customer Service kept prompt communication to answer questions regarding product specifications and payment options through emails and phone calls. Shipment was handled through UPS with signature-required delivery that made the whole process more secure. Now, I am waiting for availability of the MacBook Pro M1 Max at iPower Resale for my next order."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Wai Tham",
          "Nb_Reviews": 2,
          "Date": "2022-02-10T21:31:59.000Z",
          "Titre": "Always Meets Customer's Expectation !",
          "Contenu": "This is the second time I have purchased from iPower Resale and in both occasions it has been an excellent choice.  What I admire is their professionalism - when they categorise the product as Grade A, it means Grade A.  On top of this, when you contact them, they are approachable, helpful and always provide feedback accurately.  It will not be the last time I will buy from them, and foresee a long term as a customer to iPower Resale. Thank you to the iPower Resale team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CD",
          "Nb_Reviews": 3,
          "Date": "2022-09-28T19:08:56.000Z",
          "Titre": "iPowerResale is my go to Mac Reseller",
          "Contenu": "iPowerResale is my go to Mac Reseller. They have excellent customer service and fair prices on reliable used Apple Mac computers. There warranty is peace of mind for your purchase. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. G.",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T16:04:39.000Z",
          "Titre": "Computer purchase was super easy",
          "Contenu": "Computer purchase was super easy, arrived in a very timely fashion, laptop was in great shape! I would like to see a 2-year warranty option for maybe $100 or $150 on computer purchases, but regardless we will be back!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy O.",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T00:15:20.000Z",
          "Titre": "Why deal with Apple when there's iPower",
          "Contenu": "Telephoned, stated my problem, brought in my laptop, went home, they called, and I picked up my laptop. Problem solved. Great service! I've been a customer for more than 10 years. (I don't remember the exact date of recent visit, about 2 weeks ago.)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Dubs",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T06:16:55.000Z",
          "Titre": "I have made a few purchases from iPower…",
          "Contenu": "I have made a few purchases from iPower and all have been great experiences. One of the things that is particularly cool about iPower is if you have questions they are there to assist you without long hold times,like many other stores. Always friendly and helpful while at the same time great prices and warrantys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin  Chamberlin",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T11:49:02.000Z",
          "Titre": "I have now purchased two computers from…",
          "Contenu": "I have now purchased two computers from iPower Resale, once through eBay and once direct from their website. I appreciate the customization options and the phone call I got confirming the purchase from the website...and I've been very happy with my recent purchase itself as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John T",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T13:04:01.000Z",
          "Titre": "We have purchased numerous macbooks and…",
          "Contenu": "We have purchased numerous macbooks and accessories and are always like new condition.  Easy to navigate website.  Has the products we need.  Has always delivered on time.  Courteous staff too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P Sargent",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T01:13:49.000Z",
          "Titre": "Totally thrilled with my purchase and…",
          "Contenu": "Totally thrilled with my purchase and thrilled about the quality of their customer friendly service ! Might do it all over again...Top quality Apple 27 \"5K inabsolutely impeccable condition. I'll be a repeat customer for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin G.",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T22:48:09.000Z",
          "Titre": "I’ve had this Intel Mac Mini (2018)…",
          "Contenu": "I’ve had this Intel Mac Mini (2018) computer for a couple weeks and outside of the fancy box opening experience, can’t say there’s any difference between what I bought and a new unit. Was originally apprehensive about buying a used computer, but if this one holds up, I won’t hesitate to buy from iPower Resale again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Ben Rangel",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T13:47:11.000Z",
          "Titre": "This is the second Macbook I have…",
          "Contenu": "This is the second Macbook I have bought from Power Resale. Both times I have been met with excellent customer service and MacBook showed up as advertised."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "CU Matthias Daniel",
          "Nb_Reviews": 2,
          "Date": "2022-08-16T16:08:34.000Z",
          "Titre": "Great Buy. Friendly and competent staff",
          "Contenu": "Very friendly and technically competent manager and staff.I just got the best product I wanted with top conditions.It was just like in a flash, in a matter of minutes, I was out of the store happily carrying my desired product in my hands.Awesome. Keep it up at iPowerResale."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Asfar Rizvi",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T07:47:07.488Z",
          "Titre": "Exceptional Customer Service and Great Prices",
          "Contenu": "iPower Resale has been phenomenal in terms of their customer service with great prices for all the mass I bought. I strongly recommend them - Please refer to the review video on my YouTube channel -- \"HotRods - DFW\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Byrne",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T19:40:22.000Z",
          "Titre": "I've been buying macs here forever, they never disappoint.",
          "Contenu": "I've been buying mac laptops from ipower since they were a tiny business, at least 10+ years. They're always pretty easy to do business with. The operation has grown and expanded since I last bought a computer here (5+ years ago!) But it was easy enough to order, on Cyber Monday no less! And pick it up same day. It was a good deal for a great machine, as always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 3,
          "Date": "2023-03-20T16:58:29.000Z",
          "Titre": "Everything was perfect",
          "Contenu": "Everything was perfect, as usual: accuracy of product, price, shipping, condition of product, everything!Great seller!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "CU Landman Robotics",
          "Nb_Reviews": 2,
          "Date": "2022-10-31T09:35:21.000Z",
          "Titre": "Thank you iPower Resale for excellent…",
          "Contenu": "Thank you iPower Resale for excellent (and friendly) service! The units arrived at our premises in pristine condition as promised! Thank you iPower Resale! You guys rock! We highly recommend iPower Resale!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 6,
          "Date": "2022-09-17T02:51:05.000Z",
          "Titre": "This was one of best buying experiences…",
          "Contenu": "This was one of best buying experiences I've had in years! I found the exact MacBook Pro I was looking for and the price was $650 less than the exact item on Amazon. Great company, great service (free FedEx 2-day shipping!), great prices! Nuff said..."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Azalea",
          "Nb_Reviews": 1,
          "Date": "2022-03-14T17:01:41.000Z",
          "Titre": "Thankful & Extremely Pleased",
          "Contenu": "My family and I, over the past few years, have been extremely pleased with our service here purchasing and repairing multiple devices. The team is so helpful, personal, and friendly. Thankful that we get to support local businesses when purchasing electronic equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Incident IQ LLC",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T22:59:31.000Z",
          "Titre": "Thanks to Lauren Smith!",
          "Contenu": "Sales Manager Lauren Smith went above and beyond to reach out and make sure we were taken care of! We ended up ordering 10 more laptops after messaging with her and getting a better deal for better hardware. Thanks Lauren!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T19:54:13.000Z",
          "Titre": "Very Pleased!",
          "Contenu": "This was our second computer purchase from iPowerResale.  We’re very happy with this company.  Save lots of money by buying gently used, fully functional computers here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Kathryn Densmore",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T17:43:01.000Z",
          "Titre": "They were so helpful in getting me what…",
          "Contenu": "They were so helpful in getting me what I needed and assessing what would be with the best for me. Very friendly and helpful and not any kind of pressure whatsoever."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Wamsley - WashU",
          "Nb_Reviews": 1,
          "Date": "2022-06-06T22:10:11.000Z",
          "Titre": "Great service - Great results!",
          "Contenu": "Great service - wonderful selection and results!  Exactly what we wanted and needed at great prices.  Shipping was excellent and we plan to make additional future purchases like this.  THANKS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chimaera Sound Studios",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T18:52:31.000Z",
          "Titre": "Chimaera Studios runs on iPower",
          "Contenu": "A recording studio relies on their computer platforms just as heavily as they rely do their microphones, mixing boards, etc. Configuring these processing beasts can get very complicated, very quickly.  Here at Chimaera Sound Studios, we turn to iPOWER as a partner for all of our computing needs because they understand our industry and our specific configuration requirements. Knowledgeable staff, great service, and incredible flexibility. That's why we consider them a trusted partner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 4,
          "Date": "2021-12-06T23:36:57.000Z",
          "Titre": "Thank you soooo much for the fantastic",
          "Contenu": "Thank you soooo much for the fantastic, in-working-condition, like-brand-new wireless keyboard. Everything we've purchased from you guys is still working to this day. We appreciate the \"mint\" quality of all of our purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Experimax - Escondido",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T18:45:16.000Z",
          "Titre": "Appreciation to Lauren for making this happen",
          "Contenu": "Ms Lauren Smith was fantastic, very professional and efficient. She made everything seamless and simple and it was really nice to work with her on this. I am definitely looking forward to many more deals with her. She was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2023-01-03T19:46:06.000Z",
          "Titre": "The MacBook Pro arrived before…",
          "Contenu": "The MacBook Pro arrived before Christmas as promised.  It was in perfect condition and my wife loves it.  Saved a lot of money compared to going to Apple.Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Hyrum Gailey",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T20:49:00.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience, the first computer I bought had some small problems and they offered to send me a replacement asap. Super easy to work with 10/10 would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenny",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T05:59:51.000Z",
          "Titre": "Friendly knowledgeable staff",
          "Contenu": "Friendly knowledgeable staff. Macbook Pro M1 Max was exactly as described. I would definetly purchase from them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Wohl",
          "Nb_Reviews": 1,
          "Date": "2022-05-07T01:16:21.000Z",
          "Titre": "They really came through for me and…",
          "Contenu": "They really came through for me and chose the option that was best for me which wasn’t the most expensive. I have been recommending Ipower resale for years and will continue to recommend them!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dexter Mengus",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T18:40:00.000Z",
          "Titre": "iPower Resale - Value and Service",
          "Contenu": "Excellent customer service from iPower Resale. The MacBook Pro was just as described, and shipped in a damage-proof box. This is the second Mac I have bought from them, and I will probably buy another one. The value is just too good to pass up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Davis",
          "Nb_Reviews": 2,
          "Date": "2021-11-18T18:32:23.000Z",
          "Titre": "After being frustrated with looking at…",
          "Contenu": "After being frustrated with looking at MiniMacs on eBay, I turned to iPower Resale. Better deal, with warranty and real people who know what they're selling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan O'Kelley",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T17:09:14.000Z",
          "Titre": "Consistent Products and Service",
          "Contenu": "I have purchased multiple laptops and iPads from iPower Resale spanning 9 years, great products and service, there's a reason they are my first choice for Apple products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole Bell",
          "Nb_Reviews": 3,
          "Date": "2022-08-27T03:59:52.000Z",
          "Titre": "Basically brand new!",
          "Contenu": "Another great purchase from iPower resale! Will be buying out next desktop from them. The watch I received was basically brand new- it even came with the box and packaged as if it came from Apple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Sipiora",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T02:24:35.000Z",
          "Titre": "Always great service",
          "Contenu": "Always great service. Reasonable prices. Helpful, friendly people. This is maybe the 5th or 6th product purchased from them over the years from computers to iPads. Very glad that they are an alternative to the Apple Store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua A.",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T03:17:09.000Z",
          "Titre": "I recently purchased my iMac 2020 from…",
          "Contenu": "I recently purchased my iMac 2020 from iPower Resale and everything went smooth.  My computer is up and running, working great and looks great too.  This is my second purchase from iPower Resale and they're my go to store when I need to buy a Mac computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda RS",
          "Nb_Reviews": 3,
          "Date": "2022-03-31T16:51:10.000Z",
          "Titre": "Great service",
          "Contenu": "I recently bought a new iPad from iPower resale and am totally pleased with it. My sales rep took all the time needed to make sure my existing apps and data were transferred and working properly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zeke  Monarrez",
          "Nb_Reviews": 1,
          "Date": "2022-03-25T22:32:22.000Z",
          "Titre": "The entire staff at Ipower is amazing",
          "Contenu": "The entire staff at Ipower is amazing. I send all of my friends there for their Apple needs. They are friendly, knowledgable and always go the extra mile when it comes to customer satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU TB",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T19:09:12.000Z",
          "Titre": "Will be a returning customer",
          "Contenu": "So this is my first time ever buying a refurbished machine and it won’t be my last from here. I got the macbook Pro 16 inch. The first one they gave me was kind of dirty and messed up so I was quick to let them know about it. and they swapped it out right away for what seem to be a brand new machine!! It works like new and I got it for the fraction of the price I would’ve paid for through Apple. Plus I power resales Product care program is extremely worth the extra hundred dollars or so. I would recommend getting that with any merchandise you buy it’s by far better than apples “apple care” quick run down about the comparison. I got a brand new iMac through Apple back in 2020 and I noticed something was wrong internally with the machine and they refused to do anything about it until a year and a half later after almost 20 visits to the store n my machine was almost out of warranty..this place makes it clear if they’re is anything wrong they will work on it right away. So I will be coming back here whenever I need any apple products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan  Madriz",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T18:47:02.000Z",
          "Titre": "Everything went smooth",
          "Contenu": "Everything went smooth, from next day delivery, to the curtious phone call to confirm the order, to the online shopping. Recommended already. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason G.",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T23:08:26.000Z",
          "Titre": "Product was better than I expected",
          "Contenu": "Product was better than I expected. I had an issue with the supplied charger and customer service sent a replacement in 2 days. Very prompt, great customer services and products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Hirsch",
          "Nb_Reviews": 3,
          "Date": "2022-04-22T04:36:21.661Z",
          "Titre": "Other than me wanting to avoid having…",
          "Contenu": "Other than me wanting to avoid having them ship 15 miles, and so going to pick up and having some trouble finding the place, all is good and I am happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G O",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T05:22:11.000Z",
          "Titre": "Excellent seller!",
          "Contenu": "The seller was very responsive when contacted. I am still evaluating the product that I purchased but it is working well so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU A. F.",
          "Nb_Reviews": 2,
          "Date": "2022-08-31T23:55:55.000Z",
          "Titre": "Great Service",
          "Contenu": "Sales Dept. so helpful, understood my need, found the perfect computer, facilitated transfer of my files, email and contacts, all with a cheerful attitude. Very good personal service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "michael kastenbaum",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T23:02:41.000Z",
          "Titre": "Lauren and iPower Rock",
          "Contenu": "Lauren and others helped me and did an AWESOME job and i look forward to more purchases from iPOWER!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU DD SoCal",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T21:40:52.000Z",
          "Titre": "Another Great Purchase",
          "Contenu": "Have purchased in the past. Products are great and very accurate to the description. Shipping is prompt. I always recommend iPower Resale."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU prince ra el",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T01:27:17.000Z",
          "Titre": "As usual I love doing business with…",
          "Contenu": "As usual I love doing business with Ipowersales or resales. Smooth no hiccups and if so in the past you guys went over and above in your services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Salvatore",
          "Nb_Reviews": 1,
          "Date": "2021-12-10T19:27:40.000Z",
          "Titre": "These guys are the best",
          "Contenu": "These guys are the best! They actually care about what they are doing and the products they sell. Great communication and laser fast shipping. Highly recommend!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T19:57:35.000Z",
          "Titre": "Great customer service.",
          "Contenu": "Great customer service.I received a somewhat defective product, and the customer service team worked quickly to get me a replacement. Christian was great, polite, and diligent in his communications with me. While I was upset that I received a defective product, I would 100% work with iPower Resale again.- Alexander"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Toole",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T20:24:12.000Z",
          "Titre": "My 2015 MacBook Pro internal video card…",
          "Contenu": "My 2015 MacBook Pro internal video card failed, and I needed to replace it. Thank you for helping me find a replacement @ a reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Ryan Spearman",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T20:51:51.000Z",
          "Titre": "I am very happy with my purchase.",
          "Contenu": "I am very happy with my purchase from your company.  The price was right, the shipping was great and the product is exactly as described.  I am already planning to purchase another one of these MacBooks for my wife.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T02:52:07.000Z",
          "Titre": "CHRISTINA was simply wonderful and so…",
          "Contenu": "CHRISTINA was simply wonderful and so very kind and helpful. You are so fortunate to have her on your staff! I highly recommend iPower Resale!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aki",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T00:35:57.000Z",
          "Titre": "Reliable place to buy computers",
          "Contenu": "I'm very satisfied with my overall experience for this purchase. Not only I was able to get a great computer with a reasonable price with an additional customization, friendly and professional staffs made me feel welcome. I'm certain that I'll be purchasing from them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Dennis Smallbone",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T22:46:42.000Z",
          "Titre": "Extremely Happy!",
          "Contenu": "Extremely happy with the product and service I received from iPower Resale. Would strongly recommend them to anyone looking for a Pristine referb for 1/4 the price."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gregor  Phillips",
          "Nb_Reviews": 1,
          "Date": "2022-02-02T23:40:23.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Followed up right away to confirm order and shipped in the same day. Incredible value, this is our organization's go-to mac reseller."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ellen lerner",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T00:23:12.000Z",
          "Titre": "Happy",
          "Contenu": "Thank you for all your kindness and help. I love my iPad Air 3 and my 20 watt charger. Gave my friend your name and number because you are a very honest company. Enjoyed working with all of you. Be safe and Happy Holidays. Ellen"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Mark Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T17:48:21.000Z",
          "Titre": "Another Mac purchase from IPOWER.",
          "Contenu": "Another Mac purchase from IPOWER.Fast shipping, easy transaction. I highly recommend !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike L.",
          "Nb_Reviews": 2,
          "Date": "2022-04-04T23:40:53.000Z",
          "Titre": "I got precisely the product I expected",
          "Contenu": "I got precisely the product I expected, it works perfectly so far. The delivery was very timely, as well. As was the customer service, when I had a question."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loren Bass",
          "Nb_Reviews": 2,
          "Date": "2023-02-02T19:26:24.000Z",
          "Titre": "Helped me find what I “needed”",
          "Contenu": "Christina, talked me down from an iPad Pro to a more reasonably priced regular iPad. I had no reason for the pro. Thanks for helping me get what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony La Cava",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T15:45:44.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Had an issue with missing power adaptors when I received my order and they just right on it and resolved the issue very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd D. CU",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T02:56:35.000Z",
          "Titre": "IMac A++++",
          "Contenu": "My new to me IMac is absolutely beautiful and of course runs like new.  Was graded excellent and that is exactly what it is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Lisa W",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T21:20:57.000Z",
          "Titre": "Great service",
          "Contenu": "Sean was super helpful getting me the perfect machine for my needs. Would definitely recommend him to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Barbour Shop",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T23:29:17.000Z",
          "Titre": "IPower Resale is the BEST",
          "Contenu": "IPower Resale is the BEST. Super knowledgeable, professional, and they went out of their way to make sure I was happy with my products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CU Gene Langkop",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T00:46:08.000Z",
          "Titre": "Christina helped me immeasurabley",
          "Contenu": "Christina helped me immeasurabley. Great computer, excellent help so I could use point for my new computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David  Turner",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T18:27:43.000Z",
          "Titre": "Very happy customer",
          "Contenu": "I have purchased two laptops from this company and couldn't have asked for better quality or customer service. Definitely will continue to shop here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jolene",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T06:57:38.000Z",
          "Titre": "I was served with efficiency and…",
          "Contenu": "I was served with efficiency and courtesy. I will definitely want to work with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DUSTIN  MARSHALL",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T22:23:33.000Z",
          "Titre": "This is the second computer I’ve bought…",
          "Contenu": "This is the second computer I’ve bought from them. The older one still rocks absolutely no issues. The newer one I got had a video card go bad. I was still under my 90 day warranty. I tried my best to remedy the issue but there was nothing I could do. I messaged them and they gave me options. So I ended up just buying one for them to send them I’d be able to send the broken one back. I’m in Maryland and the box from California got here in a few days. I was able to recover my new machine and have sent the broken one off. The process was very quick and no fuss they took care of me. Highly recommend A+"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Dubs",
          "Nb_Reviews": 2,
          "Date": "2022-02-05T18:18:32.000Z",
          "Titre": "I had experience with Ipower in the…",
          "Contenu": "I had experience with Ipower in the past.My dealings with them were always very positive. So, when it was time to get a new computer, it was an easy choice to go back to them. I wasn’t sure exactly what I needed for my needs. Christina was very helpful offering me a couple of choices of machinesthat would do the job. After purchasing the new MacBook Pro, I had questions.The customer service is excellent. Very helpful, cheerful and friendly! I was told if I had any questions to feel free to call.I couldn’t be happier with my new MacBook and knowing I have team of people that are there if I need help with anything!If you are looking for an honest and helpful place to buy your next computer, I can’t recommend Ipower highly enough!Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Faith R",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T21:33:03.000Z",
          "Titre": "Very happy with this buying process",
          "Contenu": "Very happy with this buying process! I was able to talk with someone on the phone before I ordered and they were very helpful in helping and answered all of my questions. Then the computer arrived within days. It looks and acts like it's brand new. Everything is great!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "clement eleke",
          "Nb_Reviews": 2,
          "Date": "2022-06-03T21:45:57.000Z",
          "Titre": "Top notch technology",
          "Contenu": "Top notch technology. I purchased the device brand new, all the accessories were complete and well packaged. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Altshuler",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T19:55:54.000Z",
          "Titre": "I purchased two open box computers from…",
          "Contenu": "I purchased two open box computers from them. Everything was handled professionally and courteously. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Central Coast AV",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T00:07:29.000Z",
          "Titre": "Great Local Mac Provider",
          "Contenu": "Great local company that covers all our mac computer needs.  Always helpful and well priced."
        }
      ]
    }
  ]
}