{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "itrustcapital.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "Batman Robin",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T18:09:03.000Z",
          "Titre": "Something is fishy with this company",
          "Contenu": "Something is fishy with this company. I rolled over my IRA from Fidelity to iTrust to long term hold crypto a year back. I am starting to find out that their support is non existent and not willing to help you log into your own account. Their KYC has been showing up error for a couple of days now and I am afraid that they might be insolvent. I have been trying to reach out to them but one guy tells me my request has been sent to the engineers and no response thereafter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K G",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T02:08:12.000Z",
          "Titre": "Faulty system empty apologies",
          "Contenu": "Be careful putting any funds here, I have been unable to purchase crypto for months now. I have 3k available USD and when I try to buy any asset and it says failed to execute order. When I speak to customer service they are apologetic and keep saying give us a few more days. I appreciate the apology but I would prefer to have the use of my funds. Luckily I only have lunch money in there. If anyone is considering putting what they deem a lot of money in the hands of itrust I would first consider the fact that when things go wrong they will say sorry its out of our control."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MIke K",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T23:35:28.000Z",
          "Titre": "Missing money attempted to roll over 401K",
          "Contenu": "Attempted to roll over 401K.  Previous Financial Institution confirmed money sent to iTrust seven (7) days ago. iTrust does not show money, and now they can't be reached by phone (7 attempts), and 6 emails without response.  Have they shut down!?  I'm starting to panic."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Colburn",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T14:39:33.000Z",
          "Titre": "I cannot add funds to my existing…",
          "Contenu": "I cannot add funds to my existing account. I have a connected bank account, but, I keep getting the message to add a bank account. . I keep getting recycled thru the process of “add bank account “. Then a message comes up saying I’ve successfully added my bank. When I try to add funds the same request for connecting my bank comes up constantly. “Customer service has not been able to rectify this glitch. They told me a number of customers have had the same problem. I’m ready to transfer my Roth account to another platform."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve B.",
          "Nb_Reviews": 4,
          "Date": "2023-04-18T23:00:40.000Z",
          "Titre": "Run don't walk away this company",
          "Contenu": "Run don't walk away this company! They don't take calls because of the high volume of calls they receive. Don't bother using their ticket system, they won't respond to tickets either. 'We received it today' means 'we received it a week ago'. 'We are processing it today' means 'we may never process it'. 'You'll receive the money at your new custodian in 1-3' days means 'leave me alone'. I'm trying to be very objective with my review in the hopes that this company takes the feedback to heart and reassesses how they do business. Everything I said can be backed up with written proof."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Holly Whalen",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T14:28:22.000Z",
          "Titre": "Transaction Fraud",
          "Contenu": "I executed several transactions this morning for Bitcoin.  All these transactions showed an amount $100's below $30,000.  Yet all of my transactions beginning yesterday evening show for exactly $30,000.  Unfortunately I didn't go back and look into transaction history until after I had done many transactions.  I'm shocked!  I wonder if these kinds of things happen with fidelity.  Considering moving my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 4,
          "Date": "2023-03-23T00:04:55.000Z",
          "Titre": "Customer service is slow and sends…",
          "Contenu": "Customer service is slow and sends generic responses rather than responding like humans asking actual questions. And the app is super buggy, it's borderline useless. With all the banks going down, particularly in crypto, I wouldn’t trust these guys to stick around."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nguyet Dibble",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T21:39:27.000Z",
          "Titre": "Uncalled for and unethical mode of…",
          "Contenu": "Uncalled for and unethical mode of customer servicing. Till date gotten no response to the issue i raised exactly a week ago. I'm convinced they are just incompetent because scam report consensusSRCSS, had issued a chainalysis audit and warnings on their networks earlier, had I saw that before handling my money to them, would not have fell for the IRA gimmicks. Check a chance of opting out, professional guidance on deck are excused. Having opting eighty per cent is better than losing all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Megan L",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T01:27:00.000Z",
          "Titre": "Company delisted MANA and ALGO tokens…",
          "Contenu": "Company delisted MANA and ALGO tokens without any notice!  I now cannot sell those tokens and have no control over them!  Highly unprofessional!  Also, NO follow up communications from CEO/management regarding this!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 4,
          "Date": "2022-11-19T02:32:19.000Z",
          "Titre": "Site Went Down - Had No Access to Stocks for Weeks",
          "Contenu": "The site went down in the summer of 2022 for 5 days (July 29th until August 2nd) without any communication from iTrust Captial for days. None of us had a clue as to what was going on and why everyone had no access to their retirement IRA / Crypto accounts. Hopefully, such things like this will never happen again, because it was a long scary week for all of us, and we thought all our savings would be lost. In addition, they also don't have any capability of allowing us users the safely secure any crypto stock to a wallet or hardware device for safekeeping like a Ledger. If they have another shutdown like before, your crypto stock and retirement savings could be lost for good. The only thing I like about them is that they have a 1% fee on purchases. But other than this, their service and interface is very lacking."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Jon Pergande",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T21:36:51.000Z",
          "Titre": "Compliance department is horrible!",
          "Contenu": "I received a distribution in 2021 and my taxes withheld weren’t remitted to the state properly. I have been working with customer relations for over a month and a half and they have been unable to get it corrected with the custodian. They also screwed up the original distribution. Two interactions and two problems. Batting 0%!  I am seriously report my experience to the Department of Labor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mr. Martinez",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T23:32:44.000Z",
          "Titre": "I have been though 3 transfers…",
          "Contenu": "I have been though 3 transfers personally and every time is different. It seems like iTrust can't be consistent. The worst part is that when you talk to any reps its like talking into the wind. iTrust is going to make there money regardless but its still early in this game and hopefully the future brings us an entity that listens to the customer more. Also you can forget about referral rewards they want you to open an account with a particular service in order to get it. They probably get paid by them to gain users. I already have Paypal which is one of the ones they list as using but they wanted me to open an account with the other one they use. Why couldn't I get it with the one I already have! Just when I thought I was done in order to wright this review they will automatically create an account for me with Trustpilot. Great!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BCH Freedom",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T01:33:38.000Z",
          "Titre": "FIDELITY MAY BE A BETTER OPTION?!",
          "Contenu": "SEC mentioned ALGO and MANA, and management immediately delisted these tokens.  ALL other tokens (except Bitcoin) can also get delisted any time by management.  For only the Bitcoin offering, might as well TRANSFER TO FIDELITY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HC",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T22:44:04.000Z",
          "Titre": "Distribution haven't arrived",
          "Contenu": "I have been waiting for my Distribution for a month. Customer service said that it was sent out on October 11, 2022.  And it will take 2 to 3 weeks for you to receive it.  Well, I didn't receive it.  I spoke to Zach on November 2, 2022, said wait till to 5th of November 2022.  It didn't arrive.  I called Zach the following Monday.  Won't be in the office all week.  So, I was transferred to Trent.  Gave the circumstances said that he will research it and will call me back.  He did call me back.  Informed me that distribution will overnight my distribution.  Its November 10, 2022, and I still haven't received my distribution that was supposed to be over night.  I didnt get a tracking number or what way was it coming through USPS, FEDEX or UPS.  I was just informed I will get it overnight.  If I knew I was going to get this much problem to receive my distribution.  I wouldn't have moved my funds from Fidelity.  Trent is helpful.  He is just going by what distribution is telling him."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Patera",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T16:15:39.000Z",
          "Titre": "Itrust not answering calls or email. Panic!",
          "Contenu": "I transferred money on a roll over and itrust did confirm they have the funds. It has now been over a week and they have not made the funds available. I have called and was told tomorrow. Now they won't answer the phone and not responding to email. I believe something bad has happened."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 3,
          "Date": "2022-11-10T13:07:54.000Z",
          "Titre": "Way too risky",
          "Contenu": "Way too riskyiTrustCapital uses coinbase as the custodian. Yikes!If coinbase bankrupts, all my crypto will be gone. If coinbase or itrustcapital loses my crypto (via hack, breach, third party bankruptcy, theft, etc..), [EDITED AND REMOVED LINES HERE 9/20/2022 on risk and loss as iTrustCapital is requesting Trustpilot to delete this post.]iTrustCapital does not offer an insurance option to protect against loss of customer crypto. Either by coinbase's mistake, iTrustCapital's mistake, or third parties. If they lose it, It's just gone and thats that.iTrustCapitals Terms of Service is dodgy at best. Their faq's are crafted to impress on the customer a safe investment experience, when that couldn't be further from the truth.Only cash held at iTrustCapital is FDIC insured. If any loss of customers crypto happens, TOS says iTrustCapital may only be liable for damages up to $100. I was keeping more than $100 on their platform.I left because of the above risk. Thats way way too much risk for me to keep any crypto on their platform.This platform is 'Not your keys, not your crypto.' which is never ok unless there is a third party insurance option protecting against complete loss by all and any parties.I did notice a few other red flags:1. Their spread is huge on top of high transactional fees.2. Their platform is bare bones basic and it doesn't look like they've made any considerable investment into it, giving me the impression its a fly by night operation.3. Selling on their platform was suspiciously unavailable at critical times during the last crash (but that was probably coinbase's doing)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Baneful",
          "Nb_Reviews": 7,
          "Date": "2023-04-14T02:24:21.000Z",
          "Titre": "Worst customer service I’ve had in my…",
          "Contenu": "Worst customer service I’ve had in my life.  I don’t normally write reviews but people should be warned.Once they have your money they don’t respond to emails for support and if you try to call you get a queue.  Once you make it to the top of the queue an automated voice says they aren’t taking calls and it hangs up on you. I have no problem with a queue, the fact the system hangs up on you stating \"we are not taking calls at this time\" is a problem after waiting in a queue for 30 minutes. It keeps stating my credentials are wrong but they are not as I've been using saved credentials (username/password). I try to reset password and they are supposed to send an email.  The email doesn't come and I've tried a dozen times with different devices.I’ve had at least 10 issues with my account since inception a year ago.  Most have to do with inability to log into account through any format (app, phone, computer, safari or chrome). On days the market is eventful are the days you cannot get into your trading account and screwed you out of thousands of dollars.  I've been unable to log in since Monday with NO RESPONSE but they respond here immediately! What a jokeThey’ve also been hacked once and customers have lost access to their account for over a week When I eventually get into my account I plan on moving my money to a reputable IRA and not a scam like this one"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T05:10:05.000Z",
          "Titre": "More delays in distributions!",
          "Contenu": "IT seems iTrust Capital has a hard time processing distributions.  This is the 3rd time I have had a distribution.  The first time took 3-4 weeks.  The second time with Jared Feldman hand holding the process, has completed in about 2 weeks.  Now again with this distribution it has already been 20 days for a simple cash distribution.  Their documentation on the support website states 7-10 days from when the documentation is signed.  That was 16 days ago and it has been 10 days since I had a verification call.  I was told it would only take 3-5 days.  The company is very good about doing everything they can to get your money, but has very poor customer service when you try to get it back.Update:  As the distribution was only completed today after this review and several emails, I find it odd iTrust Capital feel the a request made on 12 days after the verification call and 19 days after the request meets the 7-10 days statements on the support page.  The only time iTrust met this time period was while Jared was hand holding my send distribution. Read through the 1 and 2 start review.  This is a common theme for trying to reach support for a distribution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig R",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T22:23:34.000Z",
          "Titre": "We had such high hopes when we started…",
          "Contenu": "We had such high hopes when we started investing with this company initially. Unfortunately, our experience was highly disappointing; we are closing our account with them immediately. We found the #iTrustCapital company very unprofessional, unethical, and dishonest. I rarely give negative reviews, but if I could give them negative stars, I would. #IRA #Crypto #Investors, Beware!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Google user K",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T23:30:18.000Z",
          "Titre": "My husband left so many voicemails and…",
          "Contenu": "My husband left so many voicemails and nobody calling back, he sent an email and they responded by demanding so many things, and now, when we are ready, they stop responding! You can give them money, but they will not return it! It is a scam! I want my money back!!!! Respond to is! Give our money back! We lost 24 k with them and now we can not get rest of the money! Stay away ! Run!!! Don’t invest with them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tammy Pascoe",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T16:26:17.000Z",
          "Titre": "Itrustcapital is good.",
          "Contenu": "When I signed up on the app. My bank was not listed at first. I found my $1000 and it was an error on my banks side. I will invest with Itrustcapital again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T13:55:10.000Z",
          "Titre": "slow to answer questions",
          "Contenu": "you guys take so long to get back with answers to questionsno phone servicestill no referral bonus"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Nicholas Despo",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T18:46:14.000Z",
          "Titre": "You need to offer staking for Ethereum",
          "Contenu": "You need to offer staking for Ethereum. Ethereum is the preeminent crypto currency and holders like myself in a retirement account would benefit tremendously from staking their holdings and letting it compound over time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bulldog",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T06:05:30.000Z",
          "Titre": "Conditional Transaction feature is a HOAX!",
          "Contenu": "I watched 2 ITrustcapital “How-to” videos on the new conditional transaction Buy/Sell feature.Nowhere is it said that any conditional transaction submitted is at risk of filling outside of the conditional buy/sell order price and to use at your own risk.I made 2 separate conditional buys, each for $100k a piece.  The first was for $17,500 or lower.  It filled at, $17,577.  The second was for $17,000 or lower.  It filled at, $17,337.In both instances the Conditional transactions failed to fill their respective Conditional Price or lower. Why use it if it doesn’t work as explained in their videos?I was subsequently told by Trent, that the Conditional Transaction feature is not the same as a limit order.Then say so on your 2 videos explaining the Conditional Trade feature to your users!  I mean, am I wrong?ITrustCapital puts itself first by being intentionally deceptive.  They are only interested in attracting your business and charging you a hefty commission.As a customer my expectations are reasonable: TransparencyTrustHonesty & Integrity.ITrustCapital failed on my Conditional Buy Orders and then failed to make me whole.Not the kind of experience a customer expects.  Particularly with the current FTX insolvency debacle where customer trust has never been more important. Trent didn’t even have the stones/courtesy to return my call, but instead sent me an email response stating they address the Conditional Trade features inability to do as they claim/advertise (see both of their videos) in the FAQ.Deceptive and untrustworthy.ITrustcapital‘s behavior is exemplary of what will cause excessive government intrusion/oversight/regulation to the crypto ecosystem - limiting the benefit of decentralization.Makes you wonder, what else is bogus with ITrustcapital?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dean",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T20:09:33.000Z",
          "Titre": "Been waiting for ACH transfer to bank…",
          "Contenu": "Been waiting for ACH transfer to bank for two weeks now. Phones are not picked up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerald Brister",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T19:12:00.000Z",
          "Titre": "I requested a distribution on 6-29-22…",
          "Contenu": "I requested a distribution on 6-29-22 for the 3rd time.  They kept requesting the same information over and over and when I called I always got a different person with a promise to call or email me which never happened.  As of today I have not received my distribution.This is completely unacceptable especially now that no one answers the phone and you can't log in.Nothing adds up and there is no transparency or honesty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Carr",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T15:16:40.000Z",
          "Titre": "If I could give it Zero Stars I would.",
          "Contenu": "If I could give it Zero Stars I would.Started a distribution process 19July and still have not received it.Message every day but have not had one message returned or responded to. Unable to contact anyone on phone or schedule a phone conversation.Avoid this Company at all cost."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vic",
          "Nb_Reviews": 2,
          "Date": "2022-06-03T19:20:32.000Z",
          "Titre": "They lost my checks and when I emailed…",
          "Contenu": "They lost my checks and when I emailed them about it, they ghosted me. It took me over a month just to get someone to respond. They only responded because I reached out to them on Twitter on three separate occasions. They responded by admitting they had poor customer service and handled the situation unprofessionally. I would recommend this place to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gisela Irizarry",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T23:40:59.000Z",
          "Titre": "My account got locked out",
          "Contenu": "My account got locked out, keeps telling me update app yet every time I try update it takes me back to Apple App Store and does not update. It’s quite concerning. Also I have sent multiple emails requesting them to remove a pending transfer request on my app that has been sitting there for months,and no one calls nor replies to me.  It’s a shame."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronny",
          "Nb_Reviews": 2,
          "Date": "2022-02-12T03:21:37.000Z",
          "Titre": "Slow on support",
          "Contenu": "Im having problems getting in contact with support in a timely manner.  I set up a phone call for 5 on Friday. I got a text saying to remember phone call just before 5.  I never received a phone call from anybody.  I also keep getting emails saying I need to sign something in my documents but nothing shows up.  I was told to do this five days ago.  Please helpRonny"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew McGlothlin",
          "Nb_Reviews": 2,
          "Date": "2022-01-21T15:45:11.000Z",
          "Titre": "Wrong develpment focus",
          "Contenu": "So far, they have failed to provide basic trading options like limit orders of any kind or stop limits.  Instead they've chosen to focus their time on creating a mobile app that is not available on android.  Basic functions available to everyone on their website would have been appreciated before they went fluffing iPhone users with a weak mobile experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "my crazy pistachio",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T03:15:57.000Z",
          "Titre": "Absolutely abysmal",
          "Contenu": "Absolutely abysmal.  I honestly cannot imagine who would want to use this service for a number of reasons:  ZERO phone support (despite the fact that I requested a callback), ZERO e-mail support, and the extreme difficulty logging in from my own laptop at my own home from which I created the account make for a complete disaster.  I'm going to stick with tdameritrade.  This company is a total waste of time.  Never again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LK",
          "Nb_Reviews": 1,
          "Date": "2022-02-12T16:58:52.000Z",
          "Titre": "My account went down after placing 3…",
          "Contenu": "My account went down after placing 3 trades (buys) and now shows zero balance (100% of my funds are missing), zero assets, and the support form crashed 3 times while I was trying to report it. So far, this company is severely breaking my trust and it seems neither safe nor stable. Wildly unprofessional for a company that markets itself as the leading crypto IRA provider, and offering 24/7 trading ability. Literally thousands of dollars completely missing right now. Very upsetting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T19:36:25.000Z",
          "Titre": "Well Im trying to set up an account but…",
          "Contenu": "Well Im trying to set up an account but since I work in a sensitive arena I only have a PO Box. I also live in a rural area and my physical address is different than my mailing address( the PO box). Soooo, my utility bill doesnt show my entire physical address, I use propane, the bank statements go to the PO box and all I hear is 'we need some thing showing your physical address' . What is the point of the govt issued photo ID and since everything will be going by email what's the problem with the PObox????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Largent",
          "Nb_Reviews": 2,
          "Date": "2022-04-22T15:41:52.000Z",
          "Titre": "Still waiting...",
          "Contenu": "Still waiting for my IRA funds to transfer - it's been months. I've never seen a transfer take this long. No updates, no follow-up, poor communication. So far I'm not happy.I was wanting to transfer my wife's IRA here also but I don't think I'll be doing that now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T16:22:40.000Z",
          "Titre": "Discrimination Against Green Card Holder",
          "Contenu": "My wife, who lives with me here in the United States, tried to create an account with Itrustcapital. They refused to let her create an account; they are discriminating against her simply because she is a green card holder. They treated her horribly. She provided all required documentation, including proof of residence; but Itrustcapital refuses to even have a conversation with her, they just said \"we can't help you.\" We're married, she lives here with me in the United States, she has a green card, and she HAS A UNITED STATES SOCIAL SECURITY NUMBER."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Damon Burmeister",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T22:20:33.000Z",
          "Titre": "Don't execute MARKET orders unless you are want to get robbed.",
          "Contenu": "I just executed a market buy for BTC and the execution price was $120 over the limit order buy price. What a scam. BTC price never got even close to my execution price."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Becky Mulkerrin",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T20:51:00.000Z",
          "Titre": "Update. An iTrust representative did reach out because of the outage. It lasted one day and I have since placed additional trades with ease.",
          "Contenu": "Set up was easy. Then came time to place trades...Internal server errors, trades don't get executed, and I can't get any response because of course you can only message or schedule a call, and by the way, calls for November are booked.. so I guess I wait and hope that they honor the trades I put to them...Finger crossed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DoIt Right",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T00:17:21.000Z",
          "Titre": "My Account balance went to Zero",
          "Contenu": "Today when I got in my account, the balance showed zero for a long time and that really freaked me out. After a long while my correct balance appeared.  Also something that was very strange was the word \"None\" was added to my account name.  I don't know what this is about.  This makes me feel insecure about putting my assets with ItrustCapital.  Also you can't just pick up the phone to talk to people when things like that happen.  You still got to send an email to customer service and hoping that someone will respond to you in a timely manner. This really sucks!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rodney Taylor",
          "Nb_Reviews": 3,
          "Date": "2022-01-14T01:30:11.000Z",
          "Titre": "The worst customer service …",
          "Contenu": "The worst customer service I have ever tried to deal with.Tried to transfer Roth and 401 k snd after 2 weeks nothing. Nothing from itrust to help the transfer not even an email to assist in any way. Cancelled account an then Itrust attempted to contact me. Stay away from this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ravi C",
          "Nb_Reviews": 4,
          "Date": "2022-05-23T18:16:17.000Z",
          "Titre": "Extremely bad customer service and…",
          "Contenu": "Extremely bad customer service and platform and HUGE GIANT transaction fees, I lost lot of my money in their fees. NEVER fix technical issues on time.Only invest if you WANT to LOSE your MONEY like I have in these fraudsters"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Damien Alexander",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T09:00:42.000Z",
          "Titre": "Doesn't offer hardly any help when to…",
          "Contenu": "Doesn't offer hardly any help when to comes to figuring out the tax side, doesn't offer real trading options (only market purchases), doesn't offer a real trading platform like advertised, 1% adds up too quick for short term trading."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "armstrongr",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T13:59:02.000Z",
          "Titre": "This company has no idea how to onboard…",
          "Contenu": "This company has no idea how to onboard customers. Requires extremely manual steps and provides no guidance or support - you have to become a Project Manager and spend significant periods of time on this. And don't expect to get any questions answered from iTrust when you encounter issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miles off course",
          "Nb_Reviews": 4,
          "Date": "2021-02-08T18:50:32.000Z",
          "Titre": "Seriously must I give a whole Star oh…",
          "Contenu": "Seriously must I give a whole Star oh well here goes. This company moves at a speed that makes glaciers appear fast and that was before Global Warming. Start your account a month before you want one. They should say we are low cost because :We are very slow and you will do most of the heavy lifting. I would like to see them list their average times in (weeks) it takes to get accounts funded."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wendy Odell",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T16:50:33.000Z",
          "Titre": "Wired funds to fund our account and it…",
          "Contenu": "Wired funds to fund our account and it has been 5 days and still no funds!  Called after the 3 day and they assured me the funds would post to my account by the end of the day.   Emailing their support is completely useless, never a response.  Phone support is essentially the run-around. After numerous calls to support and asking for a manager, the story changed to it's in the \"conversion stage\" and will take another 7-10 business days before account is funded.  What Planet are these people on?!!! This sounds like a centralized bank. Very disappointed that I trusted this company. Should have used a way more reputable company that deals in crypto."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra K",
          "Nb_Reviews": 1,
          "Date": "2022-01-26T21:07:57.000Z",
          "Titre": "EXTREMELY POOR AND NONEXISTENT CUSTOMER SERVICE",
          "Contenu": "It appears that this is the only platform where iTrustCapital is responding. What is going on with ZERO follow-up month after month after month with my pending funds?? I have emailed and emailed with zero follow-up. There is no longer ANY phone number to contact and investors need to know that iTRUST is #NOTRUST at this point. This needs to be resolved ASAP. I have been patient for months but this I promise you WILL blow this out of the water so all other investors are aware. I need follow up with my account asap - transparency, mitigation and follow through. Are you a brand that aligns with these practices???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Bennis",
          "Nb_Reviews": 2,
          "Date": "2021-01-08T04:45:41.000Z",
          "Titre": "Never Again",
          "Contenu": "So, here I sit, unemployed and stuck in a foreign country with very little cash. I tried to make a withdrawal from my account but it became such a pain that I decided to close my account . . . a month ago. Closing the account has become just as big a pain as trying to take a disbursement. I understand that there was a paperwork glitch (my fault) but this has been going on for weeks. Real quick to take your money, not so quick to let it go."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph P Parisi",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T21:10:51.000Z",
          "Titre": "I have not been able to log into my…",
          "Contenu": "I have not been able to log into my account for over a week and no one at ITrustCapital seems to think it’s a priority to resolve no matter how many times I call them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hugh James Lenahan III",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T14:14:47.000Z",
          "Titre": "The site is crashed",
          "Contenu": "The site is crashed, the app is crashed and your boiler plate tweets are hollow. With Celsius Voyager and the others collapsing the lack of transparency is unacceptable"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Parr",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T15:45:44.000Z",
          "Titre": "This company is NOT regulated!",
          "Contenu": "Used them for years and then I got a letter saying I had to liquidate all my crypto by December 17th 2021 because I lived in NY!  I did some research and found out that they are not regulated and that's why they can't sell to NYers.  When I set up an appointment and I asked WHY they couldn't keep my account (mind you, I already knew), all I got was \"IRAs are complicated\" and \"I don't know\".All those years of paying a monthly fee and getting nothing for it and now they want me to sell my XRP in order to keep my account...Move on, there are other companies that ARE regulated, do your own research."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lane",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T16:12:40.000Z",
          "Titre": "response time",
          "Contenu": "The customer service response time is slow. It is over 1 week to schedule a 5 min call.I put in a request to transfer funds into my account and was contacted by an agent who process the request same day.  Within about 6 hours from request."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Investor",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T21:40:49.000Z",
          "Titre": "Struggling to get customer support",
          "Contenu": "It is interesting seeing iTrustCapital responding to reviews earlier today when they still have not responded to customer's emails from last week. Perhaps this is the best way to get the attention of their customer service team?"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Prashant Kediyal",
          "Nb_Reviews": 1,
          "Date": "2021-04-20T13:47:24.000Z",
          "Titre": "Can't trust crypto if they lost 4 FedEx pkgs",
          "Contenu": "My first funding operation went well but that was when I opened my account. Subsequent funding attempts of my account failed 4 times before I wondered whether I can trust them to keep my crypto safe when they keep losing the transfer of funds application via FedEx !!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Craig Opala",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T20:06:09.000Z",
          "Titre": "Worst Company I’ve done business with.",
          "Contenu": "Worst Company I’ve done business with.. to many issues to list. They don’t want to fix anything, they just want to blame everybody else for there Inexperience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harry Hofman",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T23:52:16.000Z",
          "Titre": "I LOVE the idea of buying crypto…",
          "Contenu": "I LOVE the idea of buying crypto through an IRA, so after I saw the commercial, I jumped at starting one.  Right out of the box, a critical form automatically filled in the wrong phone number.  There were only two choices, Docu-sign it to accept it, or reject it.  The only obvious way to communicate with them was to make an appointment a week later.Errors in documents that are not easily corrected and bad communication methods made this a terrible customer experience for me.I only stated the facts of the situation.  I said nothing personal about the rep.  He took it personally and was NOT polite to me.  You recorded the call.  Replay it and see WHO WAS RUDE TO WHOM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris M Vinci",
          "Nb_Reviews": 1,
          "Date": "2022-01-12T21:25:05.000Z",
          "Titre": "Frustrating long process for Roth conversion",
          "Contenu": "For anyone reading this rating please note it is poor simply because of the frustratingly slow process itrustcapital has for doing a Roth backdoor conversion. They received my money to my traditional IRA 10 days ago and it took that long for the conversion to post to my Roth account. As you can imagine in crypto the volatility of pricing has caused me to be frustrated. In my situation I missed out on $1,200 of earnings at the time I posted my purchase. Anyone who is looking to do a similar backdoor conversion from their traditional IRA to a Roth IRA within itrustcapital must be prepared for at minimum a 10-day process. And as usual communication with Itrustcapital was also frustrating and very slow."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca O'Dell",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T15:11:56.000Z",
          "Titre": "You guys need to work on your processes",
          "Contenu": "I've been trying for 3 months to shut down my account. Now, as of Jun 26, the money was moved out of my account. My account balance is $0. But there is no signs of where that money went. Was supposed to go to my Fidelity account, but it did not.  Where is my money????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Shi Song",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T04:09:24.000Z",
          "Titre": "Absolutely trash company",
          "Contenu": "Absolutely trash company, not only charge 1% fee on your crypto purchases, but also sell you more expensive than the actual market price, so you will realize a drop immediately after you purchase it. Trash."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randall Hornick",
          "Nb_Reviews": 2,
          "Date": "2022-01-13T19:43:36.000Z",
          "Titre": "Appalling.....",
          "Contenu": "After one year of an account with iTrust, I was told by the company that I had to close the account as New York was no longer a jurisdiction they could operate in - fair enough as things change.  However, almost two months later iTrust continues to delay the disbursement of my funds to Fidelity not-withstanding that all paperwork and forms have been completed.  Fidelity informs me that the company repeatedly promises to get it done but \"continues to stonewall\".  I did a similar transfer from another financial institution and it took 3 days.  Unless reolved within 48 hours, I will be opening a complaint with the SEC and the BBB.  Wondering if any other customer has actually received funds back from iTrust?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Avinesh Rougen",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T20:45:58.000Z",
          "Titre": "Extremely poor service",
          "Contenu": "Complete lack of customer service. Denial of service without any explanation or reasoning. All information was submitted correctly. Bad company. Will take my business elsewhere!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Elizabeth Lo",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T03:19:45.000Z",
          "Titre": "If I could leave zero stars I would",
          "Contenu": "If I could leave zero stars I wouldIn May I found out my positions were traded back in March and I hadn’t logged on since last year. When I reported it to them, they said there’s nothing they could do but I should be happy my cryptocurrency was sold because it had gone down and no funds were taken out of my account. Rich some high up guy said he’d look into what happened and get back to me and I never heard back. I spent many hrs trying to get things resolved and gave up. Yesterday I tried to login again and was blocked, apparently some suspicious activity. I haven’t been able to get in touch with anyone to help, either by phone, email or live chat.Apparently the CTO Blake and Rich both quit the company. I filed a report with SEC and I want to get my money out if I can get a hold of someone!!! And if there’s anything left in there!!!Update: What are the misconceptions? Everything I stated is 100 percent accurate. And I have proof. Gaslighting!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Weston James Dowis",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T20:57:45.000Z",
          "Titre": "The interface is pathetic",
          "Contenu": "The interface is pathetic. You can only utilize market orders there is no charts, it was developed by a 12 year old software engineer. These guys don't know what the hell they are doing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carrie Bouffard",
          "Nb_Reviews": 3,
          "Date": "2021-06-12T00:39:10.000Z",
          "Titre": "Being charged for what",
          "Contenu": "First, the $25 charge every month is for what?? I waited a month for my $7,700 to be transferred. I’m not impressed with losing money as soon as I transfer it. So I’m being charged to lose money? I’m not with this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lance Kirchner",
          "Nb_Reviews": 3,
          "Date": "2022-06-02T01:41:55.000Z",
          "Titre": "Not trustworthy of your retirement!",
          "Contenu": "Terrible customer service at best.  Perhaps even a scam company I opened a Roth IRA with them without too many issues last year but when I needed to rollover my 401k due to job change and it’s been a disaster.I was given the wrong address for my rollover amount and it’s been in limbo for 3 weeks from vanguard.  I have contacted Itrust 8x (5 by phone, 3 through email) and today I finally got a straight answer. They said Vanguard has to put a stop order on my check and mail to a different address! They can’t get mail at the address they told me to mail it to(and confirmed many times).  I’ve confirmed that address in every conversation with them and now all of a sudden it’s the wrong address? Huge red flag.  Not the kind of place that instills trust especially with hundreds of thousands or millions of dollars.  I would try a different company if I was just opening an account if I was you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Kravitz",
          "Nb_Reviews": 2,
          "Date": "2021-04-25T12:37:23.000Z",
          "Titre": "Worst customer service ever.",
          "Contenu": "Would give 0 stars if possible. Difficult  to reach by phone or email. Takes days or weeks to get a response for simplest things like address change. Feel like they are holding my crypto assets hostage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FRANK DELESANTE",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T23:53:45.000Z",
          "Titre": "I completed an application about 10…",
          "Contenu": "I completed an application about 10 days ago and received an email response that I should receive approval after review, along with additional requests for info. Not a peep! I emailed requesting current status and received an email response:  \"b\".  I have no idea what this is suppose to mean?  Below this is a disclosure that suggests I go to the online site and ask the robo advisor help question. Been there...it is a library of general question and answers. I guess it is good luck you are on your own, since you have no direct phone contact with a live person. According to them, I can request a phone call, the earliest was 23 February. No thanks. If it is this difficult to establish an account, what becomes those who have an active account problem? Thank goodness I never got to the funding part of the future email!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marco Polo",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T13:57:08.000Z",
          "Titre": "They never attempted transfer money…",
          "Contenu": "They never attempted to transfer money out of my old IRA to fund my account. Initially they sent me a transfer form with a highlighted area that needed to be filled out and sent back which I did immediately. Then I would receive emails saying I had to fill out additional areas which were not highlighted. Which was ok, let’s get it right, but they continued to do this several more times. Yes.. 4 times!! One correction in particular got deleted on their end and kicked back to me claiming I never made the correction. I’m pretty sure altering my documents are illegal.. It felt like I was the running joke in their office. See how many times this person would adjust this simple two page form. Sadly as excited as I was to use itrust, I just don’t feel their people or methods are competent enough to manage my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Farrell",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T12:58:10.000Z",
          "Titre": "A lot of growing pains.",
          "Contenu": "The user interface is simple and works great.  Trading prices and execution is fast.  Areas needing improvement.  1) Setup and transfers from an existing IRA is very very slow with very very limited communication.  \"Pending\" is too generic and leaves you feeling unsettled where you are in the setup stage. If the market is mooning you will loose money waiting! Communication and reaching a rep is terrible. 2) There is no way to see P/L or sort by price or holding.  The chart is very basic and just shows market price and your holding.  Too simple of an interface when your dealing with large investements. 3) There should be a way to pay for monthly fees within the cash holdings vs a credit card like other IRA companies do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jill Sesso",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T18:54:01.000Z",
          "Titre": "I’ve been trying to deposit money into…",
          "Contenu": "I’ve been trying to deposit money into my account and have received the worst service. I’ve called and made requests to be called and nobody calls me. Can someone please call me? 847.951.6576"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Flea",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T05:34:35.000Z",
          "Titre": "Poor Customer Service/Communication",
          "Contenu": "Slow initial setup time.  Communication is bad.  You need to make an appointment to talk to someone even for emergencies.  Lack of a messaging/chat app. is inexcusable in this day and age."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Eli Smith",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T22:05:55.000Z",
          "Titre": "I might take my cash out from here",
          "Contenu": "I might take my cash from here. Trading fees are expensive and also prices are no updated and also doesn’t say what price I bought my crypto."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lindsay S",
          "Nb_Reviews": 2,
          "Date": "2021-12-16T13:02:11.000Z",
          "Titre": "customer service is terrible",
          "Contenu": "customer service is terrible. Phone number listed is only a recording. Only way to contact an Rep. is thru email. Worst customer service I've ever experienced"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Charles Mink",
          "Nb_Reviews": 1,
          "Date": "2022-01-14T01:58:57.000Z",
          "Titre": "I have been trying to fund my account…",
          "Contenu": "I have been trying to fund my account and it will not go through. I reach out for help and I don't get the right answers. Really disappointed..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason Shoaf",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T23:17:54.000Z",
          "Titre": "No phone support!",
          "Contenu": "I have been researching SDIRA custodians. I stumbled upon iTrust Capital and began learning about them. The website is pretty good. There's a lot of info which answered many questions I had. I wanted to call them to ask some additional questions. The phone number was listed on their site. When I called, there was a recording that stated there is NO PHONE SUPPORT due to their rapid growth (or something along those lines). On their website, I noticed that there is a link to schedule a call so I scheduled one for the evening. A gentleman called me on time to answer my questions. About 10-15 minutes into the call, he said \"I'll answer one more question, but then I have to jump off as I have other calls.\"So...in summary, this company has -* No live chat* No phone support* No time to talk to youI am completely uncomfortable turning over my retirement funds to them when they have no time for me. Caveat emptor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rahul B",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T18:42:08.000Z",
          "Titre": "Pathetic Service - Not Returning My Money (30 Days)  (Extremely  Disappointed)",
          "Contenu": "After accidentally contributing twice to my Roth IRA account, I requested to return my money and after numerous follow ups I am still waiting for my money to be returned. Since I requested my money back almost a month ago, I still have not received it. I am not sure how long it will take them to return it. It is an extremely slow process in such a competitive market. 'I'm extremely disappointed. I hope it will be resolved as soon as possible.Listed below are my enquiry numbers, but no progress has been made. Each time I receive the same response.  1373** - 12/22/20211425**  - 01/05/20221426**  - 01/05/20221427**  - 01/05/20221450**  - 01/10/20221480** -  01/17/20221487** - 01/19/202201/21/2022 : Latest Status : (Now 30 days)Now I'm losing patience. For my own money, I need to follow up multiple times, but there is no result. I have been waiting for money for more than 30 days, but it is still unclear when I will receive it. I will add reviews on  Credit Donkey and BBB, and then I will seek legal advice"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LA_B",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T15:31:27.000Z",
          "Titre": "Hidden fees!!!",
          "Contenu": "I'm very unsatisfied about the service. They are charging 10 times normal price in moment of big increase or big decrease in the market.Yesterday, I sold some BTC (which is the most liquid market), I got executed at around 52k when market at Binance/Coinbase was at 55,6k!It's unbelievable the amount of \"hidden\" fees that they charged in moment of volatility in the market.It should be forbidden, will report to the FCA and will ask them to check my data.-----To reply to Itrust:How can you explain that on Coinbase the Bitcoin price was at 55K while when I wanted to sell on your platform the Bitcoin price was at 52.5k. You are doing an arbitrage where officially you take your usual fees but in reality you are taking way more.You can not have more than 3% of discrepancy in price with other major platforms especially on a liquid market like Bitcoin.For the FCA, I was referring to SEC.I will send you a message later in the day.Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Francisco Villalobos",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T14:27:37.000Z",
          "Titre": "Customer service is lousy.",
          "Contenu": "Customer service is lousy.I am still waiting for the tech department to get back to me regarding an issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jane Moore",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T17:11:51.000Z",
          "Titre": "Can not speak to anyone!",
          "Contenu": "Can not speak to anyone!No statement is available for printing!This whole website and company needs to be way more customer friendly!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alfonso Martinez",
          "Nb_Reviews": 2,
          "Date": "2021-07-10T00:47:45.000Z",
          "Titre": "The coin prices are always higher than…",
          "Contenu": "The coin prices are always higher than actual market prices. Therefore plus 1% fee is very deceiving. It is more than 2%"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Theresa D Coker",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T16:54:28.000Z",
          "Titre": "The system is not uploading my transfer…",
          "Contenu": "The system is not uploading my transfer documents.  Email response has been slow to resolve this issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Sobel",
          "Nb_Reviews": 2,
          "Date": "2021-04-27T15:42:02.000Z",
          "Titre": "In the beginning iTrust was quick",
          "Contenu": "In the beginning iTrust was quick, responsive and helpful.  Since it was working well I decided to roll over a 2nd IRA into iTrust.  That was a train wreck, with iTrust's staff failing to do their job at just about every turn.  From not listening to instruction from my old 401k company (needed a wet medallion signature) to not responding to emails, everything this time around has been a disaster.  Their lack of execution cost me big $.  Their response after continually looking for answers was to waive my monthly fee for 6 months, this is after talking to 3 people.  I was told the COO was going to call me, but they even backed off of that.  You guys are managing some huge assets, you need to get your crap together and you need to own up to mistakes you've made......in response to iTrusts response, I told you from day one they needed a wet signature, you chose to ignore that and send it anyway. You stated that most places would take it anyway.  They specifically requested the wet medallion signature.  Additionally, this does not excuse the excessive gaps in your return communication to me.  I'm happy to provide Blake Skadron with all of the communications and details."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "E 'S",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T00:58:39.000Z",
          "Titre": "What a rip off $30 a month plus 1%…",
          "Contenu": "What a rip off $30 a month plus 1% fees. Wait until etf’s come out and they’ll be out of business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Walton Jones",
          "Nb_Reviews": 1,
          "Date": "2022-01-05T23:54:01.000Z",
          "Titre": "Account creation quite simple",
          "Contenu": "Account creation quite simple, transfer from a competitor way way way to slow"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 5,
          "Date": "2021-05-03T12:30:14.000Z",
          "Titre": "Customer Service is terrible",
          "Contenu": "Customer Service is almost non-existent.  In order to speak with someone, I must schedule a call and there isn't a time slot available for over a month.  I also sent an email message about a $50,000 transfer that didn't show up in my account for 7 weeks and never received a response.  I moved some of my IRA money to iTrust Capital to purchase  cryptocurrency and the reviews looked good.  These reviews were not accurate at all as this is the worst customer service I've ever encountered.Update - I did receive a phone call last night and hope to get the issues I've been experiencing resolved.Additional update 5/3/21 - After posting this review, I received another phone call from iTrustCapital.  They offered to waive their monthly fee for several months and asked that I change my negative review.  Since they didn't act on my issue of losing the original deposit of $50,000 for 7 weeks, I waited to see how that would turn out.  I sent them a lengthy message with details provided to me by Fidelity and never received a response from them - nothing - crickets.  So, I did not change my review as they asked and they did not waive the monthly charge as they said they would.  I have since transferred my money back to Fidelity and closed the iTrustCapital account.   Sure, their fees are less than others but you get what you pay for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WAGA",
          "Nb_Reviews": 1,
          "Date": "2021-12-23T01:47:32.000Z",
          "Titre": "My Deposit Was Delayed Without Sufficient Explanation",
          "Contenu": "I confirmed my deposit was delivered, and also acknowledged by iTrustCapital's bank which is Vectra bank.  This occurred on Dec 10th 2021.  Yet they did not release this deposit until Dec 17th very late in the day. Vectra Bank Acknowledge Receipt ID:  2112100834 on Dec 10th, 2021All the while they never gave me a reason for this delay, just saying they are having issues.  They would try and expedite it.I made it clear that I would report it and pursue legal actions to have my deposit released.  Could be a coincidence, but it was released shortly after that.Schwab who helped me gather the confirmation information and made it clear that there was definitely an internal delay at iTrustCapital.I finally on Dec 16th was able to get a call from Ethan all previous emails were ignored.  Ethan quickly understood that iTrustCapital needed to solve this as it was obvious I was gathering info for a formal complaint.  Ethan was very polite and courteous however did not offer why I was having this issue.  He did admit that I had a valid complaint.I get the feeling that without Ethan's help I would still would not have my funds released.*************Update*******************I received a call and was given an IT related explanation for my experience.  I accept this explanation.  This of course would not have helped the funding, but does help me to understanding what I was experiencing.  I will keep my account and make a final decision for addition deposits.  The promise of improvements and additional features will help"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason  Scarpellini",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T18:15:51.000Z",
          "Titre": "It's been 3 days and I have not…",
          "Contenu": "It's been 3 days and I have not received a response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan Mason",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T00:18:54.000Z",
          "Titre": "You banned me from my account",
          "Contenu": "You banned me from my account!  Unacceptable!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Courtney Marie",
          "Nb_Reviews": 4,
          "Date": "2020-12-17T20:18:33.000Z",
          "Titre": "Lied To Me, Didn't Fund My Account As Promised + Then Ignored Me",
          "Contenu": "Awful. After much research in the digital asset community, and based on recommendations from many, I started the process of funding my account in Oct 2020. This involved a rollover from a Roth IRA with Ellevest (managed by Folio). After submitting all the necessary paperwork on my end, I waited for my account to be funded. I waited. Then I waited some more. After 3 weeks of watching the market start the bull run, my account was still not funded. I had hoped to allocate around $2200 to XRP. I called iTrust. They blamed Folio and said they had no record of a transfer. After hours and hours on the phone with Ellevest and Folio, it was discovered that iTrust NEVER submitted the paperwork. They straight up lied to me. It doesn't stop there. I asked for proof that they submitted the transfer paperwork and do you know what they said? They don't keep fax copies longer than 14 days. Convenient right? And it still gets worse. They charge me a one month fee, even though I had a promo code for the first month free. Not only was that not applied, but they charged me for never doing their job! I lost huge potential gains, and still iTrust has never admitted their mistake. To add insult to injury, the customer experience manager, Anthony...never replied to my email asking to refund the first month fee. Nothing was done in order to make the situation right. They simply ignored me. I watch Anthony go on many programs on YouTube...he is incredibly great at marketing iTrust. Yet, he won't return an email despite his title being about the \"customer experience.\" I followed up with him and asked that my monthly fees be waived for 6 months. He replied that he would waive 3 months of fees. I am honestly blown away that a business handling part of my digital assets would be so incompetent, not take ownership of a mistake, and ignore their customers. Beware, this company is great at taking your money, but God forbid you ask them to do their job, and you will hear radio silence. STAY AWAY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "was interested...",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T22:59:41.000Z",
          "Titre": "Hard to \"trust\" after this...",
          "Contenu": "Scheduled a phone call appointment.  Waited and waited and no phone call at assigned time. I replied back to email with appointment 2x as I was waiting around.  The day after, got an email with links to questions I posed when I set up appointment and a voice message with rushed attempt to answer questions. No acknowledgement about reason why initial phone appointment was missed. No biggie if you at least acknowledge. Not acknowledging the missed appointment even superficially and that I was (wasting my time) waiting around for nothing was definitely off for me customer-service wise. I replied back to email to ask if I could speak to someone else. Got this reply: \"You can schedule a call anytime on our website but please only do so if necessary, we are short on time slots.\" I understand y'alls busy ITrust, we all are. Sounds like you'd rather not have me call?From my vantage point, the initial missed phone call, with no notice, follow-up or acknowledgement ended up getting worse.  I'm a fairly chill and not one for writing up these reviews.  Hope you had a better experience with getting your money right with this group and building that sense of trust. Hope your customer service was more on point and communication wasn't this hasty and off-putting sequence I got the last 24 hours.  I am putting my app on hold after this.[IN RESPONSE TO ITRUST BELOW]I did not receive a phone call the evening of the scheduled call. I was there waiting for the phone call, emailed the rep 2x (with no response) indicating I was waiting.  I did receive a voice mail and email the next day as I noted above.  I can understand things get busy and given the current state of matters, things can fall through the cracks sometimes.  I'm sure you have great service as evidenced by your previous reviews. I am noting the truth of my experience: missed appointment, no acknowledgement of said missed appointment, voicemail next day, email with links, questionable response: \"You can schedule a call anytime on our website but please only do so if necessary, we are short on time slots.\"My scheduled call was from 4:50pm to 5:00pm. I was on my phone waiting for the call before 4:50pm and stay until 5:10pm waiting for scheduled call.  I emailed employee 2x during this time indicating I was waiting for the call."
        },
        {
          "Note": 1,
          "Lieu": "GD",
          "Pseudo": "Jeff Rose",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T16:45:48.000Z",
          "Titre": "Fees too HIGH"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Calkins",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T18:21:14.000Z",
          "Titre": "This is in regards to ItrustCapital",
          "Contenu": "This is in regards to ItrustCapital. The 6% spread I was mentioning for XRP is 100% accurate. I put in a buy at .795 and it executed at .835. The is a 5% increase on top of the 1% you are charged. Equals 6% and then when you sell it will be the same. That is a 12% hit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Don Richard Spry II",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T23:14:46.000Z",
          "Titre": "Below average.",
          "Contenu": "The communication with iTrust overall was not good. Jared Feldman was an employee who stepped up and helped assure the final outcome of my transaction. I found it difficult to have iTrust personnel to contact me in a timely manner and were unhelpful responding to my numerous email requests - simply disregarding them. It was not iTrusts fault I lost money in my investments and I risked that money on crypto opportunities slid into a bear market route.  It is what  it is.  They may be the only choice for crypto investments within the 401k space."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Colburn",
          "Nb_Reviews": 3,
          "Date": "2023-02-28T16:07:00.000Z",
          "Titre": "Their support is terrible.  I have an…",
          "Contenu": "Their support is terrible I have an account with iTrust Capital. I made a $500 conditional trade on 2/19 which I cancelled the same day. The $500 is listed as pending since that date and I can’t get a response fro iTrust as to why it’s pending . They have disabled their phone support.iTrust took the $500 (reference # 175280) out of my account on 2/23. It's still listed as pending. The only email I've received is that my conditional order was cancelled because of insufficient funds. When I call the support # I get put into a system that asks if I've filed a ticket, which I did, and got the above response, that my conditional order was cancelled. I want the funds that have been withdrawn form my bank account changed from pending to available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wee Ling Tay",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T21:26:28.000Z",
          "Titre": "I don’t know my losses unless doing my…",
          "Contenu": "I don’t know my losses unless doing my own calculation for each crypto unlike Coinbase that show losses on each crypto.  Staking is only limited to Polkadot and slow in adding more.  Rate is low compare some other exchange like Uphold.Do not have crypto like HBAR, QUANT, XDC to name a few."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T01:41:20.000Z",
          "Titre": "They price gauge you",
          "Contenu": "Email they did not respond to: \"This is frustrating because every time I do a conditional order, you guys mark it up so much. I even refreshed and watched as the order filled. The market price wasn’t even close to $24,023! It was below 24k (I could see maybe $24,005). You guys need to look into this. I can only imagine what happens when I go to sell.\"Fast forward to when I decided I am going to stop using this service and sold BTC (I wish I could post a video): When I go to sell, they decrease the price by a SIGNIFICANT amount!! I have a video of me switching from buy to sell and vice versa as if I was going to put an order in. You clearly see when it's a buy, the price is higher. Then I select sell and they shave off hundreds of dollars.I get that they need to make money, but that is what the 1% fee is for (buying AND selling). It is such a shame bc I really wanted a way to buy BTC in a Roth IRA"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eugene",
          "Nb_Reviews": 4,
          "Date": "2022-10-15T19:40:47.000Z",
          "Titre": "Lack of Communication",
          "Contenu": "You had some type of hack several weeks back and I could not get into my account for about 4 to 5 days.  Your lack of communication was terrible to say the least."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "amanpreet singh",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T23:13:59.000Z",
          "Titre": "The interface is so old",
          "Contenu": "The interface is so old. It is not user friendly. In assets there only the button to Sell, not to buy.The look and feel of the site is incomplete and looks more like scam site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T01:37:16.000Z",
          "Titre": "LOst ability to access/see/trade, buy or sell assests",
          "Contenu": "This will be the 2nd time that I have lost ability to access my account/see/trade, buy or sell my assets on the iTrustcapital.com site. Today (10/13/22) from 0600-1500 eastern time. I could get in to the site but it showed an asset value of 0.00. So it looked like my account had been cleaned out.  BTC was not viable at all!! The buy/sell buttons were there for the assets but they would not work. This all happened while BTC dipped back around 18k and I wanted DCA in but was unable to. I am on the east coast so I had to wait until 0800 PST, which equates to abut 5 hours, before I could reach out to customer service/tech support.  Very scary and very disappointing. Crypto is a 24/7-365 day a year thing. I wish that these businesses would recognize that they can't keep bankers hours when in business with crypto. We really need support 24/7. Still have not gotten a response from the company explaining what/why and how this was possible. Was I the only one?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bradley R Thibodeau",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T19:18:11.000Z",
          "Titre": "I requested Phone number be changed for…",
          "Contenu": "I requested Phone number be changed for verivacation.  You did not change it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 3,
          "Date": "2022-12-20T13:50:34.000Z",
          "Titre": "Conditional (limit) orders are not…",
          "Contenu": "Conditional (limit) orders are not guaranteed. I requested a limit order and my purchase was higher than the limit I set.  They probably don’t keep any crypto themselves anyway just like FTX or any other fraud company.  I’m creating a taxable event and moving to cold storage so I don’t lose everything with this SBF style company.FOLLOW UP 12/5/22So I have attempted to get a crypto withdrawal and iTrust has claimed my form was completed wrong after taking almost a week to review it and disabled my login credentials so I cannot even “correct” it.  It is starting to feel like my “account balance” shown by iTrust may not be reality.  I hope they actually hold of mine what they claim to hold and this is not another Ponzi scheme.  Only time with tell.  I wonder if I own any crypto purchased through iTrust.UPDATE 12/7/22I was sent an email late 12/5/22 saying there was a problem with the system and to log in and redo my distribution form, so I did.  As of 12/7/22, I have not received any acknowledgment that my form was viewed, accepted, or rejected.  I guess I am just waiting on someone to say something.  But I’m expecting another “discrepancy” or other reason they won’t be able to process my withdrawal.UPDATE 12/14/22So I finally had my verification call on 12/12 and completed it but still no distribution.  So now, I am three weeks in and nothing but hope.  If it does end up being legitimate, I a) hope they aren’t stealing from other account holders to distribute to me as occurs under normal ponzi circumstances, and b) think that 3-4 weeks to take distribution for a crypto asset that takes 30-60 minutes to transfer is RIDICULOUS.  STAY AWAY FROM THEM!  NOT YOUR KEYS, NOT YOUR COINS!UPDATE 12/17/22Still nothing but I am told that it happens within 7-14 business days of when I signed my pdf, which was 12/5/22.  So that would be between 12/14 and 12/26.  We will see.UPDATE 12/20/22Still nothing.  It is amazing that it is taking so long.  Absolutely ridiculously.UPDATE 12/20/22 (later in the day)I received my Bitcoin transfer.  I’m glad that it happened and I got out.  Also glad that while the process was painful, I got the end result I wanted.  Changing my review to 2 stars because at least I got my crypto out."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GrownManStarWarsNerd",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T09:19:27.000Z",
          "Titre": "Deceptive Pricing & Misleading Order Types",
          "Contenu": "iTrustCapital has deceptive pricing policies and, IMO, seems to take advantage of people who don't know the difference between conditional and limit orders. First, iTrustCapital states that they charge 1% per transaction. Yes, they charge 1% per transaction and that is true! What they DO NOT tell you is that it is a 1% transaction on top of padding the spot price. I'll use BTC for this entire post, but the same goes for any of iTrustCapital's digital assets. For BTC this pad is usually around $25~50 and varies for other digital assets. This is easy to see if you compare the iTrustCapital price of BTC with the spot price of BTC. Google it. So, iTrustCapital are pocketing the spread from their pricing versus spot pricing. Why not just say that in the pricing page? It's disingenuous at best and certainly not clearly stated. From their fee structure page: What are iTrustCapital’s fees? Monthly account cost: $0Cryptocurrency Trades: 1%Physical Gold: $50 over spot per ouncePhysical Silver: $2.50 over spot per ounceNote that for gold and silver they do tell you they pad the spot price, but make no mention of it for cryptocurrency. Additionally, I believe that iTrustCapital aims to take advantage of people who don't know how different kinds of orders work. iTrustCapital has two kinds of orders: market and conditional. Everyone knows what a market order is, but generally people think conditionals are limit orders. They are not. A limit order fills at a price that you pre-determine. If you put a limit buy order for BTC to fill at $20,101.01 and BTC moves to that price, you will buy BTC at $20,101.01, not a cent more or less. A conditional on the other hand is sent as a market order when pricing meets the conditions you set. If you put in a conditional order to buy BTC at $20,101.01, when BTC gets to that price your order will get sent out as a market order. Meaning, you will end up paying something different than your conditional buy price. It can be vastly different in volatile markets. For example, BTC could be at $21,000 and wick down to your conditional price. Your order will be sent out as a market order. If BTC instantly wicks back up, you might end up buying BTC for a substantially higher amount. In another example, say you have set a conditional sell order to be a stop loss in the event of a black swan event. When BTC gets down to your backstop, your order will be sent out. In the meantime, BTC could wick down and you could be filled at hundreds or thousands less than you had intended. I have explained this many times to many people who believe that conditional orders are limit orders. No investor in their right mind would ever use a market order. In this day and age of corporate malfeasance, and bad actors such as the people involved with FTX, companies who care will do a lot more to make people trust them. It's an easy fix for iTrustCapital. 1) Clearly state in their fee structure that they pad the spot price of cryptocurrencies. 2) Clearly explain that iTrustCapital DOES NOT USE limit orders and that conditionals are very different. 3) Give their customers limit orders."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Dewey",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T17:55:22.000Z",
          "Titre": "Several Day Outage Without an Update",
          "Contenu": "Everything started out good but how can their service be down for several days without them providing any email update? They repeatedly send out several emails promoting this or that but when their service is down they don't let me know what's going on. Completely unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy Knode",
          "Nb_Reviews": 4,
          "Date": "2022-05-19T19:09:59.000Z",
          "Titre": "Question - how to get service regarding pending funds?",
          "Contenu": "I've been reading the reviews about the great service at iTrust, and I'm wondering how I go about getting service at all. iTrust apparently cashed a check on April 22nd that was sent to them by my previous account holder, but the funds have been pending for all of that time. I wrote an email two days ago, but I've heard nothing back except a standard reply message. Do I need to schedule a call? Does that work better?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Hicks",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T17:22:03.000Z",
          "Titre": "Slow and Limited",
          "Contenu": "Slow and LimitedIt took nearly a month to get funds into my account. Support is overloaded and I kept getting “we’re busy but we’ll get to it”…Once my funds were in my account I promptly discovered I cannot do anything but manual buy/sell. No limit orders, no staking, no charts. The interface is very spartan. I’d like to see a few more features and more investment flexibility if I’m going to pay 1% in transaction fees (3-10X what I pay for non IRA exchanges with all exchange features)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "New Customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T20:49:26.000Z",
          "Titre": "Not off to a great start",
          "Contenu": "Not off to a great start. Takes too long to get account funded.  Platform only accepts market orders, not limit orders.  If I had known that when signing up, I would have chosen someone else.What drew me to the platform was no maintenance fees, only transaction fees.  That is a positive.  Whether or not it is enough to keep me with iTrustCapital remains to be seen."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Reed O'Connell",
          "Nb_Reviews": 1,
          "Date": "2022-01-11T18:47:02.000Z",
          "Titre": "I sent itrust a deposit for an already…",
          "Contenu": "I sent itrust a deposit for an already existing account. My bank shows the ck deposited yet ITrust has not added it to my account. I opened a support ticket and have not received meaningful support. In fact, ITrust sent me a request to rate their support as if the matter was resolved which I found bizarre. Scheduling a phone call puts me out almost a week for contact. Frustrated would be an understatement. I'd give Itrust an A+ for concept and a F for execution of cust. deposit processing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shelton Rose",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T23:37:51.000Z",
          "Titre": "Web interface is limited and fails regularly.",
          "Contenu": "It was really easy to get my money into the system and support was very helpful in getting that process completed.  However now that I have my money in the system and invested the web interface continually times out when I try to buy or sell.  This site will fail completely at the worst possible time, when the market corrects and lots of people try to sell at the same time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Baneful",
          "Nb_Reviews": 7,
          "Date": "2022-08-01T20:44:26.000Z",
          "Titre": "Untrustworthy and possibly default",
          "Contenu": "Untrustworthy and unreliable.  I would go elsewhere!!  The initial transfer I had issues where they didn’t give me the right address for a couple hundred thousand rollover.  After a half dozen calls in a month someone escalated it finally and confirmed they gave me the wrong address to send the money! I had a check for that amount floating around!! I have them a second chance and their trading had failed numerous times and other times executed the trade multiple times after getting prompted it “failed”.  Now we haven’t been able to log in for 5 days, can’t trade, can’t see our accounts, nothing.  Customer service phones have been turned off so 0 contact.Is my money there or have we been robbed?!?  It’s allegedly FDIC insured so at least I kept the amount below that so I should get it back."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MW",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T04:04:08.000Z",
          "Titre": "YOU NEED TO ADD MORE TOKENS/COINS.",
          "Contenu": "YOU NEED TO ADD MORE TOKENS/COINS.THE PLATFORM SHOULD ALLOW CUSTOMERS TO PLACE LIMIT ORDERS!YOUR COMPANY NEEDS TO HAVE A PHONE NUMBER, THAT IS MANNED  24-7 FOR CUSTOMERS WHO WILL INCUR PROBLEMS. DIGITAL COINS/TOKENS ARE TRADED 24-7-365."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jchacon",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T17:52:21.000Z",
          "Titre": "Communication with iTrust is lacking",
          "Contenu": "Communication with iTrust is lacking. They need to provide more clarity on requirements for rollovers, ex. your funds need to be in cash in order to rollover and the customer is responsible for doing this. They don't have customer service to speak with regarding questions on rollovers, communication is via email which takes too long. It's taken over a month and my rollover isn't complete. It could've been figured out in a day with a 5 minute phone call. If I knew my experience was going to be like this, I would not have given them my business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Not a fan",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T01:04:27.000Z",
          "Titre": "Not a workable dashboard",
          "Contenu": "Not a workable dashboard.  Not able to track the profit/loss on assets owned and purchased. How is this possible that this system can't provide the most basic information.  Not able to place limit or stop loss orders, and iTrustCapital adds $100 to the market price of all purchases, and costs an extra $100 when selling.  Plus a 1% transaction fees.  Not great if you intend on attempting to trade.  Plus monthly maintenance fees.  Looking for other options."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T14:46:40.000Z",
          "Titre": "The pricing on your portal is not good…",
          "Contenu": "The pricing on your portal is not good for investors: the buy price is always much higher than the pricing on other platforms at the same time, and the selling price is always much lower than the pricing on other platforms. The difference is much more than 1%. Can you improve your real-time pricing to be more competitive?Also, can you add \"Limit Order\" functionality? Thank you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shane Hunt",
          "Nb_Reviews": 2,
          "Date": "2021-05-16T00:27:07.000Z",
          "Titre": "look somewhere else, crashes during high volume.",
          "Contenu": "Unless you want to just buy and hold during a low volume day, look somewhere else. This platform crashes everytime there's high volume. You won't be able to get in your trade when you need to the most. I'm moving to another platform. I initially wrote a good review, but I was wrong. After more time, this platform is horrible. They don't have the ability to support the current users, period. Support is good so I'm giving it a generous 2 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Stump",
          "Nb_Reviews": 1,
          "Date": "2021-06-17T01:32:45.000Z",
          "Titre": "To talk to a live person you have to…",
          "Contenu": "To talk to a live person you have to make an appointment at least three days in advance. And then you only get five minutes. There are no instant transfers through my bank account. You have to do a money wire. There is no insurance against hacking. The fees are lower than some other companies, but still high in my opinion."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mario Cruz",
          "Nb_Reviews": 1,
          "Date": "2021-04-02T16:08:25.000Z",
          "Titre": "While I appreciate the value you get ......",
          "Contenu": "While I appreciate the value.    You cannot place stop or limit orders.  You have to be awake and on their site  to buy or sell.    And they put a s**t coin (Litecoin).    Don’t they know it’s a s**t coin?    I would think they Had done better investigative job.   That’s only drawback.  Other than that    If you HODL you should. Be fine. More coins plz"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raymond Kiernan",
          "Nb_Reviews": 2,
          "Date": "2021-03-30T22:44:52.000Z",
          "Titre": "There should be stable coins and stop…",
          "Contenu": "There should be stable coins and stop limit orders instead of paying exorbitant prices to put back into us dollarThere should be especially with crypto easier and cheaper ways to mitigate your losses when the market goes up and downIt makes me want to rethink if I am doing the right thing keeping my investments in this account"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wayne Austin",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T12:03:41.000Z",
          "Titre": "Review, score D to D-",
          "Contenu": "Your fees are massive in this space, one day competition will force a reduction in fees, at that time I will transfer to the alternative broker/custodian. Additionally why should it take 2 weeks to credit a transfer, do you think no one knows what you are doing with the money in the interim?  Finally no phone access is unacceptable, 2 to 3 days to respond by email in unacceptable.  The feeble excuse of too much business and the virus is no excuse. Hire an adequate number of reps to handle your available clientele and business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DANIEL BARRY",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T16:04:52.000Z",
          "Titre": "Never received $100 Bitcoin",
          "Contenu": "I used a link to sign up which was supposed to give me $100 Bitcoin, then when I had problems getting account set-up, their help center recommended a variety of solutions including signing up incognito. Anyway, was finally able to get account set-up only to have then tell me I didn't use the right link to sign up. I sent an email immediately after account was set-up to make them aware, but basically they didn't seem to care. Now I need to add $750 for balance of 2021 IRA, and they have changed minimum deposit to $1,000 without giving option to allocate some to 2021 and balance to 2022. Other than these customer service issues, seems like one of the better Crypto IRA platforms."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andy McG.",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T19:33:12.000Z",
          "Titre": "no stop loss orders?",
          "Contenu": "So far, I haven't even been able to figure out how to place a limit or stop loss order, let alone trailing stop loss.  Am I supposed to stay awake 24/7 to make sure I don't lose my savings?  Or is the interface just not intuitive?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ZerpTidalWave",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T19:17:16.000Z",
          "Titre": "I listened to all the hoopla about this…",
          "Contenu": "I listened to all the hoopla about this but the monthly fee eats up anything I am basically making.  I was going to put my retirement money in this account in a few months but am deciding not to.  I understand you have to make money but not at the expense of the little people."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Scarpelli",
          "Nb_Reviews": 16,
          "Date": "2021-09-24T13:33:31.000Z",
          "Titre": "Fees for purchasing crypto are high",
          "Contenu": "Fees for purchasing crypto are high.  Withdrawing money from your account is not intuitive or easy.  The dashboard to buy and sell, although clean and easy to use for a beginner, does not show any typical trading displays like candlestick charts or tools for analysis.  Other platforms show current news related to a specific crypto, this shows none.  Crypto prices on itrustcapital are always quite a bit higher than actual prices, so not only are you paying a high transfer fee but you are also paying a premium to buy crypto here.  It is a great way to get into crypto and defer taxes, but the platform could use some improvement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T21:00:55.000Z",
          "Titre": "You UX and UI needs a loooooot of work",
          "Contenu": "You UX and UI needs a loooooot of work. the quality of you product shows how you care about customers and the service we get. 1-2 stars are because your User Interface doesn't provide any value as other portfolio managements and wallets.Invest in Design!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T22:41:07.000Z",
          "Titre": "It took weeks to transfer funds into…Slow Response",
          "Contenu": "It took weeks to transfer funds into new Roth. I called many times, requested many times for iTrust to contact my old financial company directly but that did not happen. Transfer should have taken a few minutes not a few weeks to complete."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Thompson",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T19:59:45.000Z",
          "Titre": "Hate",
          "Contenu": "Hate, hate hate your website.SlowLacks information Poor to no ways to easily compare products One of the hardest to navigate and poorest thought out site I have to deal with!FIRE YOUR WEBSITE ADMINISTRATOR/DEVELOPER"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T01:45:14.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "iTrust Capital has a support phone number for onboarding and helping the customer get their funds into their IRA but it is impossible to talk to talk to someone when you are having issues with distributions.   The website says funds will be distributed 7-14 day after the distribution document has been signed,  I have been waiting 4 weeks now.  I have spoken to the support supervisor several times, who still hasn't been able to get a distribution supervisor to call me. Additionally they will not give you a direct phone number or email address to contact them.  Apparently they do not want to be bothered.  My advice, is that if you are at or near retirement, do not use this company.Additional feedback. (8/22/2022)After working with the team mentioned below to directly address and resolve this matter, it still has not been resolved after being assured twice that I would see my funds by the end of the day.  iTrust Capital's distribution processes are broken to the point that even prioritization and escalation fail."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MARVIN ANDERSON",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T13:25:31.000Z",
          "Titre": "I have (3) issues/concerns at this…",
          "Contenu": "I have (3) issues/concerns at this time. First is not having the ability to deposit less than $1k at a time. Cryptocurrency fluctuates wildly and you give us the ability to trade but not be able to send in less than $1k at a time to build up the account.Second in this day and age and especially dealing with cryptocurrency you should have the capability to transfer money either via a debit/credit card or bank account. Wiring in money or sending in a check is very outdated and old way of doing business at this time.Third what is the possibilities or timeframe for adding more crypto to be able to purchase??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "W. B.",
          "Nb_Reviews": 1,
          "Date": "2021-04-11T06:07:27.000Z",
          "Titre": "I started my account because I wanted…",
          "Contenu": "I started my account because I wanted to invest solely in XRP and it appeared that you were supportive of the XRP Community. Unfortunately, it does not seem to be the case because you have not re-listed XRP even after the recent developments with the SEC. Now XRP is at $1.44 and climbing and my portfolio has been left in the dust. I am so disappointed in my experience with iTrust at this point. I thought you had the XRP community's back, just like Uphold continues to do. But it is obvious that you don't. If you really want to show the crypto world that you are a groundbreaking company worth being loyal to, then show some integrity and re-list XRP."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Binh K Luu",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T16:48:21.000Z",
          "Titre": "Poor application forms",
          "Contenu": "The application process is NOT friendly. You can't just jump to a section that's left off or needs update. Funding process is slow. Can't set recurring buys or limit orders."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jothi",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T05:32:42.000Z",
          "Titre": "Very slow and inefficient",
          "Contenu": "I rolled over funds from other institution, its been 14 business days since it cleared there, still not showing up in the itrust account. It is hard to reach a human, they dont have contact numbers. Disappointed..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TW",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T02:08:06.000Z",
          "Titre": "Wish the monthly fee is none cause you…",
          "Contenu": "Wish the monthly fee is none cause you charge fee for each transaction already. And wish Xrp relisting much earlier...I'm missing such a great opportunity 😞 I'm missing out growth"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "N.I.",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T19:37:32.000Z",
          "Titre": "Poor Customer Services, Failed Promises",
          "Contenu": "I started last year with itrust capital and initially they seem to be providing good customer care, but that went south when required reporting was asked for (form 5498). I was told I would receive the reporting and even end of year reports, but that never happened. I was given the run-around and customer service became very poor. There was misrepresentation about my contributions as well. Also per email to all customers, they promised to  send customer balances for spark tokens ten days after December 12th, and I never received the email. Are they selective in how customers are treated? Pretty much all requests I have had has been ignored and promises have not been kept. This has been terrible and wish they can take better care of customers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Terry",
          "Nb_Reviews": 1,
          "Date": "2020-08-10T23:02:38.000Z",
          "Titre": "This is a good service but needs to improve the customer experience.",
          "Contenu": "This is a good service, but you guys are lacking some very important things to provide a great consumer experience.You need an automated way to fund the account.  Plaid is one option that may help with that.You need a mobile app.  As a consumer, I like having a button I can press on my phone to check my account status and asset performance.As a consumer, I'm not as likely to recommend this to friends, because it's pretty cumbersome and takes a while to get started.  I know a lot of my friends are not likely to persevere through the process, and are likely to get annoyed with me if I send them to you.  I applaud your current success, but I think you can do even better.  I also appreciate your company providing a Roth IRA option for gold and bitcoin."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Donald Neilan",
          "Nb_Reviews": 1,
          "Date": "2021-01-21T22:33:41.000Z",
          "Titre": "On Dec 5th",
          "Contenu": "On Dec 5th, I mailed my wife's and my first installment.  It was like waiting for paint to dry for you guys to receive this.  I hate coinbase but Itrust is even worse at investing money.  Your company charges monthly and I would think there would be better customer service.  All I received were talking points and lies.  It took 15 days for my money to get invested and 20 days for my wife.  Let's just try and blame it on the postal service.  I wired money the second time and I wasn't any happier.  Your customer service is horrible.  I would think you would try harder with new accounts.  Then you stop trading xrp because of a lawsuit that hasn't been finalized.  It seems Uphold knows more than your company and doesn't stop things on hearsay.  How does it feel to be just as terrible as coinbase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Sandstrom",
          "Nb_Reviews": 2,
          "Date": "2021-03-02T18:38:21.000Z",
          "Titre": "The user interface needs some work",
          "Contenu": "The user interface needs some work. I understand you want to keep it simple, but it's a bit too simple. The portfolio manager can be simple and easy to use and look much more sleek and modern. I personally like the Voyager app for crypto. You should check out their interface for some design ideas. A pie chart of your holdings by percentage would be much more efficient then your bar design for each asset. I would also add a field for the total P&L so users can see account performance at a glance vs only their account balance. Another idea would be to add a user chat forum. Itrust users could share trading strategies and and other market information. This could possibly encourage more trading activity and fees for Itrust. Please feel free to contact me for any further ideas to improve the user experience.Thanks,Ryan S"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SG",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T18:46:51.000Z",
          "Titre": "waiting for stop orders.",
          "Contenu": "Service is good but still would like to see the ability to use stop orders to buy and sell instead of only market orders.  Once that happens I would give it 5 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Bailey",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T16:04:45.000Z",
          "Titre": "Horrendous Customer Service",
          "Contenu": "I've been a customer for approximately one year. Overall, I'm satisfied with the actual management of the account, but customer service is horrible. If reliable customer service is a deal-breaker for you, be warned:1) The online help bots are terrible. They cannot accurately answer any question I have ever had.2) There is no way to call their company. It's just a recorded message.3) You can schedule a call with customer service, but you'll have to wait about a week. Scheduled calls are only 5 minutes, so be ready and don't forget to ask anything or it's another 1-week wait for you.4) You can email their support team, which is the fastest way to get in touch, but responders frequently don't fully answer questions, so it will take multiple email exchanges to get support.5) Their 'corporate' office address is a rent-a-room office building. Their 'mailing' address is box at a UPS Store."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jorge Zuniga",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T17:48:37.000Z",
          "Titre": "lack of customer support",
          "Contenu": "UI not the best, specifically when placing purchase orders. Also, transferring money is not easy. Customer service is not available fast enough."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T18:28:39.000Z",
          "Titre": "Your Rollover Process SUCKS!!!",
          "Contenu": "First, the rollover process was absolutely horrible. My check was mailed to you and received on a Wednesday morning, you said it would be processed after a 3day hold or something. well by Friday it still had not even been processed and the 3-day timer did not start. I didn't have access to my money for almost two weeks after you received it. I had two accounts a ROTH an a traditional, and the traditional was held up even longer and I was not able to start trading. the prices during that time when I was not able to trade were the lowest during the bear market and I lost the opportunity to captilize on the price. So that was my first expereince with your company and the based on the calls with your staff I was left feeling regret having sent my funds to your platform. Now that I have been using it, one feature you need to add is the ability to set multiple conditional orders, and the ability to dollar cost average into assets. You should allow multiple conditional buy and sell orders on the same coin. Also need the ability to see the average price per coin bought and show better performance analysis and reports. overall portfolio performance, individual coin performance, etc."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Norman Timm",
          "Nb_Reviews": 5,
          "Date": "2021-11-26T17:40:42.000Z",
          "Titre": "I sold a coin",
          "Contenu": "I sold a coin, I wanted the proceeds to go to buy another coin. So the proceeds were suppose to goto USD but instead sent to my bank account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry Clark",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T01:31:55.000Z",
          "Titre": "Be aware",
          "Contenu": "Be aware, the company has done away with there monthly fee, good right? But......You can only place market orders and the spread is terrible! Traded BTC & was $80 to $200 above the price you could buy it on other exchanges (plus your 1% fee). It looks like they are making up the monthly fee they were charging with fees (spreads) elsewhere. The old bait and switch. The site has gone down (not able to make a trade a couple times) at the worst time. Also, there offer of $100 in BTC is suspect. When I have inquired about it, I have gotten some kind of a BOT response pushing the date back. For the most part customer service replies doesn't seem to address my issue directly (seem like generic responses). By the way, if you call them on their issues on Twitter they will block you . You will only see the comments they want you to see.I stand corrected... I misspoke (or mistyped). It is 1% over their market price. The numbers speak for themselves. Not a good experience with Customer Service."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cindy Norman",
          "Nb_Reviews": 6,
          "Date": "2021-12-23T19:51:50.000Z",
          "Titre": "can’t put in buy orders. Absurd!",
          "Contenu": "can’t put in buy orders. Absurd. So I will have to wake up in the middle of the night to catch a favorable moments in the market."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark E.",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T23:52:27.000Z",
          "Titre": "Disappointed in communication and lack of transparency",
          "Contenu": "Very disappointed in the lack of transparency and communication with the recent breach."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine Park",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T14:13:58.000Z",
          "Titre": "Would like to see \"Limit Order\"…",
          "Contenu": "Would like to see \"Limit Order\" capability added for trading.  Also noticed some delay reflecting \"real time\" price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin M",
          "Nb_Reviews": 3,
          "Date": "2020-12-22T14:59:23.000Z",
          "Titre": "my second rollover did not go over so…",
          "Contenu": "my second rollover did not go over so well. There was a delay in delivery of the funds due to lack of timely communications from Itrust. The wore instructions were not followed properly resulting in the custodian mailing the check and delaying funding by over a week. Markets don't stop for the USPS. Dissatisfied that email communications took over 72 hours. That is not an acceptable response time. There was no phone number provided to call until after I asked for one. I requested a call back online and that took over 3 days. This could have easily been prevented had staff taken time to resolve the issue and spend a little more time on the process. Other than that my trades have gone well and the monthly fee and 1% trade fees are competitive. Think they are extremely busy and short staffed. They have assured me they are working on hiring and training. However thay does not replace the three days of trading that was missed while BTC hit ATH. Has yet to return to pre funding day levels. Not too excited about that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MFK",
          "Nb_Reviews": 2,
          "Date": "2022-02-13T17:54:27.000Z",
          "Titre": "You need to make funding the account…",
          "Contenu": "You need to make funding the account easier. There is no way I'm giving a 3rd party my info to do an ACH."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "Daniel Alexander",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T08:08:11.000Z",
          "Titre": "Unreliable deposits",
          "Contenu": "I have been using iTrustCapital for 5-6 months, and have had very inconsistent results when it comes to adding cash funds to my account.  2 of the 5 deposits took several weeks to reach my account, the most recent issue has been 3 weeks, with little to no customer service feedback in my inquires.  As far as once the money is there, and the ease of using the system, they are good, but being in limbo and not knowing where several thousand dollars are can be stressful, and I would have hoped for better customer service.Update:  Over 4 weeks now and still they can't find my $6,000 I sent.  I've had to send emails and messages through their system several times, repeating myself because I've been passed onto another customer service rep.  I only started getting feedback once I used a direct email that I had in the past to another employee (the automated system may have just been redirecting my comments to an unassigned box, I don't know).  I hope they resolve this soon, but I've missed the BTC dip because of all of this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ken Kaiser",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T19:44:36.000Z",
          "Titre": "My ira rollover came to itrust on 9/23…",
          "Contenu": "My ira rollover came to itrust on 9/23 and i had to call twice to track it down, first time there was no record"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Julie Doughty",
          "Nb_Reviews": 2,
          "Date": "2020-10-24T19:07:31.000Z",
          "Titre": "It was very difficult to get started…",
          "Contenu": "It was very difficult to get started and it was hard to get the correct answers on filling out the forms."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Raia",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T19:41:57.000Z",
          "Titre": "Had a lot of trouble with unfillable…",
          "Contenu": "Had a lot of trouble with unfillable fields in the transfer documents"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "B Hoyos",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T03:42:26.000Z",
          "Titre": "No investment options",
          "Contenu": "Options should be made available to stake and earn on DeFi projects."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RTW",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T21:19:28.000Z",
          "Titre": "Trading platform very poor!!!",
          "Contenu": "Trading platform not being capable of limit orders is a major liability."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-04-19T23:12:57.000Z",
          "Titre": "Overly complicated process to fund the…",
          "Contenu": "Overly complicated process to fund the account. Also crypto deposits"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Douglas Feuerbach",
          "Nb_Reviews": 1,
          "Date": "2021-05-05T11:01:51.000Z",
          "Titre": "Too slow to handle internal conversions",
          "Contenu": "Too slow to handle internal conversions and disconnected staffing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Lee Nowicki",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T23:08:48.000Z",
          "Titre": "System down all weekend!!",
          "Contenu": "System down all weekend!!! Unacceptable"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris D.",
          "Nb_Reviews": 1,
          "Date": "2021-12-31T04:28:30.000Z",
          "Titre": "What I learned 2 days after…",
          "Contenu": "What I learned 2 days after establishing the account. The costs at 1% per trade seem excessive but not sure if there are any gas costs included. The available tokens to trade are very limited. This is not coinbase. Plus you cannot make limit orders which means you probably pay the highest market price. Customer service is unresponsive to email requests. You need to make a phone appointment?!!  I think they are overwhelmed and one has to wonder why. The platform is decent and simple but I am waiting for something more advanced and lower cost. This is not a good option for active trading in my opinion. Look before you leap._________________________post review comments:After posting my review I received an immediate  phone call on my mobile from itrust and a message that basically said my review was not true and that I should go setup an account somewhere else. Not sure why someone would feel the need to call me at night on 12/30 with an attitude. My motivation is simple - to help make your company be better. That you would act so defensive is disturbing. First off, you send me an email asking for my review, I give you 2 stars then you ask for comments, I give you my honest feedback, then you question MY motivations?!!  So if a review is less than stellar, you attack? Not a smart strategy. The entire response misses the point and is misleading. I did not say your 1% fee was non-competitive - I said it seemed excessive. I did not say I could not trade on the account, I have of course place some buy orders. I did not say anything about stop orders - which are for stop loss selling, not buying. Limit buy orders are what I mentioned. Perhaps you do not know the difference or maybe just respond with robotic scripts like the emails you said I received. Please do not  play this game. I am only trying to help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T16:42:56.000Z",
          "Titre": "Too many fees",
          "Contenu": "Too many fees. Nickle and dimed on every transaction."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Van Ben Chiu",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T18:22:37.000Z",
          "Titre": "Struggle to deposit funds into IRA…",
          "Contenu": "Struggle to deposit funds into IRA account!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cynthia G.",
          "Nb_Reviews": 1,
          "Date": "2020-12-31T18:35:18.000Z",
          "Titre": "Does not let you withdraw your money",
          "Contenu": "On 12/1/2020, I sent a message requesting a CARES act withdrawal. I was told that the instructions and forms will be sent within 1-2 days. I already updated the message request #19810 several times, and still no reply.On 12/9/2020, I scheduled a call and did not get the call on the appointed time. I only got a call when I replied to the appointment e-mail sent by Carol Medel and asked why nobody called. When I got her call, she told me that she will send me the withdrawal forms and instructions that night. But until now, almost 3 weeks later, I still do not have instructions/forms or any other communication from ITrust.On 12/15/2020, I sent another message (request # 22973). I got a response from Rich Hauschild saying \"We are currently inundated with requests and are working through them, we apologize for the delay.We will follow up with you soon.\"On 12/23/2020, I sent this message to the request # referenced above:\"Thank you for your response. But my concern is that this is a CARES withdrawal, which I specified in my previous requests, and the CARES act is about to expire. What happens if you still don't get to process this request before the expiration date? I shouldn't be penalized (due to your delay) since I made the request way before the expiration date, right?\"I never got a response on this.Why can't I withdraw my money?? At least post the instructions and forms on your website so customers can initiate the withdrawal process. How long and how hard is it to send instructions and forms??The lack of communication and professionalism is very frustrating, and all I am requesting is a withdrawal which I believe should not even take this long. Especially during this time when it is really needed.In the beginning, they were very professional in taking my money. But now that I desperately need it and ask for it, they won't even give me the time and day and ignore my request.UPDATE:12/31/2020 - Received the requested funds. Thank you for expediting this and getting the funds to me before the end of the year."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rodney",
          "Nb_Reviews": 3,
          "Date": "2022-02-17T16:38:24.000Z",
          "Titre": "Be prepared to hassle",
          "Contenu": "I started the process of transferring a sizable chunk of cash from one IRA over to iTrust 8 WEEKS ago. After completing the forms and instructions for a transfer on their website, I got an email telling me to keep a close eye on my account messages and email inbox over the next 1-3 business days to DocuSign a couple of documents. 2 full weeks later I hadn't received anything, so I sent a message to customer support. To their credit, that same day I got a message back that the documents don't actually arrive via email (despite what the earlier email said) and that they're ready for me to sign. I had just checked my account messages prior to reaching out, so it's clear that my note to them is what prompted the documents suddenly being ready. Fine, at least they were ready. I signed what needed to be signed, carefully read over everything to see if any further action would be needed from me, didn't see anything, and so expected to see the transfer show up in 3-5 business days. I gave it 9 business days before getting in touch again. 2 days later I got a message that a transfer form needed to be filled out. Again, nothing in the two previous rounds of paperwork mentioned this, and I had already provided the account number and institution name that the funds would be transferring from in the earlier paperwork. Fine. I filled out the transfer form. 5 days later I sent another message to customer service, as I hadn't seen any movement on either the iTrust account or the funding account, and by now I was starting to feel that the only way the next step in the process was triggered was by me pinging customer service. Sure enough, suddenly the transfer started 2 days later. I waited the 5 business days that I was seeing the (pending) notation on the funding account. 2 business days ago, the money showed as settled on the funding account side, and was gone from that account. I logged on to iTrust and it still showed as pending. I waited 2 days to give them the benefit of the doubt. Today it's still pending on their side, and settled and gone from the funding side. I reached out again today, but I'm tired of having to do this for every single step. They don't seem to have a process in place where one completed event triggers the next, and things only happen when I send a message. It could be worse, at least so far sending a message has made things happen. My advice is to be proactive and don't assume that finishing one task will prompt the next to begin."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Finn Lassen",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T16:37:19.000Z",
          "Titre": "Wanted to change the email address on…",
          "Contenu": "Wanted to change the email address on my account. Only on-line option I found was to open a support ticket, which I did. I got an automated email back with a link to schedule a verification call, which I did. At the scheduled time I waited at the phone for 30 mins. No call. I then called the support number and waited. When I finally got through to a person I was told they don't use the scheduling! The guy told me he'd email me a docusign link for the change. I have still not received that email.Edit: Grant called me back with an apology and had fixed everything."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J J",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T00:14:48.000Z",
          "Titre": "The customer service staff are not…",
          "Contenu": "The customer service staff are not professional, knowledgeable, or helpful in my experiece. I can hear 14 people talking in the background when I call..it's bit distracting. The website needs MAJOR improvements in both design and function. I've linked my bank to the \"new\" banking system 10 times now and keep getting a message to link my account. After calling customer service they were completely baffled and said they had to get to their tech team to figure out why. So now I can't make a contribution...very sub-par."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George William Klug",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T20:12:13.000Z",
          "Titre": "Limitations…why? Ask us what coins should be made available.",
          "Contenu": "Not sure how they are connected with Coinbase.. but do not provide the selection as in Coinbase.  Limited asset choices…DOGE, SHIB really!  What about QNT, HBAR, providing and backing up XRP( Uphold has gonads), CSPR, LCX, VET, XDC, DAG utility coins that actually solve a problem around the world with significant purpose. Your coins should reflect the latest technology and future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "james William allman",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T18:16:11.000Z",
          "Titre": "loved starting my own account but the…",
          "Contenu": "loved starting my own account but the reward for a referral being an electronic card was difficult for myself and my friend we both seemed to lose the bonus and were not able to convert it to a useable card. We both thought it would just be added to our account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AJS",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T22:49:17.000Z",
          "Titre": "Delay in funding",
          "Contenu": "I had some trouble getting the account funded. J in customer service was quite responsive. I hope they can resolve whatever technical issues they have from time to time. In the end, it seems to have worked out. My account was funded."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck S",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T21:15:43.000Z",
          "Titre": "Delays in completing IRA to Roth conversion",
          "Contenu": "It took three requests to completely close an IRA account I fully converted to a Roth IRA earlier this year. Twice there were small amounts of few cryptos improperly remaining in the IRA account.All assets were finally transferred and the IRA account was closed today."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Austin Kinaan Kayasseh",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T02:57:38.000Z",
          "Titre": "You guys support crypto currency in…",
          "Contenu": "You guys support crypto currency in general and not bitcoin. That’s not healthy for long term investing. You should make bitcoin happen and leave the rest alone"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Neetan Mandalia",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T19:43:47.000Z",
          "Titre": "Ease of Use",
          "Contenu": "I don't like that I have to go to my history to see what the previous purchase price of coins was at the time of purchase. This makes it difficult to determine which coins I should be dollar cost averaging into."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Devin Jett",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T20:43:48.000Z",
          "Titre": "I like the app but, it could improve.",
          "Contenu": "I like the app, would really just like to have more investment options. Such as Sugar, Beans, Oil, natural gas, etc. If that was an option I’d give it 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Peter Christopher Vangjel",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T21:05:29.000Z",
          "Titre": "ACH transfers take too long",
          "Contenu": "It always takes at least five actual days for ACH transfers to go through. I’ve had two wrote to ask for status on two previous transfers.  Other than that everything is cool."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elektra Love",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T19:31:09.000Z",
          "Titre": "Minimum contribution amt too high + difficulty in reaching customer service",
          "Contenu": "I dislike that the minimum contribution amount is $1k, this makes it difficult to add funds to my account. I also had challenges in connecting with a support POC in the beginning, not having a phone number to speak to a customer service agent is not ideal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William T Price",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T22:54:42.000Z",
          "Titre": "I don't like that I can't stake ADA",
          "Contenu": "I don't like that I can't stake ADA. I also wish we had more traditional asset selection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "christine solarte",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T02:43:55.000Z",
          "Titre": "Love how easy it is but you should…",
          "Contenu": "Love how easy it is but you should lower to 100 instead of 500 dollars because most people can invest 100 weekly rather than 500. I have so many people that want to join but 500 it to much."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Callaway",
          "Nb_Reviews": 5,
          "Date": "2022-10-11T18:58:32.000Z",
          "Titre": "I love the concept but the offerings…",
          "Contenu": "I love the concept but the offerings are very very limited with very few speculative coins/tokens to bet on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William M.",
          "Nb_Reviews": 2,
          "Date": "2023-05-02T05:41:40.000Z",
          "Titre": "Still waiting on the Google Play app",
          "Contenu": "Still waiting on the Google Play app. Its taking too long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven L",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T03:00:06.000Z",
          "Titre": "Who doesnt have an Android App????",
          "Contenu": "No App, limited coins, clunky platform!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nicolas Weachter",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T00:57:16.000Z",
          "Titre": "Feedback",
          "Contenu": "I like the website but was hoping for staking. Staking my ADA would be a huge lift during this bear market. Customer service was really good and were helpful with answering my questions. Buying and selling was easy and website layout is easy to navigate. Having an ACAT transfer option would make it easier for me to transfer additional money into"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laurie Masters",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T23:40:11.000Z",
          "Titre": "Over-the-top verification does NOT serve the client.",
          "Contenu": "I suppose iTrust is trying to \"protect\" us, but they would not allow me to change my phone number and my email and my 2FA without CALLING them, which DOES NOT WORK in my shift-work lifestyle. I need to be able to log into my profile and make changes. It was ENFURIATING and took multiple calls. Finally, they sent me a code so I could go inside and change the 2FA without a call. Idiotic. But Customer Support was very responsive and stuck with me, within their ridiculous policies. So they're great, but the policy is completely unacceptable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alison",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T04:07:53.000Z",
          "Titre": "Good concept, needs lower contribution limit",
          "Contenu": "I appreciate the service that iTrustCapital provides, and the interface is nice to use. However, the $500 minimum contribution at any given time is a huge issue for me. My SEP-IRA contribution (while generous from my employer) only accrues that much after a timespan of 2 months, so until I accrue that much with my employer, I cannot send these funds to my own interest account. Instead my employer earns interest on those funds while they remain in their bank account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marvin D Willey, Jr",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T20:24:52.000Z",
          "Titre": "Need lower deposit amounts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie Lea Hill",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T16:12:26.000Z",
          "Titre": "Had a very difficult time rolling over…",
          "Contenu": "Had a very difficult time rolling over funds. Was given incorrect instructions a couple of times.  Funds were not credited to my account for an entire week. The check arrived on a Friday, I believe, but wasn’t logged until Tuesday. Very, very frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ALBERTO FAJARDO",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T13:16:03.000Z",
          "Titre": "Access to costumer service is very…",
          "Contenu": "Access to costumer service is very limited. My Ake an appointment with costumer service to talk about your accounts or problems is ridiculous. The platform actually is very easy an simple to access. Also I don’t receive any total value that you guys get from my previos administrators for the total value of the IRA transfer to your account; to make sure that PRIMERICA transfer all my funds"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PCY",
          "Nb_Reviews": 2,
          "Date": "2022-04-06T17:20:09.000Z",
          "Titre": "Cannot complete buy/sell orders",
          "Contenu": "Cannot complete buy/sell orders. Huge issueGot a response from IT, issue still not resolved. And one gripe I have with Itrust Capital you can’t schedule a call with them. Shows no appointments available. So I was able to call and got Robert on the phone right away. Really helpful, issue with KYC update. Sucks I can’t trade at the moment but at least customer service was 10/10."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eduard None Richter",
          "Nb_Reviews": 2,
          "Date": "2022-03-21T19:56:14.000Z",
          "Titre": "No possibility to self-custody",
          "Contenu": "No possibility to self-custody. After seeing what happened in Canada, I don't want to have my crypto vulnerable to the whims of a government that decides that they are going to seize it just because they have a different point of view. It happened to our family once before when we left a communist country. enough said..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David D",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T16:41:32.000Z",
          "Titre": "Creation of IRA; communication",
          "Contenu": "Application for and creation of my IRA was relatively simple, website is mostly friendly to navigate. When I had a question and used the communication portal to ask it, I never got a response.  Balancing the positives of easy creation and relatively easy use, with unresponsiveness to a simple question, I get a score of 2.5 out of 5 which I've rounded to 3."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Gliessner",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T18:53:49.000Z",
          "Titre": "They have disabled the ability to sell…",
          "Contenu": "They have disabled the ability to sell on their platform. They claim it’s a bug for everyone, but what function do they provide outside of the ability to transact with in an IRA.They were able to restore my account the next day. Confidence is shaken. Will have to see what the future holds."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wanda Nechelle Evans",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T15:20:06.000Z",
          "Titre": "Right now I'm giving it 3 stars because…",
          "Contenu": "Right now I'm giving it 3 stars because I just opened a account with you guys which was very easy very efficient and the emails was always explained correctly so going forward in the near future I'll see how it goes Who knows it can work itself up to 4 to 5 stars thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Wade Laughery",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T20:41:21.000Z",
          "Titre": "True Value Issues",
          "Contenu": "Values of coins do not seem to reflect daily fluctuations very accurately. Also, it's hard to tell overall value of all investments (whether I'm up or day for the day or overall across all coins).  On the other hand, the buying/selling is very user friendly and I love that the fees are literally only 1% for any buy/sell and there are no other fees. Also wish there were more buy/sell options like limit/stop/etc."
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Jerry J Lankford",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T18:27:13.000Z",
          "Titre": "The last person I dealt with was very…",
          "Contenu": "The last person I dealt with was very on point and solved the problem instantly. Know for the several other individuals it took like 24 hours to get a  response back. Also, why can't you have someone live we can talk to rectify the situation. I'm happy all is done but it shouldn't take a week to transfer funds once the check is processed in your system. I love the platform and the layout."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Beth Leicht",
          "Nb_Reviews": 2,
          "Date": "2021-12-06T17:26:10.000Z",
          "Titre": "No limit or stop loss orders",
          "Contenu": "I like having an option for my Roth. However the inability to place limit orders has cost me a lot as I’m in the accumulation phase. Later I suspect I’ll be unhappy about the inability to place stop loss orders. I’m not trying to actively trade but these would be very helpful to me since we keep having huge swings in the middle of the night that I’m not awake to take advantage of."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Freefall",
          "Nb_Reviews": 3,
          "Date": "2021-11-10T20:30:25.000Z",
          "Titre": "Good and Bad",
          "Contenu": "Positives:Customer serviceGood communication during the processSeamless IRA transferOpportunities:Limit orders are a must.More coins to choose from.Team up with an exchange to fix the limit order issue and give customers the ability to choose from a wide variety of coins, not just the large caps. Kill your monthly account charge and add 10-20 basis points to order flow."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Noe Antonio Garza Jr",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T18:08:12.000Z",
          "Titre": "No updates were provided to me as to…",
          "Contenu": "No updates were provided to me as to when my initial check deposit was received or being processed.  Not having a customer service number also made it difficult during this process.  With me considering moving hunderds of thousands of dollar to this account and not having a customer service number causes me a bit of concern."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hughe Gene Miller",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T05:23:01.000Z",
          "Titre": "Foot dragging on getting my funding put…",
          "Contenu": "Foot dragging on getting my funding put through. Once I found a working phone number...not easily. Things then went smoothly. You had my check, from rollover and was cleared and converted and your firm was telling me to mail it wire check.Glad that's done. Fine since then. HM"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Hancock",
          "Nb_Reviews": 3,
          "Date": "2022-02-14T20:00:19.000Z",
          "Titre": "Great overall service",
          "Contenu": "Great overall service, opportunity and selection of coins. However the trading does not allow you to set buy and sell orders and all purchases are synthetic- you do not own your crypto keys). If iTrust added these 2 features it would improve the quality of service significantly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2021-11-04T18:47:58.000Z",
          "Titre": "I have enjoyed the site but needs work",
          "Contenu": "I have enjoyed the site, easy to use but would like to see more info, like % gain since starting and what tokens can earn by staking or if earning now (even if not posted) how much that is, as it will help investors stay in some tokens in a down market if they know how much they are earning by holding them.  Thanks, John"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darian Kelsch",
          "Nb_Reviews": 1,
          "Date": "2021-07-11T17:02:56.000Z",
          "Titre": "Platform is easy to use",
          "Contenu": "Platform is easy to use. I enjoy being able to have a self-directed IRA using crypto. The things I don't like are not being able to set Stop Losses or Limit Orders. This alone losses me $100's of dollars. Second thing I don't like is that every trade costs me around $100 dollars in fees. Over time this is going to add up to massive losses in my account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam Womble",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T21:03:38.000Z",
          "Titre": "Good Product / Poor Service",
          "Contenu": "I love the product offered by iTrust, but the timeliness needs improvement.  The funding process never goes as smoothly as it should and will take twice as long as indicated. Their support team is helpful but might not respond for a day or two."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 5,
          "Date": "2021-07-21T00:15:50.000Z",
          "Titre": "You still have work to do, but there is potential",
          "Contenu": "It may be ok to you to have no live customer service you can speak with when needed, and have to wait days or weeks for a call back...but its not ok with us. Also you are not fast on the draw when transactions are taking place. I find you average so far. The gentleman that we eventually had contact us was nice and helpful to the degree he could."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T18:27:32.000Z",
          "Titre": "I would like to see more options to…",
          "Contenu": "I would like to see more options to speak with someone on the phone. Scheduling a call for days out isn’t very helpful. In the future, I would like to see iTrust offer the ability to stake crypto in your account to earn interest. Lower the debit limit for deposits from $1000 to $100."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Sperry",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T12:24:58.000Z",
          "Titre": "Meh...",
          "Contenu": "Although iTrustCapital allows you to buy crypto in your IRA, there's a lot lacking.  There's no ability to stake, no chance to earn interest, you can't borrow against your holdings, it costs $30/month, and a 1% fee both when you buy and when you sell.  It feels like a traditional bank."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P.m.B",
          "Nb_Reviews": 2,
          "Date": "2021-06-02T21:29:24.000Z",
          "Titre": "Generally speaking",
          "Contenu": "Generally speaking, good. Provides needed service not readily available.Just wish there were more coins offered, the ability to stake and a mobile app would be nice. I do find the reports pretty useless. I would like to see a dashboard that show cost basis, current position / balance, amount held and performance per coin and overall. To get that today, it's a chore. Overall happy but there is a LOT of room for improvements."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Martin",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T22:26:31.000Z",
          "Titre": "I decided to go with iTrust after…",
          "Contenu": "I decided to go with iTrust after reading a review that stated they had more reasonable fees than others, for their self-directed IRA setup, monthly fees, and transaction fees.  I was satisfied with setup, but the \"dashboard\" is of limited use--doesn't allow any analysis, setting any triggers for buys/sells, etc.  Fees for gold/silver seem excessive--but maybe that's the norm."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A-A-Ron",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T18:42:50.000Z",
          "Titre": "Wait Time",
          "Contenu": "Wait TimeI am not sure if they are just backed up that much or what but it takes quite a bit of time to get a response. I wish that I didn't have to set up a call in advance because the wait time is like a week. When they do respond however, they are super helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HapaOhio",
          "Nb_Reviews": 2,
          "Date": "2021-05-09T14:00:10.000Z",
          "Titre": "For being an early innovator with…",
          "Contenu": "For being an early innovator with respect to cryptocurrency and precious metals IRA investments, iTrust lacks in technology related to transferring funds- still using archaic wire transfers and checks via snail mail. Pricing in real-time data could be more updated. Still waiting on interest and staking capability of certain crypto assets. Security and safety seems excellent so far, however."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2021-07-24T03:22:07.000Z",
          "Titre": "Pros and Cons",
          "Contenu": "Pros:1. Easily buy and sell Bitcoin2. Prices not too bad compared to other crypto IRAs3. Decent website experience.Cons:1. No way to enforce using only Authy for 2FA. When Authy is set up, there should be an option to use only that and not SMS for authentication.2. Should be able to set up limit buys and sells of Bitcoin."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hung Tran",
          "Nb_Reviews": 1,
          "Date": "2021-06-02T23:48:15.000Z",
          "Titre": "Recommended areas for improvement for iTrustCapital",
          "Contenu": "iTrustCapital would merit a higher rating had its IRA account:1. charges less for transaction fees (or better yet charges no transaction fees)2. charges less for maintenance fees3. pays interest on cryptocurrencies held in the IRA account4. allows investment in more types of cryptocurrencies5. provides real-time human customer service support"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nelly Astur",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T01:08:01.000Z",
          "Titre": "I rated them a 3 because even though…",
          "Contenu": "I rated them a 3 because even though their rates are lower their crypto prices are significantly highly priced. When you purchase a crypto as well the figures between the fee and the price of crypto does not add up. When you want to sell also their crypto value suddenly drops as well. And then there is a fee in addition to that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence Moderhack",
          "Nb_Reviews": 1,
          "Date": "2021-04-07T21:27:14.000Z",
          "Titre": "Comparatively reasonable fees",
          "Contenu": "Comparatively reasonable fees and rates.  Lack of details on the website concerning withdrawal procedures, taking possession of crypto and/or metals, taxes, etc..  Slow response to texts and rollover requests.  Orders almost always seem to be filled at an unfavorable price, often outside of the range that the market is trading in from the time the orders was placed, to when it is filled."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CA",
          "Nb_Reviews": 1,
          "Date": "2021-09-17T00:05:23.000Z",
          "Titre": "Excellent customer service, but needs features",
          "Contenu": "Excellent customer service - both in terms of quality and speed. Top notch.  Can't say enough good things about the service. To get to a 4 or a 5?  Need these added:-Limit Orders (!!!!!)-Staking-Mobile App-Ability to buy/write call/put options (this might be a stretch - but one can dream)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Devin Tejral",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T14:02:36.000Z",
          "Titre": "I cannot rate I Trust Capital a 5 at…",
          "Contenu": "I cannot rate I Trust Capital a 5 at this point. 2 major reasons. Not to be able to place limit orders is a tragedy.  I almost rated a 1 because of that...  it’s unconscionable to be forced to stay up all night to monitor if ur wanting to trade it.  Other big negative is not many choices.  For example I want to get into the NFT area, and I can’t in I Trust."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rodrigo I. Ocampo",
          "Nb_Reviews": 4,
          "Date": "2021-04-03T09:57:39.000Z",
          "Titre": "The trading platform is too restrictive…",
          "Contenu": "The trading platform is too restrictive and doesn't have any trading pairs to switch between crypto pair when there are rallies. The inability to do this especially when certain alt coins have large rallies compared to bitcoin and you would want to lock in those gains in Bitcoin and not dollars it makes little sense to sell into dollars to buy more bitcoin."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2021-06-27T06:30:12.000Z",
          "Titre": "It functions smoothly, but needs development.",
          "Contenu": "I like the site, and the roll over was time consuming, but trouble free. I do have issue with the web pages lack of information about my portfolio. At this time all it provides is overall balance. Would like to be able to at least turn on information about my individual assets and trends since purchasing it.   Overall 3"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Millicent Hine",
          "Nb_Reviews": 1,
          "Date": "2021-02-28T20:25:03.000Z",
          "Titre": "Scheduled my \"phone\" consultation more…",
          "Contenu": "Scheduled my \"phone\" consultation more than a week in advance. Received the call earlier than was scheduled and was old that something had come up so my call had to be \"now\" or at some other point which would not work since I had other obligations on that day. I felt rushed and did not benefit from the call. Because you offered the Roth IRA I went ahead and opened the account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry Swords",
          "Nb_Reviews": 2,
          "Date": "2021-02-16T18:19:42.000Z",
          "Titre": "Great opportunity...with room to improve",
          "Contenu": "I love the concept of being able to invest in crypto assets within my IRA. Itrust Capital has a great platform to do this. My only issue is the lack of options to communicate directly with them. You either have to email them, or schedule a time for them to call you back. I would love to see them improve this area, so you could reach them by phone directly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kolleen Conley",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T02:12:20.000Z",
          "Titre": "There should be an option to transfer…",
          "Contenu": "There should be an option to transfer bitcoin or an alt coin into the  IRA account. Also, if I am HODLing, $30.00 dollars per month is too much. I have holdings in Celsius that give me  a percent per month. Grated, you are not a lending company, but maybe an idea to improve your customer retention."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lance",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T02:09:41.000Z",
          "Titre": "Room for improvement",
          "Contenu": "Room for improvement, but still good and I will recommend it.Pros:1.  Fees are very reasonable.  Bitcoin IRA was a non-starter.2.  Terrific interface.  Everything on one page is nice!3.  Support was good.Cons:1.  Process for transferring my IRA went less smoothly than it could have.2.  Security kicks me out pretty frequently and I have to re-login.  It's not only after time outs.3.  Could use more coin selection.4.  No limit buys.5.  No staking.EDIT: JP Morgan was entirely helpful and professional and there was no friction on their part."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "T. H.",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T00:31:46.000Z",
          "Titre": "I am very grateful for iTrustCapital",
          "Contenu": "I am very grateful for iTrustCapital.  I converted my 401K to a SEP then to a ROTH and moved 95% to ITC in 2020.  The platform and mobile app is good.    However, the time it takes to wire funds and have access in my account needs vast improvement.  Maybe that is the reason for DeFi?  Customer service when you can speak to someone is very solid.  They may have been slammed with increased demand so it seemed difficult to keep up with the customer growth.  All in all I would highly recommend ITC."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lori Vana",
          "Nb_Reviews": 1,
          "Date": "2021-06-19T02:02:08.000Z",
          "Titre": "Pretty good so far…",
          "Contenu": "So far it has been good and it appears safe. Gave it 3 stars because of no staking and no limit buys. I have been told both of those are coming. There still are some of my favorite coins that are not listed but they are adding as time goes on. If they had staking and limit buys I would give it 5 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-07-11T00:11:06.000Z",
          "Titre": "Wish it was easier to talk to a person",
          "Contenu": "Wish it was easier to talk to a person. I understand trying to keep budget down, but sometimes its nice to just pick up the phone and talk to someone.  Hetti g this transfer thing has been a bit of a pain. Some of the attachments that were sent are just headings or logis or something not a form."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TERRY HOUGHTON",
          "Nb_Reviews": 1,
          "Date": "2021-02-20T05:20:59.000Z",
          "Titre": "I think you're fees are reasonable",
          "Contenu": "I think you're fees are reasonable, but the spread is very high. At least compared to other crypto/gold IRAs. However, you site is rather minimalistic. You choices of assets is limited, although I like that you have added a couple more options. The thing I really wish you offered is the option to do limit and stop orders."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T19:04:57.000Z",
          "Titre": "Good platform recommended",
          "Contenu": "Staff has been great overall. Site has been responsive and always available when I use it. The platform only allows for market orders currently. This can be inconvenient for more active traders trying to optimize each trade. Hopefully this is something that will be available soon. The lack of limit orders and stop losses is the main reason for my current rating. Otherwise I recommend iTrust for your crypto/IRA needs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John David",
          "Nb_Reviews": 2,
          "Date": "2021-02-22T18:35:25.000Z",
          "Titre": "This is a good IRA for crypto providing…",
          "Contenu": "This is a good IRA for crypto providing you're going to beat the $360 annual fees.  Beware of metals.  Surprise fees (a surprise to me when they went up drastically) and you're stuck with whatever you trade.  Also, it takes a long time to get your money back on metals.  When I tried to buy and sell metals to earn money in my IRA and I ran into these difficulties, I was told that this account is not for \"daytraders.\" I am not a day trader.  Stick with the crypto if you use this account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Causseaux",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T20:19:54.000Z",
          "Titre": "Withdrawal very quick and efficient",
          "Contenu": "Have made two requests for withdrawing funds.1. messaged -7/13/20 no response2. Phone conference 7/14/20 with Henry Melchor stated required pdf form.    still waiting. This is not acceptable. UPDATE:Once required withdrawal documents where signed our funds where deposited in our account within three days. That's much faster than excepted. Great Job"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stacy Leffingwell",
          "Nb_Reviews": 2,
          "Date": "2021-03-10T17:56:02.000Z",
          "Titre": "I'm very excited about my crypto Roth…",
          "Contenu": "I'm very excited about my crypto Roth Ira! and for the future of this site, but I think many things need to happen first, such as being able to do limit orders. Also, customer service needs to be improved, with better phone support and live chat support with an actual person.  That would be awesome!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P.m.B",
          "Nb_Reviews": 2,
          "Date": "2021-04-12T23:07:03.000Z",
          "Titre": "Improvements needed",
          "Contenu": "Don’t have an issue with the service - I do have a major issue with not being able to call without making an appointment and having to wait 2-3 days. That’s just unacceptable to me. Im also a little dumbfounded at how little knowledge that person that will eventually get on the phone with you has... other than that, it is what it advertises to be - a way to invest into crypto currency inside an IRA and therefore without tax implication. Great idea. It’s a needed service that needs major improvements around customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon Fry",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T18:34:02.000Z",
          "Titre": "Great Platform - Depositing is archaic",
          "Contenu": "Innovative, reasonable fees, good overall experience.Just ironic that we are investing in the digital future of speed and efficiency, but to do so, we have to rely on wiring money.Update contribution options to allow for online access to major bank debiting and this is a five start platform."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 2,
          "Date": "2021-01-22T16:10:19.000Z",
          "Titre": "I am displeased about your decision to…",
          "Contenu": "I am displeased about your decision to cease trading XRP.  If your view of XRP is that you took the action because of the SEC lawsuit, which is not resolved, then what bodes for your platform when probably most other coins raised capital in the exact same manner as XRP, but the differed that they have not been sued by the SEC? Your coin holdings are limited and, I suppose, with that cloud hanging over you, the platform may shrink to BTC and ETH? Otherwise, the interface is good and easy to operate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles W Lampert",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T17:59:07.000Z",
          "Titre": "It’s a Good Start",
          "Contenu": "The IRA’s lack many of the offerings, and reporting and analysis resources that virtually all crypto exchanges provide. I am pleased with the customer service but they need to keep upgrading and adding value for the customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "E. Figueroa",
          "Nb_Reviews": 1,
          "Date": "2021-07-30T01:03:33.000Z",
          "Titre": "Funding acct is a hassle; $1k min funding on ROTH",
          "Contenu": "Adding funds to my Crypto ROTH account is a hassle and takes a 2-3 days. You have to fill out a doc to request to transfer funds, then once you go through the DocuSign process you can only snail-mail a check or pay for wire transfer. Also, ROTH min funding limit is $1k."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leland A Martineau",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T21:54:23.000Z",
          "Titre": "I am unable to print schedules of each…",
          "Contenu": "I am unable to print schedules of each of my investments in virtual coins I have acquired in my iTrustCapital account, including: 1) although I am able to print a complete copy of my \"Transaction History\" report, I am unable to print a complete daily listing of my holdings and each coin's \"Tokens/Ounces\", and each coin's \"\"Price Per Tokens/Ounces\", and \"Market Price\" at that moment in time. Please instruct me on how I can access the above printouts/reports.2) Please instruct me on how I can access & print a complete daily listing of my holdings and each coin's \"Gain or Loss\" report at that moment in time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T01:35:41.000Z",
          "Titre": "Extremely basic",
          "Contenu": "Extremely basic. You can buy market order crypto from a so-so selection in an IRA. No cost basis tracking. No limit orders. No stop loses. I found out about them from one of their affiliates that pushes this as a way to trade tax free, but without these tools, unless you want to sit and watch the market 24/7, you really cannot do this. If staking starts within a few months I would probably give another star. For what it is it works, they appear to be the most competitively priced, even with their wide spreads on market orders and I will use them for now.Average product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DZ",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T14:19:24.000Z",
          "Titre": "The system is down today",
          "Contenu": "The system is down today - with no emails sent to customers, no response, nothing on the website indicating it is down for maintenance. Showing zero in my account. ( update thanks for getting back to your customers via email and online)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea Hogue",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T15:18:50.000Z",
          "Titre": "My major issue is the platform",
          "Contenu": "My major issue is the platform. There needs to be more features in requires to my positions performance. For example there needs to be an option to see 1 day, 1 week, 1 month performance of my account. Each position should show total % change, total return, today’s % change, today’s return."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matt Huber",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T03:36:56.000Z",
          "Titre": "Bumpy start but issues have been resolved with help from support staff",
          "Contenu": "It took over a day due to technical hiccups but I now have the account set up and authorized funding from an existing account at another custodian.  Technical difficulties occurred on two occasions which were frustrating so that's the negative. On the positive side I had at 3 different support personnel reach out to help and I have no doubt other technical people behind the scenes were involved as well.  I generally judge a firm not on its problems but on its willingness to correct those problems so ITrustCapital fulfilled its part.  I believe some technical issues should still be resolved and hopefully have been for more than just my one off issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris W.",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T16:44:12.000Z",
          "Titre": "The website's user experience needs to…",
          "Contenu": "The website's user experience needs to be overhauled. When executing an IRA transfer, there is no clear visual representation in the dashboard to indicate the status of the transfer. It took 5 days for me to realize that a form needed to be completed in order to commence the process. There should be an obvious notification (like a number 1) that pops up in the Document section notifying me that there was a form to be completed. Instead, the instructions to complete the form were written in small type in an unexpected place in the far right of the dashboard. Creating a status bar with visual milestones to show the progress of the transfer would also be useful communicating the status of a transfer to users."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "This Guy",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T01:17:00.000Z",
          "Titre": "High Prices, No limit orders",
          "Contenu": "- Good customer service during and post sign up. - Made roll over surprisingly pain free.- but can't place limit orders. - Prices listed are consistently higher than other exchanges. - No ability to purchase a specific quantity of an asset (ie. 100 SOL). Must enter a dollar amount. - Buys have consistently executed at higher prices than presented. (So even when using an amount greater than what's needed for 100 SOL + fees, I still only get 99.x)- The financial health of iTrust is important to me but please don't place investors' interests so far ahead of customer satisfaction than you lose us. Good start but must improve for me to use it more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zazzletoys Ben Borkovitz",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T13:29:54.000Z",
          "Titre": "NOT eligible in NY or HI",
          "Contenu": "Looks great, except I went trhough all the steps to set up and then found out that I wasn't eligible because I live in NY State.  Humph!  I hope that NY can be integrated at some point.  I see that Alto serves NY and may go with them..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HapaOhio",
          "Nb_Reviews": 2,
          "Date": "2021-05-09T14:17:54.000Z",
          "Titre": "Customer support via communications",
          "Contenu": "Customer support via communications, whether written or verbal, is lacking. Speed of transactions and purchases is a positive. Product variability needs improvement (ie only nine crypto currencies, plus gold and silver). Would like to earn interest on investments."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "IMcCoy",
          "Nb_Reviews": 3,
          "Date": "2021-12-02T00:47:04.000Z",
          "Titre": "Easy creating account but very elementary platform.",
          "Contenu": "Creating account and transferring money is simple and straight forward. But the trading platform is very elementary. There is only market orders and you have to contact support to make a withdrawal. Support is quick to respond."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Petrash",
          "Nb_Reviews": 2,
          "Date": "2022-07-21T19:47:52.000Z",
          "Titre": "ITrustCapital was average at best",
          "Contenu": "ITrustCapital was, at best, average when it came to customer service, the information they shared with me, and resolving my issue.  I wasn’t extremely dissatisfied with their service, but neither was I completely or extremely satisfied with it either.  I did a 401K Rollover to a Roth IRA and it didn't go smoothly at all.  I received an email from iTC saying they had received the check from my prior institution about 7 to 10 days after I began the process.  The email said it would be \"3 business days\" before I could actually start buying assets through iTC.  3 busness days came and went, and I wasn't able to buy anything.  It took almost a month of emails with 3 or 4 different iTC CSRs before I was actually able to buy the assets I wanted for my Roth IRA.  Not strong work there iTC!I had hoped for a better experience coming on board.  We’ll see how things go from here."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C. Matthews",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T21:05:44.000Z",
          "Titre": "Funding took a long time",
          "Contenu": "There was not enough clear information about the funding through a rollover.  It took much longer than expected.  The scheduling of phone support is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Jernigan",
          "Nb_Reviews": 4,
          "Date": "2021-07-18T23:14:20.000Z",
          "Titre": "Meh not terrible not great",
          "Contenu": "It is a super-pain in the a*$*$ to simply make a deposit in any way shape or form. I expect to get some bull$-hit boiler plate explanation that it has to be ridiculously difficult to make deposits. Don’t bother, I’ll just ignore it."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Joel Leath",
          "Nb_Reviews": 1,
          "Date": "2020-08-05T21:34:51.000Z",
          "Titre": "It took way too long to transfer money into my trading account.",
          "Contenu": "My only complaint is that it took so long to make my money available for trading.  7 days to clear a check?  Aren't you in the blockchain business?  Because of this delay, I lost out on tens of thousands of shares in the digital currency I wanted to purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Elliott",
          "Nb_Reviews": 4,
          "Date": "2021-04-20T18:18:03.000Z",
          "Titre": "Overall I am quite satisfied, however",
          "Contenu": "Overall I am quite satisfied, however I have had difficulty with the funds transfer process. It would also be beneficial if customers could place a bid to make a trade as with all other exchanges, rather than having to trade on the spot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Simmons",
          "Nb_Reviews": 1,
          "Date": "2021-03-16T23:23:16.000Z",
          "Titre": "My initial impression was …",
          "Contenu": "My initial impression was that setting up the account was going to be a bit difficult.  You get a questionnaire that you are supposed to fill out by asking your current IRS custodian for the answers.  My custodian obviously did not like the questions and the most frequent response something like \"we work that out with them.  They know what to do.\"  However, once I sent that form to iTrust the account was funded very quickly.  The major reason for my 3 star score is the limited crypto choices.  I have no idea what hoops iTrust has to jump through to get a crypto approved for inclusion, but I am hoping the choices will expand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 2,
          "Date": "2021-02-24T11:34:30.000Z",
          "Titre": "As I am new to crypto",
          "Contenu": "As I am new to crypto, let alone crypto IRA's, I really have no basis of comparison, so my star rating is probably not accurate. The rollover from my 503b to my iTrust account was painfully slow. I don't know if that is normal, but was caught off guard as I watched the crypto prices climb each day as I waited on the sidelines, anxious to get in. There was a slight pullback just as my funds were processed, which gave me some reprieve as I finally was able to direct my funds into specified crypto's. Now I  await the staking , eagerly.No problems with customer support, just the process (that's on my 503b account and iTrust)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "I’m just okay",
          "Nb_Reviews": 2,
          "Date": "2020-06-30T16:58:38.000Z",
          "Titre": "Okay site but not drawn to maximize my potential with site as of now",
          "Contenu": "I do believe being able to have a crypto ira account is great thing iTrust could make funding  account simpler. Login facial recognition and app is needed for quick access you guys seem distance. I like the thought of having such an account."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JEFF thornton",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T21:08:22.000Z",
          "Titre": "This took 1 month to complete with two…",
          "Contenu": "This took 1 month to complete with two personal phone calls.  I made the correction requested but still took two weeks. Also I did not recieve the 100.00 for setting up a new account.Jeff"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Jette",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T23:36:13.000Z",
          "Titre": "The service and the people are great",
          "Contenu": "The service and the people are great. The interface is awesome and everyone is very knowledgeable. I would like to see wallet exchanges.I would also like to have a single browser account with multiple retirement account."
        },
        {
          "Note": 3,
          "Lieu": "CR",
          "Pseudo": "JMV",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T17:52:57.000Z",
          "Titre": "Great product but issues creating accounts",
          "Contenu": "I think you offer a great product, in fact both myself and my wife intended to open accounts with you at the beginning of December, however; I was able to open my account but not until 12/31 it was fully funded after multiple support calls. My wife however was no able to open her account even after multiple calls and emails due to an issue validating her account using her phone number. We still intend to open her account and fund both through the years but it was unfortunate to have to struggle so much just to create and fund the accounts.If this happened to both of us I can only imagine how many other people have had similar issues. We were told we would be contacted once the issue is resolved but no news so far.The staff has always been helpful and very respectful. A+ on that point"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nelson Vinas",
          "Nb_Reviews": 1,
          "Date": "2021-03-15T23:26:14.000Z",
          "Titre": "I opened Roth IRA account on January…",
          "Contenu": "I opened Roth IRA account on January 2021. So far I am satisfied with website. It is user friendly, convenient and easy to understand. Their concept of investing in crypto currencies takes headaches in accounting and cumbersome tax tracking. However, communication  need to be improved where there should be customer support available when needed rather than scheduled phone calling system. Funding need to be improved by letting wire, ach and other electronic means rather than archaic paper system. At present, it is very slow and too many unnecessary steps need to complete the funding process. Overall ITrustCapital in my opinion is one of the best institution to invest in crypto the IRA way. A happy customer so far"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T02:03:04.000Z",
          "Titre": "In general",
          "Contenu": "In general, customer assistance is supportive.  Due to the demand probably, there is a delay in responding to a message (specified to be 2 business) but it actually took a few more days so some catching up to do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "P.",
          "Nb_Reviews": 1,
          "Date": "2021-04-14T18:03:51.000Z",
          "Titre": "Not for casual day trading; 1% fee is a lot.",
          "Contenu": "Great for accessibility for trading short term. Wouldn't exactly \"day trade\" using this platform due to the high 1% fee. Especially in less volatility times. Great front runner choices in crypto but not enough choices in smaller caps crypto. Love the early rewards for the referral program but really is for the big time promoters, not for the casual little guys. The CEO is very informative , transparent and doing great work giving us a chance to invest retirement long term in crypto as there are little choices atm. Would love more perks long term to spice up loyalty in the holding. Don't know when staking will arrive. Would love a modern way of loyalty membership sustainment features to build trust. Get it? iTrust"
        },
        {
          "Note": 3,
          "Lieu": "TW",
          "Pseudo": "Jack Tung",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T17:18:54.000Z",
          "Titre": "There is no monthly statement which the…",
          "Contenu": "There is no monthly statement which the tax would need me to disclose the values at the end of year for the Roth IRA. Difficult to get this account information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mila",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T17:18:44.000Z",
          "Titre": "Is easy to apply for a IRA",
          "Contenu": "Is easy to apply for a IRA, the problem is when you want to buy BTC or any crypto, is not inmediately it takes 3 to 4 hours to complete the transaction and obviously the price is going to be very different."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KEVIN  F.",
          "Nb_Reviews": 3,
          "Date": "2022-06-30T23:39:49.000Z",
          "Titre": "1st I love the concept of I trust.",
          "Contenu": "1st I love the concept of I trust. The reason for the review is the whole buy and sell set up is got some serious problems. The cost for trades is a 1% fee. But that’s not the all the cost. The buy cost is always higher than any other market that I can find. So you pay more and buy less. Then when you go to sell the price is lower than everyone including their own buy price. So you are taking loss buying and selling over and above the 1% fee!!!! Not to mention they sell you on 24/7 account access. But you can’t set buys and sells you have to do all buys and sells in person. So you have to be awake and on the site 24/7. Which is impossible! Like I said from the beginning I love the concept! But clean up the problems or I’m not sticking around."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "C. Morgan",
          "Nb_Reviews": 1,
          "Date": "2021-03-10T02:28:40.000Z",
          "Titre": "Having to wait 7 days to speak to a…",
          "Contenu": "Having to wait 7 days to speak to a representative is a bit excessive. Other than that, process to enroll is simple, selection of coins is good and wire transfer was available in a timely manner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabriel Alvarez",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T00:03:03.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "I was able to get back access into my account after having lost it for three weeks. Thank you for fixing this problem and letting me back into my account. I appreciate it. Thank you!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "G. M.",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T23:17:22.000Z",
          "Titre": "Acceptable but need some polishing",
          "Contenu": "So the online interface is smooth. The largest issues are the on ramp to get setup in the system, followed by the transfer of funds.  These two issues are why you only get three stars. I really like the rest. You guys need to have a live agent that can be called to help with on ramp questions, though the FAQ is good, sometimes a voice with a quick update is best. And scheduling a call two weeks out is unacceptable, a day or two might be fine, but recognize the time in which you live.  As for the transfer of funds, you need to accept bank to bank transfers- ACH. So ridiculous my “bank” had to send a paper check and then I had to wait two weeks for mailing a processing. Total time to complete setup was a month. Also you need to get CARDANO, right NOW!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T13:56:02.000Z",
          "Titre": "Recommend",
          "Contenu": "Everything works well, just not a fan of your twitter account!  Don’t like when companies feel they have to take shots at their competition.  Don’t lower your standard, let them try to catch you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom N Idalynn Gentner",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T01:25:59.000Z",
          "Titre": "First time investors get professional care.",
          "Contenu": "The helpful group at iTrust helped me through my first time experience with contacting, routing of funds.They worked with the appropriate contacts to facilitate a timely exchange of my funds.Kind, friendly, diligent and prompt with responses.Thier group made my first time experience a good oneMany thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Chang",
          "Nb_Reviews": 2,
          "Date": "2023-08-23T20:41:52.000Z",
          "Titre": "Great customer service team. (Thanks Nadia)",
          "Contenu": "I am based out of New York, and iTrustCapital (iTC) came highly recommended to me. I think they are a good and solid company although nearly two years ago; being based out of New York and having my funds sitting in the cryptocurrency XRP; due to some highly questionable tactics done by the SEC to file charges against members of the company Ripple, it likely contributed to iTC stopping its support of the token a couple years back for NY and Hawaii residents given the regulatory uncertainty that it created here in the United States which in turn forced me to have to make the tough decision of having to transfer my funds out to another custodian or have the funds automatically liquidated which I didn't want to do. I also had to take an early distribution on another token I received for holding XRP which I also didn't want to do but is something that I view largely to be the fault of the SEC's actions rather than iTC.Now that the SEC has largely lost in its absurd case against Ripple; and given iTC's move to a new custodian that once again supports XRP as a token; I've made the decision to come back to the platform and hope that nothing rash like what happened with XRP happens again in the future as that would force me to permanently leave the platform the second time around as it was an unpleasant experience having to move the funds back and forth and dealing with some delays which has costed me greatly in terms of lost opportunities over the past couple of years on top of the various fees and taxes that I will be assessed for all the movements. The saving grace through all of this frustration has been the positive experiences that I've had with various members of iTC's service team who are dedicated and genuinely want to help. I most recently had the pleasure of dealing with Nadia who provided me with frequent updates on the progress of my in-kind transfer back into my account. Support at iTC is consistent, and you will typically get a response within 24 hours, and most will go out of their way to provide you with a straight answer rather than just a cookie cutter response that ultimately goes nowhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Enrique Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T23:44:14.000Z",
          "Titre": "Mark Morales saved the day",
          "Contenu": "Mark Morales saved the day. I had a distribution interview call and apparently booking system failed so got stood up for it. However after sending and asking for a clarification email, I got contacted promptly by Mark Morales explaining situation and solved all my queries and priorized my transactions so no more time would be lost.My impression is that systems for Itrust still are quite manual, but customer service is quite responsive and efficient. Thanks again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David H.",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T03:54:14.000Z",
          "Titre": "I had an easy time transferring funds…",
          "Contenu": "I had an easy time transferring funds into ITC. Any questions I had were promptly answered. I like being able to invest in crypto with funds otherwise locked into traditional investment areas. My biggest wish right now is to be able to request for additional tokens to be available to trade, particularly if there is a significant community push for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Ohnmacht",
          "Nb_Reviews": 2,
          "Date": "2023-05-16T22:11:56.000Z",
          "Titre": "Jimmy Herrera has been an ideal service…",
          "Contenu": "Jimmy Herrera has been an ideal service rep: professional, efficient and courteous. He helped me with a withdrawal verification phone call. The process leading to the call was frustrating and took weeks to accomplish. Perhaps not enough staff to service your clients?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NP",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T21:39:59.000Z",
          "Titre": "My experience",
          "Contenu": "The UI\\UX could be a lot better but it is functional. Customer service responds to me reasonably quick with answers to my questions. Call experience has been non existent. Seems like every time I tried a call directly iTrust wasn't accepting calls at that time. But overall my experience has not been bad."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy D Stewartson",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T19:55:08.000Z",
          "Titre": "Mark from account support was great",
          "Contenu": "Mark from account support was great! He helped me understand the deposit and withdrawal guidelines. He always connected with me when I had questions or concerns. Always, communicative and responsive to calls and texts. Thank you Mark for all the great support!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M Garcia",
          "Nb_Reviews": 2,
          "Date": "2022-11-21T20:03:34.000Z",
          "Titre": "Good overall experience",
          "Contenu": "iTrust Capital provides good customer service. My questions are always answered in a reasonable time frame. The software is easy to use and fees acceptable. I'm looking forward to a day when an IRA can be funded by scheduled, monthly direct deposit vice wire."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly Kelly",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T02:43:28.000Z",
          "Titre": "Grateful that Itrust exist",
          "Contenu": "I really like having such low fee crypto IRA platform.  So far all pleasant experience with all my transactions and transfers.  The only reason I'm giving this review a 4 star is the delayed in processing my overcontribution withdraw.  They were able to make the deadline for the tax year, but too lengthy for a perfect rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cass",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T20:32:44.000Z",
          "Titre": "Sadly I have spent years of my life not…",
          "Contenu": "Sadly I have spent years of my life not working 3 jobs.  Itust gives me the chance to put a little aside and take advantage of ups and downs to build and crypto is safer than a company proned bankruptcy but crypto is miner driven."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Osterberg",
          "Nb_Reviews": 2,
          "Date": "2022-11-01T19:14:46.000Z",
          "Titre": "Fingerprint and real use crypto",
          "Contenu": "I really need to be able to use my fingerprint to login and I would like to see some real work use crypto like quant, VeChain, celo, xrp, hbar.  It would be nice to get into some uranium and platinum."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Stacy Perez",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T20:25:29.000Z",
          "Titre": "I'm very happy with the process and…",
          "Contenu": "I'm very happy with the process and idea in general. I just wish the Android version of the app would come out already. I really think all IRAs should allow some crypto allocation. Vanguard lost a good customer to you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John D",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T21:17:11.000Z",
          "Titre": "4/5 stars",
          "Contenu": "ITrustCapital is easy to use, appears very safe from scams/hacks/illiquidity. I would give it 5 stars if they would incorporate a stop/loss feature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T20:07:01.000Z",
          "Titre": "Transfer Out Woes!!!!!",
          "Contenu": "Update:After receiving my review iTrust was quick to not only respond to the Trustpilot review but instantly gave me a call to understand my problem.  Jared at iTrust texted and called me to address my issues.  He then started working with my new IRA custodian to develop a plan for getting my funds over to them.  In the matter of a day the whole situation had been resolved.  I am very satisfied at the customer support and white glove service that was given by Jared.  I have changed my rating and updated this post to reflect.Original Post:I have been trying to track my transfer out to a different IRA.  Which has been apparently mailed out almost a month ago.  My new custodian has not seen the check yet.  I have contacted support a couple times and gotten different stories as to the dates and even where the transfer was being sent.  I have asked for a tracking # to see where the check would be with nothing but crickets.  This is ridiculous and makes me wonder why I am keeping my Roth with them still."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T19:03:42.000Z",
          "Titre": "Rolled over an IRA to iTrust",
          "Contenu": "Rolled over an IRA to iTrust.  Each step of the process was well laid out.  Would benefit from a step by step roadmap at the beginning to take you from account set up through purchase of the crypto.  When I had questions, I found the customer service to be quick and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben from LA",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T18:37:44.000Z",
          "Titre": "ALMOST perfect.",
          "Contenu": "ALMOST perfect.. a couple of things that would make Itrust a no brainer.. 1) speed up ACH funding 2) re-list XRP."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Richard Kareman",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T19:08:28.000Z",
          "Titre": "Reduced Trading Fees…",
          "Contenu": "For clients with over 100k or who have been with you for over a year (I am both), the trading fees should be reduced to 0.5% IMO.Also, offer BNB! Thank you.George"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Fitzgerald",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T02:25:24.000Z",
          "Titre": "Everything  is done very well the only issue  is I have not been able  to log on last couple  of days maybe a glitch  that we'll  stop soon thank you",
          "Contenu": "You guys  do a very nice job thanks Just been lodging  in last couple  of days. But I don't get 6 digit number reply ? Other then that great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Berluti",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T19:00:45.000Z",
          "Titre": "Good service, high transaction cost",
          "Contenu": "Good service, growing asset list, and reasonable communication are good.  The only issue is the cost of transactions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Joseph Hetterick",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T18:37:00.000Z",
          "Titre": "I picked my 9 best coins to invest in…",
          "Contenu": "I picked my 9 best coins to invest in and only 1 was able to be staked .More staking should be available ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 3,
          "Date": "2022-09-12T20:39:44.000Z",
          "Titre": "One of the best crypto IRA's out there",
          "Contenu": "I've been using iTrustCapital for a few years now, and will continue to do so. Whenever I had issues, their customer service got back to me quickly. I just wish they had a fee structure so that high volume traders could benefit from lower fees. I would definitely do more selling/buying if fees were lower."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerard R Blot",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T22:22:06.000Z",
          "Titre": "Uploading IRA transfer forms",
          "Contenu": "Beside having trouble uploading the ira transfer forms because had 2 spaces I thought one for each page After your mail telling me both pages had To be uploaded together. So why did you put 2 upload windows (confusing)In your explanation Should be mentionedThat both pages are to be uploaded together"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elias Nigussie Wolde",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T04:30:26.000Z",
          "Titre": "even if I lost more than 10K in the…",
          "Contenu": "even if I lost more than 10K in the last two months I have a positive hope I will be successful through iTrustCapital. I did not have retirement money and I am above 55 years old. I have a great hope I will get a great benefit from your financial organization for my retirement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Bratton",
          "Nb_Reviews": 3,
          "Date": "2022-08-11T01:38:34.000Z",
          "Titre": "Crypto Roth IRA",
          "Contenu": "I use the platform to fund a Roth IRA. The experience with support  has been great.  Just know, if you are funding a Crypto Roth IRA, iTrustCapital doesn’t take out the taxes you will need to pay at the end of the year.  Also know the selection of Crypto assets is slim compared to other exchanges.  They need to increase the selection greatly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Colin Adair",
          "Nb_Reviews": 2,
          "Date": "2022-07-30T00:34:57.000Z",
          "Titre": "401k rollover from fidelity",
          "Contenu": "I found the experience of rolling over my 401k fairly easy. It wasn't very straight forward how to contact someone on the phone but once I did I received great help from someone very polite. I also never did receive an email notifying me that my funds were ready to go, maybe I just didnt see it. I also didn't get a prompt to update my payment method which could be useful for 1st time users."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 3,
          "Date": "2022-10-13T05:16:02.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, wish they had more staking options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "lsh",
          "Nb_Reviews": 5,
          "Date": "2022-07-13T19:44:54.000Z",
          "Titre": "4 out of 5 stars...still need staking rewards",
          "Contenu": "4 out of 5 stars only for the fact that staking is not available. I have been told (awhile ago) that this feature would be available. Still waiting but once that feature is added I would give a 10 star review out of a 5 star choice. Having your investment grow and support blockchain protocols is extremely important for the success of the protocol. Therefore; setting up a crypto IRA that supports the success of the protocols is a NO BRAINER!!! Thanks again for the outstanding customer service I have recieved in the past. Best wishes and Happy Investing. Scott"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yolanda G Conover",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T08:10:21.000Z",
          "Titre": "Customer service are very helpful",
          "Contenu": "Customer service are very helpful. Whenever I call for some issues there was always someone to answer it. The only concerns I have is the availability of ordering type, staking or private wallet. But I’m hoping somewhere along the line you’ll have these features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Michael Wallace",
          "Nb_Reviews": 3,
          "Date": "2022-11-11T19:49:50.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Wish there was an option to also invest in stocks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerald Lee Cooke",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T18:52:18.224Z",
          "Titre": "I believed the money to fund the…",
          "Contenu": "I believed the money to fund the account would be in the form of an automatic transfer(like with Coinbase). Because I was unaware a wire to transfer funds was required, I missed my 2021 contribution. I can’t blame you completely, however, since the money to fund it was languishing in a checking account just waiting for me to use it for this purpose since December, ‘21."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don R.",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T20:42:00.477Z",
          "Titre": "The overall process…",
          "Contenu": "The overall process of opening and funding an account was pretty straight forward. However, when you are funding from an Employer-funded plan, the process needs a bit more attention to make sure it's completed correctly. Also, it was difficult to get in touch with a live person when the FAQ section did not answer my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tropical Breeze",
          "Nb_Reviews": 4,
          "Date": "2022-03-25T18:02:21.000Z",
          "Titre": "It been fine so far",
          "Contenu": "It been fine so far. I would have to say the only issue I do have is the minimum amount you're allowed to deposit which is $1000.00 It will would be a lot more beneficial to me if the minimum was somewhere in the area of $250.00 minimum deposit and not $1000.00 that way it allows you to make quicker deposits because the minimum deposit was easier to gather at one time than the current deposit minimum.  Other than that so far so good. Thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Stacy Perez",
          "Nb_Reviews": 2,
          "Date": "2022-02-22T16:50:18.000Z",
          "Titre": "So glad to be here!",
          "Contenu": "Its really hard to do a review as I'm so new and so is this platform. A few things I would like to see improve in time.1. Chat window for clients when logging in.2. A recurring contribution option to customize amounts and frequency's.3. Faster wire transfers and ACH times to post.Other than that ,I love what this offers and am excited to join in this awesome alternative option for the people. Thank You!Jeff"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George B",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T17:29:55.000Z",
          "Titre": "Overall I appreciate iTrust services…",
          "Contenu": "Overall I appreciate iTrust services and the provided specialization to Crypto currency, however live feedback to address pressing matters a bit slow (have to schedule a call back many days later - too slow when market is 24/7) and unable to talk to live human in critical situation - otherwise would have given 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. Meckley",
          "Nb_Reviews": 2,
          "Date": "2022-02-26T11:29:23.000Z",
          "Titre": "I enjoy the platform",
          "Contenu": "I enjoy the platform, easy to navigate and invest. Be patient while funding, it takes several days for items to clear. Customer service is very good if you take the time to set up a phone call - no live support at this time. Several areas that I have been told they are working on that would make the experience even more fruitful are the following:1. Staking - currently not available2. Setting limit buys - currently not availableHopefully these will be available soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ellen Maxson",
          "Nb_Reviews": 4,
          "Date": "2022-09-01T00:10:02.000Z",
          "Titre": "I’ve been very happy w iTrust",
          "Contenu": "I’ve been very happy w iTrust. Trading charges are very low compared to other companies. And they’ve been steadily adding cryptos to trade. I feel very secure with them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BH",
          "Nb_Reviews": 3,
          "Date": "2022-02-01T18:58:53.000Z",
          "Titre": "The option to trade Crypto using a Roth…",
          "Contenu": "The option to trade Crypto using a Roth IRA is fantastic. What is lacking, is the layout of the Dashboard. It doesn't show the cost average per crypto. Only shows the current price and value of the position. It would be great to have the cost info somewhere easy to access instead of calculating or having a spreadsheet next to you to get that info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Philip Miller",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T16:55:08.000Z",
          "Titre": "Saul Goodman",
          "Contenu": "Everything is pretty good, from ease-of-use, to communications to security. The only things lacking are the potential staking mentioned in the documentation and asset choices are a bit limited.  Of course, fees could always be lower...All in all, I'm happy I rolled my Roth IRA over to ITrust.PM"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Nansel",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T17:24:00.000Z",
          "Titre": "Just set up an iTrust Capital IRA",
          "Contenu": "Just set up an iTrust Capital IRA. Mostly good given the new service. Challenges that I find are no limit orders on the trading platform and slippage as much as 1% on a weekend. I understand that this function is coming. I am working out a Roth IRA conversion and appears may not be seamless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon in Ohio",
          "Nb_Reviews": 1,
          "Date": "2022-04-07T17:47:01.000Z",
          "Titre": "Pending Review UPDATED",
          "Contenu": "UPDATE: iTrust indeed resolved my issue within a day. Original review: I signed up over a week ago and have been left in 'pending review' forever.  I have given them everything they need.  I had a call yesterday with a csr and he said they'd probably have my KYC done yesterday.  Still pending.  I just sent an email request asking about my status.  The last time I did that a response took two days.  I'm getting very frustrated.  The deadline for 2021 contributions is rapidly approaching and I'm afraid I'll miss it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffrey Searle",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T17:03:08.000Z",
          "Titre": "Great so far - just allow for trading faster!",
          "Contenu": "Overall, it’s been a great service. I really like the referral program and plan to refer some friends. I also really like the clean interface and transparent fees. My only complaint is the time it took for my initial deposit to clear. I use many financial institutions, and it took far more business days than is usual. Since my funds have cleared, I’ve been happy with my experience!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2021-12-21T17:27:10.000Z",
          "Titre": "Overall service is very good",
          "Contenu": "Overall service is very good, website easy to use. Only one thing that I really like to have is to be able to track the performance of the crypto as overall and individually. Basically right now, I don't know if I gain or lose after I invest the crypto cus nowhere to track it. Hope you can learn from Fidelity or Schwab to make the performance info & chart ready, thanks!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Gene Levi",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T18:28:44.000Z",
          "Titre": "Bot was initially unable to understand and answer…",
          "Contenu": "Bot was unable to understand and answer my question.  I am interested in opening a Roth using the same credentials I used to open my IRA. Is this possible (and how) or do I have to create a separate new account using a different email address? Updated rating from 1 to 4 stars: the response I received from a real person was more helpful. I also found the answer by rewording my imessage for the bot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maynard Wellman",
          "Nb_Reviews": 3,
          "Date": "2021-12-21T22:01:27.000Z",
          "Titre": "Nice and recommended crypto IRA.",
          "Contenu": "I like the low fee operation platform. Nice selection of \"blue chip\" cryptos.  Trading fees competitive and can still add up but, not an issue for hodlers. Website and set-up is nice and easy to use. Takes a awhile to get everything set up even with cash funding the first time. As with any new cost saving platform, if you need to talk with a human, be prepared to wait a few days. Overall very satisfied vs the competition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VPK",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T19:15:16.000Z",
          "Titre": "Transfer Of Funds From Another Provider",
          "Contenu": "The bolt problem I had was facilitating transfer of funds from another provider. There was confusion with the other provider as iTrust’s transfer protocols are different than typical. On a positive note ITrust responded to all my questions and requests for information in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T20:01:44.000Z",
          "Titre": "Issues with initial funding, otherwise what I wanted",
          "Contenu": "It is hard to communicate with a representative over the phone, email responses are short and half-thought out, and deposits/transfers seem to be forgotten unless the customer follows up, causing an extended hold (over the 3 day) with release of the money being delayed over and over.  It seems once the money is with iTrust, the interface is good though and haven’t had a problem since."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S Thiboutot",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T22:31:30.000Z",
          "Titre": "It’s great that they don’t charge a…",
          "Contenu": "It’s great that they don’t charge a maintenance fee for an IRA. Decent amount of coins. Would love to have $LUNA (Terra) Transaction fees are 1% which is okay given you don’t have to report your transactions on your taxes which is the main issue with non IRA accounts. Main drawback is all trades are market price. No stops or limit orders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T17:15:51.000Z",
          "Titre": "Good Platform",
          "Contenu": "It's great to have a hands-on approach to a 401k rather than not like traditional. Great variety of assets representing their respective categories (de-fi, interoperability, etc) With that said, I would love to see airdrops be recognized in the future, specifically for ATOM."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bud Nash",
          "Nb_Reviews": 3,
          "Date": "2021-12-23T18:42:19.000Z",
          "Titre": "Choices are very limited.",
          "Contenu": "I am a little disappointed in the number of investments available to choose from. There are literally hundreds on the open market but very few of them are included in the choices.UPDATE:After speaking with Jared, I understand the challenges of getting assets added.  I am hopeful that more assets will be added in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-13T07:52:54.000Z",
          "Titre": "Customer service was an A+. Need a few more top assets.",
          "Contenu": "Customer service was an A+! I would like to see a daily, weekly, monthly % gain/loss column as well as get a few more assets to choose from. I personally think it's a waste to see Doge and Shib in the mix as I'm not likely to invest in those in this type of portfolio. Would like to see Avax, Luna, Hbar, Vet and other top 20 assets. Also gaming or metaverse coins are very hot right now and will be in the years to come."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Larissa Martin",
          "Nb_Reviews": 10,
          "Date": "2021-11-19T08:07:39.000Z",
          "Titre": "I really want to register with this…",
          "Contenu": "I really want to register with this company, but website has an error (for the last couple of hours) and when calling them it says to contact them through the website.Addition- Thanks for the reply. I'm a US citizen who wants to roll over my 401k. I pay is taxes but I do live abroad. Does that mean I can't use your services?Thanks, Larissa"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet Burgoon",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T13:17:16.000Z",
          "Titre": "Revised review based on iTrust's quick response.",
          "Contenu": "My original review: I hate the \"self serve\" customer service. It's useless. I couldn't log into my accounts this morning (just hung then gave me a 524 error). No way to find out what was going on.I was impressed that a rep called me immediately, apologized and explained that I could e-mail them in the future & he gave me his personal e-mail phone nbr."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T17:29:43.000Z",
          "Titre": "A great alternative to standard IRAs",
          "Contenu": "The overall web experience is very good and the site is easy to use. They have one of the most diverse lists of coins to invest in. I would like to see limit ordering and performance charts added eventually. It would also be great if more layer ones such as avax, luna, and ftm and game/metaverse options like mana and sand were added instead of more memes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garrick Hanger",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T21:12:25.000Z",
          "Titre": "great service",
          "Contenu": "great service.  they have worked hard to add to their customer service and it shows.  they are also planning on a major upgrade to their platform that will resolve most of my current smaller issues, which will lead to a 5 star rating at that time ( issues getting solved include: depositing through ACH, staking capability, merging accounts so Roth and traditional ira for one customer can be one account and not two, etc)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clinton Boyd Wiltse",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T19:27:20.000Z",
          "Titre": "The platform is good",
          "Contenu": "The platform is good. It was disappointing that the minimum deposit from my bank was $1000 even after meeting the 2500 initial deposit. I had 550 more that I could put into my Roth IRA, but was not able to do this. Had to put that in an ETrade account instead"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BlockchainBuck",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T18:30:16.000Z",
          "Titre": "iTrustCapital has excellent customer…",
          "Contenu": "iTrustCapital has excellent customer service.  They need to have real time trading data just like Coinbase or any other exchange showing the exact real time price valuations so we can trade more accurately.  I have Coinbase open while buying/selling on iTrust to ensure the price hasn't changed drastically and so I can see graphs of the price history."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suzanne Calkins",
          "Nb_Reviews": 2,
          "Date": "2021-09-15T15:25:04.000Z",
          "Titre": "Great to have a retirement acct to invest in Crypto!!",
          "Contenu": "Great to have a retirement acct where I can invest in bitcoin and gold & silver now! Easy to use site. Suggest they have a way to generate how your portfolio is performing ( charts) and what shows me what My cost invested vs current market for that investment. Also suggest an easier way to fund it than wiring and checks or roll overs which can take a while (ACH withdraw from my bank acct maybe? )."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "vonWagenoff Holdings",
          "Nb_Reviews": 2,
          "Date": "2021-09-20T14:58:09.000Z",
          "Titre": "iTrustCapital was easy to work with and…was professional and understood my goals/objectives.",
          "Contenu": "iTrustCapital was easy to work with and I highly recommend them for your crypto and precious metals Roth IRA. In fact, the younger you are the sooner you should start! I can't stress this enough. Don't rob and cheat yourself by not acting and doing it now...because the 50 year old future version of yourself will be very appreciative for your wise decision."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duck Seeker",
          "Nb_Reviews": 2,
          "Date": "2022-03-24T14:08:41.000Z",
          "Titre": "Great platform",
          "Contenu": "Great platform!  It us super easy to use!  I would like to see more analytics on my portfolio. Also I would like to see staking options!  I am told they are coming. Finally, it would be good if they could add additional currencies monthly or quarterly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryan Mehaffey",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T01:08:36.000Z",
          "Titre": "Good Crypto IRA, could be Great with a few improvements",
          "Contenu": "I compared all of the crypto IRAs available extensively and iTrust definitely has the best package. Easy to use interface, 24/7 tax free trading, reasonable fees, and a wide variety of constantly expanding crypto assets. The two big areas where iTrust falls short are the lack of limit orders, and staking rewards. Supposedly they are in the works but have not heard much news on this in awhile. Overall would and have recommended to family and friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yacob Samuel",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T19:40:05.000Z",
          "Titre": "ITrustCapital is just like their name…",
          "Contenu": "ITrustCapital is just like their name you can trust them 100%. Calvin who help to solve my issue is very understanding person. He knew how weak my computer skill was and walked me  through patiently to solve my the issue. Steve Jobs once said : in order the company to be successful the company must treat their customers like their own families and Calvin just did that. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bundy",
          "Nb_Reviews": 3,
          "Date": "2022-03-31T16:54:15.000Z",
          "Titre": "great option for investing in a crypto…",
          "Contenu": "great option for investing in a crypto roth ira.  pros are that the fact it's a crypto roth ira, has an app, and the website and app seem to have a clean interface with fairly simple functionality.  the cons are that they only have a [significantly] limited list of cryptos to invest in, don't offer limit buys or limit sells, and the app has been shutting down to \"update and restart\" each time i use it for more then 2 minutes for the past few days.  all in all, great service because of the timeliness of what it offers, and the cons all seem to be things that could probably be easily fixed in due time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rex",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T01:21:39.000Z",
          "Titre": "iTrust was very good at keeping in…",
          "Contenu": "iTrust was very good at keeping in touch via the emails and following up to make sure that you were making sure that you are aware of what stage the transferring process is in so that you can make sure that account you are transferring is doing what they are supposed to do.   You can also make an appt to talk to someone which can be beneficial the first time you are filling out all the TF forms because it is not always clear which acct number you are supposed to use."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "John Pollard",
          "Nb_Reviews": 2,
          "Date": "2021-08-28T00:13:13.000Z",
          "Titre": "Overall positive, not perfect",
          "Contenu": "Overall positive.  That said I was unable to reach the site to trade from last Thursday night through the following Saturday.  As I understood explanation provided by the Technical Support Representative, security software added to the platform caused the problem.  By the time the situation was resolved the price of cryptos I planned to buy had risen, so I paid more than I would have had I been able to reach site when I received Error 1020, Access denied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marvin Marks",
          "Nb_Reviews": 2,
          "Date": "2021-11-03T22:48:44.000Z",
          "Titre": "I see hand proper process. Looking forward to a very messages on the site.",
          "Contenu": "The process of transferring money from one trustee to I trust what is relatively simple and straightforward. I kept me informed of the steps. The shortcoming I see today is no limit orders or stop loss capability. I was told this will be happening before the end of the year. That would give them a five"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "eric murphy",
          "Nb_Reviews": 3,
          "Date": "2022-02-09T18:54:42.000Z",
          "Titre": "All good except for transfer times.",
          "Contenu": "Pretty easy setup which is nice and no fees should be the standard but the time it takes to get funds into platform is pretty bad.  Most accounts I have credit the transfer same day (etrade, crypto.com, voyager, etc etc all allow use of funds upon transfer)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dean Schilling",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T10:27:56.000Z",
          "Titre": "It takes to long to move funds...I…",
          "Contenu": "It takes to long to move funds...I would rather just have a simple ach direct transaction from bank to my Itrust account.  Crypto people want fast, simple and less fees.   I dont mind paying the monthly fee but do not agree with the inflated price of the asset coupled with the high transaction fee to trade within.Dean"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BobN",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T15:34:35.000Z",
          "Titre": "iTrust Capital experiencing rapid growth",
          "Contenu": "Given iTrust Capital rapid growth, I will excuse the difficulty with setup and purchasing. A rep tells me that they have 30 additional employees coming on next week. They say that they intend to make limit trades and staking available. I experienced 1% slippage in addition to 1% trading fee due to lack of limit order availability. Staking is income that should not be foregone. Roth IRA conversion took a couple days longer than promised, during which time I was unable to trade. I have asked for transaction records on my Roth IRA conversion, not immediately available. I expect all these will be taken care of with extra diligence on my part."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Looker",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T00:52:45.000Z",
          "Titre": "Very cleaver Team ..",
          "Contenu": "Great so far .Zack and the team had help me get through this process fairly easy , considering I made a rather stupid mistake when  pulling my funds from the previous investment firm .. great explanation In regards  to the difference between Roth and traditional . Then Found  a solution for my mistake. Seems  to be a great start .."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2021-08-15T12:35:54.000Z",
          "Titre": "Pretty happy with the service",
          "Contenu": "Pretty happy with the service. They were excellent moving my money from my original 401k. The website is very easy to use and to sell and trade. I'm not thrilled with the 1% fees every single time to trade which includes both selling and buying, this adds up if you do much movement in your account. I'm very happy to be able to put my 401k in crypto, so all in all it is worth it for sure. Just lower the trading fees, or only do it on the buy and not the sell would be nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Willis",
          "Nb_Reviews": 1,
          "Date": "2021-12-09T19:31:39.000Z",
          "Titre": "Great customer service but lagging in technology",
          "Contenu": "Great customer service and a very powerful product. I am waiting for many needed updates on the technology end and the ability to contribute any dollar amount (currently $1000 min) and they need to increase the speed of ACH transactions which are currently taking two weeks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben & Whitney",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T16:49:08.000Z",
          "Titre": "Great experience!",
          "Contenu": "Great experience and fast setup! The only improvement needed is more coins options and adding the ability to stake. Adding these two things would easily make this a 5 star experience! However, the company is great and in comparison to the market a leader in the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Caban",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T22:52:10.000Z",
          "Titre": "I would have gave ITrust capital a five…",
          "Contenu": "I would have gave ITrust capital a five star, but I would have liked the package of IRA and Roth IRA in one fee per customer. I would have transferred my Roth IRA to ITrust but I would have had to spend twice as much in fees. Please fix this so I can feel confident to transfer all my Roth IRA money over."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn Lewis",
          "Nb_Reviews": 4,
          "Date": "2021-11-22T23:03:56.000Z",
          "Titre": "iTrust Capital is a great crypto…",
          "Contenu": "iTrust Capital is a great crypto platform for retirement and one of the cheapest options available but I’d definitely be really excited when we can start to earn passive income on our owwned crypto. Hope that is a possibility soon! Thanks iTrust Capital-Shawn M. Lewis"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric J",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T18:25:35.000Z",
          "Titre": "I have found the site is easy to work…",
          "Contenu": "I have found the site is easy to work with once I had funded the account. Buying and selling is simple and it up-dates quickly using the dashboard to refresh. Happy getting started with crypto options available but it would be nice to see more added in time. Eric J"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William White",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T19:40:33.000Z",
          "Titre": "Thus would be 5 stars in everything …",
          "Contenu": "Thus would be 5 stars in everything  but price.Several people  I have spoken to about iTrust have baulked at the amount of the monthly fee especially  if the have both a Traditional IRA &a Roth.Beyond that, I am very pleased.  Wish I have made the move earlier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian C",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T13:59:52.000Z",
          "Titre": "A Few Bumps Getting Started, Then Smooth Sailing",
          "Contenu": "Had a minor issue during application, 3 requests for support, all unanswered for days.  Slow funding of account after bank withdrawal (6 days).  Had me nervous.  Once able to get down to business, site is easy to use and very clear info."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy J Knode",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T18:35:31.000Z",
          "Titre": "Problems with Contributing",
          "Contenu": "I decided to open up an IRA with iTrust because the company was recommended by several different trustworthy people. I was able to open an account fine, but the website does not seem user-friendly. My contribution for 2021 went through okay, but I've tried to contribute for 2022 and nothing has happened. I've made the request through the \"Contribute\" button several times, but there has been no response. I was able to start a transfer from another IRA that I have through another institution, and I did receive an email saying that my request was successful, but it would have been nice to get a notice right after I made my request to let me know that it had gone through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Neubert",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T20:01:19.000Z",
          "Titre": "So far so good",
          "Contenu": "This is a great app for setting up a digital IRA.  My main concern is the communication between user and the exchange. If you have a specific question, timeline or technical issue it's almost impossible to actually talk to someone.  It took over a month to make a simple cash transfer to fund my first account - simply because a wire transfer was not requested.  The second funding was crypto only, again the instructions for doing this were vague and misleading but I was assured that the proper forms would be sent \"soon\". Still waiting but once it transfers, I will be a happy camper again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jens",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T19:52:06.000Z",
          "Titre": "The Service is straightforward",
          "Contenu": "The Service is straightforward; download Itrust app, and provide the necessary information to open an account. Fund the account; Itrust provides several options to do this; personal check, wire funds, rollover of eligible 401k, etc. This is my first IRA roth account, I did not find it complicated.  You can buy and sell crypto for cash, however, one can not trade between crypto. One has to convert an asset back to cash first, and then buy the new asset with the cash earned from the sale, or contribute more funds to the account. One buys assets at market rates, there is no spot trading within the account.  Fees seem reasonable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 1,
          "Date": "2022-02-23T17:39:21.000Z",
          "Titre": "Patience paid off.",
          "Contenu": "It was a very difficult process to get my Ira rolled over into  ITRUSTCAPITAL. However it was worth the wait. Purchasing crypto is super easy and affordable compared to other crypto Ira's. I'm glad I made to switch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ED",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T17:46:44.000Z",
          "Titre": "I just started a Roth IRA on…",
          "Contenu": "I just started a Roth IRA on itrustcapital, so far everything is working out great. I was a little concerned at first because it took a few days longer for my initial investment to deposit into my account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Tobias",
          "Nb_Reviews": 1,
          "Date": "2021-08-06T18:48:33.000Z",
          "Titre": "Overall great service and low cost; missing interest accounts",
          "Contenu": "Overall great service and low cost. I think ITrust should start focusing on interest baring accounts for clients and even becoming validaters in crypto networks. Being part of the network for each crypto they support I think is important for the future of the space."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter J",
          "Nb_Reviews": 2,
          "Date": "2021-08-10T05:36:07.000Z",
          "Titre": "It keeps getting better",
          "Contenu": "I'm editing this review to make it even better. I had a great experience signing up and the interface is easy and clean, but I was a little confused on the timing and logistics of funding. I chose \"schedule a call\" from the help menu and schedule a 15 minute window for my call to be done 2 days later. They sent multiple texts reminding me and they called right on time. I asked questions about the fastest way to fund, could I open 2 IRA's and what were their future plans for staking. The rep was helpful, smart and concise.  REALLY happy with the experience so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wesley Calloway",
          "Nb_Reviews": 2,
          "Date": "2022-06-30T20:17:13.000Z",
          "Titre": "We would like to see Staking on the…",
          "Contenu": "We would like to see Staking on the Tokens that allow them. This way we continue the build wealth, Also since you charge us a monthly fee can you remove the 1% trading fee?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T01:22:29.000Z",
          "Titre": "Awesome but need staking / passive income",
          "Contenu": "Your personnel are top notch and super responsive.  Everything is great however staking and passive income earning like most brokerage exchanges is what’s missing.  Full 5 stars and I’ll convert my friends as soon as you can get that!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Martin Russick",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T19:39:13.000Z",
          "Titre": "Thank you for your help setting up our…",
          "Contenu": "Thank you for your help setting up our IRA accounts. It took a while to find these and get all materials sorted out. Happy to be invested in our future. Counting on more of your great assistance on the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JackieS",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T02:47:34.000Z",
          "Titre": "I have loved the customer service so…",
          "Contenu": "I have loved the customer service so far. Really great! Very responsive. Thank you! Only a few negatives....I didn't love the fact that I had to use a separate email to create a traditional IRA. (I already had a Roth with iTrust)Also, I would have loved to have seen more options to choose from, like Vechain. But maybe that's coming! (I know you're still new)And lastly, but perhaps most importantly, I'd really like to stake my DOT, Tezos, and ADA, even while it's in my iTrust account. I'm hoping that will happen soon, too.All in all, I am pleased thus far, as I know it's a new company. 😀"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 3,
          "Date": "2021-11-08T17:23:30.000Z",
          "Titre": "Excellent site for amateurs like myself",
          "Contenu": "Excellent site, especially for an amateur like myself. Plenty of enticing cryptos to choose from and I like the ability to trade into bullion if I want. Having to turn my phone sideways to see my balances can be problematic at times."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MJ",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T18:54:09.000Z",
          "Titre": "SImple & Easy to Use",
          "Contenu": "Had some delays in getting account set up but it has been smooth sailing since. Very simple to use. Good selection of coins to choose from. No technical data on coins, so you have to find that information elsewhere."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew Ryan Hill",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T00:23:05.000Z",
          "Titre": "Although it took some time to get…",
          "Contenu": "Although it took some time to get approved, when I complained your customer service ready came through for me and got me approved. Since I am only 18, I plan on being a very long term customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig Wortman",
          "Nb_Reviews": 2,
          "Date": "2021-11-01T19:13:10.000Z",
          "Titre": "It's going great so far",
          "Contenu": "It's going great so far. Super easy interface and genuine scheduled customer service. I'm just waiting for the ability to stake which has been mentioned to be arriving this year. That will be the fifth star game changer..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ajit  Vasudevan",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T16:57:22.000Z",
          "Titre": "The hold time for a check issued by…",
          "Contenu": "The hold time for a check issued by another large financial institution is unreasonable. Why the 3 day hold? Its ironic that to invest in crypto one has to wait for 3 days for their own funds!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Boobie the Boomer",
          "Nb_Reviews": 1,
          "Date": "2022-01-08T10:39:18.000Z",
          "Titre": "Easy transfer",
          "Contenu": "I just moved both a traditional and a Roth IRA to ItrustCapital. They were very responsive to any questions and concerns I had about the transfer process.Trent was instrumental facilitating these transactions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Etienne D'Aunay",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T20:34:49.000Z",
          "Titre": "Website is moving in the right direction",
          "Contenu": "Excellent choice to drop the monthly fees. Between the 1% trading commission and the \"spread\" on the price, iTrust is doing just fine. Next up - needs the ability for LIMIT orders ASAP! (Will be a HUGE timesaver for me not to have to monitor prices constantly.) Dollar cost averaging (recurring purchases would be a nice touch. Also, I'm worried, when the time comes to sell, that restricting trading to ONE order at a time will NOT be good! Please add the ability to submit multiple orders simultaneously or, at least, add a SELL ALL function either at the coin level or the portfolio level. I could go on but let's get these taken care of and then reevaluate and move forward. :-)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marilu Loera Knorr",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T02:05:19.000Z",
          "Titre": "Wish you were Bitcoin only."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Walter Dusseau",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T16:52:15.000Z",
          "Titre": "It would be nice to be able to call and…",
          "Contenu": "It would be nice to be able to call and talk to somebody a little faster. And more information on the website for me to access like how much I contributed to last year and or this year to my Roth"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T01:27:30.000Z",
          "Titre": "Great platform with slow on-boarding",
          "Contenu": "The experience thus far has been fairly smooth. This would be a 5-star rating if it were not for the 3+ week fund transfer timeline (delays on iTrust's side, not Vanguard who was transferring the funds)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. Fulkerson",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T17:22:41.000Z",
          "Titre": "Excellent platform, lack staking for now",
          "Contenu": "Great customer service, easy transfer and trading platform.  I very pleased with iTrustCapital.  I would like to see staking options apparently coming in 2022 and more coin options, especially ETH coins."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick L Mutchler",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T19:32:07.000Z",
          "Titre": "New Customer",
          "Contenu": "Customer service is great..Its nice to be able to talk to people in person and not just email..not sure yet how to withdraw money without being linked to a bank..Or if thats even an option at this time.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula",
          "Nb_Reviews": 8,
          "Date": "2023-12-14T02:56:35.000Z",
          "Titre": "I have been using I trust capital for…",
          "Contenu": "I have been using I trust capital for about 3 years. They have been absolutely awesome. Customer service has been excellent. Recently I worked with Trent on the situation and he has been superb answering all my questions and addressing an issue that came up with my Ira accounts. He has also been very timely whenever I had an issue to address it within 24 hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduard Richter",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:53:20.000Z",
          "Titre": "Access to account",
          "Contenu": "I was not able to go to my account. More than one month I repeatedly send requests to fix it. Nothing happen. Than I worked with Jimmy Herrera on my wife’s account and I told him about my account problem. It was resolved in two days.Than you Jimmy.Excellent rating is for Jimmy’s work.Rating for service before it is less than one star."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:39:00.000Z",
          "Titre": "iTrustCapital is still reachable by…",
          "Contenu": "iTrustCapital is still reachable by phone in these days and age.  That's a big plus for me as for anyone.  Any issues are handled quickly by a live person.  I'm personally happy with Megan of Customer Support.  She's thorough and quick problem solver.  I feel my account is safe at iTrustCapital with their account handling procedure. I'd recommend iTrustCapital to friends and family."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Elliott",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T21:58:24.000Z",
          "Titre": "Working with Jimmy again…",
          "Contenu": "Working with Jimmy again was a pleasure. He’s personable, professional and proficient. We accomplished all that we needed to do and well within the scheduled and allotted timeframe."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Gomez G",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T21:30:58.000Z",
          "Titre": "Jimmy was amazing",
          "Contenu": "Jimmy was amazing, he helped with a distribution and made it quick seamless and he had a lot of patience.  Itrustcapital.com has made my retirement transactions very easy and handled my crypto security the way it should be.  Big Thank You to Jimmy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Crick",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T21:15:01.000Z",
          "Titre": "I had a great experience with ITRUST Capital",
          "Contenu": "I had a great experience. Jimmy Herrera was kind and knowledgeable and he took care of my request expeditiously. It was pleasant and to the point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Murria",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:39:10.000Z",
          "Titre": "iTrust Team synonym = OUTSTANDING!",
          "Contenu": "One word for the iTrust team...OUTSTANDING! As a novice Crypto IRA holder, Megan Semel was one of the first team members to kindly help me navigate this new space. As I was anxious about investing a large portion of my retirement savings, Jared was knowledgeable, prompt, and reassuring. Kudos to Anthony, who ensured prompt routing of my rollover check once he received it from UPS. Adam was cordial and ensured that I new the approximate time and date my funds would be available, and he was spot on. And last but certainly not least, the most interactive and caring of all was Jared, who coddled me through the entire process as if I were a close family member, and he should be commended, deserving all accolades available to bestow on him. I'm more than satisfied with my iTrust experience to date and would recommend them to anyone seeking a comfortable retirement haven. From a Retired U.S Marine, OOHRAH and SEMPER FI iTrust Team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:16:43.000Z",
          "Titre": "Jimmy was very knowledgeable and…",
          "Contenu": "Jimmy was very knowledgeable and friendly…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Dunham",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:14:28.000Z",
          "Titre": "Great experience but be patient!",
          "Contenu": "This was my first time making an in-kind transfer out of my inherited IRA. The process takes a little extra time for paperwork and verification procedures but it's all for legal and safety reasons. Once that was done, I just had to wait for my crypto to transfer to my wallet. There seemed to be a small delay in the transfer but my ITRUST rep Jimmy Herrera responded to my concerns and said he was checking on the delayand would let me know when the transfer went through. 4 business days after my verification call the the crypto was in my wallet. Thank you Jimmy for time and effort! You're a Rockstar!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Murphy",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:59:22.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Mustafa answered my questions giving me confidence to move forward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruth McLaws",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T21:12:23.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "I called to find out how to access a document I needed to sign. Rather than try to explain it step-by-step, Ryan said “I’ll just send you a link and you can download it”. That was a tremendous help. ITrust customer service is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Elliott",
          "Nb_Reviews": 4,
          "Date": "2023-12-04T20:53:37.000Z",
          "Titre": "Jimmy is on the ball",
          "Contenu": "Jimmy took care of everything I needed in a professional and courteous manner with the means to follow up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sulene Krause",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T22:19:07.000Z",
          "Titre": "Jimmy was very prompt and helpful",
          "Contenu": "Jimmy was very prompt and helpful. He called a bit earlier than scheduled to see if I was available so he could process the funds today before closing! Way to think ahead for the benefit of the customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Carozza",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T20:37:07.000Z",
          "Titre": "3 IRAs Opened",
          "Contenu": "I have moved 3 IRAs from other custodians to itrustcapital and up until the third transfer things always ran smoothly.  I ended up working with Trent to resolve the issue with my latest transfer and was able to fully fund another IRA with itrustcapital.Trent did a fantastic job explaining the behind the scenes challenge(s) I was dealing with and then walked me through a couple of options for a speedy resolution. Trent exemplifies the type of quality customer support that I wish all other financial organizations had on their side. Thanks again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EDK",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T18:45:46.000Z",
          "Titre": "Working with iTrustCapital was smooth…",
          "Contenu": "Working with iTrustCapital was smooth and easy. Trent and the others I spoke or emailed with were able to help me get set up quickly with little to no complication. Once the account was funded my investments were executed without issue and in a very timely manner. Very, very happy with my choice to use their services."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T01:23:57.000Z",
          "Titre": "Great Customer Experience!",
          "Contenu": "I was pleasantly surprised today when Trent was able to speak with me in an extended conversation and address all my concerns in detail regarding their ability to secure my crypto. iTrust sets itself apart by their ability to get on the phone and intelligently address any and all questions a client might have! I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T12:06:24.000Z",
          "Titre": "My first experience with ITrustCapital",
          "Contenu": "Trent’s professionalism coupled with his sincere desire to help customers shined as he took the time to listen patiently to my multitude of questions. He addressed each question, and he recommended that I speak with a tax advisor for my specific IRS Tax Law scenarios.  Trent’s personable, extremely patient demeanor and pleasant voice helped me feel comfortable with the options I chose for my current scenarios, and my decision to choose ITrustCapital.  Thank you Trent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Moses Mbong",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T20:05:30.000Z",
          "Titre": "Lightening-fast response time.",
          "Contenu": "The response time was lightening fast! “I didn’t see that coming.” The agent guided me step by step through the whole process. He was incredibly patient and informative, making sure I understood every detail. Loved it and yes! I would recommend them any day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zann Faust",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:04:56.000Z",
          "Titre": "Jimmy, my advisor was amazing!!",
          "Contenu": "Jimmy!....He was so patient and helpful with me today. I was not feeling well for our call and he still made it easy and simple for me to complete my transaction. Jimmy gets 10 stars! ITrustCapital does a wonderful job as well...highly recommend them all the way around!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arlene B",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T21:08:24.000Z",
          "Titre": "Everyone is so professional and courteous. …",
          "Contenu": "Everyone is so professional and response to all my inquiries we’re responded to quickly, in a timely manner. Jimmy Herrera was very professional and courteous. He answered all my questions and provided guidance through my distribution request process. Thanks also to Sharon Kim. Amazing and flawless. What a great team!  I refer my friends here for their crypto IRA Thank you, iTrust Capital. Best,Arlene"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T19:13:39.000Z",
          "Titre": "I just sign up a week ago",
          "Contenu": "I just sign up a week ago, and a couple mistakes was made on my transfer form, which stopped my process a little. I got in touch with an iTrustCapital Team Member by the name of Trent. He was very involved and communicated with me through text and calls to make sure everything is good with updates and reaching out to let me know if anything he could do to help he's just a text or call away. He is A1 and showed Great Customer Service, Patient, Nice, and Communication. Every company needs a person like Trent and that's Honest Talk!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "larry Shepperson",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T02:23:33.000Z",
          "Titre": "In this crazy world we live in today…",
          "Contenu": "In this crazy world we live in today you can never imagine what a customer is going through.The team at itrustcapital must know something about that bcause their customer service screams we are the best,professionalism and just curious and prompt service.Adam Fote,Daniel Bennett and I think Mark gave me the best experience I had in a long time. Especially being after normal work hours they got me rolling in minutes. Please tell the fellows Thanks aand keep up the great work.....Go Team"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "vava",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T12:47:42.000Z",
          "Titre": "I have a crypto IRA with ITrustCapital",
          "Contenu": "I have a crypto IRA with ITrustCapital. They provide seamless support.  It is very easy to get their staff to help with technical, funding or conversion issues.  Support staff is friendly and easily available. The platform is pretty easy and intuitive to use.  Their fees are reasonable. I have had a great experience with them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jackm mascitis",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T02:05:28.000Z",
          "Titre": "My experience with iTrustCapital has…",
          "Contenu": "My experience with iTrustCapital has been amazing. I scheduled a verification call to confirm a withdrawal and was very pleased with the way it went. Jimmy called exactly when he was supposed to and the call took only about  5 minutes. I received a follow up call from Jimmy later in the day to inform me that a wire transfer was needed instead of the direct deposit we had set up. He wanted to make sure this was ok with me. End result is that when I decide it's time for another withdrawal I'm hoping Jimmy is the Rep I will be dealing with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T02:33:09.000Z",
          "Titre": "Jimmy Herrera and Gladis Miranda are excellent",
          "Contenu": "Gladis Miranda, and Jimmy Herrera helped me. I was very impressed with the speed and efficiency of the execution of my full in-kind distribution. Gladis sent me prompt emails at every step that explained the process and what I needed to provide and sign. A micro amount was sent to my crypto wallet within a few days of my original request, and on my confirmation of receiving it Gladis sent me the link to schedule my phone consultation to confirm my identification and authority. I was able to get an appointmenr the very next day. Jimmy Herrera was very competant communicative, and eased my security concerns. All my crypto metadata was confirmed in a way that protected my privacy while  ensuring a solid transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catalina Zabala",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T14:27:53.000Z",
          "Titre": "Verification went well and Jimmy is…",
          "Contenu": "Verification went well and Jimmy is very clear with his instructions and answers my question very well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre A.",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T01:53:42.000Z",
          "Titre": "5 Star Service",
          "Contenu": "I needed some assistance and I used the message feature on the iTrust Capital website. Within a few minutes I received an email from a team member named Adam. I had additional questions and requested a call. A team member named Megan called me within minutes. She was knowledgeable, professional, and friendly and answered all of my questions. That's great customer service. Thank you Adam and Megan!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Christopher Vangjel",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T00:14:01.000Z",
          "Titre": "Fast service",
          "Contenu": "I called and was able to talk to a representative relatively quickly. They offered me a course of action to fix my problem and a very short time later provided the necessary documents via email. I had a question which was answered relatively quickly via email. And upon completion of my actions, the issue was resolved. All of this took about half a day. Megen Semel was also very professional, polite, and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Machwis",
          "Nb_Reviews": 3,
          "Date": "2023-09-28T18:14:46.000Z",
          "Titre": "Account funding",
          "Contenu": "Danielle and her team at ITrust were very helpful in deconflicting several issues I encountered in executing a fund transfer from my 401k to my iTrust account. Couldn't have done it without them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Sarp",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:05:36.000Z",
          "Titre": "Nadia is splendid!",
          "Contenu": "Nadia is great with timely responses while remaining accurate. She proactively starts the process and provides direction on what's needed to complete the process. Several times she took my email request and helped my bypass trivial stages to get to the meat/bones. She's definitely a part of the strong and exceptional service iTrustCapital delivers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel B",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T02:27:40.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I put in a special request while doing a ROTH conversion and Nadia Reyes provided outstanding customer service.  Thank you iTrust - your customer service is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Parecki",
          "Nb_Reviews": 4,
          "Date": "2023-07-09T23:41:36.000Z",
          "Titre": "I love ITrust Capital Customer Service",
          "Contenu": "I love ITrust capital!! They are the best retirement platform for a crypto investor and I have been with them for three years. The customer service at ITrust is the best!! I want to thank Nadia for all her help with her quick response to my Roth conversion needs. I also want to mention Zach who is also one of the best members at ITrust. I am looking forward to a long and a prosperous relationship with the ITrust Organization!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Myles Cirillo",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:18:25.000Z",
          "Titre": "Wealth of information",
          "Contenu": "Trent has been a great help to me from the beginning. Had problems moving funds from my IRA to iTrust and he helped every step of the way. Always available for questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny B",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T00:19:08.000Z",
          "Titre": "Mark Morales is great he went above and…",
          "Contenu": "Mark Morales is great he went above and beyond to make sure my distribution was done correctly and as soon as possible.  Mark goes above and beyond for his clients and I will definitely use them again because of him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alden Shorter",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T22:35:24.000Z",
          "Titre": "I can't say enough about this iTrust…",
          "Contenu": "I can't say enough about this iTrust Capital and its amazing customer service. You get to know the true integrity of a company once you're signed up and they have your money. iTrust continues to exceed my expectations. Trent, Megan and Adam are all exceptional and have gone above and beyond to help me. Thank you all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T21:53:08.000Z",
          "Titre": "Danielle was Exceptional",
          "Contenu": "Danielle was Exceptional and a pleasure to work with and I will continue to request Her personally as I invest with itrust capitol. As we look for alternative asset classes to diversify and hedge in an ever changing economic climate, it is comforting to know I have Danielle and Her itrust capitol team to lean on❗️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe W.",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T22:29:06.000Z",
          "Titre": "IRA Transfer",
          "Contenu": "I didn't know how to initiate an IRA inheritance from one iTrustCapital account to another. I called Customer Service and was directed to Megan Semel.  Megan did a great job of walking me through the steps and helping me to accomplish the task. Thanks Megan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Callison",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T18:22:55.000Z",
          "Titre": "Mark was very knowledgeable",
          "Contenu": "Mark was very knowledgeable.  He explained fully the process and answered all my questions about a distribution .  Also he was pleasant to work with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T18:36:21.000Z",
          "Titre": "Awesome help from Megan",
          "Contenu": "I had trouble logging in, Megan contacted AT support while we are on the phone to have them send me the information so I could reset my password. Then she stayed on the phone with me the entire time while I was able to log in! She also  answered my questions about what was going on with A LG O. She was patient and did not make me feel stupid or rushed because I didn't know how to do things on my phone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt G.",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:16:58.000Z",
          "Titre": "Mark M, a great representative of the company",
          "Contenu": "Mark M. is an asset to this company. He provided service and professionalism lacking in many other businesses out there. Based on my experience with him and seeing the security measures taken, I feel my business is best served here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tami Bartley",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T23:34:08.000Z",
          "Titre": "My service agent Megan Semel was very…",
          "Contenu": "My service agent Megan Semel was very helpful and assisted me with the process. I dont think I would have had a positive experience if she had not been so patient and diligent with answering my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MICHAEL LEONE",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T22:23:55.000Z",
          "Titre": "My representative Shawn was very…",
          "Contenu": "My representative Shawn was very helpful with getting my funds transferred over from my other account. He took control with follow-ups and made the process so much easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 6,
          "Date": "2023-09-08T20:24:30.000Z",
          "Titre": "Great Company and great people",
          "Contenu": "I was needing to change some things in my ITrust Roth IRA, Mark was very patient and helpful, a great experience. Definitely recommend these guys for you IRA needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Stamm",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:03:31.000Z",
          "Titre": "Jimmy from ItrustCapital was very professional",
          "Contenu": "Jimmy was very professional in asking me questions, I felt the time went by quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Zuanich",
          "Nb_Reviews": 5,
          "Date": "2023-07-11T01:35:25.000Z",
          "Titre": "I am big believer in iTrust Capital…",
          "Contenu": "I am big believer in iTrust Capital business to help me save for the future.  Recently Daniel on their service team helped me with a complex air drop of a new asset.  They handled everything perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lidia Lovin",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T04:17:24.000Z",
          "Titre": "I cannot tell how much help I have had…",
          "Contenu": "I cannot tell how much help I have had from Megan who guided me step by step how to proceed to get the right forms filled in  She was patient and professional and took her time to help finishing the application  Each time I have called back she was always answering me back and helped me to solve the case I need one more form from the court and I will attempt to send all the documentation necessary to solve compliantly the problem Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "H",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T21:36:34.000Z",
          "Titre": "Great company! I love Jimmy!!!",
          "Contenu": "Great experience with customer service team. I worked with Jimmy, one of the most efficient customer service reps ive ever talked to. I missed our scheduled call and he went out of his way to let me call back the same day and get my transfer initiated. Jimmy is awesome, and this company has been a great to me.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Baccoli",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T21:28:07.000Z",
          "Titre": "Megan and Trent rock",
          "Contenu": "I was most recently helped the last couple of days by Megan Semel. Both Megan and Trent have helped me feel comfortable with my transitioning to your company. These are patient, lovely young people who will definitely go far in your company. I’m not exactly tech savvy so I appreciate their patience. Thank you for helping me get my money to your company. It’s refreshing to find young people who are so passionate and professional about their jobs. As a retired high school teacher, It puts a smile on my face to know that there is hope in the young people. God bless all of you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shane",
          "Nb_Reviews": 5,
          "Date": "2023-05-25T22:08:42.000Z",
          "Titre": "I love that I can trade within the…",
          "Contenu": "I love that I can trade within the account, including crypto and metals.  Whenever I need to do a distribution Jimmy always takes care of me and makes sure I get the funds asap.  He does above and beyond. Great customer service from itrust so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Faith",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T18:31:37.000Z",
          "Titre": "Excellent experience with Megan at iTrustCapital Support",
          "Contenu": "When I contacted iTrustCapital Support, Megan responded immediately. She walked me through the process of establishing my account, transferring funds from my old account and completing the beneficiary forms. None of this looked easy to me, but Megan held my hand! I am very appreciative for iTrustCapital and the fine folks working there. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T06:44:24.000Z",
          "Titre": "5 STAR Service",
          "Contenu": "Excellent customer service both setting up account and getting my distribution to cash out.  I worked with Jimmy on my distribution and his service was outstanding. He made the process easy and efficient. 5 Stars!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teacher Blake",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T18:10:58.000Z",
          "Titre": "Jimmy has been super helpful",
          "Contenu": "I've had to take a few distributions over the last couple weeks and Jimmy has been very helpful through the whole process. Everything is streamlined and I got all of my distributions quicker than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Madsen",
          "Nb_Reviews": 3,
          "Date": "2023-08-11T15:48:02.000Z",
          "Titre": "ITrust is so much easier and less…",
          "Contenu": "ITrust is so much easier and less expensive than bitcoin ira who I originally moved a traditional ira into only to find that the requirements to generate interest change often and that they were charging me $20/month just to hold my dwindling savings (I was paying monthly while no interest was gained at all). Moving over to iTrust was a no brainer, the fund transfer was fairly straightforward though I did have questions that their support helped with very quickly (thank you Gladis Miranda!). I’m kicking myself for not starting with iTrust Capital but am happy now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2023-10-06T19:24:40.000Z",
          "Titre": "Every time I call customer support they eager to help.",
          "Contenu": "Every time I call customer support they are efficient and helpful.  I was having difficulty transferring funds into my iTrust Capital account.  Ryan Davis helped me to complete the transfer.  He was diligent, persistent and professional during the entire process.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max Moore",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T17:41:45.000Z",
          "Titre": "I phoned the customer service line as I…",
          "Contenu": "I phoned the customer service line as I was receiving an error message each time I attempted to place an order. Trent (the customer service representative who took my call) was able to work with the ITC IT team and within 30 minutes of my initial call everything was working properly and I was able to execute my transactions before any price increases. My experience with ITC, and especially Trent have been outstanding. I am a very satisfied customer and I highly recommend ITC for Crypto IRAs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Endyne At",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T23:10:49.000Z",
          "Titre": "Wonderful and quick service",
          "Contenu": "Wonderful and quick service! I spoke to Jimmy Herrera and he called and gave me an earlier appointment when he had time in between other calls to make sure I was taken care of! Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sydney Mattern",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T22:12:03.000Z",
          "Titre": "Jimmy at iTrustCapital helped me with a…",
          "Contenu": "Jimmy at iTrustCapital helped me with a transaction recently. Thanks to Jimmy, the transaction was seamless. I would describe his manner as friendly and professional. iTrust protocols are dependable and Jimmy is exceptionally helpful. Good business, good people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lillian Briggs",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T19:54:52.000Z",
          "Titre": "Agent Jimmy called a bit early...",
          "Contenu": "Agent Jimmy called a bit early, which to me means right on time!He was totally prepared, professional, and as personable as he was efficient.I am very pleased to have done business with him.Well done Sir!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Manriquez",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:08:18.000Z",
          "Titre": "Mark Morales - Excellent Service!",
          "Contenu": "Mark Morales was very helpful with sorting out our distribution error, he was fast and efficient in resolving the issue and provided his direct number for further follow up and better communication, which I ended up needing. Very friendly and cordial as well. Thanks Mark!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill An",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T23:28:54.000Z",
          "Titre": "Jimmy was very helpful",
          "Contenu": "Jimmy was very helpful, insightful and kind. It all adds into how wonderful it is working with the iTRUST team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Poepard",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T02:02:32.000Z",
          "Titre": "Great company",
          "Contenu": "Itrust has excellent customer service and I want to thank Jimmy and Carol for their help and support.  I have been with this company a couple years and they are awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NF",
          "Nb_Reviews": 3,
          "Date": "2023-07-21T19:58:06.000Z",
          "Titre": "This company and CS Team is on top of…",
          "Contenu": "This company and CS Team is on top of it!  They were very responsive to questions for funding and the Roth Conversion process, Nadia was super efficient and got everything coordinated and completed quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Branch",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T23:28:46.000Z",
          "Titre": "Came upon hard times and had to dip…",
          "Contenu": "Came upon hard times and had to dip into the 401k. Not only had I trust capital than a great place for our 401k, but also made the process smooth of dipping into it. We appreciate Jimmy helping us out so well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Favored Blessed",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T23:45:40.000Z",
          "Titre": "Excellent Experience Working with Mark Morales!",
          "Contenu": "Mark Morales was absolutely Amazing and caused the process to be seamless. He was very professional, kind, attentive, and patient! I would highly recommend working with him if you get the opportunity! Stellar service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yamil Rendon",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T19:15:43.000Z",
          "Titre": "Mark Morales was extremely helpful",
          "Contenu": "Mark Morales was extremely helpful. He made my withdraw experience seem like I was getting coffee at Starbucks. Great job!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Lenoir",
          "Nb_Reviews": 7,
          "Date": "2023-10-05T17:57:41.000Z",
          "Titre": "Patient and Thoughtful",
          "Contenu": "Ryan took great care to see that my rollover was proceeding as planned and was willing to answer any questions that I had.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Wang",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T21:50:02.000Z",
          "Titre": "Got really good timely professional…",
          "Contenu": "Got really good timely professional support from Megan Semel of iTrustCapital recently. I need update my address and beneficiaries on my account and she has provided me prompt support needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Bartz",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T21:42:46.000Z",
          "Titre": "Jimmy was very helpful and patient as…",
          "Contenu": "Jimmy was very helpful and patient as this was my first experience with this procedure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jon hinton",
          "Nb_Reviews": 3,
          "Date": "2023-06-06T19:29:57.000Z",
          "Titre": "Jimmy was both professional and…",
          "Contenu": "Jimmy was both professional and knowledgeable.  After being with Itrust for almost 3 years I feel my retirement accounts are safer than most other institutions and the staff has always answered questions and concerns quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 3,
          "Date": "2023-08-02T23:01:26.000Z",
          "Titre": "Feel good about investing with this…",
          "Contenu": "Feel good about investing with this company. Live customer support is so very helpful and valuable! Specially a big Thanks to Daniel for the help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Goggans",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T20:20:16.000Z",
          "Titre": "Great job by Jimmy H. at ITrust Capital on verifying my request to transfer funds to my Bank Account",
          "Contenu": "Great job by Jimmy H. with ITrust Capital on verifying my fund request to my Bank Account.  Thanks for getting this done ahead of schedule!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruth McLaws",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T02:36:51.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Every time I contact customer service, I receive excellent support and Trent is exceptional. He does everything possible to help and is always extremely professional and pleasant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Rickman",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T16:54:53.000Z",
          "Titre": "Thank you Jimmy!",
          "Contenu": "Thank you Jimmy, for your clarity and efficiency! I appreciate your ability to shift when I missed a step and kept me on track. Very professional!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devon Beard",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T01:32:02.000Z",
          "Titre": "iTrust Capital is the place for Crypto IRAs",
          "Contenu": "Jimmy helped out with a distribution. Super helpful and fast support. Highly recommend iTrust Capital for managing a crypto IRA!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BIGGE",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T23:04:28.000Z",
          "Titre": "THANK YOU FOR YOUR QUICK RESPONSE DANIEL!!",
          "Contenu": "i asked a important question to me, and quickly Daniel Bennett answered my question with accuracy included account transactions date stamped, transaction#, amount that put me at complete ease. Thanks ItrustCapital and Daniel Bennitt!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Miller",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T00:57:23.000Z",
          "Titre": "Exceptional service",
          "Contenu": "I spoke with both Grant and Zach. They were very knowledgeable and helpful. They both walked me through my issues very professionally, a pleasure to work with! They both deserve raises!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Darrah",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T21:10:36.000Z",
          "Titre": "I want to thank Trent for his patience…",
          "Contenu": "I want to thank Trent for his patience and expertise in answering all my questions, and further onboarding with I Trust Capital … this is a big decision one makes in life and it helps to know you are working with someone knowledgeable like Trent. He has always been available many times throughout my decision making process’s and guided me in the proper direction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason R",
          "Nb_Reviews": 3,
          "Date": "2023-05-18T01:28:41.000Z",
          "Titre": "It was so amazing to have a live person…",
          "Contenu": "It was so amazing to have a live person answer the phone and happily help me through my issues and resolve them quickly in a timely manner and friendly service. Thank you Trent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Butan",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T07:24:09.000Z",
          "Titre": "IRA Transfer to iTrustCapital",
          "Contenu": "Did an IRA Transfer to iTrustCapital. It was a pleasure working with Nadia who answered all my questions and kept me posted until the process was complete. iTrustCapital rocks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Arra",
          "Nb_Reviews": 3,
          "Date": "2023-05-25T21:51:00.000Z",
          "Titre": "Jimmy went out of his way to make it…",
          "Contenu": "Jimmy went out of his way to make it very easy after the confusion with the first call and made it really easy for somebody who doesn’t know a lot about computers and phones to get it done. Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Tackett",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T01:48:16.000Z",
          "Titre": "Wonderful Company. Gladis M. and Jimmy H. are LIFESAVERS. Cannot thank them enough",
          "Contenu": "Best service all around. They have not once let me down nor have they ever not gone the extra mile. And if you're lucky enough to be assigned Gladis Miranda or Jimmy Herrara like myself, you will quickly see the outstanding service I am talking about. Gladis and Jimmy get it done! Can't thank them enough. A+++- Taylor"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiden Wright",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T01:51:50.000Z",
          "Titre": "Mark Morales and Trent Dolabson",
          "Contenu": "Mark Morales and Trent Dolabson are the absolute best. Helped me process my request with speed and ease. Excellent employees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T03:42:16.000Z",
          "Titre": "Received excellent service received.",
          "Contenu": "Received excellent service in getting my account set up from Mustafa and Grant. They were very patient and provided a very positive experience. I am very impressed with my overall customer support experience and will definitely recommend this company to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruben Chavez",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T22:28:04.000Z",
          "Titre": "Good customer service",
          "Contenu": "Jimmy was very helpful and took his time while he was giving me instructions with the transaction; thanks Jimmy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jai Gopal",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T03:04:54.000Z",
          "Titre": "Jimmy was great",
          "Contenu": "Jimmy was great. i was concerned about security and he addressed it swiftly and deftly.   Very efficient snd knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Skinner",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T20:00:58.000Z",
          "Titre": "Jimmy is Great!",
          "Contenu": "Jimmy was very helpful and made the whole experience fast and easy!  I look forward to future engagements with Jimmy and ITrustCapital. Thanks Jimmy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon LaRue",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T20:58:45.000Z",
          "Titre": "Couldn't be happier talking to a real support person that speaks English",
          "Contenu": "Calvin Lai is a rare combination of competentance, professionalism, and personality.  He solved my issues immediately, while at the same time holding an engagging conversaion.  His confidence is the main reason I am not currently pulling my crypto off iTrust given their current rummored Fortress Crypto \"issues.\""
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Ramos",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T01:24:57.000Z",
          "Titre": "Mark was awesome",
          "Contenu": "Mark was helpful, professional, efficient and patient with me in the process I was wanting to accomplish with iTrust. He made me feel very confident and comfortable that everything was being handled appropriately to suit my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James King",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T23:27:09.000Z",
          "Titre": "Definitely recommend iTrust Capital",
          "Contenu": "Mark was a great help and made the whole transaction quick and easy. Definitely recommend ITrust Capital."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RJM",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T19:12:11.000Z",
          "Titre": "Jimmy was very professional and guided…",
          "Contenu": "Jimmy was very professional and guided me through the quickest way to receive my funds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:18:17.000Z",
          "Titre": "Mark was awesome",
          "Contenu": "Mark was awesome! The distribution process was easy and he guided me thru every step of the way. Was a pleasant experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J P M",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:45:16.000Z",
          "Titre": "Excellence customer support",
          "Contenu": "Excellence customer support, easy to use platform, great communication, fair pricing.  Keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UpSpinCreek",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T19:24:32.000Z",
          "Titre": "Jimmy called promptly at scheduled time…",
          "Contenu": "Jimmy called promptly at scheduled time and was very helpful. I had a further question and he committed  to follow up by end of day. He’s a pro  👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pedro",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T19:41:26.000Z",
          "Titre": "I was being assisted by a professional…",
          "Contenu": "I was being assisted by a professional by the name of Mark Morales. He was clear and concise with the instructions. Made sure I was who I said I was. Everything went smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JSTWNDR",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T00:03:50.000Z",
          "Titre": "iTrustCapital made it easy to not only…",
          "Contenu": "iTrustCapital made it easy to not only deposit funds but also receive the funds.  The interface is clean and simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Reser",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T02:12:23.000Z",
          "Titre": "Excellent Support",
          "Contenu": "Mark Morales handled the verification call very professionally.  He was courteous and handled the minor issues that came up efficiently."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Gomez G",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T20:36:56.000Z",
          "Titre": "Itrust Capital is awesome....Both Gladis and Mark made the process…",
          "Contenu": "Both Gladis and Mark made the process for my Itrust Capital transaction seamless.  Glad to be a customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T19:50:14.000Z",
          "Titre": "On time for the appointment",
          "Contenu": "On time for the appointment, patient because I was not prepared as requested,  clear expectations and process. Answered all my questions well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Perry Cameron",
          "Nb_Reviews": 3,
          "Date": "2023-06-07T20:51:59.000Z",
          "Titre": "I’m very impressed with both Mark &…",
          "Contenu": "I’m very impressed with both Mark & iTrust Capital.  The distribution process has improved tremendously over the years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AC323",
          "Nb_Reviews": 5,
          "Date": "2023-05-31T19:27:13.000Z",
          "Titre": "Great service from Jimmy@iTrustcapital",
          "Contenu": "Great service from Jimmy@iTrustcapital, really helped me get my transfer completed in a timely manner."
        }
      ]
    }
  ]
}