{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "joby.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Josh Hamza",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T14:15:50.000Z",
          "Titre": "Customer service is rubbish",
          "Contenu": "Customer service is rubbish. Emailed requesting to send back an item so that I could purchase another larger MORE EXPENSIVE item from THEM, and yet heard nothing back. I cannot recommend this company whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "COL WIL",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:00:31.000Z",
          "Titre": "WARNING : ZERO CUSTOMER SERVICE",
          "Contenu": "WARNING: JOBY MAY HAVE SOME DECENT PRODUCTS, BUT THEIR FULFILLMENT / CUSTOMER EXPERIENCE \"TEAM\" (OUTSOURCED TO A COMPANY CALLED VIVENDUM) IS A COMPLETE DISASTER.  PLACED MY ORDER ON SEPTEMBER 5.  ITEM NEVER ARRIVED AND I'VE BEEN ASKING FOR A REFUND EVER SINCE.  5+ WEEKS AND COUNTING.  VIVENDUM'S REP KEVIN HAS BEEN ASSIGNED TO MY CASE AND HAS BEEN COMPLETELY USELESS.  I'VE WASTED A RIDICULOUS AMOUNT OF TIME TRYING TO GET A RESOLUTION.  I HAVE NO CHOICE BUT TO FILE A CLAIM WITH AMERICAN EXPRESS.  I WILL NEVER ORDER FROM JOBY AGAIN."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T02:02:33.000Z",
          "Titre": "Disappointed and tripod useless",
          "Contenu": "Purchased everpod flow for $160 and lost the quick release attachment. The tripod itself is cluncky and hard to use. When I tried to replace the part, Joby advised they don't have parts and gave me a like to a $55 substitute brand that wasn't even available online or instore. They then closed the case and that's all I got. I have a useless tripod I can't use. Do not buy these products, Joby doesn't care."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graham",
          "Nb_Reviews": 4,
          "Date": "2023-10-20T16:10:41.000Z",
          "Titre": "Not sure where the product actually is",
          "Contenu": "Not sure where the product actually is. Supposedly delivered somewhere according to the shipper (not sure where) and difficult to enquire as not recognising a login. Emailed and no response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed client",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T15:22:20.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service my package was delivered to the wrong address and they pretty much just told me oh well it wasn’t their problem"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristen L.",
          "Nb_Reviews": 3,
          "Date": "2022-10-01T07:34:15.000Z",
          "Titre": "Never received my item",
          "Contenu": "Never received my item. Purchasing from the site went seemingly fine, I was told I’d get an email upon shipping of my item. I didn’t receive an email -  but instead got a call the next morning from the delivery folks who said they were unable to deliver my item and to call to rearrange. When I called to rearrange they said they would call me back, never called back and now every time I call to rearrange delivery there is no answer.I emailed Joby about this to see if there was anything on their side they could do, and I’ve still not received any word."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Matty Bravo",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T15:29:57.000Z",
          "Titre": "Gorillapod Starter Kit",
          "Contenu": "Gorillapod Starter Kit is ABSOLUTELY CRAP, THE BALL HAS ALREADY BROKEN OFF, I have only had it about 6 weeks. IT WOULDNT EVEN HOLD MY NOTE 20 ULTRA, DONT WASTE YOUR MONEY ON THIS CRAP!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kit998",
          "Nb_Reviews": 4,
          "Date": "2022-06-19T17:37:52.000Z",
          "Titre": "Expensive express delivery to not even receive my order",
          "Contenu": "Placed an order for a gorilla pod on the 14th of June and also paid £12.95 for express (1-2days) shipping, I paid for this in hopes that I’d have my order by the end of the week ready for when I go travelling, tomorrow. But I am still to receive my order."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Nathan Ker",
          "Nb_Reviews": 4,
          "Date": "2022-07-11T07:15:15.000Z",
          "Titre": "Worst quality products and customer service",
          "Contenu": "Poor quality, wanted me to spend more on postage to send an item back than what the item was worth when I sent pictures of the item being clearly faulty"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T12:27:27.000Z",
          "Titre": "pay post by myself",
          "Contenu": "Product description make me confused to purchase a wrong item, then need I return it with pay post by myself."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "carrington saunders",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T21:06:10.000Z",
          "Titre": "I am yet to receive my parcel I…",
          "Contenu": "I am yet to receive my parcel I selected 1-2 days, I don't have it, what a disgrace."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Abdullah",
          "Nb_Reviews": 5,
          "Date": "2022-04-19T14:04:46.668Z",
          "Titre": "One part was missing",
          "Contenu": "One part was missing.I submitted complaint about it and still waiting from 2 weeks for the response.Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T20:12:25.000Z",
          "Titre": "Package didn't arrive on time",
          "Contenu": "Package didn't arrive within 7 days. Product is good though."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Albert",
          "Nb_Reviews": 4,
          "Date": "2022-09-14T20:35:46.000Z",
          "Titre": "Needs an update..it is unsteady for…",
          "Contenu": "Needs an update..it is unsteady for samsung s22 ultra."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brandon Zingoula",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T14:11:15.000Z",
          "Titre": "I haven’t received my item yet",
          "Contenu": "I haven’t received my item yet. Please deliver it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T03:06:47.000Z",
          "Titre": "The Black Friday package is completely…",
          "Contenu": "The Black Friday package is completely useless."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mav",
          "Nb_Reviews": 5,
          "Date": "2022-01-14T08:34:45.000Z",
          "Titre": "Poor Customer Service UK",
          "Contenu": "I have a Joby SLR which has been great until the joints became very stiff and made it impossible to use. I emailed customer service and they replied quickly offering me a small discount for a new unit. All I wanted was some advice from the technical dept and how to free the joints. When they found this out I wasn't going to buy a new unit, they said they couldn't offer advice and they couldn't help me. Useless really."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 4,
          "Date": "2022-01-19T11:57:31.000Z",
          "Titre": "Wrong item in box!!!",
          "Contenu": "I ordered a telepod mobile on Christmas Eve and it arrived a week later despite Christmas rush and I was very pleased however this was short lived as when I opened package it contained a camera back pack.I have called the number on my delivery note over twenty times but got answering machine every time I rang.there is no email address on there paperwork to contact them either.at present this situation is still unresolved.please contact me joby"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Helen Booker",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T11:25:56.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible. Ordered item 11th November, have never received it and it appears to have been returned back to them from the distributor. Have contacted them via a website and they are looking into it to confirm whether they can resend, but have been left in limbo in the meantime. Would love to talk to someone in person but doesn't seem to be an option."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Cameron",
          "Nb_Reviews": 3,
          "Date": "2021-12-08T12:32:17.000Z",
          "Titre": "So far not good",
          "Contenu": "So far not good, bought a Gorilla Pod 3K Pro. The top plate is loose and cannot be sopped from moving. I raised a support ticket, they told me to email manfrotto, so i did. No response. I then spoke to someone on their live chat, they told me to email manfrotto. So I did again. No reply from anyone. Faulty product and impossible to return or replace. I would buy from a high street shop so you can at least return.ticket: #TCK00664237order: PJBUK21000009971Purchased 16th November 2021Will update if they ever get back to me and try to resolve it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Scranri",
          "Nb_Reviews": 2,
          "Date": "2022-01-06T21:23:49.000Z",
          "Titre": "Lack of customer service",
          "Contenu": "Lack of customer service. Never answer the phone, never answer emails, when you open a case, they don’t answer it.I made an order and it wasn’t shipped until almost two months after it was first placed. They then sent it to the wrong address (300 miles away) because they did not respond to my emails or answer my calls about changing the address, despite contacting them on multiple occasions. Oh, and the only reason it was the wrong address was because I moved house while waiting two months for them to ship the item. Wouldn’t bother wasting your money with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2021-02-05T03:21:11.000Z",
          "Titre": "Delayed shipping and poor customer service response",
          "Contenu": "Shipping was delayed by over two weeks with no explanation or notice at the time of purchase. Customer service was unresponsiveness for over a week. Once I was notified of the delay it was an additional week before my order shipped. The delay wouldn't have been an issue with a notice upfront and a responsive customer service team but the combination of both was extremely frustrating along with a whole host of issues from ups."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Silvaticus",
          "Nb_Reviews": 3,
          "Date": "2021-01-04T10:08:12.000Z",
          "Titre": "Too many affiliate companies.",
          "Contenu": "When I placed my order on the Joby website, I paid and received one order confirmation. A few days later I received an email explaining that the order didn't go through so I followed the instructions and  it somehow duplicated my order. There were three separate companies to deal with and none of them helped so now I have paid twice for a product that is average."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew Fisher",
          "Nb_Reviews": 1,
          "Date": "2020-12-14T13:28:43.000Z",
          "Titre": "Mars Green Handy Pod",
          "Contenu": "I purchased the Mars Green Handy Pod and for the first week it worked great and I was happy with my purchase. Then, after that week, the swivel started having a mind of its own and would not hold my phone any more unless it was up perfectly straight. I am quite disappointed because I really did like the product but now it is almost useless."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MachineMAC",
          "Nb_Reviews": 11,
          "Date": "2020-08-04T12:09:10.000Z",
          "Titre": "I ordered online and selected the…",
          "Contenu": "I ordered online and selected the express delivery option and paid the premium. Product didn’t arrive and I contacted live chat who advised as error with stock and they would send in approx 1 month and in the meantime refund my delivery charge. Product arrived weeks later but no refund of delivery charge. Tried to resolve online with no response. Not impressed. Won’t use again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "alex price",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T12:10:29.000Z",
          "Titre": "Disappointed.",
          "Contenu": "Don’t trust as I still haven’t vn’t got my package through. Order one the other month and it got cancelled nobody even spoke to me about. Feel like this company is fraudulent. Can someone ring me to tell me what’s happened to my package. Spent a lot of money and no sign of my purchase. If this goes on longer I will be contacting the fraud department in the police. Thank youAlex Price"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T12:16:56.000Z",
          "Titre": "I made an order",
          "Contenu": "I made an order, was charged, and received no confirmation.  I contacted customer service, and received no response.  I received the item, marked it refused and had it returned to sender, and have tracking confirmation that it was returned and received.  I again contacted customer service and received no response.  I still have a charge on my credit card and have filed a dispute with my credit card company.  Horrendous service all around."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Brooklyn Rose",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T20:28:52.000Z",
          "Titre": "Wheel of fortune scam",
          "Contenu": "Won something for free on the wheel of fortune thing they have going on at their website at the minute had an order confirmation waiting over a week when delivery should be 2-4 days emailed customer support asking where it was and was then ignored."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T12:14:31.000Z",
          "Titre": "No reply when I asked why my BOGO promo didn't apply",
          "Contenu": "I purchased 2 gorilla tripods and a beamo light.  There was a promotion for buy one get one free.  It applied to the transaction but when they finally shipped a month later, I was charged for all 3 items.  I've emailed \"customer service\" and didn't get a response from them at all.  Totally unprofessional."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Coralee McNee",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T12:22:16.000Z",
          "Titre": "The folks working your help line were…",
          "Contenu": "The folks working your help line were not empowered or had the tools to resolve my need for a return.  The people working the call/chat were great, but clearly weren't given tools to do their jobs.  I still don't know how I ordered two of the identical product because it was so difficult to figure out how to even get help in the first place.  There's plenty of examples of how to do returns/handle misorders, please do some homework and straighten that precious process out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kala  Thompson",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T23:18:27.000Z",
          "Titre": "To be honest I was really disappointed…",
          "Contenu": "To be honest I was really disappointed about this kit for $200 I was expecting a little more. All the products made from the cheap material especially the handle is too loose and the white cover for the light I can’t believe you ever launch this product it’s also too lose and can’t even cover the light really well.  I will be too worried to use this product outdoor im scared to lose all the parts. The best thing of this kit is the tripod itself, but still too heavy for me. Im still waiting for the refund and hope to get money back soon. Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CS",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T17:12:34.000Z",
          "Titre": "I thought I was being Scammed...",
          "Contenu": "Let me start by saying Customer Service was TERRIBLE!! I legitimately thought I was being scammed at first because...1) outside of the original invoice, all of my other emails were automatically being flagged as spam, 2) the phone number on the website was disconnected, and 3) when I finally reached someone, they could not find my order based on the invoice / PO number that was on the original invoice. They even looked at the SKU history and could not find me as a customer. Not sure what was going on but that was completely unacceptable. It's a shame because I actually like the product, but it's making me rethink purchasing from them."
        },
        {
          "Note": 1,
          "Lieu": "IS",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T07:59:26.000Z",
          "Titre": "Avoid buying from here",
          "Contenu": "Avoid buying from here! I bought it from the official website simply for the quality but they sent out an used one!! There are apparent used marks on the legs and at the bottom. I reported this to the website, however I haven’t heard from them yet after 2 weeks...... the customer service is non-existing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-27T14:11:52.000Z",
          "Titre": "It took nearly a month to receive the…",
          "Contenu": "It took nearly a month to receive the product. Nowhere on the website does it indicate the item is being sent from Europe and that it would take so long. When it finally shippe I was receiving notifications from UPS EUR. I needed it for a trip and it didn’t arrive in time."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Michael Russell",
          "Nb_Reviews": 17,
          "Date": "2020-12-29T11:36:39.000Z",
          "Titre": "Avoid the company, dreadful customer service",
          "Contenu": "Goods sent late (payed for next day delivery). Took 7 days to arrive and we're delivered to my neighbor. Customer service dreadful, they use a third party service for delivery. Refund was supposed to be received within 10days and took a 26 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-07-30T13:28:11.000Z",
          "Titre": "Round button to prevent rattle fell out…",
          "Contenu": "Round button to prevent rattle fell out in first day of use.  Purchased three for our cars and does not hold well to any of the vehicle vents. Also rubber fingers on expandable phone holder already peeled away from plastic and are falling apart."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jon Hollins",
          "Nb_Reviews": 3,
          "Date": "2020-09-14T12:57:10.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I returned the item but it apparently wasn’t received by your returns team so is now sat in a sorting office. Haven’t been able to contact anyone at the Joby office by phone as no reply, no information as to whether the office is open or not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Sperling",
          "Nb_Reviews": 1,
          "Date": "2020-01-24T11:42:25.000Z",
          "Titre": "I PURCHASED THE HANDYPOD MOBILE",
          "Contenu": "I PURCHASED THE HANDYPOD MOBILE.  The product was defective.  Once locked, the ball would not stay in place.  I sent it back to the manufacture.  Still waiting on my return of money or a replacement.  The return process was too complicated."
        },
        {
          "Note": 1,
          "Lieu": "OM",
          "Pseudo": "Adnan",
          "Nb_Reviews": 3,
          "Date": "2017-07-05T03:18:08.000Z",
          "Titre": "You have sent me the wrong product",
          "Contenu": "You have sent me the wrong product, I asked for camera tripod you send me the mobile small tripod, I am really disappointed, I have waited long time to receive the product and when I opened it I was surprised to find the wrong product,The name on the shipment box was correct joby gorilla pod action tripod, but when I opened the box, the product inside was not as described on the box. I paid 56 US$ for the wrong product Joby: Shipment # 200059445 for Order # 200121968Tracking number1Z1A01Y76767097339Please send me the correct product for which I paid the money, which isJOBY GORRILLAPOD ACTION TRIPOD"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T00:44:21.000Z",
          "Titre": "Somehow there was an error in the…",
          "Contenu": "Somehow there was an error in the shipping address as I bought a tripod for a friend as a gift. I have emailed and called several times and didn't receive an answer for over a month. This still hasn't been resolved."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Amelia Donkor",
          "Nb_Reviews": 2,
          "Date": "2022-01-19T10:34:14.000Z",
          "Titre": "Pretty terrible customer services",
          "Contenu": "I ordered a stand and mic which I didn't need so I contacted them to arrange a return delivery and refund. They don't seem to have a proper returns process and I spent £12 posting the unopened item back on the 16th December. I hadn't heard anything by 6th January so emailed customer services - no reply! Sent a follow up on the 12th and got a response on the 14th saying they hadn't received my parcel and did I have proof of delivery. I emailed back with proof and then they 'checked' and they magically did have it. There wasn't a proper explanation other than 'Christmas', which seems pretty dodgy considering they admitted my parcel arrived on the 20th December but on the 14th they had no record. Would never use again, and a lesson to keep you post office receipts safe!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "S.....",
          "Nb_Reviews": 5,
          "Date": "2020-12-26T01:27:24.000Z",
          "Titre": "I bought my item in the Black Friday…",
          "Contenu": "I bought my item in the Black Friday sale and just in time for a road trip. When making my purchase it said payment was successful a few moments later I got a notification saying my payment was unsuccessful. Immediately I emailed Joby’s customer service to find out what was going on (was payment taken or not). After about a week and still wanting to purchase the item before my road trip I purchased the item again (completely missed out on the sale) a week later someone finally responded asking if I still wanted to purchase the item (pointless as I had to reorder the item). Yes the item is great but service wasn’t the best. I won’t be purchasing from Joby again. I just don’t think they take customer purchases seriously."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chandrayee Soneja",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T12:56:20.000Z",
          "Titre": "Unable to return useless product",
          "Contenu": "The description was not accurate enough and the return policy was unhelpful, the return shipping was unpaid for and it would cost me more to return the item than keep it, even though I would not use it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kim",
          "Nb_Reviews": 13,
          "Date": "2020-12-17T08:11:38.000Z",
          "Titre": "Took ages to be dispatched so I…",
          "Contenu": "Took ages to be dispatched so I cancelled the order. The payment is all through a third party so very unusual process and not easy to deal with. Prices are also more expensive here than Amazon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vanessa",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T18:03:07.000Z",
          "Titre": "I attempted to reach someone regarding…",
          "Contenu": "I attempted to reach someone regarding two different price amounts (one noted in the invoice and another for what I was actually charged). I have not heard back from your team.- Vanessa Smiley"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Chris Bull",
          "Nb_Reviews": 19,
          "Date": "2020-05-05T12:10:41.000Z",
          "Titre": "I have not received my purchased item…",
          "Contenu": "I have not received my purchased item and still waiting for a reply from my enquires of where the item is. This is very unprofessional and I understand that things are different at the moment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Will Girone",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T17:58:16.000Z",
          "Titre": "Lost $400 order with no refund",
          "Contenu": "Purchased $400 worth of equipment. Shipping address was printed wrong by them and returned to sender. Support could not help me and my order was never refunded or shipped to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Omar Nassri",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T01:47:08.000Z",
          "Titre": "TERRIBLE PRODUCT - BEING COMPLETELY IGNORED",
          "Contenu": "TERRIBLE PRODUCT. BROKE WITHIN THE FIRST WEEK. CUSTOMER SERVICE IS NON EXISTENT. I’VE EMAILED FIVE TIMES FOR AN EXCHANGE. I JUST WANT A WORKING TRIPOD, NO ONE IS ANSWERING ME."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rexy",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T11:10:31.000Z",
          "Titre": "Well i won a Tripod with their…",
          "Contenu": "Well i won a Tripod with their competition an they cancelled the order!!! I was not impressed with this as i feel that i was Scammed out of a Prize."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Zuber",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T02:06:35.000Z",
          "Titre": "Cookies are invasive and unwanted",
          "Contenu": "Cookies are invasive and unwanted. They keep creating a link between my phone and joby.com website even though history has been cleared. Steer clear of this website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N8sworld",
          "Nb_Reviews": 3,
          "Date": "2021-08-06T18:23:59.000Z",
          "Titre": "First of all it should be free shipping…",
          "Contenu": "First of all it should be free shipping for the little gadget that I ordered.....Second of all 9.00 dollar shipping and it took 10days to arrive!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leonardo Reyes",
          "Nb_Reviews": 3,
          "Date": "2020-04-30T17:24:17.000Z",
          "Titre": "This has to be THE worst service I’ve…",
          "Contenu": "This has to be THE worst service I’ve ever received and I work in the retail industry! Not only did the 3 x 2 special not apply at checkout, I purchased anyways because I heard great things about the product. However, a few days pass by and my payment did not process still. I called their customer service to investigate and the representative said he “expedited” the payment process and I would receive an email. Calmly, I thanked him for reassuring me. Now on day six of waiting and still no communication from JOBY or from KIBO. Which leads me to believe the representative “duped” me to get rid of me over the phone. As I write this I’ve been on hold for about 30min with their customer service and nothing. All I really want is for this shipment to get here next-day to 2day shipping free of charge, adjust the total for the 3x2 special, and an apology for this sorry excuse of customer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "gareth noble",
          "Nb_Reviews": 3,
          "Date": "2021-11-19T05:57:45.000Z",
          "Titre": "The product is great but the customer…",
          "Contenu": "The product is great but the customer service is shocking. I have been trying to get in touch and get a refund for nearly a month"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sher Wing Du",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T01:14:57.000Z",
          "Titre": "Sooooo slow",
          "Contenu": "Sooooo slow. And such bad / inconsistent branding across the entire purchase journey. I don’t think I even received an order confirmation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph M",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T14:41:35.000Z",
          "Titre": "Great Product; Terrible Payment Processing",
          "Contenu": "Though I am very happy with the product, the website and purchasing process was a terrible experience. The payment processing notifications were so unreliable I ended up making two orders simply trying to get the product. Because my first order was not confirmed going on two weeks, I made a second order. Even so, I had to call and wait for nearly an hour before I was responded to and only then got confirmation that my first order would go through along with my second; however, at this point, I chose to cancel my first order because I had purchased the product somewhere else (B&H Photo) since it had been nearly 2 weeks with no news on the matter. I allowed my second order to process through only because I reached the rep on the phone to confirm the order. My advice, look into your SLA with the payment processor Joby is using because i could not be more unhappy. I may recommend the product but based on my experience will suggest people buy it from a reseller instead. Cheers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T15:23:55.000Z",
          "Titre": "Terrible product & customer service",
          "Contenu": "Not a good product.  Terrible customer service.  I tried to return & couldn’t get through to anyone for REURN ASSISTANCE.  Total scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaiah Easley",
          "Nb_Reviews": 1,
          "Date": "2020-08-09T23:24:53.000Z",
          "Titre": "When my camera arrived",
          "Contenu": "When my camera arrived, I could turn it on, but it would automatically turn off. The shipping took forever, it took like three weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mikey  Franco",
          "Nb_Reviews": 2,
          "Date": "2021-03-11T19:49:30.000Z",
          "Titre": "I clicked to accept invite to meeting…",
          "Contenu": "I clicked to accept invite to meeting and the entire invite disappeared. I have no way of reminding myself when the meeting is."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T15:00:10.000Z",
          "Titre": "Order didn’t turn up over a month and…",
          "Contenu": "Order didn’t turn up over a month and no response to a email I sent. Nor did anyone contact me until I ring them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ethan R",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T03:37:07.000Z",
          "Titre": "Still haven’t received my competition prize…",
          "Contenu": "Still haven’t received my competition prize or any details to say that it’s been shipped etc! Complete joke"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victoria Tarlow",
          "Nb_Reviews": 2,
          "Date": "2020-07-07T23:21:08.000Z",
          "Titre": "I still have not seen my creidt since I…",
          "Contenu": "I still have not seen my creidt since I sent my return over 4 weeks agoI have emailed for answers no response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eduardo Gow",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T16:33:36.000Z",
          "Titre": "Unsatisfied",
          "Contenu": "I’m not satisfied with the product cause it feel and look cheap and beside it was not cheap to purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JaQuais Taylor",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T15:50:37.000Z",
          "Titre": "The Last Time I Take a Chance on an Online Tech Company.",
          "Contenu": "The gimbal I ordered came just as swiftly as it broke. Although the wait for it was short, I began glitching and overheating the moment I turned it on. Originally, I figured I didn't know how to you it properly however after reading the manual and using it for 4 days I decided it was just easier to replace it. Because not only did it overheat after barely using it, it also would rapidly jerk side to side on its own before completely spazzing as if it were having a seizure. And the customer service is even worse. I have attempted to call the return number about twice a week for 2 weeks and have given up every time after no one answer the phone after over 30 minutes of waiting.It really seems as if they are intentionally making it difficult to contact so they can keep my money. In the time that it has taken to request a refund I have already ordered and received a better product from a different company which ultimately ended up being cheaper. Even after I do eventually get ahold of someone I'm still expected to pay to ship the broken product back meaning at the end of this ordeal it will have cost money to get noting from them, This is the last time I take a chance with an online tech company."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Niels Tradsfeldt",
          "Nb_Reviews": 2,
          "Date": "2021-09-27T12:33:52.000Z",
          "Titre": "Did never receive the ordered and paid…",
          "Contenu": "Did never receive the ordered and paid items. And the repeated mails are not answered yet."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Eva",
          "Nb_Reviews": 3,
          "Date": "2020-06-20T21:29:18.000Z",
          "Titre": "Article not delivered",
          "Contenu": "Article not delivered. Contacted supplier 4 times over the course of 1 month and still no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-14T16:32:47.000Z",
          "Titre": "Delivery was really long",
          "Contenu": "Delivery was really long. It said 5-7 days and i waited for 16 days which is unacceptable."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Millie Jacobs",
          "Nb_Reviews": 2,
          "Date": "2022-01-04T12:51:24.000Z",
          "Titre": "Didn’t receive",
          "Contenu": "Cent leave a good review as I never received my package."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Diana Pulford",
          "Nb_Reviews": 7,
          "Date": "2021-01-06T09:01:12.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "Very poor customer service, no communication on  order delay"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JGLMC",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T16:55:07.000Z",
          "Titre": "Not sturdy enough",
          "Contenu": "Not sturdy enough, could barely hold my phone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Freud",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T12:41:32.000Z",
          "Titre": "Poor quality product",
          "Contenu": "Poor quality product, bought 3 and 2 of them broke"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "andrew Stewart",
          "Nb_Reviews": 3,
          "Date": "2020-08-17T12:21:30.000Z",
          "Titre": "I haven't received it",
          "Contenu": "I haven't received it , can you help ????????"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 5,
          "Date": "2020-01-24T13:26:34.000Z",
          "Titre": "it is really poorly made and overpriced"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sophie  Isaacs",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T10:00:54.000Z",
          "Titre": "I did not receive my product"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "jeffrey chambers",
          "Nb_Reviews": 10,
          "Date": "2020-04-06T18:35:45.000Z",
          "Titre": "Excellent tripod really sturdy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Majao",
          "Nb_Reviews": 3,
          "Date": "2020-01-17T12:35:21.000Z",
          "Titre": "Didn’t receive my 5k tripod"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carlos Colon",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T01:44:10.000Z",
          "Titre": "It did not work"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bom Bay",
          "Nb_Reviews": 4,
          "Date": "2020-05-27T21:15:36.000Z",
          "Titre": "Beamo & Beamo Mini",
          "Contenu": "So let me be clear Joby as a company I've found great to talk with in the UK & the service very good especially delivery & an order issue so 5* there then. Kibo not so good 30min wait to endless crappy music to sort an order issue. So my advice in the UK ring Joby not Kibo if you have an order issue. This is a review of Beamo/Mini as s product. The actually quality of lighting is VERY Very good and both units are robust well made so definitely no issues here. Both Beamo/Mini are meant to bring studio lighting versatility and they do, or rather potentially do but for my gripes. Now the reason for 1* review. The quality of the supplied diffuser is very good for lighting & skintones BUT it does NOT stay on the Beamo/Mini.  THIS means Vlogging it will fall off. THIS means Selfies it will fall off. THIS means taking a picture it will fall off. THIS MEANS ANY MOVEMENT AND IT WILL FALL OFF. THIS means you will lose it because it will fall off.THIS means the moment is lost because it fell off. THIS means you have spent £60/80 on a spotlight because you will not notice when it falls off and when you need it & YOU WILL NEED IT , it will be lost because it fell off. How good is that for Professional mobile/studio use when vlogging or taking shots? Are replacements available free Joby do they even exist? The diffuser is essential on the Beamo/Mini for any type of perfect skin on the move vlogging or selfie photography it's rare your going to want a blinding spot light in your face so why does it NOT fit or stay put on any of the the 3 Beamo & 3 Mini lights I purchased no matter which way you fit IT even with red lines aligned? Massive BASIC negative flaw on a great product at £60/£80 for a PRO light. So expect a deluge of complaints starting with me when consumers realise the diffuser is so bad or should I say so GOOD at FALLING off. What are you going to do Joby to fix this or am I meant to use sellotape, super glue, blue tack, paper clip, velcro, chewing gum, scrunchie, barbed wire or honey to try and keep the diffuser on the Beamo? Whilst I'm on about diffusers how about adding some colour variant diffusers for warm/cool light shots & please Joby make sure they fit and don't fall off? Now another reason for the 1* review. The My Joby app. The app is essentially at this release BEYOND a poor afterthought for the Beamo! It default opens to a Joby camera mode and asks \"Resume Last Scene\" repeatedly a basic unnecessary function for 99.999% of Beamo customers so we can take pictures and videos using IT....WHY? I don't know but if you have a poor camera/phone your probably not going to spend £60/£80 on a Beamo Professional light as your probably going to use that money to by a better phone/camera? I use a P30 pro camera which already has amazing camera software & invested in Beamo @ £80 as a Professional mobile light for LIGHTING!  Every customer like myself downloading the App wants to CONTROL the Beamo settings & scenes NOT use it for taking photo/video shoots, so how about default opening to just Beamo functions or giving me the choice here? The brightness slider is difficult to set precisely, saving editing deleting of scenes are all extremely poorly implemented. Bluetooth connection works but is horrible for more than one light, lacking an obvious add button in the app so you can control two or more Beamo/Minis, come on this is meant to be used by creative people and with gorillapod rigs no-one wants this much faff to setup stuff we want to have fun & create! The app urgently needs a superfast update like last week Joby! I can't even justify 1* star for it in its current truly horrible amateur guise, it does work but barely only just. Also whilst improving it why not add game changing Alexa style voice app control to setup functions \"Beamo 5% Brightness “ it's already connected via bluetooth why not make the Beamo experience truly unique & outstanding (its already better than our replaced lumecubes in pure lighting terms) or more importantly invest in the app quality and actually make it about enjoying using your Beamo with a diffuser that doesn't FALL Off? Sort out the App and the diffuser and it's 5* BON JOBY, but for me with  Beamo/Mini priced @£60/£80 and the issues mentioned it's only a 1* review. Time will serve as to the merit of this review will Joby get the Beamo app right & the diffuser sorted? Mark the date of this review as I am keeping my Beamos and trusting Joby will. As for now a quality company releasing a new product without finishing their homework properly into the market well that's just plain BAD JOBY!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laurie Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T16:47:56.000Z",
          "Titre": "Joby GripTight ONE Magnetic Gorilla tripod a bust",
          "Contenu": "Purchased the Joby GripTight ONE GP Magnetic Impulse Gorilla Pod to use for my smart phone to take sport video. I needed both the magnetic feet and the articulated legs to be able to hold my phone on steel poles. Neither the feet nor the legs were strong enough to hold up a smart phone without it shimming down the pole. This device will work as a tripod but that's about it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "SLWG",
          "Nb_Reviews": 24,
          "Date": "2022-05-08T14:16:15.000Z",
          "Titre": "Instructions and After Sales needs improving!",
          "Contenu": "Received the telepod and ring light package, couldn’t find any instructions for attaching the light to the telepod and all YouTube videos are for the gorillapod. Tried to Reach out to joby for assistance, I may well be sending the items back…after sales needs to be dramatically improved!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danny G",
          "Nb_Reviews": 2,
          "Date": "2022-03-15T12:33:22.000Z",
          "Titre": "This product is basically junky plastic…",
          "Contenu": "This product is basically junky plastic and does not  grip branches or anything else firmly like in all the pictures and promotions provide by Joby. It balances on things at BEST and it better be rough or sticky surface too. It is frustrating to balance as this product is like some kids tinker toy with no symmetry placement possible…ever lol!  I would have give it 3 or 4 stars if the hype was not over the top for years hearing about this so so product that was a huge let down.  Lastly, the phone holder is great to be fair…if you are ONLY doing vlogs then it’s okay for that I guess but the PRICE NEED TO BE CUT IN HALF to really be fair to the consumer.  Usually don’t post comments but Joby sent me this survey lol. If you find it used or on clearance grab one!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elias",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T14:11:28.000Z",
          "Titre": "I was excited about finally getting one…",
          "Contenu": "I was excited about finally getting one of these but when I got it, it looked used. There were scratches all over it and I'm very disappointed. I will not recommend this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daiv",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T08:22:32.000Z",
          "Titre": "Had to order a replacement remote…",
          "Contenu": "Had to order a replacement remote control because the original popped off it's mount and ended up somewhere on a golf course.  I will make a Velcro (c) attachment to the tripod."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "D N",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T15:13:25.000Z",
          "Titre": "There was offer of a 10% discount off…",
          "Contenu": "There was offer of a 10% discount off my first order, if I signed up for the mailer. The email didn’t come until much later and I wanted to use it on my first order. I signed up  multiple times and nothing happened. I only just recently got the discount. I would have rather there not have been a discount than to have felt that I was missing out on saving on my purchase."
        },
        {
          "Note": 2,
          "Lieu": "FI",
          "Pseudo": "Mikko Sinisalo",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T12:46:54.000Z",
          "Titre": "Griptight Pro 2 Mount",
          "Contenu": "This Griptight Pro 2 Mount seems to be a quality product among cheap smartphone accessories, BUT you lock the phone in the mount with the same screw you loosen to turn the phone between horizontal and vertical, which means your phone drops from the mount if you don't hold it. Imagine dropping your camera from a tripod when you loosen a ballhead to turn the camera. Genius. And the weight on the website is a total lie. They claim 69 grams, when in reality this is 140 grams."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robbo",
          "Nb_Reviews": 1,
          "Date": "2020-12-31T17:00:20.000Z",
          "Titre": "Confusing service from Joby",
          "Contenu": "Joby separates its website/sales from the service organization, and this can be very confusing to a consumer.  Dont be surprised if you receive email or credit card charges from a company you have never heard of, completely different from Joby.  This is very confusing and at first i thought the charges were fraudulent and the emails were spam."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T12:45:24.000Z",
          "Titre": "I cannot review it because I never…",
          "Contenu": "I cannot review it because I never received it.  I had it delivered to my office but forgot to put the suite number on the address.  I asked around and nobody acknowledged receiving it.  I'm guessing there is someone in the Charlotte NC area enjoying the use of your product.  So I gave it two stars, which is probably a little unfair because delivery issues."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Neil  Wheadon",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T01:17:06.000Z",
          "Titre": "Deliver and invoices need thought",
          "Contenu": "The product was fine but1) It was a tiny piece of equipement 5cmx3cmx0.5cm yet it was delivered in a comically large box which contained 10 sheets of inflatable plastic bags.2) The invoice sent to my home E mail, contained no title, so it looked like SPAM and an internet threat3) The wording of vendor on my credit card beared no relation to the company, so I had to Google it to see that my card hadn't been fraudedGood product, but need thought about delivery. I usually use a shop, but COVID etc, in a way wish I had"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "kalbinder bir",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T14:57:12.000Z",
          "Titre": "Hello",
          "Contenu": "HelloI was so excited when we got the Joby but the stand it lose and the mic will not sit on it properly.  Also it has a screw that it sticking out a bit and then it is too low.  I would be grateful if you can send any ideas for another one but a taller stand?."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael B",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T18:37:35.000Z",
          "Titre": "Shipping is a bit much for small parts",
          "Contenu": "I love Joby products.  I was disappointed to have to pay $22 for a replacement QR plate with shipping.  $7 for shipping something a little bigger than a quarter seems a bit much.  WIthout it, the Gorillapod is not useful..."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Graham Peers",
          "Nb_Reviews": 25,
          "Date": "2020-11-10T07:54:59.000Z",
          "Titre": "TNT took about a week to deliver",
          "Contenu": "TNT took about a week to deliver. On one day I stayed in all day for nothing. Customer service for TNT said the driver had tried which was a load of rubbish. A different delivery company might be an improvement if my experience is common."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-27T12:46:16.000Z",
          "Titre": "Look after our planet better!",
          "Contenu": "Product I fine. But disgusted but the amount of plastic and bubble wrap used for a tiny plastic product!I'm not kidding saying that the box was 20 times the size of the product.  Absolutely disgusting waste of resources."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "kennethben in Hawaii",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T19:40:58.000Z",
          "Titre": "The site didn't inform me that they…",
          "Contenu": "The site didn't inform me that they would not ship the tripod to Hawaii. I received dozens of notifications of the device's progress to delivery, but the final one was 'delivery cancelled.'"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T18:34:50.000Z",
          "Titre": "abysmal customer service",
          "Contenu": "Product seemed good however did not fit my device despite saying it fits all tablets. That’s my mistake I should have measured and double checked. My intention was to exchange the part the holds my tablet for another product of theirs and keep the pod. I made SO MANY attempts to contact customer service.  I sent emails to the various companies listed under their customer support (Joby themselves uses third parties for seemingly every step of the process as in depending on your issue there is a different company who manages it), did a chat where I was on hold for over 45 minutes, made phone calls etc. After weeks of no response said forget it I’m returning this thing which was also a hassle bc who wants to go to the post office during a pandemic. TL;DR: customer service probably doesn’t exist. Don’t buy unless you at 100% certain the product is perfect for you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Patryk Piekarczyk",
          "Nb_Reviews": 1,
          "Date": "2020-06-08T13:11:08.000Z",
          "Titre": "Clunky",
          "Contenu": "Clunky, stand is hard to setup without it immediately falling over. Found a cheaper product from target that's easier to use and more supportive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ann Reed",
          "Nb_Reviews": 2,
          "Date": "2020-06-25T13:42:56.000Z",
          "Titre": "Disappointed",
          "Contenu": "Needing some help, I found the response was slow and inadequate. The only thing. that really works well is the light"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan Babcock",
          "Nb_Reviews": 6,
          "Date": "2020-07-21T14:32:21.000Z",
          "Titre": "Took me like 5 weeks to get product",
          "Contenu": "Took me like 5 weeks to get product. I am assuming it was due to covid.. but... thats the issue i had."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tanya Lyles",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T12:38:09.000Z",
          "Titre": "KIBO failed to process my payment in a…",
          "Contenu": "KIBO failed to process my payment in a timely matter. I called several times to inquire about the status of my order. A couple of times it was alleged due to the COVID limited staff and to later learn it was KIBO error. Thanks to a nice gentleman in the product service department, he made a few calls to KIBO and ensured me that my product would be shipped out. Immediately, the payment was processed and shipped. After receiving the confirmation via email that my order was processed. The next day I received another email from the billing department trying to process an additional payment for approximately $126.00 (I do not have the exact amount in front of me). I emailed them to dispute the additional charges and of course I have not heard from anyone from this unauthorized pending charge. I received my product, it took me some time to figure out how to put the kit together. Lastly, I believe advertising can be a little more clear about what’s included in the kit. Because, it appears like the Joby lights were included and they were not. When, I called to inquire about the lights that should have been included with the kit. Then, I was informed that the lights were an additional costs. Please be advise that I made two purchases 1. Kit with no lights 2. Lights Thanks Tanya L."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 2,
          "Date": "2020-06-17T21:17:56.000Z",
          "Titre": "My experience with Jobi has been…ATROCIOUS!",
          "Contenu": "My experience with Jobi has been ridiculous.  I had hoped to surprise my son with the tripod for cell phones.  Instead of getting a confirmation, I got an error with billing.  When I tried to call to address the issue, I was unable to get through to you.  I I tried to cancel the order as suggested on the website.  I had thought that was successful, , so  reordered the product.  Then a week went by, then two, then confirmation that the first order was being processed, and my card was charged.  Three days later, I was charged again, and the product was sent out a second time.  My son received his package, then I got an update from UPS saying that the product was stuck in limbo due to this crisis we’ve all been enduring.  My account has still not been refunded, because I can’t get through on the phone.  I have tried calling several times, and been stuck on hold each time for so long that it becomes apparent that there’s NO ONE THERE.  At this moment, I’ve been on hold for 29 minutes, with no end in sight.  I wouldn’t order from this company if it was the last place to get this stuff on Earth.  Your products may be fabulous, but since your service is truly atrocious, that has no bearing on being a repeat customer .  I really hope you’re able to straighten this obvious glitch out, for your own sake.... 35.5 minutes and counting!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2021-05-17T12:55:35.000Z",
          "Titre": "Just ok...it’s very small and so I’d…",
          "Contenu": "Just ok...it’s very small and so I’d say quite over priced for what you get"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T03:30:12.000Z",
          "Titre": "Joby gorilla pod does not fit well with…",
          "Contenu": "Joby gorilla pod does not fit well with Google pixel"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "RAHUL SHRIVASTAVA",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T14:48:58.000Z",
          "Titre": "Mic is not good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Burnie Blackmon",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T18:04:21.000Z",
          "Titre": "fit.",
          "Contenu": "I believe that claim was something like \"any phone any case\" but does not fit my Galaxy S22 Ultra w/Otter Box defender case very well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael  Kvalvik",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T05:15:27.000Z",
          "Titre": "I ordered your stupid box",
          "Contenu": "I ordered your mystery box.  I did not expect to get things for a iPhone.  I needed for a regular camera.  I will give to my granddaughter .  In the future say mystery box for camera or cellphone etc.  Would of been to buy only what I needed.  🌴🌴Aloha"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Marcus Ineson",
          "Nb_Reviews": 2,
          "Date": "2022-03-29T07:45:11.000Z",
          "Titre": "Doesn’t quite perform as well as I had hoped",
          "Contenu": "Doesn’t quite perform as well as I had expected. Key downsides for me are the tilt on the ball head which is very stiff and the limits on how tightly you can wrap the legs around something and have it hold steady e.g. steering wheel"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sarah Khan",
          "Nb_Reviews": 2,
          "Date": "2022-05-15T15:06:08.000Z",
          "Titre": "The selfie stick itself was so so but…",
          "Contenu": "The selfie stick itself was so so but the customer service was great"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Eddy",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T15:50:58.000Z",
          "Titre": "Wireless remote lost piece need hook up…",
          "Contenu": "Wireless remote lost piece need hook up chain like snap on and off"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "sibylle",
          "Nb_Reviews": 6,
          "Date": "2021-04-08T08:05:36.000Z",
          "Titre": "I bought an iPhone device to install on…",
          "Contenu": "I bought an iPhone device to install on to a tripod m and it wouldn’t fit  so I was disappointed when it arrives, Especially because I had taken the time to talk to an advisor in the Chatham and give her to specific Asian of my tripod. Then I bought from Amazon an adapter and now it’s all working really well and I’m very happy with the product"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Sean",
          "Nb_Reviews": 6,
          "Date": "2021-01-07T09:39:19.000Z",
          "Titre": "Having bought a tripod we found it didn’t perform as we hoped",
          "Contenu": "Having bought a tripod we found it could only hold a phone in landscape, so contacted customer service for advice. They recommended an additional part(subsequently bought) which didn’t fit (damaged original part following advice given). Recommended to them buy another tripod with no comment on previous advice / or resultant damage."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nabeel",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T01:26:10.000Z",
          "Titre": "Not as strong as expected"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-17T13:28:04.000Z",
          "Titre": "Instability of the vlogging tripod set",
          "Contenu": "I ordered the vlogging set because my choral group is virtual due to Covid.  My hope was that I could bend and mount the stand to allow hands free use.  What I found is the joint where the legs attach to the phone holder is not stable and the tripod doesn't stay where I place it.  This causes the phone to fall and since I have to take my phone out of the case for it to fit in the tripod my phone is at risk for damage due to fall or tipping over during use.  I feel the cost of $200 is a lot of money based on the final product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jacob B",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T17:07:39.000Z",
          "Titre": "The gorillapod pro with beamo ring…",
          "Contenu": "The gorillapod pro with beamo ring light is great! Only gave 3 stars because ordering online was not easy.  Tech support said the website recently “updated” so it wasn’t functioning like it should.. Will most likely order more products in the future"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Miss Fussbudget",
          "Nb_Reviews": 1,
          "Date": "2021-02-12T04:31:30.000Z",
          "Titre": "Love your product",
          "Contenu": "Love your product. Can't remember exactly your service except that I had to write you to get you to write back.  I would've liked a number with someone to speak to.  In the end, I figured it out myself and you took too long getting back to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant Wilson",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T15:48:40.000Z",
          "Titre": "The bundle seems overpriced",
          "Contenu": "The bundle seems overpriced. The microphone included isn’t much better than the quality of my iPhone XS. There was a backpack that looked like it was included with the set as a convenient carrying case but that wasn’t the case with this bundle. The joby legs start popping out of the sockets which makes it very troublesome to try and adjust after I’ve already fiddled with it to get a proper placement. It would be wise if your company developed a relationship with a credible wireless remote shutter manufacturer, this is a great product but it is definitely missing something to amaze me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy W.",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T13:33:00.000Z",
          "Titre": "The system works as advertised but...",
          "Contenu": "The system works as advertised, but it can’t do what I need. The light has a very short battery life. The microphone works great, with excellent sound quality. The stand can’t position my iPhone to look down without tipping over. It’s too light weight. The clip that holds the phone covers the controls I need to record. I had to take my phone out of its case to get a good grip. Then the whole thing tipped over and fell off the table. Broken phone. Lessons not recorded! I probably should have purchased the taller, heavier duty stand. This one was too short, but I couldn’t determine that from the sales information. Basically, an expensive disappointment."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Caroline Penn",
          "Nb_Reviews": 30,
          "Date": "2020-08-17T21:47:23.000Z",
          "Titre": "Easy to get adivce",
          "Contenu": "Called to ask advice from the overwhelming choice.  Phone answered promptly and straightaway was told which Gorillapod would suit both my phone and my camera.  Very happy with my product which is so sturdy and flexible."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Sean",
          "Nb_Reviews": 6,
          "Date": "2020-12-31T18:59:55.000Z",
          "Titre": "The rating is given very much based…poor advice",
          "Contenu": "The rating is given very much based upon the level of customer service - pretty much all on line and not particularly easy.  Product  advice  given wasn’t correct and led to purchasing the wrong item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elena Bogarin",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T19:47:40.000Z",
          "Titre": "It is a great sound mic but feels cheap…",
          "Contenu": "It is a great sound mic but feels cheap and easy to break.. also don’t like that it doesn’t come with a dead cat because many other at least come with that"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Gould",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T13:55:02.000Z",
          "Titre": "Flimsey and overpriced.",
          "Contenu": "The stuff works, but it's flimsy and incredibly overpriced.  Try contacting the company to ask a question about their products.  A pointless venture at best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fiorella",
          "Nb_Reviews": 2,
          "Date": "2020-10-20T12:57:58.000Z",
          "Titre": "Customer Service wasn't able to get a…",
          "Contenu": "Customer Service wasn't able to get a solution for me. They told me I needed to return the whole Vlogging kit, when the only thing that is failing us the Beamo Mini"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mr Robert Horrocks",
          "Nb_Reviews": 10,
          "Date": "2021-12-25T17:51:31.000Z",
          "Titre": "Although it has a substantial feel,the…",
          "Contenu": "Although it has a substantial feel,the remote will not stay in position. Quite inferior to a similar cheaper product..would like to return...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2021-02-08T02:25:13.000Z",
          "Titre": "I bought the product because I like it",
          "Contenu": "I bought the product because I like it. Would buy again but shipping and handling took so long. Was it really shipped from France?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HOPE",
          "Nb_Reviews": 3,
          "Date": "2020-08-04T21:38:42.000Z",
          "Titre": "The beamo light diffuser is terrible…",
          "Contenu": "The beamo light diffuser is terrible quality as it constantly falls off the beamo and I’ve had to wrap tape around the light to get the filter piece to stay put. It was like that from the moment I took it out of the box and tried it on the beamo mini light- I rotated it all four directions but it never actually attached and stayed on the light. It falls off even if the light is upright or mostly/completely erect. The light doesn’t even have to be facing down for the filter to fall off. I’d like a refund of $10 or more for the filter because that was a waste of my money to include it if it’s not even going to stay on through a simple photography session. Also, the gorilla pod was not as good of quality as I expected. The joints in some of the legs feel much tighter than others- whereas other “joints” of the bendy legs are super loose. One of the legs breaks in half if I bend it around something at one of the joints in the leg. Pretty disappointed as I thought this was a more rugged and well-build brand."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim Rhodes",
          "Nb_Reviews": 1,
          "Date": "2020-12-31T03:18:26.000Z",
          "Titre": "It would make more sense for the…",
          "Contenu": "It would make more sense for the shipping emails to reference Joby...they appeared to be spam emails at first."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Victoria Tarlow",
          "Nb_Reviews": 2,
          "Date": "2020-06-30T00:16:02.000Z",
          "Titre": "I have been waiting for my return…",
          "Contenu": "I have been waiting for my return creidt I sent it back 2 weeks ago  06/17/19Tracking  9505 8115 0164 5552 27"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Bruce",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T15:10:08.000Z",
          "Titre": "Just ok",
          "Contenu": "Just ok. Hard to get people on phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dayen",
          "Nb_Reviews": 2,
          "Date": "2021-10-18T14:20:14.000Z",
          "Titre": "Excited when I got my joby kit but when…",
          "Contenu": "Excited when I got my joby kit but when I started to use it the screws keep falling off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2020-04-29T12:54:42.000Z",
          "Titre": "Lots of useless emails with status ...joby",
          "Contenu": "Lots of useless emails with status changes on shipment then no email when product was delivered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darien  Cleage",
          "Nb_Reviews": 4,
          "Date": "2021-01-04T06:22:12.000Z",
          "Titre": "It's really simple",
          "Contenu": "This is just my opinion. The site could be better organized. Just an Opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "charles hendricks",
          "Nb_Reviews": 2,
          "Date": "2021-02-10T04:28:01.000Z",
          "Titre": "Shipping takes too long",
          "Contenu": "Shipping takes too long. Could have got it Amazon in two versus two weeks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "unimpressed",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T12:17:02.000Z",
          "Titre": "adequate product",
          "Contenu": "adequate product, overpriced. Expensive two day shipping took five days"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Hi",
          "Nb_Reviews": 1,
          "Date": "2021-12-29T11:40:01.000Z",
          "Titre": "The service was alright",
          "Contenu": "The service was alright, but the delivery was a bit slow"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-04-21T03:16:37.000Z",
          "Titre": "It works ok",
          "Contenu": "It works ok, could be better, could be worse."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Lars Harhar",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T10:44:29.000Z",
          "Titre": "Delivered to the wrong adress and…",
          "Contenu": "Delivered to the wrong address and contact formular refreshes and deletes all content when trying to accept ToS, but aside from that so far really happy."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 6,
          "Date": "2023-04-16T00:33:16.000Z",
          "Titre": "Had a good deal on the Gorillapo",
          "Contenu": "Had a good deal on the Gorillapod kit, I already have one of the older 'pods, but wanted to upgrade. Heavier than expected, but looks and feels sturdy and without splay under weight. Box and packaging was damaged on arrival, which was disappointing, but the 'pod itself wasn't affected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Poths",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T21:24:05.000Z",
          "Titre": "The product appears what was expected",
          "Contenu": "The product appears what was expected. Bought in advance of other projects, so have hot tested it yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George Pauli",
          "Nb_Reviews": 3,
          "Date": "2022-10-13T19:39:05.000Z",
          "Titre": "Great products, not perfect, but customer service is helpful",
          "Contenu": "Products are really great and unique. A little on the expensive side but good stuff costs good money.on a note of improvement, I purchased a small cell phone holder which did not do what it was designed to do. The company replaced it, thank you, but still has a manufacturing defect.  I'm actually on the 3rd one and it is what it is. Working with Joby was a good experience and they do everything they can to help a customer in need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peyton Mohrhusen",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T13:37:04.000Z",
          "Titre": "Happy happy happy",
          "Contenu": "UPDATE: I was promptly contacted by someone who works here who was able to assist me and have the product overnight shipped. I am so happy and excited! Elsy was great! I'm only giving it a 4 though because no one ever contacted me to let me know that it was resent back to the warehouse. It would have been nice to know!UPDATED ABOVELiterally ordered a month ago, was charged, and have not received a shipping notification or a processing notification. This is ridiculous. I was a refund. I wish I trusted my guy and went with another service."
        },
        {
          "Note": 4,
          "Lieu": "IM",
          "Pseudo": "Oliver Štafurik",
          "Nb_Reviews": 4,
          "Date": "2022-10-12T15:15:36.000Z",
          "Titre": "Love the gadget but not too heavy",
          "Contenu": "Love the gadget, even though sometimes it does not hold steady and I have a smaller phone (iPhone 13 mini), can't imagine what it would do on a heavier and bigger phone. I have a GripTight ONE GP Stand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald Berry",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T23:46:08.000Z",
          "Titre": "I purchased the iPad mini holder to use…when doing dry fire training at home and live fire training at the range.",
          "Contenu": "I purchased the iPad mini holder to use on a tripod.However, the holder can only be used if the brackets are positioned vertically. If they are used horizontally, the iPad slips out. The pads on the brackets are not strong enough to hold the iPad without it slipping out. I feel this should be mentioned in the product use section. It would be quite costly for it to slip out and break. I would like to hear back from you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Elvinia",
          "Nb_Reviews": 2,
          "Date": "2022-12-31T03:30:20.000Z",
          "Titre": "the manual is not very good",
          "Contenu": "the manual is not very good. it doesn't explain on the steps that you need to know. i had to look it up on youtube. i thought there was no sound but i figured it out later by watching and attempting many times. quality of the sound is good! need to improve on the manual and make it easier for users!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Steve Oakden",
          "Nb_Reviews": 27,
          "Date": "2022-12-19T11:20:24.000Z",
          "Titre": "Delivered on time",
          "Contenu": "Delivered on time, all good. Apart from the ridiculous and unacceptable amount of package involved!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T02:12:13.000Z",
          "Titre": "Tripod pod works amazing",
          "Contenu": "Tripod pod works amazing! It does everything I need it to do. However the phone mount can be more sturdy. As I was putting the phone in the phone mount it broke on me. But other than that the tripod works fantastic! I love using it!!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2023-01-18T19:15:14.000Z",
          "Titre": "Speedy delivery",
          "Contenu": "Speed of delivery. Easy to navigate site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bodhi Midsummer",
          "Nb_Reviews": 5,
          "Date": "2021-12-27T06:16:08.000Z",
          "Titre": "Does everything I wanted it to",
          "Contenu": "Does everything I wanted it to - attaches to separate tripod, portable tripod, selfie stick, remote control. Worked well, although phone holder covers most of the phone screen and it doesn't seem quite as rigid as I hoped, but seems strong and pretty good. My dad was very happy with the gift."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryn Kapp",
          "Nb_Reviews": 5,
          "Date": "2021-09-13T12:31:35.000Z",
          "Titre": "The product is great but the service…",
          "Contenu": "The product is great but the service was very confusing! I never got a confirmation email and when I called customer service they had not order on file with my name or address or anything. I thought it was a scam website or something but when I did receive the product to the correct address with the correct name, I was relieved. This means that they did have my name and address correct in the system but I guess they couldn't pull it up? Overall the product is great and as advertised."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Neale",
          "Nb_Reviews": 14,
          "Date": "2021-01-21T11:00:55.000Z",
          "Titre": "Telepod mobile bought through Apple…",
          "Contenu": "Updated ReviewTelepod mobile bought through Apple Store online. The Impulse remote trigger didn't work in the initial kit. Joby are not particularly easy to contact but having left a review they contacted me to resolve the situation. A replacement arrived the following day which worked so problem solved. This is a demonstration of excellent customer service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Amanda MacRae",
          "Nb_Reviews": 17,
          "Date": "2021-11-22T16:40:35.000Z",
          "Titre": "A bit fiddly and plasticky! A bit more robust than I first thought a bit better after using",
          "Contenu": "I loved the idea of being able to buy into a transferable system for interchangeable needs however I am feeling a little disappointed with this my first product, it’s a bit fiddly and rather more plasticky than I had expected by the price and promises. I am considering returning....thought I might update this review so as to give a fair and honest review, it is better than I first thought after usage - at first it was bit sticky now that its been used it's definitely smoother to change heights etc. and I've decided to keep it...so i'm going to change my rating from 3 starts to 4"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vadim Livitz",
          "Nb_Reviews": 3,
          "Date": "2021-12-27T05:20:03.000Z",
          "Titre": "The overall quality of tripod is ok",
          "Contenu": "The overall quality of tripod is ok.  But when it came right out of the box, sliding grip galled to frame so hard that it enormous amount of “ripping” brute force to detach slider.  It operates ok now, but doesn’t slide smooth."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sebastian Tanner",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T13:53:22.000Z",
          "Titre": "A lot more emails than expected.",
          "Contenu": "The service was okay. I can't say it was anything that stood out. The shipping was weird. I kept getting 2 separate emails about shipping and it didn't seem to be accurate anyways. Luckily there was a tracking number so I could just check that instead, but please figure out a better communication for emailing shipment updates. That's all."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "tiana mawalu",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T15:39:42.000Z",
          "Titre": "The product was exactly what was…",
          "Contenu": "The product was exactly what was advertised, great quality. Thank you for the fast shipping. The delivery-person did leave the product outside which is the only negative thing as it was raining. There was no option to add a safe place to my order if I was not in, maybe you could change this?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JMOTG",
          "Nb_Reviews": 6,
          "Date": "2020-05-15T21:18:48.000Z",
          "Titre": "Super Duper Handy",
          "Contenu": "The product arrived very quickly and is very easy to set up and use. I would've given it 5 stars if only it allowed you to insert your phone in both portrait and landscape, but unfortunately it only fits landscape. Overall I really like this product and would highly recommend it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Julia Forbes",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T09:35:53.000Z",
          "Titre": "There was a long delay in receiving our…",
          "Contenu": "There was a long delay in receiving our item but the customer care team replied promptly to my two enquiries and were apologetic and extremely helpful in resolving the problem.  Very happy with product. The second one I have ordered and works perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loren O.",
          "Nb_Reviews": 5,
          "Date": "2020-03-26T14:51:46.000Z",
          "Titre": "Bought Joby beamo mini",
          "Contenu": "Bought Joby beamo mini. Works great manually but after installing app on my new  LG V50 phone unit is not recognized and will not operate at all. Crazy because unit works perfect on my Samsung galaxy tablet with the app. Must be something with LG software not beamo app or light"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "AH",
          "Nb_Reviews": 5,
          "Date": "2020-07-24T12:24:43.000Z",
          "Titre": "Really quick delivery but the packaging…",
          "Contenu": "Really quick delivery but the packaging is really overkill. I only ordered \tGorillaPod Mobile Mini but it arrived in a large cardboard box with lots of air filled plastic. It could easily have been packed in a small jiffy bag / similar sized cardboard package."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ann",
          "Nb_Reviews": 12,
          "Date": "2020-06-02T17:44:30.000Z",
          "Titre": "I can't give five stars because the…",
          "Contenu": "I can't give five stars because the product did not arrive due to courier issues, but they did sort it immediately once the matter was drawn to their attention.  If the product is as good as their service, then they would deserve the fifth star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Pro Photographer",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T20:35:31.000Z",
          "Titre": "My item wasn't in stock and I had to…",
          "Contenu": "My item wasn't in stock and I had to wait quite a while. When I was finally able to order everything went fine, however, my biggest complaint is that I only need one confirmation email. Not 15 or 20 over the course if a several days."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathryn Kennedy Mancusi",
          "Nb_Reviews": 2,
          "Date": "2020-07-10T17:46:26.000Z",
          "Titre": "Great product",
          "Contenu": "Great product - very sturdy - but the grip isn't that great if you have a case and pop socket on your phone (even a thin case). It would definitely be better if it had vertical capabilities instead of only horizontal."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dave P",
          "Nb_Reviews": 6,
          "Date": "2021-01-12T09:56:37.000Z",
          "Titre": "I'd recommend them",
          "Contenu": "Great company. Website was easy to use. Not the promptest of communication about postage/delivery so I was left in the dark for a while but actually everything was fine, it was just me worrying!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "akkasse",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T14:35:26.000Z",
          "Titre": "Good service :)",
          "Contenu": "Thank you! the bag arrived in perfect condition but took a few weeks to arrive — it was quite a nice surprise though, as I had actually forgotten about it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KV",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T22:20:30.000Z",
          "Titre": "Easy to order,  ship status info delayed",
          "Contenu": "Received very quick order confirmation,  easy to order, but took long time for any delivery or ship date information. Finally requested status update which triggered response with info."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kristian L",
          "Nb_Reviews": 16,
          "Date": "2020-07-28T08:57:03.000Z",
          "Titre": "Bought my daughter's one each for doing…",
          "Contenu": "Bought my daughter's one each for doing their TikTok video things, they are very good, although one of the legs kept falling out straight out of the box, fixed with some super glue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rosi Hull",
          "Nb_Reviews": 5,
          "Date": "2021-02-12T01:25:08.000Z",
          "Titre": "Confusing buying experience",
          "Contenu": "The product that we purchased was amazing, which is why I gave such a high review. The buying experience, however, was less great. I made my purchase right before the holiday, which I understood would mean that I was not going to receive my product for a while. However, I was not expecting it to take over 3 weeks to ship. Additionally, I received an email from the company the day my item shipped with an unpaid invoice attached and zero context whatsoever. I was confused, because I had paid for the item online and it had cleared my bank account weeks before I received the invoice. I ended up calling the company to see what was going on and she didn't really help me understand. I finally received notice that my package had shipped, but it would have been helpful if the email had literally anything in it other than just an unpaid invoice."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2020-08-25T12:09:49.000Z",
          "Titre": "High cost of postage",
          "Contenu": "Found the postage cost  a little bit  excessive. The  item i ordered  was quite  low cost  but shipping  was  nearly  the same.  OK if your  getting a  high value  item"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-12T13:38:31.000Z",
          "Titre": "The shipping and delivery process was…",
          "Contenu": "The shipping and delivery process was slow and confusing. The web site showed it was shipped, but it was several days before the carrier showed that it was received."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Member",
          "Nb_Reviews": 6,
          "Date": "2020-06-16T16:13:23.000Z",
          "Titre": "The GoPro handlebar attachment was of…",
          "Contenu": "The GoPro handlebar attachment was of excellent quality and at a very good price. Delivery was amazing, despite the Covid-19 restrictions it was with me in days."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Derek Long",
          "Nb_Reviews": 28,
          "Date": "2021-02-01T09:29:34.000Z",
          "Titre": "Purchased as a gift",
          "Contenu": "Purchased as a gift, so no user experience. But ordering process was easy, delivery was prompt and well packaged. No complaints."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Whitley",
          "Nb_Reviews": 2,
          "Date": "2021-07-01T16:28:16.000Z",
          "Titre": "I easily found what I was looking for…",
          "Contenu": "I easily found what I was looking for and after I ordered it I got it in the mail in a short period of time. Good job!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandman1",
          "Nb_Reviews": 2,
          "Date": "2020-06-05T01:24:30.000Z",
          "Titre": "Only complaint was the multiple changes…",
          "Contenu": "Only complaint was the multiple changes in shipping times.but hey with all this virus stuff going on it's understandable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-02T03:35:40.000Z",
          "Titre": "Joby responsive",
          "Contenu": "Products well designed and Joby stood by their word and products. Originally had a small problem, but Joby fixed it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "J BUNNEY",
          "Nb_Reviews": 11,
          "Date": "2020-02-07T12:23:15.000Z",
          "Titre": "Handy pod remote control",
          "Contenu": "Handy pod is great but Joby don’t supply a remote control with the appropriate adapter for the slot in the tripod leg."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ChisO",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T17:42:18.000Z",
          "Titre": "The online shopping experience was great",
          "Contenu": "The online shopping experience was easy. I particularly liked the follow up emails giving the status of the order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vernon Seraile",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T01:44:00.000Z",
          "Titre": "Good solid tri pod.Very sturdy.A bit…",
          "Contenu": "Good solid tri pod.Very sturdy.A bit smaller than expected.Wish I got the bigger one.But still a good buy.!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jo Ann Messina",
          "Nb_Reviews": 5,
          "Date": "2020-06-04T14:07:44.000Z",
          "Titre": "Overall Opinion",
          "Contenu": "Easy to assemble. Instructions a bit sparse, but easily interpreted.  Have used extensively.  Recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Lauder",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T12:22:00.000Z",
          "Titre": "Pretty good",
          "Contenu": "Pretty good.  A bit tough to orient if you want to use your phone to shoot in portrait mode."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Drazzimo",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T20:16:04.000Z",
          "Titre": "Sent message to customer care no reply",
          "Contenu": "Sent message to customer care no reply but I figured it out but great service anyway"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "K Rycroft",
          "Nb_Reviews": 38,
          "Date": "2021-03-24T07:23:13.000Z",
          "Titre": "Very good product",
          "Contenu": "Very good product; compact and flexible, allowing plenty of different uses; reasonably priced"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joanna",
          "Nb_Reviews": 2,
          "Date": "2020-07-25T21:58:37.000Z",
          "Titre": "Fantastic and timely delivery",
          "Contenu": "Fantastic and timely delivery. I thought it would take longer to arrive because of COVID-19."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-05-22T08:04:34.000Z",
          "Titre": "Responsive and timely",
          "Contenu": "Responsive and timely, but have not had a reason to 'test' them under any duress."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stuart Bryce",
          "Nb_Reviews": 5,
          "Date": "2020-08-14T17:11:15.000Z",
          "Titre": "Good service",
          "Contenu": "Fast, communicative purchase and delivery, but with wasteful overkill on packaging."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Johnston",
          "Nb_Reviews": 2,
          "Date": "2021-03-07T17:21:14.000Z",
          "Titre": "Small and does what I need it to do",
          "Contenu": "Small and does what I need it to do. Got some great time lapses on my iPhone"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Felipe",
          "Nb_Reviews": 7,
          "Date": "2021-05-17T12:27:53.000Z",
          "Titre": "I ordered it, it arrived when they said it would, it worked."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Neil Taylor",
          "Nb_Reviews": 14,
          "Date": "2020-05-12T12:28:33.000Z",
          "Titre": "Right product on time",
          "Contenu": "Right product at good price delivered when they said it would be"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2020-06-11T14:42:57.000Z",
          "Titre": "Gorilla pod smartphone tripod",
          "Contenu": "Great product design and delivery time. A bit pricey though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RC",
          "Nb_Reviews": 6,
          "Date": "2021-06-01T02:30:05.000Z",
          "Titre": "camera stand",
          "Contenu": "Holds well but only landscape and not very tall."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jameel Rasheed",
          "Nb_Reviews": 2,
          "Date": "2022-02-08T05:11:44.000Z",
          "Titre": "Seem too work pretty well easy too use"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 7,
          "Date": "2020-04-27T12:31:01.000Z",
          "Titre": "Item as described and delivered quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Oracle",
          "Nb_Reviews": 11,
          "Date": "2020-06-01T19:59:45.000Z",
          "Titre": "Joby Rocks!",
          "Contenu": "Joby rocks!They just need more stock!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Matthew Van Schagen",
          "Nb_Reviews": 7,
          "Date": "2021-03-01T21:53:08.000Z",
          "Titre": "great product delivered on time"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Daniel Harding",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T09:16:06.000Z",
          "Titre": "Simple and works a treat"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Geemal Kandauda",
          "Nb_Reviews": 2,
          "Date": "2021-12-28T01:35:52.000Z",
          "Titre": "Nice product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chinyere",
          "Nb_Reviews": 2,
          "Date": "2021-09-29T16:54:44.000Z",
          "Titre": "Great product!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Julian L.",
          "Nb_Reviews": 4,
          "Date": "2021-08-02T21:26:13.000Z",
          "Titre": "Fast delivery"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "maria ferreira",
          "Nb_Reviews": 4,
          "Date": "2020-06-12T14:30:53.000Z",
          "Titre": "really recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rufus Moore",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T00:18:06.000Z",
          "Titre": "Great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmen",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:33:31.000Z",
          "Titre": "Joby does not disappoint.",
          "Contenu": "I ordered my second gorilla pod Rig to have an extra one to use with my iPhone and cameras. After looking up my previous order from a few years ago I found the tripod and was able to order easily. Shipping was fast and the tripod was well protected in packaging.  Will definitely order more Joby products as the need arises."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T05:36:54.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michelle",
          "Nb_Reviews": 11,
          "Date": "2022-09-10T19:52:50.000Z",
          "Titre": "Always use JOBY from now on",
          "Contenu": "Approx 11th August ordered a JOBY small legged tripod so I could have some video training via Whatsapp. I attended several well known electronic stores prior to this none of whom were very helpful or even had the product..most quoting 2 weeks to order..JOBY outlet actually cheaper, arrived within 2 days kept fully updated re dispatch/delivery wouod not hestitate to use again."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Philip Vernon",
          "Nb_Reviews": 6,
          "Date": "2022-10-22T10:26:52.000Z",
          "Titre": "A perfect company partner",
          "Contenu": "Anyone looking to buy this product will I'm sure will be informed of its ability through other means. It really is a perfect partner to carry in your bag. Fairly lightweight but enough heft to support a decent sized camera and lens with lots of flexibility and supportive strength. I'm giving this product a 100% recommendation!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon Pipe",
          "Nb_Reviews": 1,
          "Date": "2022-06-28T15:48:37.000Z",
          "Titre": "Podzilla: it's not black. Hooray!",
          "Contenu": "The yellow Podzilla was great for shooting video on a walking challenge event. Most important to me that I could buy something that wasn't RUDDY BLACK. Why is everything black? I have a disability that means I lose things and black things are much easier to use. Yellow was great - especially when filming on a wild, windblown hillside at night, sometimes running between shooting locations. It was seriously good for clamping to fences, etc, and on one occasion, the posting slot on a Royal Mail red letterbox. Delivery was quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Columbus Researcher",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T01:26:19.877Z",
          "Titre": "I've only used briefly so far but…",
          "Contenu": "I've only used briefly so far but everything seems great. Solid and clear recording even with ambient sounds. Low profile mics with versatility. So far, recommend! Consulted a techier person I know and they said this was a great deal.I wish the set just went ahead and came with a converter for all mobile devices (Apple) - or was clear an adapter is needed and sell it as an add on. I'm using this for research interviews, not professional filming, and many people don't have cameras or phones that will connect with the included pieces. It was an easy extra purchase, but I'm low-tech and didn't look for this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 2,
          "Date": "2022-10-07T05:37:47.000Z",
          "Titre": "I got my first Joby tripod about 10…",
          "Contenu": "I got my first Joby tripod about 10 years ago as a gift from her children. It was a very useful tool until I my newst camera exceeded its capacity.  I purchased the GorillaPod® 5K Kit and it has made all the difference. My original Joby is being passed on to my son who is into cellphone photography, it is still a very capable tripod in like new condition."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "di",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T21:52:20.000Z",
          "Titre": "Awesome tripod",
          "Contenu": "Awesome tripod! Super convenient flexible legs and magnetic mount that makes attaching an iPhone so quick and easy. So much better than those cheap noname tripods with clamps! Hope it lasts 😅"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher M",
          "Nb_Reviews": 3,
          "Date": "2023-01-06T19:22:09.000Z",
          "Titre": "Cell Phone Adapter for my Gorillapod",
          "Contenu": "I have two of the JOBY Gorilla pod camera tripods that I have used while traveling the world, and I LOVE them, but I now use mostly my camera for taking photos, and thus kept the tripods on a shelf collecting dust.  I finally decided there must be an adapter for the gorillapods to allow them to be used with a cell phone.  I called their Customer Service, who directed me to the correct adapter and I received it in a very short time (only a few days).  It works and now I am able to use my JOBY Gorillapods again!!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristi Wire",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T00:16:19.000Z",
          "Titre": "The rep I spoke with was very…",
          "Contenu": "The rep I spoke with was very understanding of my issue and explained the possibilities very clearly. Unfortunately, my Gorilla Pod was an older model, and the quick release tab that fits my Pod is no longer made. Fortunately my son-in-law was able to fabricate a part that functions like the quick release tab, preventing me from having to buy a newer model of Gorilla pod. Now I can use my new cell phone grip on my old Gorilla Pod."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dominic Davies",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T16:13:13.000Z",
          "Titre": "Arrived the next day and the…",
          "Contenu": "Arrived the next day and the replacement part was an improvement on the previous holder. I’m so glad I ordered."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 15,
          "Date": "2022-07-05T21:20:05.000Z",
          "Titre": "Straight forward transaction easy web…",
          "Contenu": "Straight forward transaction easy web site to use with full description of item you are purchasing, from reviews and various sources you are assured your product is of quality and fit for purpose . Absolutely pleased with my Joby Gorillapod good price too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 3,
          "Date": "2022-03-23T17:10:36.000Z",
          "Titre": "Great all in one video platform",
          "Contenu": "All in one Vlog or just plain video making tool.  The light's diffuser could hold better, but nothing a little duct tape or Gorilla tape can't resolve.  I swapped out the Joby tripod it came with for another, bigger,  Joby tripod."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Trevor Chenery",
          "Nb_Reviews": 5,
          "Date": "2023-02-14T11:15:29.000Z",
          "Titre": "The head goes 90 Degrees. Ninety degrees.",
          "Contenu": "Great choiceSite is well designed.The stand I chose, whilst similar to the Manfrotto Pixy one had one special advantage, the horizontal setting.The head goes 90 degrees, Ninety degrees !!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Julian",
          "Nb_Reviews": 11,
          "Date": "2022-06-10T11:52:46.000Z",
          "Titre": "Highly recommended",
          "Contenu": "A colleague got a GorillaPod and I was entertained by how it could be used. The purchase process was easy and delivery very fast. The design of the GorillaPod is characterful and the ways that you can manipulate it are fun. It is very well made.Most pleased with it. Recommend it to anyone who wants a practical device that stands out from the crowd"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Hockaday",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T15:21:22.000Z",
          "Titre": "I was happy with the checkout process",
          "Contenu": "I was happy with the checkout process, and shipping was swifter than expected. So far loving the performance of the JOBY Waveo pod. Excited to get podcasting and creating with it!    Get ready to hear awesome content from Tucumcari New Mexico!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Kristianson",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T23:35:22.000Z",
          "Titre": "Once I opened the box and tried to…",
          "Contenu": "Once I opened the box and tried to follow the instructions, that was a lost cause.  Then I went to YouTube and saw the video from one of your associates (Mark-I believe) and that straightened out my issues.  So I watched the video two or three times and had the tripod there to understand how things worked.  And it is really pretty simple."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tristan Morphew",
          "Nb_Reviews": 8,
          "Date": "2023-11-22T16:12:26.000Z",
          "Titre": "Very fast dispatch",
          "Contenu": "Very fast dispatch, very fast delivery (a lot quicker than expected.)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Leonard",
          "Nb_Reviews": 7,
          "Date": "2022-03-18T06:42:39.000Z",
          "Titre": "I bought one of their new Swing…",
          "Contenu": "I bought one of their new Swing sliders. Unfortunately there was a technical fault with it but after a call to their customer services department they sent a replacement which arrived the next day.The new Swing works perfectly and I am very pleased with it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alv",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T14:50:02.000Z",
          "Titre": "Joby GorillaPod 2/S22 Ultra",
          "Contenu": "Using the Joby GorillaPod 2 with my Samsung Galaxy S22 Ultra. I can truly say I love it, use it for my Instagram, YouTube and TikTok videos. Amazing piece of accessory."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hopkins",
          "Nb_Reviews": 19,
          "Date": "2022-05-04T14:58:45.000Z",
          "Titre": "Really happy with my Joby Grip Tight…",
          "Contenu": "Really happy with my Joby Grip Tight One GP tripod stand. It’s ideal for what I want it for. It’ll fit easily into my cargo shorts pockets because it folds down nice and small. It’s very stable and flexible and wil be great when I take it away on holidays to remote places. It easily opens up to my Samsung S22 Ultra, even with the case on. But it does grip the phone better out of the case. I’m very happy with its versatility and pleased I bought it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin Wace",
          "Nb_Reviews": 2,
          "Date": "2022-04-11T05:57:54.000Z",
          "Titre": "Great quality products, easy ordering",
          "Contenu": "I've now ordered three items from Joby (Spin, Swing and 1k GorillaPod). Each time I found ordering to be very straightforward and delivery was fast. I will add that the quality of each item is great and all three do the job I needed them for.I'm very happy to recommend Joby to friends."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alexander",
          "Nb_Reviews": 2,
          "Date": "2022-06-13T14:56:17.000Z",
          "Titre": "Joby went above and beyond with a…",
          "Contenu": "Joby went above and beyond with a faulty item. No questions just simple efficiency and painless to deal with. Now on my favourite suppliers list!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "RC.",
          "Nb_Reviews": 25,
          "Date": "2022-05-16T18:39:18.000Z",
          "Titre": "Great product, selfies with ease",
          "Contenu": "Great product, was very useful on our recent holiday. Only issue I had was the case my phone is in being a bit big for the mount to grip, perfect for my wife's slimmer phone case."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Martin Wace",
          "Nb_Reviews": 2,
          "Date": "2022-03-14T08:42:37.000Z",
          "Titre": "Useful addition to any small video production kit",
          "Contenu": "Easy ordering and fast delivery. We'll packaged. The Joby Swing does just what I hoped, and wanted. I haven't used it much yet but that's just the way life goes.  I'm working on a couple of short video ideas and the Swing will certainly be used in both.The app is not the most intuitive I've ever cone across, but it didn't take long to understand it.I'm very happy with this item so far."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam Owen",
          "Nb_Reviews": 2,
          "Date": "2022-06-01T11:58:10.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, had issues, and they were very good about trying to resolve it and then refund without any qualms once I decided I needed to replace it with something else from somewhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J L in TX",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T15:08:42.000Z",
          "Titre": "Great experience, as expected!",
          "Contenu": "I received my order quickly through UPS, and have had no problems.  I have been using Joby products for several years, and have always found their products to be of excellent quality and competitive [Professional] price... They have innovative support equipment for my photography needs, and their designs are pragmatically whimsical."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert McGlade",
          "Nb_Reviews": 37,
          "Date": "2022-06-13T14:56:07.000Z",
          "Titre": "Worthwhile gear",
          "Contenu": "Order arrived on time. Works well with my Pixel 6 phone and adds some handy photo options, long exposure,  low light images to name two. Good gear, price and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Levi G",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T01:13:59.000Z",
          "Titre": "Quality products coming with premium…",
          "Contenu": "Quality products coming with premium price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PI",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T22:25:07.000Z",
          "Titre": "Compact Light Kit…Great puchase!!",
          "Contenu": "I purchased the Compact Light Kit for filming and it is awesome!! Has a very flexible top, and the legs extend generously. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scottcustomer",
          "Nb_Reviews": 2,
          "Date": "2022-11-03T22:39:15.000Z",
          "Titre": "Buying and shipping was quick and easy",
          "Contenu": "I love this thing. Makes holding my cameras like a monopod without all that extra. Makes a great stand to record fish being reeled in. The little flex balls are perfect."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Cat DeBlanc Nickell",
          "Nb_Reviews": 4,
          "Date": "2022-08-23T14:44:02.000Z",
          "Titre": "Thank you for your timely shipment",
          "Contenu": "Thank you for your timely shipment. It’s a bit heavier than I imagined but I get to try it out in a few weeks. I do underwater photography and plan to use it on my shore dives."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Susan W",
          "Nb_Reviews": 3,
          "Date": "2022-11-30T12:40:33.000Z",
          "Titre": "Well made equipment",
          "Contenu": "Well made equipment, easy to put together (I purchased the ball joint, plus Gorillapod and iPhone holder). Flexible and easily transportable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sue",
          "Nb_Reviews": 2,
          "Date": "2022-03-14T12:02:57.000Z",
          "Titre": "Really pleased with my mobile phone…",
          "Contenu": "Really pleased with my mobile phone tripod- good quality and I spoke to an advisor who was very helpful. Arrived well packaged and in good time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan",
          "Nb_Reviews": 3,
          "Date": "2023-01-04T18:37:41.000Z",
          "Titre": "Great product at a great price",
          "Contenu": "The price direct from the company was better than other sources, and the service was excellent. The tripod is also great!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Phil Seeney",
          "Nb_Reviews": 23,
          "Date": "2022-11-23T08:51:15.000Z",
          "Titre": "Brilliant piece of kit and an amazing…",
          "Contenu": "Brilliant piece of kit and an amazing bundle.price, cheaper than many outlets are selling just the tripod. I just wish I'd bought it sooner...."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hieth George",
          "Nb_Reviews": 40,
          "Date": "2023-01-03T20:53:06.000Z",
          "Titre": "This has to be the best Mic for YouTube…",
          "Contenu": "This has to be the best Mic for YouTube and Studio use having tried loads out this one comes out top of the list !"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sunnyest",
          "Nb_Reviews": 19,
          "Date": "2022-08-30T14:30:10.000Z",
          "Titre": "Got exactly what I wanted to use with…",
          "Contenu": "Got exactly what I wanted to use with my trail camera which I love using. The stand is perfect for watching the hedgehogs in my garden"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Stefan Lobuczek",
          "Nb_Reviews": 8,
          "Date": "2022-05-10T17:17:00.000Z",
          "Titre": "JOBY are an easy company to deal with…",
          "Contenu": "JOBY are an easy company to deal with and I was most impressed by the quality and performance of my purchased products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Thames",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T13:39:12.000Z",
          "Titre": "Handy tripod for iPhone!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "M Exeter",
          "Nb_Reviews": 11,
          "Date": "2022-09-26T15:26:27.000Z",
          "Titre": "A good product promptly delivered...",
          "Contenu": "A good product promptly delivered.... but they could make it easier to contact customer services!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raphael Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T07:56:37.000Z",
          "Titre": "Very Helpful",
          "Contenu": "Thank you guys for helping me with trying to do more things with my JOBY Gorilla Pod."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "BRIAN",
          "Nb_Reviews": 3,
          "Date": "2022-11-30T09:12:25.000Z",
          "Titre": "THE SPEED OF THE TRANSACTION TO…",
          "Contenu": "THE SPEED OF THE TRANSACTION TO DELIVERY & THE PRODUCT QUALITY & CAPABILITY…I HAVE A NUMBER OF PIECES OF JOBY KIT…ALL WELL MADE & DO WHAT THEY SAY ON THE TIN…PLUS INTERCHANGEABLE…👍🏼👍🏼👍🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Dutcher",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T17:09:25.000Z",
          "Titre": "great product",
          "Contenu": "great product. I am liking the 5k alot better then the 3k i got years ago. The separate pan movement is awesome. The 5k seems alot more durable and sturdy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T10:42:59.000Z",
          "Titre": "Easy",
          "Contenu": "Online ordering was easy and shipping was free. I followed the tracking and the shipment arrived on time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rich Brennan",
          "Nb_Reviews": 4,
          "Date": "2022-08-01T14:54:52.000Z",
          "Titre": "Fantastic quality product delivered on…",
          "Contenu": "Fantastic quality product delivered on time. Will order from Joby again in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs Sarah Lomax",
          "Nb_Reviews": 4,
          "Date": "2022-08-26T14:33:51.000Z",
          "Titre": "Bought this as a present for a friend…",
          "Contenu": "Bought this as a present for a friend who is just starting out in photography and she loves it. So versatile and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Julian Blackmore",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T12:01:09.000Z",
          "Titre": "Great Product",
          "Contenu": "Easy transaction, good comms, well packed and prompt delivery, plus great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2022-03-28T02:38:42.000Z",
          "Titre": "I purchase this before and absolutely…",
          "Contenu": "I purchase this before and absolutely loved it! It’s light, durable, quick and easy to use, plus, it has a cold shoe mount on top. I would say it’s the best that I’ve found and used this far."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dena Worlding",
          "Nb_Reviews": 12,
          "Date": "2023-06-05T14:12:15.000Z",
          "Titre": "Good product, good service",
          "Contenu": "Good product. Delivered quickly and was kept updated re my order and delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naida Munoz",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T20:48:20.000Z",
          "Titre": "I absolutely love my tripod",
          "Contenu": "I absolutely love my tripod, I wish the ring light wouldve been bigger but it works great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tia Terlaje",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T17:12:43.000Z",
          "Titre": "Great product and value for both personal videographers and pros",
          "Contenu": "Great product and value for both personal and professional needs -- thanks for the free shipping!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bryan",
          "Nb_Reviews": 24,
          "Date": "2022-11-14T15:07:56.000Z",
          "Titre": "Great range of products, flawless service",
          "Contenu": "Great range of products, item arrived quickly and is better than I expected. Flawless all the way."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 7,
          "Date": "2023-08-07T15:39:01.000Z",
          "Titre": "Fast and efficient",
          "Contenu": "Shipped promptly, packaged safely. All in all a fair experience."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 4,
          "Date": "2022-07-23T16:54:41.000Z",
          "Titre": "Extremely fast shipping, great tripod and light, and free gifts",
          "Contenu": "My order was shipped shockingly quickly, and the tripod and light are great. The deal for the free bits for the amount I purchased were a nice touch too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Borek",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T03:51:42.000Z",
          "Titre": "Nice product",
          "Contenu": "So far it is great. Love that it can be bent to whatever possible position I need. The mag safe holder is strong enough to hold the phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MGC CHELSIE RAI",
          "Nb_Reviews": 1,
          "Date": "2022-04-21T02:21:57.068Z",
          "Titre": "I LIKE THE COLOR",
          "Contenu": "I LIKE THE COLOR, FLEXIBILITY, DURABILITY AND VERSATILITY. THANK YOUTHE PRICE WAS JUST RIGHT AS WELL 🙂❤️"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael G UK",
          "Nb_Reviews": 3,
          "Date": "2022-11-29T14:31:44.000Z",
          "Titre": "Terrific company with innovative",
          "Contenu": "Terrific company with innovative, fun products. Had a great price and super service too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ross",
          "Nb_Reviews": 2,
          "Date": "2022-05-16T16:37:47.000Z",
          "Titre": "Great",
          "Contenu": "Works really well. I use it for recording myself indoor rock climbing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Stevens",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T18:27:09.000Z",
          "Titre": "Magnets - yay!",
          "Contenu": "Great product! Looking forward to getting the larger version. Magnets are awesome!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrew Lloyd",
          "Nb_Reviews": 13,
          "Date": "2022-07-12T16:11:27.000Z",
          "Titre": "GOOD GORILLA .... POD",
          "Contenu": "THE  GORILLA ARRIVED PROMPTLY WAS WELL PACKAGED AND DOES EXACTLY WHAT I NEED."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Klein",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T12:59:26.000Z",
          "Titre": "Michigan photos Love Joby products ,used your tripods…",
          "Contenu": "Love Joby products ,used your tripods for years and have recommended them to friends. You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Patterson",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T04:33:26.000Z",
          "Titre": "Quality product"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Janice",
          "Nb_Reviews": 7,
          "Date": "2023-09-04T18:25:11.000Z",
          "Titre": "smooth purchase via web shop.",
          "Contenu": "Good communication via the web shop and prompt shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tam",
          "Nb_Reviews": 2,
          "Date": "2022-06-21T15:54:28.000Z",
          "Titre": "Live Chat agent is great.",
          "Contenu": "Customer services quickly response and solved issue at Live Chat."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Brendaliz Rivera",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T16:43:25.370Z",
          "Titre": "The products are as described",
          "Contenu": "The products are as described. They sen it fast. Quality packaging.  Worth make business with JOBY."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Allan MacGillivray",
          "Nb_Reviews": 3,
          "Date": "2022-03-31T11:26:32.000Z",
          "Titre": "Really versatile gadget",
          "Contenu": "Really versatile gadget , came in the post on time I use it every day ."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rosaria  Vallesi",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T15:21:54.000Z",
          "Titre": "No complains",
          "Contenu": "No complains, arrived on time and perfect conditions, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "SH",
          "Nb_Reviews": 5,
          "Date": "2022-03-14T07:49:23.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent. I'm using it for my mobile camera. Useful, flexible, strong."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neil Rodgers",
          "Nb_Reviews": 4,
          "Date": "2022-12-17T10:10:04.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, well packaged and arrived safe and sound and in good time."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 3,
          "Date": "2022-03-29T17:53:08.000Z",
          "Titre": "Great service…",
          "Contenu": "Great service…. Received tripod within 2 days…. Just the Joby.Thank you so much. Honk honk!!! 😀"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Maher",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T14:28:09.000Z",
          "Titre": "Volta",
          "Contenu": "Great product! Volta! Solved all of my annoying problems I was having with my GoPro10."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Tina  Nandi",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T12:43:04.000Z",
          "Titre": "Amazing product",
          "Contenu": "Amazing product. Best little tripod to take anywhere."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customerLinda Daley",
          "Nb_Reviews": 45,
          "Date": "2022-12-11T14:14:17.000Z",
          "Titre": "The product was exactly as described…",
          "Contenu": "The product was exactly as described and arrived quickly and in perfect condition, Overall a good shopping experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JPape",
          "Nb_Reviews": 6,
          "Date": "2022-08-02T14:11:39.000Z",
          "Titre": "The connector attached to my stand…",
          "Contenu": "The connector attached to my stand easily for my phone."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adam T",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T00:07:12.000Z",
          "Titre": "Good price and product works exactly as…",
          "Contenu": "Good price and product works exactly as expected"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kns",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T15:10:49.000Z",
          "Titre": "The mystery box was great value for…",
          "Contenu": "The mystery box was great value for money really handy and great quality products"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Graham  Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T08:22:43.000Z",
          "Titre": "Easy to order and come on time for…",
          "Contenu": "Easy to order and come on time for Xmas. Pleased with product like most of the things I’ve purchased from Joby."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michael Kenchington",
          "Nb_Reviews": 14,
          "Date": "2022-09-02T14:42:17.000Z",
          "Titre": "Item arrived & was as described",
          "Contenu": "Item arrived & was as described. Well made,glad to see the legs are metal."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adam",
          "Nb_Reviews": 30,
          "Date": "2023-10-30T16:37:40.000Z",
          "Titre": "Product came really quick and was well…",
          "Contenu": "Product came really quick and was well packaged"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Shahar Itzhaki",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T13:54:53.000Z",
          "Titre": "Arrived in time without problems."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roy",
          "Nb_Reviews": 7,
          "Date": "2022-03-11T08:45:29.000Z",
          "Titre": "Joby phone tripod",
          "Contenu": "A great product and excellent, speedy service."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rod",
          "Nb_Reviews": 9,
          "Date": "2022-06-16T16:26:40.000Z",
          "Titre": "Swift accurate and exactly what I…",
          "Contenu": "Swift accurate and exactly what I ordered."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Keith Blundell",
          "Nb_Reviews": 8,
          "Date": "2023-08-11T14:19:40.000Z",
          "Titre": "Great price and fast delivery."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T16:23:00.000Z",
          "Titre": "Easy ordering process and great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas McGinn",
          "Nb_Reviews": 6,
          "Date": "2022-06-24T14:30:03.000Z",
          "Titre": "Easy to use the website",
          "Contenu": "Easy to use the website. Quick delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelly",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T04:40:07.000Z",
          "Titre": "I love this little thing",
          "Contenu": "I love this little thing!  I use it all the time!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shirley",
          "Nb_Reviews": 8,
          "Date": "2022-10-05T14:12:56.000Z",
          "Titre": "excellent product",
          "Contenu": "excellent product, if a bit expensive, great service and communication. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon Baker",
          "Nb_Reviews": 6,
          "Date": "2022-05-25T17:52:40.000Z",
          "Titre": "Really quick delivery",
          "Contenu": "Really quick delivery, good products."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Richard Nosworthy",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T10:37:08.000Z",
          "Titre": "Very quick delivery",
          "Contenu": "Very quick delivery! Thanks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "L Bagnall",
          "Nb_Reviews": 3,
          "Date": "2023-01-11T10:01:30.000Z",
          "Titre": "Arrived fast",
          "Contenu": "Arrived fast.  Great product as always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Jeffries",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T16:09:09.000Z",
          "Titre": "received what I ordered in a timely…",
          "Contenu": "received what I ordered in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "The Afro Diet Act",
          "Nb_Reviews": 15,
          "Date": "2022-02-20T13:19:16.000Z",
          "Titre": "Ideal little tripod",
          "Contenu": "Ideal little device. Is perfectFor doing timelapses etc with my Osmo. Sort of think I should have gone for the bigger one, but that’s no fault of Joby, and I’ll probably buy it another at some point anyway. Ideal little tripod to Chuck in the bag alongside my Osmo case. Haven’t used it for anything heavier, but haven’t needed to. Would deffo buy again. Cheers"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 8,
          "Date": "2022-11-24T17:58:41.000Z",
          "Titre": "Joby RangePod Smart",
          "Contenu": "Good product, quick delivery"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ian",
          "Nb_Reviews": 2,
          "Date": "2022-01-14T09:25:48.000Z",
          "Titre": "I have always loved this stores…",
          "Contenu": "I have always loved this stores products but as a low income family we could not afford these quality products but in December 2021 they run a advent promotion and i won a product. It is normal for these promotion to ask customer to pay P&P but this was also free so it was a win win in more ways than one, so thank you JOBY. I must add though that a JOBY in Scotland means to go to toilet and do a number 2, just letting you know."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Phil Williams",
          "Nb_Reviews": 4,
          "Date": "2021-12-28T15:44:39.000Z",
          "Titre": "GorillaPod is awesome so is Ring Light.",
          "Contenu": "Excellent service especially in these difficult times. Purchased a collection of products but focused around the Ring Light all work perfectly, are well made a sturdy. We have owned and extensively used GorillaPod for over ten years during which they have performed perfectly using cameras from full frame DSLR  to cell phone. All these new products are equally well made and I'm sure will serve us well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mustafa Gurcan",
          "Nb_Reviews": 19,
          "Date": "2022-03-02T07:07:56.000Z",
          "Titre": "Excellent and versatile product which…",
          "Contenu": "Excellent and versatile product which enables standard smart phones to be connected to tripods to take pictures in situations where smart phones to be held at a fixed position in space. Extremely well engineered, manufactured and a robust product.I highly recommend this product without any reservation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connor d",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T14:45:06.000Z",
          "Titre": "Fast shipping and follow-up."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tracy",
          "Nb_Reviews": 20,
          "Date": "2021-12-17T07:03:58.000Z",
          "Titre": "Handy gadget.",
          "Contenu": "Good quality product. Phone attached to it means I can be hands free to answer and view it whilst doing other things. When resting I can wrap it round my leg with the bendy feet and view my phone like a Tv screen. Rarely do I loose where I have placed my phone now! Taking photos of moving objects with the phone propped up in the pod means no camera shake. Ideal litttle gadget. A great purchase!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyndell Core",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T05:08:19.000Z",
          "Titre": "Great design and built of solid materials",
          "Contenu": "The equipment is well designed that’s the first thing I noticed when I opened the box. It is constructed of Solid materials with clearly identified controls and connections.  This was easy to set up and the sound output as well as input can be set up for interviews or a single speaker.  The quality of sound for my meetings and presentations has improved and noticed by my colleagues.  Several coworkers saw it on my desk and wanted to borrow it.  It’s sturdy but light enough to take on travel.  Thank you for a great product"
        }
      ]
    }
  ]
}