{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "joinit.com",
      "Review": [
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HGNA Treasurer",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T17:28:43.000Z",
          "Titre": "The response to my issue/problem was rapid and informative.",
          "Contenu": "The response to my issue/problem was rapid and informative.  Unfortunately, it did not resolve my problem: trying to send an image via Join It email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Republican Club",
          "Nb_Reviews": 2,
          "Date": "2024-01-12T00:31:18.000Z",
          "Titre": "Attentive assistance …",
          "Contenu": "Attentive assistance with all of my questions and issues.  Problems handled promptly.  There is always a follow-up to make sure all issues are resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CSSA Admin - Jon Schwark",
          "Nb_Reviews": 1,
          "Date": "2024-01-02T19:28:55.000Z",
          "Titre": "Joinit has a modern backend for…",
          "Contenu": "Joinit has a modern backend for non-profits to manage their membership. Lots of connectivity to other systems you might use, and great customer support right on your dashboard. They are constantly improving and updating.I've been using them for a couple of groups and appreciate their system and their customer service so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-12-24T20:28:18.000Z",
          "Titre": "Powerful platform, easy to set up",
          "Contenu": "As a non-profit without a big tech team, it can be difficult to find tools that are both well built and also easy to set up. Join It has a great combination of powerful features, affordable price, and ease of configuration and use. I'd highly recommend it to anyone running a membership program!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "NJ",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T03:01:48.000Z",
          "Titre": "Don't bother with the others",
          "Contenu": "This is the third time I've used JoinIt.  By far the best laid out and intuitive membership system I've seen and used.  They have integrated emails, great renewal options and integrations with other apps that leave the others for dead.They also have a free plan for up to 50 members to get you started.  Their service is also great. It's fast, personal and complete.  Thanks guys..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-29T18:10:28.000Z",
          "Titre": "The built in chat support is very…",
          "Contenu": "The built in chat support is very helpful. They always answer within a minute or two and are very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ForeverGreen Trails",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T03:32:16.000Z",
          "Titre": "JoinIt makes it easy to dip a toe into membership management",
          "Contenu": "As a tiny but growing nonprofit, a low-cost solution is important for us. JoinIt has that plus a decently attractive interface and helpful tech support. It's also clear that as we grow there are additional features we might need and opt into. That scalability is nice and it's in fairly plain language. Overly complex solutions aren't always the best or most welcoming for smaller membership organizations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "California",
          "Nb_Reviews": 1,
          "Date": "2023-12-30T01:51:38.000Z",
          "Titre": "Quick reply!",
          "Contenu": "The answers were very helpful and easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T17:55:52.000Z",
          "Titre": "Easy migration, good features, reasonable price",
          "Contenu": "We migrated from a package with features that our users were not using to a simpler one.  JoinIt does what we want: allows renewal notices, provides various types of memberships, coordinates with other services for payment, email and events, has member access to a directory.  All at a reasonable price.  I am very happy with it so far.  They imported our 400+ database in about an hour using a template they provide.  Support has been great."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "NJ",
          "Nb_Reviews": 2,
          "Date": "2023-12-31T09:49:29.000Z",
          "Titre": "Always good",
          "Contenu": "Always good. Always reliable. Always easy to understand, follow and use - and always helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim San Antonio Cerveceros",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T21:40:37.000Z",
          "Titre": "Had a problem finding a billing invoice…",
          "Contenu": "Had a problem finding a billing invoice on the JoinIt dashboard. Activated chat session and received quick response and resolution to my issue. Chat rep found we had notification turned off. Rep activated setting and directed me where to find billing info on website.  Really liked the chat rep's availability, quick, and concise replies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Leonard",
          "Nb_Reviews": 2,
          "Date": "2023-01-22T19:08:18.000Z",
          "Titre": "The joinit.org staff is very responsive and helpful!",
          "Contenu": "The joinit.org staff is very responsive to my questions about using their membership database. I did not initially set up the joinit database for our organization, so I have some learning to do. There are always different ways that members choose to pay, some even find old links and use payment methods that are no longer current. Some use failed credit cards and then cancel their auto rebilling and casue us headaches so the joinit staff helps problem solve with those. These databases are somewhat like a word processing program where there are many more capabiliities than a given user may be using. I am responible for maintaining the system and the staff have been very patient in their Chats online. I am still learning, thought bit by bit Ihope to become proficient. Een though they are not officially staffes on weekends, I was surprised that they did help me on a Saturday!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Margaret Hemsley",
          "Nb_Reviews": 5,
          "Date": "2023-08-01T10:15:04.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service and response time for  people learning how to use this membership system. We are a not-for-profit sports and recreation club and are finding we can meet our needs in membership management at a reasonable cost.  A great software product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Republican Club",
          "Nb_Reviews": 2,
          "Date": "2023-01-18T19:21:06.000Z",
          "Titre": "Quick and clear responses",
          "Contenu": "I appreciate the quick and clear responses to questions I have in navigating Join It.  I am new to this program, so having guidance using videos allows me to refine the program to meet our needs better.  Thank you to the Join It team for their help."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeff",
          "Nb_Reviews": 13,
          "Date": "2022-11-02T02:01:04.000Z",
          "Titre": "\"Under the hood\" support when I needed it",
          "Contenu": "I had an issue with how my predecessor had set up our membership \"Types\" and I was unsure how to go about simplifying the system. I was given sound guidance by the support team (Leah). They helped me (with a bit of TechSup on their side) to regularise our membership system and I am grateful for that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Paraskevopoulos",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T03:04:08.000Z",
          "Titre": "Love JoinIt!",
          "Contenu": "The interface of JoinIt is incredibly intuitive and easy to use. There are a ton of ways to run reports. The few times that I do need support, the team at JoinIt responds quickly and efficiently!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T21:07:50.000Z",
          "Titre": "Fabulous first impression!",
          "Contenu": "We're just in the first day of our trial period and are busily checking out all the features. We needed to create a second admin and didn't know how to do it. We asked the Live Chat for help and got a Real Live Person in under two minutes. She pointed us to the instructions and checked to be sure we successfully added the second admin. Done and done! So easy! Great support! We're pumped."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Freeman",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T18:12:14.000Z",
          "Titre": "This is a great Membership System",
          "Contenu": "This is a great Membership System, because both the design of the system and very responsive service from staff from Join-It. Highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Historic Flat Rock, Inc.",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T21:18:42.000Z",
          "Titre": "Leah was a great help and linked me…",
          "Contenu": "Leah was a great help and linked me right into the button I needed for the report I was trying for.  Always there, and always helpful, JoinIt is a great asset to our organization!  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jeff Fitzgerald",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T04:13:02.000Z",
          "Titre": "The team at Join it are really on the BALL",
          "Contenu": "The team at Join it are really on the ball, and are very responsive to questions, and and come up with easily understandable solutions. I recommend them strongly."
        },
        {
          "Note": 5,
          "Lieu": "QA",
          "Pseudo": "Essra Almarzouqi",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T04:23:08.000Z",
          "Titre": "It’s nice to go back to joinit because…",
          "Contenu": "It’s nice to go back to joinit because I have problems in doing membership card and paying money but I don’t have new card to pay order forever I’m wondering to be team of Henry danger to make with them action and comedy and acting , and make funny and also I know the secret of jacenorman he is Henry danger because he promise cooperbarnes don’t tell anyone if anybody now they will fall down . And thank you very much for chatting in joinit ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Historic Flat Rock, Inc.",
          "Nb_Reviews": 3,
          "Date": "2023-01-06T21:19:10.000Z",
          "Titre": "JoinIt is Wonderful!",
          "Contenu": "JoinIt is an extremely simple company to work with.  The software is straightforward and adaptable.  It is easy to sync with communication software.  The Customer Service personnel are reliable and quick to respond with pleasant and discerning advice by phone or chat."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Mairead Boland",
          "Nb_Reviews": 3,
          "Date": "2023-04-23T19:11:41.000Z",
          "Titre": "Quick responses. Pro-active help.",
          "Contenu": "Very fast response to any questions. Assistance offered proactively.Very good help and FAQ content.Good software that is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeff",
          "Nb_Reviews": 13,
          "Date": "2022-10-20T12:02:10.000Z",
          "Titre": "Very good support - with follow-up",
          "Contenu": "I sent a request for support which was answered promptly and efficiently. A couple of days later the support team reached out to me to check that I had managed to solve my issue. I am impressed by the follow-up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maygene Daniels",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T23:14:29.000Z",
          "Titre": "JoinIt has great customer service and continues to evolve.",
          "Contenu": "JoinIt consistently has served our organizations needs. The Support Center has excellent, clear articles, and the customer support team without exception has answered questions quickly and clearly Importantly, the platform continues to evolve with new features.  We're highly satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alana Mahoney",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T15:35:59.000Z",
          "Titre": "Love Join It",
          "Contenu": "Love Join It!  It's so intuitive and easy to use.  They are always coming up with new features and the help staff is very responsive!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Historic Flat Rock, Inc.",
          "Nb_Reviews": 3,
          "Date": "2023-08-25T18:38:31.000Z",
          "Titre": "The customer service representatives…",
          "Contenu": "The customer service representatives were extremely helpful as together we made some changes to the \"automatic\" settings in our database.  Their expertise proved invaluable in improving our own customer service!  Thank you, JoinIt!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RJ Wyatt",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T19:08:35.000Z",
          "Titre": "Pristine Customer Service!",
          "Contenu": "A wonderful company to do business with! Always great customer service, as well as wonderful services that are provided!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Leonard",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T17:56:47.000Z",
          "Titre": "Joinit staff is quick",
          "Contenu": "Joinit staff is always very quick and concise and responding to problems with credit card privacy, etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren Steffel",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T21:06:03.000Z",
          "Titre": "JoinIt: Makes life easy and offers great customer support",
          "Contenu": "JoinIt is easy to navigate, and helps us communicate with members and add/renew memberships with extremely low administrative demands. The customer service is extremely helpful and responds quickly whenever we have a question."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Don Griffith",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T21:50:59.000Z",
          "Titre": "Start with a bot - end with a real person",
          "Contenu": "I just had a great chat with Join It help. It went from a bot to a real person quickly. And the real person fixed things very quickly. Real help from a real person is invaluable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil Alvarado",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T23:03:54.000Z",
          "Titre": "Cycling Club Membership",
          "Contenu": "We are a cycling club in Colorado and appreciate the responsiveness during the onboarding with JoinIt. So far so good!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeff",
          "Nb_Reviews": 13,
          "Date": "2023-04-19T13:47:24.000Z",
          "Titre": "The support team are very understanding…",
          "Contenu": "The support team are very understanding even when the problem is 100% user-error!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robyn Moses",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T01:14:19.000Z",
          "Titre": "It was answered and handled immediately"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Brett G Bike SA",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T00:18:43.000Z",
          "Titre": "Very responsive and supportive",
          "Contenu": "Very responsive and supportive. A wonderful system run by a wonderful team."
        }
      ]
    }
  ]
}