{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "kickresume.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "scaneng",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T18:29:52.000Z",
          "Titre": "Doesn't work",
          "Contenu": "Doesn't work. Difficult to cancel subscription.  Not many browsers supported. A bit of a hoax, if you ask me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Greever",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T03:19:53.000Z",
          "Titre": "Disapointed",
          "Contenu": "The platform does not allow a lot of customization for your resume/cv. Also, you have to pay an extra cost to check for grammar on top of your already paid premium account. You can essentially get the same product for free via other platforms."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J.Campbell El All rights Reser",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T19:45:16.000Z",
          "Titre": "This website scammed me for $85 they…",
          "Contenu": "This website scammed me for $85 they took my last. Worst site ever."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Bruno De Souza",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T14:05:28.000Z",
          "Titre": "don't offer support to portuguese",
          "Contenu": "Hello!I received this email, and I can't understand why. After my purchase, I canceled my account hours later because Kickresume doesn't offer support in Portuguese.It's essential to note that I filed a complaint since you didn't exclude the paid subscription amount from my credit card bill. I need to resolve this quickly!Thank you,Bruno"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alison Hawks",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T14:38:22.000Z",
          "Titre": "Use the free version",
          "Contenu": "Use the free version. I regrettably used the paid version. The templates look great, but their ai is pretty terrible. I had to run it through, open ai and teal Resume Genius, because Kick would not even give me proper suggestions. After using 3 other programs, and getting the most help from Resume Genius, I pressed the rewrite feature, just to see if that is where Kick would shine. Nope, absolutely terrible. It was repetitive but in a really obvious way. Like using the word 'spearheaded\" for the  description of every single job experience. For the first bulletpoint, no less. I do think they have the most attractive templates, but that's the only positive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T22:47:34.000Z",
          "Titre": "Pretty terrible",
          "Contenu": "Pretty terrible, very limited selection of templates that are really not useable if you have any sort of technical job.  The mechanics of the AI are clunky and it will rewrite entire sections rather than single bullets and merge different thoughts amongst bullet points.  I paid for annual but i will not be using again, I basically just paid for me to write my own resume myself.  If you work in HR maybe this will work for you but i doubt it."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ramesh",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T15:11:21.000Z",
          "Titre": "This is the worst customer support",
          "Contenu": "This is the worst customer support i ever faced and even after mentioning my problem in detail and still no solution after 5 days.Resume checker is not responding to the uploaded resume and going back to the dashboard.Its not even opening the resume I created on the websiteEven after paying for the premium its just poor response from your Customer Service Mr.MartinBetter replace him and find someone else who can find a solution.I don't need premium response for the premium i paid. Just a solution for the problem would be fine."
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Bel",
          "Nb_Reviews": 2,
          "Date": "2023-05-11T09:32:57.000Z",
          "Titre": "This site is very clunky and not very functional.",
          "Contenu": "The AI is extremely basic and the UX isn't intuitive.  It makes you type in your content from your LinkedIn profile, and when you upload an existing PDF of your resume, it tells you what repetitive words you use, but doesn't allow you to edit it on screen.  Also, it doesn't advise whether its resume templates are ATS friendly or not."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Botezatu Paul-Stefan",
          "Nb_Reviews": 6,
          "Date": "2023-07-13T10:53:03.000Z",
          "Titre": "So far bad experience. False advertising.",
          "Contenu": "So far bad experience.I've paid the annual \"Premium\" membership where you you should get priority support, but that's just false advertising.Normal account- 2+days response timePremium account - 2+days response time.CV Checker function not working."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 36,
          "Date": "2023-03-31T15:49:37.000Z",
          "Titre": "Deceptive website that appears to…",
          "Contenu": "Deceptive website that appears to assist with resume creation, only to require payment at the end with no warning, bait-and-switching the design and excluding elements you created.1/5.3/31/2023 Update: I've listed all of the places that Kickresume states they offer a free resume service. I can't upload images of these sections so I have to list them instead, blame TrustPilot:1. Kickresume's Own Tagline: \"Stunning Templates, Easy to Use, Try for FREE\" [emphasis mine]2. Kickresume's Homepage: \"Free basic template\"3. Kickresume's Resume Page: \"Kickresume lets you create a resume for free as long as you stick to our free customization options.\"In case they change it, you can confirm the false advertising above by checking what their homepage looked like as of this March 2023 review on Archive.org."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T19:13:44.000Z",
          "Titre": "You currently cannot download your…",
          "Contenu": "You currently cannot download your resume. It's been like this for over 2 weeks. It's impossible to get in contact with support. Only by e-mail if they decide to reply. Everything works, but the most important aspect. No excuse for that!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter",
          "Nb_Reviews": 5,
          "Date": "2023-06-15T21:00:19.000Z",
          "Titre": "Pricing not transparent",
          "Contenu": "The site acts as free until you build your resume. Imagine the disappointment after spending time building it, and you realise that in the free package, you can export only past two jobs..."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Venkata Sai Rohit Kumar Chakka",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:19:16.000Z",
          "Titre": "The whole experience was only made for…",
          "Contenu": "The whole experience was only made for other countries. Not for Indian students and indian employees. A fresher can't even prepare his resume on this app"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jenny Cavanaugh-Bond Inky Paws",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T15:30:17.000Z",
          "Titre": "Misleading refund policy",
          "Contenu": "I cancelled my account the same day as it didn't have the features I wanted/needed.At no point during the process was it mentioned that to refund, I would need to contact them separately. I assumed that once cancelled within 14 days, a refund would be forthcoming. I contacted support who told me as I hadn't requested a refund in the 14 days I couldn't have a refund. But nowhere in the cancellation process was this additional step mentioned. This is deliberately misleading and I have had to raise this as a dispute with paypal. I do not recommend at all."
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "Sa",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T17:20:29.000Z",
          "Titre": "Not user friendly",
          "Contenu": "Not user friendly. I couldn't upload my resume and generate a reviewed one. the add sells the concept well but the concept doesn't deliver. I wish to unsubscribe but I can't yet find a link to do so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Guy Saurbaugh",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T22:50:02.000Z",
          "Titre": "Company misled how easy this was to do",
          "Contenu": "Company misled how easy this was to do. It is not. There is a lot of manual labor. I expected to be able to upload my resume and the application would make updates and/or suggestions or actually redo the resume. Sorry, not worth it to me."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Tulika Singh",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T17:53:55.000Z",
          "Titre": "Kickresume is fraud",
          "Contenu": "Thanks for the fraud, Kickresume! You took payment of $13.63 and didn't give us the CV that we made. After the payment, the pdf file format that we have received doesn't open on any computer. Traitors! Deserves 0 star.My response after Kickresume's reply to my review:Wow, what a response for a public show, Kickresume! I have already emailed the customer care; have I received the CV yet? NO. Is my pdf reader updated? YES. Did I try opening the pdf on other computers? YES. I want an accessible CV as promised by your website. I spent hours to make it. Time is valuable. Stop the pretend, fraud!"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Antonii John",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T08:59:16.000Z",
          "Titre": "This is not worth of the cost you are…",
          "Contenu": "This is not worth of the cost you are charging for the monthly fees. When checked with the experts, they rejected all the templates in your given app. So to conclude your service was of no use to me and I wasted around EUR 18. Very disappointed. Also I had subscribed for 1 month but my card was charged for the second month also without prior notification, hence I want a refund for the 2nd month ASAP."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "BALAKRISHNA TAKKALLAPATI",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T03:08:24.000Z",
          "Titre": "Crteating everything from scratch",
          "Contenu": "Crteating everything from scratch, even after sharing package from linkedIn, did not want to share my contact from LinkedIN, so should work with my experience."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kash Behravan",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T23:17:00.000Z",
          "Titre": "Do not waste your time and money",
          "Contenu": "I do not recommend using this app for resume building. While it offers a resume builder, the quality is mediocre and the AI used for resume writing is subpar. The cover letter AI is especially disappointing. There are better free options available. Additionally, the app restricts cover letter writing to a mere 2000 characters, which is insufficient for a proper cover letter. The suggested text for the cover letter appears unprofessional as if written by a high school student."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Rimes",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T17:55:33.000Z",
          "Titre": "Didn’t work for me.",
          "Contenu": "Previous resume (Linked In Profile export) usually at least got a phone interview. New resume through Kickresume just got instant rejections. Going back to the LinkedIn profile."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus Fleming",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T02:34:02.000Z",
          "Titre": "Was not worth the investment",
          "Contenu": "Was not worth the investment. If you have senior level or executive level experience, this company is not a good fit."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Cathy Braiden",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T01:02:23.000Z",
          "Titre": "Difficult to use",
          "Contenu": "Difficult to use says free until you go to print then you have to upgrade still couldn't print or download. A complete waste of money now I cant get my money back!Do not get sucked in!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Akriti Singh",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T17:34:59.000Z",
          "Titre": "My membership was cancelled only after…",
          "Contenu": "My membership was cancelled only after using it for a week and no one informed me about it. And when I reached out to customer support they only told me that my membership is cancelled and they have refunded the money and when I asked for the reason for the cancellation again they told me that my money has been refunded. I do not think that this is the right way to treat a customer and leave them hanging in the middle without any proper explanation and apologies and on top of that I do not think that giving them a one or two-line answer is appropriate.On the other hand, I wanted to express my heartfelt appreciation for the incredible assistance the website has provided me with in crafting my resume.As I worked through the resume-building process, I was consistently impressed by the user-friendly interface and the comprehensive range of features available. The step-by-step guidance, resume templates, and content suggestions made the daunting task of creating a resume feel manageable and even enjoyable. The website's attention to detail and commitment to helping users present their skills and experiences in the best light truly set it apart.Moreover, the resume-writing tips and guides Kickresume offers have been invaluable in enhancing the overall quality of my resume."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy D",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T19:50:06.000Z",
          "Titre": "Your product can’t be used in a way…",
          "Contenu": "Your product can’t be used in a way that is actually productive for your clients."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Andualem Mhertu",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T10:14:56.000Z",
          "Titre": "I was desperately looking for this…",
          "Contenu": "I was desperately looking for this position it’s was one kind of jobs am looking for"
        },
        {
          "Note": 1,
          "Lieu": "SG",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T15:27:25.000Z",
          "Titre": "Fancy templates but not ATS friendly",
          "Contenu": "Fancy templates but not ATS friendly. Had to redo my whole CV to land some interviews. Don’t waste your money on this and stick to ATS friendly templates in word format."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "TH",
          "Nb_Reviews": 3,
          "Date": "2023-07-14T17:33:19.000Z",
          "Titre": "asks you to upload a resume and then…",
          "Contenu": "asks you to upload a resume and then doesnt do anything with it.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt D",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T20:40:09.000Z",
          "Titre": "Terrible product and 14 day money back…",
          "Contenu": "Terrible product and 14 day money back guarantee is no where to be had"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn Haines",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T02:21:07.000Z",
          "Titre": "I feel lied to",
          "Contenu": "I feel as if they lead you to believe that you can make free resumes on this site, I personally didn't see anywhere where it said I had to pay, then after making an entire resume, which I think aren't even as good as the Google Docs ones, I felt surprised when asked to pay $2 for a resume I spent time working on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chicken Doodle",
          "Nb_Reviews": 1,
          "Date": "2022-08-07T18:43:45.000Z",
          "Titre": "Overpriced for the limited editing…",
          "Contenu": "Overpriced for the limited editing abilities. You can alter select colors and choose a font but everything else is locked - so if you want to alter margins or move entire text blocks you are stuck. Disappointing to find this out after spending $50 for a year of access I won't be using."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Paden",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T16:46:00.000Z",
          "Titre": "The premium templates on this site are…",
          "Contenu": "The premium templates on this site are not good and I would recommend using another service. I purchased the premium upgrade ($19/mo) and wanted to cancel by the next day. They would not refund me as I \"downloaded some of the content\" which was a free resume template anyway. All in all I would not recommend them as a choice for resume building.edit:to their reply: youtube.co m/watch?v=PoXv5r2lgqU"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "M Harish",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T17:12:33.000Z",
          "Titre": "Looks suspicious for payments",
          "Contenu": "The site is not clear. I subscribed, but after clicking on customer support it redirected to new site of saying some career center .it is very suspicious. why it is redirecting to carrer center new website  if I click on support. Is no way to contact support then?. I highly doubted with suspicious activity and thought unecessarily shared card details and I immediately unsubscribed. not trusting this website for payment any more."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Nomad",
          "Nb_Reviews": 2,
          "Date": "2021-06-14T08:12:19.000Z",
          "Titre": "it's not very customisable",
          "Contenu": "it's not very customisable - Wanted to choose my graph of choice and could not- wanted to move my dates to right hand side so my roles and company stood out. Support said no.- wanted to reduce line spacing so kept it 2 pages rather than 2 lines over. Not possible- wanted to use layout of work experience from one template with header style of another template. Not possibleSupport not very knowledgable. UnhelpfulInformation available is too generic. Much better information on standard search engine sites."
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Sebastian Caris",
          "Nb_Reviews": 3,
          "Date": "2020-10-29T15:35:03.000Z",
          "Titre": "Invalid charges on my credit card",
          "Contenu": "I used Kickresume last year, and I have to admit it was all very nice and helpful. After creating a number of CVs  I cancelled my subscription last year, only to find out that they have been taking my money for 3 months now (Since August 2020), without me even logging into the page or adding a new subscription. This is a theft and I demand my money back immediately."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "RafaelBranco",
          "Nb_Reviews": 5,
          "Date": "2022-05-04T23:44:37.000Z",
          "Titre": "Bad service.",
          "Contenu": "Don't be fooled.Every single template is hidden behind a pay wall. Even if you use none of the \"premium\" features the template will still come out like a 9 year old made on word."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nyle Alliss",
          "Nb_Reviews": 1,
          "Date": "2020-08-24T17:56:53.000Z",
          "Titre": "Don't waste your time if you intend to use this website for free…",
          "Contenu": "Tried to build a CV as a free user only to spend 2 hours to find out that even though I'm using a free design I can't access my CV without subscribing. I didn't realize that I was limited by the number of subsections you can have for free, I'm assuming it's supposed to be this way so people feel they have to pay so their time isn't all wasted. The best thing is when I tried a new and completely blank CV and only add my name I still couldn't access without paying. Websites are nothing but a scam, wish I could give 0 stars."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "supreet muppa",
          "Nb_Reviews": 1,
          "Date": "2019-10-10T21:03:42.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service. The chat states that someone will reply within a few hours, it's been a whole day and no one has responded. They are a customer-oriented company, and can't even provide proper customer service. I'm in sales,you respond as fast as you can to prospects and customers. This is ridiculous. On top of that, I don't want a full month of service after I canceled my subscription on the same day within hours of each other. I want a refund for this horrible experience, and I don't care how good your software is."
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Saleh Bamoukrah",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T13:21:53.000Z",
          "Titre": "Dear Kickersume Team",
          "Contenu": "Dear Kickersume Team I would like to express my total rejection of your subscription service procedures based on my cancelation by unsubscribing since last month based on the confirmation mail was received from your end as shown below I discovered there was double detection of the month of July and after canceled officially the subscription I surprised to know that there is a new detection was made from my Credit Card this August 2020 which is un legally at all. according to the worse experience that I pass through it I need to refund me the detected amount which is almost three times my Credit account ASA."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Héctor Javier García Baeza",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T13:41:47.000Z",
          "Titre": "The AI help does not work in Spanish"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Ronnie De Wit",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T19:55:28.000Z",
          "Titre": "One of the worst site I have seen to…",
          "Contenu": "One of the worst site I have seen to create a free cv. Almost every option you need to build a good cv is premium. Hardly impossible to create your cv for free."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joanne Sheffield",
          "Nb_Reviews": 4,
          "Date": "2020-11-02T10:50:39.000Z",
          "Titre": "Unclear website",
          "Contenu": "I think your templates are good but your Site is not very clear on what is on offer. There is no one off option for buying the resume you have done."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Candle Light",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T18:44:25.000Z",
          "Titre": "Was not able to edit templates"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Maple",
          "Nb_Reviews": 1,
          "Date": "2020-12-06T14:21:30.000Z",
          "Titre": "I haven’t choose the yearly premium",
          "Contenu": "I haven’t choose the yearly premium. I only want to buy one month they charge me whole year. So how can I ask for refund. Really bad experience."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sergio Dell'Osso",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T22:10:25.000Z",
          "Titre": "I would give zero if I could",
          "Contenu": "I would give zero if I could. Very expensive, and not worth you money. Customer service is an absolute joke."
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Elon Musk",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T01:18:14.000Z",
          "Titre": "Free plan is deceptive",
          "Contenu": "Free plan is deceptive, makes it look like it's free but after 2 sections it need to upgrade"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2019-12-05T09:42:10.000Z",
          "Titre": "Not happy at all.",
          "Contenu": "Not happy at all.Very limited designs.They are only after your $$$ the customer does not come first."
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Sebastian Caris",
          "Nb_Reviews": 3,
          "Date": "2020-11-25T19:24:37.000Z",
          "Titre": "You did NOT refund me \"all\" of the…",
          "Contenu": "You did NOT refund me \"all\" of the payments. Just for clarification."
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Maen Aliswed",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T09:48:56.000Z",
          "Titre": "00000",
          "Contenu": "0000000000"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Hitesh Walia",
          "Nb_Reviews": 2,
          "Date": "2020-08-06T09:43:05.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 2,
          "Lieu": "IQ",
          "Pseudo": "Malek Sabbouh",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T18:03:04.000Z",
          "Titre": "If we copare the use of Chat GPT 3.5 in…",
          "Contenu": "If we compare the use of Chat GPT 3.5 in creating cover letter will provide me with more powerful ones.While Kickresume is more for the style of the resume and the cover letter. When I subscribed I was excepting to make it easy for me more than the chat gbt."
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "Olga Volfova",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T04:38:38.000Z",
          "Titre": "Why everytime I want to change layout I…",
          "Contenu": "Why every time I want to change layout I also have to re-enter all the details again? Or where is the information saved - how di I retrieve it when I want to create a new resume?Why is there no upload option so that not all details must be entered?"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Mostafa El Gafy",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:54:55.000Z",
          "Titre": "Basically you cannot neither copy text…",
          "Contenu": "Basically you cannot neither copy text from PDF to use it at any website required to manually fill your information nor AI websites can use information. Moving forward to download the Doc to utilize the same also is not possible. Honestly it’s useless."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Heinz Yeo",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T01:07:11.000Z",
          "Titre": "This is not for people who are in IT.",
          "Contenu": "Problems:1. 0 customer support. I've fired of two different issues around saving. Whatever their cloud storage provider is, has problems exporting. 2. \"The AI Toolbox Analysis\" constant never works. \"Something went wrong\". Did you guys forget to pay your ChatGpt licensing fee?3. Non-modifiable templates. You have all these graphics that eat up crazy margins. If you're in Tech, DO NOT USE Kick Resume. I've paid for TealHQ, infinitely better.4. No ability to disable auto-saving. Resume's can be instantly butchered. Or at the very least add a feature that's read-only.5. Can only export to PDF. Export to Word is just text. Why even have that format at all.Pros:Some graphical resumes if you need that. Other than that it's mediocre. I would stay away from this if you're in IT. Stick with TealHQ."
        },
        {
          "Note": 2,
          "Lieu": "QA",
          "Pseudo": "ORABI ORABi",
          "Nb_Reviews": 2,
          "Date": "2023-07-07T12:25:01.000Z",
          "Titre": "Hi..",
          "Contenu": "Hi..I was Expecting recommendations  to improve my CV for as a senior Executive candiatae.., like ponting out repeated works, reducing word  counts ..etc..instead i got few comments on proofreading that took several days. Which was very easy to spot,one repeated sentence and the other was incomplete sentence."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "b marks",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T15:37:03.000Z",
          "Titre": "Not a bad start",
          "Contenu": "Not a bad start. I like the import LinkedIn profile feature.However...Samples of real world resumes are limited. The AI \"builder\" needs a lot of help with the wording, word choice, writing. As a creative I don't think the AI has enough of a vocabulary for my industry.The biggest area of improvement is the need for MORE customization. Unfortunately user is locked into presets and templates that don't allow much in the way of formatting, style/look or design. I suppose it has to be that way for now.If anything Kickresume helps one get off their ass. It got me started/motivated to begin the loathsome task of writing a resume.One thing that's important to note is that HR and recruiters use scanning software for resume intake. The preferred document type is MS word doc. While companies accept other formats like PDF files, the scanning software doesn't always recognize these. So your submission will likely be neglected. I'm not sure if/how KickResume addresses this.I would probably ask for a refund, but it was fun to use all the features and see what it spits out. Again you will have to modify most of what the AI generates."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Manning",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T21:37:25.000Z",
          "Titre": "Be careful. Works, but can harm you.",
          "Contenu": "Great product, BUT pdf export is scanned by Gmail and considered malicious. Luckily, a friend showed me. Protip: to solve this, open acrobat and print to pdf. It strips whatever the heck is in there that Gmail doesn't like. Ps. I am not crazy. I tested this on multiple Gmail accounts"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "ganesh kumar",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:27:25.000Z",
          "Titre": "Few options are available to choose…",
          "Contenu": "Few options are available to choose resume template"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ashleigh Richardson",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T01:05:57.000Z",
          "Titre": "It works",
          "Contenu": "It works; well enough that I pay. But at some point the lack of respect from support & product team to take feedback seriously, left me to just do recreation in a figma/canva type product.So great to get past the inertia of building a resume especially if youre changing departments/job fields and need the inspiration."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Dead Clown",
          "Nb_Reviews": 5,
          "Date": "2022-10-08T18:01:39.000Z",
          "Titre": "Too expensive",
          "Contenu": "Too expensive. How can you afford to pay 20 euro monthly fee while jobless? They should throw in some discount from time to time to attract customers instead  holding tight on such high prices.Update 8/10/2022\"Our annual premium plan is just $4/month. Give it a try!\" Uhm you smart guys...4$ monthy annual premium plan is even more expensive than 20$ whahaha 48$. Why not monthly fee of just 4$? Not everyone who got sacked worked for Google or Facebook or whatever company like all those happy people faces showing on your website."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Paritosh Rana",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T03:51:16.000Z",
          "Titre": "the templates are selective and to…",
          "Contenu": "the templates are selective and to write skills the preference are limited.I couldn't find it worth paying the charges and getting the membership"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chris Boisvert",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T12:14:57.000Z",
          "Titre": "It does not allow users to add…",
          "Contenu": "It does not allow users to add attachments to your portfolio. Would be much nicer if it did. Especially for the money compared to other sites like weebly that allow a user to add attachments. And there is nothing that says when you sign up about the inability to add attachments."
        },
        {
          "Note": 2,
          "Lieu": "DK",
          "Pseudo": "Eva",
          "Nb_Reviews": 118,
          "Date": "2019-04-12T11:14:59.000Z",
          "Titre": "Great tool, but it didn't save my latest work...",
          "Contenu": "Great tool - until some of my work disappeared. My new cover letter, which wasn't quite finish, but did include 6 hours work, is simply gone. \"Something went wrong\"; the Kickresume-program tells me. Yes, indeed something is wrong, and for me this means I need to start all over on a application, which deadlinie is later today. I have written to support, i have saved my other stuff in other places, and if this continues, its a serious problem. There are other programme like this out there."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Ronnie de Wit",
          "Nb_Reviews": 7,
          "Date": "2020-09-21T12:46:08.000Z",
          "Titre": "They have forgotten that ppl without jobs have no money",
          "Contenu": "I must say, as a regular user of Kickresume, the old website was great. Since they have decided to do a total upgrade with new designs the prices has almost doubled. Before in 2018/ 2019 i have paid 41 euro for a whole year. Nowadays they charge you 96$. so almost double. When do people realize that not every change is for the better. Why not just leave it the way it is. But no...changing is better, right? and doubling the prize.  They are so proud of their new site, they spent so much money on developers they have forgotten the purpose. Wake up kickresume! PPL without jobs have no money and they will not pay 96$"
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "@",
          "Nb_Reviews": 1,
          "Date": "2018-02-27T06:21:46.000Z",
          "Titre": "Lot of room for improvement",
          "Contenu": "Lot of room for improvement. Time consuming.Manually entering details is like going back ages, now a days most of the sites provide direct feed from files, sites like linkedin etc. No template for Business Development Manager. Seriously???"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Timothy Fitzpatrick",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T19:47:49.000Z",
          "Titre": "I purchased the $15.00 per month option…",
          "Contenu": "I purchased the $15.00 per month option to create a resume. When I printed it out, the bottom left half went off the page and some of it was missing. I tried cutting down some of the information and then it split some of it and put it at the top of the right-hand column.  It also put another header which is not necessary. There site advertises live chat, but I have scoured the site and there is no way to do that????? Also, I sent an e-mail which is all that is given in the \"contact\" section and no reply.....They are located in Europe so cannot call ....this is not what I call good customer service. I expect live chat to correct these issues if they are going to advertise that they have live chat.  There is no way for me to fix these issues on my own????"
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Anon ymous",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T05:23:35.000Z",
          "Titre": "Kickresume - pretty, but poor",
          "Contenu": "I've used KickResume off and on for the past few years, and I have to say that I can't recommend them further.This is for three main reasons:1. You don't get what you pay for. Yes, they have a variety of templates. Yes, there are a lot of visually appealing elements to the resume. But, frankly, over 80% of the resumes do not work with the extra fonts and adjustments without creating unnecessary overhangs, breaking words up without any actual basis (like leaving the last letter off of my name), and inconsistencies with branding between cover letter and resume templates (read: your name is all caps in one, but not the other).2. You pay for the templates and then lose access to them if you cancel your subscription. If I pay $19 dollars for access to premium templates, I should have permanent access to the resume with that template. If I try to change it, I should pay again - fine.  But charging me for a product that I can't access is wrong.3. The customer service is terrible. When I made a complaint about my problems with the resume templates, \"Nika\" (if that's even a real person) implied that my problems did warrant problem-solving because of a so-called new release.  In addition, she said that I didn't deserve a refund because of multiple downloads. As I pointed out to her, the problems occured when I downloaded the resumes. Ignorant of this problem, she did not respond.Also, as I have requested cancelation, I should not be charge for the next three months. KickResume has charged me, and I am not taking them to arbitration with my credit card company.By the way, a review of several of their positive reviews reveals that they use fake reviewers to up their positive score - good that they have time for this while not having time for customer service or product improvement."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "ashish singh",
          "Nb_Reviews": 1,
          "Date": "2018-01-07T03:22:10.000Z",
          "Titre": "Don't convert in excel correctly"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Jean-Marie Petit",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T05:15:52.000Z",
          "Titre": "Unprofesional template design"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T22:35:39.000Z",
          "Titre": "I think your company and your website are a real help.",
          "Contenu": "I think your company and your website are excellent.  I would not class myself as one of your most active users but it was helpful to me to revise my resume after being made redundant in my career of over 30 years."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hiatus",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T13:21:29.000Z",
          "Titre": "Cover Letter Writers Block No More",
          "Contenu": "Cover Letter Writers Block No MoreWhile kickresume is not doing all of the work for me it has been particularly useful in writing the first draft of my Cover Letters as I apply for jobs.  Applying for a lot of jobs is work and it's definitely shortening my process."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Hemanth Badda",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:54:34.000Z",
          "Titre": "I am not completely satisfied",
          "Contenu": "I am not completely satisfied; there is still room for improvement. For different titles with similar descriptions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Riakos Seraphim",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T09:20:30.000Z",
          "Titre": "My experience with Kickresume…",
          "Contenu": "First experience with Kickresume is very impressive, especially the structured templates and AI generated content that give you a path to follow.Repetition by AI of words, phrases and superlatives is a detractor.  You cannot key down the superlatives in rewrite. \"If you are 'light', you will shine.\"I would like to see a couple of simple templates that are less 'busy'.Also, AI analyzing the resume and bringing the conflicting paragraphs side by side and having all the suggested words in sight so that you can then drag and drop. That would be terrific.All in all, as someone that is hindered by dyslexia, this program has helped me immensely structure my thoughts.At the same time repetition as mentioned above have stifled me from finishing what I started. Thank you for the attention,All the best,Riakos"
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Vincenz Steiger",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T15:17:38.000Z",
          "Titre": "The Word conversion is horrible",
          "Contenu": "The Word conversion is horrible, why pay for so many great templates and have so little possibilities to use them. Especially for the cover letter, a word download would be great to make minor changes to the layout, but what you get when downloading has nothing to do with the original template. Furthermore, there are still not enough features to make CHF 20.00/month worth it. Disappointing, I will cancel this month"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Basboosah Karamella",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T14:55:43.000Z",
          "Titre": "Excellent.. as a start .. but!",
          "Contenu": "Excellent.. it would be even better if it could read from the old resume file and uploaded it into the website .. the current function doesn’t work properly although it is supposed to since it’s based on AI.Plus.. I’m still unable to find out how to create a matching resume cover letter based on AI."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine Griffith",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T15:29:45.000Z",
          "Titre": "I expected more! Based on what it says it can do and…",
          "Contenu": "Based on what it says it can do and what I’m paying for, I’m not impressed. It’s a pretty expensive to get a very basic level overview of your experience. The vocabulary isn’t inline with roles I’m applying for so I’m spending more time adding key words than not. I do like the layout and the cover letter features"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "No Thanks",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T18:26:49.000Z",
          "Titre": "My first resume \"broke\"? Broke? really?",
          "Contenu": "I broke my first resume because I put too many skills on it? And wow Lol your AI remix of my resume copy has gotten rejected everywhere compared to my straight forward resume which was getting me interviews. I am throwing away every change I made on my resume that Kick recommended."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mustafa Saeed",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T20:38:41.000Z",
          "Titre": "Fairly underwhelming for the price",
          "Contenu": "Resumes are OK. Wish there was more functionality for the price, for example adjusting margins. Very disappointed that outputting the document to work removes so much of the formatting. Also, because of the formatting, converting from PDF to Word does not product a useable document. Good for an end user making 1 or 2 resumes with limited work experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NIkolas Mercado",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T19:29:05.000Z",
          "Titre": "mixed feelings",
          "Contenu": "I made a financial commitment to this service, and I like some things and dislike some things. Yes, it makes a nice-looking resume, but the customizations can be annoying. The AI writer helps as a starting point for cover letters and resumes but does not make a final draft. I have worked this into my resume/cover letter writing routine. Maybe I am just bitter because I have had no luck with the job market, but I haven't had any interview requests since I started using this service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adele Major",
          "Nb_Reviews": 4,
          "Date": "2023-02-27T12:32:05.000Z",
          "Titre": "Great idea, small adjustments could make it more useful",
          "Contenu": "Kickresume is a great idea and the results are pretty! However, the resulting PDF doesn’t seem to be easily ingestible by job application tools. This means that, without a *lot* of manual adjustment, your CV will probably be rejected by some algorithm before it ever reaches a human."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T16:04:20.000Z",
          "Titre": "I have a love-hate relationship with…",
          "Contenu": "I have a love-hate relationship with this site. Does it create great looking resumes? Yes. But the formats are limited- especially if you are looking for a template that is more conservative and not colored in pink bubbles and doodles. The way the site is set up to input your resume info is VERY tedious. The copy and paste function is useless as the formatting is never correct. I understand this is probably to prevent skipping out on paying for full features- but it ultimately punishes the paying customer. I would only recommend if you are editing savvy and very patient. There are better resume creator options out there with a lower cost with more features."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Krishna Rangavajjala",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T17:00:18.000Z",
          "Titre": "Resume for a Delivery Manager/Release Train Engineer",
          "Contenu": "Delivery of software systems. My work history is very lengthy. I have been searching for a proficient AI resume builder that can condense my CV to a maximum of three pages. I spent two days working diligently on Kickresume. Could not achieve what I wanted. Share the role you are interested in, and Kickresume will develop an excellent resume for you. I do not want a theoretical summary of qualifications for a particular job designation. I am looking for a good resume with my real project/program experiences. Not only that, but I appreciate any help."
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "Mirka",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T14:58:00.000Z",
          "Titre": "Very useful app",
          "Contenu": "I like great designs and also you are able in some designs to get a lot of information on single page.What could be approved is, that the education /job experience do not sort itself automatically by the date. Also, if you want to add education /job in the middle of the existing list, you have to manually retype all the items to get a space for the item you want to insert."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mesfin Demissie",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T10:49:19.000Z",
          "Titre": "I like the resume editor",
          "Contenu": "I like the resume editor, that is good to work with it. It will be good to further improve it as sometimes the pages are not well displayed."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Suman",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T08:15:26.000Z",
          "Titre": "All is good  with resume content,but…",
          "Contenu": "All is good  with resume content,but not getting interview calls may be not sure if its due layoff season ."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Chid",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T01:37:08.000Z",
          "Titre": "Seems Good",
          "Contenu": "The website seems like a great website, I am yet to see significant results yet using it. Hopefully that would change in the future and I can increase the rating. So far I like it"
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Ian Sebastian",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T02:33:24.000Z",
          "Titre": "Nice experience, more design templates needed",
          "Contenu": "I like the general experience overall. Writing a resume is not a day to day task and most of the time when i have to make one I have to make it from scratch or from old pdf files that are hanging around, with no possible way to edit them.Kickresume helped me a lot with the bootstrapping of creating a new one without starting from zero, not having to also deal with the used old process of designing and aligning everything. I like resumes with some design flavor, as it's something appreciated on my field (software engineering; like colors, forms, icons and stuff).Sadly though, the available designs on premium are not a lot, so I had to stick with just one option that was nice for me. It'd be nice to have more designs available. Also, column configuration on a per \"fill-in\" item is not configurable, so you have to stick with either 1 or 2 columns depending on the template.Export does not allow you to change the design neither for further improvement, which was also a downer.Nevertheless, AI functionality and assisted creation experience is a breeze, which guarantees a more than optimal resume that can be used to reach the jobs you want"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phronsie Stopple",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T20:01:14.000Z",
          "Titre": "I would love the resume builder to work…",
          "Contenu": "I would love the resume builder to work like the cover letter does where it builds a resume based on the Job Description and then I can edit based on my real life experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sebren Green",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:44:33.000Z",
          "Titre": "had a lot of difficulty getting my…",
          "Contenu": "had a lot of difficulty getting my resume evaluated by AI. Full of bugs. Tried to reach out for help, but was not fixed."
        },
        {
          "Note": 3,
          "Lieu": "ZW",
          "Pseudo": "Nigel Maisvoreva",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:29:12.000Z",
          "Titre": "Experience was fairly good",
          "Contenu": "Experience was largely positive. I appreciated the AI's attention to detail and ability to contextualize my raw ideas into excellent CV bullets, but the restrictions on its use for premium users are disappointing. Please provide more ATS-tested resume templates. Considering that some parts of my cv were not acknowledged, I received an average score of 54% on the majority of my resume assessments."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Srikanth Pogaku",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T02:20:30.000Z",
          "Titre": "Easy to build",
          "Contenu": "Easy to build, no need to worry about the formatting,would be better if the spell check is included"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phillip Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T17:24:01.000Z",
          "Titre": "Was not able to use AI enhancements…",
          "Contenu": "Was not able to use AI enhancements even after getting premium service."
        },
        {
          "Note": 3,
          "Lieu": "UG",
          "Pseudo": "Vasco Oguzua",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T12:14:38.000Z",
          "Titre": "The cost of editing resume is too hight…",
          "Contenu": "The cost of editing resume is too hight even after subscription"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jean-Christophe Daude-Carrière",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T18:59:55.000Z",
          "Titre": "Doesn’t support my language"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Melanda Guenther",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T06:21:13.000Z",
          "Titre": "Quite a few limitations on word count",
          "Contenu": "Quite a few limitations on word count, slow"
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Ángela Marín López",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T10:17:26.000Z",
          "Titre": "Great resume templates, but...",
          "Contenu": "Kickresume has great resume templates, but I would like to have the option to move the photo, titles, etc, so I could personalize it, not just writing it."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Angela Granja",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T21:05:46.000Z",
          "Titre": "I think need to more option for…",
          "Contenu": "I think need to more option for modification and correcting row alignment"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry Rodricks",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T18:06:27.000Z",
          "Titre": "The design options does not let me sort…",
          "Contenu": "The design options does not let me sort work Ex sections. The AI program could do better in suggesting.Word exports does not give you the same look and feel when exported. I was hoping to edit the resume by exporting it in word."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "F Omorogieva",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T21:45:40.000Z",
          "Titre": "helpful and knowing more"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Tasneem Khan",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T22:04:39.000Z",
          "Titre": "Great Tool. Could use a few improvements",
          "Contenu": "Great tool with professional looking formats for resumes and cover letters. Would be great to have resumes and cover letters that come as a package with matching formats. Would also appreciate being able to change font size and being able to transport information to other templates without having to copy and paste all the information over."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "S R",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T08:56:52.000Z",
          "Titre": "A good product and a much improved support",
          "Contenu": "The resume builder is good and easy to use however their customer service is non-existent. I have lost access due to some issues with their integration with appleID and I have been bounced about between kickresume support and apple support. Its been 3 days and it has still not been resolved. Mind you I am a paid account user and this is the service I get.Updated*** After the initial hiccup with support I must say they have really come up on tops and been very proactive and helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Damonique Wright",
          "Nb_Reviews": 1,
          "Date": "2020-01-09T14:26:18.000Z",
          "Titre": "I like it when I used it",
          "Contenu": "I like it when I used it.  It gave me a nice design, but when I was finished and canceled my subscription they kept charging me.  I had to email to have them refund me and cancel.  I received an email that my subscription was canceled and refunded for November, but then they charged me again for December and January even though I have the email showing that they canceled it!"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Mukkamala Akhil",
          "Nb_Reviews": 1,
          "Date": "2017-06-21T03:03:46.000Z",
          "Titre": "Only Few Templates - Too Costly Package",
          "Contenu": "First things first, Few Templates are good but for skills category instead of circles there are stars which are not interview standard, Like this there are many defects in other resumes, The only resume I use is the basic resume with Extra tabs. Am unhappy."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Emilio Argumedo",
          "Nb_Reviews": 1,
          "Date": "2017-07-19T17:32:40.000Z",
          "Titre": "Its Good but needs some adjustments",
          "Contenu": "Its a good plataform that really helps you organice your info and show it in a good way.However it would be good if you could drag the info in the experiencie and studies field so when you add up new info you could reorganice the fields according to importance or chronologycally, with out having to erase all of them and rearrenge them manually having to create one by one.Also great feature of adding \"traits\" it really gives some edge, however i dont know why sometimes it would mix spanish and english while explaining some of the games and when showing the results and the end of each game"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tamara Kennard",
          "Nb_Reviews": 6,
          "Date": "2019-06-01T14:53:45.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. However, I do not need the service anymore. My only issue is that they can not be contacted by phone. I sent an email to cancel my membership today. So hopefully, I won’t be billed again next month for July."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Nat",
          "Nb_Reviews": 2,
          "Date": "2022-12-02T05:26:49.000Z",
          "Titre": "Great service! Just not good customer service",
          "Contenu": "I was working with an hr special and she told me about the site and got me started. I paid monthly for 3 months and still hadn’t found the right job, so I then decided to pay for a year in case I was working but wanted to apply for other position. This part I found annoying, after I paid for a year then they sent me a 30% off coupon to use on a year membership. When I asked customers service if the could credit or do anything for me they said NO. Kinda annoyed but do love how easy they make doing and adjusting my resume. Just pay for the year."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "Sina Yüceer",
          "Nb_Reviews": 1,
          "Date": "2020-04-20T14:32:35.000Z",
          "Titre": "Hi, my feedback",
          "Contenu": "Hi,It might be 4 or 5 stars but there are things to be revised, ı think.Firstly, if you write for example (5 years experience), the \")\" can not be viewed. It looks so on final copy (5 years experienceSecondly, when I try to open the pdf resume on Photoshop, the format looks corrupted. I don't know why.Thirdly, and maybe most important: Editing capability is weak. There are some other templates that I liked but I couldn't use them just because one of the section I have in resume is sticked to side area converselyt to other template. I can not simply change the positions of sections. You defined which is going to be on side bar, which is not.Also I can not highlight an area or title. Everything is defined formerly by you. Briefly, your software is like IOS, but I need an Android to make my own style resume."
        },
        {
          "Note": 3,
          "Lieu": "UY",
          "Pseudo": "Martin Bettati",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T23:27:51.000Z",
          "Titre": "More templates!",
          "Contenu": "(-) Not many templates(-) Not enough customization, specialy with spaces within each template(+) Good value for money"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "karla lili",
          "Nb_Reviews": 2,
          "Date": "2020-11-03T21:32:26.000Z",
          "Titre": "It is ok for a quick resume",
          "Contenu": "It is a good platform to do a quick resume but you don't have many options for customizations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Harshitha Reddy",
          "Nb_Reviews": 1,
          "Date": "2017-10-02T00:18:36.000Z",
          "Titre": "The tool would have been more effective …",
          "Contenu": "The tool would have been more effective if there was an option to change the sizes of different elements."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "RFM",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T08:31:57.000Z",
          "Titre": "Expected a more professional resume."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "AJ Cruz",
          "Nb_Reviews": 5,
          "Date": "2020-10-06T10:30:04.000Z",
          "Titre": "expensive",
          "Contenu": "It's so very expensive to make a resume here."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "olalekan Fadeyibi",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T16:48:38.000Z",
          "Titre": "Great time here"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "FelipeL",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T19:00:45.000Z",
          "Titre": "Too expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NY",
          "Nb_Reviews": 1,
          "Date": "2017-08-14T22:40:15.000Z",
          "Titre": "Average to Good…with room to be GREAT…",
          "Contenu": "From my personal experience, I have had frustratstion with the limited character space with \"open text\" sections when filling in job descriptions. However, I was impressed with the responsiveness & the \"fix\" that was put in place fairly quickly to remedy that particular issue.  Before purchasing any resume subscription, as there are so many to choose from, it came down to Kick, CV Maker, Slash CV, Canva, Cake resume, and the free options I looked at, Realtime CV, crystal resume, Enhancecv, & JOBCV.me all have great options and different formats along with many great templates and ways to be more innovative and creative to \"stand out\". However, for my immediate needs right now in the job market and the business I am in, Kickresume seemed at the time to best suit my needs, as I first heard about it through Product Hunt. First, I am impressed with the response from the development team when it comes to issues that arise with your users, that is the MOST CRITICAL variable when I sign up for site services like these. So, that is a huge plus, & not just the fact that the team responds when a user reach's out, they actually look into the issue and try to have a \"fix\" in place or help the customer out if it's a \"user\" issue and not a software/code problem.-Overall, the templates are good, the font choices are enough to get just about any look you want and all look good in text/resume formats.* What would make it GREAT!- Something that many many job seekers struggle with are gaps in work history, and the formats that you currently have, although you may not understand this, when the \"JOB TITLE\" and the Dates of that particular job are spread way way far apart on the page, it draws the eye, and attention to the recruiter, or hiring manager/compnay to this gap. So, you really only have 2 templates that somewhat mitigate this \"appearance\". The \"Green\" template which lists the job title, city/area, and then the dates right beneath, but highlights the job title in what ever color the user wants, which put the city/area and date in black right underneath, in affect, putting more focus on the title and vs the dates and city/region/area.  This may seem very trivial or something that users don't care about, but….. it is a BIG BIG deal because recruiters quickly scan resumes for a total of about 10 to 15 seconds, and when the date of a job is way way on the other side of the page, (isolated) away from the job title and city, this in a way puts BLINKING lights around a user that potentially only at a particular company/job/position for a short time, but it was significant because of the skill set or crtitcal networking/relationships/knowledge the candidate gained in the role, even though it was for a short time.  So, even though this may seem like a NON-ISSUE with your templates, it's actually a huge issue.  Had I known that I would not be able to manipulate the arrangement of how the: Job Title, Dates, City/region,  could be layed out on each job position section, (becuase of the industry I am in) I would have went with another site.Having the Job Title above the text description, or to the very left of the page, then have the dates of that position all the way over to the right of the page for that job, really is a huge problem and disadvantage for job seekers, applicants that want recruiters and companies to focus on the job description and skill sets, and not IMMEDIATELY have their eyes drawn over to the dates that particular job was held.So, because of this… I am limited to just 1 template, maybe one other because of this, which SUCKS!  I think this could be an easy fix, in giving the user the option to format how they want the job title, city/area, dates, etc formatted, or at the very least, being able to put the job title and dates all on one line. You guys have created some creative and eye catching templates which I am not able to take advantage of any of them due to this.Next - I catagorize your templates into basically only 2 versions; the one pager version where everything reads from left to right down the page, like reading an article.The 2nd version; is the 2 column version, which is split down the middle creating 2 sides of the page. This version (2 column version) is visually a wonderful idea, eye catching & a great way to get a 2 pg resume down to one if a recruiter or a web site won't upload a 2 pg document (which happens a lot). HOWEVER - this particular 2 column format looses it's effectiveness and utility for the thousands of workers, who work in industries that require more of a \"sentence, story structure\" for their job descriptions, vs. the job seekers/applicants who can simply use quick bullet points. For those people only needing to bullet out a quick few highlights per job, this 2 column format works nicely.  BUT, for everyone else who needs to type actual text, and not \"Bullet\" points, this format really looks horrible, and makes it difficult to read, especially if it's a 2 pg resume.However, if there was a way, for the user who wants to take advantage of all the 2 column templates your site has created, having the ability to widen the job description text box, or adjust the overall margins (right, left, top, bottom) would allow all the users that need to type in text, (not just quick bullet points) the freedom to use these 2 column templates your site designed.  Even just making the adjustment for a specific job description to fit on 1 column and not get pushed over to the right side column or even the next page, making is difficult to read and follow. Another additional or \"tweak\" that would GREATLY improve the templates you have (which 80% of them I can't use) is to have the functionality to minimize the Wasted Space at the top of the resume where the Name, contact info, e-mail, etc is placed.  Almost 99% of people in the healthcare/medical/research/pharma/etc sector of business DO NOT EVER USE PICTURES on their resume. Many of the templates have that option (which is great), however for all those thousands of users who will NEVER put their pictures on a resume, having the ability to shrink down that portion of the resume at the very top, or even to upload an image from another template that you have already used on your other pre-formated templates, almost like taking what you guys have already designed, and giving the user the ability to replace the area on the resume that is for a picture, and being able to place another formatted design that has already been created on another template.  OR - (What other resume sites are doing that is AWESOME), for all your customers/users that do not use photographs on their resumes, having the ability to design a quick \"logo\" or \"monogram\" of their initials, with some (pre-designed) options and colors a customer can choose from. You guys have in a way, essentially done a version of this with the \"Ladder\" template, which takes your intials, places them in a circle with an X in the circle, first & last initial on right & left.This is a great template I have wanted to use, however because of the job title, city/region/ and then the date beign all the way on the right side of the section, I cannot use this template.In addition, when choosing this template, along with a few others like, Rectangular, (Especially \"Blurred\") Pipeline, Doodle, Vegan, Dotts and Polygon, there is SO MUCH WASTED SPACE after the personal info header.  These templates are really fantastic and creative, but the amount of wasted space makes them totally unuseable for all the customers and users needing to type more text & content vs. bullets. If there was a way for the user to have an option to still use these great templates, but minimize the graphics, make them a bit smaller in scale for the page, push the top and bottom margins further up or down so the graphics could be thinner, almost like a border, instead of taking up almost 2 inches of the top 1/2 of the page, it would make a HUGE difference for all the customers that deciding to go with other resume sites instead of kick resume, becuase they have the options to take exsisting templates/graphics/pictures/monograms/symbols/ and size them just a bit smaller or bigger to fit their own needs. Polygon is a great example of this, the bottom graphic design is a much thinner line, giving a nice pop of color, but not OVERWHELMING the overall appearance.  Polygon is wonderful template, but because the user does not have any ability at all to shrink down the top colored graphics that in some instances for certain professional fields, is too too much, but it's still a great design if the user could just make is smaller, or even shift it to the left or right side, same with Blurred and Pipeline, great design, but no way to shrink it, so that it is \"scaled\" to be in proportion with the overall resume's look, (which many customers need). Another tweak - the way the \"Strenghts & Skills\" section is formatted. this is a OUTSTANDING idea (especially in the industries I mentioned above), however having other options that would Print and look cleaner with regards to the \"strengths\" section when the user can type in select words or phrases, then all those words get formatted into a \"square\" with rounded corners.  On a computer screen, this format looks very impressive….. BUT not so much when printed. Many of the templates you have designed, when using a darker color, this section makes the actual \"box\" that your word and/or phrase goes in very very dark, sometimes black, and your word/phrase \"white\"…this DOES NOT PRINT WELL.  Having a very more options around design, or format with the \"Strenghts/skills\" section and how it an be formated or designed on the page would really be huge.  The \"Circle or Dots\" design is fine, but not for a user wanting to list out just \"words\".  Having the ability to potenitally put: different symbols by each word in a variety of colors, No more room 4 comments..."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "new user",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T07:27:47.000Z",
          "Titre": "The templates are great",
          "Contenu": "The templates are great, intro done by AI is pretty good for the job description if you start with a fresh resume, however the paragraph rewriting for work experience needs more work, or experience shall I say. it is still quite unnatural especially for a professional, so I can't really use it just yet"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Abhishek Narse",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:26:19.000Z",
          "Titre": "Mechanical Project Manager",
          "Contenu": "Very much helpful"
        },
        {
          "Note": 4,
          "Lieu": "AZ",
          "Pseudo": "Emin S",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T15:01:32.000Z",
          "Titre": "In general",
          "Contenu": "In general, the interface is user friendly, good set of templates, well working auto formatting. Re possible improvements: AI suggestion is weaker than ChatGPT’s, also would be nice to have a little bit more flexibility on formatting within the chosen template."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Wa Ja",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T21:29:36.000Z",
          "Titre": "Variety of templates",
          "Contenu": "Variety of templates, easy to fill template. Professional look. Online link to ready resume for sharingAI is useful but needs more training. GPT is far better.Also ability to adjust margins and tables of frame sizes in edit mode. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Craig",
          "Nb_Reviews": 8,
          "Date": "2023-07-04T07:31:39.000Z",
          "Titre": "Buy it and save yourself time and sanity when searching for work",
          "Contenu": "I haven't landed a job but I have managed to secure a number of interviews since using Kickresume. Very simple to use and to edit when duplicating CVs for various job roles. It's definitely worth the investment if you're job hunting. Nice user experience plus you can create cover letters in such a short amount of time. Having Kickresume as your 'Go To' CV and Cover Letter writer is a no-brainer. Buy it and use it over and over again."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Agnese",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T16:58:42.000Z",
          "Titre": "Definately the best resume builder",
          "Contenu": "KickResume is definately the best tool to use if you want your CV to look professional but still interesting. After searching and trying to make my CV on all other sites I am still returning back to KickResume all the time. Only one disappointment - payment options does not work sometimes and can stop you from sending out your newly updated version. Other than that - service and features are perfectly fine."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Trop Tropski",
          "Nb_Reviews": 3,
          "Date": "2023-07-03T14:12:33.000Z",
          "Titre": "Pretty good",
          "Contenu": "The tool is a major upgrade if you have been using a simple word processor. I have used it about 2 years earlier and the addition of generative AI is welcome. However, there are only a few templates for the resume and you will quickly run out of options. I end up using two templates. Another surprising weakness is a complete lack of ability to edit the graphical design of the templates, e.g. there are only a few colors you can use, you cannot resize components of the design, you cannot mix the design component between the templates. All these could be easily upgraded by Kickresume."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Sunil Narine",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T23:48:55.000Z",
          "Titre": "Assess the results and effects of using Kickresume",
          "Contenu": "I appreciate the analysis feature of the site and the reviews because other AI site like Teal HQ does not analyze your existing resume.I encounter one issue where I was trying to share the website feature with a friend and until now her has not gotten the email from the site.I would suggest maybe making the site cater for the different level of people applying. E.g. someone applying for a Vice president position would not have the same type of resume as someone applying for an entry level position."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Senthil Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T10:55:01.000Z",
          "Titre": "Absolutely made easy to create Resume…",
          "Contenu": "Absolutely made easy to create Resume with the help of AI. Suggesting for an improvement that First name and last name font should be adjustable.Also, there is need for Title Below icon where one can include their profession in single line for the recruiter to see it below the name."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Zach Sullivan",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T15:57:45.000Z",
          "Titre": "Professional results.",
          "Contenu": "Produces quite a professional looking end result. Easy to use. Would be nice to allow for a bit more editing on the layouts or adding the ability to have multiple dates per job experience. A.I needs quite a bit of improvement, but without using it the end result is still worth it. Also price is a bit high compared to competitors, but overall not a bad value."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Onicah Ntswejakgosi",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T11:28:26.000Z",
          "Titre": "I recommend kickstart",
          "Contenu": "Using kickresume has been very helpful. The AI resume writing services really polished my resume and it looks so professional. Also, I think its worth the price that I paid. Some Resume apps cost more but do not have the features that kickresume has. The only downside to this app is that it does not have the option of uploading an already existing CV."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "emilia slocikova",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T17:08:37.000Z",
          "Titre": "Useful, BUT..",
          "Contenu": "A very useful web with many options and smart advice on how to write a better CV/cover letter. I would appraciate though to have some free hand when it comes to CV design. A few small adjustments could be nice, for ex. to be able to size different parts and move them aroud or having the possibility to upload picture to every template (I love one of the templates but unfortunately cannot use it as the picture cannot be added). I would either lower the premium price or work on these little things ;)"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Zohaib Hasan Naqvi",
          "Nb_Reviews": 3,
          "Date": "2023-02-23T15:10:43.000Z",
          "Titre": "Awesome tool!",
          "Contenu": "I can't thank Kickresume enough. It helped me create some wonderful CVs and Motivation letters. The tool itself is wonderful. However, I think it'd have been great if we could also customize margins to fit more content on one page. It's feature of free passes to two other members is a great way of marketing and as well providing value. Much recommended!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley Huizenga",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:39:23.000Z",
          "Titre": "Great Resume Builder!",
          "Contenu": "I really love how the formatting is already complete. There’s no rearranging or trying to line portions of your document up. I also really like that there are a number of unique section suggestions and graphs that can be added to a resume. I only wish I had the ability to customization fonts, letter size, spacing, alignment, etc further. Overall, highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Laura Junqueira",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:09:22.000Z",
          "Titre": "Very cool, but I stiil cannot rely only on it",
          "Contenu": "Pros:- Nice interface (easy to keep resumes and cover letters organised)- AI does overall a good job- Templates are pretty- Easy to use, creates the resumes fast and easyCons:- AI is not great if I wanna shape the CV to a specific job description (prefer chat GPT instead)- Limited characters for job titles- Limited characters to job descriptions (2,000) if I wanna use the AI to write the cover letter- Unable to exclude the small balls / bars on skills section or change the words (e.g., \"Full\" is weird for languages, \"Native\"/\"Fluent\" would be better) - for me this was the deal breaker that made me go back to Word."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh Lee",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T20:53:02.000Z",
          "Titre": "Mixed bag of positives with a few negatives",
          "Contenu": "What I like about Kickresume is the ease of use.  The content generated by their AI needs minimal editing and produces fantastic text. While the content generated by Kickresume is quite good the standard formatting leaves much to be desired.  In my experience Kickresume resumes don't export well.  When trying to open my exported resume in google docs I had to do a lot of work to format the resume that was ultimately in vain."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 3,
          "Date": "2023-06-17T16:54:52.000Z",
          "Titre": "It works really well but figuring out…",
          "Contenu": "It works really well but figuring out how to upload existing resume or duplicate a version is not intuitive.  I wish there were templates that were not double columns to avoid going to 3 pages.  Unless there’s research that columns work better.  Also the header with my name is way too huge.  I wish that could be modified.  It’s a bit much.  Watch the AI - it likes to overuse words too!  Lol"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aish Saminathan",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T15:43:33.000Z",
          "Titre": "Best in the market, with some improvements",
          "Contenu": "Glow: Best resume builder by far in the market. The templates are aesthetically pleasing and resume is ready within minutes if you are looking to enhance your current one. Goals: Pricey and AI write-ups could get lengthy."
        },
        {
          "Note": 4,
          "Lieu": "MW",
          "Pseudo": "LIMBIKANI KACHIKUNJE",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:30:31.000Z",
          "Titre": "The tool is awesome",
          "Contenu": "The tool is awesome, a good resume can be created in minutes and several templates are available increasing the choices.The monthly subscription price looks abit higher.Keep modifying to your best level, it's really helping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brennen Major",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T20:51:21.000Z",
          "Titre": "Good for starters",
          "Contenu": "This app is great for starters, and I must say that I had a positive overall experience. The user interface is seamless, and it made the resume creation process incredibly easy. I appreciate how intuitive the platform is, and it saved me a lot of time. However, I did encounter some issues with the add phase function, as it crashed often during my resume creation process. Despite the add phase function crashing, I would still rate Kickresume with four stars. The seamless UI and ease of creating a resume are strong points that shouldn't be overlooked. I would recommend Kickresume to others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. Kamal Chahine",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T21:20:14.000Z",
          "Titre": "Kick A$$ resume awaits!",
          "Contenu": "kickresume makes it so easy for you to start, modify, edit, and customize your resume without the stress. Please give kickresume a try and you will not be disappointed.Feature rich and the AI bot is so useful.The best investment you can make for yourself!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Tzouanos",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T22:42:00.000Z",
          "Titre": "You cannot download the resume in word…",
          "Contenu": "You cannot download the resume in word file. You cannot add a title below your name."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ben Chen",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T01:35:04.000Z",
          "Titre": "I am fond of the resume templates on…",
          "Contenu": "I am fond of the resume templates on this website, for their neat and tasteful design. It was through this website that I composed my own resume, and successfully landed a job. However, with regards to the AI technology implemented, I believe there is still room for more personalization. Some of the suggestions provided may not be suitable for everyone. For my own resume, I employed ChatGPT, which I found to be more adaptable than the template offered here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendan Fisher",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T19:56:21.000Z",
          "Titre": "Next level resumes and cover letters",
          "Contenu": "Kickresume has taken my already solid resume to the next level. It's also been a tremendous help in building some expertly crafted cover letters that have saved me a ton of time. Great all-round tool!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T16:09:35.000Z",
          "Titre": "Great number of templates",
          "Contenu": "Great number of templates, updating the job part is messy you should be able to update it in an specific order and not re-write all. When you are uploading the resume to a job app it can’t be read properly. Not sure about the resume and cover letter writing, I have not used it, had bad experiences with other companies in te past."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jared Collier",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T15:58:45.000Z",
          "Titre": "Would recommend Kickresume!",
          "Contenu": "Overall, a solid service for building a resume. Really appreciate the AI generate content and rewrite content features. Love the number of styles available. Would like to see the ability to add items from a \"master\" resume so that I don't have to build out each individual resume."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Isabela Siqueira",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T15:40:31.000Z",
          "Titre": "My thoughts on the UI",
          "Contenu": "Pros: friendly to edit the CV, many layouts to choose from.Cons: the layouts have some space limitations, so I have to tailor the CV to be shorter in order to fit a one-page model. The AI is very limited so the prompts I get are very mechanical and borderline childish so I don't use it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Puffer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T20:16:31.000Z",
          "Titre": "Happy user for the past few months.",
          "Contenu": "I have been using this application for about a month now and it's fantastic. The AI writer is a cool addition as well. There are a ton of templates to choose from which is great so I can tailor it to specific clients. I'd like to see a bit more customization from the alignments, spacing and some of the design. For example, the headers don't need to take up a 3rd of the resume."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "GOOD",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T05:56:31.000Z",
          "Titre": "I used this website to create my resume…",
          "Contenu": "I used this website to create my resume and I was very impressed by the quality and ease of use. The website has a variety of templates and designs to choose from, and it guides you through each step of the process. You can customize your resume to suit your industry and preferences, and download it in different formats. The website also offers tips and advice on how to write a compelling resume and avoid common mistakes. I would highly recommend this website to anyone who needs a professional and attractive resume."
        },
        {
          "Note": 4,
          "Lieu": "ZW",
          "Pseudo": "AlfredM",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T20:32:01.000Z",
          "Titre": "This site  would  appeal to the …",
          "Contenu": "This site  would  appeal to the  average  person in the way that it isvery simply  done, and  everything  is very easy to find.  There is nomessing  around  here, just the  information  that they want to conveypresented in the simplest way possible.  People with no technical background  would  definitely   appreciate  the  simplicity  and  ease  ofnavigation in this site."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RD",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T16:39:17.000Z",
          "Titre": "Mixed feelings",
          "Contenu": "I am creating a resume obviously because I need a job. Tried this site because it involved using Artificial Intelligence and I thought that would help make it more professional sounding. My process was to take the paragraph I had written myself and see what AI could do with it. Positive: AI used lots of action words and did make my past employment sound better overall. Negative: Where did the percentages come from!? I have never included any numbers in any of my descriptions, yet AI ended up including % I never entered! My previous employments did not involve sales or measurements. Examples: \"I improved sales by 39%.\" \"Customer service satisfaction rose by 13%\". Neither of these are true (where did they get those specific percentages from?) and I removed them. While I like the action words, I could have used Bing/Bard to find them. I do like that there are lots of different templates and once you enter your information you can preview all of them. Still learning the site and I haven't created a cover letter yet so let's see what happens! I paid for it and hope to get my money's worth. More specifically a JOB!"
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Julian Beggs",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:36:08.000Z",
          "Titre": "Super easy AI generated resume.",
          "Contenu": "Super easy to get an AI generated resume. Much easier to tweak existing text based on your own info, than starting for zero."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Kashif Rashid",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T13:32:02.000Z",
          "Titre": "It is a good Application, I think it is continuously becoming better.",
          "Contenu": "The Application has some great templates which match the context, text, and layout of your CV. It provides an easy-to-use interface to update the details on your CV, a lot of material can be reworded using AI. There is an analysis meter that provides context into how the CV can be improved."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T23:59:52.000Z",
          "Titre": "Professional and Easy to Use",
          "Contenu": "After being laid-off, I wanted to revamp my resume without spending hours on formatting. Kickresume has been great for creating multiple templates for each job application, and I've kept the subscription so I can easily edit as I continue to apply. I've gotten feedback from many recruiters that they love the easy to read format and how professional the final product looks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Johnson",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T05:56:18.000Z",
          "Titre": "Solid Resume Creation Tool w/ Lots of Helpful Extras",
          "Contenu": "Lots of templates and helpful advice. The video on cover letters is ridiculously informative. Resume creation UI is not as intuitive as it could be, but after using it to create and edit resumes a few times, I've figured everything out.Would be great for someone unfamiliar with creating resumes or someone who knows what they want on a resume and just wants a template to build it on. Great for DIY resumes (i.e. if you don't want to hire a service)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pedro Vergara",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:09:41.000Z",
          "Titre": "Good but lacks font sizing control",
          "Contenu": "Overall good tool but it does not let the user to change titles’ font sizing or spacing. I understand this is part of the template format but would be great to have more granular control over font sizes."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Scout",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T03:54:23.000Z",
          "Titre": "I love Kick resume",
          "Contenu": "I love Kick resume! It is quick and efficient way to develop a professional resume. I love the AI tool for writing your resume, it is quick and succinct. I find it hard to logon sometimes, I am not sure if that is because it is because of my location. I will continue to use this program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet Nowlin",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T23:22:40.000Z",
          "Titre": "Love the resume assistance!",
          "Contenu": "I love the AI assistant for the resume and especially the cover letters. I’ve been able to knock out a whole lot of them with the help! I do wish I could save design and content preferences for the cover letters, but this has saved me so much time and headache."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Aditya Andhalikar",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T19:15:09.000Z",
          "Titre": "So easy to use and worth the money",
          "Contenu": "so easy to use and worth the money. Very attractive resumes are created. tips and word analytics are also very useful to remove repetitive phases. Only challenge is from india payments with credit cards are an issue. I had to manage via a us friend paying for me. Only for that i cut 1 star."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Altheo",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T15:08:01.000Z",
          "Titre": "Great product that helped me tweak my…",
          "Contenu": "Great product that helped me tweak my resume for the next big role.  KickResume can also help with cover letters, websites and resignation letters.  I also found the Kickresume tool to be fair in cost as well."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Naavin Michael",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T01:36:50.000Z",
          "Titre": "Great App",
          "Contenu": "Provides many options for resume templates. The AI function provides breakdown of constantly used words to allow you to make further changes to enhance the resume."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Alihan",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T14:26:06.000Z",
          "Titre": "Experience matters",
          "Contenu": "- Number of provided templates is not a huge variety. and customizing the format of those is not a given option which impacts adversely the experience.- The AI is bringing so generic input and sometimes it is not relevant with the requirement.- The HR audit tools can not properly decode the generated PDF file and believe me that LinkedIn originated  documents are so properly decoded on third party HR sites.- the word version of the documents do not have any format* Given graphic options are limited and no geo related iconsOverall, the tool is promising but the product needs to be improved for the sustainability otherwise the users will not be happy while experience and self-confidence is 2 important keys between the jobs period."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jermaine Judson",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T17:49:39.000Z",
          "Titre": "Kickresume is truly a Godsend",
          "Contenu": "Kickresume is truly a Godsend, it allowed me to clean up my resume with ease and made the process a lot less stressful. I wanted to rate it a 4.5, but that's not an option. I'm confident that the team will continue to improve this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Makeba McCray",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T21:31:31.000Z",
          "Titre": "Great experience…..",
          "Contenu": "Great experience using the service, easy and intuitive.  Loved the AI suggestions would like to have more calls per month.  The cover letter templates were good, would like to have placement choices on items like the address and signatures"
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "Vlado Červený",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T15:32:39.000Z",
          "Titre": "Super",
          "Contenu": "Super, everyrhing Works fine, maybe to Split each item (CV, cover letter, etc.) Into clearer folder (possibility to adjuest them via date, name etc)"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Isabella Narvaez",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T04:28:34.000Z",
          "Titre": "Wonderful platform",
          "Contenu": "Wonderful platform, full of templates once you pay. It only has some features for English language. It's not cheap but it can save you. More customization is needed."
        },
        {
          "Note": 4,
          "Lieu": "AO",
          "Pseudo": "Karen Martins",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T16:38:35.000Z",
          "Titre": "Highlight better when is going to be paid",
          "Contenu": "I had a good experience on the three times I've used Kickresume. The first ones were in 2020, I had to pay for the premium membership because there are very few free templates and the access to additional info is very limited, but it went well and had no problems with online payment. And the latest was two days ago, when I could subscribe to the premium plan for 10 days  and for free after easily validating my student status. Also the costumer support on the two times I've used was quick and efficient.4 stars because I spent a good amount of time editing my cv only to realize that I couldn't download it for free. Since I was being able to edit it I wasn't really realizing that it wasn't going to be free anymore."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ajay Mishra",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T07:41:56.000Z",
          "Titre": "I have been looking for a tool that can…",
          "Contenu": "I have been looking for a tool that can help to use AI for betterment of my resume. I have been delaying the revamp of my Resume from last 2 years and finally when I explored Kick Resume and it is awesome.Couldn't get a better tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Gutierrez",
          "Nb_Reviews": 4,
          "Date": "2023-06-28T15:46:05.000Z",
          "Titre": "It is a great Resume writing app",
          "Contenu": "It is a great Resume writing app. The only issue is that is somewhat hard to navigate. I do pay for the premium and I am grateful for the functionality, but I think there are several areas for improvement."
        },
        {
          "Note": 4,
          "Lieu": "LK",
          "Pseudo": "Nuwan Walisundara",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T18:03:12.000Z",
          "Titre": "Im using this for several years as its…",
          "Contenu": "Im using this for several years as its a great tool. Ai based suggestion ,profile image,sharerable links are my favorite . over the years It seems templates dont updates."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Sobi “Myy” Takakuwa",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T23:51:11.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Looks fabulous that recruiters told me.In my case I don’t have any carrier other than flight attendant job. It was a quite hard to explain and express myself, KICKRESUME Helps me a lot! Thank you 😄"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jared Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T21:21:18.000Z",
          "Titre": "Easy to use. Highly Recommend.",
          "Contenu": "I have used this to (easily) design 3 different TYPES of resumes and customized them quickly. It is a very helpful platform with little confusion or fuss. My only complaint is that the length of the nice designs may exceed 1 page."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Soeren B.",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T16:04:19.000Z",
          "Titre": "Great designs for CVs and Cover letters",
          "Contenu": "The designs and the usability are really great!The build-in AI functionality was not yet very helpful to me but I guess that's going to improve over times."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Bimlesh Sahu",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T08:17:23.000Z",
          "Titre": "A User-Friendly Resume Building Platform",
          "Contenu": "I'm not a fan, but I understand its significance in the world of quick buck schemes. However, some businesses—Kickresume included—are really enthusiastic about their journey. I've made several resumes for myself and my friends using Kickresume. The best thing is that you get a professionally prepared CV by AI in just five minutes from beginning to end. Later, you can alter it to suit your needs.I advise anyone looking for a quick and effective resume-building experience to use Kickresume. My resume has been greatly improved and looks much more professional thanks to Kickresume's AI resume writing services. I think the cost I paid for it was reasonable given the things it delivers. Kickresume distinguishes itself from more expensive resume apps with its extensive functionality. It does not, however, offer the ability to upload an existing CV, which can be a drawback for certain people."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "onder bulut",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T13:58:25.000Z",
          "Titre": "Pros cons",
          "Contenu": "Pros: Got a well shaped resume in minutes. Nice selection of templates. Worked well for.me.Cons: AI cover letter writer was not that good. I had to use Chatgpt instead.I would prefer doing slight changes on template but was not possible. Price is a bit high for monthly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T15:27:29.000Z",
          "Titre": "Very Helpful",
          "Contenu": "Very helpful in writing and organizing my resume. Loved the enhanced template options. Only downsize was I had to go into adobe to edit it to be exactly what I needed."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Xena",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T02:36:13.000Z",
          "Titre": "Great for reformatting resumes",
          "Contenu": "Great for reformatting resumes!  This is probably the most useful feature imo.  As a new design graduate applying for a wide variety of positions, the ability to really quickly try different formatting is super useful.A few features show great promise, but aren't quite there yet (or at least in terms of being useful for me specifically.)I still found myself using ChatGPT as the AI functions weren't really so great.  I do love the auto- review options that give you some metrics on repeated words and other things-  however it would be a great feature if this could have some user settings around location.  I am in Australia and my understanding is that the expectation here is that Resumes should be longer (2-3 pages)- so it often tells me things are too long. (which they may be- but i also think the program is a bit US centric in it's concept of what a \"good\" resume should have.All and all, even though it is a bit expensive I am glad I purchased a yearly plan.  It's great to know I can very easily create a great looking resume tailored to the position I am applying for- (job hunting is stressful enough without fighting formatting!)I know lots of online advice says to keep resume formatting plain and boring so ATS can read it- but as a designer, that wont work for me.  (I've become a bit annoyed that we've started telling people to design things for machines to read (ATS) rather than for people to read.  This is not the way technology should be working!)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa R.",
          "Nb_Reviews": 3,
          "Date": "2023-03-06T09:04:45.000Z",
          "Titre": "Off to a great start!",
          "Contenu": "I have recently started using Kickresume and I am pretty pleased. One key capability I was looking for was the ability to create an ATS scanner-friendly resume. This is the place, with a number of templates to choose from."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luciano Sanchez",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T17:34:06.000Z",
          "Titre": "Service is great to help build out a…",
          "Contenu": "Service is great to help build out a template for a resume. The only thing holding it back from 5 stars is the lack of customization for spacing. Certain text fields space weird at time s"
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Ashfaq A",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T15:53:44.000Z",
          "Titre": "Nice platform to create CVs",
          "Contenu": "Nice platform to create CVs, cover letters using AI help. Only thing is that it could have more appealing templates."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Midhun",
          "Nb_Reviews": 5,
          "Date": "2023-11-03T11:46:20.000Z",
          "Titre": "its good with content generation but…",
          "Contenu": "its good with content generation but not in detailed and the AI content generation has only single version of content which is not good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dursun",
          "Nb_Reviews": 9,
          "Date": "2023-07-07T23:08:53.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, and good experience overall. However, templates and AI should be improved, IMHO. Thanks for saving so much time!"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Luis Fernando Solis",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T17:39:02.000Z",
          "Titre": "Its very intuitive app",
          "Contenu": "Its very intuitive app,  just maybe one or two more examples for tamplates will be great. thanks for this portal  or app, is usefull to me  and  help me in time and organization of my carrer. Thanks a lot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deshon Martin",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T15:53:20.000Z",
          "Titre": "The ease of use",
          "Contenu": "The ease of use, I just had to enter my info and like magic, I had a resume that looked like it took a team to prepare.  I recommend kickresume.com for everyone, fast and professional."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Racheal Adams",
          "Nb_Reviews": 6,
          "Date": "2023-05-13T15:34:46.000Z",
          "Titre": "AI help for job seekers",
          "Contenu": "Reduces the \"blank page\" stress of applying for jobs and allows those of us who find it hard to sell ourselves the language with which to do so."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:15:45.000Z",
          "Titre": "Great capabilities",
          "Contenu": "Great capabilities. Fitted perfectly into my needs. I won't give 5 stars as I havent got any response from the support when I needed a helping hand."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Pelin Sarıtaç",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:31:57.000Z",
          "Titre": "It provides many features however I…",
          "Contenu": "It provides many features however I think there should be more resumes without emojis, colors, shapes etc. It would be more professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sampath Ramanujam",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T18:01:19.000Z",
          "Titre": "variety of templates and great cover letter with AI prepared phrases",
          "Contenu": "The best use of variety of templates, and the amazing cover letter with what I wanted to write.The another feature was the use of adding phrases with AI help.I needed some more keywords for phrases but it was great expywith what I needed I have got it."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Bruno",
          "Nb_Reviews": 11,
          "Date": "2023-06-28T23:29:45.000Z",
          "Titre": "A good way to start",
          "Contenu": "The AI part of it is actually a bit shallow but it'll improve. The templates are good but can also improve. I have a good CV so the value is lower, this is amazing when one's starting from scratch.I think the service is very fairly priced!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DK",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T22:42:48.000Z",
          "Titre": "Really great AI writing the only thing…",
          "Contenu": "Really great AI writing the only thing keeping it from 5 stars would be the pricing is a little high but still great service"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "____",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T14:29:21.000Z",
          "Titre": "Rating :)",
          "Contenu": "The website has many guiding features that help you reach the \"ideal resume\", but I would definitely appreciate more comprehensive options to edit your resume and add more features to it and style it as you please. Other things I loved about the website was the AI that helped construct paragraphs with my guidance for my resume, and the ability to apply to remote jobs through the website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A T",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T17:06:57.000Z",
          "Titre": "Truthfully a user-friendly website",
          "Contenu": "Truthfully a user-friendly website, that even boomers would understand how to use it. Wish that the final resume pdf was more application friendly."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Aqib Nawaz",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T13:42:45.000Z",
          "Titre": "Kickresume it's really great.",
          "Contenu": "Kickresume it's really great and highly recommended, I am from India and I can say the templates are really appealing to the recruiters,Thanks to the Kickrsume Team;)"
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Judy Wisah",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T22:50:23.000Z",
          "Titre": "Great use of AI in Job applications",
          "Contenu": "Ease of use, good content per job titles and plenty of easy and customizable  templates to choose from."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T01:55:26.000Z",
          "Titre": "I like the AI writing but it could use…",
          "Contenu": "I like the AI writing but it could use some more basic templates. The fancy ones don't pass ATS systems as much. Also, I would like to see the ability to mix and match templates, a build your own flow."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Vijayakumar Balakrishnan",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T12:05:44.000Z",
          "Titre": "Useful to quickly generate custom resumes in different formats",
          "Contenu": "- Analyses the resume content for completeness and also against metrics to improve the wordings- Has different template options to generate resume in PDF with different formatting- Multiple resume content can be maintained if we need to generate different resume for different job requirements- The format customisation can improved to let the user to have more freedom in arranging the paragraphs- The template is applied only in PDF resume, Word format resume is always generated with one common template"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T17:49:51.000Z",
          "Titre": "The tool itself is pretty good",
          "Contenu": "The tool itself is pretty good. I do wish I could use it without being bombarded with Pride rainbows shooting across my screen every click."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Manprit Kaur",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T23:54:51.000Z",
          "Titre": "1 drawback",
          "Contenu": "The overall experience is amazing, however the edited resume is not saved for future references or editing, only the latest one is available. So this is a major drawback"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "J L",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T18:22:27.000Z",
          "Titre": "Easy to use - Great tool",
          "Contenu": "I used Kickresume for the last 2-3 months it's been great. Easy to use and user-friendly. Templates are ATS-friendly. The con will be the limited designs and colors available"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda Wicker",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T02:57:24.000Z",
          "Titre": "Incredible Aid to Any Job Search",
          "Contenu": "Incredible Aid to Any Job Search; the templates and simple design tools make Kickresume a no brainer to use when creating multiple resume versions for job searching."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Chid",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T21:09:23.000Z",
          "Titre": "Kickresume has been really helpful",
          "Contenu": "Kickresume has been really helpful. It has good templates and it’s AI generator for job responsibilities is pretty good. I would recommend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pedro Escobar",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T03:28:04.000Z",
          "Titre": "Helps you kickstart ideas",
          "Contenu": "Very easy to use for beginners. The ai writer, while not perfect, definitely helps jump start ideas."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Liran",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T14:48:34.000Z",
          "Titre": "Great Website",
          "Contenu": "The designs are great. The quickness of making a document is brilliant. Its great. The only critic for me would be the price, it is a little expensive for my taste. But the rest is awesome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aaron Seligman",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T20:02:47.000Z",
          "Titre": "Easy to use with a fantastic result!",
          "Contenu": "I enjoyed the ease of use of the product. My resume looks great and I'm able to change it on the fly. I wish there was an option to upload an existing resume."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Franck Hovhannessian",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T14:56:27.000Z",
          "Titre": "This is a nice application to build up…",
          "Contenu": "This is a nice application to build up your resume from scratch The AI is usefulMy only remark would be to add more templates to the style."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Hassan Elkhonezy",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:49:55.000Z",
          "Titre": "They have good formates more good tools…",
          "Contenu": "They have good formates more good tools to use to customize the cv and have very much helping tools in building cv"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Robin",
          "Nb_Reviews": 4,
          "Date": "2023-03-20T17:56:32.000Z",
          "Titre": "Easy and highly costumizable cv…",
          "Contenu": "Easy and highly costumizable cv templates. Point of improvement would be an increase in templates for cover letters"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gabriel Smith",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:05:43.000Z",
          "Titre": "The result is professional looking and…",
          "Contenu": "The result is professional looking and concise, but has not yet landed me any jobs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victor DiVentura",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T16:51:08.000Z",
          "Titre": "I'm new to resume writing",
          "Contenu": "I'm new to resume writing, kick resume has made it easier, gives me flexibility, the AI feature has not worked well for me so I've resorted to using chatgbt, maybe I'm still on a learning curve, but overall it has been helpful"
        },
        {
          "Note": 4,
          "Lieu": "BO",
          "Pseudo": "Pablo Sebastian Antelo Burgos",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T15:12:15.000Z",
          "Titre": "Kickresume",
          "Contenu": "Kickresume is an exceptional online platform for creating professional resumes quickly and effortlessly. With its user-friendly interface and intuitive design, even those with limited technical skills can easily navigate and utilize its features.The platform offers a wide range of visually appealing resume templates, ensuring that users can find a design that suits their industry and personal style. Customization options allow for personalized touches, making each resume unique and eye-catching.One of Kickresume's standout features is its content suggestions and keyword optimization. It prompts users with industry-specific phrases and action verbs, helping them highlight their skills and achievements effectively. This feature increases the chances of getting noticed by both applicant tracking systems and human reviewers."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Devi mishra",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T19:02:44.000Z",
          "Titre": "It's a great tool for career…",
          "Contenu": "It's a great tool for career prospective also real intelligence of points noting artificially good one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jonathan manning",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:14:40.000Z",
          "Titre": "Easy to use and alter resume software",
          "Contenu": "Easy to use resume writing software, very beneficial to be able to alter the look of your resume with 1 click utilizing the pre-stored templates"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Silke Lehnardt",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T16:32:23.000Z",
          "Titre": "super templates",
          "Contenu": "super templates, easy to use, great help to get started"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "PRANAV NAIR",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T06:47:05.000Z",
          "Titre": "Great experience",
          "Contenu": "There are a lot of wonderful templates on kickresume. Expecting more variable templates in future."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Ardi Sardashti",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T18:48:54.000Z",
          "Titre": "I've been using word to do my resume's…",
          "Contenu": "I've been using word to do my resume's for a while. The ability to not waste time on all the adjustments to get the image just right is a game changer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Derek Dabney",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T15:51:43.000Z",
          "Titre": "You can do it on your own!",
          "Contenu": "Need this for work and to find a federal job.I was very helpful. Thank you for ontime assistance."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "John Karuitha",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T01:08:45.000Z",
          "Titre": "A wonderful site to create a CV",
          "Contenu": "A wonderful site to create a CV. The AI tool is especially useful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephanie Shepherd",
          "Nb_Reviews": 2,
          "Date": "2022-12-16T16:24:50.000Z",
          "Titre": "Helpful tool for keeping everything…",
          "Contenu": "Helpful tool for keeping everything organized while job hunting.  Great templates!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Gallagher",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T15:26:08.000Z",
          "Titre": "Great resume writer",
          "Contenu": "Great resume writer. I will say the cover letter portion needs some work. All in all a great service."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Vishnu Sasidharan Nair",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T21:04:17.000Z",
          "Titre": "Its a good service.but but free…",
          "Contenu": "Its a good service.but but free templates are very lesa and the downloaded version of word files are not same as the pdf file."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lizzy Steelman",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:31:31.000Z",
          "Titre": "They have thought of everything....",
          "Contenu": "My experience on this site has been outstanding. Their AI assisted resume and cover letter creation is such a big help trying to tailor every application I send in. It has taken tons of time off my job search and hopefully will be finding that dream position very soon!"
        },
        {
          "Note": 5,
          "Lieu": "AZ",
          "Pseudo": "Alihadi",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:22:41.000Z",
          "Titre": "Forget about wasting your time for…",
          "Contenu": "Forget about wasting your time for creating CVs or Cover Letters! Kickresume will do it for you if you know how to use AI properly."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Muhammad Zaidan Ullah",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:20:22.000Z",
          "Titre": "Well it's my first experience with AI…",
          "Contenu": "Well it's my first experience with AI Resume creating platform and I just loved it.  It's smooth, helpful and company is doing amazing job. Just keep it up and mantain upgrading this beautiful website."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Berk",
          "Nb_Reviews": 5,
          "Date": "2023-11-30T19:30:00.000Z",
          "Titre": "Create your CVs and cover letters faster",
          "Contenu": "It was always a headache to tailor my CV and create cover letters based on the job I'm applying and with Kickresume things got so easy and fast. I highly recommend everybody to give it a try."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy Jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T19:12:15.000Z",
          "Titre": "Great tool for creating resume.",
          "Contenu": "It was easy to get started, the price point is reasonable.  I get to control what my resume will look like and I can create multiple resumes to occomodate job applications to stand out from all the other applicants.  There are many styles to choos from and they are setup based on your career or industry.I am glad I made the investment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:03:50.000Z",
          "Titre": "Great Tool",
          "Contenu": "The tool reframed my own perspective about my skillset and what I am qualified for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Muhammad",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T11:02:28.000Z",
          "Titre": "Made my life easy and looked professional",
          "Contenu": "Nice collection of resume templates, easy to fill, AI grammar correction and analyzing. The creation of a cover letter and website from different resources was a great addition. I think that Job Interview is a great option, but I didn't try it yet."
        },
        {
          "Note": 5,
          "Lieu": "GE",
          "Pseudo": "Roman Usov",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T08:41:48.000Z",
          "Titre": "Helped make my resume stand out",
          "Contenu": "I really wanted my resume to stand out. And kickresume.com helped me do it by offering a variety of templates. I liked the flexibility that comes from being able to arrange sections and blocks the way I wanted it. The interface where you create your resume on one side and instantly see the end fully designed result on the right is great. You can also use the provided AI capability to transform your draft into a solid section. Exporting the resume into the needed format was a breeze."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stacy",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T22:31:49.000Z",
          "Titre": "Fight fire with fire",
          "Contenu": "I was happy to find your site.  I think I am a decent writer, but I have had little to no responses from job applications.  I know that companies use computer programs to screen potential resumes and cover letters, so I thought 'why not fight fire with fire?'  I am still waiting to see what happens, but I was very appreciative to have AI re-write for me.  The site was easy to navigate, and the cost is reasonable.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Frank",
          "Nb_Reviews": 4,
          "Date": "2023-10-28T07:45:47.000Z",
          "Titre": "Easy to use tool for individualized resume/cover letter",
          "Contenu": "Easy to use tool for individualized resumes and cover letters Yes you still have to use your own brain and sometimes modify, but it helps saving lots of time and checking redundancy is great. I shortened my CV from 6!! to 2 pages. Many different formats to use. I like it."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Brendan",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T11:48:29.000Z",
          "Titre": "Brilliant",
          "Contenu": "A fantastic, easy to use and professional tool for creation of CVs. The extra add-ons are a bonus.The whole platform is powered with AI and it`s incredibily helpful. Highly recommended !"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T15:05:37.000Z",
          "Titre": "A great tool & AI assist to make you a better resume writer",
          "Contenu": "To be honest, I was leary of yet another AI come-on. But after some research, Kickresume seemed like it should be a reasonable starting point to improve my resume, since I had already maxed out my efforts on a plethora of traditional resume guides. So after I signed up, I was pleasantly surprised at how easy it is to select an appropriate format, even though some were simply cosmetic in nature. The most impressive part was the simple guide format to filling in sections, either from scratch or by importing from an existing resume. The AI system can be used to automatically create content, but it certainly needs editing afterward as it tends to be a little flowery. Overall, it is a great tool, gives you a lot of flexibility and the ability to restart your creative juices and a fresh rewrite."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven H.",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T09:02:21.000Z",
          "Titre": "Excellent looking résumés!",
          "Contenu": "This site makes a far superior résumé to anything I could do on my own (believe me, I tried)!  The intuitive AI rewrites are icing on the cake, too!  I feel this has taken my résumé from zero to hero in one weekend.  I especially like the rating system that allows me to tweak the finer aspects of my work!  Thanks a million!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Irey",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T18:00:11.000Z",
          "Titre": "Simple and quick to get great results",
          "Contenu": "Such a great experiance.  logged in and did both a resume upload and a pull from my LinkedIn account.  Within seconds there was a great resume shell.  I used the AI features to tweak each section while tracking my resume overall score.  After about an hour of revisions I had improved my score form 57 to 72.  in the next few hours of review I was able to use the suggestions and add/remove items to get my score to 87.It was also very easy to make multiple versions for spacific roles as well as test out new designs without risk.This is a whole new world of resume management that takes the pain out of the process"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anil",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T18:58:36.000Z",
          "Titre": "Simple Yet Effective!",
          "Contenu": "I tried KickResume recently and I appreciated its simplicity.The ready-made templates took away the usual design hassle, while the AI writing assistant and resume scoring features made creating a new resume or tweaking my existing one super easy. The platform is user-friendly and the end result looked professional without me having to spend hours on it. Highly recommend for anyone looking to create a well-designed resume without the fuss."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Zackery",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T22:36:32.000Z",
          "Titre": "Made my old resume look childish!",
          "Contenu": "I was feeling so discouraged about my job search, and decided to try a resume app. I found Kickresume, and was so impressed! I've been looking for remote work for quite some time, and am \"resume challenged\". The AI capability, the beautiful templates, and the matching cover letters were just the boost that I needed to feel better about my job search! And while I am still on the hunt for a new job, the number of responses that I've received with my new resume and cover letter have jumped dramatically. I actually got a phone interview (with a real person), and she even complemented me on how well my resume stood out! Thank you Kickresume!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nikki Cole",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T18:39:22.000Z",
          "Titre": "So far so good",
          "Contenu": "I found out about this software from a Facebook Content Creator (I can't think of his name but he had dreads or braids). I decided to check out the software and get the trial. The software is user-friendly and easy to use. In less than 30mins, I had a revamped resume that was polished and got me the necessary attention from employers I deserved."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Usman yousaf",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T17:16:32.000Z",
          "Titre": "I am not a fan of this but it is…",
          "Contenu": "I am not a fan of this but it is important in world of cash grab there are some companies who are truly passionate about there journey and kickresume is one of them i made multiple resume for me and friends. Best part it takes 5 minutes from start to end you have everything written by ai and then later you can change according to your needs"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Mars Amanda Rose",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T20:33:15.000Z",
          "Titre": "Genuinely cannot say enough good…",
          "Contenu": "Genuinely cannot say enough good things...This company has just leveled up so many times. I used it before AI was involved because the templates are so good and easy to use. The AI builder is fantastic as well, I can attribute at least 2-3 jobs i've gotten to this service. Keep up the excellent work and amazing customer service!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Cynthia Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:23:01.000Z",
          "Titre": "Resume and Cover Writing Made Easy",
          "Contenu": "Ready-made templates to choose from. An AI writer to help reword your resume with keywords that HR search for.  An AI writer that helps write your cover letter, which matches your resume with the job description. All you need to do is just edit and tweak (it is still AI after all and it still needed to be reworded to personalize / customize it to your actual background).  But it makes the process easier and faster."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jarren Nicoletti",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T02:55:53.000Z",
          "Titre": "Brilliant employment tool.",
          "Contenu": "Very valuable combination of AI and crowdsourced best practices that enabled me to quickly build a slick, modern resume despite being wildly out of practice."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Arjun",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T16:47:05.000Z",
          "Titre": "Provides an in-depth resume-checking…",
          "Contenu": "Provides an in-depth resume-checking tool that can benefit your job search. Produces results that are surprisingly accurate to what I do and also for jobs I would like to apply for. Stop wasting time guessing how you should structure your cv and leave it to the pros."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Green",
          "Nb_Reviews": 7,
          "Date": "2023-08-28T12:42:03.000Z",
          "Titre": "The ease of use and prompts available",
          "Contenu": "The ease of use and prompts available, whilst being able to personalise the CV as you go along. The proof-reading option is a brilliant way to ensure that spelling, punctuation and grammar are all spot on too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grant M.",
          "Nb_Reviews": 2,
          "Date": "2023-07-05T17:09:25.000Z",
          "Titre": "Helps you get started and look good!",
          "Contenu": "Job searches are hard for a lot of reasons. The first hurdle is just \"where to get started?\" For me, Kickresume made that first step so much easier. After I had my work history together, I was able to quickly review different templates for resumes, make it look good, and create a corresponding cover letter. It's been super helpful in my search and I plan to keep using their tools for a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hal",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T18:32:10.000Z",
          "Titre": "Kickresume gave me the kick I needed!",
          "Contenu": "I always struggle with cover letters - what to say? I feel like I am writing fanfic for some business. Kickresume changed my life! I could feed it the job description and it helped me write the cover letters. It also helped me identify and highlight relevant experience on my resume. Not to mention all the great looking templates and the ability to create different resumes and cover letters for the various sectors I can work in. Before Kickresume, I spent three months searching for a job and found nothing! After Kickresume I started getting interviews and got a job within a month. I totally recommend Kickresume - worth every penny."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "ajay tambe",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T16:48:04.000Z",
          "Titre": "Godly Resume Maker and an absolute Lifesaver!",
          "Contenu": "My experience with Kickresume has been nothing less than exceptional. It's simply a brilliant tool that's easy to use and generates resumes within seconds. Additionally the AI part adds more muscle in enhancing the choice of words in your resume. Simply put across Kickresume kicks your resumes Journey to be more solid and robust"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Ucca",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T06:52:14.000Z",
          "Titre": "Extremely Useful Resume Builder App",
          "Contenu": "I find the app to be extremely useful as it provides suggestions that are tailored to our needs. Additionally, the website maker tools are excellent and deserve a high rating. I look forward to seeing Kickresume offer a wider range of template designs in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan E.",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T15:26:28.000Z",
          "Titre": "Fantastic Product",
          "Contenu": "Fantastic product! It is very user friendly, unlike some of its competitors I've tried. It is very easy to make changes to an existing resume or  create multiple resumes and cover letters."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rishabh Shingari",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T17:04:55.000Z",
          "Titre": "It is THE solution…",
          "Contenu": "It is THE solution when i want to make the best possible resume and the help to AI added features on the website is just amazing, it helps me so much even when i cant think of something formal enough it shows me suggesting that i could add. All in or it had helped me land great jobs and passed through those resume checking softwares too."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "rohit kumar",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T18:32:39.000Z",
          "Titre": "Resume building made easy....",
          "Contenu": "This website makes resume building easy. There various options to build your resume1) Download archive from LinkedIn2) Update details manually3) Use AI writer to prompt you a professional template.4) Awesome professional templates to choose from5) Provide interview tips while you build the resume.This website provides all necessary ingredients to build a professional resume."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALEX CHAN",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T02:12:38.000Z",
          "Titre": "kickresume has legs",
          "Contenu": "kickresume has legs.  the interface is easy to use  and the flexibility is there to use the same 'resume' for various occasions / needs."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Olivia Walentino",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T10:06:00.000Z",
          "Titre": "Best resume yet",
          "Contenu": "Resume writing is hard, as an immigrant it was extra difficult for me. Even though I attended all the resume writing classes that government provided. Kick resume changed all for me. I haven't got a job yet but I am getting interview responses that I never had before and I am way more confident about my resume and my abilities!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Annamdasu Supriya",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T04:38:40.000Z",
          "Titre": "Auto-generated the content is very…",
          "Contenu": "Auto-generated the content is very awesome and the content was very much perfectly related to my job title and I have learned many things through this .thank you kickresume"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T17:07:28.000Z",
          "Titre": "Absolutely a wonderful tool",
          "Contenu": "Absolutely a wonderful tool - I’ve used it to create 3 separate resumes and have gotten an interview each time! It’s easy for the end user and guides you every step of the way. I would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mann “Manny B” Brice",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T19:39:21.000Z",
          "Titre": "Fantastic tool to build your resume",
          "Contenu": "Fantastic tool to build your resume. Smart and intuitive, very easy to navigate and build a resume with optimal results.  Great looking templates available too and the AI feature is top notch.  I am very pleased with the overall results."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Miquel Netto",
          "Nb_Reviews": 3,
          "Date": "2023-07-29T15:32:47.000Z",
          "Titre": "user friendly quite intuitive",
          "Contenu": "user friendly quite intuitive. Web tool app is great. the only thing is that the majority of the CV or Resume templates can't be downloaded in Word format. if you use a converter doesn't keep neither the same format and is quite challenging to make mods on it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rashad a",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T00:13:25.000Z",
          "Titre": "Best resume-building software",
          "Contenu": "Best resume-building software with the inclusion of AI. Makes developing resumes and cover letters easy and allows constant edits and changes. Not the type to pay for software like this but when you do this good of a job you just can't help it"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sunil F",
          "Nb_Reviews": 7,
          "Date": "2023-06-28T16:57:35.000Z",
          "Titre": "I absolutely love KickResume",
          "Contenu": "I absolutely love KickResume! I’ve used it for the last few years. As a contractor I’ve had to rewrite my CV numerous times. Kick resume has been a fantastic platform to use. With the new AI tools it makes creating a CV child’s play!It’s so easy to use and very flexible in terms of the process of creating a document."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frances Loggins",
          "Nb_Reviews": 4,
          "Date": "2023-08-19T23:48:32.000Z",
          "Titre": "Most awesome resume builder app ever!",
          "Contenu": "This app is not only very easy to use to create a resume, but it is also fun! This has got to be one of the most useful apps I've downloaded. I also am really enjoying the free premium membership as a college student. The only problem I have is that there seems to be a limit on just how much you are able to use the AI feature. When I tried to create my cover letter to go with my resume, it wouldn't allow me to use the AI option because it said I'd used up all of my credits. I didn't even know I was using any sort of credits. I played around with creating resumes with the AI option unknowingly using up the credits. Really wish I'd of known about the limit to begin with, I wouldn't have waisted all of the credits that way.... But, at least I did get one really awesome resume outta it. Most definitely recommend this app just keep in mind its not unlimited use like I thought it was!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa R.",
          "Nb_Reviews": 3,
          "Date": "2023-07-10T02:44:56.000Z",
          "Titre": "A Continuing Partner During My Job Search",
          "Contenu": "This is my second review of KickResume. I'm writing because while sometimes we start working with a platform optimistically, over time we might walk away from it to find something better or easier. Not this time. KickResume continues to be a great help to me. It saves my time and sanity during my search by enabling me to create a core resume and then easily make boutique versions, adjusting job titles, SEO words, and sections that fit the role I want to apply for. The built-in AI writing tools are extremely helpful. So are the cover letter templates.  Applying for jobs can be an emotionally draining and time-consuming process, and we can end up doubting ourselves. I am grateful I found KickResume because it has saved me so much time, effort, and stress and I know my resume looks sharp. That enables me to focus more time on searching for opportunities and networking. I recommend this platform to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vishwakumar palamadai",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T16:47:27.000Z",
          "Titre": "Awesome design , Templates, customization",
          "Contenu": "Sample templates, varied Designs, different sections to provide with specifics, ability to add any custom section,  and more.. Have been using this for quite some time and recommend to others to give. a try!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Barela",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:14:46.000Z",
          "Titre": "Love the platform",
          "Contenu": "Love the platform. I used this to generate cover letters for a job search. I thought the output was great, it certainly helped me land multiple interviews. The templates were also a nice touch. I would highly recommend Kickresume for any job seeker."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Anderson Barenbruck",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T09:08:49.000Z",
          "Titre": "Kickresume is the best resume builder…",
          "Contenu": "Kickresume is the best resume builder I've ever used. It's easy to use, has a huge library of templates, and offers great customization options. I was able to create a professional-looking resume in just a few minutes.I especially appreciate the AI-powered resume checker. It helped me to identify and fix any errors in my resume, and it also gave me some great tips on how to improve my resume's effectiveness.I highly recommend Kickresume to anyone who is looking for a great resume builder. It's easy to use, affordable, and it really does help you to create a resume that will stand out from the crowd."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "alex garcia",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T22:13:33.000Z",
          "Titre": "It helped me to update my resume…",
          "Contenu": "It helped me to update my resume speedily, and it looks much better than it used to be.  Thank you so much for making it easier for everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T16:41:15.000Z",
          "Titre": "It is an easy platform",
          "Contenu": "It is an easy platform where in minutes I got my résumé upgraded and also had a whole new résumé made. Plus I had the ability to open the website and have their AI feature help and evaluate my résumé for repetitive words long paragraphs and many other key points, that other recruiters observe on your résumé"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Donal R. O' Brien",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T09:51:06.000Z",
          "Titre": "A highly effective toolset for getting to the top of the pile",
          "Contenu": "One of the hardest parts of how my role has grown and evolved over my career is that there are multiple positions I can fit to. This means that I need to bring the relevant experience quickly to the front and Kick Resume has allowed me to produce multiple versions of the journey based on role, industry or relevant experience. It has changed the way I look at my searches and is a highly effective toolset for getting to the top of the pile."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Wooten-Williams",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T20:13:12.000Z",
          "Titre": "New Resume Concept",
          "Contenu": "I am entering the workforce after taking time off.  It was wonderful to have this tool to assist in creating resumes that met the job profile.  The assistance of AI made the process easy to write resumes and cover letters that target each job specifically."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T08:01:49.000Z",
          "Titre": "The overall functionality of the site…",
          "Contenu": "The overall functionality of the site is great. I can save multiple copies of resumes and cover letters to easily tweak later if I need to. The AI generation component is also a great touch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clayton Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:34:49.000Z",
          "Titre": "I have really enjoyed using Kickresume",
          "Contenu": "I have really enjoyed using Kickresume. I applied to so many jobs before getting hired. I could go in and update my cover letter and resume to fit the job I was applying for. The cost is fair as well! I highly recommend KickResume."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie Marcotte",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T17:07:50.000Z",
          "Titre": "Definitely recommend to anyone needing a resume",
          "Contenu": "The site is easy to use and the results are beautiful. I like that I can customize each document I make and I am able to make everything match. I've received compliments in interviews on my formatting and cover letters."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Roshan Jain",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T14:36:49.000Z",
          "Titre": "This is really awesome Platform",
          "Contenu": "This is really awesome Platform, I really liked it... It's like only a few clicks job to create awesome resume and cover letters for any position you are applying for. 5 stars for makers...Kudos to you guys"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Saviour John",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T23:21:08.000Z",
          "Titre": "I used KickresumeI used Kickresume to help me with my recent job search to help me with my…",
          "Contenu": "I used Kickresume to help me with my recent job search, and I was very impressed with the results. The platform was easy to use, and the AI resume checker helped me to identify and fix any potential problems with my resume. I also appreciated the wide variety of templates available, which allowed me to create a resume that was both professional and visually appealing.Overall, I highly recommend Kickresume to anyone who is looking to create a great resume. The platform is easy to use, affordable, and effective."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rashpal Gill",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T16:41:46.000Z",
          "Titre": "It’s the AI at its best",
          "Contenu": "It’s the AI at its best! Absolutely love how it puts the user in the driver’s  seat and helps you make your resume stand out among 100’s. Rather than hiring a person to do this job now you are in-charge of doing it yourself and even better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T17:06:14.000Z",
          "Titre": "A convenient solution for creating and…",
          "Contenu": "A convenient solution for creating and tailoring your resume is readily available. This tool offers an effortless way to build your resume from scratch or modify an existing one to align with the specific job you are applying for. What sets it apart is its comprehensive review feature, which analyzes your resume before you download it. This review not only alerts you if you have used an excessive amount of repetitive words or if something seems amiss but also provides valuable insights. By assigning a rating score out of 100, it compares your resume with successful ones stored in its database, helping you optimize your chances of securing a job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. D. Childers",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T01:00:50.000Z",
          "Titre": "Licking stamps........ Nope......",
          "Contenu": "I recall when people used to say things like \"There's an app for that\".Now folks will be saying \"There's an AI for that\". Kickresume is \"The AI for that\".  I do not miss licking stamps and I will not miss customizing resumes to fit job descriptions."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Joel Fleming Mascarenhas",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T16:05:05.000Z",
          "Titre": "My experience with Kickresume has been very good !!",
          "Contenu": "My experience with Kickresume has been exceptional. It's a brilliant tool that's easy to use and one can create resumes within seconds. Additionally the AI part is enhancing the choice of words in your resume."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James Mac William",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T16:36:15.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, you'll have to invest a bit of time and effort into it and the AI cover letter generator needs a bit of love if you want to get a job from it, but with less than a half day of effort I have multiple resumes and cover letters that look and sound much better than they were"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Fides Fierz",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T13:35:33.000Z",
          "Titre": "I have been looking at many different…",
          "Contenu": "I have been looking at many different CV and cover letter tools... prefer Kickresume by a mile! Great design options, easy to adapt, and the AI writing is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Hunt",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T03:17:46.000Z",
          "Titre": "Amazing tool!",
          "Contenu": "I have been able to reformat my old resume into something sleek and modern, and the AI tools helped me rewrite my experience to sound more clear and concise. I have renewed confidence in myself and my career with Kickresume."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Apples",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T03:05:29.000Z",
          "Titre": "Give it a shot! It was very helpful.",
          "Contenu": "Kickresume was very quick to use and helpful in a crunch. The templates could have a little more variation design-wise, but that will come with time as the platform matures."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Rhadjni Phipps",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T22:20:07.000Z",
          "Titre": "A great platform for creating beautiful…",
          "Contenu": "A great platform for creating beautiful resumes with content that can be auto-generated using AI tools. This site also job boards section which is perfect to see how to refactor your resume to meet job descriptions."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Ruxandra Croitoru",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:24:48.000Z",
          "Titre": "Nice formats to choose from",
          "Contenu": "Nice formats to choose from, all of them ATS friendly, AI writer and re-writer to your content, cover letter ai writer and lots of other cool features. It looks crisp and catchy."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Copilrock",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T02:15:09.000Z",
          "Titre": "It help me pimp my sending of resumés",
          "Contenu": "It help me pimp my sending of resumés. The templates could be better, or have more variety, but overall it is really functional. the Ai can also improve"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "George Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T06:44:05.000Z",
          "Titre": "This is the easies most intelligent…",
          "Contenu": "This is the easies most intelligent resume builder i have ever used.Easy to use, intuitive, lots of templates, lots of examples. Would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Minodora Atasiei",
          "Nb_Reviews": 6,
          "Date": "2023-06-29T12:52:06.000Z",
          "Titre": "CV write up",
          "Contenu": "It has never been easier for me to be able to create a professional cv,I love the accuracy of the rewrite feature that put my input into a new form without changing the meaning.Brilliant"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Simphiwe Dhlamini",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T15:53:35.000Z",
          "Titre": "Absolutely loved it.",
          "Contenu": "There were a lot of tools I found useful. The suggestions made it very easy to compose my resume whichever way I wanted it. Templates are awesome was well. Generally, a good program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Ahlgren",
          "Nb_Reviews": 2,
          "Date": "2023-07-12T22:25:49.000Z",
          "Titre": "Struggles with resume writing",
          "Contenu": "I have always struggled with summarizing my work experience, but with this AI software, my resume looks and reads beautifully. I am extremely happy with the results. I would recommend this to anyone."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alix Akachukwu",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T16:30:44.000Z",
          "Titre": "The AI option helps you move in the…",
          "Contenu": "The AI option helps you move in the right direction because I'm sometimes unsure what words to use. The grading it good too helps to know what I'm missing and what to add."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Mainya Johnstone",
          "Nb_Reviews": 4,
          "Date": "2023-07-11T21:13:05.000Z",
          "Titre": "I believe Kickresume is the best self-service CV maker in the market",
          "Contenu": "I have been a Kickresume user since August 2020. Here is why I keep paying for the service:1. You will prepare your CV, cover letter and career website all under one roof. And with great ease.2. It has 180 days of freemium for students. Now, if you have been a student, you probably know a dollar saved is a fortune saved. 3. The AI assistant is very smart and concise. It knows that recruiters are busy and that you want the job😊.4. You will invite your colleagues or friends to use the premium service without paying for a month. That is magnanimous. 5. The design templates are visually appealing. A CV must attract the recruiter's attention at first glance.6. The mobile app has made work easier. Now you don't need to have your PC to update and share your CV. Do that on your phone!7. There are freebies that come with using this service. Great discounts under perks and benefits.8. If you are unable to pay, you can still use the free version. Paying unlocks premium features.9. Premium features are quite affordable - from as low as 3 US dollars per month under the annual plan. 10. OVERALL: The Best CV maker service I know."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "harry singh",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T11:54:38.000Z",
          "Titre": "Great Help designing and creating Professional resume",
          "Contenu": "Great help  the features like create resume direct from LinkedIn makes  life easy  , ai write have power to give you proper text which you can use to save time and  help to make resume more professionals"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Aki Nieminen",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T14:10:26.000Z",
          "Titre": "After years of working and no CV update…",
          "Contenu": "After years of working and no CV update Kickresume delivered really good form of CV and cover letters. Easy to use and great AI tool for writing."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vikas Singh Rajput",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T17:53:36.000Z",
          "Titre": "Easy to build a fantastic resume in…",
          "Contenu": "Easy to build a fantastic resume in minutes not even minutes in few seconds and one more thing we can edit it according to our job roles like add certification, hobbies, skills etc."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Josh Martin",
          "Nb_Reviews": 7,
          "Date": "2023-09-15T11:58:20.000Z",
          "Titre": "Building a career made easy",
          "Contenu": "Building a career made easy, getting you through that CV, CL and website step so much quicker."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Zack Uhrig",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T06:05:49.000Z",
          "Titre": "Highly recommend",
          "Contenu": "It’s been very easy and helpful to use their many tools around creating creative and standout resumes/cover letters. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MBP",
          "Nb_Reviews": 2,
          "Date": "2023-08-12T20:52:04.000Z",
          "Titre": "No time to waste: Get that Job",
          "Contenu": "It is frustrating to be looking for jobs now a days, not because of the lack of it, but because of the difficulty of getting past those ATS resume checkers to get to HR. I am an educator and have been teaching resume writing. Now, it is not really making any sense to do it yourself when there is an application that can do it for you and does it well in the shortest amount of time. We have to work smart not hard. Kickresume has made it easy to build cover letters and resumes. This is the one application that was easy to use, straightforward, with no hidden agenda behind it but to help. I hate those that help you build your resume but will not release it to you until you pay. That is not the case with Kickresume. I suppose they understand that making a cover letter and resume means you need a job to make money. Until then, you are running on straws. So, there is no time a wasting here. I just wish they existed a long time ago. Well, now that it is here, you can work smart and build your cover letter and resume with Kickresume to hopefully get you through to that interview to land that job.  I have built both my son's and my cover letters and resumes using Kickresume while having coffee in the morning before getting ready for work. Thank you so much Tomas Ondrejka (co-founder of Kickresume)."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Munawwar Aalam",
          "Nb_Reviews": 7,
          "Date": "2023-09-21T18:41:06.000Z",
          "Titre": "Deserve 500 ⭐!",
          "Contenu": "Love this amazing AI Resume builder! Helps me easily in creating best resume for my clients!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt C",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T19:58:34.000Z",
          "Titre": "I really appreciate the customization…",
          "Contenu": "I really appreciate the customization options a lot, e.g. to create my own category or one as an alternative to the defaults."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "BRT",
          "Nb_Reviews": 15,
          "Date": "2023-08-02T12:41:49.000Z",
          "Titre": "Great at writing clean ATS approved…",
          "Contenu": "Great at writing clean ATS approved CVs. Wonderful, source of customizing CVs to fit the template you are after."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Engel",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T02:01:04.000Z",
          "Titre": "Overall Kick resume",
          "Contenu": "Overall Kick resume, has helped me a lot to redesign my resume, it's very user friendly and the AI included for premium its really helpful from my perspective, give it a try, you won’t complaint at all."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Taboka Tshuma",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T11:20:01.000Z",
          "Titre": "Great Tool!",
          "Contenu": "Great Tool!Easy to use and very effective. Has made tailoring resume super easy and provides useful tips to fix up and complete."
        },
        {
          "Note": 5,
          "Lieu": "BW",
          "Pseudo": "Thapelo Baabusi",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T09:20:45.000Z",
          "Titre": "EASY TO EDIT AI DRIVEN TEMPLATES",
          "Contenu": "EASY TO EDIT AI DRIVEN TEMPLATESI found that the templates are intelligently designed to showcase my skills, experience, and qualifications effectively. With a wide range of professionally designed layouts, I can effortlessly choose a template that suits my industry, career level, and personal style. I am impressed by the use of their AI technology that automatically optimizes the formatting and layout, saving me valuable time and effort."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jaydon Matt-West",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T00:41:03.000Z",
          "Titre": "Great and easy experience",
          "Contenu": "Great and easy experience. Helped immensely with my wording and sentence structures. Lots of resumes options to suit all personalities too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raghav Gupta",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T20:27:18.000Z",
          "Titre": "AI tools to build and guide to an ATS friendly resume",
          "Contenu": "Getting AI tools, and resume-building AI assistant that too for ATS-friendly resumes selected from among N number of selected resumes from top companies like Amazon, Apple, and many more. BEST EVER RESUME BUILDER, leaving its competition way behind."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nandini Anant",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T13:26:03.000Z",
          "Titre": "Kickresume.com is really great for…",
          "Contenu": "Kickresume.com is really great for helping you craft on-point resumes, I have no regrets :)"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jimena López",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T16:42:04.000Z",
          "Titre": "I got the Job!",
          "Contenu": "Great experience! it helped me get an interview at PayPal and ended up getting the job. I would highly recommend :)"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Romulo Oliveira de Macedo",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T17:58:14.000Z",
          "Titre": "Smart Tools",
          "Contenu": "I have used other CV building sites before, but Kickresume can offer tools that really improve your CV."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas M",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T09:18:16.000Z",
          "Titre": "Create a stunning resume in an…",
          "Contenu": "Create a stunning resume in an instant—a lot of options to emphasise your skillset and catch the eye of the recruiter. I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Titanium",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T16:52:54.000Z",
          "Titre": "The follow-up was grate!",
          "Contenu": "The follow-up was grate. The team has reached out multiple time's. My resume looks good and is easy to modify for multiple applications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tia Miller",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T17:19:35.000Z",
          "Titre": "Essential in today's job market",
          "Contenu": "Kickresume is an absolute essential to be competitive! I was able to update my resume easily within minutes of concluding a phone call and even have a well-structured cover letter ready too!"
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Peter Šenigla",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T09:14:31.000Z",
          "Titre": "one of the best tools on internet",
          "Contenu": "one of the best tools on internet. totally worth price of premium - and thats only spotify and kickresume :-D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deirdre",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T19:43:34.000Z",
          "Titre": "Well worth the money",
          "Contenu": "Paying for the service is well worth it. I created a resume using their AI to rewrite my content resulting in numerous replies from my resume submissions."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Mario Hardy",
          "Nb_Reviews": 4,
          "Date": "2023-06-28T18:01:09.000Z",
          "Titre": "Excellent application to create and…",
          "Contenu": "Excellent application to create and store several copies of your resume and cover letters. Helps speed up the process and ensure you capture all the right info."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jasie Parsons",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T16:49:21.000Z",
          "Titre": "Updates in Seconds",
          "Contenu": "I love logging in, updating my resume, and changing its formatting within seconds. And I feel uber professional having a website."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Mario Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T00:22:38.000Z",
          "Titre": "An amazing help",
          "Contenu": "It is a good tool whenever you are running out of ideas to how to create or renew your cv, it helps me to get it more organised and with important information that is required by HR teams."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stace",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T16:54:49.000Z",
          "Titre": "I have signed up multiple times for…",
          "Contenu": "I have signed up multiple times for kick resume…to update my resume and each time I use their service I get the job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T18:13:18.000Z",
          "Titre": "Don’t apply to a job until you use this service",
          "Contenu": "Quick and easy to use. Was able to reduce pages of existing resume into one page with all essential info. The AI feature for cover letters makes personalizing for each employer a breeze, incorporating key attributes for the individual position. Recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Traven Baxter",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T10:48:03.000Z",
          "Titre": "good tool to use worth the money",
          "Contenu": "Building the resume was simple and easy to keep looking nice and tight. there were a couple of things I would have liked to adjust but it works great."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Ana Pereira",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T18:17:37.000Z",
          "Titre": "I've always been looking for a resume…",
          "Contenu": "I've always been looking for a resume writing tool, but I've never found one like Kickresume. The best decision was to subscribe and enjoy the benefits of the platform. Very didactic, it allows customization, templates for all careers with professional and objective suggestions. I have promoted the tool in my network and my contacts have shown interest in using it. Another facility was updating the Linkedin profile using Kickresume content quickly and harmoniously."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mnseyda",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T22:36:59.000Z",
          "Titre": "a lot of templates",
          "Contenu": "i really liked the tool when you change the template it adjust automatically and doesnt add unneccesary empty fields"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D G",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T05:14:01.000Z",
          "Titre": "I am truly shocked by how easy it has…",
          "Contenu": "I am truly shocked by how easy it has been to create a resume and cover letters with this site!I 100% recommend you try it!"
        }
      ]
    }
  ]
}