{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "kombdev.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David J Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:04:48.000Z",
          "Titre": "I contracted your technician AMD to…",
          "Contenu": "I contracted your technician AMD to visit my home in late June or early July to set up my new computer, and he did an outstanding job. My following feedback reflected my complete satisfaction. I had some relatively minor computer problems I wanted fixed and called him to set up a remote session, set for this last 6th November 2023.   He managed to solve all but one of the problems: the installation of a password management service. So we left that for another day, which we set for the following week on 13th November.  During that session his remote software failed several times, and in the end the password software could not be installed because we ran out of time because of the time it took to try repeatedly to get the software to work.  I called him back and he agreed to return the following week via a remote session which I understood to be without charge.  But he never called back. So I have now paid $79.99 for each of two sessions, or a total of $159.99, of which in effect the second payment for no result at all.  I am not at all pleased by this, and am not inclined to contract your services again in the future as a result.Yours sincerely,David J Robinson"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole M",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:23:12.000Z",
          "Titre": "A great experience!",
          "Contenu": "Anthony is great to work with - he takes the time to understand what his clients need to improve their computer work experience and he has the patience to explain things as well as make sure everything is functioning correctly. Anthony is a rare balance of professional and kind.  I highly recommend Anthony and this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frequent Flyer",
          "Nb_Reviews": 5,
          "Date": "2023-11-23T17:40:07.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Showed up on time, polite, knowledgeable, and fix the problems. I would use the service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cleveland",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:42:56.000Z",
          "Titre": "Great service on the same day",
          "Contenu": "Great service on the same day. Will use these guys again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juno",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T23:10:15.000Z",
          "Titre": "Thorough in diagnosing my PC issues",
          "Contenu": "Thorough in diagnosing my PC issues. Found issue and installed new components. Always available to contact with questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T03:32:24.000Z",
          "Titre": "Great Staff",
          "Contenu": "They were very helpful, efficient, and were even able to get me a discount through Apple for a part my MacBook needed. Highly recommend it here, definitely will be back again if needed. Super friendly staff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Bagofdonuts",
          "Nb_Reviews": 7,
          "Date": "2023-06-11T18:42:04.000Z",
          "Titre": "very good support",
          "Contenu": "very good support , like when he returns your calls and you can talk to a live person and explain the issue you are having and get the knowledge of the person on the phone and what the cost would be to correct the problem. Also, love that the teck will come to your place and repair or order parts needed and what the cost would be prior to get things done. Very good price,knowledge and personel  respect. Better then those brick and mortor stores or geek squad,whic charges $100.00 just to come out to your plce or business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Santosh",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T02:25:12.000Z",
          "Titre": "Fast and efficient",
          "Contenu": "Fast service, very courteous staff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T13:34:04.000Z",
          "Titre": "Anthony is amazing",
          "Contenu": "Anthony is amazing, he came to our home just hours after my initial call even though it was the holiday weekend. He was very informative and knowledgeable. My notebook was retuned in a few days and he took the time to make sure I understood the new security system and how to use it. Thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr.Staid",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T18:27:55.000Z",
          "Titre": "Anthony has been such a find",
          "Contenu": "Anthony has been such a find! He is prompt, responsive, courteous, and extremely helpful. He was able to tackle multiple jobs to get my practice running smoothly again. THANKS, Anthony.😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lionel Yates",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T20:09:39.000Z",
          "Titre": "Very good communication and timing when…Great Computer Repair Service In Philadelphia",
          "Contenu": "Very good communication and timing when repairing my computer and Laptop repair in the Philadelphia Pa area. Will definitely use again and will refer to other friends and family. Thanks Anthony!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Richard Rosenbloom",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T19:44:53.000Z",
          "Titre": "I could bot gave been happer with this…",
          "Contenu": "I could not have been happier  with this wonderful company and the service I got from Anthony. He was very knowledgeable, professional, respectful and reasonable in his fee. He was very patient with my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T20:34:53.000Z",
          "Titre": "Computer Repair You Can Trust!",
          "Contenu": "Anthony is very communicative, responsive, professional and is good at explaining \"computer stuff\" for people that, in general, don't understand \"computer stuff.\"  Oh - and he makes house calls!  That's pretty amazing, convenient, and VERY appreciated!  The only suggestion I would have is more transparency on the corrected components and parts ordered - the invoice lists everything out but maybe sharing documentation for the parts that were ordered or work orders that are being performed - stuff like that - might be something they could consider providing in the future.  Otherwise, everything was super quick and painless and I would highly recommend this service to others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tasha",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T14:58:30.000Z",
          "Titre": "Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mazz",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T22:15:10.000Z",
          "Titre": "OUTSTANDING COMPANY FOR MAC IT!!!!",
          "Contenu": "I wish that I could award more stars!!!! After years of denials and outrageous quotes from companies telling me that they could NOT assist me with my computer issues, KombDev not only accepted the challenge, but successfully completed EVERY issue that I was having in record time! And, did this for A FRACTION of what some of the other companies were requesting!! I have given them more business already!In the timespan from 4/11/23 – 5/2/23, KombDev fixed and delivered: 1) Solved iPad to phone connection bugs and disruptions on site2) Recovered all unaccessible data from broken, external hard drive and placed it onto new drive3) Revived a broken 2009 laptop, upgraded necessary parts, ensured all data was secure, yet accessible, AND updated the machine so that it now runs as well as my 2019 MacBook Pro!!!The company owner, Anthony, is extremely friendly, knowledgeable and his customer service is ABOVE AND BEYOND! For client ease, Anthony arrives at the customer's home for onsite work and/or takes items back (for fixing.) He takes the time to listen and discuss the issues with his clients, and has the ability to communicate the most complex ideas in a a way that a less experienced client can understand. During the fixing process, Anthony updates the client at each step and ALWAYS obtains client approval if a part is needed, and once complete, will return your finished items to your door!I HIGHLY RECOMMEND KombDev!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T15:34:22.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. I wasnt given a bunch of tech jargon to charge me more. Anthony was honest. I appreciate that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CE",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T02:07:47.000Z",
          "Titre": "Very easy to communicate with a knew…",
          "Contenu": "Very easy to communicate with a knew the status of the work.  Only thing negative is I didn’t get a cable with my new hard drive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T19:45:04.000Z",
          "Titre": "Anthony is a great technician",
          "Contenu": "Anthony is a great technician, he came in in changed the tuner for us, made sure everything worked and left.  We didn't even have to be there. He's very trust worthy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet",
          "Nb_Reviews": 1,
          "Date": "2023-05-07T22:07:55.000Z",
          "Titre": "He was well knowledgeable about the…",
          "Contenu": "He was well knowledgeable about the computers we had and gave a through & timely response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "susan pohlig",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T01:01:44.000Z",
          "Titre": "I had the best service",
          "Contenu": "I had the best service! HE was very friendly and extremely helpfulCan't remember the day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judye",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T01:15:00.000Z",
          "Titre": "Anthony was great",
          "Contenu": "Anthony was great, he took all my calls and when here was very patient with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CLIFFORD SCHWARTZ",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T20:51:27.000Z",
          "Titre": "GREAT SERVICE",
          "Contenu": "THIS COMPANY IS GREAT 5 STARS VERY GOOD AT FIGURING STRANGE THINGS OUT.THAN YOU AGAINcLIFF"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FgL",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T20:56:52.000Z",
          "Titre": "Finally a great experience",
          "Contenu": "On time, polite, responsive, and affordable. Don't hesitate to call them !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danielle",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T17:23:04.000Z",
          "Titre": "Very helpful and quick turnaround"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T21:06:59.000Z",
          "Titre": "Fixed my laptop and was done in a…",
          "Contenu": "Fixed my laptop and was done in a timely fashion"
        }
      ]
    }
  ]
}