{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "ledsupply.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alejandra Carlo",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T22:39:28.000Z",
          "Titre": "Horrible Expirience",
          "Contenu": "I'm extremely disappointed with the service provided by this company. After waiting for a whole month with no updates on my order, I had no choice but to cancel it. The customer service representative, Jason, couldn't provide a clear timeline for my refund and falsely assured me it would be processed right away. It's been a week since the cancellation, and I still haven't received my money. This has been a truly horrible experience, and I cannot recommend this company to anyone. Avoid at all costs!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bella Jaemin You",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T20:10:50.000Z",
          "Titre": "The website said operating temp is…",
          "Contenu": "The website said operating temp is 30-90C for LED Sauna light. But the package said up to 60C. I returned the product, however, they don't give me a return shipping fee back. The website said they will cover for the returning fee if it's their fault. they lies. be careful on temp they claims.+ (adding details)here's my order number : 293442 Refund Shipping Fee : 23.56$"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T01:01:22.000Z",
          "Titre": "Terrible!!",
          "Contenu": "Terrible!!! After I placed the order I discover the transformers were insufficient Had to pay shipping back and still waiting on the credit to repurchase and pay shipping again!!! You see my money once but not twice!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T23:33:41.000Z",
          "Titre": "The suggested LED driver and photocell didnt work",
          "Contenu": "The suggested LED driver and photocell suggested to repair the ALTAIR AL-2163 did not work whatsoever. Wiring was simple. Initially I thought the photocell was bad since it was not outputting current, so I ordered another one.  However, none of them worked.  I ultimately contacted the light manufacturer, who provided a much more economical and useful solution.  I am returning the driver and photocells."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T00:33:36.000Z",
          "Titre": "I bought 6 dimmers to install in a…",
          "Contenu": "I bought 6 dimmers to install in a group of offices, one of the dimmers unfortunately does not work, I called to request a replacement but they told me that I have to send the damaged one but the shipping and return costs are higher than the equipment itself.  My company has been in the electricity market for 35 years and the person who assisted me treated me as if I were an amateur, I already asked for another one but it is the last time I do business with you"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter S Donald",
          "Nb_Reviews": 2,
          "Date": "2023-02-04T02:53:51.000Z",
          "Titre": "I was sent the wrong part. Tough titty.",
          "Contenu": "I was sent the wrong part.I let them know.They asked for a photo. I sent one.I asked them again to refund me. No Response.I give up. So bad review.Thankyou Jason Larocque."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 2,
          "Date": "2022-09-07T17:43:03.000Z",
          "Titre": "Wrong item",
          "Contenu": "I do wanna clarify service was excellent I was looking to replace the LED light in a Costco Altair garage carriage light. The rap assured me that what he was sending me would match the color of the other one .not even close the one he sent me is yellow the one I still have is the true white light I will be calling back to get it replaced."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T03:51:05.000Z",
          "Titre": "Support is condescending and very…",
          "Contenu": "Support is condescending and very unpleasant to deal with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Pulis",
          "Nb_Reviews": 3,
          "Date": "2022-04-05T20:55:11.000Z",
          "Titre": "The parts they suggested did not work…",
          "Contenu": "The parts they suggested did not work as applied. It did not solve the problem that they were intended. As a result the parts went in the trash along with the component they were purchased to repair. It was a waste of time and money."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Canadian Customer!",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T22:26:39.000Z",
          "Titre": "SOOOO much for express shipping.",
          "Contenu": "I had a full review here but its not worth it. (a) don't bother with express shipping, no such a thing exists here. been waiting a month for the fastest shipping option. (b) don't bother asking questions, you'll get some sarcastic answer practically right away. it would be better if I was simply told to bugger off rather than take passive aggression from a sales dude (c) do yourself a favour and get another vendor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T19:05:42.000Z",
          "Titre": "I've been ordering LEDs and supplies…",
          "Contenu": "I've been ordering LEDs and supplies from ledsupply.com - However, I cannot recommend them. Despite being a repeat customer, when I called to advise that one LED was not included in the latest order: the representative had an attitude, and reluctantly agreed to send a replacement. I won't order from them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeanne",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T22:33:23.000Z",
          "Titre": "If I could give you a zero I would",
          "Contenu": "If I could give you a zero I would.  No instructions, not even a word!  The wiring on the LED strip was so loose that unless it was in the exact correct position, it would not work, and the \"motion sensor\"  was old and didn't work.  Really, a lot of work and the Fedex package did not even contain a return label.  Please return my money.  It's the least you can do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAN TREADWELL",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T15:15:16.000Z",
          "Titre": "BEWARE!!  THE SITE IS RUNNING A PROMO FOR 5% OFF…",
          "Contenu": "THE SITE IS RUNNING A PROMO FOR 5% OFF AND FREE SHIPPING (A BANNER AT THE TOP OF THE POP UP BOX).  WHEN I PLACED THE ORDER (WHICH I SUBSEQUENTLY CANCELLED) IT CHARGED ME $7.99 FOR SHIPPING.  WHEN I CALLED CUSTOMER SERVICE, THE AGENT SAID THAT WAS ONLY FOR 13 OZ. OR LESS.  VERY MISLEADING.I DELETED MY ORDER AND WILL BUY ELSEWHERE.  IF A SITE WILL DRAW YOU IN WITH FALSE PROMISES I CAN'T FEEL COMFORTABLE THAT THEIR PRODUCT IS GOING TO BE OF QUALITY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JESSE",
          "Nb_Reviews": 2,
          "Date": "2021-03-28T15:51:28.000Z",
          "Titre": "Poor inventory and and material management",
          "Contenu": "Ordered LED lights that they had plenty of stock of and a couple weeks later ordered some for the test of my house.  After waiting a couple weeks I inquired and was then told they were out of stock and would be in stock in 4-6 weeks.  At the six week mark I was told would not have them for several more months."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeffery Beaudry",
          "Nb_Reviews": 4,
          "Date": "2020-08-04T02:45:45.000Z",
          "Titre": "Constant current driver for LED was good quality!",
          "Contenu": "Product (a constant current driver for LED) had its specs clearly delineated on the website, so that when it arrived there were no surprises and the item worked well when installed. Online videos and essays about how to select the correct product were well written and instructive. The product arrived in the mail early and in excellent condition. I was extremely satisfied with my experience purchasing from LEDsupply."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Erickson",
          "Nb_Reviews": 4,
          "Date": "2020-06-01T00:56:27.000Z",
          "Titre": "Site advertises free shipping",
          "Contenu": "Site advertises free shipping. When you click on product pages it says free shipping, then when you go to check out your tries to charge you $17. That is false advertising if you ask me. I took my business elsewhere and paid for shipping but at least I knew I was supporting a company that was being honest. Also the shipping was half with these guys recharging so don't tell me about not profiting from Shipping."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2020-02-05T20:11:20.000Z",
          "Titre": "Are you kidding I just called to ask a…",
          "Contenu": "Are you kidding I just called to ask a couple questions prior to ordering. The guy who answered the phone was rude and made me feel like I was bothering him. This was all before I asked my first question. I apologized for bothering him and he was still short and rude. I am planning on running LEDs throughout my five fitness studios. Looks like I will now be going elsewhere.What happened to customer service. David"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T14:06:56.000Z",
          "Titre": "Worse company ever",
          "Contenu": "So when I ordered my product I was on the phone with the guy from store and he said everything was in. Once I place my order a few days later I get a email saying that order is delayed because they don’t have something. It took over a month longer to get it and now that I have it I can not get them on the phone. I’ve been leaving voicemails since November and not one return call. This place is horrible and would not recommend them to any of my clients and will do my best to make sure everyone knows they are no good"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-14T22:50:33.000Z",
          "Titre": "Shipped the wrong product",
          "Contenu": "Shipped the wrong product. Identification made ordering the correct product confusing. Owner or cust. Service agent accepted zero responsibility, and wanted me to be 100% responsible. So, I ended up with a product I didn't believe I ordered, and didn't get the product I really needed. I guess when you're an old half broke down Vietnam Vet you tend to get taken advantage of."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-19T21:06:07.000Z",
          "Titre": "The item I received was used.,,",
          "Contenu": "The item I received was used. I could tell by one of the screw tabs being broken off and the wires were twisted. The fixture didn’t work after I installed the part, so I don’t know if it was defective or not. It is not worth messing with a return…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Hepler",
          "Nb_Reviews": 2,
          "Date": "2019-08-26T17:05:50.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "Be very careful when ordering power supplies from this website. When choosing an Mean Well LPV series, the voltage/wattage selector on the site brings up the wrong result. A call to customer service was a frustrating mess wherein I was told it was my fault that I received the wrong power supply. They finally accepted a return but kept the shipping. You can get better pricing and better service from TRC."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Johnston (IMAGESBYAIR)",
          "Nb_Reviews": 2,
          "Date": "2019-02-25T16:11:05.000Z",
          "Titre": "Returns completely inflexible",
          "Contenu": "Consider prior to purchase that customer retention is not of critical importance with LED Supply. If you have a brand new product, never opened in original boxes there is NO flexibility on returns after 30 days. If your project requirements may change, order elsewhere. Even if it happens to be 1 day past and you happen to be a longtime customer they are unwilling to even offer a company credit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin. customer",
          "Nb_Reviews": 2,
          "Date": "2020-02-25T15:46:04.000Z",
          "Titre": "No wiring diagrams",
          "Contenu": "I purchased this product. And the black and white terminals are supposed to be the power. There were no instructions as well with the packaging sent to me. I fried the component out. When I went online it said the colored wires with the power so I basically wasted my money and went out and bought new lights. Disappointing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LK",
          "Nb_Reviews": 2,
          "Date": "2020-03-25T15:27:13.000Z",
          "Titre": "Order Processing Issues",
          "Contenu": "Submitted order.  Went to a page that said \"order #0 received\" .  Order #0?  When I went to the link to \"print order\" I was taken to a link to create an account.  When I went to the \"view order\" link I was taken to the home page.  Never received an email confirming my order or any email at all.So, there is no way to reply to the reply from LEDSupply other than to edit my original message!My reply.  What do you mean \"no order\"? You charged MY CREDIT CARD!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fat Cat Labs",
          "Nb_Reviews": 1,
          "Date": "2018-05-06T22:42:50.000Z",
          "Titre": "I am weeks in waiting for my refund…",
          "Contenu": "I am weeks in waiting for my refund on drivers. I called 3 times with no answer and got a call back after leaving a voicemail. They claimed to have sent me 3 emails after my order about them being out of stock as well as processing one driver being shipped. Now I’m stuck without drivers for my equipment as I wait for a refund to buy drivers from a company that actually display the availablity of their products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 2,
          "Date": "2019-05-07T11:17:37.000Z",
          "Titre": "This order was fine but their customer…",
          "Contenu": "This order was fine but their customer service is garbage.I had bad LEDs and could not get in touch with anyone until I left a bad review. They contacted me trying to help and requested me to reply. I had replied various times and was completely ignored. So here I am again with another bad review for their garbage customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike minniti",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T11:09:13.000Z",
          "Titre": "I bought a led driver form you and it",
          "Contenu": "I bought a led driver form you and it didn’t work . I called and talked to customer service and told him the model # I was trying to replace and the 2nd one didn’t work either and you’re company wouldn’t replace them or reimburse me for either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-02-09T15:59:57.000Z",
          "Titre": "poor order status feedback and order fulfillment",
          "Contenu": "I ordered three led strip kits. after several weeks I called to check on the status of my order. I was told that it was backordered, something I wasn't informed of prior to my call. several weeks later I called again and was told that the items had arrived and they were filling orders and min would be promptly filled. A week later my package arrived. the order was incomplete and missing over half the items. I called again to be told that they didn't know what had gone wrong and they would look into it and take care of it. I have yet to receive the remainder of my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "christina",
          "Nb_Reviews": 1,
          "Date": "2017-11-03T23:37:42.000Z",
          "Titre": "I am disappointed in the product I …",
          "Contenu": "I am disappointed in the product I bought.  I got the 30 LED flex strip and it was 12\" long, which was not the size I thought it would be.  I decided I'd try it and not only did but burn through batteries in a matter of days, but the battery housing was so heavy that it couldn't be held up by the adhesive on the battery pack .  The adhesive on the back of the flex strip was also terrible - it didn't stick at all.  Super bummed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael8 M",
          "Nb_Reviews": 4,
          "Date": "2021-01-11T20:14:38.000Z",
          "Titre": "driver was DOA",
          "Contenu": "I purchased an exact replacement for an LED driver. I was certain that the driver was the problem. I connected the new driver in the correct way and it did not work. I went online to request a return or replacement and i did not find any way to do it on the web site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N/a",
          "Nb_Reviews": 1,
          "Date": "2016-04-14T01:09:02.000Z",
          "Titre": "Given wrong information",
          "Contenu": "I was told that I would have a product shipped within 5 days, I emailed and asked for an updated I was told it would be shipped two days after I emailed, come 4 days after that I had to call into customer service to find out it was going to be an additional 3-4 days because a product was out of stock and I was notified. Not planning on buying again. No apology on the phone no offer to make up the lost time on builds."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "M. Madrone",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T00:11:14.000Z",
          "Titre": "Poor quality control",
          "Contenu": "Pros: Products arrived promptly, no issues with ordering or shipping. Information on the site seems pretty good.Quality of products is... not great. I bought an RGB LED strip, controller, and power supply. The controller was defective — worked for about a day, then got hot to the touch, started emitting a smell of burned plastic, and stopped responding to the remote. I suspect a short circuit, but either way, it's toast (literally.) As for the LED strip, it outlasted the controller, but one LED is already partially burnt out — only lights up red — so I have my doubts about how long it'll last overall."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2017-10-08T13:50:16.000Z",
          "Titre": "Incorrect Portrayal",
          "Contenu": "The LEDs I purchased were advertised incorrectly. The website portrayed them as a specific wavelength, and this was incorrect. After creating my entire project I could not figure out the issue -- and later learned that the wavelength was entirely incorrect for my project and was two different peaks. Very disappointing experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KHO",
          "Nb_Reviews": 2,
          "Date": "2017-09-12T17:41:06.000Z",
          "Titre": "I ordered this item from Amazon and …",
          "Contenu": "I ordered this item from Amazon and paid to have 2 day delivery since we were leaving town in three days.  It did not arrive on time and when I check on line with LEDSupply, I could have purchased the same item for $10.00 and gotten 2 day service for free.  I paid $20.00 for two day shipping and did not get it in 2 days."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2019-12-23T14:02:10.000Z",
          "Titre": "Junk light parts with poor customer service",
          "Contenu": "The light I ordered came with a large unable to hide ugly box to control it. Complaining about it to customer service got me a snarky reply. They refused to refund my $17. I hope they really needed it. Junk stuff just thrown together from them. Never again will I buy from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-08T00:18:18.000Z",
          "Titre": "I called directly to purchase LED…",
          "Contenu": "I called directly to purchase LED lights acceptable for a shower.  We spoke extensively about the use.  When I received the strip there was a large sign on the front of the packaging that stated the product was not appropriate for water usage.  Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Craze",
          "Nb_Reviews": 2,
          "Date": "2019-10-28T19:07:05.000Z",
          "Titre": "This was nothing like what was shown",
          "Contenu": "This was nothing like what was shown, or described, in the picture.  It was supposed to be the slim, 12v flexible light with peel off backing.  I got a 110V corded LED light strip.  Not worth sending back for $20.  Just stuck with this one, and had to order from another vendor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2017-08-23T19:53:44.000Z",
          "Titre": "LED Supply Failure",
          "Contenu": "I have purchased from LED Supply many times however my last purchase was never received because the postman left the package on my doorstep and it was stolen. They told me basically to deal with USPS who said they left the package in my doorstep. A package worth $200.00 that I paid expedited shipping with no signature needed is a big failure  by LED Supply. I will never buy from them again. Lastly this was a replacement for defective LED flex strips and power supplies. There are better companies to buy from."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T23:11:29.000Z",
          "Titre": "Didn't fix things...",
          "Contenu": "We received the part and installed it but it didn't fix our problem. This was after watching an extensive video from LEDSupply suggesting it would be very likely to fix the problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Regina",
          "Nb_Reviews": 1,
          "Date": "2016-06-21T20:47:09.000Z",
          "Titre": "I'm still waiting!",
          "Contenu": "I was not aware this was backordered. I have been waiting for two weeks. I wrote to the company yesterday and was advised it was back-ordered. All very frustrating. I knew another color was out of stock but when I ordered, mine appeared to be in stock. I had no notice and no nice email. Simply awful."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "John Green",
          "Nb_Reviews": 1,
          "Date": "2017-12-28T13:21:57.000Z",
          "Titre": "Bad customer service.",
          "Contenu": "Ordered some led drivers, should have been delivered in 3-5 business days, almost a month later, still haven't received my order.I phoned and spoke to someone who said they would look into it. Took all my information, haven't heard from them in weeks. Very very bad customer service.Reply;Yes, I have contacted both the USPS and Canada post, Canada has not received it yet. I can't do a trace with USPS because I do not have a US address. I am thankful that you have started a trace, but I haven't heard from you in weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T15:35:41.000Z",
          "Titre": "My order was placed in October of 2020…",
          "Contenu": "My order was placed in October of 2020 this order still has not been filled I am missing parts of the order I have contacted David the sales manager on multiple occasions and no one has contacted me back to get it corrected and I was told that the manager had my emails the worst experience I have ever had and I will have to find a different solution for my led needs and don't recommend that any one order from this site ever. Edit 5/14/21 yeah these guys never even tried to contact me. again when you get ghosted by a sales manager. leave a bad review get told he will get back with you and still nothing. THIS PLACE SCAMMED ME. they took my money and never filled the order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2020-08-22T20:44:10.000Z",
          "Titre": "Don't trust LEDSupply",
          "Contenu": "It has been over a month since I first placed my order and still have not gotten a shipping notice. After not even receiving a receipt from LEDSupply 2 weeks after I placed my order, I tried contacting them. After an email and multiple phone calls without response, I was finally able to reach them to which they said my LED would ship in 2 days and arrive a few days later. 2 more weeks have passed and I still have not received a shipping notice or tracking number from them. Placing an order with LEDSupply is by far the worst experience I have ever had with an online retailer and most definitely will never be doing business with them again."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "sebastien kelly",
          "Nb_Reviews": 3,
          "Date": "2018-05-31T06:57:28.000Z",
          "Titre": "Placed order months ago",
          "Contenu": "Placed order months ago, still have not received any product.  Payed in full by Credit card.  Now sales team will not respond to my emails.  Have had no reply for over a month to multiple emails.  This is a bogus company and I will be reporting this to Visa."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T14:16:25.000Z",
          "Titre": "My package was returned to sender",
          "Contenu": "My package was returned to sender, and after reviewing the address I meant to send it to, nothing was wrong with it. Now I don’t have a refund on my checking account or anything, and I’d really like to get my original package."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken S.",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T23:56:15.000Z",
          "Titre": "The incorrect item was shipped to me…",
          "Contenu": "The incorrect item was shipped to me and the error I believe was solely on your end.  I have since found another vendor and have successfully received the correct item. Not  only was this a waste of money but time as well."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randall Taylor",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T13:32:48.000Z",
          "Titre": "Bad customer service.",
          "Contenu": "I purchased these items on the company's recommendation. I installed them and one blew up and the other one did not work. I emailed about the situation and did not receive a response. Not happy. Bad customer service."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Pierce",
          "Nb_Reviews": 1,
          "Date": "2018-02-26T20:40:33.000Z",
          "Titre": "I paid for shipping to be delivered…",
          "Contenu": "I paid for shipping to be delivered within 10 days, 20 days later the package is still not even in my country.  I needed these lights for a show but now it's too late to do anything, terrible service, lies on how fast the shipping is"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T22:59:51.000Z",
          "Titre": "Wrong part",
          "Contenu": "I emailed to make sure I ordered the correct replacement part and was given the part number to place order.  It doesnt fit or even look similar to the part I needed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2017-08-27T02:56:11.000Z",
          "Titre": "How does the dimmer remote work?",
          "Contenu": "Hi - I sent an email to LED supply through their info on their website about a product that doesn't work.  And I haven't heard back 3 days later.  Giving the low review in the hopes of hearing back about my questions.Thanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Casandria Harris",
          "Nb_Reviews": 1,
          "Date": "2016-01-13T19:57:57.000Z",
          "Titre": "Ridiculous Return Policy and Zero Customer Service",
          "Contenu": "Had to return an item that wouldn't work for us and since the box was delivered 2 days passed the 30 day deadline, they won't take it back. Owner didn't care about the holidays delaying anything. Just said he couldn't make any exceptions. Will never do business with them again. I would like to add that my husband didn't reveal his current cancer battle and that he had to have 4 tests done and a biopsy scheduled for tomorrow which also hampered our ability to return the item, but given their strict policy that doesn't allow any exceptions, I doubt the owner even cares. Will be filing a complaint with the BBB this week."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jye",
          "Nb_Reviews": 1,
          "Date": "2018-06-04T18:31:32.000Z",
          "Titre": "What I received was a lot different…",
          "Contenu": "What I received was a lot different than what I thought I was getting based on the online shopping experience. The strip is only about a foot and takes a huge battery pack to run it?! I was expecting a lot longer strip."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Siegfried",
          "Nb_Reviews": 2,
          "Date": "2018-04-02T00:17:14.000Z",
          "Titre": "I didn't know a lot about led lighting…",
          "Contenu": "I didn't know a lot about led lighting so I called LED Supply and ask for there help . Mistake, turns out they know about as much as I do.Needed to dim strip lighting in three places separately , also had 116 watts on one dimmer let them know this,they said no problem.What I received would not dim lights separately two dimmers were on the same frequency , and the remote for the 116 watt lighting was only rated to handle 72 watts MAX. Good thing I checked it after hooking it up , got hot as a fire cracker in about three minutes,and would have caught the house on fire. after making them aware of this they had no fix ,so I need to get the dimmers that will do the job somewhere else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-03-24T20:21:35.000Z",
          "Titre": "Order Processing Issues",
          "Contenu": "Order did not complete processing and I received no confirmation order was placed.  Not certain why I'm receiving this survey and hoping I don't receive the product since I ordered it elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dr. Ross du Clair",
          "Nb_Reviews": 1,
          "Date": "2018-05-21T06:40:22.000Z",
          "Titre": "When I ordered this string of LED's it was a complete failure",
          "Contenu": "When I ordered this string of LED's I was pleased with the solution it offered: a string of LED's, a the correct temperature, connectors to choose from, could be stuck to a flat surface and economical costs.I was sent a connector that was for right angle connecting. This is not what I wanted or asked for; The clamps on the connectors could not securely or electrically connect the strips (the plastic is too thick); the adhesive on the string of LED's, while attached to a wooden shelf, failed immediately.I carefully cleaned the wood surface with alcohol to remove wax or dirt,I will return the whole mess to you with this suggestion:  Please test your products before you sell them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ida",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T20:12:17.000Z",
          "Titre": "We ordered this bulb on Feb 20th and…",
          "Contenu": "We ordered this bulb on Feb 20th and have yet to receive it. I do not have a phone number so unable to complain directly. Maybe filling out this form will facilitate some kind of action.  Thanks.Today is March 15"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T22:55:36.000Z",
          "Titre": "Was given a different type led string…",
          "Contenu": "Was given a different type led string than what was ordered. They said their catalog was not updated.  We had to buy a dimmer to get the lights to work to make it work like we ordered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Keith smith",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T18:29:06.000Z",
          "Titre": "Wrong part",
          "Contenu": "Wrong part.  Even when it asked if it was 3 sets of wires I was sent one with only 2 sets of wires"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "IL",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T14:25:21.000Z",
          "Titre": "The Altair LED Kit does not contain a…",
          "Contenu": "The Altair LED Kit does not contain a power source that allows for photocell integration.  I had to use my old power source to utilize the photocell."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer Raul Pasols",
          "Nb_Reviews": 2,
          "Date": "2020-04-27T22:42:29.000Z",
          "Titre": "I ordered these attach connectors and…",
          "Contenu": "I ordered these attach connectors and got the wrong one. So I call them and no one answers. I gave my email and phone number but they can email me to give them a rating unbelievable"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Price",
          "Nb_Reviews": 1,
          "Date": "2015-09-15T23:11:24.770Z",
          "Titre": "Not met my expecatitions",
          "Contenu": "LED strip I bought was cheap quality, the double sided tape came off in many places, I had to use glue to attach the led strip. paid more money for less quality product. better next time try amazon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rick stockum",
          "Nb_Reviews": 2,
          "Date": "2020-09-04T18:27:31.000Z",
          "Titre": "Asked a technical question by email and…",
          "Contenu": "Asked a technical question by email and did not receive a review.  The switch I purchased was worthless as configured.  I am an EE and I never saw anything this useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2017-03-20T19:25:19.000Z",
          "Titre": "Great service!",
          "Contenu": "Kinda pricey, but I'm basically getting custom LEDs most of the time! My entire theater work light system uses the 3-Up Cree LED boards. Ultra efficient, great control, great light."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "utku kavruk",
          "Nb_Reviews": 1,
          "Date": "2015-03-04T15:51:47.000Z",
          "Titre": "cree xpg2 3-up fiasco",
          "Contenu": "First i must admit that ledsupply.com personel are very concerned about clients technical questions but it is not enough.\r I bought two sets with 1500mah drivers 11 months ago. I installed leds to either side of my motorcycle. Then 5 months later right side led malfunctioned. 2 months ago i contacted with led supply about my complainment. They said it could be due to overheating of pcb plate during soldering . So i purchased an other led module. It was shipped quickly and installed it to the existing heat sink. And guess what (!!!). The led do not function at the beginning.  I live 5000 miles away from US. How am i supposed to send it back???. my loses have already reached USD 50+. I do not recommend purchasing from that site if you aren't living next door to them."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T18:18:52.000Z",
          "Titre": "Purchased the MEAN WELL APC Series…",
          "Contenu": "Purchased the MEAN WELL APC Series 8~35W Constant Current LED Drivers and it worked for about a week now I get nothing. Failed after one week not worth buying"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "NK Prasla",
          "Nb_Reviews": 1,
          "Date": "2020-12-31T03:00:33.000Z",
          "Titre": "i buy 15 LED which don't fit as per my…",
          "Contenu": "i buy 15 LED which don't fit as per my requirement,i want to return, contact to owner,never reply back.i hope he is fine & will resolve this issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hunter",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T19:56:26.000Z",
          "Titre": "Item was supposedly in stock when I…",
          "Contenu": "Item was supposedly in stock when I ordered it.  3 weeks later still no product.  But they asked me to give a review on something I don't have so here you go"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "\"Jeff\"",
          "Nb_Reviews": 1,
          "Date": "2018-08-04T07:26:04.000Z",
          "Titre": "Disappointment",
          "Contenu": "Ordered product it showed that it was in stock, paid for it turns out it wasn't some how. Now its 2 weeks later, still has not shipped but my money is surely gone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-22T14:12:29.000Z",
          "Titre": "Difficult website to navigate purchase…",
          "Contenu": "Difficult website to navigate purchase through.The replacement part was not the correct part and subsequently does not work.Overall disappointing experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua",
          "Nb_Reviews": 1,
          "Date": "2018-03-04T00:51:37.000Z",
          "Titre": "It has been 3 to 4 weeks since I've…",
          "Contenu": "It has been 3 to 4 weeks since I've ordered my LED and I have not received anything nor have I received a confirmation that it has shipped. Is it actually coming??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy",
          "Nb_Reviews": 1,
          "Date": "2017-12-31T03:38:44.000Z",
          "Titre": "Misled me to believe that correct part …",
          "Contenu": "Misled me to believe that correct part was ordered. Upon part arriving it was wrong part and rep stated that was only one that Led Supply sold. Very disappointing!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bao",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T17:44:27.000Z",
          "Titre": "Still not sent",
          "Contenu": "Ordered months ago.  Received email saying they'd send it out 3 weeks ago, sorry no stock. Tracking sent 2 weeks ago.  Still in pre-shipment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "johnny harrison",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T15:48:06.000Z",
          "Titre": "confused obout product install",
          "Contenu": "i recieved no power supply, no instruction on how to install its very hard to understand the website as to what type of power supply to buy ect."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T22:28:13.000Z",
          "Titre": "Wasted money",
          "Contenu": "Wasted money. Customer service is non-existent. Order 2 products and both ended up not working/solving my problem. Dont think I will use them ever again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JEAN",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T21:57:22.000Z",
          "Titre": "No one will ever answer the phone",
          "Contenu": "No one will ever answer the phone. Takes 4 or 5 days to get them to return your call. They are not helpful at all in trying to find the product you need."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Gromain Starfoullah Gillier",
          "Nb_Reviews": 2,
          "Date": "2021-09-22T23:21:51.000Z",
          "Titre": "I wasn't told I would have to pay an…",
          "Contenu": "I wasn't told I would have to pay an extra of $70 for an initial bill of $150 because of the custom house.I am very disapointed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edd",
          "Nb_Reviews": 1,
          "Date": "2018-06-15T04:10:19.000Z",
          "Titre": "Wrong power supply",
          "Contenu": "Next time calculate the amount of watts required properly. After going through the 5050 datasheet I found that I need around 89 watts for a full reel, not 40."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-03T12:56:33.000Z",
          "Titre": "Got led power supply based on specs…",
          "Contenu": "Got led power supply based on specs from original... installed the new one, waited 3 minutes and the lights went out!  Enough said...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rahul Iyer",
          "Nb_Reviews": 1,
          "Date": "2017-10-16T02:04:19.000Z",
          "Titre": "The LED did not work!!",
          "Contenu": "The LED did not work!!!  This occurred after I troubleshooted the LED.  I will look at different options to teach electricity and science to my nephew."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-19T16:13:36.000Z",
          "Titre": "Wrong Shipment",
          "Contenu": "Was sent the wrong components to complete my lights...made those hours of research I did to make sure I received the correct parts wasted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angry installer / unhappy cust",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T17:15:57.000Z",
          "Titre": "Led uvc flex strip on clearance sale for a reason",
          "Contenu": "Led uvc flex strip which was on clearance sale was a complete waste of money The led strip was very dim and barely visible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T18:06:39.000Z",
          "Titre": "Connected all the wires inserted new…",
          "Contenu": "Connected all the wires inserted new batteries and it did not work! Tried do it all over and still did not work! Tossed it in the garbage!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customerDon roske",
          "Nb_Reviews": 1,
          "Date": "2022-04-03T13:52:22.000Z",
          "Titre": "E-z connectors are anything but e-z",
          "Contenu": "E-z connectors are anything but e-z. Spent hours trying to make connectors work. Would not buy again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Conner",
          "Nb_Reviews": 2,
          "Date": "2017-08-31T18:58:57.000Z",
          "Titre": "Honest review of a very unsatisfied customer",
          "Contenu": "When I recieved the package it came with the wrong ac power adapter so I had to wait and extra 4 days to receive the correct materials to even use my new lights. After having the right means to put up the lights the sticky side of the lights is absolutely terrible it fell down 6 times before I had to go out and buy command strips to keep it from falling down. I really wish that was all the bad things but then the reciever that you point the remote at to change the colors almost never works it takes me to press the button 8 maybe 9 times before the lights even react and change to the correct color. I thought I was buying a top tier product for LED lights but in the end I was given a terrible, over priced led light that I could have gotten from amazon for a 1/3 of the price. I thought going with and LED specific company would pay off but I would not recommend this product to anyone and just refer you away from this website to either amazon or another led light strip company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nithin",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T13:32:10.000Z",
          "Titre": "Not working with the LED strip",
          "Contenu": "Not working with the LED strip , I bought 50 of them and i think they are waste just going to dump into the dustbin ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "BRAM YOUNG",
          "Nb_Reviews": 1,
          "Date": "2019-12-26T18:16:18.000Z",
          "Titre": "LIGHTS BLEW",
          "Contenu": "LIGHTS BLEW, SPARKS AND SMOKE, WHEN CONNECTED TO \"T\" CONNECTOR, NOW ALL LIGHTS ARE DEAD! WILL BE SEEKING FULL REFUND."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Gaynor",
          "Nb_Reviews": 1,
          "Date": "2022-03-21T15:25:04.000Z",
          "Titre": "Would like to return product",
          "Contenu": "Would like to return product, because it will not link to Alexa.  Does not work as advertised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 4,
          "Date": "2016-09-05T22:56:14.000Z",
          "Titre": "backorder -still",
          "Contenu": "I ordered lights 2 weeks ago, was told they were on back order and haven't heard anything since. terrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SEAN WRAY",
          "Nb_Reviews": 2,
          "Date": "2021-06-17T14:25:06.000Z",
          "Titre": "Customer service was the only thing good about them.",
          "Contenu": "Was sent the wrong order at first so i got that sent back.then when i got my order only half of it was there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T09:25:05.000Z",
          "Titre": "The quality is poor",
          "Contenu": "The quality is poor, after the first suturing the wires did not stay, tried second time the small plate chipped away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2018-06-24T07:00:26.000Z",
          "Titre": "The item was out of stock for a week…",
          "Contenu": "The item was out of stock for a week and I was never told until contacting support.  It took almost 3 weeks to receive it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 1,
          "Date": "2018-06-14T04:33:51.000Z",
          "Titre": "Over priced",
          "Contenu": "Over priced. I found those for $ 1.98 in digikey. Exactly the same item. Never buy from your company.  Made a big mistake"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T00:42:53.000Z",
          "Titre": "4\"led",
          "Contenu": "My order was shipped on time arrived in good condition and work's like it should."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Todd Bullock",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T11:42:10.000Z",
          "Titre": "I paid for 2 day shipping ..",
          "Contenu": "I paid for 2 day shipping ... order was delayed for weeks and you still charge me for the 2 day shipping charge"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "janie",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T23:54:54.000Z",
          "Titre": "Defective",
          "Contenu": "The lights are beautiful, but they are supposed to be motion activated. There is no sensor, just an on-off switch"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2015-11-11T02:53:24.000Z",
          "Titre": "Purchased a LED Driver",
          "Contenu": "I purchased a replacement LED driver for an outdoor light and it lasted less than a week.  Back to square one!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miguel",
          "Nb_Reviews": 1,
          "Date": "2018-07-01T02:04:54.000Z",
          "Titre": "Replacement of Transformer suggested by…Lamps Plus Vendor in West Los Angeles",
          "Contenu": "Replacement of Transformer suggested by vendor did not work. When using dimmer to the lowest, light blinks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roberto",
          "Nb_Reviews": 1,
          "Date": "2016-02-28T23:26:17.000Z",
          "Titre": "really bad",
          "Contenu": "My pack ended nowhere. USPS blocked the parcel in customs. I will try to avoid being charged.\r Total scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T21:36:06.000Z",
          "Titre": "Its so dim it’s worthless",
          "Contenu": "Its so dim it’s worthless. Obviously the supply is not compatible. Don’t waste your time or money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T21:10:07.000Z",
          "Titre": "Very satisfied with the What you…",
          "Contenu": "Very satisfied with the What you recommended I get to replace my existing light fixtures. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Hamilton",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:35:40.000Z",
          "Titre": "The drivers did not work for my lights…",
          "Contenu": "The drivers did not work for my lights even though they were the ones identified as replacements."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven Orr",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T14:58:02.000Z",
          "Titre": "They provided me with two different lights",
          "Contenu": "They provided me with two different light strips in my order. This caused problems for my installation. Upon calling them they were very helpful in diagnosing the problem and correcting the issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trent Balzer",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T17:06:43.000Z",
          "Titre": "I was sent three lights,and only ordered two",
          "Contenu": "I was sent three lights,and only ordered two. I was assured by your rep tge 3rd wouldn't br sent, but it still was. I was sent a return label by your company and sent it FED EX. I'm not showing that my refund has been made to my account. The experience has not been good & I'm not happy. Someone should call me and fix this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gerald T. Fountain",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T21:33:27.000Z",
          "Titre": "My order was confused with another…",
          "Contenu": "My order was confused with another customer's.I received his order, and he received mine.Rather than take the chance of another mishap, we, at our own expense, contacted each other and mailed the ordered merchandise ourselves."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T16:45:37.000Z",
          "Titre": "My LED sauna lights will not stick to…",
          "Contenu": "My LED sauna lights will not stick to anything.  If you are selling LED Sauna lights with adhesive... you'd think the adhesive would work in a sauna... otherwise it is just decorative.  I asked for other solutions and was not offered any.  Turns out LED supply sells something called LED brackets (and in fact the description for this product says that 5 clips come with these lights- but none were enclosed with the lights).  That will likely be the only solution... and would have been a great thing to offer.  Secondly the rep offered replacement lights... I replied OK, and then he sent them saying that I need to return the first ones.  Bad communication.  Conditions should have been clear prior to sending the replacement lights"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T20:52:53.000Z",
          "Titre": "Item was damaged in shipping",
          "Contenu": "Item was damaged in shipping.  Looks like it was dropped or thrown and dented the enclosure (through the padded envelope and cardboard box.  It is functional so I'm not going to return it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T23:25:03.000Z",
          "Titre": "Placed my order on a Thursday evening",
          "Contenu": "Placed my order on a Thursday evening.  Chose 2day Fed Ex shipping.  Order wasn't delivered until the following Thursday.  Order should have arrived no later than the following Tuesday since that Monday was a Holiday."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 5,
          "Date": "2023-05-30T03:54:49.000Z",
          "Titre": "22 gauge wire is bad",
          "Contenu": "Items shipped quickly. IP20 strip light a good product with one exception. I've sent an email outlining the problem. Your 22 gauge wire was the problem. The wire was incompatible with the low profile beetle clips. The clip would not cut through the insulation well enough to establish an electricl connection. I eventually went through 10 clips before giving up on your wire. I used some other 22 gauge wire that I had onhand, and the clips worked fine. I managed to pry open the used clips and was able to reuse them. But before i finally decided what the problem was, It was one of the most frustrating projects that I've undertaken in a long time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen T.",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T18:52:19.000Z",
          "Titre": "No customer service support!",
          "Contenu": "I used the web site trouble isolation to determine which LED i needed for my outdoor light. It led me to order and LED board that was not compatible with my lights. my light is 30VDC and the (2) boards I ordered are 12VDC. Didn't realize this until installing it. Burned out one of the two. Sent a email to customer support and got no response - Want to return the unused, unburnt out board. How do I do it?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T22:22:38.000Z",
          "Titre": "I read that shipping was free",
          "Contenu": "I read that shipping was free, and then I was charged because I bought 8 lights.  apparently if I bought 1 light the shipping would be free or if I made 8 individual orders.  A great way to reward a customer for a larger purchase!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T20:28:27.000Z",
          "Titre": "No Strain relief for power connections",
          "Contenu": "The LED light strip kit does not have strain relief for the power connections. The connections broke off at the solder joints on the LED light strip as soon as I took the part out of the box.  I was able to resolder."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J. Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T23:06:46.000Z",
          "Titre": "The LED solder to the board separated…",
          "Contenu": "The LED solder to the board separated from one of the cables after about 10 minute of operation. I happened to have a solder iron and was able to reattach it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew Coltrin",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T07:37:32.000Z",
          "Titre": "The part I ordered did not fit or work…",
          "Contenu": "The part I ordered did not fit or work in the fixture I was trying to repair."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2022-06-20T16:12:53.000Z",
          "Titre": "I have bought from you guys several…",
          "Contenu": "I have bought from you guys several times before and had great success with your products and customer service. This last time my experience was horrible with your sales rep who blatantly didn't want to help me. I told him my ideas and what I wanted, he said he wasn't going to deal with me just saying numbers. That I needed to email it with what I wanted. Horrible experience with him which led me to look for a product elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T13:50:36.000Z",
          "Titre": "I think the products are great but I…",
          "Contenu": "I think the products are great but I was subject to duty and taxes that I don't have to worry about from other suppliers. I live in Canada was charged $20 for shipping (via Fedex) from LEDSupply and then was hit with another duty/taxes bill for $47, over half my initial order of $73. I have no clue how other vendors pay for the duty, but this is unacceptable."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T23:51:21.038Z",
          "Titre": "Need better communication of parts availability",
          "Contenu": "Was promised by email the items I was looking for would be able to be delivered in 16 business days, presented my quote to the customer and won it at this quoted price. After winning the quote and ordering I was then told the item would not be available until 2 months later, and had to buy an upgraded model at nearly double the cost to meet my customer’s deadline without receiving liquidated damages. The items I received worked fine, but their poor communication killed all the profit on my job."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T17:06:20.000Z",
          "Titre": "I received some LED warm white 9ft…",
          "Contenu": "I received some LED warm white 9ft strips and 2 plug in transformers for them.After about 30min one plug in transformer failed.I went to a different vendor and found the replacement for both of them.Now it works without any problems.I gave 2 stars because, although I am pleased with the LEDS, I am displeased with the cheap transformers that was suggested for the application from the sales matrix. They got hot and failed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John K",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T18:43:34.000Z",
          "Titre": "LED Strip Lighting Tracks",
          "Contenu": "The issues that i had with the LED strip lighting tracks were two fold.  One was that i had to pay almost 25% for shipping “2-3 day shipping” that didnt arrive until 5 days later.  Also the clips to hold the track in place ate not only difficult to lock in but they do t hold and the tracks come down.  Thats an issue when you have to solder pieces that break free when the clips pop.  Especially when they are under counter lighting."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2021-03-04T20:14:27.000Z",
          "Titre": "Your online order system needs work",
          "Contenu": "Your online order system needs work. I ordered a small led strip light and your system forced me to pick a power supply. Five bucks, no big deal so I picked the one recommended. When your package was delivered I found a power supply already integrated in the strip light and the extra supply I was forced to order was not even needed (plus it doesn’t even fit with the strip I bought)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-13T02:38:21.000Z",
          "Titre": "I’ve had great luck with these guys…",
          "Contenu": "I’ve had great luck with these guys before and like them, but this order wasn’t so good. The light was fine but I ordered a 3 foot track too. The box had been bent and the track was broken in the middle. There was also no screws included. I’ve bought them before and they always sent screws. I’m sure I could have returned it but Not that big a deal, I pieced it together and made it work, but I thought it worth mentioning since you asked."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr M",
          "Nb_Reviews": 4,
          "Date": "2020-12-12T02:04:06.000Z",
          "Titre": "Woeful Experience",
          "Contenu": "I paid for overnight shipping and was promised next day delivery.  Three days later, the order had not arrived.  I complained, and I was told that the order was not picked up when scheduled, and my expedited freight would be refunded.  Three more days went by, my order arrived and I was still charged for overnight shipping for an order that took a week.  Best of all, the part that I ordered did not work at all.  Other than all that, everything was wonderful."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill in Jacksonville, FL",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T14:55:45.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I paid for 2-day Fed Ex shipping and it took over a week.  I realize weather impacted the timing but I should not be charged.My bigger issues is that I tried calling customer service on two separate occasions and was directed to leave a message.  Never received a call back prior to the order.  I called again after receiving my order and was sent to voicemail. This was over a week ago and I still have not received a call back.  Very poor customer service both before and after the sale."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T03:57:03.000Z",
          "Titre": "stock issues",
          "Contenu": "Unfortunately my order has still not arrived after namore than one and a half months and was only shipped till a month after placement. Products listed as in stock were not in stock. Good selection of items and info on the site however unable to give a positive review in this instance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 3,
          "Date": "2020-07-02T12:43:55.000Z",
          "Titre": "I had ordered 3 LED bulbs for my older…",
          "Contenu": "I had ordered 3 LED bulbs for my older maglite.  There were advertised having no center black spots in the light output.  Ordered 3 units and when they arrived, black center spot.  I emailed LED Suooly about this issue and they informed me that it was maglite's reflector not their bulbs.  Didn't offer me a chance for returns or anything.  I'm dunn ordering anything from this company again"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-15T18:54:39.000Z",
          "Titre": "I watched the repair video for my Alere…",
          "Contenu": "I watched the repair video for my Alere outdoor LED lantern, purchased the LED driver recommended for repair, wired it as directed, and it doesn't work.  It does \"click\" which means the LED is working and the driver needs replacement.  Seemingly helpful recommendations and instructions would have been great if they only worked!  My rocket engineer neighbor did the work and we checked it again against the instructions so I know we did the repair correctly.  Bummer!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "judy",
          "Nb_Reviews": 4,
          "Date": "2020-04-16T16:32:52.000Z",
          "Titre": "incorrect materials shipped.",
          "Contenu": "The package came promptly but was incorrect.There were no clips for the plastic installer strip, no electric connection wiring and double wiring for the led supply. I tried calling , was told a callback would be done soon but 24hrs later I got a callback.By that time my husband had rigged it up with his supplies. I was disappointed that the packing was not accurate."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Rusher",
          "Nb_Reviews": 2,
          "Date": "2020-12-22T23:57:09.000Z",
          "Titre": "Everytime I solder wire to a switch…",
          "Contenu": "Everytime I solder wire to a switch then after 30 minutes of moving wire around it ends up breaking off at solder point.i mean when I move switch and wire to the side to solder other components the red wire breaks no problem with the black wire breaking, I've soldered slot of wire and used only best solder in my lifetime, so I don't know what it is doing it wire clips are out of the question red wire is dissapointing black wire works great that's my review money down the drain on red wire."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T16:34:05.000Z",
          "Titre": "Poor customer service and shipping",
          "Contenu": "Product appears to be ok. Bought 3000k led strand of lights, once installed, significantly warmer in color than standard 3000k. I wanted to exchange it. Had to pay shipping, return shipping, another shipping fee to get replacement. I paid extra for 2 day shipping for replacement, still haven’t received new light strand, it’s been over a week.  Customer service not helpful in any way.  Rarely able to get a person on the phone. Had to call multiple times, and not helpful with situation once I finally got a rep on the line."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer The Jack Parrish Band",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T19:34:41.000Z",
          "Titre": "Well I Rec tum... Daing near Kilt'm.",
          "Contenu": "Maybe it's because of the Coronacrap... You took my money so fast that it blew my mind... You didn't send me any kind of notice of any thing concerning my ORDER... As of now I don't have any kind of receipt... As far as the product... I ordered to have as spares... and looking for something else I found some on the net that was similar to yours... It's an adapter to use a 9 Volt battery  for effects pedals that has the little plug on it to plug to the pedal..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T17:45:21.000Z",
          "Titre": "LEDSupply falsely sells LED strip lengths",
          "Contenu": "LEDSupply falsely sells LED strips by the foot, like 12 feet, but since these LED strips are VERY likely made in China, they are manufactured in metric units (meter). So the 12 foot strips they sold me are actually 3.5 meters, which is 11.5 feet, meaning 6 inches short."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 2,
          "Date": "2021-11-29T20:59:13.000Z",
          "Titre": "LED clips now have too short of screws compared to old product sold a couple years ago.",
          "Contenu": "A few years ago I bought the plastic clamps with a screw that you use to retain LED strip lights in place, and they worked excellent. A couple weeks ago, I bought some more for some new projects, and the screw lengths were shortened up.  The screw length is now so short that an adult can no longer grasp them with your fingers and insert them into a wood pilot hole !!  The part number is LO-10MB-IPx / LO-10MB-IP67, Mounting Brackets for 12V LED Strips, Strip Type : Waterproof.I wish they would return to the longer screws, which are easy to handle with your fingers and install.  The short screws are a pain in the you know what !!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Hamm",
          "Nb_Reviews": 1,
          "Date": "2020-10-08T21:10:53.000Z",
          "Titre": "Causes EMI electrical interference",
          "Contenu": "Timely shipment but the product is the issue. The power adapter was ordered to power a piece of ham radio equipment, which it does. However, the power adapter generates EMI electrical interference. Since the photo of the product shows ferrite filers on each end of the 12v cord, I expected this would not have an EMI issue. I added three additional clamp-on ferrites with no improvement. When operating the radio equipment from a 12v battery there’s no electrical interference. Buyers should be warned of this possibility."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dana Ferris",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T12:52:18.000Z",
          "Titre": "Customer service and delivery was…",
          "Contenu": "Customer service and delivery was terrific. The problem is we are installing outdoor LED strips on my stairs. The clips that join the strips to the wiring are not working and is putting the whole project at risk. After reading other reviews of these clips I would wonder why they would even be an option?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelli Cannon",
          "Nb_Reviews": 2,
          "Date": "2021-11-24T17:55:54.000Z",
          "Titre": "Not as described or pictured",
          "Contenu": "Not as described or pictured. The photo of an adapter connected to a reflector is NOT the adapter that I received. Other photos of adapter are closer to what the adapter actually looks like, but still not quite right. Also the adapter has a diameter of ~51mm, not 54mm, as stated in the description. Not sure how the adapter is supposed to couple to the COB LEDs either. There is nothing on the adaptor to attach it to either COB LED or any of the aluminum housing units sold by LED supply. Adapter does connect to the 54mm reflector. Full documentation appears to be correct, but product description and photos are largely inaccurate and misleading."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Wargo",
          "Nb_Reviews": 4,
          "Date": "2020-08-06T21:28:30.000Z",
          "Titre": "1” LED Strip Channel",
          "Contenu": "While the support at LED Supply is outstanding, this particular product is flawed.  It is very difficult to insert the diffuser in general, and after you mount the strip and then attempt to insert the diffuser, it is nearly impossible.  This is a poor design and an exercise in frustration."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gernith Blanston",
          "Nb_Reviews": 1,
          "Date": "2019-04-21T00:54:02.000Z",
          "Titre": "The mounting clips were missing from…",
          "Contenu": "The mounting clips were missing from the order. I emailed the company and they replied saying that they do not send the mounting clips when you order the optional mounting track that I had ordered.  No where does it say anything about this on the website.  I pointed this out and asked them to send me the clips.  They then ceased to reply to emails.  All over them not sending me 50 cents worth of plastic.  To top it off, the lights strobe!  Sad to be treated so poorly by a local company."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "pete",
          "Nb_Reviews": 1,
          "Date": "2017-09-27T23:01:04.000Z",
          "Titre": "You are not honest to your costumer …",
          "Contenu": "You are not honest to your costumer regarding shipping fee...I tried to look how much I will pay for the shipping cost and I see price list that are very much lower than the cost when I \"commit\" the purchase...So, I end up to pay 13US$ for the 5us$ item....and you know what? the item is still nowwhere to be found on the tracking number you gave to me....You are \"no match\" compared to ebay, gearbest, and dx dealextreme."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2017-03-19T18:38:25.000Z",
          "Titre": "Double side tape inadequate!",
          "Contenu": "Love the LED strip lights but the solderless gapless connections are very temperamental. If you are connecting ends of strip lights together they are ok but for anything else use the use the gapless connection with leads, less of a headache. The double sided tape isn't even strong enough to hold the the led strips and they keep falling down, frustrating! I'll have to find another way to secure them to my cabinets"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2019-08-22T19:55:41.000Z",
          "Titre": "I didn’t get my package",
          "Contenu": "I didn’t get my package. I reached out to customer service, and they told me that the tracking from USPS said delivered, which I already knew. I have video footage that shows it was not delivered. It may or may not be the responsibility of LED supply to help me out here, but there were no suggestions or offers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard M",
          "Nb_Reviews": 9,
          "Date": "2017-04-18T18:47:04.000Z",
          "Titre": "LEDSupply is a 5 star company",
          "Contenu": "LEDSupply is a 5 star company; however the Cree XP-L has a failure problem.  I used 112 of the XP-L's, 3-up, 3000 deg leds and after a few months 6 have failed.  They are rated at 3 Amps, I used them at 1 Amp.  The temperature rating is 160 deg C, the heat sink temperature in back of the led is 72 deg C.  They should not have burned out.  I have also used dozens of Cree XP-G's and none have failed after several years.LEDSupply needs to look into the problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T19:51:39.000Z",
          "Titre": "Your website made it sound so easy for…",
          "Contenu": "Your website made it sound so easy for the layman to use your Buckbullet to convert 12 volt AC to 12 volt DC for LED lights.  Turns out there are some technical issues involved as well. Should make your site and products easier to use for do it you selfers. You would sell more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan O",
          "Nb_Reviews": 2,
          "Date": "2020-09-29T16:04:00.000Z",
          "Titre": "Can not recommend based on my experience",
          "Contenu": "I followed their recommendation for replacing surface mounted LEDs.  Well, they didn't work.  They claimed it \"must be wired wrong\" - it wasn't.  Then it \"must be the driver, here's the one you need\" - the new assembly didn't work in the multiple fixtures.  Finally, no returns on \"used\" products.  In short, they don't stand behind their recommendation or their product.  Fortunately, my credit card immediately and permanently removed the charges.  After that they suddenly offered a refund if I would send the LEDs back...I wonder why."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ustomer",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T18:11:25.000Z",
          "Titre": "I use led supply for most of my…",
          "Contenu": "I use led supply for most of my projects. I ordered a part for a customer ordered commission in January and didn't receive it until the middle of February. Communication was almost non existent and there was no apology or fix for the late wait."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2018-10-04T12:02:30.000Z",
          "Titre": "My order is on hold",
          "Contenu": "My order is on hold, something to do with an error on one of the products. It was apparently out of stock or discontinued or something. I am going to need to cancel the order completely as an indefinite hold will cause issues with my bank account.Sincerely,Catherine R. Allison"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T22:40:47.000Z",
          "Titre": "Cutting and splicing",
          "Contenu": "Helpful service, fast delivery, poor design.  If cutting and splicing waterproof light strip connectors don't work. Removed and tried to reposition wire clips about 20 times second string will not light up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 3,
          "Date": "2017-08-08T04:11:46.000Z",
          "Titre": "I have made a few purchases that have …",
          "Contenu": "I have made a few purchases that have been great but the last few times i have gotten some faulty products and they keep telling me it's my fualt there faulty and that I'm running things to high when i follow their suggestion on what to run things at I'll  be it. i do the max allowed but if it doesn't work right that high they shouldnt say that it does and it would be fine. and i would give them 5 if instead of arguing that it's the costomers they just make it right and refund or send new product in closing they went from a 5 to a 2 in my eyes and i may take my business else where ....respectfully"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T17:44:34.000Z",
          "Titre": "It didn’t work",
          "Contenu": "It didn’t work. After connecting the strips it made short circuit and the remote control became useless and only one color remained in use. To turn it off I need to unplug whole thing. Shame."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brent",
          "Nb_Reviews": 1,
          "Date": "2018-02-13T22:30:42.000Z",
          "Titre": "The dimmers work like they should but …",
          "Contenu": "The dimmers work like they should but they had a broken tab on each one when I got them so I removed them then later realized they were needed to hold the face plate on. If the dimmers didn’t have a broken tab I would leave a 5 star review"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul, Los Angeles",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T00:21:02.000Z",
          "Titre": "Poor communication",
          "Contenu": "Poor communication. Sent parts that do not match. Phone messages returned via email only, never answering questions directly to the issue or related to the questions at all.Had to return complete order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 3,
          "Date": "2018-03-22T18:52:13.000Z",
          "Titre": "I still can't review the actual…",
          "Contenu": "I still can't review the actual products as I have still not received them. I ordered 2 items on March 5th, both were listed as in stock. I received an email on March 6th notifying me that one of the items I ordered was on backorder and would ship on March 22nd along with my other item.Well, it is now March 22nd, NO products received yet, NO emails from LED supply updating my order status just this \"Please review your experience email\" which I have done.oh, btw....the rest of this order which I was able to fulfill from Amazon, was received complete in  3 days.That's what I get for trying to give other, smaller online businesses a try.Disappointed,Robert"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T01:46:16.000Z",
          "Titre": "The led driver shown applicable to…",
          "Contenu": "The led driver shown applicable to Altair led coach lights will not work on later models which look the same in the pictures, however the later models have a different led driver and photo cell."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MisLED",
          "Nb_Reviews": 1,
          "Date": "2018-10-23T21:09:24.000Z",
          "Titre": "Bad return policy",
          "Contenu": "The LED driver that I bought from them died. It was covered under warranty, but they wanted me to send the bad one in first. It would have cost more for shipping than it was worth. Otherwise, they have good prices."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2017-10-04T12:52:30.000Z",
          "Titre": "LED connectors are useless",
          "Contenu": "Bought a roll of the water proff LED lights. The connectors that I bought that were suppose to connect to lights and powere supply were useless. Not a little useless totally useless. Ended up not using them. Looked at a itunes viedo that show how to Pull back silicon water proff material and solder wire directly to the copper strips of the LED light string. Worked great, made a good solid connection.In response to your reply. The wires (Pig tails) you sent with connectors do not fit into the metal V slot. So when you clamp the lid down on connector the wire is not secure. On the other side of the connector the pin does not penetrate thru the paper on the LED role to connect to the copper strip."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trexor",
          "Nb_Reviews": 1,
          "Date": "2018-07-05T15:12:21.000Z",
          "Titre": "Not the best of quality",
          "Contenu": "My battery pack almost immediately broke the first time i tried to use it. I put batteries in it and then as soon as i flipped the switch, the switch caved into the battery pack and became almost unusable..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cal",
          "Nb_Reviews": 1,
          "Date": "2018-11-01T03:41:19.000Z",
          "Titre": "Bad Adhesive Backing",
          "Contenu": "The adhesive backing on the light strip has failed after only a couple weeks on the inside of the truck bed.  The surface was prepped and cleaned and already the light strip fell off the inside of the bed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "phil burnette",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T21:30:46.000Z",
          "Titre": "misleading on “free shipping”",
          "Contenu": "The website is misleading with the “free shipping” bullet point. When actually there is a 13oz limit, 13oz. Also, I had to pay almost 30.00 to to return the lights I purchased.phil burnette"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom P",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T16:11:50.000Z",
          "Titre": "I ordered the LED strip connectors and…",
          "Contenu": "I ordered the LED strip connectors and they did not work.  I ordered four of them and all four did not work.  I tried to reach out to customer service, and they did not seem to care."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dingo",
          "Nb_Reviews": 4,
          "Date": "2020-10-21T15:34:11.000Z",
          "Titre": "Shipping on Returns not so great ...",
          "Contenu": "Products seem fine but they don't have 3000k in their 5050s. The biggest complaint is returns - you pay your own return shipping and their outbound shipping. Buyer beware."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Caleb",
          "Nb_Reviews": 1,
          "Date": "2018-10-04T19:59:46.000Z",
          "Titre": "product arrived defective",
          "Contenu": "product arrived defective. Payed over $50 for 16 feet of led strip lights and a portion of them light up the wrong color. Project is now at a stand still while i return the defective reel."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 2,
          "Date": "2020-04-22T19:42:56.000Z",
          "Titre": "product was extremely late and not…",
          "Contenu": "product was extremely late and not communicated that it would be late.  the product did not do what I needed it to do even though the sales person said it would,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2018-08-16T16:51:35.000Z",
          "Titre": "Although the ac to dc converter was…",
          "Contenu": "Although the ac to dc converter was rated at 8 amps 100 watts, it wouldn't run a cooling fan that was 6.5 amps and 80 watts so it turned out to be a waste of money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clay Spangler",
          "Nb_Reviews": 2,
          "Date": "2021-02-02T23:48:40.000Z",
          "Titre": "At the time of this review I have had…",
          "Contenu": "At the time of this review I have had two sales experiences with this company. The first was for a single LED and lens. The purchase was easy and the order shipped immediately. The second order was for a few LED’s and lenses, all listed as being well stocked. A number of days later I had not received any information about the order, neither any information about the payment received or any information about the order being shipped.I finally got a reply to my email queries only to be told that they were out of stock and it would be a number of days before they could ship them out,I have found alternatives for supply, but the lack of timely communication has cost me time and money. The LEAST the company could have done was to ship the rest of the order to me, and sent the back order to me later when it arrived.As the owner of a company, I consider communication to be the most important of ALL customer services!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2015-11-05T19:33:39.975Z",
          "Titre": "Had a couple good orders, ended up dropping the ball",
          "Contenu": "I had made a few orders in the past with no problems.  In the past I did not need anything shipped urgently, so I would use 2-3 day shipping.  \r This last order that I made was a rush order so I paid the overnight delivery fee to get my products on time.  However,  It took them an extra day to ship the items.   They said that it was because I entered a PO Box on accident instead of my home and that it was an issue with Paypal.  \r Its not my fault that there is a paypal issue.  I relied on LED supply to be efficient and get the products out on time.  Overnight shipping almost doubled my order cost.  I was late on getting my product done and had a very disapointed client.  \r LED supply says it still not their fault and offered no compromise and stopped replying to me.  \r I will find another LED supplier to order from next time"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T18:13:04.000Z",
          "Titre": "LED Supply not bad, certain items terrible",
          "Contenu": "Ok so I ordered a driver, LED strips, connectors, and wire. Everything is great, except for the connectors. I wish I could leave a review for the specific items, as I would give LEDSupply 4-5 stars.Low Profile Beetle Clip Connectors for IP20 LED Strips - this item however is terrible. I ordered about 50-60 of them to connect several small strips in cabinets in a built-in entertainment center. I thought they would save time and make the project easier. I was wrong. It would have been much better to just solder all the connections on the bench. I'll say it again, these connectors are terrible. I had to redo the connections several times, the connection points were very weak. Sometimes the connection wouldn't be made, sometimes it would come loose despite being fully depressed. Just plain junk. Save yourself the frustration and don't buy these connectors, measure your lengths, and solder."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob Zimmerman",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T15:45:19.000Z",
          "Titre": "My order took nearly two months to…",
          "Contenu": "My order took nearly two months to ship. Communication was very poor from LED Supply. Apparently, part of my order was tied up somewhere with some supplier. I contacted LED Supply after 4 weeks of no delivery. They said, there was a problem with part of the order, and would send it out as soon as it came in, most likely before the end of the month. The end of the month came and went, no delivery. Contacted them again, same story... \"most likely ship by the end of THIS month\"... Got a notice that my credit card had been charged, which I assumed meant that my order had shipped. Ten days later, I contacted them again. They said, no, my order had not shipped yet... they had to go ahead and charge my card or the order would have been deleted! I would have been much more understanding had I been contacted by LED Supply regarding the status of my order. I was left in the dark. Bad form, LED Supply!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T15:34:38.000Z",
          "Titre": "Received wrong lights",
          "Contenu": "Received wrong lights, it appeared I was ordering ostwin light and received some other brand. Was trying to match existing lights that I have."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2018-03-10T22:53:44.000Z",
          "Titre": "BEWARE - wrong units shipped",
          "Contenu": "ordered 2 transformers for LEDs that I want to convert to hard-wired.  received them in record time -2-3 days.  Scheduled the electrician to install, and it turned out that the wrong units were delivered.  At first I thought it was my mistake, but then I compared the numbers on the units to my order and they were off by 2 digits, meaning they were not right for the fixtures, and could not be installed. I ordered the right ones, and it took over a week to get them, and I now have to pay the electrician for the 2nd visit to install the right ones.  The units are less then 5 bucks each, so it's not even worth my time to hassle the company for a refund and return the wrong units - they're going in the trash. I'm already out the cost of my electrician's time to come out the first time...  My advice, if you must order from this place, be sure to thoroughly check that what you received is actually what you ordered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T16:04:29.000Z",
          "Titre": "The product worked and the company is…",
          "Contenu": "The product worked and the company is very nice to deal with however the wiring is cheap and thin and easily broken. In the PIR set ups."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2016-06-30T11:27:16.000Z",
          "Titre": "Bad batch",
          "Contenu": "Strip did not work with DC. Touched on a car battery at 12v and didnt work. Worked once on AC for a test after DC after, nothing happened."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mayer",
          "Nb_Reviews": 2,
          "Date": "2016-01-31T23:01:16.000Z",
          "Titre": "No costumer service",
          "Contenu": "Called about a question...spoke to answering machine which promised a callback by representative  within a day... never called back"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 8,
          "Date": "2021-01-25T17:47:53.000Z",
          "Titre": "Customer Service.",
          "Contenu": "I have purchased many LED light strips over the last three and a half years from LED Supply. Overall my experience was very good until recently. During the past 3 1/2 years I purchased six different systems to install  install in friends and families houses and given those as gifts. I have bought many LED remote control cables to be able to turn the light strips on/off and dim them. The reason,  I have purchased many remotes is they seem like To fail frequently. They will work for several months and then don’t work at all and  must be removed and replaced with another cable and remote. This is not the case on all installations I have done but is the case on several  of them. LED has replaced them on one or two orders at no charge and has sent me at no charge a replacement remote cable when a remote came in a package with no remote cable. For the most part I have paid to replace at least a dozen remote cables and not asked for any concession. My poor rating is base on the last time I spoke with them I was told that they really could not help me with any other problem or problems that I should try elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T17:56:48.000Z",
          "Titre": "Their were no instructions",
          "Contenu": "Their were no instructions. Replacement did not fix my issue."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-09-25T23:30:52.000Z",
          "Titre": "The LED driver did not allow for use…",
          "Contenu": "The LED driver did not allow for use with a photo eye even though the add search indivcated it would work in my model."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2017-03-03T05:07:43.000Z",
          "Titre": "SLOW",
          "Contenu": "I needed the parts fast, but they took over and entire week JUST to process the order... then another half week to ship..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T01:19:06.000Z",
          "Titre": "You sold me tracks which are smaller…",
          "Contenu": "You sold me tracks which are smaller than the led strips and connectors that you sold me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2018-10-14T13:17:45.000Z",
          "Titre": "prices and selection were top notch",
          "Contenu": "prices and selection were top notch.  you will be my first option when i need electrical fitting again."
        },
        {
          "Note": 2,
          "Lieu": "JM",
          "Pseudo": "OpalDC",
          "Nb_Reviews": 2,
          "Date": "2020-11-26T17:28:31.000Z",
          "Titre": "The driver is too close to the rope…",
          "Contenu": "The driver is too close to the rope light it should be close to the plug. It's not practical"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2018-05-20T16:46:29.000Z",
          "Titre": "3M tape not sticky",
          "Contenu": "I received everything I ordered in time. The only problem I had was the 3M tape was not sticky."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2016-09-27T23:12:55.000Z",
          "Titre": "miss information in listing of product",
          "Contenu": "claimed to run on line voltage, but in fact there was a AC to CD power supply in the power cord."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "MYRON",
          "Nb_Reviews": 1,
          "Date": "2017-10-18T19:26:54.000Z",
          "Titre": "LIGHTS WORKED GOOD BUT",
          "Contenu": "LIGHTS WORKED GOOD, BUT ADHESIVE APPEARED STICKY ENOUGH YET IT WOULD STICK TO SIDES OF CABINET"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2017-09-14T14:56:37.000Z",
          "Titre": "I had to solder all the ends to the …",
          "Contenu": "I had to solder all the ends to the connector. The pressure from the snap was not enough."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T23:47:12.000Z",
          "Titre": "It would have been way more helpful if…",
          "Contenu": "It would have been way more helpful if the item i bought came with instructions."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pascal",
          "Nb_Reviews": 2,
          "Date": "2016-09-23T15:42:15.000Z",
          "Titre": "Way too much driver for what was required",
          "Contenu": "This is based on overall experience and not professionalism.I called and asked for the proper solution for a LED star. I was given the recommendation and sold a driver with 3X the amount of power needed. The first driver did not work at all out for the box. I needed to purchase another. That one completely fried the Star within seconds.After working with Tech support (they were outstanding) I was than sold the correct driver and a new star. LED supply Tech support made a tremendous effort to resolve my issue but overall for a company that sells LED's all day they should have never sold me the incorrect driver, mistakes happen and that was fine. Even for the small cost amount of the Star I should not have had to purchase a new Star due to the incorrect combo recommended to me initially. They did throw in a better driver in addition to my purchased driver, and everything works great now! The initial recommendation made was a mistake, we all make those. Although it dragged out my project over a week more than it should have, I would certainly purchase again from LED supply, as when things were correctly sent it was done quickly and with free shipping. 2 stars- Bad experience with incorrect driver recommended that was 3X too much power for the LED star purchased, which in turn destroyed it. The need to buy new hardware to replace it caused friction in my mind,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Saniyah",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T00:41:21.000Z",
          "Titre": "The price wasn’t reasonable for what I…",
          "Contenu": "The price wasn’t reasonable for what I bought and its delivery took forever"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T23:25:06.000Z",
          "Titre": "Still haven't recieved 2 packeges that…",
          "Contenu": "Still haven't recieved 2 packeges that I ordered over a month ago."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T14:50:09.000Z",
          "Titre": "Some items arrived broken and I had to…",
          "Contenu": "Some items arrived broken and I had to resolder the connections."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T19:21:35.000Z",
          "Titre": "Paid for 2 day shipping 9.99 got it in…",
          "Contenu": "Paid for 2 day shipping 9.99 got it in 3 days"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PC",
          "Nb_Reviews": 1,
          "Date": "2016-05-29T17:38:41.000Z",
          "Titre": "Poor",
          "Contenu": "Not user friendly. Did not return my call on need for help."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2017-02-21T02:36:21.000Z",
          "Titre": "Terrific",
          "Contenu": "Terrific service, could not be any better, thank you.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "T King",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T14:01:38.000Z",
          "Titre": "Installed as instructed and it didn’t…",
          "Contenu": "Installed as instructed and it didn’t work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T02:56:28.000Z",
          "Titre": "Shipping is TOOOOOOOO SLOOOOOOOOWWWWW"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chin",
          "Nb_Reviews": 1,
          "Date": "2016-08-01T12:12:50.000Z",
          "Titre": "Wrong shipping more than once",
          "Contenu": "Wrong items shipping more than once"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-23T20:24:19.000Z",
          "Titre": "Micro puck came melted looking."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2017-08-26T22:15:47.000Z",
          "Titre": "The part did not fit or work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JL",
          "Nb_Reviews": 1,
          "Date": "2017-05-18T14:01:42.000Z",
          "Titre": "Salesman seemed not to understand my complaint was lousy eng'g",
          "Contenu": "So I ordered and received some Seoul Z Power white triple-ups. When I got them (and after I called the vendor) was when I learned that by default the LEDs were wired in series, neither the description nor the order code mentioned this. But even worse the jumpers were located WAY inboard on the metal star! You need to appreciate that EVERY OTHER vendor locates all user-accessed pads WAY out toward the edge. If you locate the user pads way inboard then you need to locate \"thermal relief\" cutouts in the aluminum layer underneath the pads. Otherwise when you apply solder-melting heat you'll just have ALL the components slide off the PCB at the same time! Worse when you try and reheat the pads to put the parts back on the pads will only tolerate a few \"solder cycles\" then they'll delaminate right off the PCB and your entire assembly will become useless. I'm not even going to try and return these parts because I doubt they'll agree they are \"defective\" but in truth they are - defective by design! They're the most end-user-hostile MCPCB stars I've seen so far in this entire industry and the salesman didn't seem at all willing to acknowledge what a pile of caca he was selling (I guess because his commission checks continue to cash OK) but everyone else ought to stay well away from such a poorly thought-out design. In regard to the reply: Exactly how does \"reprimanding me for not reading some obscure note\" or taking back merchandise result in me getting in my hands properly designed products that I can actually USE the way I want and need? This is all just attitude and posturing and BS and \"the customer doesn't know or understand what he wants like we do therefore the customer is wrong\". The technical points I brought up are all completely valid and as long as that's true you are attempting to sell a horribly designed product that I can't use and hardly anyone else can either but the vendor figures so long as he mounts an intensive campaign that anyone who has trouble using his product as a doofus who can barely solder in the first place they're going to continue to get a certain amount of sales. I don't want to make this into a competitive issue but as soon as I realized what a thermal disaster this product was I immediately went to a local store and bought some units made by brand \"V\" and you just look at where they put the user pads on THEIR MCPCBs (absolute outer radius, which as I said makes it usable) so I was able to put them into service immediately instead of getting into interminable arguments about why I don't understand what a wonderfully designed product I just received. Good luck with THAT strategy!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2016-08-26T18:07:25.000Z",
          "Titre": "Replaced part worked after several hours to make adjustments to fit",
          "Contenu": "Same as above"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:38:44.000Z",
          "Titre": "Component installation challenging",
          "Contenu": "My lights work again but this kit is not cheap and I had to make multiple adaptations.   The LED driver screw holes do not align with the holes in my fixtures so the drivers only have 1 screw holding them in. The factory screws are too long so I had to use some washers as spacers. And finally the LED bulb screw holes don’t align with the factory screw holes and the included tape doesn’t stick to the heat sink panel too well.  For the price, better adaptation parts should be included in this kit.  LED Retrofit Kit for Outdoor Light FixturesAL-LED6W-xx-KIT / AL-LED6W-30-KIT"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T15:06:36.000Z",
          "Titre": "poor connectors from waterproof 12v…",
          "Contenu": "poor connectors from waterproof 12v strip lights to wires 50% of the connectors broke or wouldnt latch closed had to cut strip light coating to get to pads and solder on wires"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T04:48:03.000Z",
          "Titre": "Good products, unfriendly, slow to ship",
          "Contenu": "Good products—well made, but slow to fill and ship order and Scott in customer service was curt and unfriendly. You’d think if they want you to order their products they’d be ok with answering questions and helping you choose the right ones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T01:34:30.000Z",
          "Titre": "The service is excellent but I was…",
          "Contenu": "The service is excellent but I was frustrated with the kit I purchased. The kit comes with solderless connectors which is great. The problem is those clips don’t fit in the aluminum channel offered as an add on in the kit. This is not advertised and I could not complete my project until I ordered and received different clips that fit in the channel.  If you offer a kit with clips and a channel, I think they should be compatible."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Dave Maclaren",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T21:08:54.000Z",
          "Titre": "I followed the flowchart on your…",
          "Contenu": "I followed the flowchart on your website to find the right LED driver - for a 3 sets of wire LED light. However when I received it, it was not correct.  I talking to your (very knowledgeable) support person and found out that in fact you do not make a driver for the 3 sets of wires light.As it cost more for shipping than the product I just kept what I ordered - who knows I may need the drivers some day!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-21T15:39:21.000Z",
          "Titre": "Customer service is excellent but...",
          "Contenu": "Customer service is excellent but, they shipped 2 LED ropes that were dead on arrival. Was for a time sensitive project so I ordered from a different vendor who got it right the first try."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T15:39:23.000Z",
          "Titre": "They sent me someone else's order",
          "Contenu": "They sent me someone else's order. Still waiting for mine. Been a few weeks. Update: They were very quick to respond to my e-mail and my order has shipped.  Hopefully this time will be the charm."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T14:53:05.000Z",
          "Titre": "Waste of Time and Money",
          "Contenu": "1. Took longer to arrive than I was expecting.2. The connectors were really hard to open.3. Could not get them to work no matter how many times I tried.4. Eventually all the clear plastic tops broke off.2-1-23 CorrectionWhen I placed my order on 1-13-23 at 2:19 pm CST, I saw this:- ORDER BY 3PM EST FOR SAME DAY SHIPPING. What I failed to see was the 'EST' so I missed the deadline for that day...a Friday. Had I seen the EST I would not have expected my order to be shipped until January 16th, the following Monday. My bad!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel K",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T02:59:34.000Z",
          "Titre": "Your beetle clips didn't work for me at…",
          "Contenu": "Your beetle clips didn't work for me at all. I tried 5 different clips, in 5 different places. None worked. I ended up soldering the wire (supplied by you) to the LED strips (supplied by you)."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Oliver Schmachtenberg",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T15:58:32.000Z",
          "Titre": "Shipping problems",
          "Contenu": "International order has not arrived after 17 days, and tracking link was dead. However, I got a quick response from LEDSupply with the tracking number, and am confident that the parcel will arrive soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Odell",
          "Nb_Reviews": 2,
          "Date": "2023-02-17T19:35:44.000Z",
          "Titre": "The guy I spoke with was almost rude…",
          "Contenu": "The guy I spoke with was almost rude because I didn’t know exactly what I needed. That’s why I called him. I did get what i needed very quickly but he acted like he was doing me a favor and didn’t care to do it. Damn yankee for sure! Products are great and work great. I’ve told several people about the place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guy Monical",
          "Nb_Reviews": 4,
          "Date": "2023-05-10T15:28:34.000Z",
          "Titre": "I was to receive a replacement for a…sent wrong led drivers",
          "Contenu": "I was to receive a replacement for a LED APC 16-350.After I replaced bad led drivers with the drivers Led Supplied sent me nether lights lit up."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Yuliy",
          "Nb_Reviews": 4,
          "Date": "2023-08-28T23:31:37.000Z",
          "Titre": "Good product",
          "Contenu": "Product is good, no question. Delivery was fast. Price is comparatively high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerxlhugger",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T19:38:00.000Z",
          "Titre": "I need the power supply to make it…",
          "Contenu": "I need the power supply to make it work, don’t know which is the correct one to order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T22:27:27.000Z",
          "Titre": "The Cree CXB 1310 High Density LED…",
          "Contenu": "The Cree CXB 1310 High Density LED Array I bought is not compatible with my Altair wall light. The led board is too small and it won't stay flat because of the wires. The led driver works fine though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Noah Fox",
          "Nb_Reviews": 3,
          "Date": "2023-03-28T01:14:52.000Z",
          "Titre": "I decided to upgrade the light",
          "Contenu": "I decided to upgrade the light; however, the color is very different from what was described."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Finn Mathiassen",
          "Nb_Reviews": 33,
          "Date": "2023-06-30T19:33:06.000Z",
          "Titre": "The products are fantastic but .....",
          "Contenu": "The products are fantastic.The delivery to Denmark was a disaster and far to expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T21:02:39.000Z",
          "Titre": "Out of the six LED's I first ordered…",
          "Contenu": "Out of the six LED's I first ordered one of them went bad in less than a year. So I bought two more just in case. Used one,  now a second led has gone out and I'll have to replace it.33%failure on one order. Not good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T21:28:31.000Z",
          "Titre": "Buyer beware",
          "Contenu": "Got what I ordered. Not what I wanted. My bad. Metric measurements didn't register in my standard head. Also, more clarity regarding housings and their related proprietary LED components would help people understand your offerings better"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Billy Fowler",
          "Nb_Reviews": 4,
          "Date": "2022-10-28T18:38:05.000Z",
          "Titre": "the shipping packaging was deplorable",
          "Contenu": "the packaging was deplorable. the manufacture packaging is not designed for shipping and just dropping it into a shipping bag is the reason that I returned multiple orders to Amazon and purchased with LED and then LED does the same crap!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rusty",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T17:38:26.000Z",
          "Titre": "I wanted to install under cabinet LED…",
          "Contenu": "I wanted to install under cabinet LED lights but wasn't sure what I needed. I called their tech support line and had a tech walk me through my order as I placed it on line. He forgot the power supply which I had to order later and pay fairly expensive shipping again. The 4 wire cables used to go around corners or extend to another cabinet do not line up with the puncture points in the connectors. after an hour of trying to keep the wires separated to the correct width and breaking 2 connectors I gave up. ended up doing a lot of research and ordered other connectors that work from another LED site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ray Forgie",
          "Nb_Reviews": 5,
          "Date": "2023-02-13T19:18:08.000Z",
          "Titre": "Follow Up",
          "Contenu": "Product came timely. They did not follow up when I had a concern or question"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T21:03:30.000Z",
          "Titre": "Quality and poor wiring."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VG in Chicago",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T18:13:38.000Z",
          "Titre": "Lack of installation instructions",
          "Contenu": "While customer service is outstanding, I found the installation very difficult. A good set of instructions would have been very useful. I broke a number of connectors and strip pieces trying to figure out the right way to use them and ended up abandoning the project (and products I purchased)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John B",
          "Nb_Reviews": 1,
          "Date": "2022-03-24T15:36:21.000Z",
          "Titre": "Be careful with power supply for led",
          "Contenu": "Had a burned out power supply, called and spoke to rep at LED.  Advised him what numbers were on old unit, followed his recommendations for new supply and photocell.   Installation was easy with online instructions.  Apparently, new power supply was too much, because the led's went super bright, smoked and burned out within 15 seconds.   Had to replace the whole lighting system.  But, delivery was fast and I did get what I ordered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Rodricks, MD",
          "Nb_Reviews": 2,
          "Date": "2022-03-24T19:02:50.000Z",
          "Titre": "Amended review based in LED Supply's response to my complaint.",
          "Contenu": "After some confusion was explained and resolved, i would not hesitate to recommend them without hesitation and i would not hesitate to purchase their products. As far as i can tell, this is a reliable and trustworthy company that pays close attention to what it is doing. Cudos to LED Supply and thanks for everything. Five stars for LED Supply!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T16:27:04.000Z",
          "Titre": "wrong part deliverd",
          "Contenu": "I ordered led driver and wrong part was deliverd. I did not found out before using it. Waist of my time and mone. Never again!!!After my review, the LEDSupply contacted me and refunded my money. On the hind side I should have contacted them before writing a review. Because of the customer care reached out to me and resolved the issue I have changed my review rating to 3 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Norman Brown",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T00:28:45.000Z",
          "Titre": "Love the website",
          "Contenu": "Love the website, after their order was placed they always gave allot of info. I was disappointed that it took along time to fill the order as they were out of the product. Damn Biden couldn’t get the products from China because of the supply chain problems I guess."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Happy shopper",
          "Nb_Reviews": 2,
          "Date": "2022-02-21T18:43:51.000Z",
          "Titre": "I had previously ordered an LED driver…",
          "Contenu": "I had previously ordered an LED driver for my wall mounted light outside the garage.  We replaced it but LED light was extremely dim so I ordered the LED replacement light.  Little disappointed this solution didn’t solve the problem.   So now I have to go buy new lights."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynne Friedlander",
          "Nb_Reviews": 4,
          "Date": "2022-04-18T22:33:39.000Z",
          "Titre": "Good advice and bad advice",
          "Contenu": "I was advised (via email) rightfully by LED Supply that there were connectors I should not have ordered with my initial order because they would not work with light strips I was purchasing. They amended my order then shipped it out, That saved me time and hassle which was great! However, I was advised verbally (when I called to ask some questions) to purchase a power supply that turned out to be a pain and it was also unsightly. I ended up buying a different one which was a cinch - works and looks much better, but now I have to go through the hassle of trying to call and return the original supply. So on balance, it was a mixed experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T02:32:55.000Z",
          "Titre": "I bought to replace my led power supply…",
          "Contenu": "I bought to replace my led power supply for outside lamp which has a dusk to dawn could not get that part to work guess I bought the wrong one! It works as a on/off light perfectly is there an another one that will work will this set up! Thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul L",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T17:10:56.000Z",
          "Titre": "I was disappointed with the order because...",
          "Contenu": "I was disappointed with the order.  I bought weather proof LED strips and all of the parts and pieces that go with for assembly but, when it came time to put it all together, I had the wrong end connectors.  After several emails before the order with the sales rep to be sure I had it right, I would have thought the salesman could have let me know that the connectors would not work with the weather proof strips.  Other than that the product works."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RDL",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T21:30:48.000Z",
          "Titre": "Part worked but alignment didn’t...",
          "Contenu": "Since your replacement part holes did not line up with the holes from the part it replaced, I was forced to do a modification to make it work. It would have been nice if you had provided a “template” to use which would have made the Re installation easier.I presume you don’t do that because one part can replace many others, but it still was inconvenient to have to modify it myself.You asked for feedback...so here it was..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 3,
          "Date": "2020-12-07T03:10:36.000Z",
          "Titre": "Fantastic prices but inventory was…",
          "Contenu": "Fantastic prices but inventory was lacking. I wanted 6 inch warm white LED recessed lights but none were available. Ended up buying the \"neutral\" white lights that make my house look like a warehouse. So now i have to purchase lighting correction gels to make the lighting look normal and not like an empty costco warehouse. Really annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T15:34:19.000Z",
          "Titre": "Warm White is actually just yellow",
          "Contenu": "I purchased the AC Plug in LED Strip Light in WARM WHITE and unfortunately it was super yellow. I feared that the cool white would be far too cold and hospital like, and since the description was \"white\" instead of \"yellow\" I thought the warm white was the way to go. Unfortunately it is just straight up yellow. Also the strip is pretty thick, which for what I'm using it for doesn't matter but if it were going under upper kitchen cabinets that are at eye level, I think the thickness of the strip would be a problem. But at the end of the day, the color was the deal breaker for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KORN",
          "Nb_Reviews": 3,
          "Date": "2020-05-11T22:13:39.000Z",
          "Titre": "Pantry Lights",
          "Contenu": "My project involved installing & connecting ten 3-foot AC5050 strips.  Since you advertise what is actually a 1-meter length as a 3-foot length, I assumed that a 30-foot strip would give me ten 1-meter lengths of AS5050 strips.  However, your 30-foot strip only provides 9 1/2 strips so my design had to be altered leaving one section with only a 1/2 length (1/2 meter) of lights."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jayrco",
          "Nb_Reviews": 1,
          "Date": "2021-11-19T20:59:25.000Z",
          "Titre": "Good company great support but the rgb…",
          "Contenu": "Good company great support but the rgb waterproof string lights are finicky and the connections are awkward and difficult to work with. Male pins are so loose that have to be taped just so they won't fall out. Remote has limited capability compared to the competition. With today's technology one would think a simple thing like connections would not be an issue. More expensive does not necessarily mean better. Remote controller came in defective. Service and guidance was very good. If I did it all over again, I would not buy this particular product but the company and staff were very helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2021-08-27T16:43:49.000Z",
          "Titre": "Called in my original order",
          "Contenu": "Called in my original order, sales person was helpful and recommended 2 complete kits.  I asked for extra connectors too.  When received there was no way these connectors would fit the LED strip.  Called next day and was told “I ordered the wrong connectors and how I made a mistake or I pushed the wrong button”.  Finally asked this person how it was my fault, as I ordered on phone per their recommendation.  Really no apology, no credit refund either.  (Not a big deal as it was less than $20.) Seems like good product, just a condescending attitude with the 2nd person."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason B",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T22:45:32.000Z",
          "Titre": "Service was excellent, Lumen rating in question",
          "Contenu": "Service was excellent.  They answered my question and shipped my order quickly.  However, I don't think the advertised lumens per meter on their LED strips are accurate.  Or, if they're accurate, then human perception of the lumens is off.  To me, it feels like the lumen output is about 1/3 lower than advertised.  Even with the high density strips, I probably could have used another strip.  I don't think I would have had that problem with LED bulbs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T00:38:28.000Z",
          "Titre": "The products are nice.the price is…",
          "Contenu": "The products are nice.the price is awesome.  The shippingvwas fast. I did get helpful information from customer service, but I got the vibe that I was bothersome with every question I had."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David J.",
          "Nb_Reviews": 2,
          "Date": "2021-09-29T20:22:02.000Z",
          "Titre": "Not as Easy Install",
          "Contenu": "The information indicates you can cut the strips every three lights but there's no way to connect to another string there.  It's more like every six inches.  Connecting strings is not easy.  Hard to make a good connection.  Had to solder the connections."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan S.",
          "Nb_Reviews": 2,
          "Date": "2021-10-28T00:06:55.000Z",
          "Titre": "Hard to order a complete system…",
          "Contenu": "I had planned to test my system  before installation. I ordered a screw-on connector for the 3-foot LED strip, but the strip came with a female pin-type connector already attached. That is good, except, I don't have the male counterpart. I wish I had known about the connector already attached to the LED strip, as I could have ordered the correct mate.So, now I have to find a cheep, but necessary, part to move ahead. It would really help a novice If you provided a complete parts list for a few typical projects. (I did read several of your articles, and talked to your support before ordering.)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-19T15:27:05.000Z",
          "Titre": "Bought the waterproof led strip lights…connectors are just junk",
          "Contenu": "Bought the waterproof led strip lights and the connectors to connect multiple runs of lights. The connectors are horrible and don’t fit correctly and I’ve ended up breaking so many I had to order more at my expense. Lights are of high quality and look great but connectors suck!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stevo",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T12:42:20.000Z",
          "Titre": "The double stick tape is not very good…",
          "Contenu": "The double stick tape is not very good and everything fell off within one minute.  The LEDs draw a lot of current causing the batteries to drain fast. But the LEDs are nice and bright and very clean wavelength of light.  The motion sensor works good, it could be smaller and I wish I could adjust the time but overall is very nice package."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GWWFURNITURE",
          "Nb_Reviews": 2,
          "Date": "2019-10-10T17:40:04.000Z",
          "Titre": "Good product but..",
          "Contenu": "Good product but... I bought the remote so I wouldn't have to turn the battery pack on and off because the battery pack was to be buried behind a wall hanging display case out of sight, unbeknownst to me (even though you can turn the lights off with the remote) the battery pack will drain the batteries dead if you don't turn it off also. So unfortunately I wasn't able to use it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Doherty",
          "Nb_Reviews": 3,
          "Date": "2021-02-05T19:42:45.000Z",
          "Titre": "Placed a small order (Four 3ft LED…",
          "Contenu": "Placed a small order (Four 3ft LED strips) and was told in an email it would be several days before LEDSupply would have sufficient quantity to ship.Not four minutes later I received a confirmation email that my order had shipped.After receiving the order and installing. I 'complained' via an email that the double sticky tape on the LED strips had failed to hold the LED strips in place.I was told it my fault for cleaning the surface with alcohol and allowing it to dry. I was told I should have used soap and water."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stephen Von Bargen",
          "Nb_Reviews": 2,
          "Date": "2020-06-15T21:14:34.000Z",
          "Titre": "Ordering experience was awesome",
          "Contenu": "Ordering experience was awesomeShipping time was awesomeClips to mount?  Not so greatQuality of attaching the power cord to strip, lots of room for improvement - the heat sink twisted the end so much that it couldn't lay down flat.Don't get me wrong, light strip is great, just a little bit off on the quality control"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-27T22:33:50.000Z",
          "Titre": "The 6’ rope light I received is a nice…",
          "Contenu": "The 6’ rope light I received is a nice lighting addition. I didn’t receive the plastic hardware to install the light. I am waiting on installation parts it’s been over 2 weeks since conversation with a spokes person for your company. He told me they would be sent 1st class mail. I will let you know when I receive missing parts. Thank you for your service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T21:43:55.000Z",
          "Titre": "The driver I purchased did not work",
          "Contenu": "The driver I purchased did not work. I used a U-Tube video that explained how to select and connect the correct driver which was very useful in the section process.  However, the driver unit did not function properly once installed.  I'm at a situation where I do not know what to do next.Any support you can offer would be welcome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JAH",
          "Nb_Reviews": 3,
          "Date": "2021-06-26T04:04:10.000Z",
          "Titre": "Inventory Control Problems",
          "Contenu": "Inventory Control Problems  While the equipment that was delivered works perfectly, the company has an inventory control problem supplying the small items.  They still owe me a refund for the track mounting clips (18 ea) that should have been delivered in May!!!  I was able to make mounts to finish our project, but those homemade clips diminish the over all appearance of the LED strips--no one will ever see them unless they turn around and look up at the strips.Will I use their service again--yes, but only if they have everything on-hand ready to ship when ordered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cecilia Shull",
          "Nb_Reviews": 2,
          "Date": "2019-09-02T22:10:30.000Z",
          "Titre": "I ordered a led kit box to project my…",
          "Contenu": "I ordered a led kit box to project my granddaughters name to the ceiling.  It arrived promptly and in good condition.  My concern is with the quoted shipping cost.  The web page stated that using USPS first class would have no added charge.  However, that option was not available on the order page and I paid $7.99 for shipping.  Not happy about that charge."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2019-07-23T20:04:22.000Z",
          "Titre": "Good lights, bad adhesive backing",
          "Contenu": "The LED lights are very bright.  As I had read about in other reviews though, the problem that I've had is with the adhesive backing.  It continues to fall off and does not stay in place.  I did install in hot and humid temperatures, so maybe that is a possible reason.  I will have to by a double sided tape to hopefully get them to stay in place."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T12:31:00.000Z",
          "Titre": "When will my order ship??",
          "Contenu": "Have not received confirmation the order placed on 9/28.  Today is 10/6 and you sent an email asking how you did???10/6 UPDATE. Received a nice email from the company indicating a slight inventory deviation.  The order will split ship today and the back order soon.  Thanks for a prompt response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ty",
          "Nb_Reviews": 1,
          "Date": "2018-11-11T02:57:12.000Z",
          "Titre": "Product didn’t come with any…",
          "Contenu": "Product didn’t come with any instructions. Went through all of the clips and couldn’t get them to lock into the wires. I had to order more clips. The remote for the Led lights only work when standing 2 feet from the controller. Talked to the salesman and he said he would send another one. I never received it. Will not order from them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2022-02-19T10:40:43.000Z",
          "Titre": "Plastic mounting channels not compatible with light strips",
          "Contenu": "The plastic mounting channels for the strip lights I bought were impossible to get the strips into and therefore useless.  The mounting strips were clearly not designed for the particular strip lights I purchased."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DFJ",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T16:44:38.000Z",
          "Titre": "Kit parts incompatible",
          "Contenu": "When I ordered the kit, it arrived without parts that fit together (wire connectors not fitting in the extruded metal channel).  Unfortunately, I felt that since the website did not let me know that all the kit parts didn't fit together, I needed additional parts.  Eventually I was able to finish my project with the new connectors supplied by LEDSupply, but it took coercing and a reminder that I expected a kit to be a complete kit, not a piecemeal entity that needed more purchasing to be used as intended. The lights look great and I am now happy with the product."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-26T16:01:10.000Z",
          "Titre": "Everything arrived quite late",
          "Contenu": "Everything arrived quite late by almost a month. I was told weeks in that there was a delay in filling my order. I feel this should be brought up much sooner with proper inventory tracking. Also a bit pricey if you’re ordering smaller amounts. Stuff all works though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 3,
          "Date": "2018-07-22T04:09:32.000Z",
          "Titre": "Was helped before purchase and after by…",
          "Contenu": "Was helped before purchase and after by a well-meaning person who seemed genuinely interested in making my experience pleasurable, and they succeeded at that. It remains to be seen, however, whether the product they suggested can be made workable in my application -- it did not work as advertised, but there may yet still be a way to get it to -- and technical proficiency could have better. Would be better to have a more turn-key approach to address specific project specifications."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "wayne",
          "Nb_Reviews": 2,
          "Date": "2018-03-30T19:26:38.000Z",
          "Titre": "Good products, no pre-sales help.",
          "Contenu": "Products were fine and shipped quickly, pricing is good.However, the phone was never answered, I left messages butdidn't get a call back so I had to hope my choice of componentswere matched.Edit: Company explained their phones had issues but are working now.The parts I ordered were matched properly, so everything is ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Duane",
          "Nb_Reviews": 1,
          "Date": "2017-09-27T20:20:12.000Z",
          "Titre": "Ordered a replacement part for an LED power supply",
          "Contenu": "Ordered a replacement part for a defunct mfgr. Received the suggested replacement quickly and in good condition.Part didn't work. Rewired per suggestion from LEDS, still didn't work. I liked working with LEDS, but decided to throw away the LED light fixture rather than purchase another part (LED power supply).I would use LEDS again, but only if the p/n was an exact match. I'm now out nearly $100 (part + new fixture), but that is not LEDS' fault. Bad joss."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T18:53:22.000Z",
          "Titre": "The call back and personal help were…",
          "Contenu": "The call back and personal help were awesome. Your Website it horrible. Please update it. You are losing business. I ordered a few things and navigating through it was a huge challenge. I originally bought the LED ti use with battery and I assumed it was included. when I got it I had to then go back online and order the battery pack. Augh.  I'm a business owner so I want you to succeed. Seriously, watch over someone's should who does not know your company, and witness the struggle. Model Amazon. Do something, for your sake and your bottom line. Please.Darren"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chuck C",
          "Nb_Reviews": 1,
          "Date": "2015-03-26T21:24:15.000Z",
          "Titre": "Nice but incomplete",
          "Contenu": "I have purchased quality products from LED Supply before, but this time decided to assemble myself. I have found no wireing diagram for the PUC to led's or to power. Also the description of the epoxy best suited for the project would be nice, or even including it with the kit. \rI have put the project on the back burner until I collect the essentials."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S. Squarepants",
          "Nb_Reviews": 1,
          "Date": "2015-08-14T05:05:48.744Z",
          "Titre": "Great pices and delivery but put WARNINGS ON THE PACKAGE",
          "Contenu": "These guys sell some powerful LEDs and should provide ample warnings/documentation with the units they are selling to prevent buyers from damaging their retina's.  These are not toys and the rather carefree labeling lends one to think these are not dangerous, which they are.  Other than that, LED came exactly as described and arrived FAST."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 2,
          "Date": "2020-05-03T01:38:17.000Z",
          "Titre": "LED strip light & power adaptor work",
          "Contenu": "i guess free shipping only applies to 1 or 2 item orders. LED product line is limited. If you want a nicer LED low volt dimmers you have to look some place else. But this is true to all LED stores, they dont carry dimmers. I have to DIY some parts when assembling the LED lighting I ordered from LEDsupply. The corner connector is too long that if you use it, you have a big dead spot on all 90 degree corners you make. Maybe not a lot of people make 90 degree corners because its just bad. Shipping is fast though if you are avoiding amazon nowadays due to COvid."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2016-02-26T17:50:48.000Z",
          "Titre": "self stick led lights",
          "Contenu": "i used these self stick LED lights under my new kitchen cabinets. i cleaned the area real good before installing them, everything was going well until i got half way done the lights started falling down no matter what i did they wouldnt stay. went to home depot and got a roll of double face tape this solved the problem. glue has a shelf life,maybe this roll of lights were expired. i love the lights.they give off great light,most of all my wife likes them. thank you for your help on the phone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 3,
          "Date": "2015-05-06T15:43:02.000Z",
          "Titre": "Alright, but some room to improve",
          "Contenu": "I found that after I placed my order, I got a confirmation, but no shipping information.  That is odd in this age -- why not add a \"your order has shipped!\" email with tracking information?  Also, I felt the cost to be somewhat higher than expected, but I was limited by the parameters of the project."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nat",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T01:13:43.000Z",
          "Titre": "The quality of the products they ship…",
          "Contenu": "The quality of the products they ship is excellent.  They will ship small orders for the cost of a first-class stamp -- also excellent.  But, they struggle to calculate the proper resistor to use with their LED's.  Buy their products but do your own math."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T14:02:58.000Z",
          "Titre": "Just a couple things detracted from a great experience.",
          "Contenu": "The order was shipped incomplete.  LEDs were from two different color temperature bins.  Parts that were shipped are of very nice quality and the selection of parts is exceptional for quick prototyping or one-off projects.  I will definitely order again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Renee",
          "Nb_Reviews": 1,
          "Date": "2018-12-01T18:55:52.000Z",
          "Titre": "Low communication",
          "Contenu": "Low communication, no updates on custom LED after 7-10 days passed. Carged me, and then for some reason cancled it, putting me in a position of having to go through a paypal direct pay, of which I haven't recieved additional comunication on, which I imagine is going to lengthen the time on recieving my order. Just makes ordering from them feel a bit sketchy. Have not recieved any products yet, so cannot comment on that. Over all, pretty average/below average experience. Hoping the quality of the product will up my opinion in ordering from then again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2018-11-15T15:45:16.000Z",
          "Titre": "Not happy with product",
          "Contenu": "Staff very knowledgeable, products were not as reliable as I hoped connector ends would be better with permanent wires attached difficult to establish good connections, wireless remote has a very limited range like 2-3 feet adhesive didn’t secure  definitely buy straps to retain"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerRon Skye",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T00:45:25.000Z",
          "Titre": "No instructions what so ever to make up…",
          "Contenu": "No instructions what so ever to make up the various connections....yea ...there are some if you go back on line...but there not that great.....would have been nicer to have a set in the “kit” you sent....."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2018-06-09T15:00:59.000Z",
          "Titre": "LED strips don't stay glued to…",
          "Contenu": "LED strips don't stay glued to cabinets. Some areas are pulling away already after install.  I cleaned with alcohol prior.  Strip connectors are very difficult to use and the corner connector didn't work at all. Prices are very good, but you get what you pay for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Old Republic Armory",
          "Nb_Reviews": 1,
          "Date": "2015-06-04T19:02:38.741Z",
          "Titre": "the prices for LEDs are great, however the \"Kits are incomplete.",
          "Contenu": "I bought an LED kit and the heat sink was not compatible and would not screw together, when I called i was told that there was another part that i needed.\rI thought the definition of a kit was that all parts were included. \rThe LEDs are a good price so I will just buy the LEDs only."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2018-03-23T22:11:32.000Z",
          "Titre": "Dimmer for Low Voltage LED Lights Didn't Work...",
          "Contenu": "Overall, service was excellent, but with one reservation. I talked to an informative staff member about dimming outdoor, low voltage (12V) LED bulbs. Based on his recommendation, I purchased a \"driver\" and a dimming device with a remote control. I am rather sure that I got the right bulbs (from another vendor), good for \"full dimming\" and for \"AC/DC\" (the driver puts out 12V DC). PROBLEM: The dimmer doesn't work! I took it out of the circuit, and everything works fine except no dimming. Too bad for me? ... Or is there another solution?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2017-07-11T18:35:38.000Z",
          "Titre": "Once I placed my order it came very …",
          "Contenu": "Once I placed my order it came very quickly. However, I needed to call back with questions and could not get anyone.  No one answered the phone for several days and my voice message did not get returned. I had to continue calling until eventually someone answered the phone."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2018-04-25T04:52:26.000Z",
          "Titre": "Can't say if product is good cause it…",
          "Contenu": "Can't say if product is good cause it is still in shipment. Of course i don't mind the burocracy involved in it but is very sad that once the order is assigned to the local shipping company (Italy) all tracks are lost. I now have an issue with sda to be solved"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T14:24:55.000Z",
          "Titre": "Unclear description = incorrect ordering",
          "Contenu": "I ordered the wrong size because the description wasn't quite clear. They didn't clearly label that the listed diameter tube sizing is the size it shrinks INTO. As a result, I decided to order something larger because I assumed the sizing was the initial size of the tube and it would shrink to fit whatever size cord or tube you'd fit it over with. I ended up receiving 10 feet of tubing that's far too large and thus unusable. Maybe this is just something that's understood but I believe it to be problematic. Regardless, I do feel like the company does a good job of packing ans shipping their items quickly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Parreco",
          "Nb_Reviews": 2,
          "Date": "2021-07-30T23:23:07.000Z",
          "Titre": "It is great if you know what you are…",
          "Contenu": "It is great if you know what you are doing. If you’re a novice, it is difficult to navigate what you need. The order was affordable and arrived rapidly. I have no complaints other than trying to decide what to buy"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Shoemaker",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T14:13:10.000Z",
          "Titre": "Product ordered was not in stock and…",
          "Contenu": "Product ordered was not in stock and LED Supply made no effort to inform me of that fact.  I called to inquire where my order was and was told that they were out of stock.  I found what I needed elsewhere but did not cancel my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Southland Electric",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T11:24:10.000Z",
          "Titre": "Product is fine",
          "Contenu": "Product is fine.   Paid extra for overnight delivery.  1st delivery Friday after hours.( no one here)     2nd delivery Saturday 6:18  we were closed.  Delivered in mail box the following Tuesday afternoon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "stan",
          "Nb_Reviews": 1,
          "Date": "2017-07-14T14:37:41.000Z",
          "Titre": "Service is great... products not so much.",
          "Contenu": "Service is great. The quality control on the products are not so great. Ordered eight, three foot strips of led lights and one had to be replaced because it flickered. Also the adhesive failed on most of them after two days, so ended up rubber cementing them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T22:07:29.000Z",
          "Titre": "Service improved",
          "Contenu": "I placed an order on April 13th and still have not received it. April 18th was the last tracking information I received and it showed it was in transit. I spoke with someone from the company whose only response was that due to the pandemic some items were taking longer to arrive. The only option he gave me was to wait.  I have since left two messages inquiring about my order and have not received a return call. Update- after posting the review I did receive a call back and they were willing to send out another shipment.  However by the time the item was back in stock, my original items finally arrived. I was pleased with the improvement of the service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil",
          "Nb_Reviews": 2,
          "Date": "2018-12-31T11:22:09.000Z",
          "Titre": "That one time...plus some",
          "Contenu": "Well I love LED supply. They always ship fast and have great products. Except for the time I bought my first luxgeon led and had an issue with one of the led nodes falling off making the led unusable. I reached out to LED supply about this and was never replied to.Edit: Fast forward 2 months after my original review. I was contacted by the company and told to reply to an email if this issue was not resolved. Well I've replied a hand full of times with yet again no response. It was a direct response to the sales member that emailed me. I can't see that being lost in the spam folder. This whole situation is a joke."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2018-07-17T14:53:27.000Z",
          "Titre": "I’ll try them again",
          "Contenu": "The product iitself is excellent...however their was an issue with shipping and I didn’t get what I ordered for a week later after paying for 2 day shipping. However when I called them they were helpful and understanding. Will use them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Doyle",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T03:08:45.000Z",
          "Titre": "Under counter lighting: B-",
          "Contenu": "I came to the site to learn about LED under counter lighting for my kitchen. I found a lot of interesting information from videos and was able to purchase all the parts I needed. Even using the purchased aluminum track and diffuser I find the LED strips to reflect in the old and new countertop and on the back splash. I am planning to only point the lights at the underside of the rear cabinet to avoid a line of LED dots. This may work somewhat well but renders a lot of the parts I bought useless. I also have found that the wire to wire and wire to strip connectors are extremely difficult to undo if you haven’t made a solid connection or one wire is a little out of kilter. I may have to throw some away and purchase new ones. Overall I wouldn’t have started the project if I knew it was going to work out this way."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2018-06-10T18:39:49.000Z",
          "Titre": "I bought strip lighting for under…",
          "Contenu": "I bought strip lighting for under cabinet lights during a kitchen remodel. Parts were back ordered but website didn't state that when I ordered, so that set me back about a week. When I called in the guy that took my call was very friendly and helpful. I had ordered connectors that the site recommended for my lights and they turned out to be the wrong connectors. Already behind schedule I ended up having to solder the connections. I now have $22 worth of connectors that I will be trying to return. The products work great now that they're all hooked up. Not a bad company but don't trust the recommended accessories tabs."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "B M",
          "Nb_Reviews": 1,
          "Date": "2020-09-05T01:21:33.000Z",
          "Titre": "Product works",
          "Contenu": "Product works, goes through batteries quick. Wish the lights stay on little longer after turn on. 10 secs not good. We got 3 of these and they on/off on/ off etc too quick, little annoying . Now hard wire so keep on."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-04-16T15:36:58.000Z",
          "Titre": "Worked amazing and was super easy",
          "Contenu": "Worked amazing and was super easy. LED strip slid right in on both sides and both strips turned on. On certain colors the first strip and 2nd strip are different colors though? Ill set it to red but the 2nd will be green."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donny",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T01:08:33.000Z",
          "Titre": "One of the light connector broke off…",
          "Contenu": "One of the light connector broke off while I was trying to position the lights you can't push the adhesive hard enough to make it stay to the surface otherwise if you do it will broke."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Patrick O’Connor",
          "Nb_Reviews": 1,
          "Date": "2019-08-21T21:20:19.000Z",
          "Titre": "While the quality of the products are outstanding, navigating the website is a headache b",
          "Contenu": "While the quality of the products have been superior ordering theses products has been an effort in futility.  This company needs to spend some time making their website intuitive, their search feature useable.  Additionally when parts are ordered their are absolutely no instructions included explaining how to use those parts.  This is unfortunate as another company could very easily use this site as a template, improve the ordering / search  features and include instructions and make a killing.  On line technical support was also non-exitant.   I must say that one I figured out what part I needed and figured out where on the site to order it from, the parts arrived quickly and shipping was free."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2015-11-02T06:21:30.593Z",
          "Titre": "need to keep better track of onhand items",
          "Contenu": "Items ordered showed 23 on hand . Three days later said to be out of  stock but online still showed 23 on hand.Call and was advised out of stock.I question website . It then showed 46 in stock . Items arrived one week later."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "new customer",
          "Nb_Reviews": 3,
          "Date": "2019-10-08T18:03:00.000Z",
          "Titre": "as with many places it depends on the personnel",
          "Contenu": "as with many places, it depends on the help person: one seemed to be irked/bothered by my questions, another went out of his way to help make sure I got the right equipment/parts. So: a 5-star and a 1-star."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ildeberto",
          "Nb_Reviews": 1,
          "Date": "2017-08-30T12:19:20.000Z",
          "Titre": "I had bought 6 leds",
          "Contenu": "I had bought 6 leds, the aqua color, thinking it would be a bit more blue. They were looking pretty green and half of them were super dim and the other half were super bright. Perfect size just problems between all 6"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 2,
          "Date": "2020-12-02T22:20:24.000Z",
          "Titre": "Bought 2 LED star chips and there a…",
          "Contenu": "Bought 2 LED star chips and there a working so far. Was disappointed that with all the information I provided I still had to guest which LED was the right one to purchase. Was very confusing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer bob",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T16:21:33.000Z",
          "Titre": "Just good enough to get by.",
          "Contenu": "The good: Nice selection. Easy to use website. Fast shipping.The bad: The specialty connectors for LED strips were poorly designed and unreliable. The pricing is ridiculously high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WI gal",
          "Nb_Reviews": 1,
          "Date": "2020-06-04T19:15:15.000Z",
          "Titre": "The LED lights flickering",
          "Contenu": "The LED lights arrived quickly but not great quality. One of the remotes shorted out after second use and one of the light strips flickering randomly.Probably won't purchase from them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 3,
          "Date": "2015-04-24T01:46:15.000Z",
          "Titre": "Not happy with how a problem was handled!",
          "Contenu": "I had ordered two 12vdc dimmer switches. Installed one did not work properly. Triple checked wiring making sure all was correct. Called about the problem. Talked about wiring being correct, power supply , etc.  I was told \"might be defective switch\". I installed second switch, same result. Installed another switch from different supplier, worked perfect. I will note the wiring, power supply all the same. \r I will say all other products have been fine. My upset was with the reps. comment. \"Send it back and we will send another one, We cannot just send you out one\"  I explained I am contractor and needed it badly to complete the job. Will not be my first choice next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "caley",
          "Nb_Reviews": 2,
          "Date": "2018-02-23T15:56:13.000Z",
          "Titre": "Order was ok",
          "Contenu": "Order was ok, lowered rating bc they emailed me stuff I didn't sign up for.Edit. Was mistaken about shipping, that was another order. Improved score by one. Email sent was a request for this survey."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-21T13:47:08.000Z",
          "Titre": "its a small thing",
          "Contenu": "its a small thing, but I ordered two battery boxes, and the small sealing screw for one of them was not provided. The missing screw was sent to me immediately after I notified the company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2017-05-07T09:45:25.000Z",
          "Titre": "The LED strip was fine but I would need more light.",
          "Contenu": "The LED strip was fine but I would have liked to known that I needed a power supply also.  I also wish I knew how much light they put out, I needed more under the cabinet lighting for food preparation."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ron",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T17:49:59.000Z",
          "Titre": "i have never installed LED strip…",
          "Contenu": "i have never installed LED strip lighting before, I called and your representative said draw up a plan in what I want and they will figure out what I need, sounds great at the surface. what I got was an email with a bunch of part numbers, seven different ones. not how many I need of each or how to assembly them. I now have a pile of parts and no idea of they go together. you have some videos but not ones that would help me. I'm a very hands-on guy and still struggling. a simple flat pattern drawing of it assembled would have been great.I had given them two stars originally but updated it to four due to the customer experience that when I called them for help. Jason was very helpful walking me through the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim H Colorado",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T19:44:59.000Z",
          "Titre": "Good, but can improve areas",
          "Contenu": "Light strips work great for what I need, but not updating inventory on the website caused a 3-4 day delay. A better description of current rating of the switches would have also been nice, as I wouldn't have bought them, now knowing they get too hot powering a full reel, let alone 2. Ended up using a household light switch in the end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:28:00.000Z",
          "Titre": "Time it took for stock to be available",
          "Contenu": "Would have given 5 stars if not for being too low on stock to send my order right away. However, now that I have the products and they are installed they work brilliantly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T02:03:48.000Z",
          "Titre": "9 feet too much!",
          "Contenu": "I ended up buying 9 feet too much tape light ($39), I think because of confusing the online explanations of converting meters to feet. Also why are the tracks 39\", but the light strips are to be cut every 36\"? All very confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BrendaAW",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:27:20.000Z",
          "Titre": "Great source for LED projects",
          "Contenu": "Great resources to help DIYers. Prompt service and shipping. Affordable prices. Beetle clip used to connect LED strip to wire did not work, could not pierce wire insulation to make electrical connection. Soldering is more reliable and durable. Also, the lens on the angled aluminum track for 12V LED strip would not slide into the grooves on the track. I tried soap and oil to lubricate to no avail. Had to cut lens into pieces to slide them in. Had no issue with the flat track lens. My finished project looks great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E Wayne",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T02:29:43.000Z",
          "Titre": "Good kit...just missing a couple of tweeks.",
          "Contenu": "The replacement kit for my outside light included all the parts and directions I needed, with the exception of additional wire nuts for an additional connection.  The additional connection was required due to the too short wire lengths from the driver to the main power source/dusk-dawn device.  The driver to LED attachment plugs worked well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T14:59:50.000Z",
          "Titre": "Helpful stuff stands behind their products",
          "Contenu": "Reasonable time to receive the parts and quick response after the question asked over the email when I found out the led driver didn’t work. Later I learned that it needed a little more output amp with constant current. These are new knowledge to me and I appreciate your input. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher DeFronzo",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T00:40:48.000Z",
          "Titre": "Good product",
          "Contenu": "Good product, but lacked paper instructions and online weren't the best."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Z",
          "Nb_Reviews": 5,
          "Date": "2023-10-23T17:57:48.000Z",
          "Titre": "Good Enough -- not great",
          "Contenu": "Prices very competitive. Easy to install wafer lighting.  Quickly delivered.  I like the new \"multi-color\" options on LED wafer lamps.  Install time choice of 3000K, 4000K, or 5000K allowed us to choose the best lighting option for our space.  That said, shipping pricing a little wonky -- free* for small orders, not free for larger orders.  Seems backwards.  I resisted the urge to break my order of 8 lamps up into 4 orders of two lamps each.Also, one of the lamps was flaky after install (flickering).  I had ordered an extra one, and just swapped it in.   This was less expensive (in my time) than trying to get a refund (which is probably available)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T15:45:04.000Z",
          "Titre": "Motion sensor don’t work as advertised…",
          "Contenu": "Motion sensor don’t work as advertised and 1/2 of them don’t work at all. Scott at customer service reached out and made things right. It great to see this company still has core values and treats the customer with respect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cornicello",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T15:56:07.000Z",
          "Titre": "Quite good",
          "Contenu": "Quite good, easy to follow instructions found online.  None in the packaging.The wire supplied with the kit was okay, but had a stiff plasticky sheath.  It was a little difficult to work with.  I had to order a roll through Amazon, and the covering was rubbery, a LOT easier to properly connect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph L. Stehura",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T19:30:36.000Z",
          "Titre": "Sun Distributor strobe",
          "Contenu": "Bought these parts to modify my 1955 Sun Distributor Strobe for modern electronic ignition systems, and, forgreater accuracy on vintage ignition systems.Many thanks JLS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T11:58:22.000Z",
          "Titre": "A late response to an issue -- But a helpful response",
          "Contenu": "I bought a TL-BT2-010 0-10V dimmer smart switch from LED Supply because it advertised compatibility with Alexa.  I could not get it to work with Alexa and requested help from LED Supply.  They initially stated that they could not help me.   They also have a return policy of \"Unused and in resellable condition\", so I could not return it.   I posted a review that described this scenario and was later contacted by LED Supply informing me that there was a solution to buy an additional BlueTooth hub.   This did solved my issue and the switch now integrates with Alexa.   LED Supply should change their product description to let buyers know that the hub is necessary AND be more consistent in their customer responses.   They did show me that they cared by reading and replying to a less than stellar review.   I would use them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T18:11:14.000Z",
          "Titre": "Product worked exactly as advertised",
          "Contenu": "Product worked exactly as advertised. I'm using it an a RFI sensative environment and these lights are RF quiet. I was a bit surprised how hot the strip gets running at 13.8V but was assured they are safe to operate at that voltage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Galen",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T18:47:19.000Z",
          "Titre": "Good choice of products.",
          "Contenu": "Good choice of products.After watching video about cutting and soldering strips I was very disappointed with how difficult it was to remove plastic before I could soldering to. Video or description did not have any warning about how difficult that is to remove plastic without damaging product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alemeister",
          "Nb_Reviews": 2,
          "Date": "2022-12-13T18:40:15.000Z",
          "Titre": "Altair Light LED Repair Kit",
          "Contenu": "What was ordered was not a true match for replacing the original but was close enough that with a little experimenting it accomplished the intended goal. The exterior light now works again and shines bright into the night."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy Sciannella",
          "Nb_Reviews": 3,
          "Date": "2023-11-14T21:51:56.000Z",
          "Titre": "They have my name on file and did not…",
          "Contenu": "They have my name on file and did not have to go through all the information,over all the time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Freewheel Bloomington",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T22:20:04.000Z",
          "Titre": "It would have been 5 stars",
          "Contenu": "It would have been 5 stars. I appreciated the fact that on the second order someone responded that the jumper wires were not compatible and they substituted the correct ones. That did not happen on my initial order and although inexpensive, still a waste of time and money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Murphy",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T15:29:34.000Z",
          "Titre": "Worth keeping the Light Fixtures",
          "Contenu": "For someone with lots of electrical experience this is a very easy task, for others with no practical experience it might be a little frustrating but definitely doable,."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HTXDAD",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T16:22:46.000Z",
          "Titre": "Good communication",
          "Contenu": "I had several questions during the process of placing my order, and I received answers to most of them. Ordering the right LED can be tricky, and I actually ordered the wrong thing at first, but they quickly canceled my order for me when I let them know."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott W.",
          "Nb_Reviews": 4,
          "Date": "2023-03-09T19:04:05.000Z",
          "Titre": "Very good place to buy LED lights and supplies from",
          "Contenu": "The led lights were a very good quality and very bright. This was the standard led strip w/adhesive backing. The battery case that it came with was not up to the quality of the led lights, however. I fully expect that it will need to be replaced on the not to distant future. The customer service was outstanding, very helpful, on all accounts. Overall, a very good place to buy led products from. I would definitely buy from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T21:45:42.000Z",
          "Titre": "Fast and accurate once ordered",
          "Contenu": "My order arrived quickly, and with everything I ordered.  Sometimes I find it difficult to know if I'm ordering the correct/compatible items (e.g. voltage, plug-diameter, etc.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T18:38:02.000Z",
          "Titre": "I found everything I needed",
          "Contenu": "I found everything I needed.  I did receive a wrong shape of track, I contacted Scott via email and a picture of the track I received and Scott had the Angle track on its way, that day.  Great customer service, and supply."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T16:01:20.000Z",
          "Titre": "Good experience with LEDSupply",
          "Contenu": "The information on the website is fantastic.  Very helpful for finding what I needed.Only downside for me was shipping cost.  I thought $20 for shipping was a little on the espensive side."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russell QUIMBY",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T17:57:31.000Z",
          "Titre": "On-line Explanations Help",
          "Contenu": "The on-line videos and explanations of the LED strip lighting system was very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T22:15:10.000Z",
          "Titre": "Good choice of products",
          "Contenu": "Good choice of products, but on some kits the prices are a bit higher than big box stores. Although I don't know if there is a difference in quality except that their LEDs work well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis L.",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T20:01:59.000Z",
          "Titre": "Almost everything I needed was in the…",
          "Contenu": "Almost everything I needed was in the kitchen.1st time using led strip lighting. Very pleased with results."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T21:50:51.000Z",
          "Titre": "Every Order Has Been a Good Experience",
          "Contenu": "The website is easy to navigate. Shipping is fast and economical. I've only experienced an out-of-stock one time and was able to substitute."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sessions",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:04:08.000Z",
          "Titre": "Easy to order",
          "Contenu": "Easy to order. Fast shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T02:37:34.000Z",
          "Titre": "I ordered two LED kits and only…",
          "Contenu": "I ordered two LED kits and only received one, although the enclosed receipt said two.  I call the support line and they sent the second LED kit in the mail and I received it three days later.  I am really happy with your service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Lee",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T22:16:17.000Z",
          "Titre": "My \"go to\" guys for lighting and electronics",
          "Contenu": "The people I talk to are knowledgeable and willing to help. LED Supply has a wide variety of products to help make my projects workable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 4,
          "Date": "2022-12-13T21:21:08.000Z",
          "Titre": "LEDs work as advertised",
          "Contenu": "LEDs work as advertised and were a fair price.  They took too long to arrive due to the US postal service.  You might consider UPS or FedEx as a better carrier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T05:45:40.000Z",
          "Titre": "Worked",
          "Contenu": "Worked!  They had what I needed to hook up a string of LEDs and turn them on with little fuss.  No dead pixels."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T02:13:09.000Z",
          "Titre": "Your website needs to be better at…",
          "Contenu": "Your website needs to be better at finding what you want to buy other than that every thing is good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Budding Prepper",
          "Nb_Reviews": 2,
          "Date": "2023-09-13T22:58:00.000Z",
          "Titre": "I liked the detailed notes for the…",
          "Contenu": "I liked the detailed notes for the different products.  They made it easier to narrow down the product I needed."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Miguel Molina",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T03:35:49.000Z",
          "Titre": "Delivery was a bit expensive",
          "Contenu": "Well delivery was a bit expensive, items are what I needed and support seems to be there if needed."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T21:02:24.000Z",
          "Titre": "Good company and good support",
          "Contenu": "Good company and good support.  I wish the plug and play led strip lights came in bright color option.  Warm is too yellow and cool is too blue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T17:40:58.000Z",
          "Titre": "Overall good experience",
          "Contenu": "Overall good experience. Would have desired more technical/layout help during support calls into LED Supply, but I understand this is difficult to do without seeing the space."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MikeC",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T22:39:49.000Z",
          "Titre": "LED flexible strips",
          "Contenu": "The lights worked great. The only negative was that the glue strip came off with the paper backing. I used an emblem adhesive to hold it up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2022-12-20T18:23:10.000Z",
          "Titre": "Fast,Free and correct",
          "Contenu": "Fast,Free and correct. The rest is because rating requires 25 characters and I can not be succinct..."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rick",
          "Nb_Reviews": 3,
          "Date": "2023-01-27T22:45:28.000Z",
          "Titre": "Helpful staff",
          "Contenu": "Helpful staff. Prompt service. Wide range of products.The only issue I have is that the shipping costs are very high to Canada. On top of the shipping, carrier fees are over and above the shipping."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Terry",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T23:03:52.000Z",
          "Titre": "Support from Scott was great",
          "Contenu": "Support from Scott was great. Perhaps better written explanation enclosed with the kit would have saved my time and his"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Giglio",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T18:04:55.000Z",
          "Titre": "Quality product"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "G Davies",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T14:33:03.000Z",
          "Titre": "Order went good but when I try and get…",
          "Contenu": "Order went good. I am now preparing to order a driver for this LED. Thanks to Scott for advising me on a driver."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin J",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T23:47:22.000Z",
          "Titre": "Was able to order and receive a product…",
          "Contenu": "Was able to order and receive a product to complete a lighting project."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Q",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T18:26:17.000Z",
          "Titre": "Good Service",
          "Contenu": "One of the items I wanted (a driver) was out of stock, but I was able to get a different one, and the order was shipped quickly and arrived in perfect condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony F",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T11:51:53.000Z",
          "Titre": "Recived part that did not work but received credit",
          "Contenu": "Ordered a part for an Altair light from Costco based on the information their website. There is an outdated info graphic that shows a part they no longer carry. I didn't catch this when ordering and the wiring instructions for the part I ordered didn't match up with the light I had. Emailed and asked for a return shipping label or refund and after initially denying my request I did receive a full refund. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harry",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T14:49:19.000Z",
          "Titre": "good people",
          "Contenu": "Customer service led me to the right product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T23:03:21.000Z",
          "Titre": "And there was light.                           Had issue with one item in order",
          "Contenu": "Had issue with one item in orderIt was resolved immediately and professionally and most importantly satisfactorily"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T19:28:19.000Z",
          "Titre": "Got what I ordered promptly but haven’t…",
          "Contenu": "Got what I ordered promptly but haven’t use yet. Might have to do a return since i may have mistakenly ordered an incompatible part for what I plan to fix"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wm",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T02:42:04.000Z",
          "Titre": "Th goto site for lighting solutions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T02:19:47.000Z",
          "Titre": "The person I talked to and ordered from…",
          "Contenu": "The person I talked to and ordered from was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:28:02.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "STEPHEN J. COYLE",
          "Nb_Reviews": 3,
          "Date": "2022-09-24T20:22:26.000Z",
          "Titre": "Pros and Cons",
          "Contenu": "PositiveCalled and asked for recommendation for a project - got a very helpful and knowledgeable response and I placed my order.  Items arrived in a timely fashion.Negative EZ Click-Tight LED Strip Connectors break easily or were faulty recommend you order lots of extras!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kurt",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T17:01:30.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Went into a home project with very little LED lighting knowledge. Found LEDSupply while reading up on things. After I thought I knew what I needed I emailed their Sales dept with a couple questions and was quickly answered. Made my order which was delivered very quickly. Everything installed and worked on the first try. Will do business with LEDSupply again and recommend to my friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Earl Kim",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T03:32:39.000Z",
          "Titre": "Online ordering was easy and arrived…",
          "Contenu": "Online ordering was easy and arrived quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Cook",
          "Nb_Reviews": 1,
          "Date": "2022-07-11T20:20:59.000Z",
          "Titre": "On checking out I wish when I called…",
          "Contenu": "On checking out I wish when I called and built a package with the customer service agent (who was great) I wish he could just forward the shopping cart to my email so I can just check out. What happens is my customers sometimes are the ones by the material and it’s a big pain in the butt if I just don’t go buy it but if I can forward them the email so all I have to do is pay that makes it way easier. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John E",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T00:44:15.000Z",
          "Titre": "Soldered leads",
          "Contenu": "Love the LED products but have issues with wire leads.  I purchased the Cree CXB 1310 with leads. One day after installing  the LEDin the fixture the soldered lead popped off the LED pad. I purchased it with leads because the previous one I purchased I soldered the leads on and the same thing happened.  I re-soldered it on, so far so good. So the soldered leads have popped off the LED pad more than once in the pas. Typically it happens when it gets really cold and really hot."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T02:55:23.000Z",
          "Titre": "Good Lighting",
          "Contenu": "Everything arrived well - packaged.  Only complaint was no wiring diagram included in the packaging.  Found after scrolling through retro kit website page.  Would rather have the information needed to complete the re-wire and not a coupon for 5% off next purchase accompanying a sale flyer.  Hardware is doing great so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T15:47:10.000Z",
          "Titre": "Replacement for Costco lights",
          "Contenu": "Purchased a replacement LED driver for my house lights that came from Costco.  Driver did not fix the issue, so went back and purchased the entire LED replacement kit.  Much better solution all around.Would have given 5 stars if the website would have been more clear to suggest going with the replacement instead of just a driver.  Wish I could return the drivers I purchased, but it costs too much to ship them back!  Most companies would offer free returns in this case."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Bull",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T22:18:43.000Z",
          "Titre": "I have a Costco carriage light where…",
          "Contenu": "I have a Costco carriage light where the driver crapped out. LEDSupply has a nice flow chart to help you select the correct driver. The only issue I have is that the exact driver, which has 6-wires and uses a photocell input, is not available. The one they sent me has 4-wires. I ultimately called and a customer service person told me I had to change the photocell to interrupt the AC voltage. They have the photocells as well and I bought one. Since shipping was included in the price, I only lost some time. But it would have been nice to know before I tried to install the new driver."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Kamieniecki",
          "Nb_Reviews": 2,
          "Date": "2022-12-30T22:08:09.000Z",
          "Titre": "Good product as described",
          "Contenu": "Good product as described No issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan H",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T21:16:04.000Z",
          "Titre": "Product worked good and received it…",
          "Contenu": "Product worked good and received it fast. Only thing I would say is I thought it was suppose to be a white led and it is yellow instead. Wish it was white led but it still works good. Over all happen with the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Charbonneau",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T15:59:52.000Z",
          "Titre": "Reliable ordering",
          "Contenu": "I placed an online order for  LED drivers to fix some porch light problems. Online ordering was simple , and offered multiple shipping options. Regular orders are shipped USPS at no additional cost which was fine.They also offer discount codes that can be found online. I would offer a 5 star rating if they provided shipping confirmation, but overall very happy with the service and the products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Paolini",
          "Nb_Reviews": 2,
          "Date": "2022-03-22T12:14:41.000Z",
          "Titre": "Their support is responsive and…",
          "Contenu": "Their support is responsive and helpful.  Wish they had a wall 4 color controller for their RF controller like others.  Their high end string lights claim a 2700 deg kelvin temp, but other lights I have, have a much warmer light.  Their 2700 deg kelvin string looks like 4000 deg plus.  This is the Hue string."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mason Parker",
          "Nb_Reviews": 1,
          "Date": "2022-01-29T23:07:17.000Z",
          "Titre": "LED at light speed",
          "Contenu": "They shipped the same day and the return/refund was simple and fast, without any \"restocking fee\" nonsense like some other places. Their website needs more thorough pictures of some of their products. I ordered some LED rope lights and one reason I had to return them was because the photo showed them with the lights connected to the wire with a plug that was easy to unplug, and what I got were ones with connectors sealed in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Hearn",
          "Nb_Reviews": 2,
          "Date": "2022-01-28T22:02:14.000Z",
          "Titre": "I purchased a LED Driver (APC-16-350 to…",
          "Contenu": "I purchased a LED Driver (APC-16-350 to replace the faulty one in an Altair Wall Lantern bought at Costco   The installation was successful and the lantern comes on when it gets dark and no longer flickers.  It did require buying a special zip tie and metric machine screw, but the video on your website guided me through all the steps,  Hopefully the next replacement ( I have 2 other Altair Lanterns) will be quicker.  Thanks for the great product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Keenan",
          "Nb_Reviews": 3,
          "Date": "2021-12-30T19:33:22.000Z",
          "Titre": "Go-To for all things LED",
          "Contenu": "Excellent products, great customer service, hands down best resource for technical info and all things LED.Only complaint I have is the online claimed inventory is frequently off and you are not contacted to let you know your entire order will be delayed until the out of stock item is available. This could be weeks.Contact customer service though and they take care of the issue immediately.Fast shipping. Love this company!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-24T15:34:12.000Z",
          "Titre": "Doesn't support complete OFF level",
          "Contenu": "I was hoping to replace a single switch controlling 4 LED panels with this dimmer to get two panels at different levels.  Unfortunately, unlike some other 0-10V dimmers I have used for other projects, it does not support a full OFF level from the dimmer, and I didn't have enough room in the box to have both a switch AND this dimmer.  As a result, I had to go a different route instead.  Having said that, the unit does work as a dimmer, as advertised, and I need to see if I can use it somewhere else or not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T19:59:35.000Z",
          "Titre": "Good service, bad connectors!",
          "Contenu": "The phone service and most of the products were of high quality. The reason you are getting only 4 starts is because your solderless connectors are junk They wouldn't stay on the wire or LED strip or both. I had to take them apart to fix them which still did not work. I had to throw them out and solder all of my connections. Hopefully you find a better supplier.A refund of those connectors would be nice.Rick,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer GH",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T22:03:33.000Z",
          "Titre": "LEDSupply had been very responsive to…",
          "Contenu": "LEDSupply had been very responsive to my order to replace a faulty LED strip.  I was in immediate need of a replacement, so purchased outright again without any credit for the faulty one....but they responded sooner than I thought, and assured me that in the future any purchases would have a credit for this situation.  I will definitely go back to them in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-11-16T03:38:35.000Z",
          "Titre": "Amazing selection of supply options",
          "Contenu": "Amazing selection of supply options, but probably a little slanted towards the professional rather than hobbyist.  You can work your way through the catalogue, and get all you need, but an email or phone call might be a good idea.  VERY responsive to questions, quick turn around.  Took me three orders, but got my complex set up done (10 bookshelves with 2 power units, all controlled with one remote).  They were willing to ship me a $0.98 part in last order!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T04:26:55.000Z",
          "Titre": "The lights I purchase were to yellow",
          "Contenu": "The lights I purchase were more yellow then the 3000k they state. I would rate them at 2500-2700k. We are having to purchase all new lighting because they are so yellow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T22:02:46.000Z",
          "Titre": "Product was as advertised and makes a…",
          "Contenu": "Product was as advertised and makes a great replacement for our old recessed fluorescent lighting.  A bit of design feedback:  The corner connectors are simply too tight.  It takes real strength, accuracy and some patience to insert the light strip leads correctly into the connector receptacles.  It might be better to have looser connectors that can be heat shrunk into place with something like a hair dryer once a solid electrical connection is verified."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Miramontes",
          "Nb_Reviews": 2,
          "Date": "2021-10-12T20:02:11.000Z",
          "Titre": "Great for tight installation area but take caution with the lead wires.",
          "Contenu": "The LED units I purchased were perfect for installation in a ceiling where you have beams above the wallboard.  The depth of the light units fit perfectly within the wallboard thickness and made the beams irrelevant.  My only issue was the leads provided by the company were too short and kept coming out of the connectors.  I had to lengthen the wire lead and reinsert them into the connector.  There was plenty of room in the connector boxes for two Romex cables."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M Hart",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T17:12:12.000Z",
          "Titre": "Pre-order help was great",
          "Contenu": "Informational replies came quickly and very helpful for placing an order. Without that advice, ordering would have been more difficult. My only issue was a hold on the entire order for something that was out of stock. No one at LED supply communicated about the hold. I had to check order status a few days later to learn about it. Thankfully, my client was understanding of my delay to install."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TMPalmer",
          "Nb_Reviews": 3,
          "Date": "2022-04-26T02:28:04.107Z",
          "Titre": "Everything needed to repair my outside…",
          "Contenu": "Everything needed to repair my outside lights was included in the refurbishing kit, made the process easy and straight forward. My only concern was the led lights have a slight yellow tent. Pricing was good and delivery was excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Louis",
          "Nb_Reviews": 5,
          "Date": "2021-06-16T16:57:28.000Z",
          "Titre": "LED is very helpful and has a wide…",
          "Contenu": "LED is very helpful and has a wide variety of products.  I recently ordered some parts for mt LED light strip and they came in 2 days at no charge ship.My only somewhat negative comment is I tried numerous times calling for a tech support question, but their line only goes to voice message.  I'm guessing that may be a product of COVID.Otherwise easy company to do business with and a good variety of products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-04-23T13:32:10.000Z",
          "Titre": "Customer service was very knowledgeable…",
          "Contenu": "Customer service was very knowledgeable of the products and my order status. My product was delayed several weeks due to manufacturing delays but when I called LEdSupply was quick to find the answer for me. The customer service representative speaks English and the business is located in the USA, giving greater confidence of the quality in design and their ability to stand behind the product."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "FredH",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T19:49:35.000Z",
          "Titre": "Best supplier for these products",
          "Contenu": "The product listings and descriptions are well presented on website.All information available made me confident in my purchase with no need to call for help.Package arrived earlier than expected and at a better price than popular jungle e-commerce site.My project is working as expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A.J.",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T15:20:26.000Z",
          "Titre": "Good product that needs a tweak.",
          "Contenu": "I purchased some of their white led strips. The product is good quality. Shipped very fast and came well packaged. Only issue was the led strip cut points to shrink the length down to a length you need are too far apart. I ended up with extra length I had to awkwardly curl at the end cause it was a few inches too long due to location of the next cut point. But overall happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S. Trent",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T23:32:45.000Z",
          "Titre": "Shipping issues with sale items.",
          "Contenu": "Great products and great service. The only thing keeping my purchase from getting 5 stars is that it appears that sale items do not qualify for free shipping (even when the item's sale page says \"First Class shipping - free\". And adding insult to injury, sale item also do not qualify for the $7.99 2-Day FedEx but are charge $9.99 for 2-Day FedEx shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T22:06:06.000Z",
          "Titre": "We called for advice before we ordered",
          "Contenu": "We called for advice before we ordered, the man was quite patient, he explained all he could to us, sounded like he knew his field.  Seems the product we received was quality, our electrician didn’t say anything to the contrary.  It looks great installed, and will provide plenty of light in a workspace."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Murphy",
          "Nb_Reviews": 4,
          "Date": "2023-05-16T22:41:26.000Z",
          "Titre": "Everything worked out fine",
          "Contenu": "Everything worked out fine, could have had wire nuts in the Kit"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mayes Howard",
          "Nb_Reviews": 3,
          "Date": "2021-05-13T15:06:21.000Z",
          "Titre": "Shipping method was USPS First Class",
          "Contenu": "Shipping method was USPS First Class. Took over two weeks to receive order. Order was held at closest shipping facility for eight days before delivering. No helpful support from LEDSupply. Have ordered from LEDSupply again already, but chose a better shipping method. Can't understand why First Class is even an option..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T19:01:47.000Z",
          "Titre": "Good service",
          "Contenu": "All things considered I got good service. It would have been great if the person I was working with had read all the questions I asked before making my order. I did not know that the led strip was coming with a jumper wire attached. There for I ordered two jumpers when I only needed one.  Makes me wonder why I drew a diagram of what I thought was needed and even sent pictures of the cabinets where the lights were going to be installed. Anyway no harm done. Will I use your products and services again? Probably, unless I find another provider that likes to follow up with the customer to ensure what I think I need and what they think I need is the same."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DM",
          "Nb_Reviews": 1,
          "Date": "2021-08-08T18:01:38.000Z",
          "Titre": "Love the AC 5050 light strip, hate the mounting track",
          "Contenu": "Love the AC 5050 light strip.  Very nice quality.  Don’t like the plastic mounting track.  Tolerance is way too tight.  Going to take me 15 minutes to mount and then 3 hours to try and get the strip into the track.  But no other choice as the light strip is being mounted under an outside deck."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Duarte",
          "Nb_Reviews": 3,
          "Date": "2021-02-16T01:12:39.000Z",
          "Titre": "I bought this product because my other…",
          "Contenu": "I bought this product because my other LED power supply one of them only lasted like four months and they send me another one and that one lasted about a year so I don't like replacing power supplies every year just got this one about a month ago and we'll see how good it is. We use this type at work and they seem to do the job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Venier",
          "Nb_Reviews": 3,
          "Date": "2021-07-31T03:37:51.000Z",
          "Titre": "Not enough details in the product…",
          "Contenu": "Not enough details in the product description. Did not call out the overall length of the LED strip. Also, it indicated it used 3 AA batteries but the unit I received required 6 AAs. Battery pack was double the size and weight of what I needed.Does anyone actually read these survey responses?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Creo",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T14:47:15.000Z",
          "Titre": "LED strip light good, mounting channel not so good.",
          "Contenu": "The LED light strip worked well for my project.  I had the 36\" strip which could be cut in half.  If it could be cut in shorter increments that may be useful with other projects.I also had the clear plastic mounting channel to hold the strip ridged.  The strip was a very tight fit, and spreading the channel open to get it in caused the clear plastic to turn white in places, signs of stress.  I was really concerned about breaking the channel, but that didn't happen."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joel J",
          "Nb_Reviews": 1,
          "Date": "2021-01-12T21:27:39.000Z",
          "Titre": "Overall pleased with the support and…",
          "Contenu": "Overall pleased with the support and products received.  One unfortunate issue was that the plastic connectors for a 2-wire single color applications were of a poor quality.  I had difficulty seating the LED strip to them and getting the prongs to properly puncture - also getting the 2 wires properly positioned into the wire side with 4 slots for a 2-wire application.  Due to number of times needed to open and close the cover to get the contacts to work the covers on many of the connectors simply broke off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gerald Merry",
          "Nb_Reviews": 2,
          "Date": "2022-03-03T00:49:40.000Z",
          "Titre": "Great Product, Needs an Installation Sheet",
          "Contenu": "Thank you for allowing me to rate LEDSupply ... Much Appreciated!  I have installed two of the kits so far, and both of them work wonderfully - Thank You!  I would have rated you with 5 stars, but I feel more installation instruction should have been provided.  In that light, I have generated a short instruction sheet and drawing you might want to include with each of your kits.  Send me a quick email and I'll send it to you ... check it out and tell me what you think.  The GOOP I mentioned is a Clear Sealant available at most hardware stores, and it basically waterproofs the connections.  Thanks Again for offering such a fine product!Gerald MerryUSNavy-Retired"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-31T01:29:53.000Z",
          "Titre": "Great products and service",
          "Contenu": "I've experienced great service and products from LEDSupply. I would have given 5 stars but the LED strips I ordered for a recent project had a different connection between the power supply connector and LED strip than before. It wasn't a big problem but required me to redesign the lamp I had built."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Craig, Vancouver BC",
          "Nb_Reviews": 4,
          "Date": "2021-12-04T01:26:20.000Z",
          "Titre": "Because supply chain issues limited…",
          "Contenu": "Because supply chain issues limited local availability, it was great to be able to order from the wide selection at LEDsupply.  Everything was shipped promptly, and worked as advertised.  The only problems were from my own rookie mistakes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liam Donaher",
          "Nb_Reviews": 3,
          "Date": "2021-06-17T03:03:42.000Z",
          "Titre": "out of stock but still charged. otherwise, great experience.",
          "Contenu": "I ordered a part, but didn't realize they didn't have it in stock, but they never gave me a warning, and charged me anyway without giving an estimated time when it would be back in stock. Previously had good experience with them though. great quality and price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T00:32:04.000Z",
          "Titre": "N/A N/A",
          "Contenu": "Good cyst. Service"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "BG",
          "Nb_Reviews": 2,
          "Date": "2021-04-01T14:29:24.000Z",
          "Titre": "LED component",
          "Contenu": "The products received where of good quality and appearance.Web site gave additional accessories required for each main component to be used. Being new to this type of installation and not knowing all the required components for a good installation I found this very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 3,
          "Date": "2021-10-24T01:25:00.000Z",
          "Titre": "I installed the power supply how ever…",
          "Contenu": "I installed the power supply how ever it still flashes. I could have hooked it up backwards is that possible, I have another one but I hesitate to use it for fear of doing the same thing. I need better wiring instructions I guess .Can you help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T16:32:32.000Z",
          "Titre": "Almost Excellent",
          "Contenu": "Website is very helpful with lots of good information to assist designing your LED project.  Customer service has been very prompt responding to questions.  I would have rated Excellent except the aluminum track I need is out-of-stock.  Still waiting to get it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Dodson",
          "Nb_Reviews": 9,
          "Date": "2021-02-26T18:54:22.000Z",
          "Titre": "Good selection of LED materials and…",
          "Contenu": "Good selection of LED materials and support. Would give 5 stars but for the fact that they didn't have all the items I ordered and held up the rest of the shipment until I called to find the reason. Initially, they notified me on another item they quit stocking, but this second one was on backorder and they didn't let me know directly. Once I canceled that item, they shipped immediately.All items were received, well packed and excellent quality. Some items you can't find elsewhere and fair prices on their goods. Will shop with LEDSupply again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:09:58.000Z",
          "Titre": "My original order with LED…",
          "Contenu": "My original order lapsed and LED contacted me by email and walked me through the reorder process. When the items arrived, the instructions guided me through the replacement process successfully and my light is restored again. Very Pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROBBY",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:02:33.000Z",
          "Titre": "Personal service, fair price",
          "Contenu": "I truly appreciate being able to talk to a person, ask questions and get advice. Service was fast and hassle free. This was my second order and will be my first stop for my next order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:25:16.000Z",
          "Titre": "Helpful source:Printed information provided ahead of…",
          "Contenu": "Printed information provided ahead of order gave much needed information to complete my project. Items ordered arrived quickly and as ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:02:39.000Z",
          "Titre": "They had everything thing I needed in a…",
          "Contenu": "They had everything thing I needed in a simple referb kit. Straight forward and easy to use instructions. Everything works beautifully, better than expected. The bonus in the kit was the photo cell, now my lights are not on 24/7."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "regular customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:58:05.000Z",
          "Titre": "LEDSupply Really Shines",
          "Contenu": "LEDSupply has always been very responsive and gone the extra mile for me.  I've had several interactions with them, all positive.  I've made specialized requests, canceled items, asked questions, and they've always come through.  Combined with the fact they sell lots of cool stuff, this keeps me coming back.  I'm confident if I have any problems, LEDSupply will get them sorted out.  They are my only source for many items."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:55:25.000Z",
          "Titre": "The strip light kit was just what we…",
          "Contenu": "The strip light kit was just what we needed with all the correct parts and they all worked.  We bought another brand from big box store and the connectors didn’t work.  This one is very nice and makes a perfect under cabinet lighting in our remodeled kitchen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T15:09:00.000Z",
          "Titre": "Outstanding quality",
          "Contenu": "Outstanding product! I bought the 6” wafer lights and installed them in my living room. Not only are they very bright, at the lowest dimming setting they still look uniform, whereas the other product we have from another vendor does not."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:44:19.000Z",
          "Titre": "World Class Organization",
          "Contenu": "World class organization and customer service. Scott was amazing in assisting me with finding the correct part for what I needed. He even sent an email to mew with a link directly to it. Professional service with a personal touch. Highly recommended. You will not be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rex",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:13:05.000Z",
          "Titre": "Good product selection along with great…",
          "Contenu": "Good product selection along with great informational pages to help you make the best design."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:16:16.000Z",
          "Titre": "Easy instructions to replace my led…",
          "Contenu": "Easy instructions to replace my led which existed no where else. Shipped to a remote location in Canada in a short period of time. Door to door. FedEx guy driving down a long gravel road covered in snow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott J.",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T20:09:16.000Z",
          "Titre": "LEDSupply took the time to listen to my concerns",
          "Contenu": "LEDSupply took the time to listen to my concerns and provide suggestions to narrow into the problem I was experiencing.  I appreciate the expertise the tech support team has and is ready to share.  Replacing the component with improved versions keeps old lamp fixtures in use with improved lighting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MIchael Thatcher",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T02:16:34.000Z",
          "Titre": "Saved Dollars with correct parts",
          "Contenu": "I had some outdoor lantern lights that needed the correct driver because the original one were failing. I was considering replacing the lanterns entirely but found help on my exact light on the LED supply sight. Getting the right driver and LED combination made all the difference saved me $100s in replacement costs.Ordering was easy and the shipment arrive quickly.Thanks LED Supply"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "FatherOfFour",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:54:50.000Z",
          "Titre": "LED Supply is awesome",
          "Contenu": "LED Supply is awesome! SUPER fast , free shipping!?!?!!? What else do you need to know? You need to know they have great products at wonderful prices. THAT is all you need to know!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "henry malkin",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T04:08:38.000Z",
          "Titre": "quality products and a quality staff to…a pleasure to",
          "Contenu": "quality products and a quality staff to assist my transactions. always willing to discuss their products.  Items are delivered promptly.    Great Job ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Kull",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T15:53:22.000Z",
          "Titre": "LEDSupply Delivers",
          "Contenu": "I recently purchased a LED strip light. The lights are exactly what I was expecting - high quality LED lights in a flexible strip that I could cut and connect smaller sections with jumper cables. LEDSupply provided easy instructions on how to modify the strip. The process was easy and the lights performed as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:08:24.000Z",
          "Titre": "The kit for my led light outside worked…",
          "Contenu": "The kit for my led light outside worked better than original. Tech guy was great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "costockton",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T16:10:36.000Z",
          "Titre": "I ordered two power supplies to run…",
          "Contenu": "I ordered two power supplies to run small led screens. Only one came in but I was charged for two. The CS rep did not bat an eye he just sent me another one. Everybody makes mistakes, it is how you handle them that will set you apart."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BG, LLC",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T03:22:28.000Z",
          "Titre": "I'm Impressed!",
          "Contenu": "As a master electrician for over 46 years, finding a good supplier for commercial LED supplies can still be a challenge. Part selection advice for an unusual project was very helpful. Shipping was instant, too. The prices are very competitive. LED Supply also has a very good selection for residential projects.When next I need LED supplies, time won't be wasted searching because I'll go straight to LED Supply Com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "user",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T23:01:34.000Z",
          "Titre": "Good Communication and timely delivery",
          "Contenu": "Good Communication and timely delivery. The part I needed was out of stock. I was informed of delay and substitute part was delivered on time to complete project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T19:13:44.000Z",
          "Titre": "I purchased the 3 meter light bar",
          "Contenu": "I purchased the 3 meter light bar.  It was delivered on time and easy to install"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Lubin",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T20:38:17.000Z",
          "Titre": "They stand behind the products they sell.",
          "Contenu": "I purchased a constant current power supply about 2 years ago.  It failed with a little less than a year left on the warranty.  LEDSupply handled all the return process with the manufacturer, and also recommended a replacement product that may be more robust (which I purchased from them).Special thanks to Jason Larocque."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Swan",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T14:46:56.000Z",
          "Titre": "Outside Lights Repair",
          "Contenu": "The person I initially spoke with on the phone was very helpful in determining what I needed to fix my problem with our outside lights. The parts arrived when promised, packaged properly so they wouldn't get damaged during shipping and the instructions were easy to follow. I repaired our outside \"dusk til dawn\" sensor lights and they work beautifully!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T00:24:06.000Z",
          "Titre": "Under promised and over delivered",
          "Contenu": "I got exactly what I needed to replace the LED in my outdoor light with photo sensor. Bonus was that it cost less than I expected and I received it in less time than what I was supposed to due to being on back order. Also it was super simple to install!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:47:07.000Z",
          "Titre": "Revised reciew",
          "Contenu": "This is the 5th LED replacement hardware that I ordered.  The process to order is easy and delivery time is okay.  Problem I have is I ordered this for the last light that required replacement and ironically one of the lights I had replace led and driver just failed today after replacing it only months agoRevised reviewAfter submitting my initial review (above) I was surprised to get a response from the this company.  I made an error and my original purchase of 4 LED replacement part kits were from a different supplier.  I would definitely do business with these guys just based on my customer service experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bogey",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T05:43:04.000Z",
          "Titre": "Great product at a great price",
          "Contenu": "Great product at a great price.  I even called your tech support since I wasn't sure how to re-wire the new night sensor with the new LED driver to the old LED Light on my outside light and they walked me through with 100% ease.  Looks like new again.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:45:13.000Z",
          "Titre": "Everything arrived awsome experience on time and as…",
          "Contenu": "Everything arrived on time and as expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve H",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T23:06:09.000Z",
          "Titre": "Great service and good products",
          "Contenu": "Great service and good products. I am a repeat customer, and my first experience was when I had to reorder a lens that I BROKE, LED Supply sent me a replacement free of charge, even though I insisted I should pay for it. That's good customer relations. I will be planning a third installation soon and will be using LED Supply."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Rogues",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T21:23:01.000Z",
          "Titre": "We've used LEDSupply when our Costco…",
          "Contenu": "We've used LEDSupply when our Costco porch light failed. They were easy to buy from online and provided a great service.  Our other light failed recently, same outcome. They describe their products very well to ensure you get what you need.  Kept us updated regarding delivery.  Great experience, thankyou."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RS",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T22:16:49.000Z",
          "Titre": "Green LED strip: good quality, works well",
          "Contenu": "Green LED strip, exactly as described, arrived when predicted. Work well for trying to replicate pain-relief experiments using green wavelength light. Plugged it in and worked as expected, seems like assembly quality is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:46:07.000Z",
          "Titre": "Provided the much need repair parts in…",
          "Contenu": "Provided the much need repair parts in a timely and cost effective way"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Klinedinst",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T19:23:39.000Z",
          "Titre": "Easy way to get started with LED strips",
          "Contenu": "Quick delivery, nice kit, looks great.  Worth every penny"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T00:31:00.000Z",
          "Titre": "EASY",
          "Contenu": "YOU MADE IT EASY FOR ME TO UNDERSTAND WHAT I NEEDED TO REPAIR THE LIGHT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Larson",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T22:14:47.000Z",
          "Titre": "I called to confirm the suitability of a constant current LED driver.",
          "Contenu": "I called to confirm the suitability of a part.  A guy answered immediately and sounded like he was standing right there at the parts counter.  No multiple buttons to push on my phone to get to the right person.  Anyway, he was extremely knowledgeable and answered my question quickly, regarding if I had the right part.  I installed the part when it arrived.  My house light works great again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T06:54:36.000Z",
          "Titre": "Sales rep \"engineered\" my solution",
          "Contenu": "I actually called the sales office to get help with my LED application, a bathroom light that was made of two led strings of 22 LEDs each.  The driver for this light was no longer working, and I needed a replacement, but the driver had been removed from it's case, so all of its specifications were missing.  The sales rep seemed more like an engineer!  I gave him the specs on each 22 LED string, including voltage and amp draw, and he pointed me toward a good fit for the application.  When the driver arrived, I wired it into place and tried it out.  It is working well and I couldn't be more pleased!  Many thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol M",
          "Nb_Reviews": 6,
          "Date": "2023-11-27T20:12:13.000Z",
          "Titre": "I found exactly what I was looking for…",
          "Contenu": "I found exactly what I was looking for on the LEDSupply website. The item was very reasonably priced and arrived at my door in record time. So impressed with this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:47:21.000Z",
          "Titre": "Great quality product",
          "Contenu": "Great quality LED strips.  Fast shipping. Good prices. I have a set of these that have been in use daily for the past year on a night timer (4,000+ hrs). On another project I had some cheap Amazon led light strips that failed under similar usage. Upgraded to the good stuff!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:33:57.000Z",
          "Titre": "Expertise in LED",
          "Contenu": "Expertise in LED;  prompt handling/shipment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Kraning",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T05:20:37.000Z",
          "Titre": "Excellent Company",
          "Contenu": "Prompt delivery. Customer service is great. They answer the phone with someone that speaks English and, get this, they know what they’re doing. I couldn’t rate them high enough. The products are excellent. Thank you for making my project successful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T16:45:49.000Z",
          "Titre": "I have three identical outdoor led…",
          "Contenu": "I have three identical outdoor led light fixtures.  One, by one, they stopped working.  When looking to replace them, I couldn't find anything I liked.  I just happend to come across the LEDSupply website and looking at the reviews, I came across my exact lights and followed the link and ordered three kits.  They arrived within a week.  They were just what I needed, were actually quite easy to install and work flawlessly.  By the way, did I mention I am a 78-year old Grandmother with no electrical experience whatsoever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:14:31.000Z",
          "Titre": "Super company to do business with",
          "Contenu": "Super company to do business with.  Very knowledgeable, quick to retrive information on past orders, courteous, and with customer service in this country!  A guinine preasure to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jade",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:47:12.000Z",
          "Titre": "I received my order promptly and am…",
          "Contenu": "I received my order promptly and am very pleased with the quality of the light strip."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NG",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T21:26:48.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Product Q&A's were quick to answer, their customer support was thorough and also quick to answer, the prices are reasonable, shipping was fast, and I got everything I ordered. Superb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn  Cahoon",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T19:58:59.000Z",
          "Titre": "14 LED lights and dimmer for boat interior",
          "Contenu": "I ordered 14 LED lights to replace the aging ones on my Lagood 380 (catamaran).  They arrived on time and appear to be sturdy.  The rims seem to be sturdy aluminum instead of the thin plastic of the originals.  They fit perfectly and brightened up the boat (at lower power usage).  I also go the dimmer with remote since it was about $10 more.  Wired it in to one of the sets and it works as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:52:39.000Z",
          "Titre": "Great Products & Support",
          "Contenu": "These guys have all the know-how and quality parts to do any LED project. They responded right away when I emailed a question to sales that no one else could help me with. They were super helpful in assisting me with figuring out the right bits to get my under cabinet lighting project over the finish line when the cheapo parts I bought from Amazon didn't work right. Highly recommend buying from LED Supply and skip the other online sellers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T13:27:37.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service.  Exactly what I ordered and received promptly.  Would order again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:17:00.000Z",
          "Titre": "Your review must be at least 10 characters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Nice",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:54:21.000Z",
          "Titre": "I purchased two retro fit kits and they…",
          "Contenu": "I purchased two retro fit kits and they work perfectly.  My Altair lights are like new.  Also, before buying I spoke with a very knowledgeable person who answered all my questions and was extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T04:16:26.000Z",
          "Titre": "The customer service was amazing",
          "Contenu": "The customer service was amazing. I filled out their form to get suggestions on what to use for my project and someone responded the next day. I was able to ask them questions and get answers within the same day. I will definitely be recommending them to anyone that I know is trying to do a project with LEDs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerMark Clipsham",
          "Nb_Reviews": 11,
          "Date": "2023-10-30T22:55:27.000Z",
          "Titre": "LEDs may as well be a quantum drive to me.",
          "Contenu": "LEDs may as well be a quantum drive to me. My ME tried to help me understand this stuff. I wrote the great folks at LED supply instead and asked for recommendation for my need. I received the driver in short order with no shipping charges - looked at the documentation - understood it - hooked it up - on my way to Alpha Century in record time. If only hooking up my multidimensional time travel was this easy. I would ask them about it but don't want to wear out my welcome - they humor me enough already. THANK YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T04:25:11.000Z",
          "Titre": "Great ordering experience",
          "Contenu": "Ease of ordering.  Great descriptions for items I needed.  All questions answered quickly.  Items arrived quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benham Ignacio",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T05:31:13.000Z",
          "Titre": "LEDSupply was awesome to work with!",
          "Contenu": "Received a defective Bluetooth RGB controller to go with the LED strip I ordered. Without asking for a replacement or refund, LEDSupply nevertheless immediately sent me a new one, which works perfectly. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:14:26.000Z",
          "Titre": "Good products that are high quality",
          "Contenu": "Good products that are high quality.  Very good customer service prior to buying."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana N",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T22:54:08.000Z",
          "Titre": "Exactly what I needed",
          "Contenu": "I ordered a kit to fix a light that stopped functioning. The package arrived on time and in sufficient packaging to protect the items. The instructions included were spot on and really helpful. So much better than replacing the entire fixture!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:35:23.000Z",
          "Titre": "High quality products at a great price",
          "Contenu": "High quality products at a great price.  I'm a repeat customer with LEDSupply and will continue to shop with them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:55:31.000Z",
          "Titre": "Fast and FREE shipping!",
          "Contenu": "Fast and FREE shipping! What else can you ask for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob S",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:26:17.000Z",
          "Titre": "Hobbyist",
          "Contenu": "Professional, knowledgeable. Had everything I needed to light up the houses in my Christmas Village."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:25:01.000Z",
          "Titre": "People actually answer the phone and…",
          "Contenu": "People actually answer the phone and are super helpful,   not even voicemail,  this is game changing and they sell very cool things"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:11:03.000Z",
          "Titre": "All items came in a timely manner and…",
          "Contenu": "All items came in a timely manner and worked just as expected! Very pleased with LED supply"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul J., in Michigan",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T16:15:18.000Z",
          "Titre": "Great service",
          "Contenu": "I needed two type of LEDs; green emission and UVC emission and associated power supplies and connectors.  A phone call for clarification about electronic connectors that were needed was quickly answered.  My order arrived in 2 days with everything that I requested.  The LEDs were exactly what I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Murphy",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T23:41:15.000Z",
          "Titre": "These are the people to work with",
          "Contenu": "We ordered the 120 volt outdoor lights for a use indoor. they would have worked except we needed to make a couple of branches off the main line. the fittings and cables were too large to hide, so we had to start from scratch. We called and spoke with Jason in customer service. He walked us through the 12 volt LED setup. We sent him our layout and he verified all the components we should need and how to get there. We did get there and it looks great! When we have another LED project, I know where to go and whom to talk to to make sure we get it right the first time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:10:12.000Z",
          "Titre": "Free (and pretty fast) shipping",
          "Contenu": "Free (and pretty fast) shipping, low cost for the item (battery box/connector). Great first time experience for me with LED supply. I will turn to them again!-Mark"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T20:17:45.000Z",
          "Titre": "Great service and customer support!",
          "Contenu": "Didn't want to wait on an order due to an item back ordered so they were kind enough to send it out as per my request."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BrianM",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T15:18:53.000Z",
          "Titre": "Quality Parts and Support",
          "Contenu": "I ordered the complete LED strip lighting kit and everything was included except the power supply cord was missing.  My email was answered quickly and the cord was here in a couple of days, great support.  Everything is high quality.  Skip the urge to get the cheap Amazon kits and do it right the first time.  The Questions area in the parts description is very helpful and informative!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Lemcke",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T18:03:30.000Z",
          "Titre": "Easy, clear, fast and quality products",
          "Contenu": "Clear information about product options and recommendations for the appropriate application.  The staff provided a fast response to a product question, fast shipping once I completed my order.  All was as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert P.",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T20:00:45.000Z",
          "Titre": "Great product",
          "Contenu": "Great productGreat resultsFast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:06:37.000Z",
          "Titre": "Arrived as promised",
          "Contenu": "Arrived as promised, led driver worked flawlessly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonino",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T02:08:17.000Z",
          "Titre": "Great replacement and upgrade for our…",
          "Contenu": "Great replacement and upgrade for our outdoor fixtures.  I replaced 2 and I will now purchase 3 more to upgrade all of our outdoor lights.  The upgrade was easy and straightforward and the lights look great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T14:21:06.000Z",
          "Titre": "Great selection and FAST delivery!",
          "Contenu": "Great selection and FAST delivery!I ordered LED strips and controller/dimmers.This was one of the few places I could find 'side-shooter' or side-emitting RGB strips."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Davel",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T14:50:09.000Z",
          "Titre": "Awesome",
          "Contenu": "A lot of information on the website and easy access to what is needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Lloyd",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T21:40:33.000Z",
          "Titre": "Outstanding customer service",
          "Contenu": "It's great to have a person on the phone with me. The suggestion for a photo of the project to be sent to you helped me to make a good decision and LED supply to recommend the right items. When I contacted LED to place the order and discuss the materials to make it easier to work both Scott and Bob were exceptionally helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CP",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T17:31:33.000Z",
          "Titre": "Highly recommend",
          "Contenu": "LED Supply is the only place I could find quality light strips that are IP68 and well under 1/2” to fit in the undersized track that was installed in our pool. They shipped them next day and they’re perfect! Great company!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:59:57.000Z",
          "Titre": "Received order in a timely manner",
          "Contenu": "Received order in a timely manner.  Some clips were missing and that was rectified in 2 days.  I like the quality of the murchandise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:04:09.000Z",
          "Titre": "Unique products at low cost",
          "Contenu": "This store provides a lot of unique products that enable the efficient use of led lights. The cost is economical and very affordable to many applications of the led lights"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:26:04.000Z",
          "Titre": "Coustomer service was very informative…",
          "Contenu": "Coustomer service was very informative . I received my  parts when they were expected"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl Pacheco",
          "Nb_Reviews": 3,
          "Date": "2023-10-25T14:02:54.000Z",
          "Titre": "LED Retrofit Kit works great and looks…",
          "Contenu": "LED Retrofit Kit works great and looks great! I got the 5000K led's and it is as bright as I was hoping for!  I really did not want to replace the outdoor lamp if I didn't have to, this is a good alternative solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T00:01:21.000Z",
          "Titre": "Repeat customer",
          "Contenu": "Repeat customer, never had a problem. Everything's as advertised and arrives quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T18:41:47.000Z",
          "Titre": "the service/sales desk help was amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T20:48:11.000Z",
          "Titre": "Easy to return wrong parts",
          "Contenu": "The parts I ordered turned out to be incorrect.  LED sent the parts I requested, but I apparently ordered the wrong parts.  I returned the parts, unused, and they credited my account.  Very honest company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill J.",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T20:58:02.000Z",
          "Titre": "I have recently started using led strip…",
          "Contenu": "I have recently started using led strip lights with success in cabinets that i built. LED supply provided education and the parts to complete the job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:43:25.000Z",
          "Titre": "Easy purchase fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelby Tovar",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T23:23:06.000Z",
          "Titre": "A+++",
          "Contenu": "I messaged LEDSupply about a new led driver, they suggest the whole lot which I did buy. Worked perfect o ended up buying 3 more be replaced all my lights."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Sizemore",
          "Nb_Reviews": 6,
          "Date": "2023-10-05T15:12:16.000Z",
          "Titre": "Great quality and support",
          "Contenu": "Great quality. Staff is very responsive in letting you know exactly what you need for your lighting project. I am a repeat customer for this reason."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DennisB",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:39:03.000Z",
          "Titre": "Informative website for replacement parts",
          "Contenu": "Informative website which allowed me to select the proper LED driver replacement for my application."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mihir",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T23:00:19.000Z",
          "Titre": "great experience",
          "Contenu": "no muss. no fuss. just great prices on the items i needed."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Johnk",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T22:11:09.000Z",
          "Titre": "Great Experience",
          "Contenu": "Ordering from the website is clear and straightforward and LEDSupply has a great selection of products. The items that I ordered arrived very quickly and in great condition. Highly recommend this business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert F Morrissey",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T23:25:19.000Z",
          "Titre": "good products at a great price with…",
          "Contenu": "good products at a great price with fast shipping, Does not get better than this !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:42:51.000Z",
          "Titre": "LED driver was a perfect match for the…",
          "Contenu": "LED driver was a perfect match for the 3 lamp post light from Costco. The q and a section of the website was helpful as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:28:34.000Z",
          "Titre": "Sauna lights",
          "Contenu": "Bob answered all my questions and my light project in our barrel sauna turned out better than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd C",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:00:34.000Z",
          "Titre": "Product was as advertised",
          "Contenu": "Product was as advertised. Easy to install and worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark M",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T03:16:18.000Z",
          "Titre": "Great LED replacement kits",
          "Contenu": "The LED replacement kits came within a reasonable amount of time and had fairly clear instructions. I was able to install the replacements easily. And they work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Davis",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T13:22:36.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, communication, and shipping, will definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TOM BRUTA",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:40:30.000Z",
          "Titre": "GOOD SELECTION",
          "Contenu": "COULD DO BETTER IF HAD PRINTABLE RECEIPT.EVERYTHING ELSE GREAT THANK YOU."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Boris",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:50:36.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. I did call few times and both times the advice and knowledge of the staff was excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T23:06:25.000Z",
          "Titre": "GREAT Service",
          "Contenu": "GREAT Service. Very friendly customer service. We will be doing alot more business. I highly recommend. Bright White Lighting Company.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Gable",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T22:44:03.000Z",
          "Titre": "Great Experience",
          "Contenu": "Excellent information on their website, quick and free basic shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T16:09:19.000Z",
          "Titre": "They originally shipped the wrong part…",
          "Contenu": "They originally shipped the wrong part but it was easy to contact them and the sent the right one with next day delivery so all was good. I'd order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T19:52:31.000Z",
          "Titre": "Great customer support",
          "Contenu": "After I received an incorrect part in my order I contacted their customer support and the issue was resolved and a replacement part was sent out that same day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ma Long",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T03:56:32.000Z",
          "Titre": "Power Supplied",
          "Contenu": "Item as described, shipped the same day. Great experience overall. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kent",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T17:38:09.000Z",
          "Titre": "The led kit for my outside garage…",
          "Contenu": "The led kit for my outside garage lantern was a straight forward set up. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T18:58:32.000Z",
          "Titre": "Product works as advertised",
          "Contenu": "Product works as advertised. Easy to transition"
        }
      ]
    }
  ]
}