{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "marcaria.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Nacho Bergallo",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T20:28:38.000Z",
          "Titre": "Bad Service, no reply.",
          "Contenu": "I had an issue with my brand registration and they just sent a mail, without providing any solution. I have asked to have a call to understand alternatives and they did not even show up to the call. Really disappointing."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Ozgur Polat",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T17:13:00.000Z",
          "Titre": "I did not purchase anything and I wouldn't",
          "Contenu": "I did not purchase anything. However last time i ordered a teademark it took ages to get it. I had to go and see a lawyer and get him to write a letter so that you would finally send my trademark. Because of this I will never do any business with you."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Amit Bansal",
          "Nb_Reviews": 1,
          "Date": "2021-10-27T17:12:25.000Z",
          "Titre": "My first experience was very good with…",
          "Contenu": "My first experience was very good with this organisation so second time I chose them again but this time I feel they are not serious about work, they are not responding to emails. I have started thinking and feeling that they might cheat on me my money."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "YouNeedToKnow",
          "Nb_Reviews": 18,
          "Date": "2021-01-05T15:44:37.000Z",
          "Titre": "Not good at all",
          "Contenu": "Slow customer service. 70% higher prices compared with the market. Hard time to transfer domains. Better other registrars.P.S. I hope this time my feedback won't be removed, wouldn't be serious at all!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 3,
          "Date": "2017-03-22T22:49:40.000Z",
          "Titre": "Registered TradeMark under wrong info and ignores requests for updates!",
          "Contenu": "I was registering more than 20 trademarks for 2 companies across 10+ countries. Most of them turned out fine, but for the New Zealand TM, they registered it under the wrong name and address!! They told me it would get fixed shortly...It's been almost a year, and now when i ask when it's going to get fixed, I don't hear back from them. No reply, no follow up...nothing...Considering I've spent more than $20K in registration costs, this is pretty unacceptable. And to ignore their own customer when it was 100% their fault?! Take your money elsewhere, as there are plenty of other options out there for a cheaper price and will at the least follow up with you when it was their mistake."
        },
        {
          "Note": 1,
          "Lieu": "LU",
          "Pseudo": "Aixonne -com",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T21:30:47.000Z",
          "Titre": "Not trustworthy",
          "Contenu": "Not trustworthy, Marcaria had no any interest or courage To solve the problem which has been crated by themselves when Chinese .cn authority suspended my website’s domain name with so many #1 links in Google, me and so many of my team members didn’t have a quite moment during 3 days of historical shot down of our website topshipping.cn, and even finally we were those who fixed the problem by working nonstop following this issue from China and Europe after 3 days which Marcaria could do it in few hours but they were completely ignorant to this problem, this company is not trustworthy and has no the power to negotiate with their business partners or don’t care about their clients.Update: if we wouldn’t follow up this issue ourselves from our China’s office this issue wouldn’t be solved under 15 days and again you simply don’t care about customers."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Moritz S.",
          "Nb_Reviews": 1,
          "Date": "2017-10-23T08:53:05.000Z",
          "Titre": "Scammer",
          "Contenu": "Scammer! They dropped my domain and deleted my account out of nowhere. Afterwards they demandend a gov. ID which i provieded. Afterwards they didnt reply.Never ever again."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Mario Durinic",
          "Nb_Reviews": 1,
          "Date": "2018-07-28T05:57:37.000Z",
          "Titre": "Your product sucks and is unsupported…",
          "Contenu": "Your product sucks and is unsupported on basic platforms."
        },
        {
          "Note": 1,
          "Lieu": "AZ",
          "Pseudo": "Elchin Niftullayev",
          "Nb_Reviews": 1,
          "Date": "2020-01-11T10:17:01.000Z",
          "Titre": "long time support"
        },
        {
          "Note": 2,
          "Lieu": "BY",
          "Pseudo": "SHAREKEY",
          "Nb_Reviews": 2,
          "Date": "2019-05-23T18:13:19.000Z",
          "Titre": "Your website is from the 90's",
          "Contenu": "Your website is from the 90'sI strongly invite you to upgrade your platform.Not easy to navigate and understand what you offer.Booking a domain name is a pain, I walked away."
        },
        {
          "Note": 2,
          "Lieu": "TW",
          "Pseudo": "Cedric",
          "Nb_Reviews": 1,
          "Date": "2016-10-07T04:06:30.000Z",
          "Titre": "Poor web interface but good customer service",
          "Contenu": "Domain name purchase is OK, Marcaria sells Chinese domain names which is why I used their service in the first place. But the company web interface was obviously designed in the 1990s and never updated since ; hosting package manager is a simple copy of Plesk with weird features and few customizations. Furtunately customer service is good quality (human beings actually caring about customers) but i'd prefer not having to deal with customer service at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ceich62",
          "Nb_Reviews": 1,
          "Date": "2018-02-12T18:20:18.000Z",
          "Titre": "Creaky ops and admin site; support is good",
          "Contenu": "They seem to be the only choice for .ai domains. Their website design is straight out of the 2000's, but the basics seem to work.Problems I've encountered: - Unable to enter a valid CNAME (begins with underscore) as part of domain verification. - A CNAME whose target I updated on the admin page did NOT update on the name servers until I opened a case. - My main domain's A record disappeared from one of their name servers for several hours one weekend.Their support is diligent and friendly but you can't see the support cases on the web. There's no way to update the case unless&until they send you an email on it. The email contains case links that don't work for you, even if you're logged into their site.In response to the issues I've had (above) I do not get a sense that they are fixing the root causes of the failures."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Mika Wirtanen",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T17:03:30.000Z",
          "Titre": "I think this is very unfinished",
          "Contenu": "I think this is very unfinished. All other things are yet to be done except registration at stargames.com.tr. It would be good to be aware of a few things with the checklist. The website development agreement includes, among other things, the conditions for creating a commercial website. Website developer responsibilities, web page design, website hosting, compensation, confidentiality, ownership and rights, employee agreements, representation and warranties, term and termination, force majeure, joint venture, notices, time of essence, multiple counterparties, jurisdiction and disputes, binding on successors, waiver, severability, assignability, integration, execution and dating by parties. Naturally, the site related to the international use of the Stargames trademark should be licensable with content, which could also be used with other domains registered by Stargames Oy in different countries.There are very strong companies in the world competing for websites. For examle chess.com, fidearena and now lichess!"
        },
        {
          "Note": 3,
          "Lieu": "KW",
          "Pseudo": "Salem Alhuris",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T14:25:42.000Z",
          "Titre": "Need more services"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joshua Daley",
          "Nb_Reviews": 6,
          "Date": "2017-03-29T02:16:55.000Z",
          "Titre": "Marcaria — expensive, good support, mixed results",
          "Contenu": "It's hard to forgive a company that loses track of when your URL will expire, allows it to close, and then asks you to pay more money to fix the problem.  That was my experience.  It was their mistake, but I had to pay in advance to fix it.  Luckily, the problem was fixed, but my confidence in the company won't be coming back anytime soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie Noama",
          "Nb_Reviews": 2,
          "Date": "2017-12-10T21:18:20.000Z",
          "Titre": "The problem is no quick response …",
          "Contenu": "The problem is no quick response customer service agents available 24/7 to walk us thru and just resolve the problem.  Normally I use GoDaddy.com. Access to assistance is amazing with them. If you guys had better stuff access I would absolutely recommend you. Until then I'm hesitant."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Louis Chan",
          "Nb_Reviews": 1,
          "Date": "2019-03-23T03:51:00.000Z",
          "Titre": "Live Chat support",
          "Contenu": "Wish the Live Chat support person has enough knowledge to answer my question right away to avoid delay due to the transfer my case to email support"
        },
        {
          "Note": 3,
          "Lieu": "CZ",
          "Pseudo": "Radek Svenda",
          "Nb_Reviews": 1,
          "Date": "2016-10-10T12:03:08.000Z",
          "Titre": "Pricing -",
          "Contenu": "I do not like 2 prices for renew and domain registration. Registration is cheaper."
        },
        {
          "Note": 3,
          "Lieu": "LV",
          "Pseudo": "Info",
          "Nb_Reviews": 1,
          "Date": "2017-04-18T08:32:17.000Z",
          "Titre": "3 stars",
          "Contenu": "3 stars. Oftenly, mail-box worked very slowly."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Waleri I.",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T22:17:55.000Z",
          "Titre": "Be careful when paying with PayPal",
          "Contenu": "I have ordered a bunch (around 50) domains for a new TLD registration three weeks ago. When paying with PayPal the process got stuck. A few hours before the new TLDs got open for public registration I wanted to buy them for registration. (Marcaria offers a reservation service, they try to get the domains as soon they get open for registration).I paid around $900 via PayPal but the domains still remained in the cart and I got no order confirmation.Because I did not want to miss out on these domains I got them from another provider and asked for a refund from Marcaria. So I paid a total of $1800 for the names.Marcaria \"offers\" a Livechat function on their support site which is broken. The Livechat-Button doesn't even work, so I opened a ticket and opened PayPal disputes. The customer service then told me they can not refund the money as long the PayPal disputes are opened and asked me to close them, which I did not because I would lose the PayPal protection.They even told me they had a phonecall with PayPal and that it would be fine if I close the disputes, they told me I could reopen the dispute anytime which is not true. Once a PayPal dispute is closed it cannot be opened by the buyer.I had a phone call with PayPal on this topic myself and got told not to close the disputes until I receive my refunds. Marcaria could refund the money at any time while the disputes were open.So Marcaria and I could not find a solution without PayPal. I then had to wait for two weeks until PayPal got into the case and resolved the dispute for us.Knowing I would win the dispute since no domains were delivered I waited for PayPal´s solution.But then PayPal decided to only refund one of in total three disputes in my favor!Marcaria won the case and got to keep over $830.Knowing this could not be right I called PayPal again and told them the situation, they then reopened the disputes and today after 21 days of pure stress I got my money back!So be cautious when paying with PayPal and do not rely on PayPal to close the disputes in your favor!Update from 1-Star rating to 3-Star: Marcaria lately called me and explained the whole situation to me. Unfortunately there was a uncommon error during the payment process and Marcaria is now investigating it together with PayPal. Marcaria told me they are working hard to improve their processes and the amount of 5-Star ratings here on Trustpilot shows, that my experience was an isolated case. Marcaria generously offered to compensate me for this unfavorable situation."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Dammannagaru KrishnaReddy",
          "Nb_Reviews": 2,
          "Date": "2016-10-13T15:14:16.000Z",
          "Titre": "Satisfied",
          "Contenu": "The experience is satisfactory"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T23:49:01.000Z",
          "Titre": "By no means cheap."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Frankie Soo",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T01:11:24.000Z",
          "Titre": "Resolve the issue of copyright",
          "Contenu": "One-stop service extends throughout the world, making it very convenient."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jamesss",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T01:52:58.000Z",
          "Titre": "Support is not ideal, but above average",
          "Contenu": "Support is not ideal, but is above average compared to other companies and their support. Website is still a little outdated, but it has all the basics that's needed for domain. Others might have beautiful website but terrible support, which in case of problems is worse."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Kevin Smith",
          "Nb_Reviews": 5,
          "Date": "2023-10-30T13:12:31.000Z",
          "Titre": "Professional and Straightforward. Simple for the Customer.",
          "Contenu": "The process was simple for the customers. Professional approach by Marcaria they look after the rest. Straightforward from start to finish."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ana",
          "Nb_Reviews": 17,
          "Date": "2023-05-29T01:05:49.000Z",
          "Titre": "Although the issue was resolved it took…",
          "Contenu": "Although the issue was resolved it took too long. And one thing came after other.. I expect a more detailed and proactive service as I am not a IT or software expert"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "harsha rose",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T09:43:05.000Z",
          "Titre": "Great experience and work was neat",
          "Contenu": "Great experience and work was neat . I was surprised"
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Raul E Rodriguez R",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T23:48:17.000Z",
          "Titre": "Just needed to wait a bit for the…",
          "Contenu": "Just needed to wait a bit for the registration of the domain.  Took more than I expected."
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Lance",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T16:01:07.000Z",
          "Titre": "Quick Support",
          "Contenu": "The support responds quickly to resolve issues."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Pius",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T20:28:44.000Z",
          "Titre": "Reliable",
          "Contenu": "Have had over 10 years with them and they are reliable"
        },
        {
          "Note": 4,
          "Lieu": "GE",
          "Pseudo": "Dr. Meshari Aljubran",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T22:00:59.000Z",
          "Titre": "In general it is ok",
          "Contenu": "In general, it is ok"
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "Michael W. Brabsché - Ph.D.",
          "Nb_Reviews": 1,
          "Date": "2018-11-28T07:19:27.000Z",
          "Titre": "Your purchasing process is flawed",
          "Contenu": "Your purchasing process is flawed as it is not possible to make various purchases in one transaction, which forced us to buy the domain and theother add - ons separate that was a pain, as it took quite some time to figure out what does and what does not work!your online support was great though and resolved the inconveniencethrough proactive information and support great and well done,Thank you,Yours Cordially,Michael W. Brabsché - Ph.D."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "of ilja",
          "Nb_Reviews": 5,
          "Date": "2018-03-11T09:58:33.000Z",
          "Titre": "All good",
          "Contenu": "All good, I am satisfied with the service. The only thing is I would expect the domain transfer to be a bit more of an automated process. In this day and age a transfer must be a matter of filling in a form. But let's give Marcaria's customer services some credit, they dealt with my query exceptionally efficiently."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Domain Manager at Webd.top - Top Web Directory",
          "Nb_Reviews": 1,
          "Date": "2018-04-20T06:01:52.000Z",
          "Titre": "International Domain Names provider",
          "Contenu": "We are an old customer. They are a good International Domain Names provider. They provide additional legal support services if required at a very reasonable cost. Considering our overall past experience - we had always had a courteous experience with the support officers. We do recommend."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Gregor",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T18:41:05.000Z",
          "Titre": "Great service overall",
          "Contenu": "Great service but too pushy with add-on service. We will hire them again for register our international trademark. Thanks, overall very fast service. One star less because of a bit of outdated internet presence. Price very competitive."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Stephen Lowe",
          "Nb_Reviews": 15,
          "Date": "2017-08-17T12:26:05.000Z",
          "Titre": "From the advertisement I miss …",
          "Contenu": "From the advertisement I miss understood how the .cn domain worked.  I had not expected 1. that the server would be outside China or 2. that I would need to buy hosting spaced from Marcaria.  Maybe I have miss understood the host requirement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nate Klingenstein",
          "Nb_Reviews": 1,
          "Date": "2018-06-26T18:22:16.000Z",
          "Titre": "Unreliable Hosting",
          "Contenu": "The toolsets and customer service are very good, but the site has availability issues both domestic and international.  I'm not going to be able to use Marcaria for professional hosting even though I want to."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Luca",
          "Nb_Reviews": 7,
          "Date": "2020-11-04T15:45:56.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, issue solved very fast. I'm giving just 4 stats because the configuration is not really clear and somehow strange that require second domain mandatory but all rest is fine"
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Mihai Margineanu",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T03:44:09.000Z",
          "Titre": "Thank you for Support!"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Peter Kelly",
          "Nb_Reviews": 1,
          "Date": "2018-01-27T07:05:52.000Z",
          "Titre": "You need to given more notice of email …",
          "Contenu": "You need to given more notice of email limits approaching and you need to reactivate services immediately once paid. It is unacceptable to take 5 days or more to reactivate a web service."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "H O",
          "Nb_Reviews": 1,
          "Date": "2019-05-20T10:54:41.000Z",
          "Titre": "we are always get presented new…",
          "Contenu": "we are always get presented new services that we can't foresee and we do not get notified about new services/prices forehand. this could be more transparent and informative."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "amina akkawi",
          "Nb_Reviews": 3,
          "Date": "2023-05-06T03:46:58.000Z",
          "Titre": "24/7 support I like that.."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Billy Coe",
          "Nb_Reviews": 6,
          "Date": "2018-10-03T20:21:03.000Z",
          "Titre": "Great Company and service have used…",
          "Contenu": "Great Company and service have used before Could do with extra information when you try to purchase restricted domains before checkout but very helpful sorting refund afterwards"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Supanit Chaiyawat",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T07:49:10.000Z",
          "Titre": "You should have told us all the exact…",
          "Contenu": "I got the Domain registered. Communication to the right authority could have been more accessible in order to expedite the process."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Jean-Jacques",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T00:53:33.000Z",
          "Titre": "I been well drove during Wordpress…",
          "Contenu": "I been well drove during Wordpress installation process, I wish the ame support to be able to use email adresses from outlook Thanks to Marcadia team"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Bilal Nueirat",
          "Nb_Reviews": 3,
          "Date": "2020-08-07T11:03:08.000Z",
          "Titre": "Easy to purchase and good support",
          "Contenu": "Easy to purchase, very good support but i gave 4 stars because of old design website, and the website make me hesitate to purchase at beginning ."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Hassan",
          "Nb_Reviews": 32,
          "Date": "2019-09-19T10:13:15.000Z",
          "Titre": "I like it!",
          "Contenu": "Wide range of extensions available. Helpful support. Mostly available online. Great prices on domain extensions and unbeatable on some! I like it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Brady",
          "Nb_Reviews": 5,
          "Date": "2018-07-25T22:12:44.000Z",
          "Titre": "I had a couple .llc names that I didn't…",
          "Contenu": "I had a couple .llc names that I didn't get, but my partner did on another registrar so I wonder how that works, but otherwise very pleased"
        },
        {
          "Note": 4,
          "Lieu": "MM",
          "Pseudo": "Wynn Aung",
          "Nb_Reviews": 2,
          "Date": "2022-07-10T14:35:09.000Z",
          "Titre": "Very responsive for questions."
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "Igor Velimirović",
          "Nb_Reviews": 1,
          "Date": "2021-06-11T06:54:55.000Z",
          "Titre": "I had only limited interaction with…",
          "Contenu": "I had only limited interaction with Marcaria for simple transactions, but those were done in time and professional manner."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "jahanzaib Tahir",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T20:18:01.000Z",
          "Titre": "Thank you for support",
          "Contenu": "Henna and Inna korchak. thank you for support and services.Appreciated and also the guy on live chat.. Thank you once again."
        },
        {
          "Note": 4,
          "Lieu": "AL",
          "Pseudo": "Etjon Koti",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T22:41:15.000Z",
          "Titre": "information",
          "Contenu": "The support was highly professional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patria Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T13:02:47.000Z",
          "Titre": "Excellent",
          "Contenu": "The answered me immediately"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Lee Sean Hsiung",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T00:54:10.000Z",
          "Titre": "So far all are very good the Support…",
          "Contenu": "So far all are very good the Support reply all are well and clear, just if can speed up the reply will be great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2022-03-23T19:17:06.000Z",
          "Titre": "Everything was fine!",
          "Contenu": "Everything was fine. We thought the process was faster. But went ok. Now waiting USPTO answer."
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Firas",
          "Nb_Reviews": 3,
          "Date": "2018-03-05T03:48:20.000Z",
          "Titre": "problem solved immediately when ticket…",
          "Contenu": "problem solved immediately when ticket was raised, unfortunately i had to wait 2 days for ticket to be open during weekend"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marius Gheboianu",
          "Nb_Reviews": 1,
          "Date": "2018-01-25T16:12:57.000Z",
          "Titre": "Great support",
          "Contenu": "Great support, took a little longer until I received the domain (i.e. 2-3 days, transaction was made over the weekend)"
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Manuel Angeles",
          "Nb_Reviews": 1,
          "Date": "2018-01-15T06:12:57.000Z",
          "Titre": "I am now satisfied after few assistance …",
          "Contenu": "I am now satisfied after few assistance and I have started now to use my personal email. Thanks for the team support."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Travelizer",
          "Nb_Reviews": 2,
          "Date": "2016-11-17T17:37:20.000Z",
          "Titre": "Top provider :)",
          "Contenu": "Everythings well done, good prices, the userpanel might be betterbwith more optons (adress etc.) to change by myself."
        },
        {
          "Note": 4,
          "Lieu": "RU",
          "Pseudo": "Natalia Simonenko",
          "Nb_Reviews": 1,
          "Date": "2017-02-27T14:36:53.000Z",
          "Titre": "Good but a bit expensive",
          "Contenu": "I have been with you service for more than 4 years. Some prices are too high. But service is excellent! Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Catherine LEBON",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T10:52:01.000Z",
          "Titre": "It was complicated to obtain a pro…",
          "Contenu": "It was complicated to obtain a pro forma invoice to renew the domain by bank transfer. But after all ok"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Supisit Max Suwantip",
          "Nb_Reviews": 1,
          "Date": "2017-01-17T09:31:39.000Z",
          "Titre": "Good Services",
          "Contenu": "But the problem is  sometime the works of time 2 countries are deference ,and not responding on the time of works"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Simon Karls",
          "Nb_Reviews": 2,
          "Date": "2018-03-10T17:03:57.000Z",
          "Titre": "Professional Domain Services",
          "Contenu": "Domain service was professional and friendly, would recommend to business associates.S. KarlsKelto Inc."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Harald Fuechsel",
          "Nb_Reviews": 4,
          "Date": "2016-12-05T12:05:54.000Z",
          "Titre": "Good and always quick satisfying service.",
          "Contenu": "Good and always quick satisfying service.Good contact via email respectively via margarita-internal mail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roberto",
          "Nb_Reviews": 1,
          "Date": "2018-09-20T08:28:36.000Z",
          "Titre": "Very Quick Response",
          "Contenu": "Very Quick Response and the information sent was quite useful and beneficial for my intent and purpose."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Louise McGowan",
          "Nb_Reviews": 1,
          "Date": "2018-11-25T22:26:24.000Z",
          "Titre": "Took a few emails to get them to…",
          "Contenu": "Took a few emails to get them to address my problem, but once they did, it was fixed very quickly."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Gustavo Camargo",
          "Nb_Reviews": 1,
          "Date": "2018-07-21T13:31:37.000Z",
          "Titre": "Need to give us more explanation of how…",
          "Contenu": "Need to give us more explanation of how the traffic limit in the free basic account is renovate"
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Michal Beza",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T14:32:42.000Z",
          "Titre": "Very satisfied",
          "Contenu": "Very satisfied, but theres allways some space for improvement, therefore only 4 stars ;-)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nia",
          "Nb_Reviews": 1,
          "Date": "2020-07-08T14:24:45.000Z",
          "Titre": "My experience with Marcaria was great",
          "Contenu": "My experience with Marcaria was great. My Agent Ms. Galva was nice and professional."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Gordon  Honeyman",
          "Nb_Reviews": 3,
          "Date": "2019-01-27T13:09:56.000Z",
          "Titre": "Most comprehensive",
          "Contenu": "Most comprehensive , easy to navigate, domain name sellerEasy to set upNo hard sell"
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2018-03-17T20:41:42.000Z",
          "Titre": "Everything was ok",
          "Contenu": "Everything was ok, but the management panel that was a bit of disappointment"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Mahmood Reza Hedayati",
          "Nb_Reviews": 1,
          "Date": "2019-04-18T08:09:35.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you. I received very good reply to all of my question very soon."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Jean-Pierre Meijer",
          "Nb_Reviews": 1,
          "Date": "2019-04-27T08:39:19.000Z",
          "Titre": "Friendly, responsive and good service",
          "Contenu": "My questions and requests are handled very fast and good - thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Brandt",
          "Nb_Reviews": 1,
          "Date": "2017-06-28T20:54:41.000Z",
          "Titre": "Very helpful in obtaining domains …",
          "Contenu": "Very helpful in obtaining domains previously owned by other companies."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "LOW YEAW SENG",
          "Nb_Reviews": 1,
          "Date": "2016-12-30T01:13:20.000Z",
          "Titre": "This is our first time purchase in  …",
          "Contenu": "This is our first time purchase in Marcaria will keep in view. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexandr Sarioglo",
          "Nb_Reviews": 2,
          "Date": "2017-10-02T19:25:01.000Z",
          "Titre": "Overall great service",
          "Contenu": "Overall great service, but application of DNS changes is quite slow."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dennis Lau",
          "Nb_Reviews": 1,
          "Date": "2020-10-19T18:46:44.000Z",
          "Titre": "I give 4 stars to hope you continue to…",
          "Contenu": "I give 4 stars to hope you continue to work hard. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Jacobus Kuipers",
          "Nb_Reviews": 1,
          "Date": "2018-11-10T21:55:18.000Z",
          "Titre": "The domain registration and follow-up…",
          "Contenu": "The domain registration and follow-up steps work perfectly."
        },
        {
          "Note": 4,
          "Lieu": "IS",
          "Pseudo": "Thorri Eyjolfsson",
          "Nb_Reviews": 1,
          "Date": "2017-08-17T23:27:09.000Z",
          "Titre": "For me i will get all help from …",
          "Contenu": "For me i will get all help from marcaria.com as i need."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bachan Sharma",
          "Nb_Reviews": 2,
          "Date": "2017-04-17T21:15:04.000Z",
          "Titre": "Highly satisfactory & prompt customer …",
          "Contenu": "Highly satisfactory & prompt customer service."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Patrizia Solari",
          "Nb_Reviews": 3,
          "Date": "2017-03-15T20:44:44.000Z",
          "Titre": "Good working relationship online.",
          "Contenu": "Fast feedback from Marcaria at reasonable charges."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kc",
          "Nb_Reviews": 1,
          "Date": "2019-06-14T18:57:58.000Z",
          "Titre": "I asked a question that did not get…",
          "Contenu": "I asked a question that did not get answered."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Innusag",
          "Nb_Reviews": 1,
          "Date": "2020-01-30T08:38:58.000Z",
          "Titre": "best work",
          "Contenu": "1) best work2) quickly answer3) I recomend"
        },
        {
          "Note": 4,
          "Lieu": "JO",
          "Pseudo": "Raghda",
          "Nb_Reviews": 1,
          "Date": "2020-03-12T18:20:35.000Z",
          "Titre": "i like it your services",
          "Contenu": "i like it your services, please keep going"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Kuljeet Singh",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T09:34:23.000Z",
          "Titre": "Great Support in situation of COVID",
          "Contenu": "Great Support in situation of COVID - 19."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "RAJESH SHARMA",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T04:14:24.000Z",
          "Titre": "There is always room for improvement ..."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Gerard",
          "Nb_Reviews": 1,
          "Date": "2020-10-16T13:03:57.000Z",
          "Titre": "I bought a domain name and that was OK."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "salah esmat",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T17:41:25.000Z",
          "Titre": "Thank for u",
          "Contenu": "Thanks for you, and your corporation"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Geert van den Berg",
          "Nb_Reviews": 6,
          "Date": "2018-01-12T17:07:41.000Z",
          "Titre": "Very good service.",
          "Contenu": "Very good service.Fast and effective"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Richard Cross",
          "Nb_Reviews": 1,
          "Date": "2017-06-10T08:11:26.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use - great customer service."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "NGUYEN HUU THI",
          "Nb_Reviews": 1,
          "Date": "2016-12-02T13:17:43.000Z",
          "Titre": "Services is so good and fastly",
          "Contenu": "Exactly and so fastly! Professional !"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Alfred Yeung",
          "Nb_Reviews": 1,
          "Date": "2019-11-12T06:10:46.000Z",
          "Titre": "Good arrangement and explanation"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Lecot Johan",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T08:18:24.000Z",
          "Titre": "Non nonsense rapid services!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BB",
          "Nb_Reviews": 3,
          "Date": "2017-09-19T20:17:34.000Z",
          "Titre": "Recommended",
          "Contenu": "nice UI, reasonable prices."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Kshitiz Regmi",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T23:17:17.000Z",
          "Titre": "Good and instant service"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Naresh Gupta",
          "Nb_Reviews": 1,
          "Date": "2018-03-22T17:40:10.000Z",
          "Titre": "satisfied with the support"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Mark Dear",
          "Nb_Reviews": 14,
          "Date": "2020-10-15T12:47:44.000Z",
          "Titre": "Agent customer service great, technical support upon which she and I each rely needs work.",
          "Contenu": "The attention I received from the agent was fine. She followed up with the appropriate teams to get a definitive answer, which is absolutely her job and she did it perfectly.So, to be clear, it is not on her that I didn't _get_ a definitive answer. I'm happy with the result that you should not expect a forwarding rule to forward an email _back_ to the address that it came from.But, this should be stated clearly in the documentation, both that available to the user and agents. Although it's reasonable to assume that such 'bounceback' forwarding would never be needed in practice, it is _also_ reasonable to assume that a new, non-commercial domain owner (like me) might try it as a test, and that possibility could easily be confirmed or eliminated in the support script.Here is how the conversation should have gone:[Agent] (Mon, 10/12/2020, 05:10:22 pm America/Santiago)Hello. How may I help you?Me (Mon, 10/12/2020, 05:11:05 pm)Hey, I have set up mail forwarding for an email on my new domain, but it isn't happening ... what could I have done wrong?[Agent]  (Mon, 10/12/2020, 05:11:18 pm)What is your domain name?Me (Mon, 10/12/2020, 05:11:28 pm)[my domain name][Agent]  (Mon, 10/12/2020, 05:11:43 pm)Let me check. Just a second.Me (Mon, 10/12/2020, 05:11:50 pm)Tx[Agent]  (Mon, 10/12/2020, 05:15:19 pm)Did you create a forwarding to [some email address]?Me (Mon, 10/12/2020, 05:15:30 pm)Yes*** Enter parallel dimension  - everything from here is from my imagination. It didn't happen this way***[Agent]  (Mon, 10/12/2020, 05:17:38 pm)OK, and by any chance is that also the email account from which the message that has not been forwarded was sent ?Me (Mon, 10/12/2020, 05:18:11 pm)Yes[Agent]  (Mon, 10/12/2020, 05:19:47 pm)OK, according to the documentation I have from out hosting team, that will not work by design. An email cannot be automatically forwarded back to the address it came from. This is a safeguard against 'infinite loop' emails. Is there an alternate address from which you can send an email to test the forward?Me  (Mon, 10/12/2020, 05:19:54 pm)Sure, I have a different one I can try.[Agent]  (Mon, 10/12/2020, 05:20:41 pm)OK, please can you try that?Me (Mon, 10/12/2020, 05:20:42 pm)I just did and yeah, it worked fine. Thank you, [Agent]![Agent]  (Mon, 10/12/2020, 05:21:07 pm)No problem. Is there anything else I can help you with to day?Me (Mon, 10/12/2020, 05:23:08 pm)No, that was everything. Thank you very much [Agent]![Agent]  (Mon, 10/12/2020, 05:24:29 pm)You're so welcome! Have a great day!"
        },
        {
          "Note": 4,
          "Lieu": "MU",
          "Pseudo": "Vincent Diepart",
          "Nb_Reviews": 2,
          "Date": "2019-03-21T12:02:27.000Z",
          "Titre": "Nice and rapid service"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Working Hours",
          "Nb_Reviews": 1,
          "Date": "2018-01-30T18:17:29.000Z",
          "Titre": "Keep up the good work!"
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2019-03-26T17:59:30.000Z",
          "Titre": "genial",
          "Contenu": "genial zzzzzzzzzzzzzz"
        },
        {
          "Note": 4,
          "Lieu": "UG",
          "Pseudo": "Book",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T09:34:50.000Z",
          "Titre": "good",
          "Contenu": "good response time"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Jonathan Ayala",
          "Nb_Reviews": 1,
          "Date": "2017-04-10T00:35:06.000Z",
          "Titre": "Marcaria",
          "Contenu": "Ok, good support."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Liron Ben",
          "Nb_Reviews": 2,
          "Date": "2021-04-16T06:39:48.000Z",
          "Titre": "Nice service"
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Jorge Thomas",
          "Nb_Reviews": 1,
          "Date": "2017-08-30T19:17:51.000Z",
          "Titre": "Nice experience."
        },
        {
          "Note": 4,
          "Lieu": "MU",
          "Pseudo": "Alice Mirara",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T04:28:46.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "VINCENT TAN WENG KANG",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T04:10:26.000Z",
          "Titre": "so far so good"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Steven Maqroma",
          "Nb_Reviews": 1,
          "Date": "2017-06-18T04:39:30.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Carole",
          "Nb_Reviews": 6,
          "Date": "2017-05-18T04:28:00.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Bacher",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:09:36.000Z",
          "Titre": "Ready for the Storm!?",
          "Contenu": "Be prepared to face factual and eventful trademark guidance! Hard and daunting taking out a trademark registration may be, those people at Marcaria will set the record straight of what steps to take to get you fully covered. Ultimately it is you who is taking out that baby along with its bathwater right through hell and high water. Marcaria will prepare you for the big legal business dipper ride you were always striving for. Their services simply put are ultimately nothing short of anything to be sneezed at."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "John Franco",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:23:30.000Z",
          "Titre": "They got my trademark registered in USA…",
          "Contenu": "They got my trademark registered in USA hassle free!The registration agent guided me through the process from submittals to pre-application changes and the waiting process. Knowledgeable and responsive service.I will handle all my trademark registration and watching needs with Marcaria."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Oksana MacLaren",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:08:42.000Z",
          "Titre": "Thank you Marcaria team for helping me…",
          "Contenu": "Thank you Marcaria team for helping me out so quick! Andrew was very helpful and informative the whole process. I am looking forward for my successful business, thanks to Marcaria team!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Olena Mayer",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T21:35:59.000Z",
          "Titre": "We are happy to work with Marcaria's…",
          "Contenu": "We are happy to work with Marcaria's Professional Team, they are always trying the best to help customers, by advising the best options and delivering nice results.Olena MayerRegulatory and Compliance OfficerKvG Group Inc., Footlogix"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "FootActive Einlegesohlen",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T14:50:12.000Z",
          "Titre": "Marcaria is very professional!",
          "Contenu": "Marcaria is a very trustful and professional team of many lawyers. I am a client there since 13 years and never had any problems. They provide an excellent help with all my trademarks and domain registrations. I can highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shf",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:04:45.000Z",
          "Titre": "Very quick and personable service."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Ayman",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:00:04.000Z",
          "Titre": "I really appreciate it",
          "Contenu": "I really appreciate it, thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "marc chappell, mba",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T18:20:15.000Z",
          "Titre": "Highly Usable Site - Responsive staff",
          "Contenu": "I found it very easy to purchase a domain, point it to another and receive assistance. The staff was very responsive when I had a question.Marc"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Luiz Guedes",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T15:03:24.000Z",
          "Titre": "Excellent service and support",
          "Contenu": "Excellent, 2 domains and so far works very well.Customer support is excellent!!The website interface is outdated, but it works great."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "ibrahem saati",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T12:43:57.000Z",
          "Titre": "I thank the employee Vincent Berne for…",
          "Contenu": "I thank the employee Vincent Berne for his good treatment and quick response and providing solutions. Thank you, unlike the employee Lina Evtikhova who did not react to my request."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Patrick, atelier noir pty ltd",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T21:26:09.000Z",
          "Titre": "One of the rare perfect costumer experience: perfect!",
          "Contenu": "Marcaria and especially our assigned agent were swift in their response, structured and proactive in their requisition of required documents and such. Their service was quick, friendly and competent! They've solved our request in record time!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Joe Rathinam",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T07:35:55.000Z",
          "Titre": "My experience with Marcaria.com",
          "Contenu": "Immediate responses to all queries regarding registration of trademarks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Rassner",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T16:29:15.000Z",
          "Titre": "Amazing company",
          "Contenu": "Amazing company. Unparalleled service and communication. We needed trademark service in ten countries and we are able to sit back and relax while Marcaria takes care of everything. Eunice is awesome with her communication which is professional and timely while being friendly as well. It doesn’t get better than this.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "David Blair",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T13:32:32.000Z",
          "Titre": "The management tools are great",
          "Contenu": "The management tools are greatMarcaria was recommended to me by a close friend and ever since I joined it I never looked back. The management tools are great and I can always count on the support team to help me when I get stuck."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chris Tansell",
          "Nb_Reviews": 5,
          "Date": "2023-05-05T00:27:14.000Z",
          "Titre": "Please accept my sincerest thanks for a…",
          "Contenu": "Please accept my sincerest thanks for a level of service I haven't enjoyed for some years. Mackarena Loyola provided exactly the right level of communications - None of my time was wasted with nuisance rubbish, but I felt supported and informed at all times. Great work!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Aaron Otene",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T13:51:43.000Z",
          "Titre": "Easy Process",
          "Contenu": "Marcaria.com has been really helpful. with the whole Trademark process."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "INDOZAIN",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T15:34:19.000Z",
          "Titre": "Trademark Registration",
          "Contenu": "The agent has good response to answer questions and follow up quickly... but please marcaria should have more stronger support in the field (each country) or strong representative so that every proposal gets good results smoothly.Overall Marcaria.com is excellent"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Vladimir Andronov",
          "Nb_Reviews": 5,
          "Date": "2023-04-04T20:51:59.000Z",
          "Titre": "Support is not idea but better than average",
          "Contenu": "Compared to other registrars and their support Marcaria is doing great job. Website is still in the style of 2000, but it has all the basics that's needed for domain. Others might have beautiful website but terrible support, which in case of problems is worse."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Jose Roca",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T17:49:04.000Z",
          "Titre": "They are very transparent and helpful",
          "Contenu": "They are very transparent and helpful, they don't take advantage of you when you are interested on one specific domain. Even when Godaddy locked one domain because I was searching it intensively and tried to charge much more I acted quickly and registered it with Marcaria and they just did it.I'll always be gratefull for that."
        },
        {
          "Note": 5,
          "Lieu": "LB",
          "Pseudo": "Mayez Merhbi",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T16:55:47.000Z",
          "Titre": "Great company and highly responsive…",
          "Contenu": "Great company and highly responsive staff. I would highly recommend them especially if you're looking to register a trademark or a country-specific domain name. Their systems do need a redesign in my opinion and maybe introduce new features, but overall i'm satisfied with their services."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Peter D. Reed",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T00:51:54.000Z",
          "Titre": "I am very satisfied with the service I…",
          "Contenu": "I am very satisfied with the service I received. The whole process was straightforward and the pricing was much better than on some competitor websites. I will surely keep coming back."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Jeson Jornan",
          "Nb_Reviews": 8,
          "Date": "2023-11-01T13:11:59.000Z",
          "Titre": "The domain registration process was…",
          "Contenu": "The domain registration process was very simple and straightforward. Their customer support is also very responsive and helpful. thank you for your cooperation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P.Richardson",
          "Nb_Reviews": 3,
          "Date": "2023-02-10T17:39:57.000Z",
          "Titre": "Working with Marcaria is similar to having a personal lawyer on your team!",
          "Contenu": "I have always gotten great support from Marcaria over the years. So much so our company is now transitioning all of our global registrations to our Marcaria account. Our account executive at Marcaria is excellent ! She provides timely support and reminders of critical events needing our response so as to not miss important due dates. We enjoy working with her and the Marcaria International Team very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura C. Smith",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T01:28:47.000Z",
          "Titre": "The management tools are great",
          "Contenu": "Marcaria was recommended to me by a close friend and ever since I joined it I never looked back. The management tools are great and I can always count on the support team to help me when I get stuck."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Volker",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T11:44:29.000Z",
          "Titre": "Support",
          "Contenu": "Support was friendly and competent and quick in reply!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Victor Oghifobibi",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T08:22:21.000Z",
          "Titre": "Timeliness",
          "Contenu": "TimelinessIt was very important for us to get prompt feedback due to the urgency of our request which was disrupting business operations and we received it instantly via chat and email."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Reilly",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T16:49:30.000Z",
          "Titre": "Corporate Change",
          "Contenu": "Daniela and Team went above and beyond in assisting me make necessary changes for all our domains globally after our company changes management. Many thanks to the whole team!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "IT Support",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T15:24:08.000Z",
          "Titre": "fast and efficient",
          "Contenu": "The support team knew exactly what I needed and was about to walk me through all the steps to achieve what I needed. Took a few days for it to me completed but that was due to me, and they pleasantly reminded me when they were waiting on me to move to the next step."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "YH",
          "Nb_Reviews": 8,
          "Date": "2023-10-31T20:45:19.000Z",
          "Titre": "They're willing to communicate.. (fixed review)",
          "Contenu": "Oct 31th 2023 - Review revised.Had a domain registration dispute but they're willing to communicate and solve the problem.  Thanks for the hard-working customer support team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Turner",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T05:33:24.000Z",
          "Titre": "Their support team was very responsive.",
          "Contenu": "The domain registration process was very straightforward and easy to follow. Their support team was also very responsive to any questions I had. Surprised by the quality of service, to be honest."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Andreas",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T10:15:06.000Z",
          "Titre": "Very professional and fair",
          "Contenu": "Very professional, fair and customer-orientated. They follow us up an extra time if we have not responded to their first reply, and always check after the ticket is closed if we are happy about the experience 👍👍"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Bushra Al Azzaui",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T12:54:31.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Great Customer Service, I had couple of issue last week with my domain set up, with great help for the support team they helped me out of to solve this issue."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Nebojsa Trakilovic",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T11:52:43.000Z",
          "Titre": "Fantastic support!",
          "Contenu": "Commenced using the service recently and so far I have received helpful and very responsive support by the team at Marcaria (specifically Orell). Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Idc Ig Secretariat",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:42:57.000Z",
          "Titre": "Fast reaction",
          "Contenu": "My experience was good, fast answer and also solution"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T23:58:21.000Z",
          "Titre": "Registration Process Was Smoother",
          "Contenu": "The domain registration process was smoother than expected. I usually run into some dumb problems that take days to resolve but not this time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura E",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T22:34:36.000Z",
          "Titre": "They have a great thing going over here.",
          "Contenu": "Out of all the services I tried so far Marcaria offers the best user experience without a question. They have a great thing going over here."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Dr Michael Rothschild MD",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T08:38:59.000Z",
          "Titre": "Exceptional Experience with Marcaria - A Trustworthy Partner for Trademarks",
          "Contenu": "I recently had the pleasure of working with Marcaria, and I must say it was an outstanding experience. From start to finish, their service was top-notch, and I am delighted with the results.Marcaria's team demonstrated a remarkable level of professionalism, knowledge, and responsiveness. They promptly addressed all our inquiries and provided clear and concise information throughout the process. Their expertise in handling trademark matters was evident, and I felt confident that our brand was in capable hands.What sets Marcaria apart is their commitment to being honest, helpful, and constructive. They listened to our specific needs and tailored their solutions accordingly, making sure we fully understood all aspects before proceeding.I highly recommend Marcaria to anyone seeking trademark services. Their reliability, customer-centric approach, and attention to detail make them a trustworthy partner. I will undoubtedly turn to them for any future trademark needs.Date of experience: 07/23/2023Dr Michael Rothschild MD"
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Dr Michael Rothschild MD",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T08:40:15.000Z",
          "Titre": "I recently had the pleasure of working…",
          "Contenu": "I recently had the pleasure of working with Marcaria, and I must say it was an outstanding experience. From start to finish, their service was top-notch, and I am delighted with the results.Marcaria's team demonstrated a remarkable level of professionalism, knowledge, and responsiveness. They promptly addressed all our inquiries and provided clear and concise information throughout the process. Their expertise in handling trademark matters was evident, and I felt confident that our brand was in capable hands.What sets Marcaria apart is their commitment to being honest, helpful, and constructive. They listened to our specific needs and tailored their solutions accordingly, making sure we fully understood all aspects before proceeding.I highly recommend Marcaria to anyone seeking trademark services. Their reliability, customer-centric approach, and attention to detail make them a trustworthy partner. I will undoubtedly turn to them for any future trademark needs.Date of experience: 07/23/2023Dr Michael Rothschild MD"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Yevgeniy Geyman",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T15:37:16.000Z",
          "Titre": "Great domain seller with the best prices. Recommend!!",
          "Contenu": "Easy search, majority of domain zones, lowest prices. Great support team.  Start your business here!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "June Botsford",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T22:14:20.000Z",
          "Titre": "Customer support is on a different level.",
          "Contenu": "This is a great alternative to a lot of “big companies” out there. Customer support is on a different level and everything is so smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karry Cornoal",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T23:20:57.000Z",
          "Titre": "Marcaria is great!",
          "Contenu": "Who could have knew that TM registration for some specific countries isn't a hustle anymore? Marcaria is great!"
        },
        {
          "Note": 5,
          "Lieu": "LY",
          "Pseudo": "Yusuf Adam Wali Ali",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T21:30:53.000Z",
          "Titre": "Prompt communication with clients is an essential component of any company's success",
          "Contenu": "The moment that this company is organized and evidence of that is the rapid response to e-mails in an elegant manner. We wish them lasting success"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "SAMUEL EZENNAYA",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T18:37:56.000Z",
          "Titre": "Response was fast and i was able to get…",
          "Contenu": "Response was fast and i was able to get my trade mark registration restored even when my domain got expired"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "KANG",
          "Nb_Reviews": 7,
          "Date": "2023-10-31T07:42:30.000Z",
          "Titre": "Thanks to your considerations. AAAAA+++++",
          "Contenu": "Thanks to your considerations.Special thanks to Susana. AAAAA+++++"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Thoriso Mashego",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T15:16:28.000Z",
          "Titre": "Great company with minimal fuss over…",
          "Contenu": "Great company with minimal fuss over getting copyright protection in the USA from South Africa.Would recommend them easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Blueair",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T00:49:46.000Z",
          "Titre": "Excellent customer service.",
          "Contenu": "Sean replied promptly with a solution and explained a path forward to reach my goal. Excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Dr. Tamer Aziz",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T01:49:20.000Z",
          "Titre": "Great company with perfect service.",
          "Contenu": "Marcaria.com is a great company with perfect service. I recommend them to everyone who is looking for real success."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Ulrich Reinhardt",
          "Nb_Reviews": 3,
          "Date": "2023-09-08T14:14:17.000Z",
          "Titre": "I have been working with Marcaria/Yoram…",
          "Contenu": "I have been working with Marcaria/Yoram Meulblok for years with the greatest satisfaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert J.",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T00:39:33.000Z",
          "Titre": "fairly quickly.",
          "Contenu": "Great customer support! I received help faster than expected and my problem was solved fairly quickly."
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Emil Szymański",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:09:43.000Z",
          "Titre": "profi",
          "Contenu": "i can recomend this service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David F. Edwards",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T21:39:12.000Z",
          "Titre": "I had so Many Issues Trying to Register…",
          "Contenu": "I had so many issues trying to register my trademark in the US but after switching to marcaria it was all sorted out in a day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nola Bechtelar",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T02:11:08.000Z",
          "Titre": "The amount of countries the trademark…",
          "Contenu": "The amount of countries the trademark search option covers is staggering. Opens up a lot of options for you to chose from."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "martin krupik",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T16:40:19.000Z",
          "Titre": "Marcaria customer service",
          "Contenu": "The customer service from Marcaria went beyond their line of duty to help solve everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Davor Petrov",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T09:17:09.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Domain registration was fast and easy. Questions i had for support were answered quickly and professionally."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Amal Oripova",
          "Nb_Reviews": 3,
          "Date": "2022-10-03T17:14:09.000Z",
          "Titre": "Marcaria.com - trustful company",
          "Contenu": "We are using Marcaria service for quite a long time and can confirm that is a trustworthy company to work with! Professional and Competent staff, perfect customer service."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Dan Conklin",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T01:34:40.000Z",
          "Titre": "Couldn't Recommend it enough.",
          "Contenu": "Been using this registrar for a while now and it was always reliable, simple and affordable. Couldn't recommend it enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darren M",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T15:20:28.000Z",
          "Titre": "Quick & Professional",
          "Contenu": "Very professional.  Quick responses to support inquiries via chat.  If original tech cannot resolve, secondary support has also been expedient.  Happy with Marcaria and their offerings."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Valentin Badea",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T01:19:06.000Z",
          "Titre": "The support is excelent",
          "Contenu": "The support is excelent! Marcaria team really helped me with all I needed!Great people there. I had nothing to complain in 4 years now... I am not a heavy user of their services, but hosting domains worked just fine for me.Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dominkhlo",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T23:05:03.000Z",
          "Titre": "I'm New to Domain Registration And…",
          "Contenu": "I'm new to domain registration and everything was very user-friendly, the UI is a little old, but easy to use."
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "zuo",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T05:10:49.000Z",
          "Titre": "Quick resolution",
          "Contenu": "Quick resolution, good attitude, prompt response to emails, and taking jet lag into account except for the first time, great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T00:26:50.000Z",
          "Titre": "Good follow-up from the Marcaria office…",
          "Contenu": "Good follow-up from the Marcaria office after I purchased two domain names."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betty Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T00:10:15.000Z",
          "Titre": "Clear Instructions",
          "Contenu": "I like the clean design that always provides you with clear instructions and a sense of direction."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T15:49:57.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Marcaria monitored the publishing of our new domains and took action when needed even before we contacted them."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Joseph S. Miller",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T23:05:25.000Z",
          "Titre": "Registering a TM can be an exhausting and tedious task but that is not the case with Marcaria."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Deim Janos",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T23:13:32.000Z",
          "Titre": "Excellent support",
          "Contenu": "Excellent support, very simple and clear instructions, just the way it should be!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keenan Ernestine",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T19:44:08.000Z",
          "Titre": "This was my first time registering a…",
          "Contenu": "This was my first time registering a trademark with Marcaria. I will keep coming back for sure!"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Ming Zeng",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T03:13:42.000Z",
          "Titre": "Very Satisfied",
          "Contenu": "We have received the feedback and advce regarding our clients's trademark status from this firm timely."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Derek Lorenz",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T06:44:28.000Z",
          "Titre": "Great Service",
          "Contenu": "Great Follow up and good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Merilou Radriguaz",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T20:17:10.000Z",
          "Titre": "Reliable, Easy to use and very cheap compared.",
          "Contenu": "This is what a 5-star serivce looks like if you ask me. Reliable, easy to use and very cheap compared to the rest of the market."
        },
        {
          "Note": 5,
          "Lieu": "LU",
          "Pseudo": "Katherine Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T01:50:31.000Z",
          "Titre": "Good job to everyone involved!",
          "Contenu": "The support rep was very knowledgeable and dedicated to solving an issues I had with some documentation. Good job to everyone involved!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wallace A. Barriga",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T00:10:04.000Z",
          "Titre": "The trademark search option is very…",
          "Contenu": "The trademark search option is very helpful and much better then what I was using before."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Canada Trade Corp",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T19:00:54.000Z",
          "Titre": "Truly 5-star services..",
          "Contenu": "Truly 5-star services... Just give them all your brand registration, and they take care of everything at a fair price..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Miller",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T22:58:12.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Excellent service! I had some issues with my domain registration and the support team quickly resolved them."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ryan B",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T17:42:43.000Z",
          "Titre": "Helpful and responsive support team got…",
          "Contenu": "Helpful and responsive support team got back to me with quick and easy guidance."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jay Roan",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:21:49.000Z",
          "Titre": "Very helpful with registering a Thai…",
          "Contenu": "Very helpful with registering a Thai domain name"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linker",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T23:59:32.000Z",
          "Titre": "the case with many others.",
          "Contenu": "Transfering domains was very simple which is not the case with many others."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Helen Cunliffe",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T10:24:08.000Z",
          "Titre": "Excellent help and service with all the…",
          "Contenu": "Excellent help and service with all the information I needed at the time and in a speedy manor - I would highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Henry Makow",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T17:10:33.000Z",
          "Titre": "Attentive care at a fraction of the…",
          "Contenu": "Attentive care at a fraction of the price charged by attorneys."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Yaroslav Ponomarenko",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T14:08:09.000Z",
          "Titre": "Everthing good",
          "Contenu": "Everthing good. Just one think. Can you make a possible to make a payment  for developers from Russia?"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Kanya P.",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T14:42:48.000Z",
          "Titre": "quick response and understand what the…",
          "Contenu": "quick response and understand what the business and solution to make things done"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Anthony Michelutti",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T10:24:49.000Z",
          "Titre": "Marcaria thanks again",
          "Contenu": "Just All Out Excellence Services. Fast in reply's."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oldsoul",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T00:35:05.000Z",
          "Titre": "Everything worked very smoothly (the…",
          "Contenu": "Everything worked very smoothly (the way computerized systems are supposed to but often don't because of ignorant programming)."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Douglas Fuchs",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T15:36:20.000Z",
          "Titre": "Waste no time on feedback which is so…",
          "Contenu": "Waste no time on feedback which is so important in IP law."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dane L. Creger",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T22:39:43.000Z",
          "Titre": "The Support Agent was very Patient with…",
          "Contenu": "The support agent was very patient with me and I appreciate that so much."
        },
        {
          "Note": 5,
          "Lieu": "CD",
          "Pseudo": "Andron Narinsky",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T22:40:15.000Z",
          "Titre": "Professionalism",
          "Contenu": "Everything is good, mostly speed and serious attention to the customer"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Kopi Kenangan",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T04:02:39.000Z",
          "Titre": "marcaria is really supporting my works",
          "Contenu": "marcaria is really supporting my works, great system and also great supporting staff."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "IT Department GFS",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T07:27:50.000Z",
          "Titre": "the experience with purchasing a domain…",
          "Contenu": "the experience with purchasing a domain and get it active was very helpful and easy."
        },
        {
          "Note": 5,
          "Lieu": "LV",
          "Pseudo": "Edvins Puke",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T08:43:37.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Very fast"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "jeffrey B",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T15:53:37.000Z",
          "Titre": "They are very flexibel and take there time",
          "Contenu": "There knowledge is great always have a solution for problems"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Gabriel Popa",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T15:23:00.000Z",
          "Titre": "My review",
          "Contenu": "Good support services. Very high costs for renewal, though!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "vishal patel",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T12:24:33.000Z",
          "Titre": "great experience from support team"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marshall Gluck",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T15:46:17.000Z",
          "Titre": "good  service",
          "Contenu": "good  service, response time, information to answer the  question"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David C",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T01:11:05.000Z",
          "Titre": "Marcaria is way above their competition.",
          "Contenu": "When compared to all other options, Marcaria is way above their competition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gislosan",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T22:46:22.000Z",
          "Titre": "straightforward and fast.",
          "Contenu": "TM registration process was very straightforward and fast. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Waqar Abbas",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T00:09:03.000Z",
          "Titre": "It was a nice experience and easy to…",
          "Contenu": "It was a nice experience and easy to get domain"
        },
        {
          "Note": 5,
          "Lieu": "AM",
          "Pseudo": "Skeletronkeys",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T07:05:28.000Z",
          "Titre": "Usability and support are the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darren",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T14:22:22.000Z",
          "Titre": "My trademark was registered",
          "Contenu": "My trademark was registered, many thanks for your support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Terry",
          "Nb_Reviews": 31,
          "Date": "2023-03-15T16:16:17.000Z",
          "Titre": "Good performance, well organized support.",
          "Contenu": "Updated review. Chat support was very helpful. Domain registrar caused delays. Responsive support."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Silviu Vasile Dumitrescu",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T23:23:24.000Z",
          "Titre": "Good services",
          "Contenu": "Good services, good support."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Alan Duff",
          "Nb_Reviews": 4,
          "Date": "2023-02-16T20:15:30.000Z",
          "Titre": "Second to None",
          "Contenu": "Prompt response. Easy to deal with. Clarity. Everything you could ask for of a business in this age of bots."
        }
      ]
    }
  ]
}