{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "mddhosting.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Markus Bieri",
          "Nb_Reviews": 23,
          "Date": "2023-10-04T08:57:08.000Z",
          "Titre": "poor useless service...it's all about…",
          "Contenu": "poor useless service...it's all about making money...the customers don't matter"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Markus Bieri",
          "Nb_Reviews": 23,
          "Date": "2023-10-04T08:56:51.000Z",
          "Titre": "poor useless service...itpoor useless service...it's all about making money...the customers don't matter's all about…",
          "Contenu": "poor useless service...it's all about making money...the customers don't matter"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Waqar Ahmed",
          "Nb_Reviews": 3,
          "Date": "2022-04-28T01:39:41.305Z",
          "Titre": "Worst Customer Service Experience ever…",
          "Contenu": "Worst Customer Service Experience ever had from this host !Department : SalesHow can we help? : Hi,Why do i have to submit my Government or Credit Card picture ?if you have got this wrong the credit card is registered to the same address which is on my account[22:50] Tomoyo has joined the conversation[22:50] Tomoyo: That is our process for identiy verification.[22:51] Waqar Ahmed: Nope, I don't need to submit those docs not knowing how you handle privacy[22:51] Waqar Ahmed: if this was coming from an IP which is not in the same region where is purchase is made it make sense but no in this case[22:51] Tomoyo: That is your choice.[22:52] Tomoyo: I do wish you luck in purchasing with other providers.[22:52] Waqar Ahmed: Great, this is definitely going on webhostingtalk review.Thanks[22:53] Tomoyo has left the conversation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T08:03:09.000Z",
          "Titre": "Horrible billing",
          "Contenu": "Horrible, wont use cards on file to rebill, wont take new cards just all bad AVOID at all costs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chet Bishop",
          "Nb_Reviews": 3,
          "Date": "2023-12-12T20:01:08.000Z",
          "Titre": "Well Done!",
          "Contenu": "You have consistently met my needs over the years, sometimes on a very personal, “I messed up, can you fix it for me” level, as I am barely computer literate.Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Umar Iftikhar",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T00:07:43.000Z",
          "Titre": "5 years and then some!",
          "Contenu": "Was introduced to MDD over 5 years ago. Started with the cheapest Shared hosting packages I could afford at the time but the stellar customer service and the confidence that MDD will have your back should you screw up, made me stay all these years. Eventually now my business is completely reliant on MDD's services and we only recommend the same to our clients as well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bradley Fischer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T13:55:18.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Always extremely fast responses to any issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corine Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:44:44.000Z",
          "Titre": "Always have a great Experience",
          "Contenu": "Always have a great Experience! Everyone is always quick to help and the issues are resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean, City of Albany",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:37:08.000Z",
          "Titre": "Great support",
          "Contenu": "MDD support provides really fast, helpful assistance. I appreciate all the help they have given us, as we work to spin up a new VPS to replace our self-hosted City website. It's a steep learning curve, but support has been really patient."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "KickBack",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T17:37:50.000Z",
          "Titre": "Very pleased",
          "Contenu": "Have been their customer for around 9 years. Support is consistently super fast and has been for the whole 9 years. I usually get a reply in a couple of minutes (yes... a couple of minutes) which typically solves my problem.Our website is very responsive, the prices are good.The one time (in 9 years...) something bad happened they handled it great, if anything I feel even safer now.We used to use bigger and more famous hosts and it was a constant source of anxiety, as something was always going wrong and support would take days and usually reply with generic nonsense.I mean I know it's a marketing cliche, but whatever: moving to mddhosting did make our hosting experience completely stress free. Can't recommend them enough."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jay M",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:22:26.000Z",
          "Titre": "Amazing Tech Support at MDDHosting",
          "Contenu": "The tech support at MDDHosting is amazing.  They solve complex problems quickly and typically respond within minutes. I have tried many other hosting providers, yet MDDHosting stands out above the rest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T16:48:10.000Z",
          "Titre": "Amazing Experience Always",
          "Contenu": "Amazing company, always give a 5 star review to MDD anywhere I can because they are just that good. I'm happy with the products, hosting, etc. but above all their support and people are super responsive and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert M",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T15:25:21.000Z",
          "Titre": "Support when you need it!",
          "Contenu": "I had a particular problem with my website I was unable to resolve. I contacted Tech support and asked if this was something they could help me with. A work ticket was created and I was contacted by a support tech who quickly addressed the issue and resolved it. I have been with MDD Hosting for several years and they have always been responsive to my needs. I heartily recommend it."
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "steven hermans",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T09:52:31.000Z",
          "Titre": "Been with them for a decade",
          "Contenu": "Been with them for a decade. Great customer support 👍"
        },
        {
          "Note": 5,
          "Lieu": "SI",
          "Pseudo": "Ema P",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T18:16:18.000Z",
          "Titre": "Excellent support",
          "Contenu": "MDDHosting support consistently impresses us when something goes wrong, they are usually able to diagnose and fix it very quickly. They also handle our questions skillfully with the patients. When you have exhausted your options, having a good hosting company to give you advice and help is priceless. Thank you MDDHosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ Burke",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T15:27:46.000Z",
          "Titre": "Been using MDDHosting for years",
          "Contenu": "Been using MDDHosting for years.    Being not tech savvy they have always been top notch.   Always helped me with any issues I had"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet W",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T04:06:53.000Z",
          "Titre": "Awesome service",
          "Contenu": "I have been with MDDHosting for many years and they currently host 4 sites for me. Their service and tech support has been amazing. If I have a problem or question their response is lightening fast and I have never had a question they couldn't solve or answer quickly. Absolutely LOVE these guys. They have been awesome. Looking forward to many more years of service with them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T15:01:01.000Z",
          "Titre": "Truly Amazing",
          "Contenu": "Migrated my website over to MDDHosting and everything went pretty smooth. Had some minor technical issues that related to my new environment to make it more compatible with my website which was resolved within minutes.Overall, the support has been superb and beyond expectations. Their knowledge far exceeds that of my old host provider's support staff. The cloud hosting environment at MDD is truly amazing and their plans are well priced.If you are looking for well-priced secured cloud hosting that runs on LiteSpeed to improve website speeds, a great support staff, server and WAF firewalls to protect your website, a knowledge base to reference to for help, then get MDDHosting because it is for you."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Mikael Sidenius",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T23:19:47.000Z",
          "Titre": "I simply can’t say enough good thing…",
          "Contenu": "I simply can’t say enough good thing about this hosting company.I need help with things which I feel is beyond what I can expect from a hosting company and MDD, the few times I need their help, are always there, and extremely quickly.All the other stuff like uptime, servers running etc is also 100%."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T02:41:49.000Z",
          "Titre": "MDD hosting are the best hosts around",
          "Contenu": "MDD hosting are the best hosts around and their customer support is second to none. I had no experience in web-based stuff and I'm learning little by little, but I wouldn't have gotten anywhere without their help and support. They're always unbelievably helpful, I've never had a question that they haven't been able to answer. Their knowledge genuinely amazes me, as does their response time to queries - they're always extremely quick to answer. I 100% recommend MDD, they're amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Sutton",
          "Nb_Reviews": 3,
          "Date": "2023-06-19T06:14:37.000Z",
          "Titre": "Upgraded a PHP version and had an issue - resolved!",
          "Contenu": "Upgraded a PHP version, and had a server configuration change that affected some code. Wrote a ticket and got a reply within minutes that was very helpful in resolving the issue. Within 15-20 minutes the issue was isolated and a fix generated that worked out great, and improved security for the site. MDD hosting staff has been a great help over the many years I've had websites with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "xoxo",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T22:07:06.000Z",
          "Titre": "Excellent hosting and support",
          "Contenu": "I've done business with MDD for over 7 years now. They always provide support par excellence. Nice guys, never get perturbed or upset by my stupid questions about things that have no relevance to their hosting. Pricing is excellent and they honor it. They always provide solutions for me, whether it's migrating to a new server or changing features. I can't imagine doing business with another host now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PhilD",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T20:09:54.000Z",
          "Titre": "Excellent hosting company",
          "Contenu": "I have been with MDD Hosting a long time and their service is always great. Anytime I needed anything related to my accounts there were right there to help and have even suggested options at times that I hadn't thought about.  They care about their customers and are always quick to answer support/sales tickets."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:22:51.000Z",
          "Titre": "Seven Years with MDDhosting: An Unparalleled Web Hosting Experience",
          "Contenu": "If there's one thing more challenging than launching a website, it's finding a reliable hosting service that stands the test of time. I've been with MDDhosting for over seven years, and it's my absolute pleasure to share my experiences with a company that has not only met but consistently exceeded my expectations.Customer Support: A Beacon of ExcellenceCustomer support can either make or break a web hosting experience, and MDDhosting has set the gold standard. In the rare instances when I've needed assistance, their support team has been nothing short of spectacular - providing quick, knowledgeable, and friendly solutions. It's the assurance that help is a message away that brings immense peace of mind.Uptime and Reliability: The Pillars of TrustMDDhosting promises impressive uptime, and they deliver without fail. My websites have enjoyed near-perfect availability, ensuring that my visitors always have access when they need it. This reliability is the backbone of my online business and one of the primary reasons I remain loyal to MDDhosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Webpro",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T21:04:55.000Z",
          "Titre": "Better than the best",
          "Contenu": "Local business Lightning service always Support unparalleled 10 stars across the board"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Jeroen Toussaint",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T00:12:16.000Z",
          "Titre": "Hands down the best service",
          "Contenu": "I'm already 9 years with MDDHosting and I haven't regretted it a single time. Fast responding to tickets, helpful answers, patient, and reliable hosting. Their service has never changed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T17:58:30.000Z",
          "Titre": "Impressive support",
          "Contenu": "I've hosted many different website projects with MDD Hosting over the years. I have been consistently impressed with their performance and uptime. But more than anything, I know that I can always rely on fast and helpful support from their support team."
        },
        {
          "Note": 5,
          "Lieu": "NI",
          "Pseudo": "Milton C.",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T20:11:05.000Z",
          "Titre": "About my experience with mddhosting",
          "Contenu": "HelloI have been a customer of mddhosting.com for a year and I attest that when I have written a ticket they respond within 5 to 10 minutes on average from Monday to Friday. and if it is Saturday and Sunday the average is about 30 minutes to 60 minutes maximumI like the good uptime of their servers and about the plans, I like the Plaid plans, which are faster than the turbo plan. obviously the turbo plans are with SSD disk and the Plaid plans with nvme diskThe attention of the mddhosting staff is very friendly and patient with those of us who do not know the technical part of web hosting. but very important is that they have answered my questionsI recommend mddhosting, perhaps for some people the plaid plans are not as economical as those of the competition, but the quality of the service, the fast technical support is worth that and much moreMy apologies for my English but it is not my native languagegreetings to all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Albo P Fossa",
          "Nb_Reviews": 2,
          "Date": "2023-01-21T20:11:38.000Z",
          "Titre": "My host for many years. I appreciate mddhosting.",
          "Contenu": "I found mddhosting through favorable comments in webhostingtalk. I won’t mention previous hosts, but I left them many years ago and never look back (except in sadness). I *always* recommend mddhosting to everyone. Superb hosting. Superb support. For many years. I depend on mddhosting for my three sites and two email addresses. I appreciate your help, mddhosting. And I thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChicksHateMe",
          "Nb_Reviews": 19,
          "Date": "2023-04-06T16:50:52.000Z",
          "Titre": "I have dealt with Hosting companies over the years...",
          "Contenu": "I have dealt with domains for MANY years, but it wasn't until I FINALLY found  a GREAT HOST that was truly reliable with wicked fast Responses from Support.  That's MDD Hosting. I won't tell you how many other (cheap) hosts I tried before I found MDD.  The slightly higher fees GREATLY outweigh having to deal with incompatibility issues, downtime and irate customers.  I HIGHLY recommend MDD. You will not be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony M",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T23:52:03.000Z",
          "Titre": "The only web hosting service you'll ever need.",
          "Contenu": "I've been using MDD Hosting for more years than I can remember and I've never had a reason to even consider leaving. Their servers are stable, fast, and easy to configure. But their customer service is what really sets them apart. If I log a support ticket, I'd be shocked if it took them more than 5 minutes to reply. I usually hear back within minutes, and issues always get solved quickly. I hope they never sell their service to a bigger provider, because they are amazing."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Cherlyn Chong",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T02:33:26.000Z",
          "Titre": "So good that I'm reviewing them again!",
          "Contenu": "I don't know if a 2nd review counts, but MDD has helped me SO effectively with so many of my site's WordPress problems that anyone would truly be losing out NOT to sign up with them! Their support is intelligent, prompt, humble, generous and just UNPARALLELED. Their hosting prices are already completely reasonable, but add their support and it's just priceless. Truly grateful for them, and I'll be sticking with them for years to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 7,
          "Date": "2023-07-08T15:53:29.000Z",
          "Titre": "MDD hosting moved over 100 websites for…",
          "Contenu": "MDD hosting moved over 100 websites for me very efficiently and effectively. They worked with me every step of the way to make sure things were working as they should be. My lack of knowledge was not a problem for them because they took over when I did not know how. I really appreciate the service and professionalism I received from MDD hosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Stambaugh",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T01:50:55.000Z",
          "Titre": "MDD Hosting",
          "Contenu": "Always happy with MDD Hosting's quick, thorough, and thoughtful responses via chat. Tomoyo was very helpful in giving me the answers I needed and directing me in the next steps. I have moved five sites away from other hosting companies in the last year (one more to do). Better service, better performance, LOWER cost! You can't beat that combination 👍"
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "Igor",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T12:30:34.000Z",
          "Titre": "I highly recommend MDD",
          "Contenu": "Great hosting company! I've been using MDD's services for a while now, and I must say, I'm very satisfied.Their services are reliable and efficient.Their customer support team is incredibly responsive and knowledgeable, always ready to assist with any inquiries or technical issues. If you're in search of top-notch hosting services, I highly recommend MDD."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Misty",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T07:45:49.000Z",
          "Titre": "Best hosting experience I have ever had",
          "Contenu": "I have been with MDDHosting for nearly a decade (6 years). They are an AMAZING company. The staff are incredibly friendly, helpful, and timely with any support tickets submitted. MDDHosting is the best hosting experience I have ever had and I have been in this industry for 15 years so I have been with numerous others who severely lacked in comparison. I am so happy that I found MDDHosting. My only regret is not finding them sooner as it would of saved me so many headaches & incredibly frustrated situations from the other providers I was with before them.Thank you so very much for all the hard work that you do for your customers, I appreciate you guys so much!! <333"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Olson Rachlin",
          "Nb_Reviews": 4,
          "Date": "2022-06-11T00:02:25.000Z",
          "Titre": "The absolute BEST support!",
          "Contenu": "The absolute BEST support!MDD always goes the extra mile to help with technical issues. With so many WordPress sites hosted there, I'd say that 99.9% of the issues that I run into are not even caused by the server. Most are third-party configuration issues or cockpit error but it doesn't matter. MDD always steps up and gets the issue resolved professionally and quickly. I highly recommend MDD!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jay Moulton",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T18:19:04.000Z",
          "Titre": "Exceptional efforts to quickly solve my login protocol",
          "Contenu": "I could not figure out a login protocol for a site that I use infrequently.  Even though my request did not fit into the standard services provided by web hosting companies, MDDHosting went beyond the call and solved the problem for me, saving me hours of time and I may never have figured out the protocol.  My experience with them the past five years has been outstanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric A",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T02:25:24.000Z",
          "Titre": "Great performance and continuity at MDD",
          "Contenu": "I've been a customer of MDD Hosting for 6+ years. I have a dedicated server with them that is maintained beautifully. There is a old country store vibe to MDD. Every time you go in, the same people greet you at the door. Support is experienced, fast and thorough. Michael, Chris, Tim, Eric etc are always helping me out with errors, installations, random questions etc. The backend is clean and easy. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TL",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T23:55:13.000Z",
          "Titre": "MDD fixed my mail routing error fast!",
          "Contenu": "Had a vexing problem involving mail routing, gmail, and dns hosting somewhere else and MDD hosting me and my domains.Put in a ticket and Chris at MDD had it fixed, told me how he fixed it, and my domain mail began working perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Algora Publishing",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T18:54:59.000Z",
          "Titre": "Both Tim and Chris really extended…",
          "Contenu": "Both Tim and Chris really extended themselves to help with finding the piece of code that Ads by Google inserted in our website. Very, very grateful for their expertise and forthcoming effort.And we are throughly happy to have switched from HostMonster to MDDHosting."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ben A.",
          "Nb_Reviews": 8,
          "Date": "2023-07-20T17:30:49.000Z",
          "Titre": "MDD Hosting, fully recommended",
          "Contenu": "MDD Hosting has been consistently great for many years now. I have had multiple hosting accounts and many domains with them and wouldn't hesitate to recommend them. On the extremely rare occasion I have had to reach out to their support, I have found them to be efficient, professional and a pleasure to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Mohr",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T21:39:16.000Z",
          "Titre": "Site issues and restoration",
          "Contenu": "I accidentally deleted my site when I tried to delete one of the \"duplicate sites\" that didn't actually lead to my site (and gave a rather alarming message instead).  It was late and I figured I'd deal with it in the morning (minor site, didn't expect any traffic).  But I was answered within minutes.  Within minutes I got an answer, my site rolled back, and SitePad contacted on my behalf.  They kept in contact while SitePad looked into the matter and let me know when things were resolved so I could check before the ticket was closed.  Everything is good now!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nueva Vida Media",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T16:50:26.000Z",
          "Titre": "FOUND \"the right one\" - Finally",
          "Contenu": "Tried another company prior but did not go well. MANY issues but with MDD transitioned to them from SITEGROUND mostly for the LiteSpeed features for WordPress. The transition started yesterday and was completed today. ALL 9 sites (3 of which subdomains) I did the email transfers using the tool they recommended (since Siteground is not CPANEL) which went smooth and they even answered a question about that tool. Which after 25 yrs experience at this - usually they do not help. Just started on the hosting but all has gone VERY well. Support is responsive, and handed off tickets when the tech's shift ended. Again in my years - UNHEARD OF!! KUDOS!!!hope it continues.. may do another review 2 years from now. (forgive the pessimism - but...)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phil Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T16:28:22.000Z",
          "Titre": "Top Notch Customer Support",
          "Contenu": "Rock solid hosting and the best customer support of any hosting company I've ever used.  They're always available to help within minutes, always have a clear solution and a way to implement it.  And they do it all with reasonable prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Olson Rachlin",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T22:13:05.000Z",
          "Titre": "MDD Hosting is consistently wonderful",
          "Contenu": "MDD Hosting is consistently wonderful! Michael and his entire team are so knowledgeable, professional, and helpful whenever I need anything. Their hosting services are reliable, fast, and secure. I wouldn't go anywhere else. I highly recommend them!"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Argentina Adventure",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T04:03:38.000Z",
          "Titre": "Repaired our site that had been hacked",
          "Contenu": "We run a small adventure travel business and realized that no one could access our site on the web.  I opened a ticket through MDDHosting's support site and they confirmed we had been infected with malware from not updating the software we used to build the site.  In less than an hour they restored a backup, cleaned up all the malware and even went way above and beyond installing security updates for the software we used for our website.  We were back up and running all thanks to the incredible support staff.   We've been with them for over 10 years and could not be happier with the service they provide"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PRK",
          "Nb_Reviews": 1,
          "Date": "2022-07-31T06:40:17.000Z",
          "Titre": "Affordable & Reliable - The Best Combo",
          "Contenu": "This is a genuine host with quality service. It is not one of those big hosts which don't care for your business. Michael has kept his word every time and I have had a spectacular experience with MDD Hosting. I am typically skeptical of all hosts but MDD has proven to be reliable and trustworthy."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Brendan",
          "Nb_Reviews": 2,
          "Date": "2022-05-18T20:13:04.000Z",
          "Titre": "Best support in the business",
          "Contenu": "I've never dealt with better support ever. They usually respond in 1-2 minutes, almost never more than 5 minutes. Always patient and willing to go the extra mile and educate me in the process. I've been through many hosting companies and there aren't any I trust as much as MDD."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Isao",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T17:27:08.000Z",
          "Titre": "Super online chat support Tim",
          "Contenu": "Online chat support Tim had helped me resolve my questions within minutes and completely, so I could check my billing status and log in to my long-dormant website from scratch. It is rare to have such a satisfying customer support experience. I am so greatful for him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Design Factore",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T02:38:25.000Z",
          "Titre": "Best hosting decision ever...",
          "Contenu": "I've been developing websites for over 20 years and have seen my share of hosting companies come and go. I found MDD years ago after deciding to leave a large provider when they were bought out. I couldn't be happier with my decision. The folks at MDD are easy to work with, committed to helping their customers, and support is fantastic. This is the longest that I've ever been at one host, and I have no plans to change any time soon. I have nearly 100 client sites hosted with them and am consistently happy across the board."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhody",
          "Nb_Reviews": 2,
          "Date": "2022-05-22T12:30:55.000Z",
          "Titre": "Stable service, highly responsive customer service",
          "Contenu": "The service is very stable. In the few times I have needed support, the staff have been incredibly quick and responsive.  Tickets are answered in minutes, not hours.  When they experienced a major problem many years ago, they were very forthcoming with the cause and updates for resolution.  Since then, they have improved, to add additional redundancy.  Measuring how a company deals with a major crisis is just as important as the offerings, price, and performance of the server, in my opinion.  MDD Hosting gets 5 stars all around."
        },
        {
          "Note": 5,
          "Lieu": "TW",
          "Pseudo": "Li Ting Chen",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T17:59:06.000Z",
          "Titre": "Effortless",
          "Contenu": "I've been using MDDHosting 's shared hosting plan for 6 years (and counting). And for 6 years, I haven't heard of/received any problems/complaints from end users, (which was not the case with the previous 2 hosting companies I had used.) MDDHosting is so good I actually forget I have a hosting plan with them!And when I open a ticket, MDDHosting always provides professional, coherent, helpful and fast support, (which again was not the case with previous hosting companies)."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Jesse Skeens",
          "Nb_Reviews": 14,
          "Date": "2023-12-07T00:04:41.000Z",
          "Titre": "Excellent company with super human…",
          "Contenu": "Excellent company with super human response times to emails."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2022-07-17T09:54:10.000Z",
          "Titre": "Michael and the MDD support team are…",
          "Contenu": "Michael and the MDD support team are top notch!The response time is excellent, sometimes within minutes, and they stick with me until the issues are resolved. Even for a relatively non-techie like myself. Some services you have to wait until weekdays or working hours, but these guys are there to help me when I need it most. Thanks MDD team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynwood Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-05-23T23:13:42.000Z",
          "Titre": "I am a several year user and great FAN…",
          "Contenu": "I am a several year user and great FAN of MDD Hosting.   While MDD is touted as the perfect host for web professionals who know the back-end details of domain registration, web hosting, site maintenance and such, some of us occasionally need a helping hand.I have found the tech staff at MDD to be always responsive, always competent, and they repeatedly solve my tech problems in less time than I expect.I highly recommend MDDHosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delwin Holeman",
          "Nb_Reviews": 2,
          "Date": "2023-06-09T17:36:25.000Z",
          "Titre": "Excellent hosting and customer service!",
          "Contenu": "I'm a web developer and needed a new hosting service for over 100 client websites. I was with my previous provider for over 15 years, but had to make a change, due to a sharp price increase. I rely on my hosting provider to be a key partner in the success of my business. I chose Plaid Elastic Reseller hosting from MDD, and the server speed is excellent. They handled the transfer of over 100 websites to the new server in 24 hours. Every question or need that I've had has been taken care of quickly. Ticket response time has always been under 5 minutes.The value of MDD Hosting is far better than WP Engine, so if you're considering one of the bigger providers, I encourage you to check out MDD Hosting. You'll get customer service that directly cares about your business, and probably pay less as well.I'm glad I made the switch and am very happy with my new web hosting provider/partner."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Hugh Moulton",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:56:07.000Z",
          "Titre": "MDDHosting incredibly responsive",
          "Contenu": "MDDHosting support team is always incredibly responsive and quick to identify and implement solutions to any glitches your website might have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francesca C.",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T23:38:05.000Z",
          "Titre": "Great Price & Outstanding Support",
          "Contenu": "I've been hosting with MDD since 2018. They have been wonderful! They have exceptional support that responds in minutes to a support request. They have always gone above and beyond to help me out with any questions or issues. I'm so glad I found them! MDD has that rare combination of great price and outstanding support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Tucker",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T14:19:19.000Z",
          "Titre": "Love MDDHosting!",
          "Contenu": "MDDHosting has given me years of rock-solid hosting, at a very good price. Site response is always snappy. Uptime has been great, aside from the one disaster back in 2018 - they learned a lot from that one! As a former sysadmin, I could feel the cold sweat, even from a time zone away. ;).Support is superb - even tickets for minor stuff get a response within a couple of minutes, and things get resolved quickly. Had a little mystery early this morning, something that could have waited, but it was taken care of almost instantly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KC",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T03:04:44.000Z",
          "Titre": "Reliable service, amazing customer support",
          "Contenu": "Reliable service. I've been through a lot of webhosting companies in the past and but you can't go wrong with MDD (I've since moved all my sites over to them.) Also, they are very customer-oriented, with quick responses if you have any questions. Not that you'll have a lot because their hosting is amazing. Definitely the best one out there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T22:24:53.000Z",
          "Titre": "Great Support, Excellent Customer Service",
          "Contenu": "I've used MDD Hosting for years and have loved the top-notch customer service they have provided from the start.  You get to chat with a real person who is helpful and knowledgable.  I've interacted with several different hosting companies over the years while doing web work for clients, and MDD Hosting stands out for their incredible customer service.  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Cherlyn",
          "Nb_Reviews": 5,
          "Date": "2022-05-31T17:58:53.000Z",
          "Titre": "Crazy Fast Support and They REALLY Care",
          "Contenu": "I've never had an issue that the MDD team didn't do their best to work out with me or resolve entirely. The support team just gets on it, it's crazy! I get replies in MINUTES as opposed to days or hours with other software companies. Their service is just OUTSTANDING. Will be using their services for life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T11:08:17.000Z",
          "Titre": "Excellent response time",
          "Contenu": "I have been with these guys for over a decade, and I’ve never been disappointed. Very responsive. I highly recommend MDD."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "Reignsit Consultltd",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T19:08:08.000Z",
          "Titre": "Great and Reliable Hosting Services, I recommend them to anyone",
          "Contenu": "I have been hosting with MDD Hosting for the past 10years they are very good. Server uptime very great. Good customer service and great support. I will recommend them to anyone who needs a reliable hosting services. please try them, they are very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie Olson Rachlin",
          "Nb_Reviews": 4,
          "Date": "2022-11-08T03:43:41.000Z",
          "Titre": "Stellar Customer Service Every Time!",
          "Contenu": "The team at MDD is consistently fabulous. Tickets are always addressed promptly, professionally, and productively. I appreciate each and every one of them. Today it was Eric who helped me out. Thank you for continuing to provide stellar customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Mohr",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T01:17:34.000Z",
          "Titre": "Initial response to my ticket was…",
          "Contenu": "Initial response to my ticket was within a couple of minutes, as were all responses to my replies.  I don't think I've had better customer service than from this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T13:07:55.000Z",
          "Titre": "Support, Support, Support",
          "Contenu": "SUPER excellent support.  Almost immediate response times.  Very attentive to customers needs, even when the support needed wanders outside the lines of hosting responsibilities.  Even for lower tier customers like me.Small close-knit company based in the US, with support coming from the US.  Oftentimes the owner/president/CEO, Michael Denney himself, responds to support questions.  Don't let the size of the company fool you though, though small, they are extremely expert and professional, yet are able to offer the connected interaction that only a small company can offer.Used for many years (7 or more) with only one incident of interruption, which MDD Hosting was right on top of.At the risk of sounding like I'm over-the-top gushing, MDD is at the top of the list of the top 5 companies of ANY kind that I have dealt with in the last 2 decades, based on customer experience.  That's just how it is."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuart Bran",
          "Nb_Reviews": 1,
          "Date": "2022-07-28T17:55:57.000Z",
          "Titre": "2 chats with Chris K",
          "Contenu": "I have now had 2 chats with Chris K at MDD Hosting. He initially helped walk me through setting up a new account for a client. He stayed very patient with this old dog learning a new trick. Today, he helped set up the email account. I cannot give higher praise for his assistance. Makes me feel very comfortable that I chose the right company, MDD, to do this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Hutter",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T09:35:33.000Z",
          "Titre": "MDD Hosting has always helped me even when it's my fault!",
          "Contenu": "MDD Hosting has always been helpful to me. They're a great group of guys. No matter what you always get what you pay for. The team at MDD has always helped me even when I'm responsible for causing an issue. The bottom line is: I couldn't ask for a better reseller host! I rave about them to anyone who will listen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff",
          "Nb_Reviews": 4,
          "Date": "2022-05-20T20:36:41.000Z",
          "Titre": "I've been very happy with MDD Hosting…",
          "Contenu": "I've been very happy with MDD Hosting for eight years, after my other hosting companies sold out to big conglomerates and blew off their customers.Nothing cookie cutter about MDD Hosting, though.  They provide full-service hosting, personalized customer support, and no wait times.   I've recommended them to a dozen colleagues and remain utterly delighted to use their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelvin OLG",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T18:51:29.000Z",
          "Titre": "always responsive and always on the…",
          "Contenu": "always responsive and always on the ball..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kwesto",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T07:31:07.000Z",
          "Titre": "incredibly fast support - fixed in minutes",
          "Contenu": "I opened a support ticket asking about a fairly complicated redirect situation, and I got TWO answers within 6 minutes. Both addressed my questions, and my issue was resolved almost immediately. I've used a lot of different hosting companies, and MDD is incredibly fast and helpful with support issues every single time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Miller",
          "Nb_Reviews": 2,
          "Date": "2022-08-17T05:55:32.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Whenever I have an issue with my site (and it's never been their fault, except once since 2017), I raise a support case and literally within 1 minute I have a response. That is not an exaggeration."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Itamar B",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T22:53:40.000Z",
          "Titre": "One of the best",
          "Contenu": "I've been with various webhosts over the years. This is the most efficient, user-friendly and value-for-money hosting company I ever had experience with. Been with them for 3 years now and very happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renee Gilroy",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T19:49:32.000Z",
          "Titre": "Amazing customer support!",
          "Contenu": "Amazing customer support!The support team at MDD Hosting is the best I've ever dealt with. They are experts and are always patient and willing to work through any question I throw at them. I can't say enough but I am beyond grateful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher English",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T02:09:18.000Z",
          "Titre": "I've been using MDD for 10+ years at…",
          "Contenu": "I've been using MDD for 10+ years at this point and they are always very quick to respond to tickets. I've never experienced any major downtime and their prices are always competitive. Definitely worth supporting the smaller hosts over the faceless giants."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Samuel Huang",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T09:49:05.000Z",
          "Titre": "Awesome Company.",
          "Contenu": "Been using them for years. Good customer service and pricing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Raynes",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T17:46:32.000Z",
          "Titre": "Hosting and support have been great.",
          "Contenu": "Hosting has been great and support has been great too!  I’ve considered going to their reseller plan, but have not made the switch. Everything is relatively quiet and peaceful. Why upset the system?Keep up the good work and keep watching out for us ( customers).Chris"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T09:57:32.000Z",
          "Titre": "Fast, friendly and complete responses every time.",
          "Contenu": "I had a reasonably straightforward question and Michael D responded so quickly that his response was in my inbox as soon as I had finished logging out and closing down the tabs I was working on.I haven't often had a need to contact MDD, but whenever I have their response has been quick, friendly, professional and complete.Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AlohaBoy",
          "Nb_Reviews": 1,
          "Date": "2022-06-11T22:56:11.000Z",
          "Titre": "MDD Hosting - Amazing Service and Integrity",
          "Contenu": "MDD Hosting's service is always exemplary and quick. They are ready to offer solutions to many issues and take care of problems on their end fast. I cannot recommend them highly enough."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Addin Katz AHK Compnet Service",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T21:15:32.000Z",
          "Titre": "Excellent and prompt technical support…",
          "Contenu": "Excellent and prompt technical support when needed. They have professional techies available who will quickly respond to whatever questions and/or issues you have about their services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chet Bishop",
          "Nb_Reviews": 3,
          "Date": "2022-09-18T17:24:44.000Z",
          "Titre": "Eric responded promptly",
          "Contenu": "Eric responded promptly, even though it was not within normal working hours, and resolved my website issues immediately.You folks have always been very responsive, kind, and helpful.Chet Bishop"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RS",
          "Nb_Reviews": 3,
          "Date": "2022-06-08T22:06:46.000Z",
          "Titre": "Love the support & friendliness of MDDHosting!",
          "Contenu": "I have come to love the support that I get from the team at MMDHosting.  They are available when I need them, and the help has always been given patiently and great detail.They send me links to helpful articles but then always jump right in to look at the issue directly.I recently had Michael help me through an issue.  It turned out it was a plugin's fault, and he was still able to give me a quick (though temporary) fix - until I can get the developer to look at it.I am thrilled with the service and expect to stay with them as my hosting provider for years to come.Thanks, MDDHosting!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal A. Place",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T22:27:54.000Z",
          "Titre": "This company is wonderful (and SO much better than GoDaddy).",
          "Contenu": "This team is the real deal. They REALLY, genuinely care about their customers. I believe they grew through word of mouth because of their excellent service, and I learned of them several years ago through a brilliant coder I trust who also loves them. I've had several sites hosted with them for years, and they've always replied immediately with any issue or question I had. I never thought I would like a hosting provider without phone support, but their support is 100x better than Go Daddy's ever was, and they always respond almost immediately! They are truly the best, and I don't intend to ever take my business elsewhere. They are patient (especially with people like me who aren't super technical and feel a bit stressed when things seem to go awry (often my own user error)), and they are always professional, dependable, and go the extra mile to make sure their customers are really taken care of. I couldn't give a company or team my higher recommendation. Super grateful for them all of these years."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T02:59:17.000Z",
          "Titre": "A very happy MDD client",
          "Contenu": "After moving on from 4 other providers, my agency has been using MDD for our own and client's sites for over 8 years now. Their infrastructure is excellent, but more importantly their customer service is just amazing - always a super fast response, they go the extra mile so things are done properly, very polite communication. I can't recommend the team more highly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "hducwanderer",
          "Nb_Reviews": 2,
          "Date": "2022-05-31T20:20:43.000Z",
          "Titre": "MDD Hosting continues to support extremely well ...",
          "Contenu": "Michael found the solution we needed for account access on a new account tied to another primary. He was extremely helpful and quick to resolve. As always, MDD Hosting has been there when needed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "FL",
          "Nb_Reviews": 13,
          "Date": "2023-06-25T11:35:59.000Z",
          "Titre": "I've been with MDD hosting for years - they're great and the support is amazing",
          "Contenu": "I've been with MDD hosting for years, they are really reliable and well priced.  The best aspect really is the brilliant support. Very quick useful responses from friendly people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "E. Michael Brandt",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T01:38:39.000Z",
          "Titre": "MDDHosting's tech support proved superb…",
          "Contenu": "MDDHosting's tech support proved superb yet again. Quick, correct, helpful and most of all, friendly. I've been on many different hosts over the past two decades, and MDDHosting is at the top of my list."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet W",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T04:03:38.000Z",
          "Titre": "Always super fast tech support and…",
          "Contenu": "Always super fast tech support and willing to answer questions. Just wonderful people to work with."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2023-07-10T19:41:36.000Z",
          "Titre": "Great web hosting and even better support",
          "Contenu": "Great web hosting and even better support. Response time and resolution typically in minutes not hours. Unheard of. Very impressed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RS",
          "Nb_Reviews": 3,
          "Date": "2023-06-27T05:12:28.000Z",
          "Titre": "I love MDDHosting",
          "Contenu": "I love MDDHosting!  The technical support crew is patient, helpful, friendly, and always professional.  I've never had a bad experience when I've needed help on my website."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T00:01:49.000Z",
          "Titre": "mddhosting is: clear and well arranged, affordable, 100% team",
          "Contenu": "mddhosting is:super fastaffordableclear and well arrangedand has a super fast responding team with 100% specialists solving your in AND outside problems and issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Smitty",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T21:50:47.000Z",
          "Titre": "Upgrading service help was awesome!",
          "Contenu": "Tim was super helpful about explaining all the details about upgrading my hosting service. He came up with a great plan and I can still upgrade further if I need to in the future!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Addin Katz",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T02:25:08.000Z",
          "Titre": "MDDHosting is an excellent webhosting service",
          "Contenu": "MDDHosting is always prompt and professional in replying to any questions I have or issues I want to discuss about their services. I use them to host several websites and for email service.I highly recommend them for anyone who is looking for a solid web hosting provider with excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Bob Pit",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T21:43:05.000Z",
          "Titre": "I will never change them",
          "Contenu": "I will never change them.  Never had problems, only positive experiences.  So fast and eager to respond.  Just today they restored my website (although it was my job to do it).  They saved my day!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "FL",
          "Nb_Reviews": 13,
          "Date": "2022-10-06T13:37:06.000Z",
          "Titre": "MDD hosting are the best!",
          "Contenu": "Once again, MDD Hosting resolved my issue within minutes.  They are just brilliant - can't recommend them highly enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Brandi",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T22:33:08.000Z",
          "Titre": "My business just had a rebranding and…",
          "Contenu": "My business just had a rebranding and we needed to change the url of our wordpress site. Michael and team helped me do this at lightening speed. Highly recommended! I am so pleased with MDD - I have been with them for years and will continue to be."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "markus patzer",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T20:56:38.000Z",
          "Titre": "Really this web host provider is worth…This web host is worth five stars!",
          "Contenu": "Really this web host provider is worth five stars !Tast Live chat support and fast ticket support.Easy setup after the order process.Web host is running fast on wordpress.Friendly Live chat guides who can fix your problems- big thanks to guide Tim!Web host wordpress is fast as with ngingx.The fastest web host I ever had.Thank you so much Mddhosting Team !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ralph C",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T15:46:57.000Z",
          "Titre": "Fast, Friendly, Helpful",
          "Contenu": "Extremely fast, friendly, and helpful responses to tickets."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "BikeGremlin",
          "Nb_Reviews": 6,
          "Date": "2022-08-17T18:42:41.000Z",
          "Titre": "Top-class support & service",
          "Contenu": "Competent, stable, reliable and trustworthy company. It's my impression that my websites are in good hands.I'm happy with the service and would recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marley Desilio",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T22:35:05.000Z",
          "Titre": "They're support team is the best in the…",
          "Contenu": "They're support team is the best in the industry. It would take me a full day to write how many times they have helped me. So I'll just say this, if you want unparalleled support + quality services you're in the right place."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Megan Mayzelle",
          "Nb_Reviews": 5,
          "Date": "2022-09-04T19:20:50.000Z",
          "Titre": "My domain and hosting bestie",
          "Contenu": "MDDHosting has been my bestie in navigating the confusing (for me) world of domain ownership, hosting, etc. They respond to all of my questions even on the weekend with thorough, educational, and kind replies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Lamprey",
          "Nb_Reviews": 1,
          "Date": "2022-08-15T22:32:19.000Z",
          "Titre": "First-rate technical help along with seamless hosting.",
          "Contenu": "MDDHosting has been my web host for over ten years. I'm a website designer, and most of my clients have taken my advice and opted for MDD as well. I get no kickbacks for the recommendations. I just want my clients to have the same excellent experience I've had.Recently I had a problem installing some credit-card processing software. I'm good at following instructions, but something wasn't working. I had help from a tech at the software company, and we worked on it for most of a week. Finally the tech mentioned in passing that it could be a server problem. So I opened a ticket with MDD and asked them if the server might be blocking the processing. No, the problem turned out to be that I had missed something in the original software installation. The tech guy didn't find it, but somehow Michael, the main guy at MDD, was able to trace that error and FIX IT! Took him about 10 minutes.As usual, the response to the initial ticket came in under a minute. (By the way, you can often get instant help with chat, but this case was complicated enough that I wanted to present full details.)I've had nothing but excellent service for my entire time with MDD. In my business I hear many scare stories about hosts. I can only be thankful I found MDD when I did."
        }
      ]
    }
  ]
}