{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "meater.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "SK",
          "Pseudo": "Eva Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:36:49.000Z",
          "Titre": "Very slow despatch, nothing happening after 2 weeks from ordering",
          "Contenu": "Very slow service. Product ordered well before Christmas and after 2 weeks it still wasn’t despatched. Customer service is slow in responding. They said there are some issues in the warehouse but after a week of chasing it, still nothing. All they say is they understand my frustration. That’s not helpful at all as this is a Christmas present. I am very disappointed with the whole service. You should work on better customer service where a solution is found."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Tom Cullen",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:24:32.000Z",
          "Titre": "Very slow to dispatch",
          "Contenu": "Very slow to dispatch. Supposed to be next day dispatch and then 1-2 day delivery. Followed up after 8 days and it still wasn't dispatched. There was a problem in the warehouse, but minimal info given. I ended up cancelling the order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon Burrell",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T15:10:25.000Z",
          "Titre": "Utterly useless",
          "Contenu": "Ordered a week ago, but still not despatched.Contacted customer support but no response.Clearly not able to fulfil orders at this time - AVOID.Edit after receiving response below fromMeater…- my email to customer services from several days ago remains unanswered (interesting that Meater are prioritising responding to Trustpilot reviews over customer service emails 🤔)- tracking information still not available…So I’m not sure I entirely believe the response to be truthful…"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Paul McEvoy",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:34:12.000Z",
          "Titre": "8 days and order still not dispatched",
          "Contenu": "Ordered on 11th Dec and still not dispatched. On ordered it states 1-2 days. Contacted customer service and was told DHL are to blame because they couldn't print labels. Still no update on order on website. Seems like a con to get orders in for stock they don't have."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:32:26.000Z",
          "Titre": "My meter stopped working contacted…",
          "Contenu": "My meter stopped working contacted customer service because the temperatures were not reading correctly, ambient or internal and after information back-and-forth he finally sent me this message.email. Thom | Senior Customer Happiness Agent (Apption Labs)Nov 30, 2023, 10:30 AM GMTHi Richard,Thanks for getting back to me! Thank you for the information. Unfortunately, these over-temperature events on your probe void the warranty. If you'd like to purchase new probes I'd be happy to send you an invoice for $59.00 total (a 50% saving on the MSRP). If that sounds OK please let me know and I'll get the invoice right over to you! Take care and stay safe and I hope to hear from you soon. Kind regards,ThomCan’t afford spending any more money I got these for a present they were expensive so I guess they don’t stand behind their product when you have a flareup and they make them go bad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sanford",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T17:26:56.000Z",
          "Titre": "Do not buy this product",
          "Contenu": "Ever since I bought this product, I have trouble setting it up you go on their website and you get computer-generated responses which do not answer your questions and answers generic questions. Then two of my probes broke, and they told me that it was not under warranty even though it's only a couple of months old because they said my grill was too hot and void my warranty, and I could buy two more. This was a very expensive item, and there are others out there that at work just as well if not better do not buy this."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Lars Bom",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T18:16:14.000Z",
          "Titre": "Price/durability mismatch",
          "Contenu": "After a maximum of 5 times of use the base unit started to drain the battery and now despite fresh battery and green check light the probe will not charge. The probe is clean with no food left on connecting surfaces.The Bluetooth connection has been somewhat challenging like other reviews😕"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Pete Cox",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T07:29:30.000Z",
          "Titre": "Extremely low durability",
          "Contenu": "Extremely low durability. After only a few uses I pulled the probe out of a piece of meat and the top section came off. Hadnt pulled it hard at all. The max temp is 275 degrees C, this is ridulously low and impractical as from time to time something will happen to make it go over that temp. I   wrote to meater to complain and they asked questions including my login to the app, they then used this info to decline a replacement by saying it had a voided warranty as it had been over temp after stringing me along with a bunch of other questions. Product is entirely impractical to use even when used in reasonable and normal manner. Stick to more robust solutions such as Webber, I replaced the useless meater with another Webber, I had the previous Webber probe for 8 years. Meater is a terrible product terrible warranty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:01:50.000Z",
          "Titre": "I bought the 4 pack",
          "Contenu": "I bought the 4 pack.  Unfortunately the MEATER doesn’t read/work thru 1/4 inch steel smokers.  This is of no use to me.  For sale cheap.  Respond and we can workOut a deal.  Or MEATER can refund me.  I now us a Vicken temp prob.  It’s nice."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ben F.",
          "Nb_Reviews": 8,
          "Date": "2023-10-30T19:01:19.000Z",
          "Titre": "Bad Experience",
          "Contenu": "The black tip will fail after a certain amount of time and if you are out of the 2-year warranty they will try and charge you £55 for a new probe. I have only used it 5 or 6 times in my home oven and it has already broken. I find this disappointing and is likely a common issue. Its a shame they only backup their product for 2 years and wont offer a greater discount when the product goes wrong."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T15:07:08.000Z",
          "Titre": "Never worked - shocking customer service",
          "Contenu": "Received this as a Christmas gift in 2022 and it has never worked.  I have been speaking with customer service for 6+ months, completing all of the troubleshooting tasks requested.  Nothing has worked.  I have been asked for a receipt on numerous occasions, but I have advised on each occasion that this was a gift and I do not have the receipt.  It is now considered as \"resolved\" and the email case closed when I was offered a 10% discount off a future purchase.  This is absolutely ridiculous.  It has never worked.  It should be replaced.  I wouldn't even mind sending the Meater Plus in to be tested by experts, but nothing.  My son in law's £20 thermometer works over mine!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alan Firman",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T18:33:47.000Z",
          "Titre": "Do not buy from this company",
          "Contenu": "Do not buy from this company. I purchased a MEATER plus in January, used a few times  and it came apart then stopped working. I tried to get some help with this issue and had initial bot reply like all the other people on here, then nothing .Tried several times to contact MEATER with no response whatsoever, joke company, luckily bought through Amazon and they have kindly agreed to give me a refund, otherwise £110 would have been wasted on an item not fit for purpose ."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "ade",
          "Nb_Reviews": 8,
          "Date": "2023-08-08T02:36:27.000Z",
          "Titre": "The app is not supported any more for…",
          "Contenu": "The app is not supported any more for my mobile so $199 wasted. other issues; it demands I turn on location, why does it need gps location? Blutooth sure, that's ok but location?I tried to pick the app from an old phone that still works but it does not show up anywhere. Somehow the app is hidden, Why? All other apps I can find.So an odd business that uses your location, hides itself in the mobile and cant be updated."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ian Boyle",
          "Nb_Reviews": 13,
          "Date": "2023-05-12T15:08:05.000Z",
          "Titre": "Avoid this company at all costs",
          "Contenu": "A great item when it works. If yours dies like mine did after 4 uses, then expect zero customer service from MEATER. Read all the poor reviews here and it’s one universal complaint- they just do not respond to email support - which is a real problem given they only have that as an option.Awful company - look elsewhere"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "April Uhlmeyer",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T01:46:09.000Z",
          "Titre": "SAVE YOUR MONEY AND FRUSTRSTION",
          "Contenu": "We have great wifi and bluetooth. LOST CONNECTION anytime you close the oven door or the grill cover.  I put the charging box and phone as close to the probe as possible without cooking the phone or the box. Save your money and all the frustration. This was a gift from our son.  This occurs on both apple and android phones."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Hula",
          "Nb_Reviews": 16,
          "Date": "2023-05-27T16:00:01.000Z",
          "Titre": "When it works great ; otherwise avoid …",
          "Contenu": "When it works great !Mine now does random things - alarm goes off for over temperature when it isn’t . Last time I used it the cooking estimate time was 30 minutes ( which from experience is correct ) . At the 25 minute point it said 1 hour ! - meat would have been inedible if I had done that .Worst of all support ranges from poor to non existent. Emails go unresponded too frequently . So much so that I don’t use the MEATER probe anymore .Manual probe MUCH more reliable and requires no “ technical support “ ."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "roberto battello",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T13:11:13.000Z",
          "Titre": "Surgical precision BBQing, VERY DISAPPOINTING STURDINESS",
          "Contenu": "The timing and cook temperature was spot on! The result with the rotisserie chicken was THE juiciest chicken I've EVER tasted. There's NO WAY you can come close to this level of perfect cooking without the MEATER probes.A MUST for any serious BBQer!------------------------------------MY REVIEW UPDATE....While the temperature accuracy is impressive, the sturdiness of the probes is below average. On the third cook (rotisserie chicken), cook temperature of 260F, once the cook was done I pulled out the probe and the ancient temperature bit (the black numbered side of the probe) detached from the rest of the probe. Since I've only owned the MEATER block for only three weeks, it doesn't bode well for long term use, considering the original cost of the item. After contacting APPTION LABS, they have issued a ticket but have yet to address the issue. So for these reasons, I will now NOT recommend the MEATER probes. There are now other brands of there, all of which would be a consideration."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Friedo Bandito",
          "Nb_Reviews": 3,
          "Date": "2023-03-11T18:02:40.000Z",
          "Titre": "I join the many other meater customers…",
          "Contenu": "I join the many other meater customers who have found the product to be useless for grilling. The ambient temps of a basic gas fired barbecue trigger the alerts warning of pending damage to the sensors. Clearly, the maximum temperature design point was way to low. So, don’t waste your money. Just get a regular digital meat thermometer and probe your food on the grill from time to time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William D Ousley",
          "Nb_Reviews": 11,
          "Date": "2023-02-17T19:25:05.000Z",
          "Titre": "Meater is great in theory but lacking…",
          "Contenu": "Meater is great in theory but lacking when grilling over an open flame.There is advertisements that show cooking over open flames but the ambient temp errors out and the meater stops working at 525 and locks up the app.Can't stray far with phone or charging box it will loose its connection.I have email from support indicating to use reverse sear method with the meaterThe company will not reimburse me for my worthless product"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Dylan Cawte",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T20:28:39.000Z",
          "Titre": "Device broke in a few months",
          "Contenu": "Device broke in a few months. Service team have said too bad, buy a new one and claim the temperature has been exceeded.The product wasn't used outside the guidelines, this has been assumed by you based on erroneous data. I will not be purchasing another product."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Maisie",
          "Nb_Reviews": 7,
          "Date": "2023-03-29T15:58:04.000Z",
          "Titre": "Is this a scam?",
          "Contenu": "Purchased a month ago - nothing has arrived and no follow up. Made enquiries after one week, as suggested on the website. Got an automated response on how to use my product - which I don’t have. Messaged you on Facebook and got another automated response. All I want to know is when my product will arriveI can't seem to reply so updating with the information to get a response. Order name: Jennifer McDowell"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Demanding old git",
          "Nb_Reviews": 13,
          "Date": "2022-11-24T09:44:31.000Z",
          "Titre": "Awful accuracy",
          "Contenu": "Awful accuracy, annoyingly temperamental losing connection often, overpriced compared to other better solutions.Avoid, save your money.Here we go…… trustpilot and a company trying to bully a non 5 star review off the platform. Who knew only top rated opinions count on here?!I have responded so let’s see how long it takes for this to be unfairly removed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Chris Goncalves",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T23:22:25.000Z",
          "Titre": "Shambolic customer service",
          "Contenu": "Shocking customer service, my Meater thermometer just stopped connecting one day, i followed all the steps that had been advised and then reached out, a week or so later a reply, then...Nothing! another week or so later an email requesting images and clarity on a couple of things, email sent. now, nothing! I've had an ongoing, unresolved issue now for months that still hasn't been fully acknowledged"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Raza Zahur",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T14:33:33.000Z",
          "Titre": "Faulty probe, worse technical support",
          "Contenu": "Like many others here, my meater stopped working less than a year after purchasing. I have been engaged in a back and forth with the support team where after each email they disappear for two weeks. Summer season is quickly passing by and I’ve had to purchase an alternate cheaper thermometer but am still hoping for a replacement if the support team can follow through. Posting here as I see some responses from company reps so maybe this post will move them along."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Cronin",
          "Nb_Reviews": 2,
          "Date": "2021-09-26T22:45:00.000Z",
          "Titre": "They Do not stand by their warranty",
          "Contenu": "They Do not stand by their warranty. Here’s another frustrating part (Connection Lost……worked great for 3 months)file:///var/mobile/Library/SMS/Attachments/00/00/CE134812-0368-4416-A9F3-65DB6A1A9CBB/Screenshot%202021-09-26%20at%204.14.43%20PM.jpeg"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rheanna Ruiz",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T18:31:49.000Z",
          "Titre": "I placed an order for oven mitts and a…",
          "Contenu": "I placed an order for oven mitts and a second thermometer. Order charged my bank the merchant is paid they shipped my items via FedEx and they say they were to be delivered FedEx stated they got an email from the shipper requesting the items be returned to them. So I emailed Meater and get a stupid return that my product is out for delivery they never even looked into the issue now I’m out of 125.00 or so and a product worst damn company I have ever purchased from"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "David Duncan",
          "Nb_Reviews": 36,
          "Date": "2023-04-10T13:33:13.000Z",
          "Titre": "Had high hopes but ......",
          "Contenu": "Had high hopes but the first try was useless. Lost connection after 2 minutes so pulled from the oven and reset it - connected. Back in the oven but then no updating of the data. No proper temperatures, only time since started. When food is in the oven it is not the best time to try resetting devices. Restarted my phone and surprisingly got connection but the new temperatures remained static and lost the time from start. I think I have wasted my money on this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea Killoran",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T18:58:54.000Z",
          "Titre": "Customer service poor",
          "Contenu": "Customer service poor. Ordered this product in November and still waiting for this to arrive. The only solution offered was they could try to ship a similar product - not the one I originally ordered but it probably won’t get here for Christmas. No refund, no discount “happiness agent” didn’t make this customer  happy. I will be sharing this experience with everyone. Including my 23k followers on Tik tok"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robyn",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T17:52:29.000Z",
          "Titre": "Run by thieves - scam! Avoid!",
          "Contenu": "Run by thieves. Huge scam. Customer Service is a joke. I wanted to return a product - had to go through PayPal & they finally replied. Arranged collection of the product (have proof) & still not received my refund. I've chased them numerous times & heard nothing. I definitely wouldn't recommend them. Avoid at all costs (otherwise it will no doubt cost you!)Because there is no way of replying to your reply - pls see my one of many ticket numbers 172317"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don Lackey",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T21:37:49.000Z",
          "Titre": "Meater - Mis Shipped Products",
          "Contenu": "I ordered a Meater 4 probe block ( roughly $275) for a  Christmas gift but I received a single probe (roughly $65). I box was delivered without any paperwork, no packing list (I think they shipped me someone else's order). I went to their support website but there is no way to correct a mis-shipment or to contact anyone to get this corrected. I sent an Email but no one replies. I tried calling their office in California and no one answers, just recorded messages saying to use their web support (that has proven to be worthless). I feel like they have stolen my money. VERY BAD accountability and recourse for the customer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kent Rider",
          "Nb_Reviews": 5,
          "Date": "2023-05-10T19:56:31.000Z",
          "Titre": "The worst company I have ever dealt…",
          "Contenu": "The worst company I have ever dealt with. I purchased a MEATER Plus last September. Since 3 months in, if I listen to the cooking times suggested by the probe it will overcook/burn food. I reached out to MEATER, however they were adamant this was a user error. A couple months later, the probe now refuses to connect to the hub even when they are within 0.5m of each other. Once again I reached out to MEATER, who have decided this time to shut down my raised case without any contact with myself. I would strongly advise to purchase another product, I have had nothing but trouble with mine."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "ade",
          "Nb_Reviews": 8,
          "Date": "2023-08-17T23:20:07.000Z",
          "Titre": "After requesting a copy of App",
          "Contenu": "After requesting a copy of the version of the app that worked in 2022, they said Quote; “you would have to upgrade your phone, meaning you would have to buy a new phone that has the capability to use the app”My reply; “So I paid $199 for a meater plus, then not longafter you changed the download so that the app no longer works on my phoneand you are saying I should spend more cash to buy a new phone.”They would not offer the older version of the app so I could keep using after I rebooted the mobile. I see on Amazon and AliExpress same thing for a ¼ the cost and their apps work fine. Will see if consumer affairs can help as seems a breach of the Consumer Guarantees Act.  There is supposed to be a 2 year warranty, at least the do respond but I’m out $200 plus $50 to buy a replacement from other company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbie B",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T10:36:45.000Z",
          "Titre": "My 74 year old husband lasts longer!!!!!!!!!",
          "Contenu": "Have been trying to contact meater about this defective product for multiple weeks now, received automated response, replied with requested photos, sent another message after a week of no response and have yet to hear back. Product lasted a couple months and no longer works like with many other reviewers.."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Terry Coughlan",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T00:33:39.000Z",
          "Titre": "This device is worse than useless",
          "Contenu": "This device is worse than useless. A, waste of money. It consistently undercooked the meat. It always has some problem with either the connection or the battery or the software.I would NOT recommend it. Buy a simple analogue meat thermometer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug Williams",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:40:08.000Z",
          "Titre": "Non-existent actual customer support.",
          "Contenu": "As is the case with many other reviews, I am greatly dissapointed in the lack of customer service with Meater. I opened up a ticket with Meater online regarding my SECOND unit that failed.  I did get one Bot generated response and I performed all of the tasks including pictures and promptly sent them the information. That was late April.  I have followed up with 2-3 emails but Meater simply will not respond at all.  In these days of social media, I find it astonishing that this company's customer  support is so lacking.  Also, I always find it troubling when there is no phone number to make actual person to person contact.  Of note, I bought a different unit called \"TempSpike\" that is the same set up and so far works just fine AND is less expensive. Still, I would really like to salvage the Meater probes I have so I have functioning units and not just big fat toothpicks."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark painter",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T19:27:20.000Z",
          "Titre": "Your equipment is 100% but why…",
          "Contenu": "Your equipment is 100% but why ooooohhhhh why can’t you make a block out of cherry wood then I would by 1 straight away come on meter make cherry block"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "NIcolle",
          "Nb_Reviews": 3,
          "Date": "2021-11-30T16:22:24.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "I ordered the meater block and this failed to get to me VIA delivery, I have contacted MEATER 3 times to get this resolved and no one has contacted me back, seems to be a lack of empathy as the blame gets put straight onto the courier, I understand that the courier has not managed to deliver the item however the company providing the product should be assisting customers and putting their minds at ease! Not only am I without what I ordered I am also the full amount of the item down. No mention of a refund.Would never order this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Bleifus",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T23:31:57.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Initially my thermometer worked great. Less than 6 months and it came apart. I contacted Meater and got a prompt reply. After emailing back and forth I was told I couldn't get it replaced under warranty because I couldn't provide proof of purchase.(I received it as a gift). I was told i could purchase another probe.I told the customer service person I was disappointed in the quality of the product considering the price. After that I never heard back. I got the proof of purchase information from the person I received the gift from and forwarded it them and still have no response. I even opened another case with all the information they requested and still no answers. Case# 248073, 248478."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anthony Dickie",
          "Nb_Reviews": 8,
          "Date": "2023-04-30T15:29:24.000Z",
          "Titre": "Lose connection",
          "Contenu": "Unfortunately my experience with the meater probe is the same as all the other comments, lose connection as soon as the oven door is closed, I get the message to move the probe closer , my phone would melt in the oven as the phone is next to the oven..I did leave a review with the meater directly.."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon Organ",
          "Nb_Reviews": 3,
          "Date": "2023-02-01T17:11:38.000Z",
          "Titre": "Further to the review below. I’ve now been contacted by MEATER saying they will provide a replacement which I look forward to receiving. The MEATER…only lasted for 18 'cooks'",
          "Contenu": "The MEATER, when it works is excellent…BUT, after only 18 times I’ve used it, it stopped connecting to my phone or I pad…I contacted ‘Support' who suggested that it needed properly cleaned, and I took all the appropriate actions, several times, but to no avail. Eventually, I was asked to provide proof of purchase so they could replace it… BUT… that was the last I’ve heard…so far… two weeks have passed and I’ve contacted 'Support' a further two times… all I’ve been told is that they need to escalate the matter to the management.This is an expensive piece of equipment and I expect it to last longer than 18 'cooks' and also that they should respond quicker when it fails. Come on MEATER… don’t let your customers down please"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T03:08:50.000Z",
          "Titre": "If I could give 0 stars I would",
          "Contenu": "If I could give 0 stars I would. The absolute worst customer service with no reply.I order 2 x meaters at $200 each on January 31, 2022. Advertised as delivery within 2 days in Australia. It has now been over 3 weeks and after 5 emails and a Facebook post on Meaters page, I still have not heard anything from them."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Pat Salter",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T09:42:03.000Z",
          "Titre": "terrible support - will be contacting consumer affairs",
          "Contenu": "Tried for over a month to get my meater+ replaced as it was faulty and still under warranty. lodged multiple email s and no response in over a month of trying from meater+ - will follow this up with consumer law.Update on this - meater now contacted me and resolved the issue. Thanks for getting through."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ron L",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T22:35:16.000Z",
          "Titre": "Probe quality is poor, only exceeded by the god awful Meator support. Poor equipment quality but better than their service",
          "Contenu": "Had the meater block bought for me for xmas 2021. Initially 1 of 4 probes rarely connected, and when it did connect, it dropped off frequently/for long periods of time, so it was/is essentially useless. Now... as of Mar 12, another probe will not monitor internal temps.... it stays at 68F perpetually. I did the Meator test process in hot/cold water but no change to the temp.... 68F. Have sent Meator support 2 emails, and all I've got back is .... \"experiencing delays, thx for your patience\". This device was not cheap, but a serious quality issue, now backed up by atrocious service. And looking at the warranty info, IF they get back to me, it's my warranty responsibility/cost to get the equipment delivered to them as no mention of local service providers.Disgraceful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Holly Glordan",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T05:33:04.000Z",
          "Titre": "We can’t get any response except an…",
          "Contenu": "We can’t get any response except an automated trouble shooting bot.  Then I get an email that our ticket was closed.  No real person.  No real customer service at all.  The product worked just a few times, then stopped staying connected to our phones during cooking.  Totally not worth it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Rutten",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T00:55:03.000Z",
          "Titre": "Received as gift",
          "Contenu": "Received as gift, so can not return so stuck with it.  Neat gadget but my Weber is twice the unit.When the inside of grill is to hot..  big butt red screen...  WARNING WARNING.... have to pull it or break it.  Need to over cook per probe thermometer is just no accurate.   Application is hard to use need to set up cloud account to use.  Always buzzing telling you something that is not important."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Liz H",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T06:14:44.000Z",
          "Titre": "So disappointed!!!",
          "Contenu": "I've had my Meater for a week now. It hasn't worked since day no. 1!! 7 days later the Block still isn't charged!! And yes, I've removed the tabs from the batteries and even changed the batteries!! The only \"customer support\" I've received is to go through all the problem solving on their website none of which helped. I've sent 3 emails as there is no phone number. I'm so disappointed, as this item had good reviews on YouTube and they are very expensive!! This company shouldn't be in business. Does anybody have any suggestions? I'm wondering about Consumer Affairs or Choice Magazine. Word needs to get out there so others don't make the sane mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T12:59:05.000Z",
          "Titre": "Horrible service for a not reliable product",
          "Contenu": "Received a thermometer as a gift. Used only a hand full of times and within those times maybe half the time did it actually work. Finally went to use it and it just stopped working completely. Still had warranty so I reached out to meater. 3 times. Over the course of several weeks. Never heard anything back. Still haven’t. And now I’m sitting here with an expensive paper weight and nothing to do about it. Could have been a great product if they got their quality control and customer service up a little."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Robbie",
          "Nb_Reviews": 1,
          "Date": "2022-02-06T22:38:07.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service, purchased as a present for my dad for Christmas on 13th of December. Still hasn't arrived so I emailed their support team which is where they are supposedly meant to sort out any issue. I was told they will work to sort out my ticket but theres a queue and if I replied to their email that i would get sent too the back of it. It's been a month and they haven't reached my ticket. Personally worst online shopping experience ever will be looking to take action against them not even excited about receiving the product anymore and just want my money back as I have reason to believe its just a cheap inferior product which has been rebranded and marked up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T15:22:43.000Z",
          "Titre": "Failed right before one year warranty",
          "Contenu": "Failed right before one year warranty. Customer service is a ticket based online system and has been unresponsive for a few weeks. Afraid warranty will be up before anyone ever gets around to replying!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MAJOG",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T18:07:25.000Z",
          "Titre": "Useless for grilling.",
          "Contenu": "I got this product as a present for Xmas from my wife.  We were both excited as we had watched a cooking show that uses this.  While it is ok for smoking meat or cooking indoors it is totally useless for grilling.  Most people know that wood, charcoal, and even gas grills cook at well over the 575 degree limit of the product.  My gas grill cooks at 700 degrees.  My wife pointed out that she often cooks roasts in the oven that start at 575 degrees and later get reduced.  This product probably works well for anyone cooking below 500 degrees but for over that it will likely not work (gets high heat alert) or break the probe."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "GC",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T10:03:01.000Z",
          "Titre": "Terrible service",
          "Contenu": "Terrible service - stay away…..Initially worked fine then at the beginning of a cook the probe disconnected and despite numerous efforts will no longer connect. I have been contacting Meater since November who refuse to replace the probe despite being under warranty. Incredibly poor service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Guest",
          "Nb_Reviews": 18,
          "Date": "2022-08-01T17:33:40.000Z",
          "Titre": "Only used it twice",
          "Contenu": "Only used it twice. First time the ambient sensor was about 30degC out. Contacted support and they sent me an enormous email with all sorts of analytical data on it.Second time was yesterday. Cooking a small beef joint at 160dgC for ~ 55 mins. In that time my mechanical temp indicator in the oven said, as expected 160degC. The Meater probe said 141degC consistently.On completion of cooking, the Meater probe said 41degC. I used my old digital device to test the joint. I tried it in various places on the joint and it consistently returned temperatures of around 60 - 62degC. The probe still said 41degC.!!!!!My opinion is it is rubbish. I have contacted support with these figures, but still to get a reply.My preference is a refund, I have no confidence in the thing at all."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "KIM",
          "Nb_Reviews": 3,
          "Date": "2022-08-10T21:37:24.000Z",
          "Titre": "Ordered the ‘Block’ on 31 January- have…",
          "Contenu": "Ordered the ‘Block’ on 31 January- have enquires 3 times as to progress of order and just get the ridiculous automated reply - for a $450 purchase that I have not received and am unable to enquire about this is the WORST customer service EVER!I want my money back NOWUPDATE: STILL NO RESOLUTION -Still no refund or receipt of product. Put in dispute with my credit card and Meater apparently suggested that it was sent even though I have emails from them showing it was NOT ….I WANT A REFUND OF MY MONEY WHICH YOU HAVE HAD SINCE JANUARY- Shame on you."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2021-12-17T17:05:19.000Z",
          "Titre": "Do not order direct",
          "Contenu": "Do not order direct. When something goes wrong with delivery the email address you are given to tell them about it is a no reply address that gives an automated response telling you to go to their website. When go to their website, they tell you to contact the courier. The courier tells you to contact the seller. It's a jolly circus and I may as well have just thrown £250 out the window."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Morgan Beverly Newton",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T22:47:41.000Z",
          "Titre": "NO TRACKING AND NO CUSTOMER SERVICE",
          "Contenu": "I ordered 4 Meaters for Christmas presents and was sent tracking information showing the label was created on 12/1 but there was never a package shipped out and I have not received anything. There is NO CUSTOMER SERVICE NUMBER TO CALL so I have no way to get in touch with them. The support email address is not a real email address, I got an automatic response saying that my email was not delivered because the inbox doesn't accept messages. So, I have no Christmas presents and no one to contact about it."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jerry Reed",
          "Nb_Reviews": 4,
          "Date": "2023-05-04T09:30:44.000Z",
          "Titre": "Shocking after-sales service from Meater.",
          "Contenu": "I have been trying to get a response from Meater for 2-weeks now. My experience like most is I received the instant company BOT response but nothing since. I also experience the connectivity and cook info drop-out issues but have managed to improve these somewhat. My primary issue is I have damaged two of my probes during a cook on 22.04.23. This may be my fault if I over-heated the probes during the reverse sear but if so, I just need to know this, and how I can replace the probes to keep BBQ-ing with them. Lets face it, the device is a bit of a gizmo and not necessary for successful BBQ-ing but we all like to use it and it can impress people with the results. As were a group of my friends who attended this BBQ but they saw the damage to the probes and are aware of, and not impressed by my struggles to resolve this with Meater. So at present, 1 disgruntled customer and 5 dubious potential customers. Given the cost, the service is shocking."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Leigh",
          "Nb_Reviews": 3,
          "Date": "2022-12-07T01:14:28.000Z",
          "Titre": "Not a good product and dreadful customer service.",
          "Contenu": "The MEATER probe works at up to 10m BUT when you put it in the oven or air fryer it only works at a distance of about 1m.  My MEATER broke over 2 months ago and this company is a nightmare to try and contact and get a response from.  They have finally sent me a replacement, but only the probe, when I had returned the entire unit to them.  Have received no response when I emailed them to try and sort out. Worst customer service of any company I have had to deal with."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andy Thompson",
          "Nb_Reviews": 3,
          "Date": "2022-01-10T23:40:13.000Z",
          "Titre": "Awful customer service",
          "Contenu": "Awful customer service that doesn't understand consumer rights.I purchased a Meater+ direct in November 21. It has consistently given to high a reading, saying temperature has been reached when it has not.After experiencing undercooked chicken 4 times I followed the procedure on their support page which confirmed the issue. I submitted a support ticket with the test findings. Now they want me to retest, and so it goes round in circles.I have now had to open a PayPal dispute to try and reclaim my money.Seriously, stay away, they are blindingly obvious in their attempts to dodge their responsibilities in warranty."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chris Hillyer",
          "Nb_Reviews": 3,
          "Date": "2022-02-10T14:29:39.000Z",
          "Titre": "Hugely disappointed in the customer…",
          "Contenu": "Hugely disappointed in the customer service. The second time i used mine it would connect. I went through all their support suggestions and still doesn't work. After 10 days I have still not received a response from their customer service site"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-11-01T20:10:39.000Z",
          "Titre": "Got the meater + as a gift from my…",
          "Contenu": "Got the meater + as a gift from my employer they gave a bunch out. Unfortunately it's garbage keeps disconnecting. Won't pair anymore. Had phone charger and probe within a foot of each other still wouldn't work. So glad I didn't pay for it. Feel bad for my company though. Seems I'm not the only one that said screw it and just going back to a regular thermometer. Looks nice but that's about it.Thanks for the reply but already through it away. Everything was within 2 feet of each other. As soon as you close lid looses signal. More of a hassle using than just cooking and sticking a thermometer in it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Hart",
          "Nb_Reviews": 3,
          "Date": "2022-10-04T00:28:36.000Z",
          "Titre": "There is literally no customer support",
          "Contenu": "There is literally no customer support. There isn't a number to call, or a human to reach. This $300 piece of crap worked great - twice. Now it lost the internet connection-no big deal,and is stuck in pairing mode.I want a refund."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Charlotte Levitt",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T12:38:43.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "I'm trying to get a refund for this product since days! Already, the fact that you can't get a return label easily on their website is absurd. I had to filled up a return request online, then waited for an automated response telling me they will get back to me, then a guy ask me if he can help me with the product (even though I filled up a form and he perfectly knows I want a return), then they asked me for a picture of the product (W*F?) and now they are saying they need to escalate my request to a senior team and will get back to me ! Seriously ? How many emails and people is it gonna take to send me a freaking return label ? This is a joke !"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jose",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T14:12:13.000Z",
          "Titre": "Parcel wasn't delivered, no options for redelivery",
          "Contenu": "Parcel wasn't delivered by DPD. They 'missed me' for delivery even though I was home and I have a concierge in the building.I contacted both Meater and DPD to arrange re-delivery but there were no suitable options:(1) Meater customer support attributed responsibility to DPD and wouldn't offer a solution for redelivery within a week.(2) DPD won't re-deliver the product and would place the responsibility with Meater. Their only option is to pick it up from a specific post office, which is unsuitable because:2.1 Doesn't have appropriate opening times given that I have a full-time job2.2 It's close to home but not to the place where I work (and where I actually am Mon-Fri during business hours, which is when the post office opens)Terrible service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Karlovitch",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T17:22:44.000Z",
          "Titre": "Our product keeps dropping signal in…",
          "Contenu": "Our product keeps dropping signal in spite of a strong internet connection. Zero customer service. I have been trying to return them since Christmas. After several emails / text messages I get a reply that they have high demand and it may take some time for someone to contact me. Meanwhile the return is 30 days from date of purchase yet you can’t get in touch with anyone for weeks and longer as I am still waiting, this was also a Christmas gift. They also say you can only return if it’s unopened and unused. How do you know it doesn’t work if you haven’t opened it ?  Do not purchase this product as the company does not stand behind it if there is a problem. I hope I can help save others from wasting a lot of money on a faulty product. Shame on meater for such poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "LS Eaves",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T16:21:17.000Z",
          "Titre": "no response from Meater, they don't care",
          "Contenu": "Purchased a Meater plus, has always struggled to connect, now will not connect at all, tried to contact Meater, you can't call them, emailed 4 times, no response, they just don't care"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Chris Hillyer",
          "Nb_Reviews": 3,
          "Date": "2022-02-15T21:59:39.000Z",
          "Titre": "Still useless. Customer service…",
          "Contenu": "So after almost a month and apparently some prompting from a bad review from me. The customer support came back and said restart the probe and make sure it is charged. The same as it says on the website….. not helpful MEATER ."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gggggg",
          "Nb_Reviews": 3,
          "Date": "2022-10-30T20:46:32.000Z",
          "Titre": "PLEASE DO NOT BUY THIS",
          "Contenu": "Single handedly the worst purchase of my life. This is now my second unit and this one has a whole new set of issues.My 1st could hardly connect to the probes from 0.3m away. Had to get a new unit. Now this one stays on for 10 mins then just decides to go to sleep and cuts out. Batteries are brand new.Im so disappointed in this as it was so expensive for the block. And as previous reviews state there is practically 0 customer service. I had to wait over 3 months to get someone to contact me.Honestly an absolute peice of **** and the whole service / experience ruins every time i try to cook on the bbq."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michael Carey",
          "Nb_Reviews": 6,
          "Date": "2022-08-29T02:59:14.000Z",
          "Titre": "So So dissappointed with product and robot only customer service",
          "Contenu": "I purchased Meater+wireless meat thermomter-long range on Amazon. Upon my first use I set the temp at 125 F internal for a joint of beef. When the reading reached ready i.e 125 the meat was hugely over cooked. To check I tested with another thermometer which read 142 F so clealy the MEATER+ was not calibrated correctly and as a result I had a grossly over cooked joint of meat and a faulty product. I followed very carefully all the instructions and I am a very experienced cook. I made contact directly with MEATER + in the USA and all I got was a robot response no human contact whatsoever and my issue was never resolved. Unfortnutely at the same time my wife's father passed away and we lost important time and the ability to return via Amazon within the 30 day time frame. We tried to resolve the issue with Amazon but once again we were in the robotic world that Meater+ lives in. It is abosolutley unaccceptable that a company makes itself non contactable to answer and respond to very professional questions and in this case a legitimate complaint. Clearly a huge risk if one buys this product."
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "Jorn Verhaegen",
          "Nb_Reviews": 4,
          "Date": "2023-06-11T10:51:56.000Z",
          "Titre": "Ordered 3 weeks ago, no delivery",
          "Contenu": "Ordered 3 weeks ago, nothing received yet. Contacted customer support twice already, no reaction. Feels like a scam."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Margaret Reedy",
          "Nb_Reviews": 10,
          "Date": "2023-02-04T21:49:33.000Z",
          "Titre": "Shocking Customer Service",
          "Contenu": "I am disgusted by the service from Meater - we have a faulty unit which has never worked properly.  I contacted Meater early this year (Support Ticket ID 243972).  All started well with the emails going back and forth and me being asked to perform various tests on the unit which all concluded there was a problem with the temperature.  When the Customer Support had exhausted all other options he advised that the matter would need to be escalated to management.  That’s where the customer support stops.  Despite chasing up with him (Levi) several times as to where it’s at after hearing nothing for over a week, he hasn’t bothered answering my emails at all so I generated a new contact.  No answer from that either.  Clearly our unit is faulty and no one wants to know about it.  Our unit is in brand new condition, having only been used a handful of times and it’s never worked - what is going on with your supposed 2 year warranty????  Beware buying from this company, they are happy to take your money but just don’t want to know when there’s an issue."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Fede",
          "Nb_Reviews": 13,
          "Date": "2023-02-08T16:52:12.000Z",
          "Titre": "Useless device and appalling customer service...",
          "Contenu": "Device not working, indicates unrealistically low temperatures and suggests excessive cooking times which have ruined a few nice cuts of meat. Reached out to the customer service multiple times a few months ago, no response for quite some time and when they finally replied (after chasing them for days on facebook and twitter), no solution was offered. Gave up on it and left it in a cupboard until a friend bought one recently and was very happy. We compared the 2 devices and ours indicated 25 extra mins of cooking time (same cut, same conditions with the 2 probes to compare), confirming the device is faulty. Useless device and appalling customer service...Serial number: 21C08ACM1M003284Order number: UK86648161037SP- - -Edit further to Meater response on TrustpilorIndeed, I have re-opened a case yesterday given that the 2 previous ones from almost a year ago did not bring a satisfactory outcome.Thanks for assuming I'm an idiot and explaining that a thinner part of a meat cut will cook faster than a thicker part. (We obviously compared what's comparable, placing the probes at the center of the same cut). Hopefully this time the customer service can replace the device, in which case I'll update the review with I hope a higher mark."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rob Mac",
          "Nb_Reviews": 5,
          "Date": "2022-06-29T00:27:34.000Z",
          "Titre": "Failed miserably with poor customer…",
          "Contenu": "Failed miserably with poor customer support, also very buggy device that also could of had rechargeable deck and not a battery one, very hard to get it working, so binned my device and pulled out cheap chinese smart probe that I had for a few years now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce  Reed",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T00:40:42.000Z",
          "Titre": "I can't get ahold of anyone",
          "Contenu": "I can't get ahold of anyone. I have a replacement meater that stopped after the 3td or 4th time.Love the technology but not the customer service.Bruce 325 513 6038"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T19:20:52.000Z",
          "Titre": "My meater worked for 3 BBQs and now…",
          "Contenu": "My meater worked for 3 BBQs and now does not work. Changed battery and still no green light. Emailed the company twice and did not hear back and no other way to contact them. That is really poor service. Looked on the internet and found a he number of the lab that makes MEATER and called. They quickly and kindly fixed the problem. MEATER is now owned by Traeger."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon Bicknell",
          "Nb_Reviews": 7,
          "Date": "2022-09-18T19:00:24.000Z",
          "Titre": "Upgraded to the Meater + as was…",
          "Contenu": "Upgraded to the Meater + as was struggling with signal not more than 3m away - same distance away from the smoker and still keep getting \"connection lost\" - the supposed claimed 50m range is rubbish!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Camillec",
          "Nb_Reviews": 4,
          "Date": "2023-06-28T16:50:56.000Z",
          "Titre": "Very very poor customer service - no response since 17 days",
          "Contenu": "I am so disappointed with the customer support. On 09.06.23 I ordered per accident (I wanted to wait till I can talk to my husband about it). Immediately I tried to cancel the order. The “button” function wasn’t working. It said that I have to try later again or get in touch with the customer support. I did both and never got a response. I tried to cancel it till 12.06.23 - then I got a shipping confirmation. I wrote countless e- Mails and tried to reach out multiple times on the “contact form”. It was delivered by 13.06.23. Till today I tried to get in touch with them on a daily basis. I want to return the delivery. However, I am not willing to pay the costs. It’s been 17 days that I didn’t get any response on my E-Mails or messages on the contact form. It is really a shame, I heard that the products are good. But something like this never happened to me before. The took the money immediately and didn’t give me any option to cancel my order. Very very poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Normand Savard",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T02:28:29.000Z",
          "Titre": "Ordered and pay on December 5 for",
          "Contenu": "Ordered and pay on December 5 for Quebec Canada. Still not shipped even if they give me a UPS tracking #Poor service- no feedbak - not recommended"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kenny tyler",
          "Nb_Reviews": 8,
          "Date": "2022-11-22T14:41:33.000Z",
          "Titre": "What a waste of money",
          "Contenu": "What a waste of money, wont connect, either Wi-Fi or Blue Tooth cant launch the temperature probe at all, all i get is a demand to connect to the MEATER cloud , cant update even though network Wi-Fi is strong, utter waste of ALOT OF MONEY"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Danny Dove",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T08:50:38.000Z",
          "Titre": "Awful! BUY ANYTHING ELSE!",
          "Contenu": "Awful! It connected once and took 20 minutes to connect the 2nd time and now it won't connect at all.ABSOLUTE WASTE OF MONEY! so angry as its expensive and I spent the money for a decent product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alden Lukasik",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T15:57:15.000Z",
          "Titre": "Received defective product, Meater refuses to uphold their own warranty",
          "Contenu": "Since I have bought the probe, it has been reading the wrong internal and ambient temperature. On top of this, while using it, the probe itself completely fell apart. It seems very clear given my experience that I received a defective product. I reached out to Meater’s support team to see if they would uphold their warranty and of course, they have not. They said that I have exceeded the maximum temperature on the probe which caused it to break which is not true since the temperature that the probe has been reading has been inaccurate since day one. I have double checked the temperatures with another probe and it has been way off. Additionally, Meater support has said that I am outside of the one year warranty period.. which I am not. I have NOT had this probe for longer than a year. A real disappointment but I am not surprised given other customer’s experiences. They offered to send me a replacement probe at my own cost but given my experience with their customer support and fake warranty offered, I will likely be using another product and I do not want to send this company anymore of my money since they have no intent of fulfilling their own warranty. If you’re looking for a wireless probe, please do yourself a favor and find another company that actually cares about its consumers instead of this one."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick Salter",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T13:16:42.000Z",
          "Titre": "Bought the meater block",
          "Contenu": "Bought the meater block, one of the probes is faulty unable to speak to anyone and the support team do not respond to their emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Gejeian",
          "Nb_Reviews": 2,
          "Date": "2021-11-03T03:45:03.000Z",
          "Titre": "Shady Company",
          "Contenu": "Was excited about this product, until I got mine and it doesn't work.  I have the Meater Block.  My friend who loves his came over and confirmed that mine is defective. I've attempted to contact them 7 times.  No luck. Not call back. No replies. Shady company.  Stay away."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Siobhan",
          "Nb_Reviews": 3,
          "Date": "2021-10-04T21:56:08.000Z",
          "Titre": "Very difficult to contact the company",
          "Contenu": "Very difficult to contact the company. I am waiting over three weeks for my order and have had no update. There is no where on their website to contact someone about this."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nick lidington",
          "Nb_Reviews": 5,
          "Date": "2023-02-12T21:46:58.000Z",
          "Titre": "MEATER - Such a waste of time",
          "Contenu": "Such a waste of time. The probe does not connect the charger. When it does the range is about 3 ft. Then the charger does not connect to the phone. Again the range is about 5 ftIt’s back in the drawer now to stay there. Great idea but I now spend my time cooking not wrestling with technology. I have no idea how those wanting use it with Alexa will get on"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Scott Wykes",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T22:54:17.000Z",
          "Titre": "You need an account to use the product",
          "Contenu": "You need an account to use the product. Why in the world would they need an account to be set up to use the device. Threw the thing out today! Never really worked all that well anyway.Just Recieved a reply from meater. Tone deaf! I don't care to keep a record of my cooks. It's passed it's warranty period so setting up an account still has no point. You need to use the product the way they want you to use it, but not how you want to use it! It's been thrown out anyway. Don't buy a meater!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chuck Collins",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T18:50:26.000Z",
          "Titre": "Customer Service is Non-Existent  Updated 7/15/22",
          "Contenu": "Update:  7/15/2022.  I did get a response today, and an authorization to return for an exchange.  I do appreciate that.  I understand in today's world, things are hectic.  My only suggestion to Meater is to at least communicate to customers that you are working on it, and it may take X number of days, or even X number of weeks before you may hear back.  I'm good with that.  What I don't like is feeling ignored and hopeless.  Thank you for your help, and I'm hoping the replacement is as good as I hear it is.Received my Meater for a Father's Day gift, and it would not connect.  I tried every trouble shooting article on Meaters website to no avail.  I did send in a customer service request email.  2 days later, I received an email back with a cut and paste from their website of all the things I've already done.Since then, I responded, left 5 different emails stating I still have issues, and not even a response.I have since been able to use it twice, but that requires me to unpair the meater, turn off my Bluetooth, take out the probe from the block, open the app, turn on Bluetooth and wait for it to once again pair to my device.  There has to be an easier way, but I will never know as my questions are ignored by Meater.I want to be able to like this thermometer, I like the premise behind it, but with ZERO customer support, I'm not sure it's worth the money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Roisin MacDonagh",
          "Nb_Reviews": 6,
          "Date": "2023-03-17T14:14:11.000Z",
          "Titre": "Meater customer service awful!",
          "Contenu": "Meater stopped working, I followed all troubleshooting directions on their site before getting in touch. There followed endless questions, tests, photos sent, further questions, more photos. Now referred to senior team. Just deal with your customer..stop hedging and prevaricating and wasting time. What a customer fail!Update 5 March 2023. I’ve been sent a replacement probe, but it’s the charging unit that’s at fault. Also what I’ve been sent is a regular Meater when my faulty item is the more expensive Meater Plus. Again, I’m without the item I paid for and have experienced utterly haphazard customer service. This is just a dreadful way to respond to a faulty item. Very disappointing, I’ll be taking further action.Further Update 8th March. Replacement probe will not communicate with original base unit - Meater just replaced probe, not base unit. They now want me to book a service call with them. I have already gone through the issues many times. It is beyond frustrating to have this protracted process to sort out a problem where replacement of full unit is required.Update 17 March 2023 It’s taken 34 communications to finally get to the point where I MIGHT have a replacement Meater on the way to replace my 8 month old Meater which just stopped working. To be fair, Daniel, who took on the case about 3 weeks ago, has tried to get me a new meater quickly and I got a complimentary pair of gloves about a week ago, but the Meater itself is still a no show. It’s not a stock issue, it’s a systems and operations issue, made worse by Meater’s refusal to act promptly and appropriately  to deal with the initial issue. Would I buy a Meater again? Not unless there was a very evident improvement in their after sales service, not withstanding Daniels valiant attempts..their technology and processes hampered him in sorting this out"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kyle Cheresna",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T22:57:26.000Z",
          "Titre": "Worked well for the first 6 months and…",
          "Contenu": "Worked well for the first 6 months and the past couple of cooks nothing but connection issues"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ian Palmer",
          "Nb_Reviews": 3,
          "Date": "2023-01-19T11:17:02.000Z",
          "Titre": "Failed on the big day",
          "Contenu": "MEATER Failed on the big dayI am giving the MEATER + one star as when I needed it on Christmas day it failed badly and I had to resort to using another meat probe. Good PointsWhen it works its very good. Been using for 3 months in 3 different ovens. You get to find out how good the ovens are or not. You see what temperature the oven actually reaches and the temperature fluctuation. Everything I have cooked with, mainly meat roasts and fish have come out perfect every time in each of the different ovens, that is a big plus for me.Bad Points10th time using the MEATER; Cooking Christmas dinner; a Four Bird roast, around cooking halfway  it failed to connect.  I tried many times to reconnect but it would not. And as of now it will not connect. A product costing £100 used 10 times over 3 months failing is poor. It has always been hand washed, the probe always in the meat at the required notch, and the battery is full, tested with green light confirming on base station.Other IssuesSome of my cooks that are saved have wrong temperatures for the peak and target, they are way off, and I can see no logical reason for the error; one says Peak 58C and Target 77C which is mathematically impossible. All the Peak temperatures are incorrect. They have a serious software issue. MEATER claim the probe is water resistant with this in mind I have always avoided getting wet when cleaning and I dry the probe immediately. However, I feel this is unrealistic and that the probe should have been made waterproof. MEATER claim the plus has a range of 50 meters. I seriously doubt this claim, in the real world through walls. Marketing Emails: Be prepared for a lot of them! You can unsubscribe which is what I did, but it was ridiculous the amount I was getting, around every other day. Also, the app has offers most of the time: \"free oven mitt\" is usually there, again annoying, they would be better spending time improving the app rather than aggressive marketing.I would not recommend you buy this product as it is not reliable.UPDATE JAN 19th 2023I reinstalled the app and the MEATER+ worked again. However, this lasted three times before it failed again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Trevor Trickynuts",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T22:01:47.000Z",
          "Titre": "Times are way off",
          "Contenu": "Times are way off. Shocking for something so expensive"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Stiofan O Dalaigh",
          "Nb_Reviews": 12,
          "Date": "2022-11-16T18:34:40.000Z",
          "Titre": "Was a bit temperamental from the start…",
          "Contenu": "Was a bit temperamental from the start , managed two cooks , but now refuses to connect to the probe , so it’s rendered useless, really annoyed, it’s an expensive product , and thought by spending the extra money I would get a good product, I’m looking for a replacement or my money back"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr S",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T14:08:11.000Z",
          "Titre": "I’m on my second and it is hopelessly…",
          "Contenu": "I’m on my second and it is hopelessly unreliable.   Real shame because it is a great product when it works.  But it doesn’t"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Peuser",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T23:34:30.000Z",
          "Titre": "Failed after one year",
          "Contenu": "Failed after one year. Don’t waste your money. They were unwilling to replace it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T12:49:34.000Z",
          "Titre": "Somehow MEATER knows what I cook and…",
          "Contenu": "Somehow MEATER knows what I cook and when. Who do they share this with? Why do they need to know? Where is my privacy?"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Herbie",
          "Nb_Reviews": 4,
          "Date": "2021-11-03T02:55:59.000Z",
          "Titre": "Disappointed with this product and Customer Service",
          "Contenu": "I have been very disappointed with the MEATER+ product and the service received throughout my transaction with MEATER. To be explicit, I have just recently received a part refund (my outlay minus postage and a 15% re-stocking fee). However it was only after a repeated and concerted effort to underscore my concerns about this product in several follow up emails.In short, if you plan to use this product in a baking tray in your oven I would caution you about the product's efficacy. The material of the tray and for that matter, ovens in general are, in my opinion, crucial as to whether it is likely to work or not. Many people use a tray to keep a moist and uniform environment to roast the meat. The MEATER site lists several ovens or roasting devices which they say are compatible but don't specifically warn you about the use of a roasting tray. I note that there are several people who have had connectivity issues between the probe and the repeater even in the approved devices. So I simply say that the problem is likely to be part of a phenomena known as the \"Faraday Effect\". This is what I said to the MEATER Customer Service people in my initial communication of complaint of which there were several frustrating follow ups.\"HiI have purchased a new Meater+ for my partner's birthday. We've also downloaded the latest update to the Android app. Batteries are fresh. Probe fully charged as per instructions etc etc.The issue is that the probe is losing connectivity with the Repeater Unit when it's place in a FULLY enclosed metal baking tray. I've isolated the variables involved in placing the probe out of the oven, in the oven on its own in the tray etc etc etc.... I've observed all the max distances between the various components. It functions OK in the oven without the metal dish.I'm a physicist and can understand why there's little or no signal with a tray involved. Effectively the metal dish acts as Faraday Cage. For a simple understanding of this phenomena - see here in case your techos are unaware of this Look up Faraday Cage on Wiki or some such]. This phenomena is used in every day situations in commerce and industry to shield devices from stray or aberrant electro-magnetic (EM) radiation.Thus ... the low power electro-magnetic (EM) energy from the probe is absorbed by the metal shell of the tray. In addition, you must appreciate that the probe is also place in a hostile environment in terms of the material ovens are made of. That is, they are also a Faraday Cage. The glass door of the oven may be the only relief available for transmission.Surely this is a major design flaw. Many people use a metal tray to maintain a consistent environment to cook the meat. It maintains moisture in the meat, speeds cooking and keeps the oven walls much cleaner.Clearly we could change the cookware etc and experiment with RF (radio- frequency) transparent materials etc. But this is both expensive and has an uncertain outcome. Even some porcelain and clay cookware have metal oxides in them which interferes with RF transmission.\"Clearly the ordinary individual does not know how RF opaque their oven is and some are more opaque than others due to their construction. Thickness of the metal used and how much surrounds the tray is at issue. I think the CONCEPT is a good idea but the execution is problematic. I simply sound this out as a warning to those considering buying this device and I think this is a fair and reasonable undertaking so you don't waste your time and money and end up with a disappointed recipient of your kind thoughts if it's a gift for them."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ian B",
          "Nb_Reviews": 26,
          "Date": "2022-01-30T20:38:27.000Z",
          "Titre": "Absolute rubbish customer service",
          "Contenu": "Absolute rubbish customer service, they take the £ & run, don't buy!"
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Peder Jensen",
          "Nb_Reviews": 8,
          "Date": "2021-07-28T21:58:33.000Z",
          "Titre": "You never know, when it's going to work and when it's not",
          "Contenu": "Idea is great and when it works, it's really good.However, more than 25% of the time, it's been impossible for me to connect to the probe. Even using the app on several different devices, the problem persists. Sometimes, a restart of the cell phone will help, but most often it wont't. Just impossible to get it connected, even thoug it's rigth next to the phone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jack R",
          "Nb_Reviews": 31,
          "Date": "2021-07-04T11:18:12.000Z",
          "Titre": "Stopped working the 3rd time I used it",
          "Contenu": "Stopped working the 3rd time I used it. In the middle of a slow cook for 8 people, food was completely ruined as I was trusting this thing to work.The app is low quality and constantly bombards you with ads and invites to their website/to buy more of their products - not really cool when I paid for the hardware.Am going to buy a meatstick, hopefully that will last more than 2.5 cooks."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alex Jones",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T12:16:16.000Z",
          "Titre": "Cancelled my order",
          "Contenu": "Cancelled my order, the morning after making it. Having recieved a cancellation confirmation email, i thought it was all sorted. However five days later the Meater block arrived and my credit card was charged. I put in a submission to their customer service department with no reply and also had someone from their social media ask me for my order number, but then stop replying. As also stated on here, premium prices and pretty awful customer service"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shane Anthony Errington",
          "Nb_Reviews": 1,
          "Date": "2021-02-15T11:59:59.000Z",
          "Titre": "No customer service",
          "Contenu": "No customer service. I ordered a dual probe pack & received the package the next day, only to find that they have only sent one probe out.I have now raised 2 tickets with Meater, contacted them through Facebook & Twitter & have had no response what so ever.Happy to charge a premium price for a supposed premium service, but Meater doesn't even offer a response. Absolute joke."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Almha McCaul",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T22:17:08.000Z",
          "Titre": "Poor customer service, disappointing",
          "Contenu": "Writing this on behalf of my father. He made a purchase on 10th December. Items have still not been despatched. The website had said it would be despatched between 1-2 working days. Contacted customer service but cannot get through. Just given a ticket number. These were going to be Christmas presents, but it doesn’t look likely now. Very disappointed. I’m just hoping that writing this review might help resolve the issue."
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "ade",
          "Nb_Reviews": 8,
          "Date": "2023-08-30T00:15:17.000Z",
          "Titre": "I purchased in 2022",
          "Contenu": "I purchased in 2022, sometime between then and a couple of months ago Meater withdrew support for under android 8. So anyone that reboots their mobile will find the app available on playstore non functional. Meater offered 10% off a new Meater in compensation (then I'd have outlayed $400+ and still not have a working unit), then 30% refund then 100% refund. I will take up the 100% refund as soon as the one I ordered for $55 off Aliexpress arrives and I can confirm it works OK. To be fair I will post a full review on the much cheaper Chinese unit. I dont see why Meater cant put the 'older' version of the app back on playstore so all customers with pre android 8 past and present can have a working unit.I gave an extra star as Meater do respond to customers."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Young Mark",
          "Nb_Reviews": 7,
          "Date": "2023-07-23T20:29:42.000Z",
          "Titre": "Such a shame when something goes wrong",
          "Contenu": "The meater has worked great for just over a year but now it no longer registers an internal temperature. We love the meater but when something goes wrong and it's nearly impossible to contact the manufacturer regarding warranty it leaves a stain on the experience. Such a shame."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andrew Porter",
          "Nb_Reviews": 5,
          "Date": "2023-04-17T17:30:37.000Z",
          "Titre": "Emperor's new clothes.",
          "Contenu": "The app takes ages to calculate an estimated cooking time which makes it much harder to co-ordinate the meat with other dishes. It still produced an over cooked topside, but just meant the other dishes were also past there best. For me it made the cooking more stressfull. I regretted my purchase, but i was pleased that i was covered by a 30day return policy. Thank you for contacting me so quickly."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Bret Podgorzec",
          "Nb_Reviews": 14,
          "Date": "2023-05-21T07:54:43.000Z",
          "Titre": "Product is great BUT",
          "Contenu": "Product is great! Until it broke after just 5 cooks. The probe has (what I believe is) the actual thermometer inside it and is fixed very poorly so the black top bit becomes detached from the silver probe. After this happened to mine I found out it’s quite common. Customer service so far is none existent. Been over a week with only automated responses, no expectation of when I should hear back and no way to contact anyone else, just need to wait I guess.It’s a real shame the build quality is poor as the product is good, just let down by this issue"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ross Wolbers",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T11:56:24.000Z",
          "Titre": "The meater block was frustrating at the…",
          "Contenu": "The meater block was frustrating at the start but mainly due to lack of experience from me in its use. Was working reasonably well but less than a year in it is in constant pairing mode have cleaned the probes and the base plates and still will not leave the pairing screen damn frustrating. Bought this after our experience at last Christmas trying to cook the ham, Turkey and Rest beef and Pork.Not working and Christmas on its way again very disappointing for the money paid for it to last less than 10 months"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Peter Burt",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T02:08:57.000Z",
          "Titre": "Bad service",
          "Contenu": "Product is ok but the service is terrible. It stopped working only 12 months after purchase and the only way to get help is to take a phone call between 12 am to 5 am. Why sell a product in Australia if you don't help with service during Australian business hours?"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Allison Waterson",
          "Nb_Reviews": 2,
          "Date": "2022-08-29T22:29:42.000Z",
          "Titre": "Have emailed them 3 times as there is…",
          "Contenu": "Have emailed them 3 times as there is no other way of contacting them…very very frustrating. I purchased this very expensive product 2 weeks ago as a Father’s Day gift and it hasn’t even been shipped!!! No way of making actual contact with them, so now I’ll have no gift for Father’s Day. How on earth am I supposed to request a refund now given no one actually gets back to you….very disappointing for such an expensive product."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tim Matthews",
          "Nb_Reviews": 7,
          "Date": "2022-03-04T20:08:34.000Z",
          "Titre": "It’s okay 4/10 and expensive.",
          "Contenu": "It’s okay, I think the software is flawed however. My two work, and provide a helpful record for a pro requiring notes. My issue is that it doesn’t seem to compensate for increasing temperature after it’s removed from heat, it seems like a software issue but I was told I’m wrong…. So I would advise ignore the projected time for cooking and remove way sooner (or cook to a considerably lower temp). The resting time will increase exponentially to allow the food to return to the required temperature."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Rik",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T09:23:37.000Z",
          "Titre": "No supply in the Netherlands",
          "Contenu": "Is there any supply coming to the Netherlands?I would have gotten the meater+ through a local reseller as a Christmas present. Unfortunately, delivery would take a little longer.It is now March and I still haven't received confirmation on a delivery.They haven't been in stock anywhere in my area for the past 4/5 months either. It looks like there is a huge supply problem?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Marcel Blackbird",
          "Nb_Reviews": 3,
          "Date": "2023-02-23T18:59:51.000Z",
          "Titre": "It's a pointless product really …",
          "Contenu": "It's a pointless product really unless you're souvee then sear. Cant be used for smoking (1hr plus cooking) as you cant move away without disconnect. Cant use on grill as cant handle searing temps. Useless for pretty much all circumstances."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Russ Botwin",
          "Nb_Reviews": 2,
          "Date": "2022-02-19T20:32:38.000Z",
          "Titre": "Worked ok at first and downhill since.",
          "Contenu": "The concept it great which is why I gave it two stars. Unfortunately, the product declines in performance quickly. Received the Meater Plus for Father's Day 2021 and the first 10 times I used it, it would connect maybe 7 times. Since then, I've tried another 10-15 times, and it's connected once. Changed the battery (the block always shows it as being charged), had the base right next to the probe and deleted and reinstalled the app and nothing was able to get it to connect again. Tried to contact them twice through the website since they don't have a number to call and never heard back. Don't waste your money on this one."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Hugo Fitzgerald",
          "Nb_Reviews": 2,
          "Date": "2022-08-25T19:04:07.000Z",
          "Titre": "I believe the product could be really…",
          "Contenu": "I believe the product could be really good, mine continually drops the connection tried everything to resolve.Help desk experience is very painful and not helpful.Very disappointed on an expensive item."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Bobbin Wobbin",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T01:39:09.000Z",
          "Titre": "Get used to losing connection",
          "Contenu": "Get used to losing connection. The things a nightmare. When it works, it's good but you'll CONSTANTLY lose connection, even eith the range extender, even being within eye line of it. Don't buy this garbage. Had problems with it since i got it in April 2021"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Matthew",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T08:02:14.000Z",
          "Titre": "Excellent product when functioning",
          "Contenu": "Excellent product when functioning, but only worked for 1.5 hours. Support ticket raised, but no one is talking to me, up just auto replies. It’s been a week and a half with nothing and tried a couple of different ways to contact. I don’t like to leave a poor review like this public, but it seems to be the only way to get a response?"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ian 'Dav' Davies",
          "Nb_Reviews": 12,
          "Date": "2023-07-30T20:41:09.000Z",
          "Titre": "Meater signal",
          "Contenu": "Bought 2 of these to use with oven and BBQ. Very, very expensive, but wouldn't have been a problem if they worked.......They just don't work. The signal is ridiculously poor. I have a tablet hooked over the door of the oven and signal is too weak. When I place it in BBQ with hood closed, the signal is too weak. App great. Product incredibly poor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Thibodeau",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T14:08:43.000Z",
          "Titre": "Meater Block with 4 probes",
          "Contenu": "I purchased the Meater Block with 4 probes. Generally it works but for the following issues.1: The block has to be very close to the smoker.2: The block is constantly saying there is a loss communication even when it's less than 2 ft away from smoker.3: The block is not weather proof so if it starts raining this forces me to move it to a covered spot which is not near the smoker.4: The support response time is very slow. It took 18 days to get a reply.  They wanted me to create a video and send it.5: Mostly their repsonse are infering that I'm not doing something correctly.I'm sorry but my opion is that for the cost of this product, I shouldn't need to do much but turn it on and cook."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "KI",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T04:56:36.000Z",
          "Titre": "False advertising and terrible service.",
          "Contenu": "Have only used the meater once so far and it did a pretty good job. However the company as a whole is terrible. It was advertised as a Father’s Day special showing next day dispatch in Australia. Placed the order waited a week and no tracking info. I emailed them only to be advised they didn’t actually have any in stock but I should see tracking the following week. I asked if they knew when as they following week was Father’s Day and they replied advising they didn’t know when they would be back in stock. So I asked for a refund. 4 days with no reply so I opened a dispute with PayPal. I then got a reply from them saying the order was being cancelled and I would get the refund in a couple of days. Refund never came. However the meater did show up. So I guess that’s a win? Meanwhile I had spent more money on a new present thinking the order was cancelled. I guess Christmas is sorted.Certainly wouldn’t purchase through them again unless you like false advertising and being lied to."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Tim Clarke",
          "Nb_Reviews": 3,
          "Date": "2022-03-04T12:04:55.000Z",
          "Titre": "Poor slow customer service",
          "Contenu": "Poor slow customer service. Needed to return a duplicate order. Months later I still haven’t had postage refunded. Messages consistently ignored."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Max",
          "Nb_Reviews": 6,
          "Date": "2023-07-13T20:52:30.000Z",
          "Titre": "Product works well, but a lot of spam",
          "Contenu": "Product works well, but every time you use it you get an email asking how it was. Very annoying. No way to turn this off other than to block all emails"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Robert M",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T18:13:05.000Z",
          "Titre": "Grill to hot for MEATER ambient temp."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AP",
          "Nb_Reviews": 1,
          "Date": "2021-12-25T23:37:50.000Z",
          "Titre": "Mmm...worked at first. Now it's unreliable",
          "Contenu": "Updated review. Cooking Christmas dinner this evening. Sitting not more than 15 feet from the stove and box, yet the app isn't working or keeping track of the temperature. To be honest, it's been a hassle requiring me to delete the meater block and re-pair it or it cuts out intermittently. It was really good at first, but after a year of owning it I don't think I would recommend it to someone else."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Harry",
          "Nb_Reviews": 14,
          "Date": "2020-01-03T07:44:16.000Z",
          "Titre": "The product does not work as described…",
          "Contenu": "The product does not work as described in marketing material - neither the range it offers nor temp accuracy - and customer service is slow and unresponsive. Would avoid and if you do buy do via Amazon as their customer service is better."
        },
        {
          "Note": 3,
          "Pseudo": "ade",
          "Nb_Reviews": 8,
          "Date": "2023-12-15T01:11:19.000Z",
          "Titre": "Meater refunded for the unit OK",
          "Contenu": "Meater refunded for the unit OK, thanks.  The replacement $55 ProbeT from Alixpress is working good,Pro: quicker to get going and no connection problems.Con: the probe has to align when replacing in the charger so have to look, the range is less that the Meater Plus but about the same as the standard unit. Otherwise happy with ProbeT."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Chris Blake",
          "Nb_Reviews": 11,
          "Date": "2023-10-25T01:06:39.000Z",
          "Titre": "Constant Connection Problems",
          "Contenu": "It’d be a fantastic tool if it didn’t have so many connection problems. Not only that, the app is useless ant telling you why it’s not connecting or telling you what to do too resolve it. When it works it’s great. Getting it to work is challenging"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T13:30:09.000Z",
          "Titre": "Apple Watch inop",
          "Contenu": "The iPhone app worked great but my Apple Watch Ultra did not work with Meater👎🏼 Not a great first impression."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Francis",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T07:07:38.000Z",
          "Titre": "I love the MEATER app…but",
          "Contenu": "I love the MEATER app. It does everything a thermometer should do except it has absolutely no range. I have to have my phone right next to the cooker to get a signal from the thermometer to the app. I can’t even go into my home with my phone without it losing the signal. With a new battery. I wish they would take a page from Traeger. Their wi-fire does an excellent job in sending cooking info to their app. Home or away from home."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Cregan",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T01:17:52.000Z",
          "Titre": "Neat device but mediocre customer service",
          "Contenu": "Do not buy it!  It stopped working after the first use.  And their customer service IS non-existence. I opened three support tickets and received zero responses.  I want my money back.UPDATED:  I finally got the response from customer service and received the replacement probe.  I can now connect to it. Thank you! Changing my review to 3 stars. They need to work on improving their customer service."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Julian Franssen",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T23:23:54.000Z",
          "Titre": "Good product, poor customer support",
          "Contenu": "Got the first meater probe which was faulty due the the ambient temperature sensor being damaged on arrival.I followed the process of contacting support and I was very disappointed with the response time. Took them two weeks to respond and it only happened after I messaged them on Facebook. This is not good enough for such a premium product.However, they replaced my probe and now the product is working great. Good range and good data. However still not very confident with the ambient temperature sensor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Bennett",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T03:57:52.000Z",
          "Titre": "Awsome new tool in the Barbecue arsenal..The directions in box are missing the…",
          "Contenu": "The directions in box are missing the part of take the MEATER out of the charger first then open the app. Had to go online for directions. Using the MEATER is Awsome very easy after getting set up going to love it for a long time to come."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff G",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T14:58:02.000Z",
          "Titre": "Great wireless thermometer but needs…",
          "Contenu": "Great wireless thermometer but needs improvement. The app needs a lot of work. Connectivity issues to meater cloud, obnoxious alerts that you can't cancel or change. Also, when the probe gets dirty it won't charge. I understand the dilemma, but you are in a grilling and smoking environment, the probe is going to get dirty!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Glen Davidson",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T00:00:41.000Z",
          "Titre": "Go straight to the Meater+",
          "Contenu": "I've been using a handheld digital thermometer for several years to test the internal temperatures of food.  I was excited by the remote sensing offered by Meater.  I chose the standard Meater as a 10 m range would be plenty.  It's a great product and gives perfect results each time.  Unfortunately, the range is nowhere near 10 m in practice.  With the probe inside the closed barbie or oven, the range might be 3-4 m - and it seems to get worse as the cook progresses. A friend bought the Meater+ at the same time and she is having much better success. Save yourself the grief and go straight to the Meater+"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Plummer",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T11:18:11.000Z",
          "Titre": "I don’t dislike . Just way over priced",
          "Contenu": "I don’t dislike it just cost way to much . My 25.00 one for Menards does same only real difference is other one has cable but doesn’t matter set base on grill right beside yours . As mentioned it was a gift."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Kurt",
          "Nb_Reviews": 6,
          "Date": "2022-08-20T05:17:31.000Z",
          "Titre": "My wife bought me Meater for my…",
          "Contenu": "My wife bought me Meater for my birthday, but after some discussion we decided it wasn’t right for me. We were approved for return by the company and packaged it up with all the paperwork and sent it back. After one month we don’t have our money returned and Meater is not returning my emails. Be very careful of this company. Sure you get your product but don’t try to return it.Coincidentally I just received my refund. Thank you Meater.Kurt Kubitz"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "P Holahan",
          "Nb_Reviews": 5,
          "Date": "2022-12-25T14:41:56.000Z",
          "Titre": "Still can't connect 4 hours after…",
          "Contenu": "Still can't connect 4 hours after getting meater plus. Garbage instructions. Proba ly an android 13 issue but website is of no help."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Henric Carlsson",
          "Nb_Reviews": 3,
          "Date": "2023-07-09T22:07:26.000Z",
          "Titre": "Gives one a good temp but does not work as a guide",
          "Contenu": "Excellent tool and use it as a guide but it is not a complete product. The temp is guiding too high and misses a lot of circumstances. Gives you a good understanding of the temp but does not work as a guide."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jody Welch",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T05:04:50.000Z",
          "Titre": "Love that it cooked it perfectly didn’t…",
          "Contenu": "Love that it cooked it perfectly didn’t like how even keeping the charging base close by with a new battery other then that it was great love it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T23:41:59.000Z",
          "Titre": "Thermometer works well",
          "Contenu": "Thermometer works great. Seems like the ambient temperature doesn't register correctly compared to the grill thermostat"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Paul Broomhead",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:28:37.000Z",
          "Titre": "Connectivity range not as advertised"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "L. Wolthers",
          "Nb_Reviews": 5,
          "Date": "2021-06-08T16:49:36.000Z",
          "Titre": "Great nifty tool, hardly Bluetooth compliant unfortunately",
          "Contenu": "Meater is a great nifty tool, but hooking it up to your (Android) phone is quite a hassle.Too many app builders don't give Bluetooth direct access, but require connecting through their app. Also Meater does this. So you need to reset all network and Bluetooth connections, losing your watch, headphones and other gear, that want to connect through their apps, extending the chain of misery. Meater is great, but app-building is a whole different game."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "katie Mitten",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T18:47:07.000Z",
          "Titre": "Customer Service",
          "Contenu": "I received a response from Meater after  leaving a review on here detailing items not received and no response to my enquiries. They have now explained change of courier and have promptly despatched new item - satisfied that I have now had contact but shame it has been so difficult to get information via customer services team. Good job the thermometers have rave reviews ! *Customer Experience rated not thermometer *"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JIM PARSONS",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T15:06:44.000Z",
          "Titre": "improve the signal strength and temp…",
          "Contenu": "improve the signal strength and temp calibration."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T22:49:07.000Z",
          "Titre": "Lovely and helpful support and amazing…",
          "Contenu": "Lovely and helpful support and amazing customer service."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Robert",
          "Nb_Reviews": 20,
          "Date": "2021-02-20T14:17:17.000Z",
          "Titre": "Frustrating experience",
          "Contenu": "Frustrating experience - thermometer failed after two uses, contacted support and got a quick response asking more questions. Responded via an impenetrable system called pirate at apption which seems to complete ignore all responses and then sends constant messages telling you it is closing your request.Update on 27th Jan - still not resolved over a month after original problem. These are very expensive items, and maybe there is a reason their service lines are so busy?Its ticket number #124625 by the way apption labs. is this the only way to contact you?Update: actually it’s a great piece of technology when it works and after 6 weeks of back and forth with the oh so slow support dept i finally got a replacement sent out almost a week after they received my returned non-functioning one. Wish it was more robust.  Hope they can learn some lessons from all feedback and improve."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Darko Ilic",
          "Nb_Reviews": 5,
          "Date": "2020-08-27T17:00:46.000Z",
          "Titre": "Updated review - improved title and rating.",
          "Contenu": "Update:Contacted Farrell who promptly discussed things internally and the solution seems to be on the horizon. And a quick one.Will further update with the review of the actual product and hopefully bump the rating further.----------------------Original review:Received cold mail from Meater and, having heard about it, decided to go for a Meater Block, and a Meater+ combo directly from their site. Gave my UK address as delivery address and it said they cannot deliver to UK country. At the time, my wife was back home in our other country and so i tried with that address. It was accepted by Meater, I paid up a bit more for postage and soon enough received info that items were dispatched. After parcel didn't arrive for more than a week, I checked tracking number only to find out:1) Parcel was not allowed to travel due to restricted goods policy2) It was being returned to sender in UKIn UK???!?!?!?! It was being sent from UK to Europe but when i tried first delivery address here in England,  it was rejected because \"we do not deliver to that country\"????Anyway, contacted support and 2 days later still no reply. There's nobody you can reach and, of course, like many other garbage operations, there's no phone number.Steer clear of them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Page Teer",
          "Nb_Reviews": 1,
          "Date": "2021-06-08T17:04:45.000Z",
          "Titre": "Produce the video’s “how to use.”"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Elam",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T15:30:11.000Z",
          "Titre": "This works well",
          "Contenu": "This works well. It’s important to keep it charged.  It needs more Bluetooth range though. I use it often and it is very reliable.  People love my steaks and pork loins.  The come out perfectly cooked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Guerra",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T05:15:46.000Z",
          "Titre": "Accurate enough",
          "Contenu": "Great product, you do have to tested and calibrate your readings - accurate enough with an +adjustment reading. Wish had settings for smoking meat"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jeff Ruggieri",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:59:29.000Z",
          "Titre": "So easy to use",
          "Contenu": "So easy to use.  It did disconnect a few times.  Range could be more."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Andre Hine",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T11:47:28.000Z",
          "Titre": "MEATER works great",
          "Contenu": "MEATER works great. Just as expected. Used it about 20 times now. Makes cooking on wood bbq so easy, it almost feels like cheating. App could have more cuts of meat (or include as many of the different names for the same cut as possible). It also overheats earlier than I expected when searing at the end of a slow cook over fire. This may be unavoidable for a precision piece of kit (or maybe the warning comes on early to protect the unit). Either way, not a massive issue. Would buy again and certainly recommend to anyone reading this review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Williamson",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T07:21:31.000Z",
          "Titre": "Accurate, reliable monitoring ;)",
          "Contenu": "I love my MEATER probe. Pairing and Bluetooth connectivity are never a problem and the temperature readings and cook time predictions are very accurate. My only regret is the limitations of Bluetooth connectivity radius. I do a lot of slow smokes, and if I move out of Bluetooth radius, the probe is useless. I’d like to see wifi functionality and Internet connectivity so I can monitor the cook beyond the present Bluetooth  range radius. For short smoke and grilling or oven roasts, it’s fabulous. But for a long smoke like brisket or pulled pork, battery life and Bluetooth range makes it fall short. Regarding battery life, I have to say it’s pretty impressive. It exceeds my expectations. Nevertheless for longer smoking like brisket I have to insert the probe at the end of the cook because battery life is not viable for more than about 4 to 6 hours."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T09:21:02.000Z",
          "Titre": "Pleasantly surprising",
          "Contenu": "I was pleasantly surprised by the accuracy and time estimates. Whole chicken internal temp and alerts left this meal exactly as I wanted it cooked. Well done!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rudy Loera",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:36:32.000Z",
          "Titre": "Good App",
          "Contenu": "I really enjoyed the user interface of the app and all of the data you are provided. My biggest issue is the difficulty of connecting to your phone and how hard it is to find help on-line."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Johann Ungerer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T12:14:58.000Z",
          "Titre": "Meater Block usage",
          "Contenu": "Setting up was bit of a challenge due to lack of clear directions.However, once I understood the new \"toy\" it was absolutely awesome !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Williams",
          "Nb_Reviews": 7,
          "Date": "2023-11-14T16:39:44.000Z",
          "Titre": "Not 5 Stars Just Yet",
          "Contenu": "Great concept, difficult to set up initially, but once everything is synced properly, it works well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guy Arledge",
          "Nb_Reviews": 4,
          "Date": "2023-11-09T13:27:34.000Z",
          "Titre": "Great way to grill",
          "Contenu": "Great way to grill!  No more guesswork with my steaks - and I’m free to do other things while they’re cooking.  Highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RaW",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T06:35:38.000Z",
          "Titre": "I love this thing",
          "Contenu": "I love this thing. I've ended up with a perfect cook every time except one and it was my fault for not getting the probe inserted straight. I've personally only used mine in the grill and smoker and it works every time, and I'm sure anyone should be happy with this amazing tool. The only small complaint I have is Bluetooth range on the plus. I wish I could get a little farther in the house for longer cooks. From what I understand the Block is a whole different ball game and somehow improves on an already amazing experience, and the range. If you're on the fence; take it from me, this thing is awesome."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jesse James",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T14:22:32.000Z",
          "Titre": "Offset Smoker",
          "Contenu": "Meat cooked great and probes definitely help keep an eye on internal Temps for food safety. My only issue is the difference in ambient temperature between the probe reading and grill thermostat reading, but on a positive will still show any temperature drop in the end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John J Botos",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T17:23:47.000Z",
          "Titre": "RE: Making 1 3/4\" Filet Mignon Healthy",
          "Contenu": "I've been working very hard and consistently endeavoring to eat as healthy as I can. Finding it hard to eat alone and maintain portion control. So, I focus on what I can control. I'm very grateful for the Convection Oven, and MEATER Wi-Fi Temperature System, and it's my own tenacity which helps me improve my skills. Below is where I'm at today with this, and where I'm going tomorrow:    JohnThe MEATER System is a system that allows me to evaluate and improve my skills with empirical data. It's the effort and learning by trial and error that I put into improving that got me to this point. The System could improve, and I think the MEATER development team is working on it, but it's the best System I found, and believe I wouldn't reach my current skill level without it. Thank you MEATER System Team. Enjoy and share the fruit of my labor. Filet Mignon 1 3/4\"×5\" seasoned overnight wrapped: sumac, smoked paprika, garlic, onion, black cherry, with KCl rubbed in. Cooked butter topped in small aluminum rectangular baking pan, modified with wedge cut out to within 1/2\" of pan bottom, to accommodate MEATER System probe's unincumbered access to reading meats internal/ambient temperatures, and at the same time contain migrating cooking liquids. Then nested baking pan on a silicone pad covered baking tray to maximize even indirect heating of meat. Slow low temperature cooked to medium well: 160°F internal in Convection Oven set at 222°F ambient temperature (about an hour cook time) this method rendered most of the outer fat out of the meat and maintained the integrity of the fats & lipids intercellularly. Delicious, tender (because of the cut of meat), melt in your mouth, a healthy and flavorful protein. Now that I got this down, time to apply this method to my smoker pallet grill when it arrives.       John J 10/29/2023"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T21:59:10.000Z",
          "Titre": "Customer service",
          "Contenu": "I would give a 5+ based on the experience that I had with “Chris” from customer support. He was professional. Got to the root of my concern and truly went above and beyond what was necessary to ensure I was satisfied with the product. The only reason I gave a 4 was because I had to go through an I.A. Bot to get to an actual customer service representative. As far as an actual product review. I may have just been unlucky with my first purchase. The MEATER+ that it was replaced with is a fantastic product in which I highly recommend. This is a great product and even more importantly has an outstanding customer service team that stands behind it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh M",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T08:00:26.000Z",
          "Titre": "If it broke, I’d buy a second one.",
          "Contenu": "This particular cook was spot on. I’ve had some temp accuracy issues with previous cooks but this one was absolutely perfect. If it broke I’d buy another just bc it’s more accurate than any instant reads that I own. The temp remained within 1-2 degrees of the probe that came with the Traeger Ironwood 885 so I feel I may have the accuracy deal figured out. I hope. Docked 1 star for the prior cooks not being consistent in my opinion but could’ve also been operator error. Time will tell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Taylor",
          "Nb_Reviews": 4,
          "Date": "2023-09-20T06:12:23.000Z",
          "Titre": "Best Digital, Wireless Thermometer I've Used",
          "Contenu": "A TRUE wireless.  Easy to use and the accuracy is spot on.  The wireless/bluetooth range appears unstable many times and often drops.  I have a mesh system, so coverage is strong everywhere.  Trying to use it outside on our deck, and inside a smoker is futile.  I love it and trust it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corey B",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T05:00:53.000Z",
          "Titre": "Love the Meater!",
          "Contenu": "Love the Meater Thermometer and the app overall! I’ll admit it’s a little kitch-y, but it really works where it counts. It makes the whole process easy… From setting up the cook, to monitoring the cook and adding alarms, and ultimately finishing the cookout an expected time and near-perfect doneness. Great device, and great app!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "David Hilton Arthur Droeske",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T23:42:59.000Z",
          "Titre": "Great for burger a pain for steaks.",
          "Contenu": "I always found it hard to cook homemade burger's. Typically they would just be over cooked or to pink for my liking. Using the meater makes it easy to get the temperature I like. When cooking steaks I don’t use the meater. I cook my steaks at a very high temperature and the meater gives me warnings about the heat. I find it much easier to go by touch and insta read thermometer"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark",
          "Nb_Reviews": 4,
          "Date": "2023-07-08T21:52:25.000Z",
          "Titre": "Fantastic product though mine seems to…",
          "Contenu": "Fantastic product though mine seems to slightly under cook for my taste so I always go one up ie if you like medium rare I find medium is closer. Prob just my probe needing calibrating."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DS VR",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:49:06.000Z",
          "Titre": "The Meater Probe works great",
          "Contenu": "Update August 8 2023:Issue with the gloves was resolved, they sent and I received a new pair. You can't ask for better service than that. Thanks Meater!The Meater Probe works great, connection was fast and never lost, everything was spot on with that. However, I bought the package that came with the Meater+ probe and BBQ mitts that are supposed to be heat resistant to 525*F; I was using the rotisserie at 400*F and burnt my thumb taking it off. I'm going to be very cautious if I decide to use them again."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Thomas Jakobsen",
          "Nb_Reviews": 13,
          "Date": "2023-01-06T16:49:56.000Z",
          "Titre": "Email spam galore",
          "Contenu": "They will spam you like crazy! After downloading their app they started sending me commercial ads via email every other day or so. I have tried unsubscribing six times to no avail. I guess I am stuck now with receiving their ads every other day forever … This behavior is not ok :-( Nice thermometer though, so two stars and not one..Dec 17 2022: Orig reviewJan 6 2023: Response from Meater on Trustpilot. I am not receiving spam anymore. Review upgraded to four stars - I still think the product is super"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T14:18:49.000Z",
          "Titre": "Very Nicely made little tool that works…",
          "Contenu": "Very Nicely made little tool that works well. You just need to cook enough to be able to appreciate it.In my situation it might become a learning experience everytime I use it, but hopefully not. (I don't cook a lot).I would have to say it helped me cook 6 ribeyes to everyone's delight. Without this little tool I would have probably overcooked them all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh Kelley",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T17:13:48.000Z",
          "Titre": "The ease of use and information…",
          "Contenu": "The ease of use and information provided by this thermometer is outstanding. Quality of construction is top notch, and the Meater block looks great on the counter. What I find to be most useful is its ability to give me time remaining on what I am grilling/smoking/baking so that I have an accurate finish time to start side dishes. And of course let the family know when we will be eating.I give it 4/5 stars only because of the size of the probes. They are significantly larger then most meat probes which I feel does limit you on some of the meats it could be used in."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim D",
          "Nb_Reviews": 6,
          "Date": "2023-03-29T14:11:20.000Z",
          "Titre": "Probes showed different temperatures.",
          "Contenu": "The Meater probes allow for a good cook.  I am just confused as to which probe to go by, as each of the two probes showed different templates.  Over a 25 plus minute cook I took 10 samples and I averaged 5.6° internal and 14.9° ambient.  So like I said which probe to go by a Max of 9° internal and 28° ambient and a Min of 1° internal and 5° ambient.   What a temperature difference and no way to calibrate the readings to match."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charlie Edwards",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T02:08:38.000Z",
          "Titre": "Learning a new way to cook",
          "Contenu": "I started cooking a chicken breast at medium high heat which seared the outside. Turned the heat down 50% and continued cooking. Breast was hard cooked on the outside but soft and moist inside. I love my Meater. Every mistake I made is my fault, but the Meater has saved my dinners each time"
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Mehmet Turken",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:01:11.000Z",
          "Titre": "Mackarel Filet",
          "Contenu": "Result was good, tasty, and juicy.I should try it with Bluefish filet in later October.Seasoning with only seasalt before puting in oven"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Left",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T09:44:16.000Z",
          "Titre": "Everything that I've cooked so far, chicken and tuna steak was good",
          "Contenu": "Received Meater as a gift but I am surprised how easy and fun it is to use. Everything that I've cooked so far, chicken breast and tuna steak comes out exactly to the settings! Not five stars just because sometimes it disconnects, i.e. if you go back inside the house but it's also expected."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SpillyJ",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T01:13:49.000Z",
          "Titre": "Long rest time.  I guess perfection takes it time.",
          "Contenu": "Strange how long the rest time was on this spinela Dorsi piece of meat. But it was properly cooked and everyone enjoyed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert J Lokar Jr",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T17:03:13.000Z",
          "Titre": "The Meater as easy as it comes!!",
          "Contenu": "The Meater is by far the BEST wireless thermometer on the market. It’s ease of using your smartphone is pure genius completely removes all doubt when baking or grilling or smoking your preferred item."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roy Howk",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T16:13:00.000Z",
          "Titre": "Easy setup and versatility",
          "Contenu": "The setup of using the product is very simple, especially as the app has instructional reminders built in to every step. I would like to see one improvement made to the connectivity options. Currently only via Bluetooth, but adding wifi would greatly enhance the the experience."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Daniel Ziegler",
          "Nb_Reviews": 4,
          "Date": "2023-07-25T23:03:41.000Z",
          "Titre": "This I miss… (Compared to iGrill)",
          "Contenu": "1. Too much notifications on iPhone towards end of grilling/cooking.2. AppleWatch-App should work standalone without first connecting MEATER to the iPhone/iPad… Would really be helpful in larger gardens or appartement with separated balconies…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 8,
          "Date": "2023-09-09T01:46:46.000Z",
          "Titre": "The Meater+ works very well.",
          "Contenu": "The Meater + works very well. I am thinking that the probe ambient temperature is more accurate than the one built into the grill. Meater was easy to pair with the app. A nice little device."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Steve Kohler",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T00:57:09.000Z",
          "Titre": "very helpful tool",
          "Contenu": "I find the MEATER a very helpful tool, as I am a beginner in slow cooking/ smoking on my Kamado style grill. Even as I gain experience,, is nice to see and monitor progress, especially remotely."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Maryanski",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T20:28:48.000Z",
          "Titre": "Works well but connection lost due to short distance",
          "Contenu": "It does give you an accurate sense of temperature; however, it doesn't take into account resting temperature.  I will set the temperature higher next time; however, it is very accurate.  I did lose connection and had to bring my phone closer to the grill which defeated the purpose of cooking in the kitchen and keeping an eye on the grill.  But steak came out perfect!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RS",
          "Nb_Reviews": 2,
          "Date": "2023-07-23T23:20:34.000Z",
          "Titre": "Positive Experience",
          "Contenu": "I could tell from the probes where NY hotspots were and how to balance the meat to the most efficient spot. I would like to see the Base have a charger indicator, when charging you have no idea if it is charging or not."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Eric",
          "Nb_Reviews": 19,
          "Date": "2023-05-28T22:05:08.000Z",
          "Titre": "Useful tool with wide range of methods…",
          "Contenu": "Useful tool with wide range of methods to prepare your meat. Connection not always 100% and suggestion for improvement would be to make it possible the the base station doesn’t have to be near the bbq while use the MEATER"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sadie",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T04:54:06.000Z",
          "Titre": "Love my meater, but....",
          "Contenu": "Love my meater, but it's a hit or miss getting it to connect to my phone. It sits there forever trying to connect and it doesn't. Tried also using a different phone to see if it works on that one but still didn't. It didn't need any updates or anything it just for some reason not working. But i love it and will buy another one soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Magdalena Hansen",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T06:02:25.000Z",
          "Titre": "There was a bit of a learning curve in…",
          "Contenu": "There was a bit of a learning curve in the way I usually baked the chicken. But it turned out perfect on our first try! The only downside is that I couldn't directly monitor it from my livingroom 15 feet away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Sills",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T12:22:49.000Z",
          "Titre": "Meater is awesome!",
          "Contenu": "This is a quality product that works as well as it looks, I like being able to see my ambient temp fluctuations on a graph as I monitor my cook. Would definitely recommend this to everyone who cooks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Madeline Leidy",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T13:40:37.000Z",
          "Titre": "Meater is great for grilling!",
          "Contenu": "Great how the meater provides temperature readings of both grill and internal meat temp. Estimated cooking time was accurate too. Probe needs to be smaller for smaller cuts of meat."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Radcliffe",
          "Nb_Reviews": 15,
          "Date": "2023-05-14T21:36:53.000Z",
          "Titre": "Good overall, needs practice",
          "Contenu": "We like the concept. We looked at Meater for some time before buying the block. First attempts not perfect but that's just a matter of getting used to the preselected settings. Overall, we like it. Not cheap but if it gives us perfectly cooked food for years to come, it's a good investment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexis Santiago",
          "Nb_Reviews": 2,
          "Date": "2023-04-17T01:08:29.000Z",
          "Titre": "The thermometer block is a great…",
          "Contenu": "The thermometer block is a great product, I've done many cooks with them and generally I have a great experience. My only complaint would be that somtimes the cook drops from the cloud and it drops from the log, but it has happened only a handful of time from over 100 cooks so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joseph Brown",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T19:54:07.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I have been trying to contact Meater customer service by phone for the past 2-days. Each time I am stuck listening to music for up to 30+ minutes, no one takes the call, and I just hang up.  Can someone from Meater please contact  me regarding a replacement probe. Joseph Brown 609-206-5391I am not sure who from MEATER replied, but their reply is incorrect. Upon a 3rd attempt I was able to reach Meater's customer service. The gentleman who assisted me was very understanding and apologetic. He resolved my issue and gave me a 50% discount on a replacement probe order. I was very satisfied 😌 Meater customer service number is (818) 929-8907 and you need to press #3 when prompted. I have update my rating from a 1 to a 4 because the overall outcome was extremely satisfying. Thank you Meater."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Bolger",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T03:52:59.000Z",
          "Titre": "When it works",
          "Contenu": "When it works, the results are right on target. The trick is to make the Internet connection work outside at the grill."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rob Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T11:08:38.000Z",
          "Titre": "2nd time I used it and still learning",
          "Contenu": "2nd time I used it and still learning.  My steaks came out anemic and bleeding because I never seared them first  ( or after)  They were cooked through perfectly though.  They don't look too good but taste great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jiu Jitsu Fiend",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T02:39:22.000Z",
          "Titre": "It's a great device!!",
          "Contenu": "It's a great device. My first time using it on pork chops I may have made a mistake because they were reading 19°f above the meater internal temp. I have since used it in a rib roast and some tomahawk steaks. It has performed perfectly!! This is a must have for Me and if it keeps performing like this I will certainly be buying the upgraded set."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Soren Westerskov",
          "Nb_Reviews": 3,
          "Date": "2023-07-12T19:39:46.000Z",
          "Titre": "Good tool",
          "Contenu": "Very easy to use - however your phone has to be pretty close to the probe otherwise connection is lost to the BT.The instruction given on the app is very accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Powell",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T20:03:23.000Z",
          "Titre": "My Meater is GREAT when it works",
          "Contenu": "My Meater is GREAT when it works. My 1st Meater was a Father's Day gift. I liked it so much that I purchased another one. About 6 months ago one just quit working now the other appears to be on out as it will not hold a charge... I don't keep good records on purchases like this, so I'll just move on..."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "S. Bond",
          "Nb_Reviews": 4,
          "Date": "2022-08-11T21:55:29.000Z",
          "Titre": "Good customer service",
          "Contenu": "Firstly, I am very impressed with the functionality of the Meater+. The system works well, and I love that I can accurately monitor my cooks on my Kamado grill for low and slow cooking.Unfortunately, after six cooks, my probe malfunctioned and stopped working altogether. After contacting their customer service, I received a reply via a helpful chap called Kavan, who guided me through a check-list. After ascertaining the probe was defective, a replacement was dispatched and received within a week.I can see that a number of customers are incredibly negative about their service levels, although I have not found this to be the case. Quite the opposite. Clearly they are upping their game as they grow."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 5,
          "Date": "2023-05-01T13:00:10.000Z",
          "Titre": "Excellent product with tasty results",
          "Contenu": "Excellent product when correctly inserted. Easy to cook meat/fish exactly to taste. App can lose the ETA when phone screen goes off, but reconnects fairly quickly. Overall very, very good."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Adey from Sheffield",
          "Nb_Reviews": 9,
          "Date": "2023-07-16T18:04:02.000Z",
          "Titre": "Disappointing start so not quite 5 stars",
          "Contenu": "When I first got my Meater I charged it in the charging block. However, when I first came to use it the battery (supplied) was flat and had leaked. I cleaned it up and put in a new battery. Used it a couple of times since and everything has come out perfectly. Found that if I cover my joint in foil I need to leave the probe sticking out or it loses connection"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BENJAMIN",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T18:22:11.000Z",
          "Titre": "The app was a little confusing when…",
          "Contenu": "The app was a little confusing when starting to cook but I had four perfect steaks using the meater in just one of them.  Definitely my go to thermometer from now on"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T02:07:01.000Z",
          "Titre": "PROS The thermometer works great",
          "Contenu": "PROS The thermometer works great! Never over or under cook your meat again.  Easy to use app.CONS even when using the docking station  signal distance while inside the house is not strong.  Can't run it and leave my phone in the house."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Hoover",
          "Nb_Reviews": 4,
          "Date": "2023-07-05T21:27:34.000Z",
          "Titre": "Turn Timer Needed",
          "Contenu": "The only small problem I have is when grilling a piece of meat that requires turning a timer would be helpful so as NOT to get it too done on one side."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Nate Johnston",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T02:05:41.000Z",
          "Titre": "Great tool",
          "Contenu": "My meats are never over cooked now and I really like that it estimates how long it will be until my cook finished based on real time temperatures."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CHARLES TALBOTT",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T00:48:32.000Z",
          "Titre": "Only Thing I don't like about Meater Is…",
          "Contenu": "Only Thing I don't like about Meater Is the distance is to short.   It advertised to go 165 feet But in reality when you go into the house it loses connection at 35 feet.  Very frustrating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich Hardin",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T19:05:52.000Z",
          "Titre": "Great thermometer. Should recharge instead of old school battery.",
          "Contenu": "Extremely accurate. Have to stay relatively close in my house to the thermometer. Overall distance is pretty good. Finally would rather charge with a cord."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2023-06-11T21:06:38.000Z",
          "Titre": "Very simple",
          "Contenu": "Straightforward to use, some challenges with connectivity but once these were sorted we were fine. Really good food and well designed app."
        },
        {
          "Note": 4,
          "Lieu": "VE",
          "Pseudo": "Andres Maduro",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T01:17:53.000Z",
          "Titre": "Meater, do perfect cooking!",
          "Contenu": "The Meater is a great product.  Every time I use it I get perfect results, no kidding.  I love the product and will continue to use it periodically and recommen it to friends.  It is very simple to use and give accurate results!  M"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Nichols",
          "Nb_Reviews": 6,
          "Date": "2023-08-06T07:25:42.000Z",
          "Titre": "Works like a charm",
          "Contenu": "Works like a charm with thicker cuts of steak and chicken, but tends to overheat with meats less than around 3/4 inch thick. Good app interface."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Horton",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T15:14:29.000Z",
          "Titre": "Precise Monitoring",
          "Contenu": "I loved the fact that I can monitor my cooking without opening having to open my BGE loosing the heat.Precise temperature monitoring ensures your food is cooked to a precise doneness"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Grant",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T04:54:16.000Z",
          "Titre": "Overcooked",
          "Contenu": "NY Strip set for medium rare was overcooked when removed and rested per MEATER guidelines. It was more medium to well done…and a little tough."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott DiBastiani",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T16:17:40.000Z",
          "Titre": "meater and a meater+",
          "Contenu": "I have a meater and a meater+.  When using the Meater+ I almost never have a connection issue but when I try to use both Meater and Meater+ I almost always have connection issues even if I am standing next to block and probe."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Alexander Borg",
          "Nb_Reviews": 2,
          "Date": "2023-06-04T21:24:43.000Z",
          "Titre": "Product is good but uneven",
          "Contenu": "Product is good but uneven. I am not sure if I have a defect product. 80% of the time it turns out perfect, the remaining time, the tempeture spikes by over 10C in the matter of seconds, and the meat ends up overcooked"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Flowers",
          "Nb_Reviews": 6,
          "Date": "2023-07-09T12:44:03.000Z",
          "Titre": "I was about to give up on it for…",
          "Contenu": "I was about to give up on it for connectivity issues but I finally figured it out and my reverse sear of a rib-eye was almost perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Libby",
          "Nb_Reviews": 2,
          "Date": "2023-07-03T01:55:45.000Z",
          "Titre": "I love the Meater Block, small issue.",
          "Contenu": "I love the Meater Block. Having issues with two probes not connecting to the Block now. This prevents wifi from working on those two probes. Blutooth still worked on all 4 probes.  Working on a solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-08-03T02:13:34.000Z",
          "Titre": "It Worked Well First Attempt",
          "Contenu": "Easy to set up with my phone, connected right away. Tried it out on Traeger Pro 34 Smoker cooking chicken legs and even alerts when to take meat off grill. So far so good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom R",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T01:32:20.000Z",
          "Titre": "Easy to set up and reliable device",
          "Contenu": "Easy to set up with specific items and even cuts of meat. Estimates for time until done makes it easy to work out timing on side dishes."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Anthony Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T00:25:25.000Z",
          "Titre": "I found it a little fidderly to set up",
          "Contenu": "I found it a little fidderly to set up, but once it was it works a treat. I run it through my iPad as it seems more stable than the mobile. Good bit of kit and rate it much higher than other probes sold by Weber. I bought the quad which in my opinion offers value for money."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 3,
          "Date": "2023-03-26T21:26:31.000Z",
          "Titre": "First time user",
          "Contenu": "Smoked a 7lb pork shoulder at 250 for 10 hours to an internal temp of 192. I would have let it go an other hour, hour and a hslf, but the family couldn’t wait until 10:00 no rest time at all. And it turned out a little chewy but sooo good. Next time 225 for much longer. I have heard of the “stall” but it was amazing to actually witness it, cool. I lost connection with unit over 50 feetOnly time will tell, but so far its got my vote. William"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Robert Hansen",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T08:17:56.000Z",
          "Titre": "Great product but you have to buy the +…",
          "Contenu": "Great product but you have to buy the + version. Less than 5m range on the regular one"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T15:39:53.000Z",
          "Titre": "Helped me monitor the meat temp",
          "Contenu": "Helped me monitor the meat temp. Just make sure you have the receiver close to the thermometer or you will loose connectivity"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Conradt Meyer",
          "Nb_Reviews": 2,
          "Date": "2023-09-03T12:45:18.000Z",
          "Titre": "Did a lamb rib was not cooked perfectly…",
          "Contenu": "Did a lamb rib was not cooked perfectly think got the probe in the wrong place but stil fantastic"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "E Jones",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T18:54:40.000Z",
          "Titre": "Batteries included-not so good.",
          "Contenu": "The only issue I have batteries it came with lasted one cook. Instructions could be a little more clear, once I figured it out it worked great though"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "R James",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T14:05:42.000Z",
          "Titre": "After replacing the batteries they…",
          "Contenu": "After replacing the batteries they worked.Still need number tabs which got tossed by a dish washer."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "happypete",
          "Nb_Reviews": 32,
          "Date": "2023-06-11T12:54:45.000Z",
          "Titre": "Great information - slightly unstable connection",
          "Contenu": "Great app - easy to use and good recipes and recommendations!4/5 as the connection to the probe at times is unstable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lindsey Prochaska",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T03:56:25.000Z",
          "Titre": "Great little thermometer",
          "Contenu": "Having some issues with connection but the temp of food is perfect every time. Cooks the best steaks we have ever had."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ilan Leiman",
          "Nb_Reviews": 1,
          "Date": "2023-04-09T02:02:38.000Z",
          "Titre": "It worked pretty well.",
          "Contenu": "It was pretty easy to set up. It disconnected from my phone a few times, but I think that was due to inactivity. And it reconnected pretty quickly. Overall, it worked like a charm."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Darrin Maidment",
          "Nb_Reviews": 2,
          "Date": "2023-09-05T03:16:40.000Z",
          "Titre": "Great devise for the perfect steak …",
          "Contenu": "Great devise for the perfect steak…. Only issue was connectivity pass 6 feet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T16:19:57.000Z",
          "Titre": "The meater is great, App not so much",
          "Contenu": "The meater is a great thermometer because of its long lasting battery and surprisingly good Bluetooth. Sadly the pre set cooks in the App can never be trusted to 100%. For example on a quick steak this thermometer is close to useless. Calculated cook time is inaccurate and when to remove from heat is well off to reach your goal. Low and slow cooks work fairly well, again with a learning curve from the user. The remove from heat warning is way to early. If I’d use the notification for my brisket I would always end up 5 degrees below my goal. And 5 minutes of resting for a 17 lb brisket!? Maybe the cooks in the app will improve. The device itself works phenomenal and I can’t complain. Well worth the money if you know what kind of temps you’re looking for and take the app suggestions with a grain of salt.Edit:My experience with the steaks came from making a ribeye steak. I set a target of 125°, fired up the grill and threw the steak on. I flipped it once at around 90° and by the time the app told me to „remove from heat“ the steak was overshooting the target and ended up at 137° when done resting. It did work for me, when reverse searing and not using the meater at the end of the grill. So far I just ignore the estimated times because during low and slow cooks, they sometimes show 23 hours remaining. Even with me changing nothing about the setup (grill stays closed with set temperature), the cook takes about 12-13 hours. And while grilling a steak, by the time the app shows an estimated time, it’s telling you to „remove from heat“. I think this might be due to measuring ambient temperature but not the grate temp from the direkt fire."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dan",
          "Nb_Reviews": 30,
          "Date": "2023-07-08T20:01:17.000Z",
          "Titre": "Great probe",
          "Contenu": "Grwat probe. Produced Great moist chicken. Would be nice for an oven temperature only probe  and a thinner probe for fish etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harvey Beatty",
          "Nb_Reviews": 8,
          "Date": "2023-09-23T19:17:24.000Z",
          "Titre": "Loved the wireless feature",
          "Contenu": "Loved the wireless feature.  Also found the app to be very helpful for our first time using our smoker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Bottoms",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T00:35:12.000Z",
          "Titre": "Works great but the block and the phone…",
          "Contenu": "Works great but the block and the phone keeps cutting out works great with Wi-Fi been using it for the last week every day"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Qualin",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T00:17:30.000Z",
          "Titre": "over the hill",
          "Contenu": "Once I Had my 50 year old son help me set it up (I'm 77) it work get. If they had a pamphlet available in stead of the app it may have been easier for me to follow"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jason Keays",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T10:13:18.000Z",
          "Titre": "MEATER was bang on with the temp of my…",
          "Contenu": "MEATER was bang on with the temp of my Roast Pork leg. Easy to use I actually don’t know why anyone would have one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Fowler",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T04:51:00.000Z",
          "Titre": "Thermometer was impressive",
          "Contenu": "Thermometer was impressive, everything I hoped for.  But I need more practice on cooking a good Brisket."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Aills",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T05:50:15.000Z",
          "Titre": "With meater",
          "Contenu": "With meater, I never overcook anything!Meater is so easy to set up on iPhone"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kevin Hook",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T17:05:25.000Z",
          "Titre": "Stress free cook.",
          "Contenu": "Bluetooth & little hit & miss, but overall a very good & relatively easy stress free cook."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Stu Lumsden",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T11:02:14.000Z",
          "Titre": "It works really well",
          "Contenu": "Just push into the meat, then set type of meat/cut & how you liked it cooked. Let the phone tell you what s going on plus when to switch off & let the meat rest it’s as easy at that. Not stress or guessing"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jonathan Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T18:11:07.000Z",
          "Titre": "The product is fantastic",
          "Contenu": "The product is fantastic - it always provides great result either when smoking or grilling . Love it!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "sacha-samuel Laforest",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T12:52:03.000Z",
          "Titre": "Works like a charm",
          "Contenu": "Works like a charm! The only downside is the range... so I need to leave my tablet next to the smoker to be able to use the cloud to monitor my grilling from further away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T15:04:41.000Z",
          "Titre": "Like the app cook estimate etc.",
          "Contenu": "Like the app cook estimate etc.but the connection went out a couple times"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Moore",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T01:06:11.000Z",
          "Titre": "As far as I can tell the Meater works…",
          "Contenu": "As far as I can tell the Meater works perfectly.  User errors account for my mistakes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abie Dean",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T03:44:00.000Z",
          "Titre": "Perfect time estimation",
          "Contenu": "Perfect time estimation, lost connection a couple times (didn't move the block or my phone), but did regain connection quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryce",
          "Nb_Reviews": 7,
          "Date": "2023-06-12T02:52:12.000Z",
          "Titre": "I have had quite a bit of problems…",
          "Contenu": "I have had quite a bit of problems lately with the probe disconnecting from my phone."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Shadi Ibrahim",
          "Nb_Reviews": 38,
          "Date": "2023-07-25T19:32:40.000Z",
          "Titre": "Good!",
          "Contenu": "Works well wish there was a way to tone down the notifications tho"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Timothy Smith",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T00:36:55.000Z",
          "Titre": "Worked well just no range",
          "Contenu": "Worked very well but has a very limited range which requires you to reset often"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Bamberg",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T02:41:08.000Z",
          "Titre": "Liked most everything about this…",
          "Contenu": "Liked most everything about this thermometer but the temperature reading seemed about 10 degrees higher than actual temperature. Still worked well."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brad Steffens",
          "Nb_Reviews": 3,
          "Date": "2023-09-30T18:44:30.000Z",
          "Titre": "Really easy to use",
          "Contenu": "Really easy to use. Perfectly cooked. But would like it if suggested a time to turn over"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gilles Lacoursiere",
          "Nb_Reviews": 3,
          "Date": "2023-07-01T00:06:39.000Z",
          "Titre": "Almost perfect!For a rare occasion since I use MEATE…",
          "Contenu": "For a rare occasion since Ibuse MEATER , it was a bit over cooked. It’s normally right on!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Beck=",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T05:36:04.000Z",
          "Titre": "Meater plus 2 is super awesome",
          "Contenu": "Meater plus 2 is super awesome, maybe in the next firmware they can make it so the type of meat you’re cooking can be adjusted after the fact. And include the more obscure cuts of beef like the bistro filet? Well worth the money though I like the 100% wireless and that I don’t have to remove the it before the sear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brent Brown",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:32:16.000Z",
          "Titre": "Extremely easy to use and accurate. …",
          "Contenu": "Extremely easy to use and accurate every time, Just ordered the new Eater 2+, cannot wait. With meat prices so high the Meater is a must have, gets it right EVERY SINGLE TIME!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat Dugger",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T03:27:33.000Z",
          "Titre": "Classic 2 in Filet reverse sear with…",
          "Contenu": "Classic 2 in Filet reverse sear with Meater 2plus at 250 in oven to 129 temp, finished in cast iron Lodge to 135 degrees. Perfecto! The Meater is spot on. I have 2 now. Better get you some! Regards Pat"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Jeffries",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:20:48.000Z",
          "Titre": "First time I used it and it did very…",
          "Contenu": "First time I used it and it did very well.  Checked it several times against an old fashioned thermometer and it was within 2 Degrees"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Katrina",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:05:41.000Z",
          "Titre": "Excellent customer service and really great easy to use app",
          "Contenu": "Excellent customer service and really quick delivery. I love that you have to watch the videos first before using it. The app is really easy to use and setup a cook. I have used it for meat and when cooking a whole turbot on the BBQ. Came out excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Manzanares",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:51:46.000Z",
          "Titre": "First cook with the MEATER temp probe…",
          "Contenu": "First cook with the MEATER temp probe on a pork belly. Pork belly turned out amazing! Temps were consistent and accurate! Great smoking tool!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tom Ireland",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T06:31:19.000Z",
          "Titre": "I have been cooking with charcoal for…",
          "Contenu": "I have been cooking with charcoal for years and thought this would be a bit of a gimmick. Provides very useful information during cook and allows you to focus attention on other things. Great bit of kit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Southern Saucier",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:39:03.000Z",
          "Titre": "My chicken turned out perfect",
          "Contenu": "My chicken turned out perfect. Succulent. No more overcooked chicken breast."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mike",
          "Nb_Reviews": 41,
          "Date": "2023-12-11T19:09:11.000Z",
          "Titre": "Really useful cooking aid - Buy one",
          "Contenu": "Used to check & cook a topside of beef (small) but not yet cut/eaten This device is great for checking the temperature of the meat in the middle of the joint. So glad I bought one. Easy to use and seems accurate for temperature. Recommend this device for any cooking where it’s great to know the inside."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tanya",
          "Nb_Reviews": 6,
          "Date": "2023-12-10T21:38:13.000Z",
          "Titre": "Less to think about",
          "Contenu": "Im really good with cooking timings but Meter means you have less to think about and store in your head you can trust that you’ll get a reminder when to take out your meat. Always Perfection ❤️"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kelly",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T21:18:14.000Z",
          "Titre": "Cooked a tenderloin Roast last nigh and…",
          "Contenu": "Cooked a tenderloin Roast last nigh and only used the MEATER for temperature and time, it turned out perfectly. i did check the temperature with my therma pen and it was the same as the MEATER."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Harvin",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T15:22:01.000Z",
          "Titre": "This is awesome wireless/ Bluetooth…",
          "Contenu": "This is awesome wireless/ Bluetooth thermometer. I cooked a 11. 5 Boston Butt, it took about 23 hours to smoke. I had to work a 10 hour shift and sleep. I was able to know how my meat was cooking and I did not have to stay at home. I should have brought this a long time ago."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Pignataro",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:38:09.000Z",
          "Titre": "Works great, worth the money",
          "Contenu": "Works great!  I want to get a multi pack so I can know the temp at different places on a 20lb prime rib.On the ends vs the middle.  Great product, high quality, easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Washburn",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:56:59.000Z",
          "Titre": "Greatest kitchen gadget!",
          "Contenu": "Greatest kitchen gadget!This is useful and has never failed to grill/roast/bake a variety of meats perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 4,
          "Date": "2023-12-03T16:05:10.000Z",
          "Titre": "Awesome Temp Probes",
          "Contenu": "So easy to use and very precise. Much easier to use than wired meters. I love these probes having the meat temp & the ambient temp on each one. The information reported from the monitor to my iPhone is wonderful and allows lots of data for your cook!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick Dufrene",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T04:30:09.000Z",
          "Titre": "Really like the way it charts progress…",
          "Contenu": "Really like the way it charts progress during the cooking process, it is really easy to use and the app walks you thru step by step. My only complaint is I wish the connection between the phone and meater were a little stronger."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john st germain",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:58:10.000Z",
          "Titre": "Reverse searing a quality prime rib eye…",
          "Contenu": "Reverse searing a quality prime rib eye produces a steak the your friends will asking all the right questions afterwards! D Lish"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Pollan",
          "Nb_Reviews": 7,
          "Date": "2023-11-22T15:49:45.000Z",
          "Titre": "Smoked Brisket on Big Green Egg",
          "Contenu": "Readings from my Meater Plus 2 were identical with the readings from my Flameboss controller. Never hurts to have two inputs as a crosscheck. Alarms when you reach meat temperature - in this case 195 degrees farenheit. I double checked with aninstaread probe and temperature agreed. Probe also used to test tenderness. Once off the smoker left Meater in while meat rested until it reached170 degrees.Then wrapped and held at 150 degrees in electric smoker until time to serve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike M.",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T07:07:12.000Z",
          "Titre": "Loved using the Meater+ for roasting a…",
          "Contenu": "Loved using the Meater+ for roasting a turkey…no more opening the oven to check the temperature nor even having to go to the kitchen as the progress is shown on the app. The alert tones were helpful and once the app gave an estimated cook time, it turned out to be fairly accurate. Wonderful feature for planning the preparation of other meal items so all are ready to eat at the same time as long as you take into account the “rest” time after cooking. Very easy to use, convenient and cleans up easy."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mitchell Thompsett",
          "Nb_Reviews": 8,
          "Date": "2023-11-19T19:55:58.000Z",
          "Titre": "What an absolutely amazing product",
          "Contenu": "What an absolutely amazing product. Previously had zero idea on how to cook, especially meats. Also didn’t realise how important resting is. This does all of that, and love setting custom alarms to help time other things like vegetables so that they’re done at the same time as the meat. Definitely gonna buy more meater products like the big block with multiple probes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T05:17:42.000Z",
          "Titre": "Thanksgiving dinner success",
          "Contenu": "A YouTuber I watch recommended the Meater so I bought one to try out to cook a Thanksgiving turkey. It was easy to set up. The only flaw was that the estimated time to cook on the app first said 7 hours but then lowered the amount of time and ended up taking 5 hours including resting time at the end. The turkey cooked perfectly though at the right temperature and tasted delicious. I like that it took the guesswork out of cooking meat. I’ll definitely use mine again and I’m glad I had it to help with my Thanksgiving dinner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert McCauley",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T16:18:19.000Z",
          "Titre": "perfect prime Rib",
          "Contenu": "The ability to put a prime rib in my smoker and not worry about over or under cooking it and let MEATER do the rest. Is priceless  it actually notifies you just before the cooking process is done thru the app on your phone. I highly recommend this product for everyone who likes their meats perfect every time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Bivens",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T04:54:29.000Z",
          "Titre": "Great little thermometer… worked like a…",
          "Contenu": "Great little thermometer… worked like a charm on a chuck eye cast iron skillet cook! Awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise G",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T17:55:11.000Z",
          "Titre": "I bought this for cooking a…turkey",
          "Contenu": "I bought this for cooking a thanksgiving turkey. I was a little bit nervous because  I was taking the chance with this product for the first time with this Thanksgiving meal. I was skeptical because the thermometer advised the turkey was done much quicker than I anticipated. I decided to trust it. I can honestly say I wish I had this 20 years ago because this is the first time I have made a turkey that didn’t end up dry! It was perfectly cooked. Hats off! I’m a believer.  I highly recommend this product!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "John Mangham",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T09:39:30.000Z",
          "Titre": "Great results now.",
          "Contenu": "Purchased just the single probe.Initially a few Bluetooth connection issues...however, seems to be fine now.Getting perfect results each time now.Tried BBQ chicken, Scotch filet, Sirloin and Burgers.All perfect! Recommended"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sidney Scott",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T11:24:38.000Z",
          "Titre": "Worth the investment",
          "Contenu": "This is one of the best purchase I've ever made. My roast turned out juicy and why didn't I buy this earlier! I chose this over wired thermometer, because of the many good reviews from YouTube/Internet. The app is user-friendly, interface is great, plenty of live data while the meat is roasting. Love it! Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AZEd",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T22:19:31.000Z",
          "Titre": "I have loved the MEATER thermometer…",
          "Contenu": "I have loved the MEATER thermometer since day one.  It allows me to cook steaks, burgers and everything else to perfection (except the rare few occasions I second guessed it and undercooked a few things).  I will never second guess it again!   The only time I had an issue was when pan frying pork chops, so wouldn't recommend using it in frying pan applications."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marky B",
          "Nb_Reviews": 10,
          "Date": "2023-11-26T19:48:29.000Z",
          "Titre": "It’s an amazing bit of kit",
          "Contenu": "It’s an amazing bit of kit.   Whatever your preference, it makes you realise we are all overcooking our meat.  For the price, an absolutely remarkable piece of kit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler LaCroix",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T02:49:58.000Z",
          "Titre": "I stinking love this thing",
          "Contenu": "I stinking love this thing.  I get all nervous cooking because the family likes their food different from me.  Over-done burger, pulled it off too early.... this just takes the guess work out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clayton",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T06:34:36.000Z",
          "Titre": "This thing is the Bee’s knees",
          "Contenu": "This thing is the Bee’s knees! Cooking is already easy with a good thermometer but the convenience and the versatility of the Meater+ is unmatched. Syncing the thermometer with your phone allows a completely stress-free cooking experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sage",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T03:59:36.000Z",
          "Titre": "Home cook no longer scared of meat cuts",
          "Contenu": "Love cooking but always strayed away from larger cuts because I was always overcooking or undercooking and timers seemed to hurt more than help. This nifty little gadget works great and gives me something a lot more reliable. Have done 2 different pork cuts and can’t wait to move on to steak!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Campo",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T02:06:44.000Z",
          "Titre": "Grilling made easy!,So far I’ve used this for chicken",
          "Contenu": "So far I’ve used this for chicken, beef and pork . Whether gril, in the oven or even in an air fryer, every single time it is cooked to perfection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Dyson",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:19:59.000Z",
          "Titre": "Best way to beat dry meat.",
          "Contenu": "I've used my Meater 2, 3 times so far. My meat was cooked perfectly all 3 times. My guests at Thanksgiving said it was the juiciest turkey of their lives. I am in love with meater 2 and will be recommending it and purchasing at least 1 for a gift. Get your meat on now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T18:52:26.000Z",
          "Titre": "Works as advertised.",
          "Contenu": "Works as advertised.  Have only used it twice, but the results were great.  The best probe I have ever used.   And the App is fantastic.  I plan on using it for Thanksgiving with the Turkey.  It's important to view all the videos that come with the App.  The Meater can do so much more than measure the internal temperature.    I will use it often."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anne Leach",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T11:29:37.000Z",
          "Titre": "MEATER thermometer",
          "Contenu": "It’s always so difficult to know when a pork chop or piece of meat is cooked to perfection. With the MEATER it takes away the guess work and you are always guaranteed perfectly cooked meat. It’s amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DAD",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:46:52.000Z",
          "Titre": "The MEATER is a game changer.",
          "Contenu": "The MEATER is a game changer.The wireless probe would be enough to make this device awesome, but the app is actually well written, easy to use, and does a good job of helping to predict when the cook will be ready.I've used several other wireless* (the probes weren't wireless, but wireless readout devices or phone connections) devices.  For those without a phone connection, they do okay, but you have another device to deal with.  For those that had phone connectivity, usually the app is a bit of a mess.  MEATER's app is pretty solid.  There's room for improvement in the UI, but it is leaps and bounds ahead of the competition.  Easy to use, guides you through cook setup, and the predictive capabilities are pretty good - not always precise, but it beats trying to figure it out yourself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Gandee",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T07:53:44.000Z",
          "Titre": "The MEATER is a fantastic tool!",
          "Contenu": "The MEATER is a fantastic tool! Everything we have cooked with it has come out perfectly cooked and juicier than ever. The app is simple to use, and it's quick and easy to set up a cook. Only takes a few seconds to be ready to go. I'll never go without one again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Balsley",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T07:09:58.000Z",
          "Titre": "I use my meater a lot",
          "Contenu": "I use my meater a lot. My last cook was some steaks. I reduced the recommended temp to 129 degrees and followed the directions in the app. The cook was excellent - seared on the outside and pink on the inside. Perfect!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Wendy",
          "Nb_Reviews": 3,
          "Date": "2023-11-12T21:21:26.000Z",
          "Titre": "Perfect results everytime great help for colour blindness",
          "Contenu": "My son purchased a meater as he is colour blind.  It assists him to know when his meat is cooked.  He purchased two as there was an offer, he gave the 2nd one to me for Xmas. What a fantastic gift, perfect results every time, in particular, steak is spot on! Cannot recommend highly enough! I wouldn’t be without it!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gary Soames",
          "Nb_Reviews": 15,
          "Date": "2023-12-03T18:07:54.000Z",
          "Titre": "Use the MEATER thermometer for first…",
          "Contenu": "Use the MEATER thermometer for first time and really easy to use with perfect cooking!! Love this gadget"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hubert Jeter",
          "Nb_Reviews": 3,
          "Date": "2023-11-20T04:40:07.000Z",
          "Titre": "This product is pretty awesome",
          "Contenu": "This product is pretty awesome. It gives you a reading of when the product will be completed when cooking for a prolonged period of time. It’s accurate within plus or -15 minutes. I was cooking a 7 pound rib roast at 225° and it was accurate this time within a few minutes. A wonderful product to have."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "MARTINSHARP",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T23:01:00.000Z",
          "Titre": "I can Check temps remotely - time saver for butchershop",
          "Contenu": "Very good product have used for about 4 years in my commercial smoker for my Butcher Shop to produce hams cabanossi  bacon and also for roasting meat for parties-particularly like that I can link to the cloud and check temperatures remotely A1 product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryee",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T07:04:06.000Z",
          "Titre": "My son gave me a MEATER for Xmas after…",
          "Contenu": "My son gave me a MEATER for Xmas after the thermometer in my Turkey gave out and I over cooked my Turkey a bit.  Since then I always use the MEATER for roasting roasts or whole poultry without having to monitor and open the oven and it comes out perfectly cooked the way I want.  I love my MEATER."
        },
        {
          "Note": 5,
          "Lieu": "LU",
          "Pseudo": "jp",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T10:31:59.000Z",
          "Titre": "The best in town",
          "Contenu": "The best in town.Cooking made easy with the app which guides you trough the experience. Even if something isn´t represented you can create it and adjust different parameters just as you wish.I love it and recommend it to anybody who likes cooking."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "World Roofing",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T14:50:40.000Z",
          "Titre": "The Meater is a game changer!!",
          "Contenu": "The Meater is a game changer!!! Easy to use, Works perfect!! The information while grilling is amazing, the app allows you to focus on other important things - Like The Football Game and still be a grill-master. I'm upgrading to the Meater Block for big family days."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ad",
          "Nb_Reviews": 6,
          "Date": "2023-11-13T10:09:58.000Z",
          "Titre": "Reliability was great",
          "Contenu": "Reliability was great, use of the app is very easy as it’s supposed to be ! Very accurate in time estimates when the meat is done, temperature of the meat was spot on ! Thanks for such a wonderful product !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Hutchison",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T06:48:41.000Z",
          "Titre": "The fact that the one probe told me",
          "Contenu": "The fact that the one probe told meThe internal temp of the meat and the ambient temp of inside the smoker was amazing. Also the guide for whatever meat you’re cooking in the app makes it super convenient and easy!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Alan",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T04:35:57.000Z",
          "Titre": "The meater+ thermometer takes the guess…",
          "Contenu": "The meater+ thermometer takes the guess work out of making a perfect prime rib. Right down to how long the roast should rest before cutting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Dennis Dorsey",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:34:38.000Z",
          "Titre": "Precise temperature control is the key…",
          "Contenu": "Precise temperature control is the key to good “low and slow” outdoor cooking on a Hasty Bake. The Meator is a superior product when it comes to temperature control."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Azevedo",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T15:08:42.000Z",
          "Titre": "Not a gimmick …",
          "Contenu": "Not a gimmick ….  The MEATER helps me cook steaks exactly the way we want them.  Have also cooked pork chops and tenderloin, tuna steaks and nice thick burgers to perfection .  I have bought 2 more for family .."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Van Flowers",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T18:52:32.000Z",
          "Titre": "Great Addition to my Grilling Tools",
          "Contenu": "I purchased the Meater + for the extended distance in my home. It was simple setup, never lost connection, and the internal temp of my brisket was spot on when the time on the Meater said it was done - GREAT addition to my Grilling Tools"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Svetlana",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T21:33:50.000Z",
          "Titre": "MEATER Plus is great tool to have a…",
          "Contenu": "MEATER Plus is great tool to have a great result with your cooking. Meat is tender, juicy and tasty 😋 I learned to cook Low & Slow and by using the MEATER you never go wrong with the result.  Highly recommendate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caleb Finken",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:44:25.000Z",
          "Titre": "Was looking for a high temp thermometer…",
          "Contenu": "Was looking for a high temp thermometer and this was is amazing. You can customize what temp you want things at. I like reverse pan searing so I like my steak at like 110F. Love this thermometer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Benjamin Dailey",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T13:24:51.000Z",
          "Titre": "Amateur griller of sirloin…now like a pro",
          "Contenu": "I am an amateur griller of sirloin steaks, but my family thinks I am a professional!  I've never been disappointed cooking medium rare perfect steaks using meater.  Also just used while trying the reverse sear method in the oven and then on stove top skillet."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Simon Graham",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T18:58:18.000Z",
          "Titre": "Meater probe! Impressive!",
          "Contenu": "Very easy to use and setup, great for roasts and bbq etc.First time using, very impressed.Shall definitely be using more often."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Word Warrior",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T07:29:47.000Z",
          "Titre": "AWESOME GIFT FOR THE NOVICE OR THE AMATEUR",
          "Contenu": "I highly recommend the MEATER. The quality I most enjoy is the tasty end product I consume for dinner with the minimal amount of effort to ensure a safe food product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Dunlap",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T20:20:24.000Z",
          "Titre": "I don’t know how I cooked without this",
          "Contenu": "I don’t know how I cooked without this.  I put food on smoker, open the app on my phone and go watch television.  When it beeps to say it’s done I go get it.  And every time, no matter what I cook, it’s absolutely perfect.  Great product."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bob Mills",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:59:46.000Z",
          "Titre": "Meater - It’s The Best!!!",
          "Contenu": "Meater is the most Amazing meat thermometer available!  Try it once and you’ll be hooked - you will LOVE the Meater AND the Results!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Sasso",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T05:30:36.000Z",
          "Titre": "Excellent product idea",
          "Contenu": "Excellent product idea, well implemented.. especially useful for pellet grilling since I don’t have to open the grill cover to check the condition of the meat."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Margaret Holdstock",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:43:15.000Z",
          "Titre": "Meat is perfectly cooked using meater as a guide.",
          "Contenu": "Knew I could rely on my meat being properly cooked by using meater. Could check on my phone when I needed to remove from the air fryer to rest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl Pratt",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T09:04:06.000Z",
          "Titre": "Perfect reverse sear.",
          "Contenu": "The ease of use and the perfection that occurs when using the MEATER!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rod",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T08:10:48.000Z",
          "Titre": "Easy to hook up to my phone",
          "Contenu": "Easy to hook up to my phone, one of the easiest to navigate,  works as advertised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Vanderlinden",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:55:31.000Z",
          "Titre": "Making mom in laws birthday dinner…",
          "Contenu": "Had to make Steak au Poivre for my mother in laws birthday. Perfectly cooked 6 tenderloin steaks to medium rare perfection. Couldn’t have done it without MEATER!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T05:48:49.000Z",
          "Titre": "So nice to have accurate temp.",
          "Contenu": "So nice having an in dwelling thermometer for the whole cook. My smoker’s Bluetooth wasn’t working but I was about to monitor the temps and time with the Meater+! It agreed exactly with the smoker’s temp probe! Easy-Peasy!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbe Crissman",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T23:51:19.000Z",
          "Titre": "Everything has been perfectly cooked",
          "Contenu": "Everything we have used the Meater Plus on has been perfectly cooked. I started with grilling some super thick chicken breasts. My husband bought the Meater Plus as we had just gotten the new grill to downsize and I really wanted to sharpen my skills since I never touched \"his baby\" as he was/IS the grill master LOLHe was sure the meat was going to be dry as dust but to his surprise- the meat was perfect and juicy! EVERYthing has worked that way with the Meater Plus!We have mostly use it in our new Little Akorn grill but have also used it in our NuWave Bravo toaster oven.Most important thing you can remember is to keep the square end clean! That's how it communicates the info. (I had to look up that info with by browser search!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Mesa",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T23:39:20.000Z",
          "Titre": "Perfection!",
          "Contenu": "My husband is usually the one in charge of cooking/grilling/roasting. I used this for the first time and my roast came out absolutely perfect! I impressed my husband and father-in-law! I tried it a second time weeks later and once again it did not fail to impress. We absolutely LOVE Meater. I will not cook/roast without it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MR. SCOTT NOVAK",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:22:24.000Z",
          "Titre": "Meater makes a great heat probe and the…",
          "Contenu": "Meater makes a great heat probe and the software to use the probe is EXCELLENT and easy to use.  Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Ambrose",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:00:44.000Z",
          "Titre": "Smoked turkey",
          "Contenu": "The MEATER device was very helpful for this first attempt at smoking a whole turkey. Love the technology."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee Kissell",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T16:11:01.000Z",
          "Titre": "Meater is Great",
          "Contenu": "The Meater was easy to set up, it connects to the app reliably, and I love using it for high-temp cooks. Great product!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jerry Kurbatoff",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T15:53:08.000Z",
          "Titre": "Perfect Roast",
          "Contenu": "Perfect Roast, The roast come out perfectly. While i was busy entertaining guests I was able to focus on time with them rather than checking on the cooking time and the readiness of the roast."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Adrian Pearce",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:41:12.000Z",
          "Titre": "This is the perfect item for anybody",
          "Contenu": "This is the perfect item for anybody. Simple to use well worth the money, never over/undercook ever again…Perfect every time…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lee McLain",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T21:51:34.000Z",
          "Titre": "Warming up Leftovers",
          "Contenu": "Monitoring the temperature of your food and the oven at the same time without opening it is a real bonus. These units work extremely well"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Cain",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T17:03:45.000Z",
          "Titre": "Best to for grilling any meats",
          "Contenu": "The ease of use and guided cook takes guess work out of cooking! The connectivity makes it great that you can be anywhere and see how your food is cooking"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Vincenzo Saporito",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T15:25:21.000Z",
          "Titre": "A thermometer for a friend...",
          "Contenu": "I already had a cooking thermometer, I consider it an indispensable tool in the kitchen.  But this Meater is a revolution!  With precision measurement, splendid and elegant packaging and a truly excellent and functional application... You can relax during your barbecues, he will take care of everything.  Highly recommended for anyone looking for perfection."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Family_printer",
          "Nb_Reviews": 8,
          "Date": "2023-11-27T17:51:58.000Z",
          "Titre": "Meater is great perfect roasts…",
          "Contenu": "Meater is great perfect roasts evertime. Chicken that is never dry. Beef cooked just the way we like."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Merrill",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T03:03:34.000Z",
          "Titre": "Easy to use and temperature was perfect…",
          "Contenu": "Easy to use and temperature was perfect on the pull and rest temp. Beef round came out cooked to perfection thanks to MEATER and seeing what was going on."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Susan Kew-Pattison",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T01:44:28.000Z",
          "Titre": "Love this thermometer",
          "Contenu": "Love this thermometer! I’ve had it for two+ years and it’s still working great. It has never let me down."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T H",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T04:55:23.000Z",
          "Titre": "I find the MEATER to be easy, accurate and reliable",
          "Contenu": "I find the MEATER to be easy, reliable and accurate. No cord attachments to get in the way of other items or food being cooked. The MEATER provides accurate information directly to my smartphone about the temperature of the cook and best of all the TIMING of the cook which helps in coordinating the preparation of the other accompanying items of the meal.  The MEATER helps to ensure the item I am cooking achieves the desired level of “doneness.”"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs Tara Balding",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T23:30:49.000Z",
          "Titre": "Great for our unreliable aga",
          "Contenu": "Used for the first time today cooking roast beef in my very old, temperamental Aga. Our beef was perfect. first time ever in this cooker. Christmas is back on!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Heinbokel",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T18:52:05.000Z",
          "Titre": "Perfectly cooked turkey!!",
          "Contenu": "Used my MEATER to track the progress of my Thanksgiving turkey. The bird came out perfectly done. Love this product."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Herkko Hoo",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T22:26:24.000Z",
          "Titre": "Easy to use and very accurate great…",
          "Contenu": "Easy to use and very accurate great device. Aleays had A perfect result With different kind of meat. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick West",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T06:41:12.000Z",
          "Titre": "Love my Meater meat probe!",
          "Contenu": "Tonight I cooked steak and chicken for 15 people, I used one prob for the chicken  and one for the the steak I usss a smoker with indirect heat and everything was cooked perfect! It never would have turned out if I hadn’t used my Meater!"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Tim Grant",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:35:52.000Z",
          "Titre": "Never thought I would need this bit of…",
          "Contenu": "Never thought I would need this bit of kit but felt I need to try it as my daughter bought it for me as a gift. I love the accuracy it provides on various heats of BBQ. Love using it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T19:02:16.000Z",
          "Titre": "Thanksgiving turkey was perfect",
          "Contenu": "Thanksgiving turkey was perfect.  Breast was 165.  Dark meat was 179.  12 pound turkey done in two hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eduardo Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T04:05:06.000Z",
          "Titre": "Easy Temperature Probe",
          "Contenu": "Used the probe to keep track of the temp while smoking a briaket overnight and it was pretty nice.  The app was easy to use and get the probe set up.  There was about 5 to 10 second instructional videos each step to set it up.  Overall I really liked this product so far, it is a bit pricey but it's simple to use.  Well see how long it lasts as time goes on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Lukowski",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T02:31:44.000Z",
          "Titre": "Love my Meater 😍",
          "Contenu": "Cooked the Venison Back strap wrapped in bacon to perfection. So delicious. Love the Meater."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lee Moore",
          "Nb_Reviews": 3,
          "Date": "2023-11-03T18:44:09.000Z",
          "Titre": "Meater thermometer",
          "Contenu": "This is buy far the best thermometer I've owned with the app make it so easy to cook amazing meat, would highly recommend 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Marrs",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T04:34:22.000Z",
          "Titre": "Worked like an old school fireman"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Bartlett Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:35:21.000Z",
          "Titre": "I love my MEATER!",
          "Contenu": "I love my MEATER! I have it set up on my iPad.   I put the iPad on the counter and can focus on other aspects of the meal without having to run outside constantly to check smoker and internal temps."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Wagner",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T06:12:51.000Z",
          "Titre": "Never lose heat opening the door again",
          "Contenu": "It is fantastic to have a completely wireless terminator. I never have to open a door because I know what the internal temperature AND the ambient temp is."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Sheard",
          "Nb_Reviews": 37,
          "Date": "2023-11-04T23:09:26.000Z",
          "Titre": "Meater is not just for meat!",
          "Contenu": "I've used the Meater as advertised, i.e. for meat, and it has been great. Perfect roast beef and chicken.Today, I went a bit off piste and used it to judge when my baked potatoes were ready, i.e. not meat! Set the target temperature to 93° and put the probe into the largest of 4 large potatoes and put them in my air fryer. 1 hour later my phone told me they were ready and it was correct - they were perfect 😁"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T05:01:28.000Z",
          "Titre": "An essential cooking aid.",
          "Contenu": "I have been baking and cooking for over 50 years.  The meater is accurate and easy to use.  Meat comes out tender, juicy and delicious.  This is one of the best gifts my husband ever gave me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Chevalier",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T15:40:28.000Z",
          "Titre": "Great Combination of Product and App",
          "Contenu": "Made Spatchcock chicken on Big Green Egg using Meater and it was done perfectly.  This was one of the first times using Meater and it lived up to the marketing 110%!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen James",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T02:45:49.000Z",
          "Titre": "Meater plus works exactly as intended…",
          "Contenu": "Meater plus works exactly as intended and makes it very easy to get excellent results.  Very solid software with good cooking guidelines, helpful notifications and very easy to track progress as the cook progresses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Hansen",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T03:19:41.000Z",
          "Titre": "Love the ambient temp .",
          "Contenu": "Love the ambient temp .I have a Pit Boss vertical. It's about 20 degrees off.Don't care cause this Meater is spot on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 14,
          "Date": "2023-11-04T08:36:48.000Z",
          "Titre": "BBQ meat thermometer",
          "Contenu": "Really helped with managing bbq temperature and with meat internal temp. Notifications helpful also as the cook was over 6 hours and I am very forgetful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Avila",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T06:52:16.000Z",
          "Titre": "Bone in chicken thighs",
          "Contenu": "Used for the first time w bone in skin on chicken thighs! Baked in oven on baking sheet at 425 with the rack on top of the baking sheet and the skin got crispy, everything cooked so evenly. Seriously fool proof!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Doggett",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T03:04:52.000Z",
          "Titre": "Only Thermometer I Use Now",
          "Contenu": "I have so many thermometers for grilling/smoking. Most are pretty complicated. My Meater+ is user friendly and accurate. It’s the only one I use now. Btw, their app is kinda perfect! Kudos to you!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Jack Fenaughty",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T07:59:41.000Z",
          "Titre": "Easy as!",
          "Contenu": "Easy to use, good instructions through the app and good online help"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Angela Peacock",
          "Nb_Reviews": 8,
          "Date": "2023-10-22T16:04:32.000Z",
          "Titre": "MEATER a must for roasting",
          "Contenu": "I was dubious but MEATER is a marvellous device for accurately cooking meat.  My roast chicken was cooked to perfection.  I would definitely recommend everyone gets one for safety and excellence in their cooking"
        }
      ]
    }
  ]
}