{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "mmarineonline.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Haniebnik",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T05:32:47.000Z",
          "Titre": "Credit cards are mandatory",
          "Contenu": "Credit cards are mandatory.  ACH is good but wire transfers I will never do with an online company I never heard of before."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert David",
          "Nb_Reviews": 5,
          "Date": "2023-01-26T22:59:19.000Z",
          "Titre": "Bad Business Practice",
          "Contenu": "I was sent 2 Vetus Macerator Motor that was not put together properly. I returned the 2 Motors that I paid for and received another Motor for replacement. I was told that I would receive a refund on one of the motors and did not. Now I  cannot get the Salesperson to answer talk to me. Bottom line I paid for two working motors and only received one working motor. I feel that they should have refunded  for the first motor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RICARDO HERNANDEZ",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T14:57:52.000Z",
          "Titre": "Bought a refrigerator unit",
          "Contenu": "Bought a refrigerator unit. Three days later call to return it without even opening or installing the unit, package was as original and they didn't want to receive it back. Only if they charge a 25% restocking fee. Very convenient for them. I also try to change it for the unit that i really needed and pay for the difference but then they were 1000 dollars over the price of the unit in different competitors."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Ambro",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T19:20:18.000Z",
          "Titre": "Steer clear",
          "Contenu": "Scam company. Ordered a trolling motor remote because they were supposedly the only ones with it in stock. They switched my receipt to show a different item (the one I was avoiding) and said it was my fault. I've ordered this part 6 times from various retailers in the past 5 years and I know the one to avoid. The one they sent doesn't even match the price on there website for the item shipped but it did match the item I wanted. They offered to take it back with a 25% re-stocking fee and would mail out a check. Wouldn't trust that in a million years from this company. They also told me it was my fault for not calling them to make sure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken Grayson",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T04:44:08.000Z",
          "Titre": "I'm baffled why you would ask for a…",
          "Contenu": "I'm baffled why you would ask for a review from me. I ordered water heater and you explained that it will only come at the end of March.  That's fine, but you didn't mention that you would be charging me in full, over $1200 almost 2 months in advance!  I would never have agreed to such a thing and I'm not happy about it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Breanne Happell",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T22:46:25.000Z",
          "Titre": "WORST SERVICE BUY ELSEWHERE",
          "Contenu": "WORST SERVICE BUY ELSEWHERE.  This company screwed my girlfriend and I over on a fridge that we bought for our van.  I want to inform you that this was the worst customer service I have ever experienced.  I will make sure to never purchase from you again and leave as many review as possible to inform others to do so.  The fact that you can deliver a broken fridge that I spent $2500 on and then blame me for not having enough pictures is utterly ridiculous.  I sent pictures of the damage and have pictures showing the damaged box but those \"aren't good enough\".  You have no understanding of the people who buy your products (living on the road or on the sea) when you can't understand that I don't live at home so am not able to send it back at the immediate date you said.  Also only offering 75% refund and having me pay for shipping is already not okay.  I tried to work with you guys and be understanding but it seems that screwing your customers over with the cost of broken shipments is your only goal here.  I hope at some point you can learn to be more understanding of people's circumstances when they are living on the road and take responsibility for shipments that arrive damaged.  But now I get to try and bend this heat sync back because I'm down $2500 on a broken fridge and am already crazy tight on money.  But you guys don't seem to care about that at all.Thanks for screwing me over, hope that extra 2 grand is able to help you as much as it would have helped me right now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kel Sanderson",
          "Nb_Reviews": 1,
          "Date": "2022-03-20T04:51:40.000Z",
          "Titre": "Phone service is good",
          "Contenu": "Phone service is good, but the website is very poor, it crashes alot and proctor codes don't work..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Breanne Happell",
          "Nb_Reviews": 2,
          "Date": "2021-08-12T22:10:19.000Z",
          "Titre": "WORST CUSTOMER SERVICE EVER BUY…",
          "Contenu": "WORST CUSTOMER SERVICE EVER BUY ELSEWHERE. I SPENT $2500 ON THIS FRIDGE TO HAVE IT ARRIVE BROKEN AND NOT BE REFUNDED ANYTHING.   The fridge itself is wonderful and I don't want this review to reflect on the Isotherm Fridge line, this review is strictly a complaint against MMarine and their handling of the fridge. I ordered this fridge three months ago and it arrived on a pallet.  I had to pay $500 for shipping.  The fridge is intended for my van which I live out of full time. I wasn't able to open the fridge for a few weeks since I was traveling but when I did open it I immediately saw that the fridge had been damaged during shipping. The heat sync had been smashed in, the fan was broken and refrigerant could be heard leaking from the fridge. I took pictures of the damage and submitted these to MMarine.  I also submitted pictures of the damaged box from before I opened the fridge (in these pictures there was things resting on top of the box and MMarine argued that that was what caused the damage even though if you look at the damage pictures attached it would take a dropped shipment to smash the heat sync the way that it was).  All of this was not enough to get the shipping insurance that I paid for.  They then would only offer me a 75% refund after I paid to ship it back (so I would be down $1000 from the $500 shipping cost and 25% refund loss).   I told them that I did plan to send it back but that I was on the road and wouldn't be able to do so for some weeks and when I did go to return it later when I made it back to my storage unit they said it was no longer an option.  Overall this company has no understanding for the lifestyle of people living out of vans or boats which is their entire audience that they are selling to. I SPENT 2500 ON A FRIDGE THAT ARRIVED BROKEN AND GOT NO REFUND.   I now have to figure out repairing this fridge myself so I'm not down all of this money.  DONT SUPPORT THIS COMPANY AND AWFUL CUSTOMER SERVICE TAKE YOUR MONEY ELSEWHERE."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AK",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T21:33:26.000Z",
          "Titre": "Parts showing available but on back order",
          "Contenu": "*Edit/Addition*The company has been solid with response and communication.  There is no fault with this.  The reason for below average rating at this time is due to incorrect listing as ‘Available Now’.  There were multiple other ‘go to’ online resources showcasing the specific item on back order and with competitive pricing…however, upon finding this company showcasing ‘immediate availability’, the decision was made to initiate an order for the first time with this particular company.  Later, finding it was the same situation of back order.  ~~~~~~~~~~ end edit This review is simply a result of current situation…ordered product over a month ago due to finding the desired product as clearly listed ‘AVAILABLE’ per the website.  Ordered (2) to have a spare and added shipping expecting to receive in 3-5 days per info received during processing.  Then received notice the parts are not available as listed and on back order.  Almost a month to the day and still yet to receive the parts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine Kexel",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T07:10:10.000Z",
          "Titre": "It took too many days to get an answer",
          "Contenu": "It took too many days to get an answer. Then when he decided it wasn’t the part he needed, I reached out to you and you never responded"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T01:39:55.000Z",
          "Titre": "Sorry, go somewhere else.",
          "Contenu": "I ordered a cabin light from you, it came within a week but it'd color didn't match others in the cabin so I asked if I could return it..  You stated yes, within 30 days but there was a restocking fee of 25%.  Restocking fee?  It is a small box that would take someone 5 minutes to walk into your warehouse and place it on the shelf. So I will keep it and see how I can make it work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Keith Banks",
          "Nb_Reviews": 1,
          "Date": "2021-02-04T01:46:11.000Z",
          "Titre": "Your service was great",
          "Contenu": "Your service was great. However I paid 45 dollars to over night my part for a customer. The part didn’t show up till 1:00 the following day delaying the customers trip. Could have saved money going 2 day. My recommendation is requesting that they don’t ever use USPS for over night."
        },
        {
          "Note": 3,
          "Lieu": "OM",
          "Pseudo": "Tamir",
          "Nb_Reviews": 3,
          "Date": "2021-07-23T04:35:38.000Z",
          "Titre": "There was a delay in sending the order…",
          "Contenu": "There was a delay in sending the order confirmation email, to which I had to send a couple of reminders. The shipping of my item is taking time and not as fast as expected, it is passing through (transiting) in many routs to get to me when it could have just transited in 1 or 2 main hubs then straight to my country for delivery as many other service provides do. I think your company has a lot of potential, but not quite there yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fergy",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T00:03:04.000Z",
          "Titre": "Bulletproof buds",
          "Contenu": "Bulletproof buds!  Sound is a bit tinnish compared to some other buds, however, I live in Florida and need waterproof and durable over hi fidelity"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristie Higdon",
          "Nb_Reviews": 3,
          "Date": "2021-05-11T17:53:15.000Z",
          "Titre": "The staff at MMarine Online were very…",
          "Contenu": "The staff at MMarine Online were very friendly and helpful, but their shipping service was greatly lacking.  I ended up having to cancel my order unfortunately because of all of the issues with the shipping and delivery company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodney Lynch",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T15:52:19.000Z",
          "Titre": "Good product only trouble was not in…",
          "Contenu": "Good product only trouble was not in stock had to wait 3 weeks. But they did communicate about when it was arriving"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Haines",
          "Nb_Reviews": 3,
          "Date": "2023-07-24T00:42:41.000Z",
          "Titre": "Rapid response, good prices, quick shipping",
          "Contenu": "Company was ultra fast in response time, shipping, and communication. Got free shipping due to order total, which was nice. Only issue was the part arrived slightly bent (flange for a fridge, so not a huge deal)."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "William Kidd",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T02:16:39.000Z",
          "Titre": "Great online service",
          "Contenu": "Great online service. Part was showing in stock on line but was not available. Follow up by phone was much appreciated but shipping went via FedEx ground vs UPS, not really sure why. Good recovery though and parts received ok. I have the app and have used / will use again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MikeM",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T19:41:43.000Z",
          "Titre": "Good customer service, slow shipping",
          "Contenu": "I was able to order the item I needed. Communication and correspondence went well. My only complaint is that it took a while longer than i expected to actually get the item shipped out. It was a couple days before a shipping label was generated and several more before the item actually went out via UPS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pirate Cap'm",
          "Nb_Reviews": 1,
          "Date": "2021-05-11T22:32:04.000Z",
          "Titre": "Ordered and delivered in a timely…",
          "Contenu": "Ordered and delivered in a timely fashion.  Had a quick online chat with customer service because I had not received any update on delivery eta since I placed my order.  I was told it was ready to ship that day and sure enough it shipped and received in good working order.   My windlass is now operational again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darryl Dye",
          "Nb_Reviews": 2,
          "Date": "2021-12-06T17:53:56.000Z",
          "Titre": "I would have given them 5 stars except…",
          "Contenu": "I would have given them 5 stars except for the carrier they shipped with that doesn't have a very good rating on trustpilot (98% bad). They answered my text late on a Saturday, called me to help answer a question, and packaged my Isotherm fridge very well for delivery. Only negative was their choice of shipping carrier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen  Russcher",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T14:09:09.000Z",
          "Titre": "customer service was awesome and responded quickly!arrived damaged....the packaging was…",
          "Contenu": "arrived damaged....the packaging was not substantial enough to keep the flange from bending.after working with the staff, THEY WERE VERY QUICK TO MAKE IT RIGHT! THANKYOU!very top notch customer service, i am changing the review to reflect that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Pinkerton",
          "Nb_Reviews": 2,
          "Date": "2021-09-06T22:05:59.000Z",
          "Titre": "Overall good experience VERY GOOD.",
          "Contenu": "Overall good experience. They had what I wanted in stock and shipment arrived in good shape. Only thing I would improve on is time reduction from order receipt to shipping ( took 3 days in house).I will order from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Mongold",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T00:07:23.000Z",
          "Titre": "Good prices",
          "Contenu": "Good prices, Helpful communications when one item was not in stock."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich Miller",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T23:01:26.000Z",
          "Titre": "I think they lied  to get my money",
          "Contenu": "They went out of there way to contact PayPal and make them give me my money. I tried dealing with PayPal for a couple weeks with no luck. Thanks again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "beck peach",
          "Nb_Reviews": 3,
          "Date": "2022-10-06T18:37:14.000Z",
          "Titre": "just bought a boat and it is completely…",
          "Contenu": "just bought a boat and it is completely amazing, but it was shipped too late on that day ((("
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Dylan",
          "Nb_Reviews": 2,
          "Date": "2022-02-03T08:57:27.000Z",
          "Titre": "Excellent boat supplies and good…",
          "Contenu": "Excellent boat supplies and good services. Will surely buy again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2020-08-16T17:06:33.000Z",
          "Titre": "Purchased and isotherm icemaker",
          "Contenu": "Purchased and isotherm icemaker, came in boxes that very damaged. Called them, they told me they would take care of it if it did not work. Very good customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T14:38:26.000Z",
          "Titre": "Mmarine is great, but delivery is terrible",
          "Contenu": "Mmarine has been absolutely wonderful to work with, but the delivery company they use was the worst I’ve ever experienced. They claimed they couldn’t get ahold of me, yet I did not ever receive a phone call, voicemail, text, or email. When I contacted Mmarine, they would help immediately and always answered. The 4 stars is only given due to the delivery company, which took multiple days to finally deliver my product. I waited at my house three separate days from 9-3 as directed and still received my purchase at 3:45 on the third day’s attempt. When the truck arrived, the delivery person would not drive the truck to my house (staying at the top of a hill about 50 feet away) and wouldn’t even drop down the truck’s lift, which I needed as I had to carry a fridge out of a large truck. I do not blame Mmarine for this terrible service, although for their sake I do hope they choose a better delivery company in the future as it hurts their business. Looking forward to finally having my new fridge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff L",
          "Nb_Reviews": 2,
          "Date": "2020-07-21T03:17:16.000Z",
          "Titre": "Great price on a Isotherm fridge",
          "Contenu": "Great price on a Isotherm fridge.  Easy company to deal with and they ship product right away."
        },
        {
          "Note": 4,
          "Lieu": "NO",
          "Pseudo": "Frithjof",
          "Nb_Reviews": 5,
          "Date": "2022-04-14T20:04:32.000Z",
          "Titre": "Great customer service.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Macmahon",
          "Nb_Reviews": 1,
          "Date": "2021-08-21T17:20:13.000Z",
          "Titre": "all was fine",
          "Contenu": "everything was fine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Henderson",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T18:21:36.000Z",
          "Titre": "My new Favourite boat store",
          "Contenu": "I just discovered Mmarine and it is my new favourite store.  They have an incredible inventory of parts.  Masoud is a master at finding “hard to find parts.”  The whole line online experience from order to delivery is exceptional. You get a constant stream of notifications about your order processing. Shipping is free and the parts come much faster than I expected.  Nothing but good things to say about the company and the customer experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan Duford",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:24:55.000Z",
          "Titre": "From the first phone call and the…",
          "Contenu": "From the first phone call and the follow up emails until receiving the new ice maker delivered to Dominican Republic it was a flawless experience. Something that seems to very rare these days. To say I was impressed would be an understatement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Reith",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:05:23.000Z",
          "Titre": "Wonderful experience!",
          "Contenu": "Wonderful experience!From the moment we called the team was knowledgeable about the item we bought-The time frame provided was accurate-They informed us of potential delays, but luckily, it was not our case-Good service, accurate information and products supplied on time-"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Rabih",
          "Nb_Reviews": 3,
          "Date": "2023-10-29T00:55:58.000Z",
          "Titre": "They went the extra mile.",
          "Contenu": "I had several irregular asks from the team at MMarine regarding parts for my boat. This included technical questions, servicing requests, accepting (several) part returns and processing refunds. All throughout the team at MMarine was informed, courteous, fast, and willing to go the extra mile. I appreciate all of that."
        },
        {
          "Note": 5,
          "Lieu": "BS",
          "Pseudo": "Kenneth Herd",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T00:04:39.000Z",
          "Titre": "Outstanding service from Mariner Marine",
          "Contenu": "The quality of service we received from Mariner Marine Services was second to none! Drew and the team tackled a very difficult repair job to test and fix all of our boat electronics that were damaged by a lightening strike. They worked cost efficiently, professionally, and met some very tight deadlines. I would not hesitate to highly recommend Mariner Marine Services to anyone needing a wide range of marine services. They get the job done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramona M",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T16:06:09.000Z",
          "Titre": "Excellent Service!",
          "Contenu": "I cannot say enough great things about MMarine Online.  They are very well informed about all of their products and they have a boater’s mentality of always finding a solution to the problem.  I needed to replace a Vitrifrigo refrigerator and Adriana went over and beyond to help me find Vitrifrigo’s latest model replacement.  She also sought out other replacement options for us to consider.  No hard selling here.  They are smart enough to know that if you are happy with their service and products you will come back.  I definitely recommend them for all of your marine needs.  They have competitive prices and carry all top manufacturers products at lot lower prices than West Marine or other marine suppliers.  They are now MY GO TO PLACE!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Perkins",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T11:54:12.000Z",
          "Titre": "The Best Service I've Ever Seen",
          "Contenu": "This review may sound over the top but it's commensurate with the service they provided. I can't say enough about the extraordinary attention Ken paid to my recurring engine problems.Eventually I felt so beholden to him that I asked to pay for his time and effort. He said, \"We don't do that here, we just want to get your engine running.\" Which they did, systematically and efficiently. Moyer Marine should be an example to all organizations of how to put the customer first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "igor",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T19:20:08.000Z",
          "Titre": "A Pleasant Surprise!",
          "Contenu": "I recently had a delightful experience with one of your salespersons. Their knowledge and expertise were impressive, providing thorough answers to my questions. They went above and beyond to ensure my satisfaction and offered valuable insights. Our conversation was enjoyable, and their friendly nature made it feel like talking to a knowledgeable friend. I only wish I had found your site sooner. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Jablonski",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T21:37:15.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Very good experience buying an AC system from mmarine. Got on a chat on their website at 10pm one evening and Mark responded in like 30 seconds. I think Mark will be a go-to vender for my wife and I as we transition our Liberty 458 sailboat into bluewater cruising.Well done!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff E",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T20:00:21.000Z",
          "Titre": "What can I say.",
          "Contenu": "What can I say.. except. Great Customer service. Placed my order and somehow got ordered twice. They personally called me to check before billing me the 2nd time for the parts I ordered. This is the 2nd time using them and both times had a great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Wagaman",
          "Nb_Reviews": 2,
          "Date": "2022-06-22T22:16:23.000Z",
          "Titre": "Quality Service",
          "Contenu": "I have made two different purchases for two different boats roughly a year apart from each other. Both time's were for large refrigerator units and both time's I had great customer support and the units were shipped in a timely fashion and showed up without blemish and on time. It's hard to find companies these days who still provide quality customer service and good products, but MMarine does both extremely well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2021-02-12T02:40:53.000Z",
          "Titre": "The BEST!",
          "Contenu": "MMarine was excellent to do business with. Although the product I ordered was delayed by several months due to manufacturing delays, Mark constantly gave me updates and offered other options (even offering to cancel the order and refund the money). Eventually the refrigerator showed up but was damaged by the carrier. I emailed MMarine in the evening (about 6pm Pacific time) and got a phone call within 15 minutes from their 24 hour customer care center. Amazing. Within 3 days, a new door for the fridge was shipped to replaced the damaged one. These guys are awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "F. Caison",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T22:00:58.000Z",
          "Titre": "Above and Beyond",
          "Contenu": "MMarine's provided exceptional service and their promptness significantly exceeded my expectations. They had in stock a part that was not to be found in my region and at a price was lower than the boat supply stores here. The item arrived the next day, as promised. Plus, they were pleasant people to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter King",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T02:50:31.000Z",
          "Titre": "These folks are incredibly helpful and…",
          "Contenu": "These folks are incredibly helpful and responsive. We had an obscure need for a part which we couldn’t find anywhere. They investigated with the manufacturer and came up with the perfect solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Smith",
          "Nb_Reviews": 1,
          "Date": "2020-12-26T00:41:05.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "Excellent customer service! Mark contacted when the order was ready to ship and sent a photo of what shipment looked like when it was sent and when the shipment should be expected. Good thing too. To none of their fault it didn’t arrive when. After contacting Mark, he followed up immediately. When the shipment arrived there was damage to the door. After contacting Mark again he immediately sent out a replacement. So because of how they handled it when thing didn’t go quite right I give them 5 stars and would recommend them to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kikila",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T15:33:05.000Z",
          "Titre": "Unmatched customer service!",
          "Contenu": "The service I received along with the personable staff was outstanding. They took the time to explain the available options of a fridge and freezer that would best fit my space. These guys went above and beyond to turn a first time customer into a loyal customer. Thank you for satisfying my dozens of questions, I look forward to making my purchase with mmarine online."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Pitti",
          "Nb_Reviews": 2,
          "Date": "2021-11-17T13:27:18.000Z",
          "Titre": "The customer service representative was…Adriana",
          "Contenu": "The customer service representative was very thorough in finding out the exact parts that I needed for my Isotherm refrigerator.  The warehouse was closed by the time we confirmed the parts, but she emailed me the next morning to confirm that you had them in stock.  I place the order and they arrived quickly!  I felt like she went above and beyond to help me and I totally appreciated her efforts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yraldo Marrero",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T00:37:03.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Highly recommend. An error was made with my order and they immediately picked up the wrong item and sent out the correct one. Very happy and pleased with there customer service. Something we don’t see very much of anymore. Thank You for taking care of your customers the way you do…"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Warren Lewis",
          "Nb_Reviews": 3,
          "Date": "2021-09-24T03:26:07.000Z",
          "Titre": "Outstanding service and phone support.",
          "Contenu": "Service and communication with MMarine was outstanding. They helped me find the key pieces I needed to complete my refit and arrange shipping to the west coast. While they are a bit more expensive than some of the other sites. They are always above board and letting you know exactly what is in stock and when it can go out the door. They also are good at explaining what is on order, where you are in the queue, and are watching to find opportunities to get what you need faster. Definitely will use again and again as I continue with the next phase of refit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daryl Gordon",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T16:21:33.000Z",
          "Titre": "Best of the Bunch!",
          "Contenu": "I'm always a bit leery about ordering an expensive item from a company or someone I don't know.  So, I called them to talk with them about my needs for a 12v RV refrigerator, and the refrigerator I was looking at on their website.  The person who answered the phone was knowledgeable about the products, when the item would be shipped and the expected delivery date.  When there was a delay from the manufacturer, I received a call letting me know about the delay.  Frankly, I can't say enough about their customer service.  They are at the top of my list of companies to do business with in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reinae Kessler",
          "Nb_Reviews": 2,
          "Date": "2021-01-07T21:24:05.000Z",
          "Titre": "Amazing care, attention and customer service!",
          "Contenu": "I have had the pleasure of working with MMarine Online over the last couple months.  The refrigerator I ordered is unavailable at present and they follow up with me regularly to keep me posted on what is happening.  I have been working with multiple vendors over the last three months during my van conversion and I can wholeheartedly say, that this company is by far the most professional, and has the beat customer service of any I have worked with.  5 stars all the way!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dtruzinski",
          "Nb_Reviews": 2,
          "Date": "2021-11-29T15:00:17.000Z",
          "Titre": "Amazing Customer Service",
          "Contenu": "Amazing Customer Service! First, they text me pictures of the item on the pallet and notified me of the shipping. That was pretty cool and had a personal touch. Late one Friday evening, well after their business hours, I realized that the item had not arrived and suspected an issue with the shipping. I sent an email. Given the time of day, I was fully expecting a reply email on Monday morning; however, I got a response in minutes! They were on it and had an update from the shipper. The item arrived and was in excellent condition. I would be remiss to not mention awesome products and great prices. I highly recommend MMarine Online!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David C",
          "Nb_Reviews": 6,
          "Date": "2023-05-20T13:26:37.000Z",
          "Titre": "The refrigeration unit was good quality…",
          "Contenu": "The refrigeration unit was good quality and was shipped promptly once they had it in stock.My only criticism is that the website indicated that the unit was in stock when it wasn't,  resulting in a week's delay."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Walter van Builder",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T21:49:35.000Z",
          "Titre": "Well I'm doing a van build so I'm…",
          "Contenu": "Well I'm doing a van build so I'm ordering everything a lot of times it gets difficult and I have to call people back this is not the case here everything went smooth and that's to be noted as something good. Because in these times it's hard to find people who actually care about what you're doing and the product is selling. Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry Greenfield",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T03:36:16.000Z",
          "Titre": "Excellent Customer service",
          "Contenu": "Excellent Customer service.  I was promptly contacted about my order concerns.  Once we determined that what I ordered was incorrect I was asked to return product for a full refund."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Chad Cirillo",
          "Nb_Reviews": 5,
          "Date": "2023-01-25T11:13:38.000Z",
          "Titre": "I got the cheapest price ever for my…",
          "Contenu": "I got the cheapest price ever for my MPS 12 Series DC / SC 12000 BTU Self Contained Marine Air Conditioning Unit - Copper Fin With Pump. Fast delivery and good product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim F.",
          "Nb_Reviews": 5,
          "Date": "2021-09-13T17:06:01.000Z",
          "Titre": "Staff was pleasant and knowledgeable",
          "Contenu": "Staff was pleasant and knowledgeable, a pleasure to work with.  They did dye diligence to make sure that the part I was buying was the correct replacement.  Then the transaction went as planned, part delivered on schedule as promised.  I will buy from them again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer P",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T16:32:05.000Z",
          "Titre": "You won a new customer",
          "Contenu": "I had never heard of this company before my order, and had concerns about working with a new vendor.  The customer service was such a wonderful experience!  They got my item shipped fast, made themselves available any time to answer questions and get my order placed correctly, and I PROMISE I will use them again, and recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tami",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T23:13:00.000Z",
          "Titre": "Beginning to end...positive experience",
          "Contenu": "From the first phone call I made asking questions about a product, to the last phone call to deal with a dented refrigerator, (shippers fault) the interaction with MMarine was professional.Each person I spoke with was positive and courteous and made sure I was a satisfied customer.I would buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis",
          "Nb_Reviews": 2,
          "Date": "2021-06-22T21:38:32.000Z",
          "Titre": "Unrivaled Customer Service",
          "Contenu": "Marc and colleagues stand out in today’s providers of customer service! They truly want your repeat business in how your treated after the sale you won’t be disappointed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Neff",
          "Nb_Reviews": 2,
          "Date": "2021-04-20T13:13:22.000Z",
          "Titre": "The site was easy to navigate",
          "Contenu": "The site was easy to navigate. They had what I was looking for. Although it was on back order they called me the next day to make sure I understood it was on back order and wouldn't be immediately available. I appreciated their concern. I did not need it immediately so it was not a problem for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Capt. David",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T05:45:00.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery. Within a few hours."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tenway LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:41:07.000Z",
          "Titre": "Great people to deal with and excellent…",
          "Contenu": "Great people to deal with and excellent communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Montano",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T02:09:11.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service, Mark went out of his way to make sure everything was prefect, most companies forget what customer service is ,Keep up the great work guys"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "The Gweilo",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T08:27:54.000Z",
          "Titre": "UPS Staff Penang",
          "Contenu": "Arrived on time, MMarine kept me informed all the way to final destination,it not their fault that UPS staff in Penang are as thick as pig poop 🥴"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dipak",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T19:17:07.000Z",
          "Titre": "Had such a great experience with this…",
          "Contenu": "Had such a great experience with this company. Mark and the team bent over backwards to help make a family trip successful when we had issues with our ScubaJets. 100% recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Ward",
          "Nb_Reviews": 3,
          "Date": "2021-08-26T00:22:45.000Z",
          "Titre": "The ice maker fit perfect where the old…",
          "Contenu": "The ice maker fit perfect where the old one was, easy install and delivered the day they said. The only complaint would be the manual, doesn’t say much and doesn’t tell you the size of the fitting you need to connect the water. It came with half of the fitting needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Nakash",
          "Nb_Reviews": 3,
          "Date": "2022-11-16T13:26:49.000Z",
          "Titre": "Great service they said my part was no…",
          "Contenu": "Great service they said my part was no in stock and would be about 2 weeks and I was able to get in less time very nice person on the phone I would definitely buy from them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T16:07:12.000Z",
          "Titre": "Hard to find--found it here",
          "Contenu": "Found the seal I needed-dimensions and description exact. Worked great! Seal was for 1993 port lights. I found it here!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Capt. David",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T12:07:16.000Z",
          "Titre": "Ítem arrived faster than expected",
          "Contenu": "Ítem arrived faster than expected. It was delivered on the location that was need it at the place boat were at that moment. Thank you .Looking fwd for any other needs in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K. Reed",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T03:44:03.000Z",
          "Titre": "Great product & great service",
          "Contenu": "I was looking over MMarine wed site and decided to order a Isotherm Cruise 130 refrigerator from them. I called their customer service to see about inventory and lead times on their shipping. Their service agent was very helpful and informed me that the refrigerator was in stock and could be shipped out in a couple of days. We made the transaction and in a few days I received an email with pictures of my fridge all packaged up wrapped in plastic on a pallet secured down with banding and sticker stating “fragile this side up” on several locations on the box. The pallet arrived in the same shape that the pictures showed, no damage and still secured to the pallet. I have never received this kind of high end customer service that I have from MMarine. Kudos to them on their quality products and customer service. They will receive future business for me and I highly recommend them do you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Hebets",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T02:20:55.000Z",
          "Titre": "The customer service rep that I talked…",
          "Contenu": "The customer service rep that I talked to on the phone before I placed the order was awesome. He realized that once he saw my order come past his desk that I had made a mistake,He reached out to me to correct my mistake And advised me and repaired the mistake. THANK YOU ALL Jeff Hebets"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria Larson",
          "Nb_Reviews": 3,
          "Date": "2022-01-24T00:58:28.000Z",
          "Titre": "I would have given them 10 stars if I…",
          "Contenu": "I would have given them 10 stars if I could. Mabel was fantastic, consistently answering questions and following up diligently. I will definitely use them again should the need arise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clint Schroeder",
          "Nb_Reviews": 2,
          "Date": "2021-10-27T23:02:03.000Z",
          "Titre": "Great inventory and the part I ordered…",
          "Contenu": "Great inventory and the part I ordered was correct.  Disappointed in that I paid for 2 day shipping but my delivery did not arrive for around 6 days from when I placed my order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drago Glavac",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T15:12:10.000Z",
          "Titre": "Professional service",
          "Contenu": "Professional service, product arrived on time, packaged very well was exactly what we ordered. Definitely will use them again. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lake Rickolt",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T04:58:12.000Z",
          "Titre": "The entire process from the first call…",
          "Contenu": "The entire process from the first call to this survey was efficient and to the point. Finding the right product , purchase process and delivery. One of the easiest purchases I've done in a very long time. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chris douglas",
          "Nb_Reviews": 1,
          "Date": "2021-01-15T16:50:16.000Z",
          "Titre": "GREAT CUSTOMER SERVICE",
          "Contenu": "GREAT CUSTOMER SERVICE! ITEM ARRIVED SLIGHTLY DAMAGED AND THEY TOOK CARE OF IT RIGHT AWAY.  ALSO THEY ALL WAYS HAVE A QUICK RESPONSE TO ANY OF MY QUESTIONS.  REFRESHING TO WORK WITH A COMPANY WITH SUCH GREAT SERVICE."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra S Gossman",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T00:28:35.000Z",
          "Titre": "Online sales support was great",
          "Contenu": "Online sales support was great.  Answered all my questions. Shipped within 7 days.  Can’t say enough about what a great experience it was."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Noel Madeira",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T15:57:38.000Z",
          "Titre": "I could find everything that I needed on this website.",
          "Contenu": "The sortiment is extremely rich which makes the whole shopping much easier and care-free. The shipping was timely and the products came in good condition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Mears",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T05:39:46.000Z",
          "Titre": "As expected",
          "Contenu": "Had inventory and shipped when it was supposed to. Always answers the phone. Even when different employees answered they new the information I was after."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Kahn",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T16:15:49.000Z",
          "Titre": "I felt like Adrianne was an industry…",
          "Contenu": "I felt like Adrianne was an industry expert in helping me with a replacement Mabru AC.  Very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Moriarty",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T20:21:31.000Z",
          "Titre": "Order 4501",
          "Contenu": "Send an email requesting the availability of a fitting, I received a response promptly and after placing the order the part was delivered timely. Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T00:20:07.000Z",
          "Titre": "Outstanding customers service and quick…",
          "Contenu": "Outstanding customers service and quick response and shipping. I placed the order and a few minutes later I received an email with shipping information, pictures of the product before being placed in the box to be shipped and status updates during shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janis Schoeller",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T00:58:41.000Z",
          "Titre": "Boat Parts Needed Quickly",
          "Contenu": "We needed new gaskets for our Groco seawater separator and we received the correct gaskets and received them when they were promised.  Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valorie Reed",
          "Nb_Reviews": 2,
          "Date": "2022-02-23T18:23:28.000Z",
          "Titre": "The customer service is always very…",
          "Contenu": "The customer service is always very good.  I wish we could get what we order sooner, but it's not their fault.  Everything boat related is so backordered.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Lipper",
          "Nb_Reviews": 3,
          "Date": "2021-09-06T20:51:04.000Z",
          "Titre": "Great Marine Business",
          "Contenu": "This is an excellent company with great customer service.  I have ordered from them three or four times and each time they have handled getting me the products with great skill.  They even send you a picture when your goods are shipped"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Kenning",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T07:25:10.000Z",
          "Titre": "Fine customer service/fair price",
          "Contenu": "Good price, excellent with it salesguy... fast delivery. Picked-up the phone fast..... just no BS ya know Thnx,Brian K."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wyatt Chidester",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T20:10:06.000Z",
          "Titre": "Outstanding Service",
          "Contenu": "Outstanding customer service! Pushed through flooding in the Ft Lauderdale area to get the parts to us. We appreciate it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich Engels",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T22:58:37.000Z",
          "Titre": "Awesome selection and fantastic prices",
          "Contenu": "Awesome selection and fantastic prices. Shipping was super fast. Will order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phillip Mummah",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T00:55:43.000Z",
          "Titre": "Very good customer service and products",
          "Contenu": "While there was a miss-understanding in the order, their customer service was very quick to reply and address the issue.  Their product is great quality too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Miracle",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T16:48:53.000Z",
          "Titre": "Fusion Signature Series…",
          "Contenu": "Ordered my Fusion Signature Series speakers personally delivered of course I live in South Florida it was a great pleasure working with you guys thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Levin",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T01:17:56.000Z",
          "Titre": "Product was ordered",
          "Contenu": "Product was ordered.  Received in a timely manner.  No issues.  Would definitely purchase products in the future from MMarine"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Zecca-George",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T22:17:46.000Z",
          "Titre": "Very pleased with the quick detailed…",
          "Contenu": "Very pleased with the quick detailed response from the mechanic. He clearly gave a lot of thought to his answer. Totally worth the subscription👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Ortmeyer",
          "Nb_Reviews": 2,
          "Date": "2021-05-26T15:03:28.000Z",
          "Titre": "Excellent phone service helping me…",
          "Contenu": "Excellent phone service helping me choose the best refrigerator option for my boat and then delivered on he promised timeline. Count me a happy customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Hancock",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T22:52:23.000Z",
          "Titre": "First time using MMarine",
          "Contenu": "First time using MMarine. I was not sure what to expect.  The item (a vent cover) arrived on time and well packaged. Would definitely order from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LCACCHIEF",
          "Nb_Reviews": 3,
          "Date": "2022-08-31T15:58:45.000Z",
          "Titre": "They kept me informed about the status…",
          "Contenu": "They kept me informed about the status of my order.  When the item arrived it was well protected and in good condition.  I will do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ronald drozd",
          "Nb_Reviews": 2,
          "Date": "2020-12-23T21:29:42.000Z",
          "Titre": "Mark was excellent to deal with",
          "Contenu": "Mark was excellent to deal with.  Explained everything, even called back when availability changed for product ordered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramesh Tipirneni",
          "Nb_Reviews": 1,
          "Date": "2021-01-04T22:35:35.000Z",
          "Titre": "Excellent and prompt service",
          "Contenu": "Excellent and prompt service. Good follow up. Went out of their way to a part to me during the holidays.  They are now my go to for marine parts now. Glad to have found them in the miami ft lauderdale  area."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Bunnell",
          "Nb_Reviews": 1,
          "Date": "2021-03-28T11:13:31.000Z",
          "Titre": "The staff is outstanding with their…",
          "Contenu": "The staff is outstanding with their customer service.  They kept me informed with shipping delays and made sure I was happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Havener",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T04:17:11.000Z",
          "Titre": "Great service with quick follow up",
          "Contenu": "Great service with quick follow up of order and shipped in a timely manner.Arrived with excellent packaging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry O",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T16:06:16.000Z",
          "Titre": "This was the smoothest online purchase…",
          "Contenu": "This was the smoothest online purchase I ever had. And the photos of the refrigerator before it was sent was much appreciated! And the customer service was excellent! 10 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendra Greenwood",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T17:17:53.000Z",
          "Titre": "I had a wonderful representative that…",
          "Contenu": "I had a wonderful representative that helped me find the right fridge and listened patiently to all my little concerns! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T02:24:02.000Z",
          "Titre": "The people and website I delt with were…",
          "Contenu": "The people and website I delt with were helpful and the part I needed was available at a reasonable cost and shop promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maureen",
          "Nb_Reviews": 2,
          "Date": "2021-04-10T21:29:07.000Z",
          "Titre": "MMarine went above and beyond",
          "Contenu": "MMarine went above and beyond. When my building lost the first delivery, they ‘hand’ delivered to me two days later."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MM Fer",
          "Nb_Reviews": 3,
          "Date": "2022-02-22T07:27:31.000Z",
          "Titre": "The employees are very helpful and all…",
          "Contenu": "The employees are very helpful and all the products that I bought are durable and useful. Will definitely buy more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Daugherty",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T21:47:37.000Z",
          "Titre": "Very efficient, quick shipping",
          "Contenu": "Very efficient and quick shipping. I have not installed yet but should be installing in a week or two"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Levitt",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T03:23:05.000Z",
          "Titre": "MMarine was wonderful and quick",
          "Contenu": "MMarine was wonderful and quick!  Got me the right parts quickly and professionally!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barry L",
          "Nb_Reviews": 2,
          "Date": "2021-09-05T14:18:33.000Z",
          "Titre": "Very Happy Camper!",
          "Contenu": "Hard to find, great replacement part. Quality as advertised, fair price, and delivered promptly.  What is not to like!"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Pharuk Ubar",
          "Nb_Reviews": 2,
          "Date": "2021-07-31T13:32:30.000Z",
          "Titre": "Nice store with great sortiment.",
          "Contenu": "I am quite content with the goods that I bought there and service that I got. Shipping was fast, the product came absolutely safe. There is nothing to complain about."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jean-francois",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T11:46:41.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service. Quick delivery and date of promise. They also give me a nice gift."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Derrow",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T18:17:54.000Z",
          "Titre": "Outstanding",
          "Contenu": "I needed this radio ASAP and I only had to say that 1-timeFollowed up with me the next day to be 100% sure I had received radio and that it was exactly what I neededGreat Company Great Employees"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Silvestre",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T15:23:54.000Z",
          "Titre": "Excellent service and good price",
          "Contenu": "Excellent service and good price. with fast deliveryGreat service from Masood. Thanks to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederic Ronssin",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T06:30:19.000Z",
          "Titre": "Knowledgeable and efficient sales team",
          "Contenu": "Knowledgeable and efficient sales team. Part was shipped and delivered promptly as expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Govan",
          "Nb_Reviews": 3,
          "Date": "2021-02-27T15:02:17.000Z",
          "Titre": "From the first call",
          "Contenu": "From the first call, I was impressed with the professionalism, attention to detail and prompt customer service and follow up. As a professional in the marine industry, I will continue to use Mmarine online for many of my needs."
        },
        {
          "Note": 5,
          "Lieu": "VG",
          "Pseudo": "Greig Warner",
          "Nb_Reviews": 1,
          "Date": "2022-06-21T14:46:56.000Z",
          "Titre": "I'm a procurement professional so I…",
          "Contenu": "I'm a procurement professional so I look for prompt, efficient service from my vendors - from the ordering to delivery . The MMarine team  met and exceeded my expectations - Thank you !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Himanek",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T03:13:25.000Z",
          "Titre": "Communication was great and fast",
          "Contenu": "Communication was great and fast! Shipping was extremely fast going from FL to MI"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T15:29:13.000Z",
          "Titre": "Awesome Experience!",
          "Contenu": "Very Quick Processing and great communication along the way.  I was very impressed with their service."
        },
        {
          "Note": 5,
          "Lieu": "VG",
          "Pseudo": "Clayton Panthier",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T11:53:51.000Z",
          "Titre": "Very helpful from the time the phone…",
          "Contenu": "Very helpful from the time the phone was answer. Definitely going to shop there again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Jackson",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T12:36:44.000Z",
          "Titre": "Well at first I had received the wrong…",
          "Contenu": "Well at first I had received the wrong part so it didn’t start so well but what made the five star was the customer service that not only corrected the issue but made absolutely certain it was what I needed. I manage a metal fabrication /heavy equipment shop, a heavy equipment sales yard and the maintenance of a inert landfill with around 40 pieces of equipment just at the landfill so I know what it takes to be busy and to slow down for a customer, I just hope I have and will do as well as you guys have done, THANKS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T22:50:36.000Z",
          "Titre": "2 Thumbs up for the costumer service!",
          "Contenu": "I had originally given a 1 star rating here. But 20 minutes later I got a call from the company, we figured out that I had read the product wrong. I love the lights and they match what I had to a T!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Hare",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T17:52:45.000Z",
          "Titre": "Quick and easy transaction",
          "Contenu": "Quick shipping and a nice note from somebody there - brightened my day!   I look forward to using MMMarine over the long term!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Warner",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T21:33:47.000Z",
          "Titre": "Quickly received what I needed",
          "Contenu": "Quickly received what I needed!  great customer service usually not found online"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 3,
          "Date": "2023-05-06T17:54:11.000Z",
          "Titre": "The product as expected and arrived in…",
          "Contenu": "The product as expected and arrived in as promised. The price was competitive with all other suppliers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Vogel",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T19:05:20.000Z",
          "Titre": "Great service n selection all good…",
          "Contenu": "Great service n selection all good prices n shipping thnk u cliffdiver 💦"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Mroz",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T17:20:23.000Z",
          "Titre": "Very good expierence to deal with…",
          "Contenu": "Very good expierence to deal with MMarine.Very fast and helpfull  response to my questions- technical and purchase related. Definitely recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 3,
          "Date": "2022-06-07T16:38:52.000Z",
          "Titre": "Product was out of stock",
          "Contenu": "Product was out of stock, but got a call explaining and was fine - not urgent so it worked out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T02:52:47.000Z",
          "Titre": "Great service and quick delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Dourlain",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T03:46:07.000Z",
          "Titre": "Can just as they said and in perfect…",
          "Contenu": "Can just as they said and in perfect condition. So far very pleased. Would recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Weiland",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T14:42:04.000Z",
          "Titre": "Personal service when I called",
          "Contenu": "Personal service when I called. No machine crap. Immediate shipping and good updates"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynne",
          "Nb_Reviews": 2,
          "Date": "2022-06-12T22:49:41.000Z",
          "Titre": "We ordered a replacement ice bucket for…",
          "Contenu": "We ordered a replacement ice bucket for our ice maker on the boat. It came qluickly and fit perfectly."
        }
      ]
    }
  ]
}