{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "motifphotos.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T15:09:45.000Z",
          "Titre": "Terrible ink bleeds, crooked layout... extremely poor quality product",
          "Contenu": "Unfortunately, my order of 7 photo albums was a total disaster! They arrived with horrible ink bleeds throughout all 7 albums. There was NO customer service, only a chat box that made me take and submit pictures. I was later contacted by email (Rachel Goodnight), who helped send a reorder. However, the SECOND reorder had problems with pages printed out of alignment. I contacted Rachel and she sent a THIRD order out which just arrived. That reorder was good... finally. I would say you need to find another printer contractor because the one you have is absolutely terrible. Although Rachel was helpful, this whole ordeal has been extremely distressful and frustrating as these albums are Christmas gifts and I spent MANY LONG HOURS creating the layout. Consequently and regrettably, I will NOT use this service again, NOR will I ever recommend anyone use it. It was just too horrible of an experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:56:05.000Z",
          "Titre": "Received a calendar I did not order, and was charged for it.",
          "Contenu": "Several days after I received a calendar I ordered I received a second, which I did not order. Motif refused to take responsibility, saying they would not have sent me the calendar if I hadn't ordered it. The date they \"claim\" I ordered the second calendar, I was not even home.Update: Motif kindly offered to refund my money for the calendar and also offered a discount code for a future purchase."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Kunde Nana",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:28:30.000Z",
          "Titre": "It was not possible to upload the…",
          "Contenu": "It was not possible to upload the project, also issues with credit card info. Internet connection was excellent, we up/downloaded even bigger data packages around the several trials to order the photo book. Something in the Mimeo App seems to be wrong."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:07:38.000Z",
          "Titre": "DISAPPOINTING",
          "Contenu": "Blurry pictures, very slow customer service. Issue not resolved. Blurry reprint. Partial refund and a blurry calendar doesn’t scream great service at all. Shame!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customerRobert Hsrtling",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T05:39:16.000Z",
          "Titre": "I’ve used the service for several years…",
          "Contenu": "I’ve used the service for several years under motif. Last year after several orders, they sent me a email saying because I was a good customer we are giving you a discount on your next order, no time limit. Do you really think I would just order more calendars for no reason because of a timed discount?  And the price just keeps going up,  the shipping doubled. I will find another company to do business with, so far I haven’t received any customer service from this one."
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "iSeb",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T01:41:48.000Z",
          "Titre": "Unfortunately quality get down",
          "Contenu": "Unfortunately quality get down. The put a logo on the product while they raised the price by 40%. Will stop with this."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "Emma W",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T15:17:40.000Z",
          "Titre": "Cheap looking with a big price tag",
          "Contenu": "I ordered a hard cover book from Motif and it was nice not exceptional. So I thought I'll print a smaller soft cover book thinking it would be decent print. It was awful, the photos were dark and print quality wasn't there, maybe because of the size. I wound't recommend printing a smaller book (15x20). It cost so much and the quality does not measure to the price.  I paid 35 euros (thats with a 25% discount) so I would've paid a lot more for a very cheap product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N. B. More",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T02:06:04.000Z",
          "Titre": "I ordered 12 photo books for my family",
          "Contenu": "I ordered 12 photo books for my family. I mailed 6 and hand delivered the remaining 6! I gave one to my sister at Thanksgiving. The cover was from my project but the inside was another family. We laughed but I was irritated because although it was just 1 of 6 that I handed out was an error.  I worried about the other 6 I mailed. Just a pain to have to deal with contacting the company and getting replacement books!"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Shelly",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T13:23:29.000Z",
          "Titre": "Used to be way better. So disappointed",
          "Contenu": "I ordered books though Apple since 2011. When it became available as a downloadable app (Motif) I kept ordering. The look and layout options decreased in my opinion but I ordered because on the shelve they all had the same height and look. Now I ordered a book and received one from mimeo. The book cover is in bad condition (dirty and wrinkles). It is a Christmas present and honestly looks aweful compared to what the booked used to be. Also all the photo pages feel different in the hand, the colors don't shine as they used to and there is a strange dull pattern on every single page. You see it as soon as sun or light shines on it. I loved these photo books but am honestly shocked what they are now.The service (chat) is slow and the answers are translated because they kept asking for things I already mentioned and the grammar, as well as sayings (like you're welcome) were wrong. The prices (also for shipping increase) but the quality does not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert hartling",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:00:00.000Z",
          "Titre": "The price is really out overof sight",
          "Contenu": "The price is really out of sightI bought 2 calendars a few weeks agoShipping was $7.99Last week I ordered 2 moreThe shipping was now $11.99I have a few more calendars to orderI can’t imagine what the shipping will cast me by thenI’m up to $40 a calendar nowProbably will not order next year The cost is getting rediculous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T22:36:54.000Z",
          "Titre": "Book was never even shipped",
          "Contenu": "Not only did the book not arrive on time, UPS made it clear that Motif printed a shipping label, but never actually shipped my order. I wish I could leave negative stars: they've never shipped my book, and now--a week after it should have been delivered--their bots are soliciting my favorable review. Yeah, that's not happening."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dr_j",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T23:43:00.000Z",
          "Titre": "Card never arrived",
          "Contenu": "Card never arrived. Was almost immediately lost in transit. Contacted customer service several times, was basically just told to wait, that it should show up soon (though there was conspicuous absence of tracking data). Requested several times that a new card be sent via priority mail. Didn't happen. Total fail on all levels. Will not use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T04:58:11.000Z",
          "Titre": "I am trying to re-purchase an order…",
          "Contenu": "I am trying to re-purchase an order from my phone and it’s impossible. The chat person’s instructions don’t work, which he acknowledged and then told me to go to my computer, which I can’t do.  I am trying to give you my money. Ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dr. John McCue",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T11:54:21.000Z",
          "Titre": "Delivery failed",
          "Contenu": "5ER3Q56Q74-BWe were out of the house when UPS arrived, on 12 July, 2023. If the package was too large to go through the letter box, it was not left with a neighbour and no card was delivered to let is know where to collect. Its whereabouts is a mystery. Your colleague Rodney has very kindly arranged for a replacement order, with the new order number given above. It was six copies of my son's pre-wedding celebrations at The Crystal Maze, Manchester. We hope it will be successfully delivered.Best wishes,Dr. John McCue"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T14:01:21.000Z",
          "Titre": "3 wedding albums all with printing mistakes",
          "Contenu": "We designed and ordered our wedding album via Motif. After spending a very long time on the design the first album arrived with streaks in various pictures. They sent another one immediately but there sadly the writing was smudged. They sent a third but the writing was still smudged. If it weren’t for the very responsive customer service I would give 0 stars. It is very sad that for such a high price we did not receive one error fee album."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dyoga",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T17:46:05.000Z",
          "Titre": "Pages fall out after light use",
          "Contenu": "Pages fall out of infrequently and gently used books after one year. Company’s response: all books fall apart, even just sitting on shelf after one year.What?!?Offered 25% off replacement. We have ordered many books for ourselves and family. Never again.Follow up - clearly a robotic reply from Motif.  My name is not Jennifer and - if my reply was read buy a human, they would see - I contacted Motif and was told pages falling out of books - all books - is to be expected within one year.  Truly awful product and customer service.Update - Motif responses on Trustpilot are much more polite and solicitous than actual customer service from company, which is abrupt and rude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 2,
          "Date": "2023-08-16T22:42:35.000Z",
          "Titre": "Did Not Work For Me",
          "Contenu": "The project was super easy to create and I was very happy with the finished project. Unfortunately, there were problems when ordering with the upload of the file. Despite the super helpful people in customer service, we were unable to determine the issue and it was referred to the technical service team. That was three days ago and still no answers so I suspect it’s time to return to the photo book creator I was using previously."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Kearns",
          "Nb_Reviews": 3,
          "Date": "2023-08-01T20:33:53.000Z",
          "Titre": "I have created dozens of books and…",
          "Contenu": "I have created dozens of books and calendars over the years with Motif and have always been satisfied.  This time the delivered product was totally unexceptional. Very disappointing. Your service team is working very hard to correct the problem and to find a solution."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Hazel",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T00:04:56.000Z",
          "Titre": "Rubbish!",
          "Contenu": "Rubbish!Every year I order with them as it is the only present that my parents want. Every year there is an issue with delivery and I end up spending the week before Christmas trying to resolve. This year again, like Groundhog Day, here I am again…I ordered nearly one month ago now and both orders never arrived No customer service number or chat in a world where both are completely normal for a functioning service"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "customerGuillermo",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T21:26:30.000Z",
          "Titre": "Delivery in a Tobacco Store",
          "Contenu": "I´m not happy at all with delivering, I paid shipping cost  and I realized that my packet was in a UPS point located in a Tobacco Store. First of all it was a present and should be delivered in the adress I wrote, and second, why do I have to go to a Tobacco Store ???"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T13:52:50.000Z",
          "Titre": "Appalling",
          "Contenu": "Appalling. The album turned up with half the pages completely blank and with no resemblance to what was on the screen. I found myself receiving unhelpful emails from a robot and no-one has been able to help me resolve the issue. Motif have of course banked the payments"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "V. Lopez",
          "Nb_Reviews": 2,
          "Date": "2022-12-09T18:13:29.000Z",
          "Titre": "No delivery, no communication",
          "Contenu": "It’s going to be a month and I’m waiting for the order to arrive. It’s a Christmas gift that may not be presented in due. Based on the shipping track system, the item is going back and forth between two mail centers. Things happen so I’ve tried to reach out to motifphotos several times.  I am yet to receive any response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katherine Phraner",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T00:27:36.000Z",
          "Titre": "order number 324099 issue",
          "Contenu": "I received my photo boom with 1/2 the photos missing. I uploaded and organized 100 pages of photos. What I received was a 100 page book, with 60 pages printed and 40 pages blank. I emailed customer care on November 10th. I received a reply to send them photos of the issue, which I did, but since then I’ve emailed customer care twice more and have not received any reply or resolution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angelika Scott",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T21:18:34.000Z",
          "Titre": "I have to review my review …",
          "Contenu": "I have to review my review from last time. I did not receive my photo book from motif, nor did I see any money from them in my account as they promised. In the meantime I got two photo books from a different company, created after the one I did with motif and I paid less for them. Sorry to say, but motif is not for me..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 3,
          "Date": "2023-09-01T13:50:58.000Z",
          "Titre": "Not so quick resolution",
          "Contenu": "Apparently, my order was lost in shipping. Instead of promptly reprocessing and sending it out, it took over a week and a half to expedite it. I finally received my order on 8/30. Customer service attempted and finally did rectify the problem thanks to Mohammed.Having a phone number for customer service would improve customer satisfaction \"immensely.\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer Joan Palleschi",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T01:07:36.000Z",
          "Titre": "My wife loves your books!!!",
          "Contenu": "My wife loves your books!!!Her last order of 3 books was duplicated and she was charged twice.  Her credit card was charged twice $ 322.36.  This is a terrible problem!!!  We called her Marriott card to challenge the second charge.  We haven’t heard anything from you or our credit card company.Can you help???  My wife is a very good customer of yours for many years.Please help!!!  Joan Palleschi.  1-248-363-0654"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leigh Albrecht",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T03:18:56.000Z",
          "Titre": "You printed my book incorrectly",
          "Contenu": "You printed my book incorrectly. I requested a reprint and the same book was sent with pixelated pictures which was not how the pictures were on the program. I want the book printed CORRECTLY AT NO COST TO ME"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T09:40:25.000Z",
          "Titre": "The actual construction of a project is…",
          "Contenu": "The actual construction of a project is smooth and trouble free but trying to checkout I found impossible. In spite of advice from customer services nothing would upload without error. A very frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shawn S.",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T23:57:10.000Z",
          "Titre": "Order never arrived",
          "Contenu": "Order never arrived. Shipper said there was a problem and Motif was notified. Still no word from Motif on a replacement after five days."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anthony Powell",
          "Nb_Reviews": 3,
          "Date": "2023-05-05T06:36:06.000Z",
          "Titre": "Non EU company - delays because of Brexit.",
          "Contenu": "Because this company is based in Britain, the delivery was so late, I have been unable to view the result. Next time I will use a company based in the EU."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Botz",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T17:09:35.000Z",
          "Titre": "Project disappeared!",
          "Contenu": "Trustpilot DID NOT allow me to enter an email address.  I will try the address you sent as an alternate.  I am using my original review to respond to Motif.  They requested my information but gave me no direction in where to send it.  My contact info is XXX.. Hope to hear from them. And now I can't send my email info through Trustpilot (which is good).  So...Motif please respond as to the method for contacting YOU!  Motif has been my go to photo book for years. Learned through Apple Books.  My results were amazing!  That is until this week.  While using the program after 50 pages the software froze causing me to do a forced shut down.  When I rebooted my entire project with the exception of the cover page disappeared!  So I started from the beginning - this time same thing happened at page 116 (using the new 120 page format).  Sadly this was a gift for my husband in honor of our 30th wedding anniversary.  Now I have nothing to show for hours and hours of work.  I contacted support (was told they were for Mimeo) - they sent me an app to clean up the Motif app.  Quite frankly I am not tech savvy enough to use it (76 years old).  I literally sat in my chair and cried.  So frustrated.  What to do?  Will contact Apple to discuss the App cleaner but will more than likely look for a new company!  So disappointed and frustrated. Beware if you use the Motif program!!"
        },
        {
          "Note": 1,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T14:46:16.000Z",
          "Titre": "UPS still did not deliver my order",
          "Contenu": "UPS still did not deliver my order, they are real amateurs! Already waiting for 8 days!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 5,
          "Date": "2023-04-28T22:39:26.000Z",
          "Titre": "The experience of making this book was…",
          "Contenu": "The experience of making this book was easy and fun.   Getting the book to me is the difficult part.   I was told 2 weeks .... then I was told a month ....  and now I'm being told it's going to take 2 months to get to me."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Regis Leenhardt",
          "Nb_Reviews": 2,
          "Date": "2023-07-18T13:33:01.000Z",
          "Titre": "I never received my album",
          "Contenu": "I never received my albumorder: D96JQ7LE7KPlease do something for me"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "kunde",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T07:46:43.000Z",
          "Titre": "Just not good enough",
          "Contenu": "The pictures, taken in daylight, with a great camera, looks like iphone pictures in the dark..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James G",
          "Nb_Reviews": 21,
          "Date": "2022-10-31T11:09:17.000Z",
          "Titre": "Failure to deliver",
          "Contenu": "Paid for express 3-4 day delivery service and still not received album 2 weeks later...!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Toriello",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T21:03:10.000Z",
          "Titre": "Awful",
          "Contenu": "Awful. The book was beautiful but I had an issue after I received it, tried to reach customer service and it has been impossible to get anyone to respond. The help line is a joke. All you get is a message telling you everyone is busy please email Motif. Then when you email you get a form letter that assures you someone will get back to you but then NO ONE EVER DOES. IT'S MADDENING and very unfortunate because I was pleased with the interface for designing and ordering but heaven forbid you have an issue or a question. Good luck with that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "elizabeth jann",
          "Nb_Reviews": 1,
          "Date": "2022-09-28T22:47:00.000Z",
          "Titre": "I tried to contact for information…",
          "Contenu": "I tried to contact for information verifying which photo was the actual finished product representation, the one with the orange guide lines showing where the photo is folded over the sides or the preview, because the borders are different.  Makes a difference!  So, first photo was crap.  No-one answered my question and that is just awful customer service.  You need to make available a phone number so we can speak to humans about questions/concerns."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:35:38.000Z",
          "Titre": "Paperquality oldfashioned"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2022-09-19T18:10:04.000Z",
          "Titre": "Rubbish service",
          "Contenu": "Despite contacting customer care my album has still not arrived so therefore I cannot give a review on the quality of this product. All I know is As this was supposed to have been a birthday gift we went to Costco and received an album in 3 days great quality and will use them next time."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "J.Claas",
          "Nb_Reviews": 3,
          "Date": "2023-06-23T10:51:58.000Z",
          "Titre": "The Quality ist not so god as bei Apple…",
          "Contenu": "The Quality ist not so god as bei Apple before"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Liza",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T15:53:24.000Z",
          "Titre": "Unfortunate Quality and Experience",
          "Contenu": "Unfortunately, the soft cover photo album was falling apart when I got it. While customer service did accommodate a replacement after I sent photos of how badly it was assembled, they didn’t allow for any flexibility when I asked to pay to change from soft to hard cover to avoid the same quality issues again. I was very disappointed in the quality. Try the hard cover if you do order from here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 7,
          "Date": "2022-10-02T23:43:21.000Z",
          "Titre": "DISASTER!",
          "Contenu": "DISASTER!!  After spending several hours developing a book, the program quiet and won't reopen.  Hours wasted.  Motif needs to get its act together."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Prashanth Wijedasa",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T18:16:17.000Z",
          "Titre": "My order not delivered",
          "Contenu": "I placed an order with motif app with expedite shipping, this was a gift of photo memories for my Daughter. On the promised day of delivery, they send me an email canceling the order without any reason. They took my money. What a disappointment. Please be aware. What happened to me can happened to anyone.I DO NOT RECOMMEND THIS SITE/COMPANY TO ANYONE.."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T21:13:15.000Z",
          "Titre": "Book arrived late despite ordering by deadline",
          "Contenu": "Motif’s marketing and website said many times over to order by May 2 with expedited shipping to receive by Mother’s Day. I ordered on April 28 (and paid $25 for expidited shipping instead of free shipping) and the book arrived late. Further, contacting customer support did nothing and they are no longer replying."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Lielle Bimbat",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T17:22:02.000Z",
          "Titre": "HORRIBLE customer service",
          "Contenu": "HORRIBLE customer service! I ordered a photo book and it came missing half of the photos that I put in. Customer service was no help, they tried giving me three different coupon codes none of them worked. Then they said it would get a refund within 5-12 business days and it’s been over a month. I try calling and no one picks up the phone. I’m still trying to get my money back, don’t buy from here!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Janis Wolford",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T16:27:21.000Z",
          "Titre": "Customer Service?",
          "Contenu": "I downloaded the app, chose a book style and downloaded photos. I'm having problems editing so I tried to contact customer service. A page comes up \"contact us \" but when you try to select it nothing happens. There is no phone number or way to contact customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Isaac",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T20:45:03.000Z",
          "Titre": "Motif is a total disappointment!!",
          "Contenu": "Motif is a total disappointment!!!  Getting  a response from their customer service department is nonexistent!!!!  I’ve emailed them three time with NO response back!!  I ordered one photo book and they have my credit card charged TWICE for the same order!!  NEVER again will i use their service!!  I give them one star only because there is nothing less!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bummed out",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T03:32:08.000Z",
          "Titre": "Disappointed",
          "Contenu": "Received my order of a 80 photo soft cover book.My wife opened it up for Mother’s Day and on the first page turn the book fell apart and most of the pages ripped apart. Called customer service, the sent me another book. Clearly no quality control was done . Emailed customer service because they do not have a phone number which is annoying. They re-printed my book. Received the re-printed book about a week later open it up and the same issue again. Currently waiting on the 3rd Iteration of the next fix they send me. Needless to say I will not be purchasing from them in the future"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra Schlesinger",
          "Nb_Reviews": 3,
          "Date": "2022-01-17T22:02:07.000Z",
          "Titre": "Horrible",
          "Contenu": "I have used Motif in the past, but this time though I ordered a photo book weeks ago, I cannot get a response from this pathetic company. I have pleaded four times for an update and get \"in progress.\" and no reply to my emails though they say they will reply This is a photo book for my little granddaughter and it's time sensitive since I am terminally ill. Motif seems to have just disappeared Shameful,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 3,
          "Date": "2022-04-21T00:31:34.381Z",
          "Titre": "Error message at checkout",
          "Contenu": "I have happily and successfully used Motif photo books in the past. However, my most recent experience with two books resulted in a problem at checkout. I get an error message that is unknown to me and unknown to translate. I have contacted Motif using the Customer service section of the website on two occasions this week and have yet to hear back. To say I am frustrated is an understatement. I have spent countless hours producing two lovely books that I want to check out and have printed - please contact me to help me resolve this technical issue.Thank you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DScheff",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T19:37:37.000Z",
          "Titre": "Although previous experiences have been…",
          "Contenu": "Although previous experiences have been uncomplicated this most recent purchase experience was laughable.  The original calendar purcase never made it to my door which required a cancellation and re-order.  The re-order has been delayed nearly 1 month...now nearing February on a calendar that was intended to be a Christmas gift for my Grandmother who in her own words has stated is the only gift she looks forward to...unfortunately, she has since passed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lily",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T16:24:39.000Z",
          "Titre": "I placed my order almost 3 weeks ago…",
          "Contenu": "I placed my order almost 3 weeks ago and paid for expedited shipping. I still have received no updates and my order just says “In progress.” I have reached out to customer service multiple times and have received no additional information. I cannot believe how terrible their customer service is and highly recommend taking your business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "david diaz",
          "Nb_Reviews": 1,
          "Date": "2022-01-13T01:04:55.000Z",
          "Titre": "Motif software crashes",
          "Contenu": "Motif software crashes. If you want to create a photo book set expectations to create the same book 2-4 times before you get to print it. I've lost my photo book project 3 times now. I had nearly 68 pages completed of 10-18 photos per page. The program simply reverts back to page 10 for no reason. Heartbreaker."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lee Clark",
          "Nb_Reviews": 2,
          "Date": "2022-09-22T09:42:19.000Z",
          "Titre": "Total waste of time and money",
          "Contenu": "Total waste of time and money, still waiting for order keeps being put back on a daily basis now four delays by this company and UPS.Dont use"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "rob miller",
          "Nb_Reviews": 12,
          "Date": "2022-09-24T19:38:13.000Z",
          "Titre": "Horrible product",
          "Contenu": "Horrible product. Functionality on iPad is poor. Almost impossible to arrange the book and delete photos. Will not be using this again ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 3,
          "Date": "2022-11-17T11:20:40.000Z",
          "Titre": "OCONUS addresses.",
          "Contenu": "No support for OCONUS addresses."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richie Franco, Jr",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T16:11:42.000Z",
          "Titre": "Still haven't received my package",
          "Contenu": "Still haven't received my package. I can't blame the post-office, because Amazon uses them too. When they say my package will be delivered, it is. I was notified via your tracking, my package would be delivered TEN days ago. \"Still waiting... I-I-I'm STILL waiting...\" Talking Heads' \"Crosseyed & Painless\""
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joseph Leblanc",
          "Nb_Reviews": 9,
          "Date": "2021-10-28T13:50:08.000Z",
          "Titre": "Wedding Album",
          "Contenu": "I was so dissatisfied with the album and the pictures that I ordered another album from a different source. I didn’t know what else to do. I was very happy with the other album that I ordered. Now I’m stuck with an album that I can’t do anything with. I wish I could send it back and get a refund. Joseph LeBlanc"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Lisa Dickinson",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T17:46:52.000Z",
          "Titre": "Horrible customer service, still haven't received my books",
          "Contenu": "I have ordered two photo books that were supposed to come before Dec 29th.  It's Jan 6th and they haven't arrived, I have written three emails to the company over the past week and haven't received any emails back other than the standard we have received your email and will get back to you.  When I call I get disconnected after hearing a message that \"sorry we cannot connect your call at this time, please call back at a later time\".  Horrible company.  I have spent $300 for nothing so far and will be contacting Visa to get a refund soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christine Lindeman",
          "Nb_Reviews": 2,
          "Date": "2022-08-31T00:45:33.000Z",
          "Titre": "Totally messed up layout",
          "Contenu": "The book I created was to celebrate the life of a 90 year old person through gathered photos. The layout of the book I received was not the one I sent off. Some photos were dropped, others were repeated several times, and there were odd configurations on some pages that did not fit the photo at all; e.g. a long narrow landscape view of a portrait cut or off people's heads cut off. I know what I sent off because I double checked it several times to be sure I had everything laid out correctly, and used a hand-written check-list to be sure everything was included the way I intended. When I went to check with my Motif account to see if this was somehow my error, the project didn't even show up as ever having been completed, despite having actually received the book!  I reprinted everything as single photos and put them in a photo album myself.  Arrrrg. Won't use this product again!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Walter Kilbourne",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T20:47:17.000Z",
          "Titre": "Completely botched my order",
          "Contenu": "Completely botched my order, trimming about one-half inch off the top full-bleed pages and cutting off heads in the process. This AFTER dealing with buggy warning messages that their customer service people seemed incapable of understanding or helping me resolve. Their approach seems to be, 1) skim customer question, 2) find boilerplate \"answer\" to unrelated question, 3) append the nonresponsive answer to reply plus some canned pleasantries, 4) when customer complains, see 1). Just awful company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EM",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T13:31:35.000Z",
          "Titre": "My book came back with several repeated…",
          "Contenu": "My book came back with several repeated pages with the same pictures, I Reached out to customer service to let them know and their response to me was it was my error and that was it I’m not sure whether to put it on my coffee table as a joke or to throw it out I was very disappointed that there was no offer to fix the book"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "J Gow",
          "Nb_Reviews": 10,
          "Date": "2021-01-19T19:54:31.000Z",
          "Titre": "Constantly Late / Untracked",
          "Contenu": "Motif delivery service let’s them down. Photo books are late and their tracking system is useless. Was told a delivery would be made on 19th Jan within a 2 hour slot, nothing arrived ( again ) and now I have a mew date of 26th. Blaming Covid & Brexit. They give you a delivery date knowing they cannot meet that date. Best stick to a UK company. First order I gave them the benefit of the doubt but second order was just as bad."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard",
          "Nb_Reviews": 53,
          "Date": "2021-05-14T08:36:54.000Z",
          "Titre": "Poor macOS Photos extension",
          "Contenu": "This is a review of Motif's extension for the macOS Photos app used to create projects within macOS Photos and send to Motif for printing.As soon as a project is created a pop-up apears asking you to sign up for their news letter. I really hate news letter pop-ups proliferating the web.It's not a good extension, page layout is fixed, like it or not.My photos have lots of meta data (description etc.) yet the extension does not allow any of this to be used in the photo book.Not a good extension."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 4,
          "Date": "2020-08-27T02:53:18.000Z",
          "Titre": "Disappointed that have to order such…",
          "Contenu": "Disappointed that have to order such large numbers of photos.  You jump from 10 to 25 --- that is horrible.  To order 11 photos I have to order 10 and pay your shipping and handling rate.  Then I have to order 1 photo and pay the same high shipping and handling again!   Should be able to order some other quantity instead of having to jump and order 15 photos I do not need.  Way you have it set up it becomes so expensive and unfair! ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ira sherman",
          "Nb_Reviews": 2,
          "Date": "2020-07-04T18:00:36.000Z",
          "Titre": "There is no effective customer support",
          "Contenu": "There is no effective customer support. When you call the contact number the person that answers has no knowledge whatsoever. The first time I called and explained my issue, and was promised someone from tech would contact me - no one did. Months later, the second time I called and explained my problem, I got an email with a form response that was totally useless. You need improved customer support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dianne",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T15:33:50.000Z",
          "Titre": "Problems with order: MISSING PHOTOS",
          "Contenu": "Problems with order:1. Did not arrive on date promised. Paid for expatiated shipping.  Was credited after I sent two emails. 2.  Arrived with 12 blank pages but was charged for 22. Missing half my photos.  3. Do you not proofread before shipping books?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 5,
          "Date": "2020-04-29T16:04:15.000Z",
          "Titre": "Great Idea...Poor Customer Service and Follow-Up",
          "Contenu": "Great Idea, very poor customer service.  No way to get through on a phone call and 1-3 days for a response on email.  This effectively shuts me down on my project until i hear from you, and, often the question is not answered because I am unable to have a quick follow-up question.  You have multiple user errors on your site that could be easily fixed if someone would just listen to the customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mary o'connor",
          "Nb_Reviews": 3,
          "Date": "2020-04-23T23:55:51.000Z",
          "Titre": "honestly this should be easier at this…",
          "Contenu": "honestly this should be easier at this point- I've been doing these books monthly for like 12 years and these books are so hard still...  Wish they were more intuitive and a real person could give it a once over to make sure there aren't huge issues...  also why do so many of my photos have orange elcamation points?  sorry but I do wish they were easier!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "k.lawlor",
          "Nb_Reviews": 1,
          "Date": "2020-01-05T16:27:04.000Z",
          "Titre": "I am having the exact same problem as…",
          "Contenu": "I am having the exact same problem as A. Sakowitz below.  It is extremely frustrating and I have tried 3 times to create book, but its impossible to get the program to load all photos (it says its loading, for example, 380 high resolution photos, but then the photo bin only shows 320 photos available.  And then when I do use the photos in the bin photos will disappear the next time I open the book."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Linda Wozniak",
          "Nb_Reviews": 1,
          "Date": "2019-11-13T21:52:49.000Z",
          "Titre": "If I could give no stars",
          "Contenu": "If I could give no stars - I would. This was advertised as a way to print projects ( photo books, etc) to take the place of Apple’s printing programs.  I have been working for HOURS on three projects.  I finished one and went to save it as a PDF.  There is NO option to do so.  Therefore you are restricted to printing ONLY through Motif.  Had I known this I would never have downloaded this program."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dan Aldrin",
          "Nb_Reviews": 3,
          "Date": "2020-11-04T18:08:35.000Z",
          "Titre": "I ordered Christmas cards and 4 of them…",
          "Contenu": "I ordered Christmas cards and 4 of them were non-usable with scratches when I received them. I complained and the only compensation they would offer me was 4 new copies of my Christmas cards which they would send me by post...According to Motif Photos they sent the new cards over a week ago, and they should be here by now... I had to contact them again to get my tracking number and according to UPS there is no delivery address for this tracking :-( I will not be ordering from Motif Photos again..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Berchenko",
          "Nb_Reviews": 1,
          "Date": "2019-09-25T22:11:44.000Z",
          "Titre": "Although the book finally got printed…",
          "Contenu": "Although the book finally got printed it took 5 tries to get to where it could be submitted. And no matter what was emailed me to correct the problem it was never resolved.  I do have a printed book but nothing was ever saved to my computer. The only way I was ever able to get to the finish was not to leave the website.  Not being able to speak to someone at the company is horrible. Very poor service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 2,
          "Date": "2019-09-30T01:39:05.000Z",
          "Titre": "Extremely Disappointed",
          "Contenu": "I read the instructions. However the text box NEVER worked as they said it should. Thee is one page with a picture left off. So one picture on half a page. Top of page blank. No explanation for this. Picture quality is unsatisfactory. I paid about $85. Frankly, I have had better luck at Walgreens. Will not use this again. My first grandchild. Was expecting excellent photo book."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brooks",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T14:49:51.000Z",
          "Titre": "Crashed every 15 seconds for months",
          "Contenu": "Crashed every 15 seconds for months. Lost work. Projects that used to take me 2 months in my spare time (photo book) took my 8 months. I dreaded opening the software. In fact, I do not know where some of my photos are now, because after I added them to Motif, it appears they are gone from my Apple Photos app library.  But... I was forced to keep going and endure crashes because Apple doesn't really have a better plugin."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Winton Etz",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T21:40:34.000Z",
          "Titre": "Failed me at Christmas",
          "Contenu": "Unfortunately, despite paying extra for shipping and despite being guaranteed delivery before Christmas, my mother’s Christmas present was delivered on the 26th - after she had left. The other two books were nice, and I’m sure my mom’s is too, but the emotional value of the gift is ruined. Also - when I contacted motif customer service they were unhelpful in the extreme. Motif is good when it’s good- but horrible when they fail. Use another service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Leider",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T22:00:13.000Z",
          "Titre": "Bad experience",
          "Contenu": "I WISH I could leave a good review but I can’t. I reached out to the customer service via email FOUR times over two weeks and got a response twice neither times fixing my issue. They actually asked me what the problem was AFTER I already explained it & then never answereMy last two emails were never answered. I’m huge on customer service so for this reason I’d NEVER recommend them to anyone. Save yourself the headache. Still waiting for my 25% off -_-"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Irwin Fisher",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T20:18:10.000Z",
          "Titre": "I cannot give you more than one star…",
          "Contenu": "I cannot give you more than one star right now.  I have appreciated the written responses to my challenges and I have tried to follow the instructions to create a book without the blacked out photos with no success.  Frankly, I'm tired of trying and have requested a refund or credit on a new book with no success.  I have a made several successful Apple and Shutterfly books in the past.  I regret Apple is no longer providing this service and has decided to outsource to Motif."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Vox",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T23:13:45.000Z",
          "Titre": "Terrible Quality",
          "Contenu": "Our photo books were bent and damaged when we received them and the photo quality is terrible. Will never order from here again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 1,
          "Date": "2019-09-25T19:22:14.000Z",
          "Titre": "very difficult to use and learn after…",
          "Contenu": "very difficult to use and learn after using apple's program to make books..I had no real help by telephone , only email. I learned it myself by trial and error from what info Motif sent. I would have preferred someone walking me thru, especially since this was my 1st time using Motif. I won't use them again because of lack of help and choices. I was not impressed. My book came out \"Okay\"..but it was not exactly what I expected."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jay E",
          "Nb_Reviews": 1,
          "Date": "2020-01-22T00:15:31.000Z",
          "Titre": "Watch your order",
          "Contenu": "I ordered a calendar in January 2020 and it came with 2019 dates. I couldn’t figure it out.  Online I couldn’t even find 2019 as an option. Motif didn’t apologize. After 10 or more emails back and forth I called it quits. I reordered the calendar so it was correct.  So I got one calendar for the price of two. Lucky me. Paying double."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy W.",
          "Nb_Reviews": 1,
          "Date": "2019-11-02T21:32:35.000Z",
          "Titre": "I am VERY unhappy.because I have not…",
          "Contenu": "I am VERY unhappy.because I have not received my book, nor will UPS/USPS tell me when I will receive it.  I had a reunion party of the people on our trip last nite and was hoping to share it.  Between the trouble I had with the text in the book, and the fact that nearly two weeks after I ordered it, I can’t even find out when I’ll receive it,  I doubt that I will ever use Motif again.  I would give Motif one star.  Very, very disappointing!!Kathy Wright"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sahra",
          "Nb_Reviews": 1,
          "Date": "2019-12-18T02:55:14.000Z",
          "Titre": "I submitted a book for printing",
          "Contenu": "I submitted a book for printing, along with a pdf version. Right away, I noticed that the pdf had a couple of corrupted images.I resubmitted my order, being extra careful to preview the uploaded version. It looked fine. But then, the pdf has a corrupted image (a different one than the first time). Now I am worried that the hard copy book I am sending as a gift will have a corrupted image.My main complaint is frustration, I don’t know how to get a good printed book."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristen",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T15:03:49.000Z",
          "Titre": "Program quits unexpectedly, doesn't save.",
          "Contenu": "The program quits unexpectedly and doesn't actually save the work done. I miss Apple photo. The designs also suck. Apple's designs were much sleeker, polished, and required less work. Motif you have to change EVERYTHING from the page color to the text color, font, etc. The text box option is clunky, doesn't move or work easily."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Paul Buffett",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T17:09:32.000Z",
          "Titre": "I ordered a simple folding card",
          "Contenu": "I ordered a simple folding card. I was charged $15 shipping and then I heard nothing, no status change on my order for a week. When I contacted Motif for a second time I got an email back saying they had been emailing me. They said I must not have been receiving the emails...yet I received that one. I placed the order on January 27th (which Motif modified to February 5th) for my Uncle's birthday on February 9th...it's February 17th 2020 and he still has not received the card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicki L.",
          "Nb_Reviews": 2,
          "Date": "2019-07-09T15:51:07.000Z",
          "Titre": "I ordered my first book on Motif",
          "Contenu": "I ordered my first book on Motif, because Apple discontinued their photos service.  When the book arrived many pages were blank and the total project was missing about 15-20 photos.  Their customer service is terrible.  They reply with a general answer about my situation.  I have been back and forth about 3 times through email and the answer never changes? I have now asked for a refund and have yet to hear from them!  Very Frustrated and disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Word",
          "Nb_Reviews": 1,
          "Date": "2019-12-22T12:36:33.000Z",
          "Titre": "No customer service whatsoever",
          "Contenu": "I ordered the shipment expedited. When it hadn’t even shipped after 4 days after I ordered it, I called and Motif said that they would upgrade it to 2 day. It still did not arrive for another 4 days. I tried to call Motif but the answering service did not work so I emailed them asking for a refund. I still have not received anything. Motif has the worst “customer service”. I wouldn’t even call you customer service since nothing has been done. There has been no service whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T19:13:38.000Z",
          "Titre": "I had high hopes with Motif",
          "Contenu": "I had high hopes with Motif, but after receiving my photo book half my photos were missing from the pages.  Their customer care team has looked into it, but they couldn't get it corrected on their end.  I don't understand how half my photos were able to get uploaded to my project at Motif and the others did not.  They all came from the same cameras, computer and cloud.  A lot of work went into putting the photo book together with extra pages, to be let down when it arrived."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marie Ludicky",
          "Nb_Reviews": 3,
          "Date": "2020-06-20T14:35:25.000Z",
          "Titre": "ordering and check out is abysmal",
          "Contenu": "The only reason I use Motif is because I can recreate some Apple photobooks I had made in the past. I have just now tried to check out for the fourth time with no success.  This time I got to the very last step and was eventually told it timed out.  This has happened all but one time I used Motif."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Dahlquist",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T21:08:50.000Z",
          "Titre": "dissapointed with the prodeuct",
          "Contenu": "the photo album i ordered had more than half of the photos appearing extremely dark, much more so that the original photos. The quality of the album itself was great except for the that issue. Customer service is very spotty and still have not replied to my latest email which I sent two days ago"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Marc",
          "Nb_Reviews": 5,
          "Date": "2021-01-02T17:11:35.000Z",
          "Titre": "Delivery not on time",
          "Contenu": "Delivery not on timeI was supposed to receive a simple calendar by UPS by 29Dec2020 and it has never arrived. Despite several messages to the customer support, no-one is answering - They are easy to collect your money but they are less efficient to track their shipment."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kathy Mendham",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T20:45:27.000Z",
          "Titre": "Unsuccessful conversion from iPhoto",
          "Contenu": "Unfortunately my conversion from iPhoto to motif did not go so well, the pictures were badly pixilated.  But, the company was very good about giving me a refund.  I just wish I had known apple was stopping their phonebook service earlier and then I wouldn't have had to do the conversion."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathy",
          "Nb_Reviews": 5,
          "Date": "2019-10-31T15:22:12.000Z",
          "Titre": "I ordered my Motif book in early…",
          "Contenu": "I ordered my Motif book in early October.  I live in Alaska.  I have a UPS tracking numbe.  That number indicates that my book was placed in the USPS MAIL by UPS on October 21.  I have not received the book nor can I track it any longer since since UPS does not have a USPS tracking number to give to me.  It is October 31 and I have no idea how to find out where my book is!!!!!!  IF Motif says they use UPS, it should not try to cut corners.  I do get UPS delivered packages regularly at my home address in Alaska."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Valerie Kirwan",
          "Nb_Reviews": 2,
          "Date": "2019-11-17T13:36:00.000Z",
          "Titre": "Motif",
          "Contenu": "does a lousy job of making photo books, The pages were not close enough to the back of the book so it was difficult to open without damaging the pages.  some of the pages were trimmed so a little bit of the next page was showing at the edge of the next page,  I had 3 books made and not happy with any of them,  I had ordered the 8x8 hard copy with 20 pages. found latter that I could get an 8x10 hard book with 30 pages with COSTCO for $25.  I use to be very happy with the quality of books done on iPhoto.  These are a big disappointment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rae Holman",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T17:19:49.000Z",
          "Titre": "Very difficult to use",
          "Contenu": "Very difficult to use.  Read instructions & could not make the steps work.  Did not accurately reflect which pictures were put in book; sometimes could edit and sometimes not; I worked on this one book over & over again because it was so frustrating.  Putting text in too complicated so deleted what little I had - & two words showed up (too big & on wrong page) once printed.  Had used iPhoto for years - very disappointed with switch to Motif.  Will try another program & not use Motif again.  Twice the price for same size book & number of pages."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Notafan",
          "Nb_Reviews": 1,
          "Date": "2019-07-29T14:23:10.000Z",
          "Titre": "Your instructions were opaque to…",
          "Contenu": "Your instructions were opaque to nonexistent.  We felt our way thru the process with scant guidance from you.  I'll give you an F for user friendly.  The final product was ok, though the first thing I thought of when the book arrived the angst that went into creating it.  C for the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Drake",
          "Nb_Reviews": 3,
          "Date": "2019-10-22T03:44:45.000Z",
          "Titre": "Not good",
          "Contenu": "Product is good. Shipping methods are terrible. Packages arrive busted open in transit. One order for 10 cards arrived with 5 envelopes. E-mail confirmation of shipping is hit or miss.Customer service is slow...off shore? I doubt I'll ever use Motif again. Look elsewhere. I am."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Bayot Heer",
          "Nb_Reviews": 1,
          "Date": "2020-01-17T17:47:50.000Z",
          "Titre": "I ordered 5 copies of a picture book",
          "Contenu": "I ordered 5 copies of a picture book, unfortunately several images did not print. I sent an email last week referring to this matter and received a reply from Nitesh at customer care with a request to illustrate the defect. I  subsequently sent the documentation on January 12 picturing the missing images on the respective pages. Thus far I have not heard from Motif at all.I've never had a problem in previous years and just not sure how this could have happened.I hope be able to sent out these new and complete books to my clients very soon.Kind regards,Bayot"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 4,
          "Date": "2020-01-24T12:50:02.000Z",
          "Titre": "I used to be able to buy as many cards…",
          "Contenu": "I used to be able to buy as many cards as I needed.  Your change to jump the amount from 10 up to 2 is ridiculous!!  To order 15 cards that I might need I have to order 10 with shipping charges and then do another order for  with shipping charges!  You say that this makes preparation of orders better for you .... but it does not!  You are preparing the same number of cards but getting more money to send them.  This is unfair and not good for those of us who need to order smaller amounts of cards that do not fit into amounts of 25 then 50 then 5 then 100!!!  Hate this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-12-21T03:57:59.000Z",
          "Titre": "User unfriendlyThe quality of the images is good",
          "Contenu": "The quality of the images is good, but the program is very user unfriendly. First there is no format for holiday cards; you must take a birthday format card and co-opt it into a holiday format. Next formatting and cropping photos is difficult, much more difficult than using the old Apple Photos program. Finally writing a year end summary is difficult. The program does not like mixing images and words. This is the third time I have used Motif and since it has not improved with age, I will be using a different provider next year."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:55:31.000Z",
          "Titre": "Disappointing experience.",
          "Contenu": "I found the software to be a pretty big disappointment. It was buggy- the right side of the screen would continuously get cut off, not well thought out- you can’t move photos from one month to the next in the global view? Really? and quite a resource hog- after awhile it would start to bog down and the fans would kick into high-speed. We’re not exactly rendering 4K video here… Once the calendar was done I found the ordering/registration process to be messy at best and as a result missed a sizable discount offer that couldn’t be applied retroactively. A discount that would have been nice to offset the surprisingly steep shipping costs. The calendar itself is fine, it’s of a decent quality and it looks nice, its just a shame the rest of the experience was so unpolished."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:31:59.000Z",
          "Titre": "I created and sent 2 almost identical…",
          "Contenu": "I created and sent 2 almost identical books on the same date and my recipients got each other’s books. It was highly embarrassing and logistically difficult to right that wrong on my own. Not happy."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Peg",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:56:46.000Z",
          "Titre": "Because I can’t keep book on my iPhotos because Apple stop using their program it took me 4 years to redo what I had akready done just had to hit by and my granddaughter had to wait 4 yrs to figure da",
          "Contenu": "I already texted that where did d it go? It went to title . Read it below if you can even get it now! Wrote 2 paragraphs about upset I can’t even look at the photo book so can do third granddaughters because you don’t have it stored there n my iPhoto’s like they did. Hate this!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alisa Knop",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:14:17.000Z",
          "Titre": "Disappointing experience. Will not be ordering again.",
          "Contenu": "I have been ordering two calendars from this company every Christmas for a minimum of the last 8 years. I was extremely disappointed this year at the lack of coupons, shipping cost and the inability to send both  calendars in the same package. Shipping for one paper calendar was $15. And there was no way to add both calendars to my cart so that the total cost of shipping would be $15. I paid $30 to send two calendars to my home. I complained to the company about this, and they said that there was nothing they could do. Very disappointing I will not be ordering from them again."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T03:11:31.000Z",
          "Titre": "Black smudges on all sides of photo cards",
          "Contenu": "Project arrived fairly quickly however…. There are non removable black marks and smudges on every photo card, either on the inside pages or the backside!"
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Kunde",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T19:10:26.000Z",
          "Titre": "There is no possibility to create a…",
          "Contenu": "There is no possibility to create a ptf-file from the created personal calendar. It is also not possible to transfer the new calendar 2024 to other person, or to show it in digital version.regardsDieter"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T23:31:44.000Z",
          "Titre": "Overall a difficult process with pitfalls",
          "Contenu": "Making this book was laborious and time consuming. - For starters, there's no high image per page template available. So we couldn't just click and fill and be done with it, instead we had to edit each page (100 pages!!)- Reflowing the images feature can easily destroy your whole book, and there's no version revert functionality. So if you mess up, you have to start again. Made the experience anxiety producing. - We made the mistake of removing duplicate images from our Apple photo library only to find that half the images must have been in the book. They simply disappeared leaving a blank space and no clue as to which images they were. - can't reorder the photos by created date. 99% of books we make are chronological!- Glitchy checkout! It kept failing to create the book, or got stuck in a checkout step.Promo codes: there's a promo code on Motif's Instagram with no expiry date, but doesn't work because? (sure it's for Valentines day, but take it down!). Motif also doesn't reply to questions on Insta.Promo codes also have to be entered with no character spaces before or after them. How hard would that be for a developer to code out? Not the experience Motif strives for I'm sure. Plus side was, a few incremental stability improvements and customer support was quick.P.S. Responding to Motif's reply: - As mentioned, the templates available weren't suitably dense for our needs, we wanted one with 8-12 images per page default interspersed with feature images. We wish there were more diverse design templates. - We did start duplicating the project AFTER we lost one book. Didn't see mention in onboarding that you should duplicate your project to protect your progress. I'm surprised Motif hasn't developed  functionality to revert to previous versions. Really framed the experience for us. - we write a review and then we have to go to another site and input feature requests. Not very customer centric."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Vermonter",
          "Nb_Reviews": 14,
          "Date": "2023-07-10T09:09:55.000Z",
          "Titre": "CHANGE OF LOCATION AFTER MERGER",
          "Contenu": "started out in Europe it was a EU operation out of Pragnow purchased by a USA company operating from tennessee SHIPPING costs are HighPLUS 20 percent added value taxes,last book was over $150 previously around $100 probably the best software but sadly not affordable for Europeans"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Carsten",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T04:59:37.000Z",
          "Titre": "Not all Fotos were printed",
          "Contenu": "The finished book for about 300,- € did not contain all photos that were uploaded. The proof showed no signs of unprintable photos. We still set up a complaint in a timely manner. Otherwise, the service is very good as always, reliable app, good integration in photos and speedy delivery."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Lorraine Lavery;",
          "Nb_Reviews": 12,
          "Date": "2023-07-12T22:41:16.000Z",
          "Titre": "Delivery",
          "Contenu": "Firstly parcel  not yet arrived. Also I am frustrated at paying over £10 per order. I’ve paid over £20 in shipping for 2 photo books in the last 2 weeks.  You really need to be able to combine orders so customers can complete multiple projects and order batch."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kara",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T23:57:20.000Z",
          "Titre": "The software is amazing but images are pixelated",
          "Contenu": "The software is amazing but the print quality was terrible. If you look close, you can see all of the pixels and anything like skin tones with shading looks fuzzy. I am so bummed because we spent hours working on it and over $100, but it just looks like a cheap home print job. The paper is beautiful as is the binding but the photos, all of which showed up as high enough resolution, look fuzzy and pixelated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T00:27:18.000Z",
          "Titre": "Shipping cost is ridiculous",
          "Contenu": "Shipping cost is ridiculous! $1.19 card, $12.00 shipping (default price). (4 cards @ $4.80 total  = $48.00 shipping cost)Got it down to $5.00Both options for a $1.19 product, I will use many competitor options that don’t take advantage of their customers!"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Gerhard",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T11:19:23.000Z",
          "Titre": "The book itself is perfect",
          "Contenu": "The book itself is perfect, but the pictures on the coverpage are not placed correctly. I complained about that with the support and send pictures, but the support was not very eager to understand my complaint. The told me to sent a new cover with properly placed pictures. What I received was a complte new book with wrongly placed pictures as the first time. Its a waste of resources without making me happy :-(("
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Karla",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T23:00:13.000Z",
          "Titre": "Make sure to look at the measurements",
          "Contenu": "I’ve been doing yearly albums for several years. It turns out that the album categories changed. This year’s album is half the size 😞 I’m quite disappointed ☹️"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Toronto Mom",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T21:03:49.000Z",
          "Titre": "Quality has gone down and shipping is careless",
          "Contenu": "Paper and print quality has gone down since I last printed a motif book 2-3 years ago. Also 2 of my 3 books arrived with crushed corners. The box was broken and dirty."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T21:06:10.000Z",
          "Titre": "Too expensive.",
          "Contenu": "Final book looked great, but it’s just too expensive, even with a discount. Will use another service next time"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "customer MM",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T19:59:57.000Z",
          "Titre": "Quality not good anymore and lost order",
          "Contenu": "A lot of problems. First order in March…somehow got lost. Now, ups delivery, a lot of of problems with delivery. But worst: just opened the book and the quality of the pictures is very bad!!! Other books were better in the past! What changed? Not worth the money anymore."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T11:23:17.000Z",
          "Titre": "Delivery problem",
          "Contenu": "Ups do not delivery at home but at the ups point for no reason and without giving notice. The cost of delivery is therefore too high"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer R",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T01:50:57.000Z",
          "Titre": "Apparently a blank page inserted",
          "Contenu": "Apparently a blank page inserted, perhaps my error, but other companies have asked about potential problems before developing. Also, cover arrived with tear, as it’s a gift, disappointing to pass on. Quality of photos is good though."
        },
        {
          "Note": 2,
          "Lieu": "CH",
          "Pseudo": "NDR",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:58:31.000Z",
          "Titre": "quality of the pictures",
          "Contenu": "The quality of the pictures (taken from a professionell photograph) is not good!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Maskewitz",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T17:28:00.000Z",
          "Titre": "This time around not great..",
          "Contenu": "I’ve ordered many great books from Motif. This one was sub-par. Fuzzy and grainy pictures. Pretty disappointed this time around.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Arthur Jacobson",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T05:47:07.000Z",
          "Titre": "the pictures were slightly dark..they…",
          "Contenu": "the pictures were slightly dark..they could have been a bit brighterother wise all was good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "linda cundy",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T20:32:02.000Z",
          "Titre": "Got 3-4 pages totally blank white pages…",
          "Contenu": "Got 3-4 pages totally blank white pages imbedded in the book"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Romy Eckert",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T14:04:32.000Z",
          "Titre": "Faulty delivery but responsive client service",
          "Contenu": "Unfortunately, the book was delivered with 9 printed pages and 31 empty pages. After complaining about just getting a 20% on resubmitting the project and writing a bad review, I was offered a refund as well as a free reprint. It remains to see whether the photo book will be delivered as submitted this time round."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Fisher",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T19:54:06.000Z",
          "Titre": "I created a book (2 copies)",
          "Contenu": "I created a book (2 copies), and I did, during what I thought was during a discounted period. (It was). But when I checked out the discount was not applied automatically and if there was a place to insert the code (Sum40 I think) it was not apparent. When I called the Motif help line, which was clearly a call center, they only told me I could cancel the order and repeat the order. I asked for a supervisor but was not granted this request. The book looks nice but service is poor and I should have been granted this request. I spent over $115 but should have been 40% less, and it should have been easy to refund that to my card. Other photo sites are in existence so Motif needs to improve."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "REBECCA",
          "Nb_Reviews": 6,
          "Date": "2022-05-09T14:22:04.000Z",
          "Titre": "Impersonal customer service",
          "Contenu": "Loved the app and designing the photobook was easy. Lovely designs. I went with Motif as they state they are the best photobook for iPhones pictures. Order on express delivery. Order dates given were within my timescales but when emailed customer services to confirm delivery date, the dates given was AFTER the original guaranteed date. Customer services are impersonal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ruth Ann Roberts",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T20:47:11.000Z",
          "Titre": "PHOTO ALBUM ON MOTIF",
          "Contenu": "Thought your software has improved somewhat, it has a long way to go.  Very few options in making a photo book.  Given that you are the vendor for Apple., you really should be much, much better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terry Snell",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T02:01:46.000Z",
          "Titre": "I admit that the problems may very well…",
          "Contenu": "I admit that the problems may very well have been my own ineptitude. I’m an old man unaccustomed to dealing with such apps in general. However, I was disappointed to find that a few of the photos I had thought I had included were missing, as was the very few texts I had intended to include.  Even if it is just my own fault, perhaps the process could be made more idiot-proof."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sheila McCracken",
          "Nb_Reviews": 1,
          "Date": "2022-02-17T22:51:53.000Z",
          "Titre": "I called to cancel due to a format…",
          "Contenu": "I called to cancel due to a format issue within 12 hours.  Was told it should be fine so I resubmitted with changes made.  The next day got an email declining my refund but gave me a discount on a future order. I had already sent the update because it was a gift and time sensitive. They would not apply the discount because I ordered on my own first. Paid for 4 calendars full price to use only 2 of them 😡"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Monique Dalrymple",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T20:45:17.000Z",
          "Titre": "Sepia colored photos",
          "Contenu": "I ordered a soft copy photo book for my daughter for Christmas, when it arrived I was not happy with the quality but chalked it up to the book being a soft cover and that was of my choosing. I redid the book as a hardcover, adding more pages and pictures. I would have been happy with the final project except some of the pages, had batches of sepia colored photos throughout. These same pictures were normal in the original. 😥 book."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janet Matyas",
          "Nb_Reviews": 5,
          "Date": "2022-10-04T15:29:19.000Z",
          "Titre": "Experience was painful",
          "Contenu": "This book was painful to make!  The website kept freezing on me and was so slow it took me so long to do I don’t think I’ll use it again"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Richard Wildman",
          "Nb_Reviews": 2,
          "Date": "2022-05-09T19:16:37.000Z",
          "Titre": "Loading the book failed several times…",
          "Contenu": "Loading the book failed several times and I was charged multiple times without having a confirmed order.  I still have a charge pending on my account 14 days after it having failed to go through.  Book quality good but a very poor ordering experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jean Rosow",
          "Nb_Reviews": 3,
          "Date": "2021-11-15T00:30:50.000Z",
          "Titre": "Motif--good app ruined by lousy text process",
          "Contenu": "The procedures for adding text to a book in Motif Photos are opaque and DO NOT WORK.  It is way too complicated and frustrating to add text.  It is so bad that I am looking for another app that will let me use my photos on my Mac easily and with text to make books.  The other aspects of the bookmaking process are fine--adding photos, resizing, formatting a page.  But the addition of text is SO OBNOXIOUS that I hope never to use Motif again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Leonard",
          "Nb_Reviews": 2,
          "Date": "2021-10-04T01:33:07.000Z",
          "Titre": "Pages falling out",
          "Contenu": "The app was easy to navigate and pictures uploaded without a problem. My problem with this purchase is when I received the book. In one week two pages have already fallen out! $80.00 is too much to pay for something like this and have it fall apart so soon. I will not be using this app again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy Aki",
          "Nb_Reviews": 5,
          "Date": "2022-04-21T00:15:13.406Z",
          "Titre": "I already told you not to contact him as this was a gift fro me.",
          "Contenu": "I already told you not to continue sending info to Valentine Razo as he is the person I had the book shipped to, whereas I,am the one who paid for it via,my billing address.  So stop asking reviews from him.  Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RYAN Lehman",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T19:31:49.000Z",
          "Titre": "Not really sure of the timeline for…",
          "Contenu": "Not really sure of the timeline for receiving the photo book.  Per the order email it says 6-11 business days.  I am still waiting for my project at 21 days from purchase.  If this timeline was stated at the order purchase time my frustration would be less.  Hopefully the book arrives and I am blown away with its quality for the price!Still waiting..."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Amy McDonald",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T14:44:45.000Z",
          "Titre": "Pros and cons",
          "Contenu": "Really like the layout. Concept is easy to use and that’s amazing, BUT, I have lost so many books due to unexpectedly shutting down that it’s wasted lots of my time. If you remove pictures off your iPhoto then they are lost from your book. Not that good if you need to make space. Printing is hit and miss. Some pics are good quality while others look grainy, even after correcting all the pictures they tag with a warning."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 3,
          "Date": "2020-01-30T13:02:52.000Z",
          "Titre": "Pixilated photos",
          "Contenu": "The album came quickly and was of good quality however 2/3 of the photo album had pixelated pictures and were unrecognizable. We sent an email through their submission form online and got no response. It was very difficult to find the Canadian contact number. The Canadian contact was very good and responded quickly however a week later we are still waiting to hear back as to whether or not we get a new album."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danielle Mulloy",
          "Nb_Reviews": 2,
          "Date": "2020-02-24T14:56:52.000Z",
          "Titre": "I ordered several books and your rating…",
          "Contenu": "I ordered several books and your rating system does not identify the book it is asking to rate.  I have one issue. I ordered a hardback book and the Back page photo on the jacket was fine but the same photo on the hardback book cut one person off and that was one of the more important points to that particular photo. So I am very disappointed in that particular book."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 3,
          "Date": "2019-12-27T12:48:06.000Z",
          "Titre": "Not as good as the old iPhoto bookmaking program",
          "Contenu": "Compared to the old iPhoto program I used to use to create books, I found Motif awkward and lacking. There wasn’t a layout I liked. I had to make do with one that didn’t really fit my theme. The text features were clumsy and it was hard to make changes. Mainly I miss having a spiral bound softcover option. Also charging $9,95 for shipping that took 9 days to arrive is unacceptable in today’s market."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "laura lee",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T22:07:16.000Z",
          "Titre": "The book was pretty much as expected",
          "Contenu": "The book was pretty much as expected. However, one thing I don’t like is that some pictures are blurry so I think they’re weren’t high enough quality for the spot where I put them. Overall Shutterfly is much better with the design and options and with alerting you to picture quality. I only tried motif because I have an iPhone and the picture file type is only compatible with motif."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nancy Gordon",
          "Nb_Reviews": 5,
          "Date": "2019-12-28T14:03:18.000Z",
          "Titre": "The instructional videos that you show…",
          "Contenu": "The instructional videos that you show on your website do not show all of the things that dont work easily or well when you are trying to put together a book. Too many specific things to mention here. VERY frustrating and took huge amounts of time to try to m make things work.The book printed quickly and arrived quickly, so that's something positive to say."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ted Middleton",
          "Nb_Reviews": 1,
          "Date": "2020-01-04T13:36:41.000Z",
          "Titre": "Just OK",
          "Contenu": "The photo album layout was ok but just ok - there were more options for interesting layouts of multiple photos, maps and text boxes in the original Apple application.  One of our photos in the album turned out very blurry and it was not identified in the screening to have any resolution problems.  That turned a great project into a disappointment quickly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Donaldson",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T20:08:41.000Z",
          "Titre": "Quality excellent, BUT",
          "Contenu": "Quality excellent! BUT: 1. Could not change default font on cover template. 2. Despite ordering what was presumed to be in time for Christmas delivery, I was disappointed to follow my order's tracking and see it languish in a UPS depot in Illinois from 12/20 to 12/26 for eventual delivery on 12/27, missing the party where it was intended as a gift."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura Wagner",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T00:56:00.000Z",
          "Titre": "Poor quality photos and poor quality…",
          "Contenu": "Poor quality photos and poor quality system with no way to delete photos to make multiple similar books without having to create a new album in photos 1st.  Poor customer service. It took them long to respond after several attempts.  The response did not resolve the lighting issues with the photos & some of their responses didn't even make sense."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janice P",
          "Nb_Reviews": 1,
          "Date": "2020-03-15T11:15:16.000Z",
          "Titre": "Book has a trim error and no response from customer service",
          "Contenu": "This was my second photo book to order through Motif. Like the first one, I was very pleased with the ease of putting it together; with the price; and with its general price. Unlike the first one - which was perfect - this one has a trim error along the top edge of the front cover. I contacted customer service via email according to the information provided with my invoice. To date I have not heard back from them. Accordingly, I am disappointed as this was a gift."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James C Burke",
          "Nb_Reviews": 2,
          "Date": "2019-08-30T15:20:55.000Z",
          "Titre": "Postage too high and delivery too slow.",
          "Contenu": "The time it takes to receive the cards/books is long at 6 to 11 days. The amount of postage to send a card is exorbitant. I would understand if the price of the card was higher and the postage lower.  The quality of the photos and the creation S/W is good.I hope this helps but the iPhoto app was far better. Sorry but I'm just telling you my experience.Jim"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sandra G.",
          "Nb_Reviews": 2,
          "Date": "2019-10-02T14:16:54.000Z",
          "Titre": "Needs improvement",
          "Contenu": "It’s really expensive to create and order albums.  Also I didn’t find a way to export the files in pdf version.  Previously with the albums integrated into photos, this was possible.  Also when you go out of the program, it doesn’t keep your work and you have to start from scratch.  If there’s a way, it’s well hidden and I haven’t figured it out properly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2019-08-20T23:12:25.000Z",
          "Titre": "the book quality is ok but the colors…",
          "Contenu": "the book quality is ok but the colors of the photos are poor. The color and light of the photo reproduction was just very disappointing. We had amazing high-quality pics in there-- some with stupefying light and even those were dark, off-color, and more monotone.Fine for ordinary events to document an experience but not to really delight in the photography."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bert",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T16:08:24.000Z",
          "Titre": "We had a very difficult time adding…",
          "Contenu": "We had a very difficult time adding text captions to our photo album. When the completed book arrived we were disappointed because the text font was not to our liking, and the lines of text were printed too close to the photos. We know now the reason for the crowding of the text boxes to the photos, but it would have been better to have learned in advance."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Lisa Hurst-Archer",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T17:36:42.000Z",
          "Titre": "I loved the old apple photo books",
          "Contenu": "I loved the old apple photo books.  I find the others, such as Motif, have limitations in editing photos and dropping photos in the page templates.  I recently ordered 3 copies of a photobook and one page has a single photo dropped into the one-photo template which appeared clearly to be centred in the page.  However, when I received the books, the photo was not at all centred and is a real disappointment to me.  It clearly appeared centred when I submitted my order."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2019-01-07T15:02:40.000Z",
          "Titre": "Moving pictures and title on the books",
          "Contenu": "I didn’t like that you could not move pictures around within the book. For example from the bottom left corner to top right corner. I had to delete the picture and find it again in hundreds of pics at the bottom. Also I wish the title could appear at the end of the book so you can see which one it is on the bookshelf. We have used Apple Books for years and this year they changed it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T19:08:25.000Z",
          "Titre": "It's not intuitive, poor quality printing",
          "Contenu": "It's not intuitive to drag and drop photos into the queue of \"available photos\" nor is it intuitive to drag and drop to replace an existing photo. The quality of the product was poor and the edits made to the original photos was not reflected in the printed product. Every picture had more \"black line\" in it than the digital images, which just shows that the printers used are not quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jan Edward Premo",
          "Nb_Reviews": 3,
          "Date": "2019-10-24T22:34:47.000Z",
          "Titre": "I really wish there were more options…",
          "Contenu": "I really wish there were more options for the background color for layouts, the designs of the books, and layout options also.  I hate doing text with Motif because there are no larger text spaces available.  Also if you make one wrong click with text it comes back to haunt you when you check out,  With iPhoto you could just delete not he spot and it was over.  The photo quality of the books has been good.  But I have to say I enjoyed working in iPhoto so much more."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 2,
          "Date": "2019-01-14T21:51:14.000Z",
          "Titre": "checkout process is completely unsatisfactory",
          "Contenu": "The picture book is as expected, but the checkout process is completely unsatisfactory.I had multiple instances where I selected regular shipping during checkout, then the final bills showed expedited shipping with s substantial upcharge.  Last I heard this problem still has not been fixed.  The onus should not be on the customer to find recurring incorrect charges."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dianna",
          "Nb_Reviews": 1,
          "Date": "2019-02-06T01:46:32.000Z",
          "Titre": "too expensive, harder to use",
          "Contenu": "I liked the Apple photobook creator better, but unfortunately it is no longer available. Motif is more expensive and more difficult to use.  It does not allow adding text.Subsequently to my original review I did find where the button is to add text - it as shown as Aa next to the button for the page layout - I think it would be more user friendly just to say \"text\" :-)I still find it less intuitive than the Apple program."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jean Rosow",
          "Nb_Reviews": 3,
          "Date": "2019-11-22T00:14:21.000Z",
          "Titre": "I used this ap to make a small book…",
          "Contenu": "I used this ap to make a small book several months ago.  It was WAY too hard to use.  Getting text onto each page was an aggravating challenge.  I want to put text where I want it and in different ways on each page.  I wish you would fix this fast and thoroughly. I will try one more time next year (soon), and if it isn't really easy to do text, I won't be using this ap again.  You could at least provide a way to chat with a human being and go step by step to get it right."
        },
        {
          "Note": 2,
          "Lieu": "TR",
          "Pseudo": "Miguel Angel",
          "Nb_Reviews": 5,
          "Date": "2022-08-24T16:06:10.000Z",
          "Titre": "The photos with text were cropped wrong",
          "Contenu": "The photos with text were cropped and you cannot read all the first letters on the left margin.Really bad production of precisely framed texts!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janet Cleland",
          "Nb_Reviews": 1,
          "Date": "2019-12-20T22:49:25.000Z",
          "Titre": "Overall the book was fine.",
          "Contenu": "Overall the book was fine. However the cover was a big disappointment. And because the cover and the back cover are the first thing you see it really spoiled the opinion of the entire book. On the front cover there was a big border on the left side and a small border on the right side. It was not centered. I wrote to the company I have not received any return message. Not sure right now how I feel about using them again. BYW I ordered 4 books so it makes me four times more disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2019-01-07T17:10:40.000Z",
          "Titre": "Service was fast, BUT,...",
          "Contenu": "Service was fast,. BUT quality of prints on calendar was horrible,.. horrible.  very disappointed ,. was gift for mother in law, which we do traditionally every year.  In past years the direct service of calendar, photo book etc. with Apple (which does not exist anymore) worked really well,. prints always looked good.   I will not be using Motif again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2019-12-16T20:29:53.000Z",
          "Titre": "Difficult to work with.",
          "Contenu": "Found it difficult to edit and the largest zoom was still very small. The program kept crashing with the notice that it quit unexpectedly. There was always a fear that the program would erase/delete all progress. There was limited ability to alter the size of the photos squares.Final product looked pretty good though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary Z.",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T17:50:10.000Z",
          "Titre": "I am happy with the final product",
          "Contenu": "I am happy with the final product, but had a number of issues while making it.  Many times, I would finish placing text and photos on a page only to have the program quit.  Sometimes the page and been saved, but often it had not and I had to start the page over again.Also, when I went to order, I learned that the text did not fit the space on a number of pages.  It would have been so much easier if I had known that as I worked.I do like the quality of the book, and I like all the options for formatting photos and text."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "N Thompson",
          "Nb_Reviews": 2,
          "Date": "2019-11-27T23:33:53.000Z",
          "Titre": "It was very hard to manipulate as I was…",
          "Contenu": "It was very hard to manipulate as I was used to making my photo books with iPhoto. It seemed like a few unnecessary steps before I could get the photos transferred and it took me two days to do one book that normally takes one sitting. then one of my books had duplicate pages with the exact same pictures and format."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gifting Grandma",
          "Nb_Reviews": 2,
          "Date": "2020-01-18T23:05:10.000Z",
          "Titre": "I ordered my calendar on New Years Day",
          "Contenu": "I ordered my calendar on New Years Day, and it arrived today. Since it was a gift, I was concerned that it still hadn’t arrived yesterday, and called Motif, where I was told to wait one more day to see if it arrived since I chose economy shipping. The calendar may be fine but using UPS who then hand off the calendar to USPS for final delivery is just not a very good policy since it took 17 days for delivery and there were 2 separate tracking numbers. I had to call UPS to get the USPS tracking number."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 2,
          "Date": "2020-06-06T13:29:07.000Z",
          "Titre": "Frustrating process",
          "Contenu": "I found the process very difficult & tedious—especially the final edit whereby everything kept reloading & repeating. There is no “spellcheck” feature, so despite enlarging font in the editing process, I STILL found a spelling error in my final book. The final product is lovely, but not sure it’s worth the extra work, frustration AND expense. The only advantage that I could find was that the app did use a few pictures that were HEIC, not all in my collection were jpg to my surprise! I’m going back to Shutterfly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2019-01-09T15:51:40.000Z",
          "Titre": "Dont waist your time & money!",
          "Contenu": "I ordered calendars to be printed. The photo had such poor quality it was embarrassing to give them as Christmas gifts. All the photos had streaks that ran vertically,look like the rollers from the printer on wet ink. Next time I’ll use Walgreens. Also I wasn’t able to have the holidays printed on the calendar, disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2019-04-01T20:41:02.000Z",
          "Titre": "Looking for an alternative",
          "Contenu": "My book looks nice. So I can’t fault the actual printing process. But the process of laying out the book was like pulling teeth! Text boxes would appear and then be difficult to delete, sizing of photos and text boxes was difficult, and elements on the page were connected to one another. I won’t use Motif again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 3,
          "Date": "2020-01-03T21:30:13.000Z",
          "Titre": "I love Motif, not their customer service",
          "Contenu": "I love Motif, however, I had a problem with the text boxes that I described in detail when I emailed & asked for assistance.It was obvious by the response from Motif that I just got the canned, standard \"text box\" answer.  I specifically stated the problem & I'm sure it wasn't read in detail.  If it had been, the response wouldn't have been what was sent to me.The good news is that I figured it out myself & I was happy with the photo book.Please be more sensitive to the needs of the customer. TY"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kim  Johnson",
          "Nb_Reviews": 2,
          "Date": "2019-12-07T23:45:38.000Z",
          "Titre": "Very Disappointed",
          "Contenu": "All of my images were high quality digital images but many photos in the book are grainy and most are dark. I ordered a book from Mixbook 2 weeks ago and that one is excellent. The quality of the Motif book doesn't come close. I'm disappointed because I found the software easy to use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Monte",
          "Nb_Reviews": 1,
          "Date": "2019-01-10T22:36:39.000Z",
          "Titre": "Bad experience due to partial shipment",
          "Contenu": "Bad experience due to partial shipment. We had originally ordered 750 cards and only received 350 cards, therefore went ahead to order 500 more cards as replacement since we needed to get cards sent out ASAP. Currently disputing invoice ($). Should not have been charged for additional 500 cards even though we eventually ended up receiving second portion of original 750 cards over a week later. These cards needed to be sent out on a specific date and we missed that deadline due to partial shipment mishap."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NYCPIC",
          "Nb_Reviews": 1,
          "Date": "2019-01-07T16:53:21.000Z",
          "Titre": "Disappointing print quality",
          "Contenu": "I produce every year a calendar with photopaintings, which in the past were printed by Apple with good quality. Since Apple has abandoned these services i went with the Motif app. The quality of the prints is disappointing, the colors dull, the paper cheap. Not acceptable if you want your artwork to shine."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 2,
          "Date": "2019-01-09T17:45:55.000Z",
          "Titre": "Probably won't use again...",
          "Contenu": "Definitely not as easy as it used to be using Apple's printing.  I found it challenging to find how to add special occasions to the monthly calendar.  Also, I tried to import a previously made calendar and update it...  it was a complete mess.  I should have just started from scratch.  The actual calendar printed nicely, but it wasn't really the gift I had intended on giving, but I didn't have the time to explore other options or dive into the details of how Motif works (as it wasn't intuitive)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "patricia",
          "Nb_Reviews": 3,
          "Date": "2022-05-20T13:23:27.000Z",
          "Titre": "Inferior binding",
          "Contenu": "Inferior bindingThe book materials are great and the pictures came out lovely.  The binding of the soft covered book is not stable and pulls apart easily.  Not good for long term."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynne",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T16:17:06.000Z",
          "Titre": "I was disappointed in the picture…",
          "Contenu": "I was disappointed in the picture quality sent in both the calendars and books I ordered.  All the photos were overexposed with too much contrast.  On my computer it looked fine but when the printed versions came it was different.  It was my first time using Motif now that Apple is out of the business."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wanda",
          "Nb_Reviews": 3,
          "Date": "2019-11-12T18:08:11.000Z",
          "Titre": "Not as happy as I wanted to be-  your…",
          "Contenu": "Not as happy as I wanted to be-  your print margin area is not as clear as it could be -  for instance-  you show a shadow of the inside stitching area-  but you really should show some margin on the outside-  your printing versus your allowance in placing is slightly different."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Chmaj",
          "Nb_Reviews": 1,
          "Date": "2019-12-16T04:09:43.000Z",
          "Titre": "Average Output, Poor Service",
          "Contenu": "I never received a response to my customer request right after sending the file over. The quality of pictures in the final product were mixed.  I know I have varied quality in the images but there were several I would never have sent if I could have previewed them somehow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carola  Aubuchon",
          "Nb_Reviews": 1,
          "Date": "2020-01-16T20:36:38.000Z",
          "Titre": "I designed my photo book on the iPhone…",
          "Contenu": "I designed my photo book on the iPhone app, and I am extremely disappointed with the results. Some of the pictures that I cropped and resized to display the subject were not correctly printed. The book itself is flimsy and the binding for a softcover photo book is not acceptable. The pictures run into the binding and the images are not completely visible. Why does the proof that I designed in not show the edges of pages? I would prefer to have a wire binding and an application that shows where the photo will be placed on the page and where the binding will be attached."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2019-03-11T20:49:44.000Z",
          "Titre": "This is the second book I ordered from…",
          "Contenu": "This is the second book I ordered from you. The first book came out great, This book was very disappointing. I used the same camera to take the pictures but the picture quality was poor. Almost every one of the pictures was not sharp.I don't I will order any more books from you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mary o'connor",
          "Nb_Reviews": 3,
          "Date": "2019-11-18T23:56:31.000Z",
          "Titre": "you should help to catch things that…",
          "Contenu": "you should help to catch things that are clearly wrong, that would be helpful.  and the website is super glitchy so i have at least once if not twice order two books by accident.  you should know not to do both when the website doesnt  look like its order went through..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mackenzie",
          "Nb_Reviews": 1,
          "Date": "2019-01-07T14:58:29.000Z",
          "Titre": "Not a great or easy project...",
          "Contenu": "Great interface, but the app froze & quit every 5-7 minutes and I had to re-open, load pictures and continue my project. It took several hours to make the calendar. And then once I got it, it looked great but pictures were very dark! I miss the Apple calendar interface for sure."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T13:15:37.000Z",
          "Titre": "Move one page at a time, not two",
          "Contenu": "When reviewing entire project, can only move two pages at a time to organize final appearance.  This is a big problem.  It should be possible to reorganize by moving one page at a time.  Otherwise, disorder is hard to avoid.  You have yet to equal what Apple offered."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2019-01-22T15:56:17.000Z",
          "Titre": "Good product, but terrible purchase experience",
          "Contenu": "I was happy with my experience creating a calendar with the Photos plug-in, but when I went to order six copies and had to create a new account with a different email address for each physical mailing address, I decided I would no longer be using the service after this project."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 2,
          "Date": "2019-12-20T04:47:39.000Z",
          "Titre": "Clunky and exceptionally slow",
          "Contenu": "Clunky and exceptionally slow.  Makes one irate to order 6 calendars and have to pay 6 shipping fees. Other companies call them ‘shopping carts’. You need to wake up to modern technology.  If you hadn’t wheedled the tie in to Apple I would not use your service"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2019-01-09T15:38:46.000Z",
          "Titre": "Great Product/Horrible Customer service",
          "Contenu": "Product comes out great!  Customer service is horrible! (besides no phone number! Email only!) I had difficulty applying a discount code to my order..As books take a very long time to make I figured I would order the item and then immediately contact customer service to correct the billing issue.. Motif would NOT correct the problem and told me to start over with a new promo code after I had placed the order...That did not help me in any way! Thats extremely poor customer service! No wonder apple dropped them as a vendor....I'll be looking at a different company next time..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Poulos",
          "Nb_Reviews": 1,
          "Date": "2020-01-11T13:22:47.000Z",
          "Titre": "Was unable to add text or captions to…review",
          "Contenu": "Was unable to add text or captions to the photos.  Didn’t realize size of calendar until it arrived.  Are there size options? Inserting of events in days of the week was bit confusing. Looked like they were added a day later than desired. Confusing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robin Hogen",
          "Nb_Reviews": 1,
          "Date": "2019-12-29T22:46:48.000Z",
          "Titre": "Motif doesn’t do pre-production QC",
          "Contenu": "If you are deciding between Motif and MINT - I would go with MINT.Unlike Motif, which is run by robots, MINT actually pairs you with an Art director who reviews your photos for quality and resolution prior to printing. I will never use Motif again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frank Tuttle",
          "Nb_Reviews": 1,
          "Date": "2019-12-07T01:06:58.000Z",
          "Titre": "Good handling of pictures but poor text…",
          "Contenu": "Good handling of pictures but poor text handling, especially hidden text boxes that cannot then be found and eliminated, this stopping production and requiring deletion of the whole project when almost completed. On line and phone “help” of no use."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Susan Scheerer",
          "Nb_Reviews": 2,
          "Date": "2021-08-30T18:34:32.000Z",
          "Titre": "I was very disappointed with the…",
          "Contenu": "I was very disappointed with the promise of discount promotion, several times I tried and every time it refused and said I didn’t qualify. If you don’t honour the promotional discount don’t bother offering it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2019-01-03T01:44:19.000Z",
          "Titre": "Disappointed but adequate",
          "Contenu": "The software was easy enough to use. However, when I had finished my book, I pressed the Command \"Z\" function to modify a change I had made to my book and the entire thing erased. I couldn't undo it and had to redo the entire thing. I received the book slightly damaged - I ordered a softcover and it was bent across the spine. I thought that the quality of the printed photos was okay... I expected better. It was a tad pixilated on some of the photos but not others, which confused me. I will not be using this service again. It was relatively cheap in price - I paid for exactly what I got."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 2,
          "Date": "2020-11-13T13:03:35.000Z",
          "Titre": "I’ve had my book for about a week",
          "Contenu": "I’ve had my book for about a week. It is the second one I have done with you. I am not at all happy with the quality of the pictures. They are too dark. I have been happy with customer service when I called for help. Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mkel",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T02:06:38.000Z",
          "Titre": "Disappointed",
          "Contenu": "I was very disappointed in the finished photo book.  I had done four photo books using the Apple printing app , all using my iPhone photos without a problem. This book should have been the same but it was of poor quality and expensive to boot."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOHN BECK",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T00:59:24.000Z",
          "Titre": "Dissatisfied",
          "Contenu": "Little late on shipping. Pictures looked good. Everything was how I made it. The pages started tearing from the middle when you turn the pages the first day I got it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 5,
          "Date": "2019-03-26T21:18:01.000Z",
          "Titre": "I like putting my own book together",
          "Contenu": "I like putting my own book togetherWhen i tried to move a picture it totally  deleted itnot as user friendly as you think I am no sure but i guess you have to edit before you can createJust overall had a better picture album with Apple Books"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T21:05:04.000Z",
          "Titre": "Not great",
          "Contenu": "First, your website isn't very easy to use when it comes to the purchasing function - I inadvertently ordered 1 card instead of 100 cards. When I realized the error, I reordered, found how to make the quantity 100 cards and, since I'd lost so much time, added $19.95 to expedite the cards. The cards came but they weren't my cards, they were another family's cards (which I still have). I asked to have mine reprinted and overnighted at your expense which, thankfully, you did. But no one on your customer service side responded on how to return the wrong cards even though I asked twice. Not a great experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2019-07-08T20:22:22.000Z",
          "Titre": "I wasted 5 days with this software",
          "Contenu": "I wasted 5 days trying to produce a calendar. Your software doesn’t work with Apple photos when stored in iCloud. I had to move all of my images to a second Mac that wasn’t linked so I could finish the calendar. I then had to pay thru the nose to expedite shipping due to the five days I lost. What’s also frustrating is that images on the first attempt simply vanished after I had completed it. Since I couldn’t print a proof I could never get the finished calendar to match. Your software pretty much matched the old Apple software so it had all the features which your competitors lack. That was good. The one feature you lacked was reliability."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wendy  Wilson",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T12:29:02.000Z",
          "Titre": "The quality of the printing was poor",
          "Contenu": "The quality of the printing was poor, colors were dull and images were grainy. The binding actually fell apart within a few days! I have sewn it back together. I got a similar book a few years ago thru apple and it was much better."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen Lemcke",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T21:05:09.000Z",
          "Titre": "Ap needs improvement",
          "Contenu": "Your app doesn’t show how much of the picture will be tucked into the binding so 4 of my pictures were ruined and I had to request a total refund. Your pages are too Thick."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2019-01-09T16:32:05.000Z",
          "Titre": "Need better packaging",
          "Contenu": "Hi People at Motif,The package of calendars arrived with one end fallen out of the package with the calendars exposed and dog eared in the corners, but not enough to send them back.  It seems your packaging needs to be sturdier."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 1,
          "Date": "2019-01-02T23:10:23.000Z",
          "Titre": "Poor photo quality on Portrait calendar",
          "Contenu": "I found out at the last minute that the company I usually order my calendar Christmas gifts from is no longer providing that service.  I decided to give Motif a try. I ordered 7 landscape calendars and 8 portrait collage calendars.  The quality of the calendar itself was very high, however, the photo quality was not as good overall.  The landscape photos turned out satisfactory but many of the portrait photos were grainy and dark in some spots.  I exported all photos with the same settings so I'm not sure why there was such a difference between them.  I was not very excited to give my calendar this year but I didn't have the time or money to reorder."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rich L",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:45:36.000Z",
          "Titre": "Nice but rather expensive",
          "Contenu": "First let me say that the calendar I made turned out very nice. That being said, it wasn't quite as easy as it looks (drag and drop), yes but, there was a lot of adjustments to be made and adding text isn't all that easy. Changing fonts and sizing etc. Then it was over $100.00 for three calendars which seems like a lot to me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Breton",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T04:07:42.000Z",
          "Titre": "Layout selection gets clunky",
          "Contenu": "It is difficult to have a different layout for different months of the calendar because I keep having to pull up the layout option and delete what it puts up to select the layout I want. I also have to be careful to not mix high key photos with low key photos on the same page or it throws the exposure of the whole page. If I am giving a calendar as a gift I have to be sure I leave enough time for it to be reprinted in case one photo throws the exposure of the entire page. Something in the app to show how it sees the page exposure would be helpful. Otherwise I would need  the ability to create the composite outside of Motif and import it, but for that I need the exact aspect and dimensions the app will use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JTS",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T20:57:14.000Z",
          "Titre": "I have made and ordered books with…",
          "Contenu": "I have made and ordered books with motif for sometime now.  Always a good experience.  However, this time my book arrived with pages all wavy and the book was not flat due to wavy pages.Otherwise book looks good and like I said typically a positive experience with this company."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "STF",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:32:36.000Z",
          "Titre": "My experience with Motif,",
          "Contenu": "I have been your Calendars customer for the last few years, every time you change the ways to enter my details which makes me very nervous This year you even force me to accept add on words on the front page and the back page also or otherwise I couldn’t complete my orderPlease give me a choice to do it in my favorite way. Otherwise everything is Okay Looking forward for your improvements in the coming year"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Valerie Seaward",
          "Nb_Reviews": 7,
          "Date": "2023-12-18T16:47:56.000Z",
          "Titre": "Great quality cards but often too dark and expensive postage",
          "Contenu": "I love the general quality of cards and the ease of preparation. Communication is excellent from ordering to receipt with a very reliable email service re delivery.However, there is a constant issue with photographs submitted being too dark. I realise that Macs have very bright screens and compensate for this but even so, some cards with lots of midtones and shadows are unusable. Also, the offers with free postage have stopped....postage is astronomical and stops me from getting cards as often as I used to do."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:19:48.000Z",
          "Titre": "$$$$$",
          "Contenu": "I started using Motif a few years ago to make a family calendar as a Christmas gift for my parents.  I have seen the price of the calendar increase significantly over the years and this year, the cost was an average $46 to produce just ONE calendar and ship it to family members. The fact I order multiple calendars (11 this year) means any increase hits the pocket book hard, and this year has been the hardest.  I'm extremely disappointed in the price increases and the fact I may no longer be able to afford the services of Motif."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T00:54:34.000Z",
          "Titre": "Disappointing image quality",
          "Contenu": "The page layout software worked very well, and the automated photo layout was good, only had to move around a couple of images. I ordered a book from Motif years back, and the image quality was outstanding, using 6 megapixel images. The image quality for the book ordered this year was disappointing, noisy images that were easily noticeable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mr Nelson",
          "Nb_Reviews": 6,
          "Date": "2023-12-21T05:45:20.000Z",
          "Titre": "I ordered holiday cards on 12/2 and was…",
          "Contenu": "I ordered holiday cards on 12/2 and was given a delivery date of 12/11. They never came until 12/20."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 4,
          "Date": "2023-12-15T20:46:27.000Z",
          "Titre": "Thumbs sideways",
          "Contenu": "I was pleased with the quality of my first order a year ago but this time the photos were on the dark side and not super crisp. For that reason I’ll think twice before ordering another MOTIF project."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Devlin Ford",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:38:37.000Z",
          "Titre": "Great service, too expensive",
          "Contenu": "Ive been purchasing your books annually.  The price has gone up to the point where I can only afford the paperback books now.I'll be looking for an alternative with better pricing next time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:48:33.000Z",
          "Titre": "Program isn’t very user friendly",
          "Contenu": "The book turned out quite well; however, I did not find the program very easy to work with.  It was not nearly as user friendly as other photo book programs I’ve used.  I won’t use it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tim",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T07:16:52.000Z",
          "Titre": "Change to Mimeo",
          "Contenu": "The book I recently received, apparently, was produced by Mimeo instead of Motif. While the outer packaging was identical, inside the book was not enclosed in a clear plastic sleeve like previous books we have purchased through Motif. The overall quality of the book was good, but somehow did not seem quite up to par with previous books. Also, the receipt in the box was from Mimeo, and all it supplied was (supposedly) a URL to their web site support page; loading the URL produced a screen that said the page no longer exists! Looking through the Mimeophotos.com web site there was no where on the site (even on the “support” pages) to raise order issues or even contact a Mimeo representative in any way. Using an email link I had recorded from previous books for Motif I was able to contact a Mimeo rep, but if you don’t have that old email address good luck getting any help from these guys."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:08:25.000Z",
          "Titre": "The first book I ordered arrived with a…",
          "Contenu": "The first book I ordered arrived with a cracked spine and had to be replaced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:16:37.000Z",
          "Titre": "Book was nice overall",
          "Contenu": "Book was nice overall, but developed a crease rather quickly!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:33:20.000Z",
          "Titre": "The little photo book is nice but….",
          "Contenu": "The little photo book is nice..  sadly the quality of the prints is quite inferior to the photos I used. I don’t know if there is an uploading problem but they are washed out and fuzzy. I used high resolution images and the book is small.   the last photo book I had made was when Apple was still printing and it was far superior.  I am not totally displeased but not happy enough to try again.. UNLESS there is some way to increase the quality.   the book itself is very nice."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Brooks",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:20:07.000Z",
          "Titre": "Mehh",
          "Contenu": "better than nothing but not easy to move photos around"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T18:49:07.000Z",
          "Titre": "Finished product very expensive $550",
          "Contenu": "Finished product very expensive $550. I was disappointed that a lot of photos included in my album to be included were excluded because not big enough to insure proper printing,  most of those were full frame photos that had been cropped somewhat but surely not to the extent, they wouldn't print in small size. Did not know how to get them included any way."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William A. Hill",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T21:11:25.000Z",
          "Titre": "Great Calendar for Family Photos",
          "Contenu": "1. Quality, appearance and color reproduction are excellent. The photographic paper stock is substantial, and the wire hanger is appreciated.2. Communication with technical help is excellent: friendly and prompt.3. Choice of tools to personalize the calendar is limited, but perhaps adequate for the majority of users.4. Dimensions of the calendar - photographers who wish to display their work in the same ratio of width-to-height that their camera produces will be disappointed. The 13\"x10 1/2\" dimensions of the calendar will force any photograph to be cropped to fit. For those to whom cropping is not a problem, this will not be an issue.  For  serious photographers who would like to display their images as they framed them, it would be greatly appreciated if Motif Photos would build into their software the ability to accomodate photos as they were taken. This would make it possible to display photos as they were intended to be seen. Adjustable border areas would be required."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "felicia",
          "Nb_Reviews": 3,
          "Date": "2023-10-31T21:58:30.000Z",
          "Titre": "Pretty Good, Could be Better like using the app and tutorials are…",
          "Contenu": "I like using the app and tutorials are helpful. Quality of the final book is pretty good. But I am unhappy that the staff does NOT look at the book in advance and share any concerns/suggestions about improving it. The “review” is completely automatic it seems."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T01:17:55.000Z",
          "Titre": "Don't print",
          "Contenu": "I've enjoyed the motif platform to created by book.However not a fan of the printer company that they work with mimeo.The pages of my 30 page softcover book came apart from the bind once I opened the book. I've ordered 300+ pages of photobooks from various photobook companies and have not had this issue. I am quite disappointed by the quality of the book and the response I received of how it was my fault that the pages fell out of the book. Anyways, great service to organize and create photobooks. Horrible partnership with mimeo."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T04:32:39.000Z",
          "Titre": "I think the printing is done well",
          "Contenu": "I think the printing is done well. I just have a hard time with the “less than” software. I used a program called Heritage Maker that included so much flexibility, unfortunately, they went out of business. This was number seven of the same style of books I have made. Motif has fewer features than I would like to have."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T20:11:59.000Z",
          "Titre": "A little disappointed",
          "Contenu": "The program wasn't as user friendly as in previous projects with Apple. The selections of backgrounds and themes was limited and some of the photographs were a little difficult to see because they seemed caught up in the spine. The book was well packaged and arrived within the 8 days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Morris",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:16:36.000Z",
          "Titre": "Too much red in skin tones",
          "Contenu": "Much of our book came out great and reminds us of a great trip.However...There are a few pages where skin tones came out very red. Noticeably so. And, it does leave us with regrets.On screen, those skin tones look great. Skin tones with other images in the book look great. It is just a few pages where things didn't meet expectations.I am a graphic designer, and have been to more press checks than I can count. If I was doing a press check on this, I would have asked they cut back the magenta or pull it off the press."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T03:29:30.000Z",
          "Titre": "Nothing wrong with quality and speed of…",
          "Contenu": "Nothing wrong with quality and speed of filling order.  I do not like the way text boxes can be moved around on the format. It need to be able to be moved around on the pages with ease."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "RIGAL J.",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T19:15:48.000Z",
          "Titre": "arrivé à l'heure mais abimé",
          "Contenu": "La livraison a été reçue dans les temps, le livreur n'a pas sonné étant données l'état du paquet, il a mis l'ensemble du paquet dans la boite au lettre, je pense que le paquet a été rangé à coup de pied, les livrets sont donc abimés, heureusement légèrement. Mais c'est tout de même incroyable. Pour information je travaille à domicile.The delivery was received on time, the deliveryman didn't ring the bell given the state of the package, he put the whole package in the letterbox, I think the package was kicked away, so the booklets are damaged, fortunately slightly. But it's unbelievable all the same. For your information, I work from home."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:02:14.000Z",
          "Titre": "I did not find the colour very vivid",
          "Contenu": "I did not find the colour very vivid, although the layouts were easy to use."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Sylvie Chiricota",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T22:34:24.000Z",
          "Titre": "Punta cana 2023 voyage des copines",
          "Contenu": "First of all, i don’t speak and write well in English. So i will write in french and you need to translate with an application. Tanks for your understanding. Je suis satisfaite de l’album, par contre, j’apprécierais que vous offriez la version en couverture souple en format 8x11."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim H.",
          "Nb_Reviews": 4,
          "Date": "2023-08-24T21:29:08.000Z",
          "Titre": "Cumbersome but Good Results Possible",
          "Contenu": "I like Motif as it works on my Mac Powerbook, and the results have been good, overall. However, it is difficult to work on Motif on a laptop as the text boxes are hard to read when the font gets below 20. As a result, I did have a number of typos so I'll be redoing the book to correct the typos. Double check your work. Also, the page templates can be confining. I am generally pleased with the integration with Apple, & the final product can be good. Just be careful."
        },
        {
          "Note": 3,
          "Lieu": "LU",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T10:03:13.000Z",
          "Titre": "My EU country suddenly dropped from their delivery options",
          "Contenu": "Motif seems to have been taken over by another company. The outcome was that whereas the album creation was as before, the quality is very marginally down and they let me know after uploading that they no longer deliver to my region (Luxembourg - EU). To save the work I had put in, I had to have it sent to friends in Belgium. The helpline was responsive, but offered no way to correct the situation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T23:37:26.000Z",
          "Titre": "Because one does not have to transfer…",
          "Contenu": "Because one does not have to transfer photos makes this a very easy process.  However, the end product, book, was not up to the same standard of other companies I have dealt with. For example the binding seems very flimsy and poorly made.  In the future, I will consider other companies.  Also, the quality of the paper was inferior to others!  Your price is also higher so one would expect a better product rather than a poorer one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anela",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T20:47:17.000Z",
          "Titre": "I still do not have my photo book, but…",
          "Contenu": "I still do not have my photo book that I ordered almost 3 weeks ago. After receiving some rather unfriendly e-mails (\"you did not choose the right shipping option, your estimated arrival date is 8/14\", which is in another almost 3 weeks), someone at motif obviously read my not very pleasant review and send a long and apologetic response. I now am offered a refund and a reimbursement of the shipping costs. Thank you! It is nice to know, that there are people at motif that care. I love to write positive reviews and hope to be able to do so for motif in the future."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Françoise Michel",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T09:05:28.000Z",
          "Titre": "Too simple and classical",
          "Contenu": "Very Classic …Not possible to have special design"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T21:59:19.000Z",
          "Titre": "Liked the simplicity",
          "Contenu": "Liked the simplicity. Lacks many of the features of other photo book companies (stagger photos on page, more backgrounds and colors to choose from, a reminder if you have used a photo more than once, etc)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philip  Kenney",
          "Nb_Reviews": 3,
          "Date": "2023-07-17T15:47:10.000Z",
          "Titre": "Disappointed with color",
          "Contenu": "My book, Redwoods, was disappointing. The colors, especially those that framed the photos, were quite a bit darker than in the editing samples. They lacked the richness of your samples. Also, the text box can be a real pain, but that may be my problem. My real complaint is with the color. I have had many books printed by Motif and my experience has been quite positive to date."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RWN",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T21:21:26.000Z",
          "Titre": "It’s Ok - but….",
          "Contenu": "For some reason, once I ordered my book and then went back into my project there were no photos in it - so I could not order another book without starting completely over. It was saved, so I do not understand.  It should remain until I delete it.  Also, there should be more options on designs and layouts."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T17:44:01.000Z",
          "Titre": "Good for pics, bad for text",
          "Contenu": "I like how easy it is to enter images and move them around. For text though it is very difficult to use. Simply the fact that you lose your text if you don‘t click outside the Textbox before moving onto something else made it a very frustrating process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ET",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T03:11:52.000Z",
          "Titre": "Room for improvement",
          "Contenu": "The quality of the paper was good.  Binding was also good. Very little wait time to receive the book after it was ordered.  I was disappointed that many of my pictures were not sharp.  The old Mac book album would give a warning if photos were going to look blurry when blown up.  This app did not.  Also it was difficult to add captions under pictures."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Delphine",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T07:30:00.000Z",
          "Titre": "Ok experience",
          "Contenu": "Thé qu’amortit of thé product was there but thé shipment was a bit long. Plus displaying thé price without VAT during thé making process of the album leads to a bad surprise when ordering…. Without thé Mother Day code I would not have proceed."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T19:02:30.000Z",
          "Titre": "Good quality, surprising price",
          "Contenu": "The quality and the user interface is good. What was not so pleasant was the pricing, saying it´s 19,99€ + VAT and at the end (after one spend a lot of work and doesn´t want to cancel) it´s more than 38,00€ with tax and delivery..."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T22:03:38.000Z",
          "Titre": "The support team was great…",
          "Contenu": "The support team was great…very helpful.The delivery company was terrible. It was the worst delivery experience I have ever had. Fortunately, Mohammed was able to intervene and I got my product.After I picked it up, they sent me about 3 notices to come and pick it up."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:27:21.000Z",
          "Titre": "Expensive",
          "Contenu": "Interface while uploading the project was confusing (error message), and help from the help desk was friendly but useless. Also, the whole service is too expensive for the result."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T23:29:10.000Z",
          "Titre": "The quality in times of original Motif…",
          "Contenu": "The quality in times of original Motif was much better, as a sample the paper quality of the dust jacket was quite more impressive than the delivered material from „mimeo“, the pages are no longer cut so cleanly….lesser quality for a higher price seems to be the cost for this take over…I will now have a look around for a competitor who will deliver the usual quality…."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen Kirk",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T18:52:03.000Z",
          "Titre": "When I would opt to change page layout",
          "Contenu": "When I would opt to change page layout, I found that I could not scroll down to see all options, like I wanted to have 5 photos with text, it would only show me the 5 page layouts without text as the text pages needed to be scrolled down to. I had to keep coming in and out of it to see what I wanted. This is new as it was not like that when I used this app previously."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laney",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T20:26:18.000Z",
          "Titre": "Disapointed",
          "Contenu": "I had typos that were not corrected. I also didn't like that when i added a folder to mofit the pictures were no longer in order, this was a time suck. Lastly Mofit was more expensive the their competitors.  I used it because it was my first time and i own a mac but i will be shopping price next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maor",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T18:18:30.000Z",
          "Titre": "Great album, bad design app",
          "Contenu": "The album itself is high quality and as expected. The design software, however, is very unintuitive. I'd recommend it only if you don't have a choice because it's apple photos..."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "sheri gardner",
          "Nb_Reviews": 2,
          "Date": "2022-10-29T01:11:07.000Z",
          "Titre": "This is not the first book that I have…",
          "Contenu": "This is not the first book that I have ordered… I usually order two and give one to my in-laws… It is beautiful quality and color as always however the book that I am keeping for myself had a page completely ripped in it! At first I didn’t know what I was looking at but when I flip the page you could see the white border as the whole top of the page was ripped off. I’ve never had that happen before. But it’s just for myself and I am gifting the other book which does not have a tear. Maybe there was no final check done on this book? Because I don’t see how that could be missed?"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mike Shepherd",
          "Nb_Reviews": 6,
          "Date": "2023-07-07T23:13:11.000Z",
          "Titre": "The product looked great when it was…",
          "Contenu": "The product looked great when it was delivered but I had to give up on captioning the photos as the app crashed and support couldn't tell me why."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katy",
          "Nb_Reviews": 2,
          "Date": "2023-05-07T18:24:51.000Z",
          "Titre": "The book was never delivered",
          "Contenu": "The book was never delivered and had to be republished so I did not have it on time to give as a birthday gift. However, the response from Motif was swift and helpful. I am still waiting for the new book to arrive."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "RICHARD PARR",
          "Nb_Reviews": 17,
          "Date": "2022-11-23T20:50:05.000Z",
          "Titre": "2023 Calendar",
          "Contenu": "great quality calendar with ability to have a wide choice of page layouts.  However, experience diluted by the cost of shipping which was a third of the total price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Manrodt",
          "Nb_Reviews": 3,
          "Date": "2022-10-28T04:38:35.000Z",
          "Titre": "Remembrance of France",
          "Contenu": "I liked being able to choose the pictures I took to put in the book but I found it difficult to pick a format where I could include some text. And I had to constantly adjust the sizes of photos to fit the format."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Stacey Ross-Smith",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T18:29:14.000Z",
          "Titre": "Good quality",
          "Contenu": "Everything was amazing, except the last flap was supposed to be blank but for some reason the template txt was printed there which looks silly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carole",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T01:18:57.000Z",
          "Titre": "This is similar to the old Apple Photos…",
          "Contenu": "This is similar to the old Apple Photos application, which I liked very much.  Some of the things that could be improved in Motif are:  You should be able to switch pictures around on a page without having to replace that picture with another from the \"deck\" and then, from the \"deck\"  put back the picture you simply wanted to have in a different place on the page.  Also, Motif needs to have more themes from which to choose.  Also, customer service needs improvement.  It took several emails and several days for me to get answers to questions when I was trying to learn how to use Motif.  Also, you need to have a customer service phone number listed in the \"Contact Motif\" on the website.  Turns out you actually do have a customer service phone number that has real people to talk to, but it took several emails to get you to give it to me.  A chat service would also be nice.Despite the bumps in getting to know how to use Motif, I will definitely use it again."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Client",
          "Nb_Reviews": 7,
          "Date": "2023-09-12T06:57:50.000Z",
          "Titre": "Annoying",
          "Contenu": "It is very frustrating no to be able to reduce the size of the picture. Globally, it does not work very well. The latest version is worse than the one before. I do not think I will use it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Polly Spinnler",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T23:38:40.000Z",
          "Titre": "Photo Book",
          "Contenu": "I have made several photo books using Motif and have been very happy with the results. The last book I made the cover of the book was not folded as well as it should have been. The other books did not have this problem."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jenny Salte",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T04:16:36.000Z",
          "Titre": "I love my photo book but it wasn’t…",
          "Contenu": "I love my photo book but it wasn’t easy. The text box was  hard to manage.  It should have appeared where my curser was but it didn’t.  It always appeared on the bottom of the page and I had to move it.  The text box did not move as a unit and I had to move all four sides to position it where I wanted it.It was a struggle.It was expensive.A lovely memory now that it’s done but it was extremely time consuming and painful to execute. I kept thinking there must be an easier way.  I watched the video tutorials many times. Thanks for asking my opinion. No hope you can use my experience in a positive way for your clients. Sincerely, Jenny."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "catherine Patte Möllmann",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T18:16:40.000Z",
          "Titre": "I was surprised that two pictures which…",
          "Contenu": "I was surprised that two pictures which i chosed, appeared two times in the same album . I arranged it on an other way. And i was a bit disappointed"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T12:28:26.000Z",
          "Titre": "There was some glue on tree pages",
          "Contenu": "There was some glue on tree pages. they were stick together and a bit wrinkled. I succeeded to remove the but the wrinkle stayed in the page. I had the book asa a present and needed it , so I decided to keep it and gave to y brother. He didn't noticed. ( his eyes are not as good as mine)"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "JOSE ANTONIO FERNANDEZ GOMEZ",
          "Nb_Reviews": 4,
          "Date": "2023-04-26T22:46:39.000Z",
          "Titre": "Tilte Front page  without brightness",
          "Contenu": "Title Front page without enough brightness. The previous image was more clear than the reality is"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Humphrey",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T20:13:04.000Z",
          "Titre": "Acceptable, but not much more...",
          "Contenu": "Not as good paper or binding as other Apple picture books. Acceptable, but not much more."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T20:28:09.000Z",
          "Titre": "Disappointing",
          "Contenu": "Good experiences in the past but one of my calendars had ruined pictures because the pages came stuck together."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence Blymyer",
          "Nb_Reviews": 2,
          "Date": "2022-11-16T19:43:54.000Z",
          "Titre": "My first time using site",
          "Contenu": "My first time using site, a little more difficult than expected setting up pages and separating groups, quality of product was fine."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "david johnston",
          "Nb_Reviews": 6,
          "Date": "2023-08-03T19:05:41.000Z",
          "Titre": "expense",
          "Contenu": "not a lot of choice or formats more  expensive than rivals companies"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Elizabeth Lines",
          "Nb_Reviews": 7,
          "Date": "2022-10-18T20:00:25.000Z",
          "Titre": "Almost simple to use",
          "Contenu": "I do find it tricky to drag a file into a new project. But much simpler than other products on the market for Mac users"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T11:38:55.000Z",
          "Titre": "Delivery time",
          "Contenu": "Delivery time was a week out (having been ten days to begin with)."
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T23:55:33.000Z",
          "Titre": "Paper was not the same quality as…",
          "Contenu": "Paper was not the same quality as previously"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ginny",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T06:29:21.000Z",
          "Titre": "Calendar",
          "Contenu": "The majority of calendar photos were excellent, but three turned out darker than expected."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "B�rbel Dutt-Hanus",
          "Nb_Reviews": 3,
          "Date": "2023-06-15T09:59:39.000Z",
          "Titre": "The Product is very good",
          "Contenu": "The Product is very good, But the Time from oder to delivery lasted too long."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "Francesco Alamia",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T15:41:23.000Z",
          "Titre": "Medium Quality",
          "Contenu": "Onestly, I was aspecting more from the quality of the pictures"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Kate",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T20:23:43.000Z",
          "Titre": "The quality of the print (color of the…",
          "Contenu": "The quality of the print (color of the pictures) is disappointing."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Hermann",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T17:59:19.000Z",
          "Titre": "I had to wait",
          "Contenu": "The announced delivery time was not kept at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary buntin",
          "Nb_Reviews": 3,
          "Date": "2022-10-13T21:19:43.000Z",
          "Titre": "The past books have been wonderful",
          "Contenu": "The past books have been wonderful, for some reason this was not."
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "Denegri Igor",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T09:05:18.000Z",
          "Titre": "Good quality print/price !",
          "Contenu": "Good quality print, but price very expensive!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "BC Logan",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T21:58:37.000Z",
          "Titre": "It’s a good product YouTube how to use before starting",
          "Contenu": "The product is not user friendly but with time and patience I really like the end results."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Eileen Brown",
          "Nb_Reviews": 4,
          "Date": "2022-09-26T11:57:58.000Z",
          "Titre": "Would love to see my photo books",
          "Contenu": "Have always been happy with my Motif photo books. I would like to comment on the books but as I have not yet seen them I cannot. I was given A delivery date if Thurs 22Sept then Friday now Tuesday 27th. As now on holiday for a week I have a problem!!!!!! Hope to see them next week🤞🤞🤞🤞"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Debbie Oviatt",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T22:33:39.000Z",
          "Titre": "I wasn't impressed with the quality of…",
          "Contenu": "I wasn't impressed with the quality of the photos."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeni K",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T21:10:34.000Z",
          "Titre": "Photo book quality is just ok, not great",
          "Contenu": "I tried Motif because it integrated with my Apple Photo app. The experience of making a photo book was good enough, but the end product didn't wow me. It was just ok. Not something I could give as a gift and feel good. The color and print quality was mediocre."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RONALD GRANGER",
          "Nb_Reviews": 4,
          "Date": "2022-09-03T16:54:08.000Z",
          "Titre": "Would appreciate being able to put…",
          "Contenu": "Would appreciate being able to put pictures closer to each other on each page.I thank you for the opportunity to e-mail questions & that you are open to suggestions.I accepted the update while working in Motif photo & that was a mistake. Next time I will get out of program, do update you send then get back in.I just finished my 8th Motif album."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "J. Terstappen",
          "Nb_Reviews": 4,
          "Date": "2023-06-27T20:00:28.000Z",
          "Titre": "The price went up incredeable !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dean Irwin",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T00:57:17.000Z",
          "Titre": "A mixed review for Motif",
          "Contenu": "Motif's A.I. software is fine for people who want to create \"My trip to Paris\" from an iPhoto album with all their Paris photos, then click \"Auto\" and let Motif do the rest.  My job required complete manual control, and basic features such as soft edges for photos and drop-shadow for text so it stands out better were entirely foreign to Motif Customer Support.  They had no clue.  So the ability to customize photos and text needs work as does their support.  On the bright side, the printed book was of high quality and it arrived on time.  So Motif delivers a good product if you can figure out the software yourself."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Martine Williams",
          "Nb_Reviews": 2,
          "Date": "2022-07-16T16:31:07.000Z",
          "Titre": "We had 240 pictures of Canyons we…",
          "Contenu": "We had 240 pictures of Canyons we visited but some were repetitive and I thought you would eliminate the ones that re the same but instead you just moved them to different pages.  I have seen other such albums where pictures were set artistically but this was not the case. Pictures were just set on pages with no design. Sorry but I won’t use your services again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elena Yasno",
          "Nb_Reviews": 3,
          "Date": "2022-07-09T00:07:53.000Z",
          "Titre": "I enjoy doing my projects with Motif…  But this time the quality was not good",
          "Contenu": "I enjoy doing my projects with Motif and have done many books before.  This time everything was good, very timely delivery, however the quality of photos in the book are not good at all.  Some are totally overexposed and the colors are totally wrong.  Not happy this time around.  Would like to know what changed in your printing process?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Darrel Massey",
          "Nb_Reviews": 2,
          "Date": "2022-06-28T20:59:22.000Z",
          "Titre": "Printer Glitch",
          "Contenu": "Unfortunately, there had been a glitch in the printing process and all the pages had a faint white line running from top to bottom. The good news is that when I brought it to the attention of Motif's customer service they immediately notified me that they would send a reprint at no extra charge plus gave me a 20% off credit on a future project."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deborah",
          "Nb_Reviews": 5,
          "Date": "2022-06-25T01:33:57.000Z",
          "Titre": "Motif is just ok",
          "Contenu": "Motif is rigid and not easy to use - I am an advance user of Photoshop and other Adobe programs. For example retaining one typeface and font does not work on my Mac. And if I stray off the text box I am creating, it defaults to the  Helvetica message. These selections should be retained and global. I think the options for image placement should be more varied or just not have options at all. Let me place my image and arrange it as I like."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "S Robertson",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T00:36:53.000Z",
          "Titre": "Meh not consistent quality",
          "Contenu": "I have been using Motif for awhile now so I shouldn’t be surprised when the color is off on their print of my photo. I’ve had problems in the past and even called customer service because their print was so off (the dark areas were just too dark) but he said it was the settings on my computer, how bright my screen was that was making the issue. Maybe that was true but then in this last batch one of the prints was so bad due to the fact that the color was so distorted as to make the photo ugly and this time it had nothing to do with how light or dark it was. To be fair, they do get it right most of the time but their prints are all computer generated. There is no oversight. I at least look at my photos before I send them. I am looking for another company to do my prints. I’ve never had problems like this before"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Page",
          "Nb_Reviews": 2,
          "Date": "2022-08-17T14:28:47.000Z",
          "Titre": "My Trip",
          "Contenu": "The presentation (book cover and folds) was good.  I liked setting up the pictures, they were initially placed in chronological order. When the book arrived, the cropping took out to many important parts of the pictures."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carolyn Glueckstein",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T00:58:46.000Z",
          "Titre": "I have been trying to contact someone…",
          "Contenu": "I have been trying to contact someone at motif for a week now.  I sent an email and have called several time only to be disconnected each time.  The books I ordered and all the  black and white photos have a yellowish hue to them.   They are wedding photos taken by a professional photographer and they do not have a yellow cast to them.   I would love to get this resolved.  I am giving this book to my daughters mother in law and would like it to be perfect.  Thanks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VAC",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T06:17:17.000Z",
          "Titre": "The front cover came apart when I tried…",
          "Contenu": "The front cover came apart when I tried to turn the page."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CNC",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T13:05:30.000Z",
          "Titre": "Excellent product but more features needed to make preparing a book or calendar smoother and less subject to mistakes.",
          "Contenu": "The product Motif turns out is excellent and they offer the largest sized calendars of any of the major suppliers.  However, the lack of an undo command means you can destroy hours of work with a simple mistake.  I understand they will unveil an undo feature (I think one that let's you go back as far as you want) soon and that will make this a much better product.  I wish also that you could swap all the pictures for one month for all the pictures of another month but that is not the case.  I have found their customer service very responsive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 3,
          "Date": "2022-02-24T01:00:44.000Z",
          "Titre": "Latest Purchase Not Up to Par",
          "Contenu": "I’ve been using Motif to make our big annual photo book for the past 6 years. I like the clean simplicity of the albums and I have always been impressed with the quality. Our 2021 album arrived last week, and I was kind of disappointed. Some of the colors on the cover did not print true, the spine appears stretched and creased (enough though the album is not any larger than albums from previous years), and the corners are a poorly glued and a bit frayed. The quality is just not up to par with previous albums."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randall Holl",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T20:06:04.000Z",
          "Titre": "Poor customer service, good product.",
          "Contenu": "The product was great, but I paid a lot for expedited shipping and it was never expedited - in other words, it showed up two or three days late. Normally a company would reimburse for something like this - I wrote to them explaining the issue and never received a reply. Too bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Pankratz",
          "Nb_Reviews": 2,
          "Date": "2021-09-25T17:07:11.000Z",
          "Titre": "Photobook",
          "Contenu": "I gave 3 stars to my book because the final product turned out quite dark.  All the pictures are darker than the original and dampen the mood of many of the scenes.On the flip side, the software was easy to use—much more adjustable than the other 4 or 5 products out there.  I enjoyed making my photo book, just wish it was brighter!"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Aleksandra",
          "Nb_Reviews": 2,
          "Date": "2021-09-19T15:31:49.000Z",
          "Titre": "We had many issues creating our albums…",
          "Contenu": "We had many issues creating our albums with Motif. Quality of Motif's albums  is not as we expected. Also working with their program, creating album can be frustrating. However, they have good customer service. They really try to help with all issues. Another good thing is quick shippment. Albums come really fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter in Florida",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T15:51:17.000Z",
          "Titre": "A+, with a Fumble at the Finish Line!",
          "Contenu": "I've had dozens of photo books and calendars made by your company – dating back to 2004 when they were white labeled as Apple Photo Books. I'm super impressed that over the years you've continuously upgraded your processes to produce higher and higher quality books. The same is true for the Motif app – it keeps getting better over time. Anyhow, my most recent book is a perfect example of high-quality materials and excellent printing quality. Sadly, the job fell short at the finish line – with the delivery. I selected the second fastest shipping option, but the book arrived well outside of that window – missing an important date (I'd planned to give this book as an anniversary gift to my wife)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mr Thomas Behr",
          "Nb_Reviews": 2,
          "Date": "2022-07-24T00:27:52.000Z",
          "Titre": "Pictures looked very clear when I had…",
          "Contenu": "Pictures looked very clear when I had them online. Look blurry when I got the book. Maybe because the pages were not glossy??  Not sure. But a decent expletive. I would use them again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bevo",
          "Nb_Reviews": 4,
          "Date": "2020-11-29T17:53:56.000Z",
          "Titre": "I love the Motif calendars, but it could be better.",
          "Contenu": "I love the Motif calendars - how you can put in your events on certain dates and pictures and the quality of the calendar. I would give it a 4 star if it wasn't so hard putting in events (the program dances around on my screen), and a 5 star if it kept the 300+ events on those dates from year to year so I didn't have to keep putting them in every year."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "HELEN DAVIES",
          "Nb_Reviews": 5,
          "Date": "2020-10-13T21:56:15.000Z",
          "Titre": "A photobook company that is compatible with my mac photo  app",
          "Contenu": "Having always used apple to create my books I was pleased to find another company which was similar . I was pleased with my first book - quality. The reason I didn’t give it 5* is that I found creating the book q difficult at times . I failed to add text to the cover as I initially wanted . However , I’ve just ordered my second book and am half way through creating my 3rd . Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sandra Braun",
          "Nb_Reviews": 3,
          "Date": "2020-10-17T16:44:01.000Z",
          "Titre": "Impressed, but not Impressed",
          "Contenu": "I order FIVE of the same book.  I love my photo book, but it turns out, I didn't like my book cover. I asked Motif if they could reprint the cover only. They said, \"NO\". But they were so generous (read with sarcasm) to offer to reprint all five books (that were perfect, except for the cover) at the same price I had paid. Not Impressed is their helpfulness.  Motif is a shop that does only one thing well."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "John Paul Hamilton",
          "Nb_Reviews": 1,
          "Date": "2020-09-20T16:48:30.000Z",
          "Titre": "3 stars because very mixed experience",
          "Contenu": "3 stars because the end printed product is good and I like that. 3 stars because the software crashed probably 30+ times during the making of a single 50 page album and that was intensely frustrating. Motif - you continue to be plagued by software bugs - what is it that you can't sort out? My sense is that your virtual monopoly on those who used to use Apple Books has made you lazy. Harsh or fair?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alice",
          "Nb_Reviews": 4,
          "Date": "2020-12-04T03:20:24.000Z",
          "Titre": "Terrible Text Function",
          "Contenu": "Adding text is a major pain. Anytime you want to add text, it opens a box on the bottom of the page, resizing all the photos on the page. Then you can move the text box, but then you have to fix the pictures. If they would enable us to add the text box where we want it initially, we wouldn’t have to go back and fix the stuff it currently messes up."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Garth Dixon",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T15:27:48.000Z",
          "Titre": "Actually I’ve had real problems…",
          "Contenu": "Actually I’ve had real problems creating anything on motif recently. I don’t know 🤷‍♂️ what the issue is, but it crashes before I can finalise the project. It might be that my OS is old, or something wrong my end but I cannot really use it in the way I’d like to and of late not at all"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T22:51:29.000Z",
          "Titre": "Photo books are great",
          "Contenu": "Photo books are great, processing and shipping was fast. Would like to be able to indicate how many pages I would like to fill with photos, instead of all my photos automatically auto-flowed into way too many pages!"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Dr. Manfred Auer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T01:38:04.000Z",
          "Titre": "great book, but a bit expensive",
          "Contenu": "great book, however, it was a little too expensive, did a similar book in Germany with a different App, was a tad worse (although still very nice...) , but that one was less than half the price....."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T19:09:14.000Z",
          "Titre": "Layout flexibility",
          "Contenu": "Good options for calendar layouts, able to manipulate a template layout to suit my needs.  Wish I could put a picture into a box that is for a day that is not in the current month for the page.   I like to add more details in a month that I didn’t put in the layout and now I only can do that in boxes for tge current month."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Ruytjens Wim",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T16:23:32.000Z",
          "Titre": "A beautiful calendar with a delay.",
          "Contenu": "We have been ordering a beautiful calendar with our photos from Motif Photos for many years.  This year we did not get our calendar delivered to our home on the supposed date.  After a week we contacted the help service.  They knew exactly where we could pick up our calendar."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Hoffmann Frederic",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T10:59:55.000Z",
          "Titre": "Usually Perfect pictures",
          "Contenu": "Usually Perfect pictures. Perfect cards.Only imperfection this year was that our cards were folded just 1/2mm away from the split between front and back pictures… such that we have a 1/2mm line above the front picture with the colors of the back picture… to be further improved next time!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beverly",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T23:55:48.000Z",
          "Titre": "As a newbie to making books",
          "Contenu": "As a newbie to making books, the site was not intuitive to me and I struggled to get the pictures into the album form and never did figure out how to add any comments.  In the end, I was mostly happy with the product and it arrived promptly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Pope",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T15:32:44.000Z",
          "Titre": "Nice but should be simpler to do.....",
          "Contenu": "I like to use Motif because of the interaction with Photos on my computer. I only make the calendar once a year. I don't feel as if the page layouts and photo placement is as easy as it once used to be. The process should be much simpler."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Brown",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T18:58:31.000Z",
          "Titre": "Nice book",
          "Contenu": "The automatic organization of the photos is great and saves a lot of effort.  However, I found it a little too difficult to shift photos around and to create new pages to fine tune the book. Also, several of the photos had sections cut off in the final book. (I don’t think they were like that when I was creating the book.). Also, text blocks were difficult to manipulate so one eventually gets tired of getting it just right, and you don’t. Having said that, I mostly loved the final product, especially the front and back covers and dust jacket flaps."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:41:54.000Z",
          "Titre": "Eerything is beautiful",
          "Contenu": "Eerything is beautiful, but the only thing is that I would like to order more books on the same order, so I could pay shipment only once."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Maree",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T04:09:40.000Z",
          "Titre": "Good Quality",
          "Contenu": "A reasonably easy site to navigate with a good variety of page arrangements. I discovered how to customise it towards the end of my project. My calendar arrived today and it is bound well with good quality prints. My only suggestion would be on packaging. The calendar box has been squished in transit and the calender is a little bent. Maybe more robust packaging or a sticker that says 'Please do not bend' would stop this from happening.  All in all, I recommend Motif."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank B.",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T05:33:37.000Z",
          "Titre": "Annual family photo calendar came out…",
          "Contenu": "Annual family photo calendar came out very well.  Takes a while to assemble, but very good quality.  Would have rated a 5 *, but think a bit expensive."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Felicia L.",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T05:44:10.000Z",
          "Titre": "Great service with fast shipping",
          "Contenu": "Easy to select project type (in my case a 2024 calendar), edit copy, adjust how many photos I want to share per page. Easy checkout and fast shipping. I use the app which makes accessing photos easier. My only annoyance is downloading the photos and having to scroll through them even though I can filter by ‘unused’, etc.?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GeoffW",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T23:36:02.000Z",
          "Titre": "Great product albeit with higher prices",
          "Contenu": "Great product with easy to use website, only downside vs. the past is significant price increase after combining with Mimeo."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cliff N",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T16:40:11.000Z",
          "Titre": "The quality of the printed material is excellent.",
          "Contenu": "The App itself is relatively easy to use, after one project it is a routine process to create another. If one creates something only annually, one should get familiar again with the processes before proceeding. The order and delivery process works well and the books, etc. arrive in protected packaging. I hope this app will be enhanced to add need new features. Quality excellent."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cindy",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:26:08.000Z",
          "Titre": "Easy to use, but need portrait format book",
          "Contenu": "It's an Easy to use program. I would have given a 5 star if there was a book in a portrait format. Because most of my pictures were taken in portrait, it was very difficult to fit the number of pictures in a landscape page."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "toby",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T20:06:13.000Z",
          "Titre": "Great quality and quick service",
          "Contenu": "Great quality, fab memories of a holiday Just wishing the cost of postage didn’t put me off using this site more often"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T21:33:35.000Z",
          "Titre": "The books are beautiful but I ordered 3…",
          "Contenu": "The books are beautiful but I ordered 3 and only received 2. I have contacted you several times. Initially you said I received them all but I didn’t. I think you are now preparing the 3rd but I’m not impressed with you  not knowing I’m missing one. I hope it comes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T18:57:47.000Z",
          "Titre": "Excellent support team",
          "Contenu": "I might never have finished this project were it not for the excellent customer care I received from your team. They followed up and reached out until I got the kinks worked out. The only issue I’ve found is that the pages are wavy, as if affected by humidity. I’m hoping this works itself out now that it is in my home."
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Eva Christine Bjerreskov",
          "Nb_Reviews": 18,
          "Date": "2023-12-12T07:00:51.000Z",
          "Titre": "Easy to use",
          "Contenu": "The Motif system is very easy to use. My only criticism is the limited size/format options."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:18:11.000Z",
          "Titre": "Nice easy program to create photo books!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn Hyssop",
          "Nb_Reviews": 4,
          "Date": "2023-11-22T23:45:27.000Z",
          "Titre": "Great App, but, please improve shipping",
          "Contenu": "I have been making photo projects with Motif for a few years now. The template is easy to navigate. There have been some positive changes. I do find the shipping charges to be incredibly expensive. Parcel post used to be an option. Please bring back. Also I would like to be able to put more projects in one cart save shipping and packaging helps the earth."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T14:48:21.000Z",
          "Titre": "Photos were very good.",
          "Contenu": "Photos were very good.The focus problems were my fault.I wouldn't recomend UPS - they just leave a note and tell you to pick it up yourself saying you were not in. We were in all day!"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:24:34.000Z",
          "Titre": "The delivery was faster than expected…",
          "Contenu": "The delivery was faster than expected and the book is in great quality."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T13:34:44.000Z",
          "Titre": "Photo book quite okay 😊 But",
          "Contenu": "Photo book quite okay 😊But I miss the correct spelling when writing e.g. in French or Italian or German from a qwerty keyboard (like the è, é, ê, ä, etc) when using text boxes in a project. Unfortunately this affects the overall quality☹️"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Anita",
          "Nb_Reviews": 13,
          "Date": "2023-12-04T19:59:34.000Z",
          "Titre": "Brilliant calendar",
          "Contenu": "Brilliant calendar, very easy to make, fantastic quality and speedy delivery. A bit expensive but I’m very happy with it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NO",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:39:04.000Z",
          "Titre": "No Title",
          "Contenu": "I Would give joy 5 stars but shipping was way too expensive.  $6.00 the year before and now over $20.  Find a way to go back to $6 or I need to find a cheaper calendar.  I love everything else from the app, to how the calendar looks.  The shipping cost is a deal breaker!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Balyeat Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T05:59:06.000Z",
          "Titre": "Easy but limited creativity …",
          "Contenu": "The process of making a photo book was quick and easy. However, it would have been nice to have stickers and add-ons to personalize it and add more character to the pages."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Pierre Bleret",
          "Nb_Reviews": 3,
          "Date": "2023-11-07T13:02:40.000Z",
          "Titre": "Birthday card",
          "Contenu": "It's the fifth time I use the product for birthday cards and have always enjoyed creating the cards, receiving and seeing the printed results ; this is the constructive part of my message.The less constructive part is that this time the card has been delivered in three steps by an unreliable shipping Cie. Mimeo needs to take care of that last part of the process and make sure this doesn't become the downside of a project."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kip B",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T16:38:35.000Z",
          "Titre": "Quality product",
          "Contenu": "Quality product. Loved by those who received it. Just wish there was a little more flexibility in design and layout. I used to use Aperture (application was discontinued) to make my photo books and could really do some designing."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T03:48:50.000Z",
          "Titre": "Pleased with the final product but…",
          "Contenu": "Pleased with the final product but thought the cost of shipping was a bit steep!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:21:12.000Z",
          "Titre": "Good but expensive",
          "Contenu": "The process is very simple which I appreciated on a short timeframe. However, the price is high and I will look for cheaper alternatives next time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phillip",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T18:52:22.000Z",
          "Titre": "Excellent rendition",
          "Contenu": "Beautiful execution of the calendar design, with accurate color rendition and nice resolution.  Fast and efficient production and delivery.  Only wish a few different sizes of calendars were offered."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Theodora Savini",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T05:54:13.000Z",
          "Titre": "I think the photobook could have been…",
          "Contenu": "I think the photobook could have been enhanced by being able to add a different layout of photos.Perhaps photos on an angle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valerie L",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:42:30.000Z",
          "Titre": "It was really easy to import photos and…",
          "Contenu": "It was really easy to import photos and work with them, moving them around.  I like the way you offer different page formats, with previews.I thought the auto-placement would place the photos chronologically, but it did not.  That would be a nice feature, if it can read the metadata/dates of the photos.Bottom line:  My mother-in-law loved her photo book!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ian Cordwell",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T04:31:29.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Clear instructions. I like the alternative layout suggestions for each page.On the downside - quite expensive compared to other choices available on the market."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 11,
          "Date": "2023-10-26T23:19:40.000Z",
          "Titre": "Great design tool, hoping for softcover option to return",
          "Contenu": "Love the Motif app for designing my photo books. Have made about 100 over the years. Lots of flexibility and ease of placement. I like to manually place and write my travel texts so highly personalized. My only complaint is that they stopped offering the 8.5\" x 11\" in softcover. It was available for many years and discontinued it since Jan 2023. Wish they would bring it back. PLEASE!!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Wilhelmina Looyen",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T22:59:24.000Z",
          "Titre": "I choose Motif because I can create a…photo book from my iPad",
          "Contenu": "I choose Motif because I can create a photo book from my iPad. That is great. But it is a pity that I cannot put a one line text underneath a photo, without shrinking the picture or changing the layout, because I can only choose from the text boxes that are given, which changes the layout that I had chosen."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Bo",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:20:22.000Z",
          "Titre": "The album keep a high quality and the…",
          "Contenu": "The album keep a high quality and the images is high quality if your photos are optimized. Maybe I wish some deeper black point, but if I know what I get, I can adjust it before publishing. If you want to create an album with a lot of text, it could be a good idea to get a layout more customized to that purpose. But this is really not a big deal."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T18:59:57.000Z",
          "Titre": "Very happy",
          "Contenu": "A wonderful surprise when we got our album in the post. Good quality pictures and totally as expected. Appreciated the quick response to questions as well."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Adelheid Wuggenig",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T18:46:55.000Z",
          "Titre": "Using Motif is the best way to creat a great foto album",
          "Contenu": "I managed to creat a beautyful foto album because Motif has got a very good technology   to do this in the best way.And your help-line gave me advices to do something easyer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T23:53:09.000Z",
          "Titre": "Custom Calendar Design",
          "Contenu": "Motif custom design for calendars is intuitive and easy to revise. I do not understand the algorithm used to determine that a photo is tagged as low quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve LeFevre",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T23:34:49.000Z",
          "Titre": "The end product turned out nicely",
          "Contenu": "The end product turned out nicely. The process of creating the book was painful at times, though"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marjie",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T19:34:55.000Z",
          "Titre": "The booklet is great",
          "Contenu": "The booklet is great.  Theonly thing that was wrong was my fault in not noticing I used the same picture twice.  Other than that, I love the booklet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol ann Benson",
          "Nb_Reviews": 4,
          "Date": "2023-10-12T05:44:09.000Z",
          "Titre": "I love my projects",
          "Contenu": "I love my projects, but the way they go together is always changing.  It is very hard to figure out how to manipulate the photos to where I want or to add wording.  There is so much more that I want to do, but don’t know how."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gord",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T12:36:04.000Z",
          "Titre": "Good options for size and layout",
          "Contenu": "Good options for size and layout.  It is quite user-friendly providing access to photo options.  I've done 5 books now with different sizes and formats.  Terrific shipping time."
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Natalka Kolody",
          "Nb_Reviews": 5,
          "Date": "2023-11-08T15:02:45.000Z",
          "Titre": "42 books and creating more ...",
          "Contenu": "Photobook as usual executed to perfection! Only the extern removable cover was printed off center. A little failure but very visible among my 42 other books!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kris Carmichael",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T13:13:54.000Z",
          "Titre": "I like the app because it’s easy to…",
          "Contenu": "I like the app because it’s easy to move pictures and pages around to create the story you’re making with your book.  BUT… the pictures don’t have borders around them to make it look attractive and you can’t put text under individual pictures.  When Apple had their own book app, it was much better."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Adrian Marsh",
          "Nb_Reviews": 22,
          "Date": "2023-07-21T20:12:22.000Z",
          "Titre": "Excellent product but appalling delivery service",
          "Contenu": "Excellent product - hence the 4 star review. However, delivery experience was very poor. In spite of the expensive delivery charge, UPS dropped off the book at a collection centre 7 miles from my home rather than delivering to my address. Mimeo have not replied to my complaint. Customer Services need a huge improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeannie Janssen",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T16:42:14.000Z",
          "Titre": "Long Time Motif User",
          "Contenu": "This was my 25 th photo book made and 12 th year. It is a fun but laborious creative outlet for me. I’ve used Motif most of this time since Apple photo books was discontinued. I love the product produced  by Motif. Perhaps Apple was a little better quality and gloss paper, I don’t remember. Overall, motif is a very easy software to use. I do have a wish list for suggested changes:  In addition to the color wheel, I wish there were a color chart option with multiple fixed colors, similar in size to e-card softwares. Choosing a custom color is tedious. I do appreciate that once chosen, they are saved.   I wish font could be personally chosen  and fixed ahead of the project.   I wish that text boxes could be placed after page is set up without changing the picture placement   I wish the thumbnail pix being used, shown under the book were bigger, could remain arranged in order of  my placement, and ‘used’ could be collected in another, separate file- not just checked  and in ‘all photos’.   Lastly, I wish there were stickers and decorations that could be added. Meanwhile, I’m very happy with the Motif photo book soft ware. I will continue to use it in future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T22:37:07.000Z",
          "Titre": "More choice for text boxes",
          "Contenu": "I’m an experienced user of Mimeo and Motif is similar in many ways. The book has vibrant colors, the photos are crisp and clean. I was disappointed that the text boxes are not as easy to move as on Mimeo. For instance, on Mimeo, I can choose a small text box to place on a photo, but this feature isn’t available on Motif. Otherwise, it’s a great system which helps me produce excellent photo books!"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Sjoukje Oosterhof",
          "Nb_Reviews": 3,
          "Date": "2023-08-07T18:03:39.000Z",
          "Titre": "High postal costs",
          "Contenu": "The photo albums, which I make with Motif are always of a high quality, so I do enjoy them very much. However the last one, made in July, I was charged a postal fee of Euro 30, almost half of the production costs. I now consider seriously to stop with their services."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Antonietta",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T14:56:09.000Z",
          "Titre": "Not A Technical Person",
          "Contenu": "I am not a technical person, so I had some difficulty using your product. I had trouble getting text on the correct pages to correspond to the pictures. My daughter (who is technically minded) helped me achieve the product I wanted. When I received our book, it was beautiful and so worth the effort. I do plan on using your product to organize my future holiday photos. Hopefully, I will be better at organizing the pictures and text."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2023-07-21T23:09:28.000Z",
          "Titre": "Hard Work yields a Good Outcome",
          "Contenu": "There are several quirks that make creating the book difficult. For one, there should be a way to select the font you want and it will stay selected. There should be more flexibility in writing captions and in sizing the photos. Once you get through the process, the result is very satisfactory."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T02:32:12.000Z",
          "Titre": "Responsible Company",
          "Contenu": "The quality of the printing and paper was excellent. Colors were pretty true. Sadly my first copy arrived damaged. Motif made it right by shipping me a new copy in better packaging that arrived in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "adrienne J",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T20:54:38.000Z",
          "Titre": "Quite good result.",
          "Contenu": "Quite good result.. knowing that some of the pictures were old pictures that had been copied… so very nice result But unfortunately it was quite ruined because the shipping was so long.. without any explanation.. ! And it arrived much to late for a birthday present. And it was impossible to know before ordering how much delay it would take… so good result but much too late so very disappointing for that only reason…"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-11-07T20:41:09.000Z",
          "Titre": "Reliable",
          "Contenu": "Reliable, fast turn around. Photos are a little darker than on a computer screen so good to adjust for that."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Susanna",
          "Nb_Reviews": 15,
          "Date": "2023-07-16T15:21:54.000Z",
          "Titre": "Putting material in is quite fiddly",
          "Contenu": "Putting material in is quite fiddly; compiling a book is a long process. Result is good, but the whole process could be easier. More specifically, having chosen one style of book it would be nice to see the same layout in a different style without losing the original and/or having to enter all the material again."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T11:07:16.000Z",
          "Titre": "my first photobook with this company",
          "Contenu": "my first photobook with this company. Quickly done, and it was good enough for my purpose. A bit on the expensive side, but there are not many fotobook software that allow movement of a single page, not just a double page - which is important in my creation process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T21:07:52.000Z",
          "Titre": "Easy with iPhoto",
          "Contenu": "The editing tools available are not as robust as some other photo book vendors, but there were many page options open to me.  It was rather clunky, as I had to go back and resize my photo and then upload it again to properly resize.  The pages were flimsy compared to other photo books I have created."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geri",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T03:20:03.000Z",
          "Titre": "I find the experience of making a book…",
          "Contenu": "I find the experience of making a book with Motif spotty. Uploading a group of photos from my Mac is easy and convenient. The photo templates are pretty good. I have trouble with the text boxes, getting them to stay in the place I put them. Plus I'll set up the font, size, boldness the way I want it and then it will change. It's unfortunate that you got rid of the 8.5 x 11\" book as my art fit better in that format. The 8 x 8\" was more difficult to format. That said, the books look good, the paper is nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T12:42:40.000Z",
          "Titre": "I love my souvenir book",
          "Contenu": "I love my souvenir book. My issues were technical, and may have been due to my IPad.  Downloading pictures was complicated, four of us had a shared album, but I could not access it.  My sister was hoping to edit from her computer, but we could not figure out how to do that.  I loved that my original group of pics populated the format, it was easy to see the end result and make adjustments.  We labored over this project and it was satisfying to feel creative.  We are proud and pleased to have recorded our travels in a special way.  (This was our 2nd book, and a great improvement over our first one.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd Helming",
          "Nb_Reviews": 3,
          "Date": "2023-06-03T01:34:01.000Z",
          "Titre": "We created a photobook of a trip",
          "Contenu": "We created a photobook of a trip.  Ease of using the app (we created in in iPhoto), 5/5.  Quality of printed materials, 5/5.  The only concern was that photos against the binding had a bit of an area that was lost in the binding.  For example, in one family photo, the person standing on the right has part of their face hidden in the binding.It would be nice to know the \"safety\" zone for photos as we place and zoom them so this doesn't happen!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana",
          "Nb_Reviews": 8,
          "Date": "2022-10-30T18:09:44.000Z",
          "Titre": "REPEAT CLIENT!",
          "Contenu": "I have used your publishing service several times the last few years.  Most of what I do is done with s cell phone photos sent by family, not my own more pro gear.  I, r therefore like the earrings given regarding resolution and size of photos.  Allows me to replace or reconsider placement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T21:14:21.000Z",
          "Titre": "End product was beautiful",
          "Contenu": "End product was beautiful. Photo quality was great. Cost was higher than other similar products and discount coupons didn't work."
        },
        {
          "Note": 4,
          "Lieu": "AT",
          "Pseudo": "Edith M., Austria",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T14:56:40.000Z",
          "Titre": "You did it BEST",
          "Contenu": "You did it BEST, but there are wishes for further comfort! The quality of the fotobook was excellent and I got the present rapidly, just in time for birthday present! Thank you so much! I had problems with adding further fotos to the working-album and I would like to have a tool to get the same format on the left and the right side. I did not save the last version of the fotobook on my handy!! Could better express my troubles in german, sorry for my poor English."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T19:44:50.000Z",
          "Titre": "Easier to use the layout process than…",
          "Contenu": "Easier to use the layout process than in previous years. Wellprinted and presented ( in slip case)  price reasonable but the shock was the cost of postage ( almost the same as the 20 page hardback book )"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Maire O'Callaghan",
          "Nb_Reviews": 6,
          "Date": "2023-05-19T02:07:24.000Z",
          "Titre": "A great way to store treasured memories",
          "Contenu": "The photo book is high quality which enhances the photographs. Service was excellent. The reason for the fours stars is I found it limited such as not being able to customize text colours to photos, and editing text boxes as they were hard to select. The effort was worth it, the book is perfect."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Julie ward",
          "Nb_Reviews": 15,
          "Date": "2023-05-05T23:51:14.000Z",
          "Titre": "Lovely Book bit fiddly at times",
          "Contenu": "I do love my finished book but it did take me a lot of time. I think the most frustrating thing was having created lots of text boxes and writing in them. It all looks fine when you are creating the book but as soon as I went to get it printed there was an error message saying text was outside the boundary. So I then had to set to and change it all. I did have a couple of other problems but Motif team are brilliant at answering emails quickly to help."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T13:05:35.000Z",
          "Titre": "The quality of the calendar was good",
          "Contenu": "The quality of the calendar was good, but the delivery service was not.The delivery was delayed, moreover, the deliveryman threw the box over the fence. If it had rained, our calendar would have been unusable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Norman",
          "Nb_Reviews": 4,
          "Date": "2023-06-18T03:15:52.000Z",
          "Titre": "Photo reproduction quality was great",
          "Contenu": "Photo reproduction quality was great. Paper , end sheets, cover material were excellent. Still difficult to move text boxes. All photos on page need to be resized after moving a text box"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Cramer",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T20:29:21.000Z",
          "Titre": "Practice makes perfect!",
          "Contenu": "My first try with making a photo book using Motif was a little confusing but future efforts were far easier. The final product each time has been excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julia Snyder",
          "Nb_Reviews": 4,
          "Date": "2023-06-08T22:42:00.000Z",
          "Titre": "Great Quality! Worth the Price! (and.....)",
          "Contenu": "I love how the two books I ordered turned out. The quality of the printing is exceptional.  My pictures look even more amazing, than the real thing!  Yet, the computer program was a bit stubborn-- namely when it came to placing the pictures and the text.  I sense you have programming work to do to make this experience more friendly.  (versus tricky and frustrating)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Ashburn",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T18:49:41.000Z",
          "Titre": "It is the results when receiving the…",
          "Contenu": "It is the results when receiving the book that make it great. The only dislike with Motif is the interface when placing pictures. It is not easy to resize pictures. I crop pictures in Lightroom, but not to standard ratios, so when I bring them into Motif I may have to resize them. Not easy. I wish Motif had the same interface as the now defunct Apple Aperture. That interface was much easier to place picture."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Reynolds",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T13:56:07.000Z",
          "Titre": "You want suggestions for improvement so…",
          "Contenu": "You want suggestions for improvement so here goes!It all went well until I was finished! It's a real pain to have to put my name, billing address, AND Visa information on EACH individual calendar order. Why not arrange it so there's only one time I must put this information for ALL 5 of the calendars I ordered? This would speed up the process on my end and make it easier."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T02:18:49.000Z",
          "Titre": "Ordering Calendar & Quality",
          "Contenu": "The calendar was easy to order. We like the product but I feel that the quality of the paper isn't as good as my prior calendars. I think the thickness is a bit thinner (compared to a company I used overseas). Overall, I would still order from you again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ParCar",
          "Nb_Reviews": 2,
          "Date": "2022-10-22T18:54:38.000Z",
          "Titre": "IPhoto's book creator was better, but no longer available.",
          "Contenu": "I had trouble initially navigating and uploading additional photos. The page choices is also confusing and many of the configuration choices are not good (ie. the super think rectangles wouldn't work for anything!) Lastly, your pricing is quite high. IPhoto was easier and cheaper."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "doppel ganger",
          "Nb_Reviews": 21,
          "Date": "2022-11-27T15:14:07.000Z",
          "Titre": "Mostly excellent",
          "Contenu": "Generally it's very good and certainly the best I have found. It integrates reasonably well with Photos. My biggest issue with it is the payment system. It doesn't integrate with Apple's OS and always rejects my personal banking card - the only site to do this."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Brigitte van Kan",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T19:09:05.000Z",
          "Titre": "no longer very big size album",
          "Contenu": "The book I received was very well printed but I was a little bit disappointed that it was the biggest size.My others album were bigger and larger.And also, this time I wanted to have a \"soft\" cover and not a hard cover. Just a question : Is it still possible to have a bigger size ???"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Robinson",
          "Nb_Reviews": 6,
          "Date": "2022-11-14T15:26:41.000Z",
          "Titre": "Great product",
          "Contenu": "Great product, easy to use.  Very helpful photo editing and quality alerts enabling you get the best out of your photos.  Clear cost illustration as you progress.  A very reasonable turn around for the book's delivery.  The book is very well made and should last.A needed improvement is the choice of fixed photo page options."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T22:47:25.000Z",
          "Titre": "Updated Review.",
          "Contenu": "Some weeks ago I wrote a damning Trustpilot review on Motif having received one album with a misprinted photo and then a second with half the pages blank. After trying to deal with the first line of customer service , an AI robot, I was extremely frustrated with the support I was given.Happily my review was picked up by Michele H, on the customer service team at Motif, who made direct contact. She proved to be outstanding; every response was immediate and helpful and she didn't give up until, after several days and many emails and interventions by her, I received five copies of the album. Each is now well printed and very faithfully reproduced. Entirely thanks to Michele I will use Motif again and my only advice, if you do have a genuine issue, is - Be patient , there is a real support team there and they will sort you out!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Russell",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T01:09:44.000Z",
          "Titre": "The work output looks beautiful",
          "Contenu": "The work output looks beautiful. The delivery was timely. The software works well with Photos on my MacBook Pro.The only negative is the price. I'd print more books if they were cheaper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alice Settle",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T18:01:45.000Z",
          "Titre": "I liked the quality of the printing.",
          "Contenu": "I liked the quality of the printed book. However while I was putting it together I had difficulty making correction to text. In fact using text at all was very hard. Being able to set my own styles for the whole book would help."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mark Isaac",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T08:00:41.000Z",
          "Titre": "Seamless integration with apple photos…",
          "Contenu": "Seamless integration with apple photos but not quite as customisable as the old product retired by apple where you could do more with bindings and covers to personalise books for that extra special touch. Packaging and presentation were spot on just like apple fulfilled in the past."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M.Zitin",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T22:50:37.000Z",
          "Titre": "Extremely happy with Motif",
          "Contenu": "It's very seamless to use Motif when working from an Apple Photo Library. It's a pleasure to be able to navigate back and forth from your project to your library, in order to further edit an image, or to add more photos to those already selected for the project (without having to deal with an outside web-based photo service where it's a 'production' each time you want to upload more images). Also, when I had one question about working on my project, I received prompt and thoughtful replies that were very helpful. The final product was wonderful, with excellent resolution and color in the photos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EmCubed",
          "Nb_Reviews": 4,
          "Date": "2023-05-15T15:13:23.000Z",
          "Titre": "The process was easy and quality was…",
          "Contenu": "The process was easy and quality was fine, but beware of how teeny-tiny these books are. I was so disappointed on the insignificance of what arrived. Pay more and get the larger size with hardcover."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dianne",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T02:27:55.000Z",
          "Titre": "I was very happy with the photo book",
          "Contenu": "I was very happy with the photo book.  It was reasonably easy to follow the process and make the book.  One thing I had an issue with was I could not figure out how to remove a placed picture without deleting it completely from the book.  I also could not figure out how to rotate a placed picture.  Other than that I was very happy.  Book arrived within a reasonable time and arrived in good condition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T21:46:22.000Z",
          "Titre": "My thoughts",
          "Contenu": "The program was easy to use, results were good.  Even though some of the picture qualities were not up to your standards, they did turn out fine.  My only complaint would be that I would have liked options where the photos were not all lined up in rows."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Judith Adam",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T19:12:46.000Z",
          "Titre": "Beautiful books",
          "Contenu": "I love the end result. The books are high quality paper, binding and photos. But using the app can be annoying and very slow. There’s still a lot of bugs to work out in the word boxes. The app freezes a lot. So you must check your work for mistakes. But the results are wonderful."
        },
        {
          "Note": 4,
          "Lieu": "GT",
          "Pseudo": "jo",
          "Nb_Reviews": 13,
          "Date": "2022-10-23T09:00:02.000Z",
          "Titre": "Easy to use interface, good result.",
          "Contenu": "Easy to use interface to make my calendar. The image editing function worked well and the final printed result was an accurate reflection of what was on the screen. Good colours.Compiling the calendar was more cumbersome and I would welcome greater flexibility to move image pages forwards and back through the months as, for a novice user, planning this in advance is difficult.Really pleased with the final result."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T20:00:11.000Z",
          "Titre": "Customer Service was good",
          "Contenu": "Customer Service was good. Software is still easy to use. I will probably use it again but to me its obvious that the quality of the prints went down over the years. I designed my sixth book now but have the feeling the standard went down a bit"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "jeannine Van Hool",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T18:06:41.000Z",
          "Titre": "The quality of printing!",
          "Contenu": "The quality of printing!But I expected as before a promotion for the next book... the last books I didn't receive it since Mimeo photos make the prints..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claire",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T00:17:10.000Z",
          "Titre": "Quality of product is excellent.  Customer service not responsive.",
          "Contenu": "I’m very happy with the quality of the book I created.  I took offa star because I could not get the coupon code I was provided to work and the two tickets I submitted were ignored.  Also, some of the features don’t work right on an IPad (such as squeezing a photo to shrink the image).  Also, it would be nice if I could include multiple projects in the same order."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul B",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T08:22:12.000Z",
          "Titre": "Good product and great service",
          "Contenu": "Very pleased with the photo book commemorating a charity walk. App was pretty easy to use and the finished product is great quality. Good communications from the company on order progress ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bobby Clay",
          "Nb_Reviews": 3,
          "Date": "2023-06-17T19:22:04.000Z",
          "Titre": "Cook Book",
          "Contenu": "I have put together many books in Motif and very pleased with the quality of the results. My last big project was a family cookbook. It has taken many hours of tedious work to type in the recipes, stories, and cut lines.  The table of contents with all the spacing was a real bear!!  At times the times the text software was on its knees, so slow it would take forever to type in one word.  I re-booted my computer many times to get through the text box. I might add that my Mac Pro is very powerful and runs the latest operating software.It is great for picture books but can hardly handle large volumes of text. The book turned out great--lots of work!!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "MCS",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T03:25:46.000Z",
          "Titre": "The 2 photo books are awesome",
          "Contenu": "The 2 photo books are awesome. The speed from ordering to delivery was amazing…less than a week. The second book was four days from placing the order to deliveryI found the program itself was quite frustrating. It is difficult to work with the layout format. Mainly with trying to change the parameters of an image within a box. The yellow handles are so frustrating to work with.Another photo program I use is much more user friendly. I will use motif again because of delivery speed but I will use the rival program for its ease of use. My wish would be a program that is as easy to use as powerpoint is.Customer service was fantastic. It was a quick response and very helpful.Note: I did two orders: Oct 30/22 and Nov 7/22."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Fabrizio",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T00:16:45.000Z",
          "Titre": "Great printing service",
          "Contenu": "Great printing service. Well integrated with the Photos app for macOS.Some room for improvement in the composition phase (deleting photos, highlighting photos added from the library to the project).I had a delay in delivery but nothing serious."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Michel",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T11:53:28.000Z",
          "Titre": "Everything was ok",
          "Contenu": "Everything was ok, even if former iPhoto album feature was easier to use in my opinion.One of the features I mostly miss with Motif if the ability to have a single photo printed (ie. a pano) on a double-page."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T14:23:31.000Z",
          "Titre": "It's a great photo book that looks very…",
          "Contenu": "It's a great photo book that looks very professional. When creating the photo book, it would be great if you had justification available."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "evie",
          "Nb_Reviews": 6,
          "Date": "2023-05-29T16:44:00.000Z",
          "Titre": "The clarity of the pictures and the…",
          "Contenu": "The clarity of the pictures and the colors were great.  When making the book some of the text boxes became a little hard to move or resize and I wasn't quite sure on how the margins of the pictures would be in the layout. All in all I was pleased with the end product.  I will be a little better informed with the next one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 5,
          "Date": "2023-06-13T02:22:21.000Z",
          "Titre": "While I miss the old version of Apple…",
          "Contenu": "While I miss the old version of Apple photos where I could create a book directly in the app, this is a good alternative. Easy to use and had what I needed at a reasonable price. Shipping was quick as well."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Graham Samuel",
          "Nb_Reviews": 29,
          "Date": "2023-12-21T20:57:56.000Z",
          "Titre": "I made a calendar. Easy to construct - excellent result",
          "Contenu": "I make a family calendar every year based on Apple Photos. Since Apple stopped providing a printing service I've been using Motif, and I am very happy with the result in terms of quality and ease of production. The software does pretty much everything I need it to do, and the uploading and subsequent delivery is really quick and easy. I hope to continue using Motif for the foreseeable future."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T08:58:22.000Z",
          "Titre": "Just awesome",
          "Contenu": "The app could be a bit better with some bug fixes but overall is was simple, user friendly, great designs and just fun to work on.I was nervous about the quality of the pictures in the printed album because they were mostly taken on an iPhone but OMG they are stunning. Would 100% recommend using motif and I will definitely use it again for future albums."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:08:14.000Z",
          "Titre": "Great Calendars",
          "Contenu": "I have used Motif for several years to create calendars for the next year and have found everything from start to delivery to be excellent. Placing multiple pictures on each month's page and rearranging them is easy. I have also created books from travel memories and have been very pleased with them as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T01:58:51.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you, Motif!  My original order for my Photo Book strangely had a production flaw in it.  One message to Motif and they quickly and clearly communicated their apology and desire to correct the problem.  The result within a few days was the shipment of a replacement Photo Book that was in perfect condition at no additional cost.  Quality and Service were superior!  Thank you, Motif."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Alison",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T20:52:26.000Z",
          "Titre": "Very happy with my photo book",
          "Contenu": "Really happy with the soft cover landscape book I had made. Good quality printing, the photos turned out well, nicely bound. However I thought the postage was excessive for the small book it was. Would like to see the postage pricing scaled according to the size of the parcel."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T19:21:37.000Z",
          "Titre": "Easy and fun",
          "Contenu": "I enjoyed making a 4 x 6\" season's greetings card to send to my friends.  It was easy in Apple Photos and then using the Motif project with flexible templates.  The order arrived in a nice neat package several days before the estimated arrival, allowing me to get them to the post office in time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Carhart",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T00:08:22.000Z",
          "Titre": "My photo book is perfect",
          "Contenu": "My photo book is perfect!  The most difficult task for me was logging into your new mimeophoto apt...because the Motif app would not \"let me in,\"...your rep wa VERY PATIENT and spent several hours guiding me in setting up a new passwords. Now I'm all set!! THANKS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T02:07:25.000Z",
          "Titre": "The calendar turned out great",
          "Contenu": "The calendar turned out great. Furthermore, when UPS delivered the package to the wrong address, MOTIF redid the order and had it delivered correctly by FED-EX. Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SoozieQ",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T22:28:42.000Z",
          "Titre": "Yearly Family Calendar",
          "Contenu": "Our yearly family calendar turned out great.  We received the calendars within a week of ordering.  Each of our kids gets one & they love seeing who made the cover photo each year.  This is a great way to preserve family memories and list all family members’ birthdays & anniversaries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOAN",
          "Nb_Reviews": 3,
          "Date": "2023-12-22T01:00:04.000Z",
          "Titre": "The gift of good times",
          "Contenu": "the site is easy to navigate and create in.  Improved over last year. I love sending the calendars as they are so appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Knox",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:03:33.000Z",
          "Titre": "Best self produced photo book ever",
          "Contenu": "I custom added photos to a theme provided by Motif.  The book came and was better than I had envisioned.  It was so simple to create while also being fun.  Can’t wait to share them with my family.  I bought 3 copies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Flashman",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:28:58.000Z",
          "Titre": "Good service and product",
          "Contenu": "Motif/Mimeo reprinted my book for free because the initial copy had some defects. So, great customer service and great quality product."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alan Adams",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:24:27.000Z",
          "Titre": "Simple to use and outstanding product",
          "Contenu": "Very simple to use and the results are amazing. Very happy with the finished product and looks very professional. Will be giving the hardback book as a present and I know the recipient will be as delighted as I was. Thoroughly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:05:34.000Z",
          "Titre": "This was my 13th year to make a family…",
          "Contenu": "This was my 13th year to make a family book for Christmas gifts. My family loves them...It has gotten so much easier over the years. I do wish there were more layout options. Mimeo did a good job with the picture quality. I did order the wrong book,(I like the original one) but customer service was very helpful in changing it and also with my refund.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mrs C D",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T20:17:09.000Z",
          "Titre": "Great Calendar - admired by all the family",
          "Contenu": "I make a calendar for my mother every year (she’s now 94), with photos of the past year contributed by all her children, grandchildren and great grandchildren - a present she looks forward to with great expectation!This years is, as ever of great quality and I look forward to giving it to her on Christmas Day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Sullivan",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T19:49:32.000Z",
          "Titre": "Great online creation site",
          "Contenu": "Great online creation site. The experience was very good, and the product was delivered in very short order."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Neil W",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T16:18:46.000Z",
          "Titre": "Great integration with Apple Photos…",
          "Contenu": "Great integration with Apple Photos app.  Really easy to set up a template and plenty of options available."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:21:15.000Z",
          "Titre": "Perfect!!!",
          "Contenu": "Came out better than I expected and the photos they said were low on light came out perfect. I’ll buy again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T16:22:35.000Z",
          "Titre": "Great app!",
          "Contenu": "The process of putting together my calendar was very easy and quick. I really like the layout of the app."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Carolyn Mumby",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T01:13:06.000Z",
          "Titre": "Great quality",
          "Contenu": "Quick turnaround in order.  Beautiful book - all pictures had great finish this year 😊🙏🏼"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:09:30.000Z",
          "Titre": "Motif was very easy to use",
          "Contenu": "Motif was very easy to use. I created my book on a MacBook Air and it was very intuitive. The book came and the quality rivals the old Apple photo books. I’m very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sally",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:18:45.000Z",
          "Titre": "Good service",
          "Contenu": "I love the quick service. Especially nice around the Holidays. Calendars are made with sturdy stock and look professional."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sarah Jones",
          "Nb_Reviews": 15,
          "Date": "2023-12-12T15:29:53.000Z",
          "Titre": "Excellent",
          "Contenu": "I've used Motif for years. The quality is excellent and the lead times are very good. I had a problem with the website ordering recently where a discount was not applied, and having supplied proof of the issue, they resolved it within a matter of hours. Superb."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "StevenGcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:25:54.000Z",
          "Titre": "Photo books made easy",
          "Contenu": "Easy to use and easy to upload pictures. Different formats, for each page allows flexibility."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerry DeKock",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T21:45:35.000Z",
          "Titre": "Pleased with photo quality",
          "Contenu": "I was pleasantly surprised at the quality of the photos which were very old and exposure not very good.  We have a lovely memory book of my husband's childhood pictures."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T04:42:05.000Z",
          "Titre": "Everything came out exactly right and I…",
          "Contenu": "Everything came out exactly right and I plan to use Motif again next year to create another calendar!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Michelle",
          "Nb_Reviews": 11,
          "Date": "2023-12-13T19:06:12.000Z",
          "Titre": "The quality of these photo books are…",
          "Contenu": "The quality of these photo books are excellent. The software is easy to use and the delivery is fast.I do wish they weren’t so expensive though. It’s hard to justify paying so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 4,
          "Date": "2023-12-18T17:01:22.000Z",
          "Titre": "I made ten calendars and have done this…",
          "Contenu": "I made ten calendars and have done this for many years. This is the third company through Apple. I needed someone to help me get started but, once I completed the first one, I was fine on my own"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Eileen Brannigan",
          "Nb_Reviews": 20,
          "Date": "2023-12-08T17:49:51.000Z",
          "Titre": "The quality of Motif finished product is really excellent.",
          "Contenu": "I compiled 2 different calendars and a photobook.  They are all fantastic as usual.  I have used Motif for a few years.  The quality of the finished product is excellent. I sometimes use just one picture on some months of my calendar, the quality of the enlarged product is so good I sometimes have them framed."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Shauna",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T00:47:51.000Z",
          "Titre": "6 year + Customer :-)",
          "Contenu": "I've been ordering a calendar from my mom from Motif for 6 years. They are definitely the best and worth the price. She LOVES them. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "JD",
          "Nb_Reviews": 4,
          "Date": "2023-12-19T10:31:17.000Z",
          "Titre": "Calendar",
          "Contenu": "Beautiful quality as always and excellent customer service.It is just a shame that postage is now so expensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NANCY",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T23:01:03.000Z",
          "Titre": "Great quality",
          "Contenu": "Great quality, beautiful colors. So much better than the last company I used for photo books. Will be using Motif again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom B.",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T02:45:53.000Z",
          "Titre": "Very intuitive program",
          "Contenu": "Very intuitive, easy to use software. So easy to change layouts, color scheme etc so you end up with a masterpiece when finished!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Ferguson",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T18:02:02.000Z",
          "Titre": "very flexible yet easy to use program",
          "Contenu": "very flexible yet easy to use program. Product of excellent quality with fast turnaround."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maureen Pontikos-Winter",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T23:04:57.000Z",
          "Titre": "Great product",
          "Contenu": "I have been making a similar calendar for years now and motif has always produced a good quality product from my photos. Easy to use program and delivery turns around quickly. Very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jjrides",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:20:32.000Z",
          "Titre": "The website was easy to use",
          "Contenu": "The website was easy to use and the quality of the book is very high.  Shipping seems expensive especially the expedited charges.  Shipping is also pretty slow."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Hitchcock",
          "Nb_Reviews": 5,
          "Date": "2023-12-14T02:01:52.000Z",
          "Titre": "Although I have been away from Motif…",
          "Contenu": "Although I have been away from Motif for a couple of years, it was easy to jump back in and the outcome was a wonderful recording of life itself.  THANKS!😊"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Geoff Blagg",
          "Nb_Reviews": 8,
          "Date": "2023-12-13T11:21:34.000Z",
          "Titre": "Photobook",
          "Contenu": "After a few initial hiccups getting the App to work the final product was excellent. The speed of the service was tremendous"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MCS",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T21:22:48.000Z",
          "Titre": "The quality of the product -- a photo…",
          "Contenu": "The quality of the product -- a photo book--is excellent.Delivery in a week appreciated."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "cliente",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:05:20.000Z",
          "Titre": "Customer support",
          "Contenu": "My latest purchase experience with Motif was not up to previous, very high-quality ones. After reporting the problems I faced, I was contacted by Michele, who immediately showed both understanding and willingness to solve and save the situation. Michele demonstrated commitment to excellent customer service and convinced me about the Motif's true customer oriented approach.I'm therefore glad to continue as a satisfied Motif user and thankful of the time and effort she took solving my case."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:55:42.000Z",
          "Titre": "I make a motif calendar every year for…",
          "Contenu": "I make a motif calendar every year for my family and it has become a mandatory gift now, so thank you for your severe easy to use application and quality printing:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley R",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T13:18:56.000Z",
          "Titre": "Motif is easy to use with apple photos",
          "Contenu": "Motif is easy to use with apple photos. The quality of the book and photos is awesome, complete with paper dust jacket! This is my 4th major project and I’ll surely be doing another."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T06:57:21.000Z",
          "Titre": "I love the book I made!",
          "Contenu": "I love the book I made about my friend's cat that I'm giving her for Christmas. It turned out just perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T22:08:14.000Z",
          "Titre": "Ez to do",
          "Contenu": "Ez to do, can have app select layout with auto fill of your pics, and then revise as needed, or do it all yourself."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "DV",
          "Nb_Reviews": 9,
          "Date": "2023-12-14T22:54:59.000Z",
          "Titre": "A good product at a reasonable price…",
          "Contenu": "A good product at a reasonable price with exceptionally fast turn round, thank you."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Jörg Erhold",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T07:58:32.000Z",
          "Titre": "Motif is super",
          "Contenu": "Motif is, at least for me, the best software for creating photobooks.The only thing that's been bothering me lately is the shiny dust jacket on the book. It was much better in matte. But all in all an excellent product."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "HM",
          "Nb_Reviews": 23,
          "Date": "2023-12-05T20:23:37.000Z",
          "Titre": "Brilliant app and system for making…",
          "Contenu": "Brilliant app and system for making that perfect photo album. So easy to use and a great online live chat service too - who were happy to hear of any ideas you have too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katherine Browning",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T01:25:23.000Z",
          "Titre": "I love that with each calendar page I…",
          "Contenu": "I love that with each calendar page I can choose the number of pictures I want and the layout. The calendars are high quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tami Seay",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:56:24.000Z",
          "Titre": "The ability to add frames is great and…",
          "Contenu": "The ability to add frames is great and the quality of paper used is excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T23:20:48.000Z",
          "Titre": "This integrated process is so much better!",
          "Contenu": "OMG, I've created photo books before and the interface with Apple Photos makes the process so much easier!  The app integrates beautifully with Photos so instead of uploading tons of photos, you work within your photo app - then upload the finished product.  Once I got the hang of page layout (not long), the process couldn't have been easier.  And the end result is really good and a good value."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill W",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:41:01.000Z",
          "Titre": "Great quality book, quick production and delivery!",
          "Contenu": "The book was printed and delivered in mere days from the moment I hit the \"send\" button and the quality of the paper and printing was excellent. My only critique is that I wish I had a few more design controls in creating the book (such as putting strokes/frames around images, overlapping images and adjusting the picture and type page insets), but am still giving 5 stars, understanding that some of these omissions is to make the books as foolproof as possible to create for people without print design experience. Hopefully they can continue to add new features as the program evolves. There were a few odd things, but I soon found workarounds for them (example: style a sample text box and then copy and paste that text into other text boxes you create. Saves a lot of time styling. Being able to just copy and paste the entire text box would be better still)."
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "ANDRES G PASTORIZA",
          "Nb_Reviews": 6,
          "Date": "2023-12-20T16:59:47.000Z",
          "Titre": "Very versatile and user friendly app",
          "Contenu": "Very versatile and user friendly app, excellent printing, combined with prompt and efficient delivery service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CURTIS HERRIN",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T18:07:31.000Z",
          "Titre": "Template Selection",
          "Contenu": "The page templates are easy to work with. Should your picture not reproduce well, you are notified during assembly. Good experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly Nordquist",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T20:48:55.000Z",
          "Titre": "Thrilled with the photo books!!",
          "Contenu": "While it took me a little time to figure out how to arrange the pictures, the process was really simple and the photo books are gorgeous!  I did 8 separate projects adding up to 43 books!  Fairly expensive (for me, that is), but the look on my family’s faces will be worth it!  Oh, and the communication about the process was excellent!!  I’ll definitely be using Motif again!!  Thank you so much!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T14:21:06.000Z",
          "Titre": "The ease of using Motif",
          "Contenu": "Motif was very easy to work with everything flowed very easily - no stress!!!  Arrived in 4 days after ordering and all was perfect."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:05:13.000Z",
          "Titre": "Every photo book was a joy",
          "Contenu": "Have ordered multiple books over the last years, every single one of them had great quality and fast shipping."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:25:10.000Z",
          "Titre": "wonderful memory book",
          "Contenu": "Easy to use and a wonderful way to capture memories"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim P.",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:28:45.000Z",
          "Titre": "The Christmas card looked exactly like how it looked on my Mac.",
          "Contenu": "The Christmas card looked exactly like how it looked on my Mac. The colors and writing were perfect! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DLT",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T18:01:03.000Z",
          "Titre": "Excellent quality for photo book you…",
          "Contenu": "Excellent quality for photo book you want for a lifetime! Highly recommend… easy to use and create."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy A",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T01:02:21.000Z",
          "Titre": "Incredible Quality!",
          "Contenu": "Service was FAST.Quality was EXCELLENT!Online setup and creation was easy to follow with instructions given, and I could not have been happier with the results.  I will continue to create photo books with your company! 👍"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jennifer Wright",
          "Nb_Reviews": 6,
          "Date": "2023-11-22T23:25:31.000Z",
          "Titre": "A beautiful on going diary",
          "Contenu": "All my calendars were wonderful way of saving memories year on year. All my calendars have been saved by family members across the world. Your books made up of my own memories of 20 years of creating."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Denis Moore",
          "Nb_Reviews": 3,
          "Date": "2023-12-07T10:05:29.000Z",
          "Titre": "The website is simple to use with a…",
          "Contenu": "The website is simple to use with a comprehensive choice of page layouts. The whole process of ordering and monitoring the delivery of the finished product was easy and the final product was excellent."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cheryl Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:26:59.000Z",
          "Titre": "Superb quality",
          "Contenu": "Superb quality, however the price has gone up significantly, can only justify it when using a savings code"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CC Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T03:16:57.000Z",
          "Titre": "I found the website easy &…",
          "Contenu": "I found the website easy & understandable. Simple and straightforward directions helped me assemble my memory book in short order. I enjoyed knowing my project was saved and I could come back to it anytime I had time. The book I received arrived quickly and without any damage-it was securely and completely protected. I will continue using Motif for my projects."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DierkH",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T05:00:10.000Z",
          "Titre": "What really set my experience apart was the proactive customer service",
          "Contenu": "The order of 56 photo calendars was processed promptly and was of excellent quality.  But what really set my experience apart was the proactive customer service: they noticed I'd inadvertently uploaded 2023 instead of 2024 calendars, and contacted me to see if that was what I really wanted. They then helped me replace the order with corrected calendars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:47:47.000Z",
          "Titre": "Fast and easy professional quality books",
          "Contenu": "So easy to use and templates are flexible so I can edit! I created two books as gifts in less than two weeks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larcenia White",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T19:36:28.000Z",
          "Titre": "The photo book came out better than…",
          "Contenu": "The photo book came out better than expected! We are pleased with the final product although the computer program alerted that some photos had low resolutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Burch",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:29:15.000Z",
          "Titre": "Beautiful Books----Great Gift Idea…",
          "Contenu": "Easy to use and manage the Book Development.  Delivery was as Promised and arrived is secure packaging.  I plan to use this service over and over again"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Andrea Brown",
          "Nb_Reviews": 4,
          "Date": "2023-12-08T20:36:27.000Z",
          "Titre": "Used twice now- love it!",
          "Contenu": "Easy to upload my photos and the finished product was great. Have done 2 now to remember my holidays."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "susan schufeldt",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T22:06:58.000Z",
          "Titre": "Unlike last year when the order was…",
          "Contenu": "Unlike last year when the order was incorrect 3 times, this year everything was perfect and it came in a timely manner. Whew. PERFECT!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marie Ludicky",
          "Nb_Reviews": 3,
          "Date": "2023-11-01T21:04:43.000Z",
          "Titre": "I've made several photo books using…",
          "Contenu": "I've made several photo books using Motif, mostly of family vacations.  All the books have turned out beautiful with clear pictures and great color.  Lots of options to arrange pictures and add extra touches. I've just finished another travel photo book and plan on making more in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Burns",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T20:35:54.000Z",
          "Titre": "Motif Photo Books For Passing On Family History",
          "Contenu": "The book turned out great as was the book I produced a year ago.  I use them for family history books, which are designed mainly for our grandchildren.  I also do a related textual history book.  It may be my lack of understanding how the software works, but I would prefer to be able to put more text into the photo book.  Also having more options of photo layouts would be helpful, though I realize that by resizing the places for the photos you could pretty much change them however you want."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Michael Durchschlag",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T15:12:02.000Z",
          "Titre": "Perfect quality and fast delivery",
          "Contenu": "Perfect quality and fast delivery! Just great"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Jonas Erkgärds",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T19:45:06.000Z",
          "Titre": "Reliable and fast",
          "Contenu": "Reliable and fast, and eventually a really nice outcome of my photobook project! Seamless project within the Apple Photos ecosystem from project startup inside the photos app all the way to ordering and payment also within the Apple Photos program. I gladly recommend Motif/Mimeo as Your Photographic partner if it is a book, calendar, canvas or other photo related stuff!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "jackiepaj",
          "Nb_Reviews": 18,
          "Date": "2023-11-03T12:57:25.000Z",
          "Titre": "Absolutely delighted",
          "Contenu": "I created a wedding album for my niece and family on my apple mac and found the whole process seamless. It was very easy to design and place my photos. The instructions are extremely helpful too. There was a good choice of cover designs, and it was very easy to change page layouts. When the albums arrived I was blown away by the professional look, feel and weight of it. Even the gold colour looks gold, which doesn't happen very often. They arrived very well packaged too and each album has a protective sleeve. Would highly recommend using Motif and I look forward to creating another project this way."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T05:51:34.000Z",
          "Titre": "Great quality, great product",
          "Contenu": "Second time I’ve ordered books and once again they were absolutely amazing. Turnaround time was great.  Arrived within 5 days of ordering. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alina W",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T18:22:56.000Z",
          "Titre": "Unmatched paper and print quality",
          "Contenu": "Unmatched paper and print quality! The size is perfect and really features the images beautifully... I give calendars every year as gifts and now everyone looks forward to getting them and keeping them forever!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Barry Bradnum",
          "Nb_Reviews": 34,
          "Date": "2023-12-13T20:19:02.000Z",
          "Titre": "Excellent product",
          "Contenu": "Very easy to create my calendar project and delivery was exceptionally quick. Great quality product."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anne Barclay",
          "Nb_Reviews": 25,
          "Date": "2023-12-19T15:52:33.000Z",
          "Titre": "Pleased with finished result"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T02:20:17.000Z",
          "Titre": "Quick shipping",
          "Contenu": "Quick shipping, easy to use app, cute product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen Palascak",
          "Nb_Reviews": 3,
          "Date": "2023-11-16T00:16:35.000Z",
          "Titre": "Very easy editing process with Motif",
          "Contenu": "Very easy editing process with Motif - the book went together so quickly.  Love the low res photo warning.Great packaging.  Quick turnaround.  Will do another book soon!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale",
          "Nb_Reviews": 6,
          "Date": "2023-12-14T21:53:37.000Z",
          "Titre": "The choices I was given and then the…",
          "Contenu": "The choices I was given and then the quality of the product as excellent. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "GG",
          "Pseudo": "William Kay",
          "Nb_Reviews": 29,
          "Date": "2023-11-12T18:24:57.000Z",
          "Titre": "Still waiting after almost 3 weeks for…",
          "Contenu": "Still waiting after almost 3 weeks for it to be delivered.The problem was with the delivery and not Motif. UPS never delivered the parcel and sent it back to Motif. Michelle was most helpful the parcel arrived on Thursday by a different courier and the item is awesome 🤩 can’t wait to show the recipients.Many thanks to Michelle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Menehune",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:15:50.000Z",
          "Titre": "I like the fact that most all the tools…",
          "Contenu": "I like the fact that most all the tools are easy to use. And I can go back and forth between the book tools and IPhoto to get the look that I want. It would be nice if the text box tool lower line could move down the page about another 1/4 inch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Bartram",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T04:57:19.000Z",
          "Titre": "Current Project: Calendar",
          "Contenu": "The variety of options for my projects was totally supported my Motif. In addition the support staff was always ready and available for feedback, guidance, and assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M M S",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:51:57.000Z",
          "Titre": "The photo book I recently made and…",
          "Contenu": "The photo book I recently made and ordered is exactly as expected! I am thankful for the service that enables me to create my projects with ease!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaisle",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T14:47:26.000Z",
          "Titre": "I order 20 calendars and everyone…",
          "Contenu": "I order 20 calendars and everyone absolutely loves them!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Wendy M",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T06:51:38.000Z",
          "Titre": "I found your online system very user…",
          "Contenu": "I found your online system very user friendly . Very easy to operate the system. I received my photo book , and I was thrilled with the outcome. It was beautiful. Thank you !"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hilary Barnett",
          "Nb_Reviews": 8,
          "Date": "2023-11-22T00:42:29.000Z",
          "Titre": "Beautiful photo book",
          "Contenu": "Beautiful photo book. Very easy to set up on my MacBook and extremely compatible. Reminded me of when Apple had their own photo book package. Didn’t take me long to work out what to do. Very pleased. I will be ordering more"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Handy",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:17:45.000Z",
          "Titre": "Quality product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susie",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T16:16:43.000Z",
          "Titre": "I love working with Motiff it’s easy to…",
          "Contenu": "I love working with Motiff it’s easy to make changes to page layouts, # of images on a page.  It is a very user friendly program.  The finished product always looks so professional!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jody G",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T23:44:45.000Z",
          "Titre": "Awesome product!",
          "Contenu": "I am so pleased with the two photo books I just ordered. I love how easy it was to use my MacBook to create the books. I chose the option where the photos are placed- there were very few edits I needed to make before ordering. Thankful I found a coupon code to help bring the price down a bit. Will definitely order again!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carla",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T02:43:42.000Z",
          "Titre": "Delighted as a First Time User",
          "Contenu": "As a first time user of this App, I thought it was very straightforward to use. I like the features to add information to dates. I also liked that I could even include an image on the back cover. This will certainly not be my last order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:54:29.000Z",
          "Titre": "Process is easy to use",
          "Contenu": "Process is easy to use. Quality is good. Product was delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanna",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T05:06:30.000Z",
          "Titre": "I was very pleased with my card",
          "Contenu": "I was very pleased with my card.  Your products always come through so beautifully.  I had some frustration with trying to write text over my image.  And I had a lot of trouble just ordering the card.  Once I realized that I had to get signed in to mimeo to order a card on motif, then it finally worked.  I do appreciate theft, that you answer emails so quickly.  I will rely on that help in the future.  It used toktake a day or so for you to answer, but it seems you haveimprfbed that customer service, and that will make it a lot easier for me when I made my calendars."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Liz Hammond",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T08:58:38.000Z",
          "Titre": "My daughter put my book together for me…",
          "Contenu": "My daughter put my book together for me as I’m a bit of a dinosaur when it comes to things like that, but the finished product was beautiful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:46:56.000Z",
          "Titre": "Simply Beautiful",
          "Contenu": "The book was created as a condolence gift for the loss of a family pet. I cannot stress how simple it was to create (even for a senior who is not particularly tech savvy) and the result was absolutely gorgeous. The cost was very reasonable and the book arrived in record time. Great quality too. So happy with the result!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T16:25:08.000Z",
          "Titre": "Fairly priced (with discount)",
          "Contenu": "Fairly priced (with discount). Delivery was incredibly efficient.  Thanks Motif team!!"
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Preben Fogh",
          "Nb_Reviews": 10,
          "Date": "2023-10-17T12:33:08.000Z",
          "Titre": "Top Service",
          "Contenu": "The first book had some fault, some pictures has not been uploaded, I wrote in the evening, the answer came same evening, with regrets, I was asked to upload the book again, and I got a new book 5 days later, that is good customer service.Thank you very much, the next book will be placed on Motif again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tammy",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T08:26:45.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, used several times."
        }
      ]
    }
  ]
}