{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "namehero.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dr.Bren",
          "Nb_Reviews": 7,
          "Date": "2023-11-15T18:18:08.000Z",
          "Titre": "My service keeps disconnecting around…",
          "Contenu": "My service keeps disconnecting around minimum of 2 times per week."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Florian Doux",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T12:00:23.000Z",
          "Titre": "Renewal & Downgrade nightmare - All services cut",
          "Contenu": "On the occasion of my upcoming plan anniversary term, I wanted to stay at Namehero but downgrade from my \"Business Cloud\" plan to a lower one.What sounds like a reasonable request turned into a nightmare (Ticket #031413). As of now, I have lost 7 of my websites.Details below:Before the renewal of my web hosting at Namehero on 8 November 2023, I wanted to downgrade my hosting plan to 'Plus Cloud.'Upon login to my Namhero account to downgrade via the menu in the dashboard, it said I had to pay my bill for the upcoming renewal before being able to downgrade and receive relevant credits.I trusted Namehero and executed the invoice payment for the upcoming renewal before the anniversary on term 8 November.After paying the invoice, there were no options to downgrade from \"Business Cloud\" to \"Plus Cloud,\" but only options to subscribe to more options or to terminate the plan.Because of this, I immediately asked for the termination of the Business Cloud service with a message explaining that I wanted to downgrade to 'Plus Cloud.' After submitting, I received a confirmation email saying my service would be terminated in 24 hours.I reached the support immediately, saying it was a misunderstanding and I just wanted to downgrade, but there were no options to do so. They confirmed their understanding of my request and asked me to wait for further details.Only on 8 November I finally received an email saying that I'd been downgraded and received the relevant credit.What sounds great turned out to be horrific: upon checking, my seven websites were not reachable anymore, and I lost my access to the CPanel.I'm now waiting to hear from them; I hope to get my website back up as soon as possible.I don't understand in 2023 how a simple downgrade wiped out all my website, knowing that all invoices were paid in advance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sergey Evangelista",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T17:20:52.000Z",
          "Titre": "My favorite part about this company is…",
          "Contenu": "My favorite part about this company is after waiting 3 days for the website to finally become accessible that lasted for 20 minutes. Turns out the company had blocked my IP with their firewall. They fixed it in about 10 minutes. This fix lasted about 30 seconds.So total over 3 days my website has had about 20 minutes of run time."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Rafa Tabares",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T02:18:08.000Z",
          "Titre": "Worst day of my life",
          "Contenu": "Everything was running smoothly till yesterday that they decided to migrate my server. Support was no help, Their answer on all 10 tickets was, I'm sorry that you are having issues.Ftp errorsPHP errorsBlocked Ip'swrong email servershad to change all of the servers on WHMCSJust one day noticeCustomer service did not helpDozens of angry customers messagesI'm losing bussines by the minute!The ticket number is: Ticket #686871"
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Guy Harley",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T03:25:17.000Z",
          "Titre": "Primitive service offerings in 2023",
          "Contenu": "The fact that you have custom emails as a service offering and it's impossible to allows clients to read their emails on their mobile on the go by using an application that has an immediate fetch rate is extremely primitive. Sort this out Namehero, its 2023 for heavens sake!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Chirag Darji",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T17:38:34.000Z",
          "Titre": "Never Use This Host for Your WordPress Website",
          "Contenu": "Hey,While I am writing this review I already moved my website to another host after too many support interactions with this host.Their servers are showing the wrong data for the server resources usage and these guys are not providing resources for performance which they claim while selling their services.I bought the other hosting package from a different host with the same resources and I am not facing any issues with them.So I am really disappointed with NameHero Hosting Services!I never suggest anyone to buy NameHero WordPress Hosting ever.I hope this will help you.Thanks"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T17:26:39.000Z",
          "Titre": "Very poor customer service.",
          "Contenu": "Very poor customer service. They billed me for over usage as one of may clients sites went over and billed me over $2,000 crazy to think this is nearly the amount I paid for the actual servers.Within 3 days of the invoice being issued they suspended all the websites on my server, and refused to give me a couple more days to clear the invoice. They take forever to reply back to billing issues just replying saying \"I've escalated this case to one of my billing managers who will be with you shortly.\" then hear nothing for hours."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "EAC Kenya",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T11:45:02.000Z",
          "Titre": "Stay away - they hold accounts ransom",
          "Contenu": "Namehero tries to hold customer accounts ransom! We are a Webhosting Reseller of theirs and host a couple of hundred accounts with them.  As we wanted to transfer some out using the backup functionality they turned the backup functionality off!This is close to criminal."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Adil Qatine",
          "Nb_Reviews": 4,
          "Date": "2022-07-05T10:56:58.000Z",
          "Titre": "Worst  Costum support slow  host no refund untill now",
          "Contenu": "i asked to refun the money after 2 days testing,they want you to agree to absorb some amount and this is absolutely unacceptable..i contact my bank i will accept only full refunduntill now i dont receive my refund money  from 22/06/2022what is the problem with this company ?this calls for doubt,because credibility has been lostAdil Qatinedenmarkqatine101 gmail"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dominika Kruk",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T18:02:43.000Z",
          "Titre": "Worning GDPR breaches",
          "Contenu": "They made an error in my personal data for which my website has been blocked and they are unable to fix it with the registry since weeks. I paid for the service that is not provided so I asked for the cancellation of the plan and refund. They are ignoring my request and storag my personal data with no reason. That's highly illegal!"
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "Othmane",
          "Nb_Reviews": 5,
          "Date": "2022-11-28T00:45:38.000Z",
          "Titre": "Crook",
          "Contenu": "Hello,I'm still awaiting my refund regarding the credit balance.I have sent an email to the CEO (RYAN), but no response, and even, RYAN have blocked all my message, now I can't send now an email to this guy.If no response the next week, I'll contact my bank to dispute all payments made to this company.Kind regards,Othmane"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Bob",
          "Nb_Reviews": 3,
          "Date": "2023-01-27T11:47:45.000Z",
          "Titre": "When you want to leave they hold your accounts hostage",
          "Contenu": "Most uncooperative host I have ever used. When you want to terminate your Reseller account and request a simple thing like bulk backups to an ftp destination you get a predefined reply stating I must use Jetbackup! Who has the time to log into 150+ cPanels and download single backups! By the time I get them on the new server the data will be outdated! I even managed to enable the cPanel backup function for a day to use a script and cPanel API to dump full backups on an FTP destination then they went and disabled the cPanel backup function entirely without any way to re-enable it as a reseller! Their argument is they cannot run full backups for my accounts as it will overload the server....my argument is give me access to the cPanel backup function so that I can use my own script to generate backups and seeing as my account has LVE limits it won`t overload the server!"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Oleg",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T15:13:02.000Z",
          "Titre": "I was charged twice for this service and now I don't get refunded",
          "Contenu": "I've tried to order a hosting for my website and paid for thatThey charged price twice and then cancelled my order because my content violates some of their rules I didn't know Now they tell they don't refund for companies which violate TOS rulesIdk what kind of rule is that but you can't hold peoples money just for violation some of the rules they didn't know I hadn't even transfer my site to this hosting\"Refunds are not granted to accounts closed for TOS or AUP violations.\" they saySo in case you violate something, you didn't know and weren't aware of: your money will just move to their pocket and you can also be charged twice for thatUnbelievable...Better pay more with any other service"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Jasmina",
          "Nb_Reviews": 3,
          "Date": "2022-10-21T17:43:59.000Z",
          "Titre": "Been with these guys almost 2 years…",
          "Contenu": "Been with these guys almost 2 years now. Their customer support is too BASIC. You can tell it's 100% outsourced. Their customer support answers tickets in such a slow pace, with tickets being sent back and forth.. it could take up to 48 hours to get your problem solved. A problem which could be solved within 10 minutes.It takes so long I even forget I was talking to them and the tickets get closed for non-activity. Every time I login there is a website that is down or not loading.Can't wait to move my websites.Honestly, worst time ever!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lily",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:57:34.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service. They no linger have a phone number that works. If you call them they say that as of September they only do chat or you have to open a ticket. I have exchanged a lot of emails and they don't give a solution to my problems. They charged me for a service I did not authorize and they sent me an email saying they had charged me a lower amount for a 24 month service, which in my account was a different information. I had to contact my bank to dispute the transaction. What a waste of my time and energy!"
        },
        {
          "Note": 1,
          "Lieu": "LB",
          "Pseudo": "Sync Solutions",
          "Nb_Reviews": 1,
          "Date": "2022-07-13T15:58:44.000Z",
          "Titre": "Never Ending Issue with no real solutions",
          "Contenu": "We migrated to Namehero 1 month ago, after seeing the good support reviews and good reseller plans.God we were wrong. Low entry support is horrible, and they don't know anything .My server for 1 week had downgraded its resources for no reason and they didn't know it, until i refused to talk to the low entry support and an admin saw the mistakeConstant issues:Sometimes it takes 20 sec to open the websites.Never ending 500 Internal Server ErrorThe cpu hits its limit for the simplest of things. My case has been open for 15 days now. All they know to do is to  blame the templates and plugins. some how our 70 accounts all of them have issue with the templates.i will not leave  nor ask for refunds and will give the support team a chance to fix my problemsfor now 1 Star is enough"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Olive O'Brien",
          "Nb_Reviews": 2,
          "Date": "2023-03-19T22:44:03.000Z",
          "Titre": "A terrible experience",
          "Contenu": "A terrible experience. Unfortunately, I lost thousands of euro in sales as my sites were down for 9 days at the end of May 2022 and beginning of June. The incident was 'current service disruption on elon.securewebhosting.net' which affected the customers' websites. The downtime occurred due to part of the server  hardware overheating which caused thermal damage to the drives. It then became an issue of safely retrieving data from the server.The company were prioritizing their own migration, and allowed limited access for customers who wanted to migrate their data manually (at capped speeds). When I contacted NameHero about the damage to my business and sales, I was informed that as I was an indirect customer (the hosting was with a NameHero reseller) that they weren't going to discuss it with me further. Awful experience, even worse customer service. Thank goodness, we were able to retrieve most data and are now with another company which is a lot better."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Iz Nickster",
          "Nb_Reviews": 2,
          "Date": "2023-04-11T16:39:06.000Z",
          "Titre": "Awful experience with NameHero customer support",
          "Contenu": "Awful experience with NameHero signup. Had an issue signing up in which their aggressive anti-fraud system flagged me as being suspicious. This was before I could even supply payment information. Annoying, but sometimes automated systems get it wrong. I contacted support and was told I would need to provide private information in the form of a photo of my government-issued ID plus credit card or the PayPal transaction details. I explained in three separate messages to support that I don't have transaction details because the payment screen was never even shown. Support ignored this and simply kept insisting for me to provide transaction details--which is impossible since a transaction never was created. As a test, tried signing up as a business with completely different and valid payment details that I use for services like AWS and other hosts. I'm US based and not using a VPN. Still flagged. Can only conclude their system is broken or Namehero is deliberately trying to harvest private government IDs. Either way, support was a frustrating waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "irritated namehero customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T01:59:10.000Z",
          "Titre": "It takes an hour for them to reply to a question and still don't get an answer",
          "Contenu": "Worst experience after five years of faithful service to this company. I still don't have the answers to the question I have been asking for over 12 hours now. and my websites have been down for over 24 hours.UPDATE- My account was restored, however, the damage has been done and I have begun moving my client's websites to another provider. This has been coming for a while and this was the final straw.In Reply to Ryan's update: I knew when I checked my email what the problem was, and asked for help in putting a solution in place but got no response until almost 24 hours later after being passed to different people. I do have a screenshot of the entire ticket conversation with support with timestamps, and in it, you can see how long it took support to reply (if they replied at all). That was the problem. meanwhile, my client's websites were down all that time potentially costing me my customers. Imagine telling them I could not access their website and that the company hosting them wasn't answering me. I had no choice but to move them to another provider and install their website from backups to get them back up and running as quickly as possible."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Jerry",
          "Nb_Reviews": 2,
          "Date": "2023-02-26T23:20:57.000Z",
          "Titre": "This is the worst hosting company i…",
          "Contenu": "This is the worst hosting company i have ever used in my 10 years of domains and hosting history. When the last batch of services expire, i will never come back."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jaeyoung Kim",
          "Nb_Reviews": 3,
          "Date": "2022-09-11T22:31:46.000Z",
          "Titre": "I gave this a 1 star back then and then…",
          "Contenu": "I gave this a 1 star back then and then removed it because they were able to resolve it with some credit but i cant. I cannot NOT give them a 1 star.Too many restrictions, too many sudden changes, lots of modules are not compatible, support is fast and responsive but lack any technical knowledge.Simple access via putty does not work - connection is refused and still they wont acknowledge the issue. I am able to connect to ALL my other VPS's with EVERY OTHER company but NameHero.My modules have stopped working - and cron jobs dont run automatically anymore. They've migrated my website RANDOMLY with barely any notice - making my team redo the licensing and ensure all clients have their DNS records updated.Such a mess. They charge you $65/m for litespeed when you can get it for less than $20/m from the actual company. Charging you $350/year for 100 cpanel accounts when most companies charge max $100/year. This company is a total scam. They can justify their prices by claiming their support is top tier - which i agree it is, they respond fast but issues dont get resolved over months and months. I've lots so much business and had to stall my launch for over 4 months now. I've had clients complain their websites are down because the storage is only 90GB. The tmp folder on the VPS overloads to 100% making ALL sites crash.Stay. Clear."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ghulam Naheem",
          "Nb_Reviews": 6,
          "Date": "2022-12-02T18:39:40.000Z",
          "Titre": "So far not happy with the service for…",
          "Contenu": "So far not happy with the service for hosting I wanted to check TTFB for UK customers and its bad 600ms, Now I'm asking for a full refund and they are taking their time I had to open a Paypal case for this. I used their service for 1-2 days"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Devon Jordaan",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T11:05:59.000Z",
          "Titre": "Worst Time of our lives",
          "Contenu": "Since 2017, I have been conducting business with Namehero and have never regretted it until last week. Unfortunately, one of my reseller accounts experienced a lot of downtime, and Namehero recommended that we migrate to a new server, which they would handle. I inquired about the necessary steps to proceed and was informed that I needed to update the old nameservers to new ones. I had a domain registered with Namehero that I used for custom nameservers and asked if they could use it to register the custom nameserver for the new server. They agreed, and the migration was completed, but all emails were still routed to the old nameservers. Despite my attempts to seek answers from Namehero, I was left to do my own research and discovered that I had to log in to the old nameserver to retrieve the emails. We had to synchronize over 60 cPanel email accounts one by one to recover our clients' lost emails, which caused some damage to my company. I was disappointed that Namehero did not have a protocol in place for these types of migrations, and it left me with trust issues in continuing to use them as a service provider."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Christopher Smith",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T22:05:52.000Z",
          "Titre": "It appears as though the team responsible for managing our support tickets lacks knowledge or understanding.",
          "Contenu": "Since 2017, I have been conducting business with Namehero and have never regretted it until last week. Unfortunately, one of my reseller accounts experienced a lot of downtime, and Namehero recommended that we migrate to a new server, which they would handle. I inquired about the necessary steps to proceed and was informed that I needed to update the old nameservers to new ones. I had a domain registered with Namehero that I used for custom nameservers and asked if they could use it to register the custom nameserver for the new server. They agreed, and the migration was completed, but all emails were still routed to the old nameservers. Despite my attempts to seek answers from Namehero, I was left to do my own research and discovered that I had to log in to the old nameserver to retrieve the emails. We had to synchronize over 60 cPanel email accounts one by one to recover our clients' lost emails, which caused some damage to my company. I was disappointed that Namehero did not have a protocol in place for these types of migrations, and it left me with trust issues in continuing to use them as a service provider."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "very fantastic events",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T22:36:44.000Z",
          "Titre": "Zero",
          "Contenu": "First, the support is very slow, even though the case is urgent. An inquiry was sent and I waited 12 hours after that I was answered without understanding the question, and I returned the question in another form, unfortunately, or the response after 8 hours, and we waited like this for up to 3 daysFirst, they are not cooperative. What happened is that I use many hosts, and I can get my money back if a misunderstanding occurs, but what happened here is other than that. The renewal was automatic on the server, although I am sure a million percent that it is closed, and the problem is that they told me that the renewal is open automatically.Why, if it was ok, the renewal took place 15 days after the renewal date, and the visa was withdrawn without my knowledge, and the subscription was suspended, but once the renewal was completed for a month according to the old bill, so it had 14 days left instead of a full month, and what they did was calculate the subscription period from the month that I did not subscribe to originally They pay me for 16 days. I did not use them, and after the renewal date. My experience in this field is great. This is the worst technical support in my life."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zakir Ahmad Shah",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T08:39:30.000Z",
          "Titre": "I loved working with the NameHero and I…",
          "Contenu": "I loved working with the NameHero and I am currently hosting multiple client websites on NameHero. I was their affiliate member and once I cross the $500 payout milestone, they are not adding new affiliate income to my account and upon sending 100's of emails to the support team and submitting support tickets they never replied and to my surprise they deactivated my account without giving any reason or sending an email and I am not able to access my account. Soon I will migrate all my clients to a better hosting company and will advise everyone to never use their services."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "By Rizzy",
          "Nb_Reviews": 2,
          "Date": "2022-05-31T05:08:00.000Z",
          "Titre": "The WORST Customer Service!",
          "Contenu": "I am shocked that so many people say their customer service is great?!  I am reasonably tech-savvy, but have been left in the dark by ALL of their customer reps 10x's now! Their advice is technical, they take 5-8 minutes to answer, and they don't even apologize or acknowledge their rudeness. I have never had this bad of customer service with any software I have bought, and I am a software junkie.  I'm not sure if they are training new people in 22' or what is going on?  After my transfer from Bluehost, everything went downhill. I decided to keep my Bluehost account because their customer reps actually helped me with stuff I was doing in NameHero! That is ridiculous! I am so mad that I now have to find alternatives just to have a faster site. Every time I do anything on their site I end up getting pissed all over again. If you are not an actual coder or backend web designer stay far away! Also, 500 errors with no explanation, sending me to half-done articles instead of walking me through issues, and one guy even stopped talking to me completely. Did I not just pay for a 3 year plan? I wanted to cancel one week in, but now it's been a few months and I just can't with this any longer. The only thing that has kept me is the fact that I think my multisite will crash with the transfer and per usual I won't have any help."
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Ansam Omar",
          "Nb_Reviews": 6,
          "Date": "2022-09-22T15:43:31.000Z",
          "Titre": "so so so poor server service I have a…",
          "Contenu": "so so so poor server service I have a reseller subscription with them and my client's website also server time out or very slow, I am unhappy with this service at all!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gabriel Graciano",
          "Nb_Reviews": 2,
          "Date": "2022-07-04T18:25:07.000Z",
          "Titre": "Namehero LLC THE worst hosting/domain provider",
          "Contenu": "How can I qualify Namehero LLC, of so let me tell you about my experience, I had Webhosting, domains, and email's with them. The Webhosting is one of the slowest I ever had, no SSL, very expensive if you want to buy it, it is impossible to use WordPress because they have incompatibilities with MYSQL and you have to use PHP 7.0 to make it work, many themes and plugins work only with PHP 8.0. Domain, they use a company called Internet.bs (BS is exactly the kind of service they give) they normally \"FAKE\" emails as if they are coming from ICANN simulating delays. For a regular transfer of a domain, go to the previous register (PR) and remove the lock and get the authorization code, go to the new register (NR) and start the transfer with the authorization code, then go back to the PR and agree with the transfer and DONE. With Namehero LLC you have to wait for Internet.bs to release the domain, more than 5 days after. Email, the server they use keeps blocking the IP number from my home, I called 3 times, every time saying DO NOT BLOCK MY IP AGAIN, but it keeps happening. Imagine having to use a VPN to get your emails. And talking about privacy, they let you send emails only if they like the subject, if somebody sends you an email saying amazon account (maybe a scam) they will never let you reply to this email. Even in a regular workday, if you have an email interchange with coworkers, they don't let you send more than 50 emails in one hour. And a very dark way to do business, they like to ask for copies of ID and Credit card, when they really have no authority to ask for it, not a governmental office or a financial institution. They are a private entity. And what about the storage of all these copies."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:30:22.000Z",
          "Titre": "poor performance and undisclosed costs",
          "Contenu": "I have personally experienced the hosting service, and unfortunately, it fell short of expectations due to issues such as poor performance and undisclosed additional costs upon refund request."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Nick Martin",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T13:17:58.000Z",
          "Titre": "They waste my 9 months' money",
          "Contenu": "They waste my 9 months' money, Worts hosting Company ever. they send fake invoices and emails and want to charge money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nelly",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T04:28:36.000Z",
          "Titre": "Horrible",
          "Contenu": "Horrible! 3 weeks now they havent refunded me"
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Jnt Buside",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T07:00:46.000Z",
          "Titre": "How can force me to pay the service…",
          "Contenu": "How can force me to pay the service that I did not use? This is we call cheating, fraud and fake. From Emalwip"
        },
        {
          "Note": 1,
          "Lieu": "SI",
          "Pseudo": "Daniel & Marusa Zamorano",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T08:22:21.000Z",
          "Titre": "This has been a very bad experience",
          "Contenu": "This has been a very bad experience so far but the worst one is still ongoing.Yesterday morning our website went down and at some point we were logged out and as we speak we still can’t get back to business.We have ask for help and we received a link to a YouTube video to fix the problem ourselves which was a tutorial to do a manual backup. No assistance, just a tutorial video.We did the whole thing and what we found? That our last backup was done almost a month ago when it supposed to be done on a daily basis and automatically.When we reached out again to tell about this new issue, we were told that they were having a trouble with their servers but we would be able to access again with no problems and without any data loss. After few hours, we could see again our site working but guess what? We lost a month worth of content and nobody seems to know why. But wait…there is more. So after we accepted the idea of losing all the published but now lost content, we thought “maybe we can just re upload all the stuff again from our Wordpress dashboard and call it a day but nope, we lost all our admin/login data and they still don’t know how that happened so now we can only see out website as visitors and not as admins.Last thing we were offered was that they could “try“ to do a backup from 5th or 10th April but now, suddenly those options are not available anymore.It is very frustrating to be left like this and without any clear and honest answer from these people that seem to be very confused of what happened.By now we are preparing for the worst case scenario which is to forget about our website and all the work we have put into it.The other bad experience we had with the service was the very first day that we purchased the hosting package and domain (same that is giving us all the mentioned troubles atm) and we were charged twice the price listed but not getting the product.After issuing a complain we had to wait a whole day to get the refund and once we did the purchase again, the difference of price was enormous (this was in 24 hours and it went from 300 plus euros to over 500 euros) so we issued another ticket and got the right price.So this has been our bitter experience so far and hopefully we can get our site back the same way we trusted it to this company in the very beginning, full and without any lost content.UPDATE: Until now, nothing has been fixed and even worse, we have new issues added to this experience:-We have received mails from at least 10 different people telling us the same \"we have escalated this issue to whatever senior/higher ranked individual to look into the problem\"  and not even ONE person was able to explain what was the problem.(Only the very first message we received before all went to hell was from a person named ASHITHA that told us that NameHero servers had a \"glitch\")-We reached out to CEO Ryan Gray with the Ticket ID about the problem as he offered HIMSELF to get involved and see what was the problem and guess what? We got nothing from him either.-Our website not only has no access but it is no longer visible.-We also received a pretty standard answer that we were fully refunded from NameHero on the 20/04/23 which we did receive a refund payment but then they once again took back money from our card without letting us know and without explanation. They just took it and it was the same amount that was initially refunded. INSANE!!-After noticing the issue and the gravity of this action, We have reached out to them and their response was (We are sorry to see you leaving our service and we will refund your money) This is after they told the same speech and did the whole refund spectacle we just mentioned before.-Right this moment, we have received another mail where they are stating that they can't see the money issue and now we supposed to send the card information, the amount paid in USD, transaction ID and card holder which is shady as hell as we got all notifications related to our business from MasterCard of every single transaction done with this card which happens to be for business purposes only. This information is sure held by their accountant department as we did already purchases these tools from NameHero and with the same business credit card.So as you can see, this is very frustrating and it feels like these people are just playing with us at this point. Three weeks have passed already since this started and we have lost  a lot in terms of money, business relations and reliability.(We sent them a copy from the masterCard app with all the detail showing that unauthorized transaction and their reply was that they are happy that we continue to work through this with them but they are still looking into their credit card processor)Not sure if we are the unluckiest people on earth but this has been an awful experience."
        },
        {
          "Note": 1,
          "Lieu": "GE",
          "Pseudo": "Jay J Botes",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T14:18:05.000Z",
          "Titre": "Nothing enjoyable about paying double the money"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Haych",
          "Nb_Reviews": 3,
          "Date": "2022-04-01T16:19:31.000Z",
          "Titre": "Delete reviews, bad practice, worst company",
          "Contenu": "Stay away from this company of your trying to get Reseller Hosting, they know exactly what they have done and they know me, but still they trying to decieve people out of there money, full YouTube review with there portal launching soon, wait for itI'm from the United Kingdom that's why, I'm currently on travels for business, you can locate me, by the email I sent with my credentials."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ludovic",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T03:23:29.000Z",
          "Titre": "WILL delete all your data within 14 days after your account suspension",
          "Contenu": "NameHero hosting is a company that can not be trusted to keep your data. If you miss a single invoice they will not take any action and will delete all of your data. You have no ability to recover your data once it is deleted. The most important aspect of any hosting company is to keep your data secured. It is not secured with namehero with carelesss policy. Ridiculous! Don't risk your data with namehero"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Yuan Liu",
          "Nb_Reviews": 2,
          "Date": "2022-02-15T03:03:06.000Z",
          "Titre": "Stay away if you need a stable business…",
          "Contenu": "Stay away if you need a stable business site.After reading some positive reviews of NameHero on Youtube, we transferred our website (plugear dot com) from SiteGround to NH, hoping for better performance.We are running a web store, now it's been 2 months after the migration and we have already 5 times (no joke) server out of service, with all kinds of causes.We've been hosted by other service provider (BlueHost, SiteGround) and never had such a poor experience."
        },
        {
          "Note": 1,
          "Lieu": "CY",
          "Pseudo": "Am Gedo",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T17:10:53.000Z",
          "Titre": "I have never dealt with a customer…",
          "Contenu": "I have never dealt with a customer service this bad!!they canceled my service without notifying me, refused to refund. their agent over the phone refused to even share his name, refused to help or to even give sufficient info."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Keanes",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T05:44:44.000Z",
          "Titre": "Bad. TTFB horrible an more",
          "Contenu": "Bad, simply bad hosting with so many others why would you choose a slow server? Because of video tutorials?Don't use this hosting. The TTFB is slow and this will affect your ranking. In this day and age why go for a company that cant get service right, they servers right?After 30 days your speed you be awful. This will eventually hurt all your efforts of having a successful website.Plus if you ever want to migrate they disabled the standard backups from Cpanel so you will have a lot of issues."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nabil",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T19:46:58.000Z",
          "Titre": "Absolutely despicable",
          "Contenu": "Absolutely despicable. I requested to cancel and transfer my website hosting and domain away from Name hero as my site was running slowly. Instead of helping me to transfer my website over, Name hero deleted my website and database. Everything I worked for has been lost. I am so upset. Unlike WP-Engine and other hosting providers, no automatic backups are run, so not only did they delete everything I made, they also say that they have no backups to reinstate anything at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ServPay Admin",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T21:57:17.000Z",
          "Titre": "Inodes and disc space, seriously??!",
          "Contenu": "I have bought unlimited business plan, but it was very limited!!I don't feel comfortable with it. I have paid alot for this Trash service.I got an email asking me to delete my important website files! I just can't believe it? How unlimited and restricted!!!!I asked them for a refund, but they close my account before I take backup of my files! Not happy at all. BAD BAD BAD"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Maango",
          "Nb_Reviews": 5,
          "Date": "2020-06-08T08:26:52.000Z",
          "Titre": "Support refuse to help me",
          "Contenu": "Support refuse to help me with my domain nameservers. He literally said straight out \"Buy a hosting package and we will help you\". I asked if he could double-check the listings from my domain which I got help with before so I contact this guy but he just refused to help me and said he only would help me if I buy hosting."
        },
        {
          "Note": 1,
          "Lieu": "SS",
          "Pseudo": "Ugwak O Crosky",
          "Nb_Reviews": 2,
          "Date": "2020-12-31T06:43:38.000Z",
          "Titre": "Don't fall for Namehero",
          "Contenu": "Namehero treated me inhumanely. My account was suspended without clear reasons and Communication. Worst of all, they did that on Christmas day. If you are looking for shitholes and cheats, look no further than Namehero. Should you need evidence, don't hesitate to contact me. I got all the emails safe."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "IAgent Henry",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T12:35:21.000Z",
          "Titre": "Bunch of dishonest",
          "Contenu": "Bunch of dishonest, uneducated and liars.  Don't fall into this misleading 5stars reviews. Don't waist your time and money. I had to complain to police and BBB twice because of their actions. Also they don't have any   professional customer service. Always some tire 3 level that have no idea what you are asking them. I thought the same thing when I transferred my site from godaddy but I hope no one makes the same mistake that I did. they are really truly dishonest and unprofessional. They should choose another business instead of hosting and web services."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Peter Thais Bjerregaard",
          "Nb_Reviews": 8,
          "Date": "2021-09-20T12:54:10.000Z",
          "Titre": "My wife and I wanted to start a webshop…",
          "Contenu": "My wife and I wanted to start a webshop and chose NameHero due to the many great reviews. Unfortunately our experience has been completely different.Essentially we created an account, picked a domain and was eager to get started.Unfortunately, something \"techy\" went wrong, and NameHero  couldn't seem to pair the domain with the site. 4 days after and a support thread of 20 messages we decided to give up.Unfortunately we now need to cover the \"subribtion\" costs even though NameHero failed to provide what they promissed.Would definately take the otherwise positive reviews with a grain of salt if you are considering NameHero."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Ask If Needed",
          "Nb_Reviews": 2,
          "Date": "2021-12-01T17:48:47.000Z",
          "Titre": "DON'T recommend",
          "Contenu": "They blocked my account and flagged it as \"Fraud\",  requesting gov. photo ID and the last 4 digits of my credit card, EVEN though I explained that I was paying with PayPal and that it was a company purchase.To \"NameHero\" - 1) I'm not paying hundreds of dollars to protect my privacy with an LLC and other companies to give you just like that all my details.2) I wanted to pay UP FRONT for 3 years! So it's not like I'm taking a loan from you and you need all those details. Proof of incorporation should be enough.3) Ask your Co-founder if he leaves a copy of his ID on every website.GOOD LUCK====================================I was contacting you Ticket ID: #414563"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DeUndrae",
          "Nb_Reviews": 1,
          "Date": "2019-03-29T21:03:19.000Z",
          "Titre": "Terrible experience",
          "Contenu": "This company has been just terrible for me. Their customer support has been rude and incompetent on several occasions. They were suppose to install something on my server but messed it up completely. I put in a request for a refund and they said it will take up to 30 DAYS to receive it. Who made up this policy??? To make matters worse after the 30 days I still did not receive my refund and had to reach out to them several more times. And even after that I only got a partial refund so I had to reach out to them once again! So as I write this it is coming up on 40 DAYS and I am still waiting on a refund."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Justin Boyce",
          "Nb_Reviews": 8,
          "Date": "2021-04-30T15:51:31.000Z",
          "Titre": "Bunch of crooks increased the price on…",
          "Contenu": "Bunch of crooks increased the price on webshosting from $71 dollars to $179 and then said we don't do refunds on renewals 'Here is actual email I will never use this comapny againThank you for your update.We do have 30 days of money refund guarantee for all new signup. Beyond that period we don't refund back to the credit cards or paypal. The renewals are also not refundable. Eventhough we can credit the unused amount on your Plus Cloud(cjs.nz) to your account with us, which will be applied to domain renewals or new purchase invoices. If you wish to have this as credit balance on your account with us please feel free to confirm in this ticket. We can help you about this.Best regards,Anju P."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 2,
          "Date": "2021-11-18T10:07:45.000Z",
          "Titre": "Whats NOT great about Namehero is",
          "Contenu": "Whats NOT great about Namehero is No supportPoor customer serviceNo Downtime recompenseNamehero really do need to step up to the mark and get their servers online when they go down"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Valentina",
          "Nb_Reviews": 1,
          "Date": "2021-02-25T16:19:49.000Z",
          "Titre": "Horrible service",
          "Contenu": "Horrible service. Support okay. indian subleased company. servers subleased from liquid web. Everything a bit fake. Choose another. find proper solution to your hosting. here only lease."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jimmy K",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T14:39:43.000Z",
          "Titre": "Sites go down monthly with constant DNS…",
          "Contenu": "Sites go down monthly with constant DNS issues in nameheros end. Have about 50 sites. Would not recommend if you need a reliable service."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "TRG AMV",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T11:31:00.000Z",
          "Titre": "I have been battling for 5-10 days now…",
          "Contenu": "I have been battling for 5-10 days now with them to sort this our their billing system declines my cards one after another service is suspended and no support has been received from their side no investigation whatsoever they have promised to make a PayPal invoice for me to pay through PayPal however that has not been done and they wont unsuspend the service until I can get it paid makes no sense I have sent screen shots of the error and my tickets just get deleted I dont get any support or feedback from NameHero further then this I have logged over 5 tickets regarding the server giving multiple errors from some email accounts not connecting to slow server speeds slow websites but nothing has been resolved from their side I highly reccommend using a professional host instead of Namehero!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eth Wonderer",
          "Nb_Reviews": 2,
          "Date": "2019-04-19T11:51:23.000Z",
          "Titre": "Crap",
          "Contenu": "Crap! You guys have done so much to the server which I always wonder how you managed to do this when it comes to time management. innode limits, file counts..... there are so many limits on reseller accounts. Generally ~$750/2yrs for reseller account here was just a lot lost money. Due to these extreme modifications, custom scripts barely work here, the so called litespeed....is the slowest server here because of these modifications. All the sudden, my domain emails started going to spam after we moved to here and we almost always had complaint from our customers about increasing number of spam emails and their emails being rejected by most private emails. Personally I had better experience with a $2.98/month hosting at Bluehost or Godaddy than here. Customer service wise there is only Aaron is doing it from his heart. I can't believe how much I hate me being here."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Traggi",
          "Nb_Reviews": 4,
          "Date": "2019-12-12T19:49:04.000Z",
          "Titre": "I would recommend ANYONE to stay away…",
          "Contenu": "I would recommend ANYONE to stay away from this company.So why is that you say? Well first of, they dont offer anything special that siteground, a2hosting, hostinger and so on doesnt offer. BUT they do have the most shady refund policy in hosting business history. If you sign up for a package, and you find out that it isnt for you, normal hosting company's would refund you with in 30 days no question asked. At NAMEHERO this is not how they roll. If you sign up with them and then regrett it, you will have to pay them 9$ in what they call setup fee(wich is a scam in it self) The so called setup fee they charge you for, is a service that WHMCS does automaticly for them, so its just a scammy way to steal 9$ from the customer that left them. Company with shady refund policy is something you should AVOID. there are so many hosting company out there. NAMEHERO should not be one you consider."
        },
        {
          "Note": 1,
          "Lieu": "MT",
          "Pseudo": "Bebeto Rimbaud",
          "Nb_Reviews": 4,
          "Date": "2021-12-28T02:29:37.000Z",
          "Titre": "I have a lot of errors on the domain…",
          "Contenu": "I have a lot of errors on the domain panel.for exampleI wanted to change my DNS Ip. cause I need change my VDS. so I am moving to new DNS from ex DNS.I need change only DNS IP. I need change on the dns change page. but always giving me error. I tried to delete and add, again same error. the error saying, There was an errorwhen I open ticket, they dont understand me. even I sent all case details with screenshot. they dont understand.they replied me, you can change on the cpanel. I already explained to them, I have another hosting panel. I am changing hosting panel. So how I can change my IP on the hosting panel.cause when I wanted to move my domain as a transfer domain, I need get password for the transfer. So again, there is an error :)) I open ticket even a stupid transfer code. and they reply lately.the company is a nightmare, avoid to use this company. I am suffering in the 3 am, I never have this experience before with another domain hosting companies. I have 14 years experience, many hosting, VDS and domain companies."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Oleksandra",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T19:50:05.000Z",
          "Titre": "Suspicious credit card requests",
          "Contenu": "I bought their hosting a couple of days ago, and am already unhappy with them. For some reason the AI detected my account as fraud, so it has not been activated yet. I was then asked to provide a copy of my ID and the four last digits of my credit card, which I did. After this they asked me to provide my full credit card details including my CVV, although the payment itself has already been made.And also: how come they have an automated billing for around 300 dollars after the first year, if I only pay 100 for the first year? Smells like scam.Answer to your reply from 15.02.2022: As regards the fraud status, I could first clarify it after talking to my bank. All the messages I received from your service team were actually false, when they said e.g. they did not receive any payment and that I should pay again (!). I wonder what this fraud status is all about, as it never happened to me before.As regards the verification of the last 4 digits, I had previously sent you a copy of my credit card with the last four digits visible on it and upon request of your service team. So no clue why additional data was needed. Plus the form that I was asked to fill out was for an automated billing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rahul Jalthar",
          "Nb_Reviews": 8,
          "Date": "2020-04-23T11:58:41.000Z",
          "Titre": "Think before buying hosting, no support",
          "Contenu": "Think before buying hosting from namehero support agent refuse to give service.Not willing to provide support"
        },
        {
          "Note": 1,
          "Lieu": "CN",
          "Pseudo": "Rahul Jalthar",
          "Nb_Reviews": 4,
          "Date": "2022-05-23T14:15:36.000Z",
          "Titre": "Very Unstable Hosting Always new error, slow speed, bad & slow teckets reply",
          "Contenu": "Very Unstable Hosting Always new errors, slow speed, connectivity problems, frequently error 520, error 521, error 524, and Memcached connection failed. The worst part is the support, chat support is always blocked in between. and Ticket #795842 & Ticket #061552 both tickets are pending for the last 20 days.Seems Only One person for tech support and he always replies to tickets after 24 hours but ow he is missing for the past 5 days. They are failed to provide service and they asked me to make an order cancel reguest. I bought three years hosting package and my 1 year hosting still leftNamehero company doing very bad practice for business. to hide the problem they closed the account by making fake excuses. Google namehero error 520 for screenshot proofs,  If you try to post on the Facebook page they will block you, if you try to post on Twitter they will block you. After my review and Blogs post about the problem. They canceled my account. tey canceled my account without giving any notice. they rob my user's data. Nahehero Hosting is unstable, Technical support always works as our working hours. Nothing like 24x7 service. Namhero service is not more compatible with Cloudflare. And most Important Point your data is not safe with Namhero Hosting.They always try to remove negative feedback from t Here, and social media. They just want to show Good feedbacks so taht they can cheat more people"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynnette Vyles",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T18:02:50.000Z",
          "Titre": "Wish I never spent the money **UPDATE**",
          "Contenu": "I was referred to NameHero by several top bloggers I know.  I was super excited to migrate my site over and they even did it for me which was fantastic.  That's about where the happiness ended.  Since I signed up (stupidly for a 3-year contract), I have had nothing but issues.  HTTPS Error 500 messages constantly, cannot edit my site, etc.  They act like everyone is tech-savvy and understands the terminology (I don't) so it's super frustrating to try and do their recommended fixes when I have no clue what they are talking about.Navigating their site to get into mine is a nightmare.  At least with my previous hosts (Bluehost), I could easily navigate and never had issues like this.I wish I never invested my money in them.  Now, I have an awful-looking site, I don't want to try and work on it, and I am ready to dump it all and move on (including losing hundreds of dollars).****UPDATE****I got a brief message from the founder however, I continue to have ridiculous issues.  Now, while trying to update my theme and change the overall appearance of my site through a staging site and get constant messages saying my site is down for scheduled maintenance.Not being able to call someone directly and get my issue resolved over the phone is frustrating.  At least with my old hosting company, I could call and get someone to walk me through the issue and resolve it quickly."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "George Christoforou",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T21:56:35.000Z",
          "Titre": "False advertising - Overall very bad",
          "Contenu": "From their webite:\"10 Free cPanel To cPanel MigrationsIf your current web host is using cPanel (such as HostGator, BlueHost, InMotion), ......\"This is a lie. Only 1 migration and only if you meet their strict criteria. I chatted with their agent before I signed up and said I had 10 websites hosted elsewhere and I would like to host with NAMEHERO. They said fine use our business package. I was not informed that I would only get 1 migration. I didn't even get 1 because my old host doesn't use cpanel.They will charge $35 for each migration. $350 for me is a bit steep. I am forced to do it all my self.I have eventually migrated 11 websites. That was a nightmare to do. One major headache is that they only offer 1 website. My other 10 websites are now subdomains of my main website. I think some re-write rules makes it appear as if they are independent websites.Their support service is crap. They use cheap staff from India that busily mess up your website making the 99.9% up time a big joke. They keep passing the buck when you ask them something or to do something. Honestly this is the worst support service I have ever seen. Absolute useless. Maybe 1 or 2 good guys but the rest do not know what they are doing.I am still waiting for the \"incredible speeds\" which is tied in to using their litespeed caching system. They can't get it to work properly. I wish I had never ever bought a package with them. Biggest headache and nightmare ever. Just avoid."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Saskia Busch",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T14:42:59.000Z",
          "Titre": "Left with a broken website / Issue Resolved / Issues Continue",
          "Contenu": "UPDATE 21-12-21Since this last interaction there have been countless issues. While the platform perfoms adequately with some minor issues the support staff are unable to follow ticket instructions properly. This has set us back a few weeks in our upgrade schedule.UPDATE 07-12-21Although NameHero weren't able to achieve what we originally asked for, they did restore our site back to its original state.The service around this was fast and efficient. Senior staff members did all they could to get the issue resolved as quickly as possible. They were also kind enough to refund our money and added an extra year of hosting which is hugely appreciated!ORIGINAL COMPLAINTNameHero was recommended to us by a blog coach. We did some due diligence by looking for reviews and chatting to some people in forums. The results where impressive and we signed up, moved our web hosting and one of our domains.The website migration went well and thereafter we requested a domain URL change to be done on the staging site first. We mentioned doing this on a staging site 3 times. (We specifically didn't want it done to our live site to avoid potential tech issues.)The charge was $35 (which for us in South Africa is quite a bit of money).Unfortunately NameHero went ahead and changed the domain URL on the live site and it has been pretty much broken in terms of design and internal links since Friday 03 Dec. We sent a list with all the problems we could see and got a response with only one of the issues addressed.   We checked the site and after this first set of \"corrections\" the side bar was not visible anymore.We got in touch yesterday and were told that the matter was escalated. When I got hold of a customer service agent via instant chat today I was told that their Senior Admins only work during business hours.Whilst I do have understanding for a business model that takes care of their staff, I feel that in a case like this one when a website, which is our business, has been compromised by NameHero, then a senior staff member should be available to assist."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T20:32:04.000Z",
          "Titre": "They stole my money",
          "Contenu": "Stole my money"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Charl Chambers",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T14:23:59.000Z",
          "Titre": "Caution Acceptable Use Policy (Hypocrisy)",
          "Contenu": "I have a website selling cannabis seeds, there are many many others just like it hosted all over the world, not on the dark web. I had no reason to suspect that any hosting company would not allow this. So, upon recommendation I went to look at namehero. Start Now Free, no credit card required, worlds favourite/best/fastest/most loved, 30 day money back guarantee, it's all there. Sounded great, so I signed up for namehero hosting, and had to pay for a year in advance. Thank goodness I didn't choose the 3 year package. Naturally I needed a website, so I  registered buywholesalecannabisseeds.--.--. I started communicating with them about setting up the quic.cloud etc on buywholesalecannabisseeds.-.-. I then set about transferring my income producing site feedaseed.--.-- to their servers. Again, I received assistance from their support staff.  I also bought another domain, bethulierise.-.- Then a week later, with my site having been down, and me eagerly waiting for the domain transfer to complete. I receive a red ABUSE notification, stating that my site is in violation of their Acceptable Use Policy?This policy, hidden at the bottom of the page, prohibits amongst many, many other things CBD and Cannabis related products. Go Figure! I was given 48 hours to remove the offending website. How? We're going to delete your account. Can I get my money Back? No, because their Terms of Use state that if you contravene their, somewhat obscure and disingenuous, Acceptable Use Policy your money belongs to them. No suggestions of an alternative, like we can still honor your hosting for the other  domain you registered with us. Just, we're closing your account and the money is ours. ZAR 1800.00 might not sound like much at $120, but it's not small change in South Africa. It's great to be able to bombard the consumer with Start Now and Start for Free Buttons and other promises but then hide behind a puritanical Acceptable Use Policy and then use that Policy to justify stealing your customers money. Hypocrisy, I say! I am the only one who has been abused. But, I would imagine there have been many others. I would caution any foreigner to do business with companies in the USA. Furthermore, I would caution anyone considering a move to NameHero, not, to carefully read their Acceptable use Policy. Because if you contravene it however innocently they will gladly steal your money."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Cyril Malka",
          "Nb_Reviews": 8,
          "Date": "2021-06-18T05:21:54.000Z",
          "Titre": "Okay on shared but stay away from VPS - Unprofessional - support inexistent",
          "Contenu": "We took a web hosting at NameHero to check them out. And to be honest, they are okay. So we thought we would move our self hosted mailing list on their VPS.BIG MISTAKE!First, we asked their sells-department if it was okay to have self hosted mailing lists on their VPS: “Sure! No problems!” they answered.And we were stupid enough to believe them.Shortly after we started, all my accounts got closed because “I was spamming” (please note that all our mailing-lists — except the one where people buy a product delivered by mail — are double opt-in). Now, I had revived a 5 year old list, and I had 30 bounces, so I thought, “okay, that is understandable”.A few weeks later, one more time, all our mail blocked. “We are spamming”. No, we aren’t. We have self hosted mailing lists and we send mails, mind you.“Oh, right, sorry!”“Can you please do something so we don’t get in troubles again?”“Yeah, sure!”And then, yesterday, one more time: All mails blocked: “You are spamming!”No, we’re not! We are working! But this time, almost 24 hours later, our mails are still blocked, we’ve lost some hundred bucks, we tried to contact support again and again and the latest answer is “We are forwarding your ticket to Abuse department”-Well... we didn’t write any ticket. “Abuse department” was the one contacting us at first and then just got silent, letting us with no solution or anything. The clock is ticking, so are our dollars.Oh, and by the way, in another matter, their support was totally inefficient and unknowledgeable. I couldn’t send mail because it was blocked by Spamhaus. I contacted support who asked me random things, like “Send a mail with full headers”. Me: “How can I send you headers of a mail I can’t send? There must be a block somewhere on the server”. Support: “No, it’s your IP”. Me: “No it’s not, I can send mail from other accounts on same IP. It must be something on the server. I get block before it gets sent”. Support: “No, it’s your IP”.Result: After spending quite an amount of time searching: There is a switch on the server which set Spamhaus up. I deactivated it and it worked. It was something on the server but support didn’t know.All in all: Don’t go VPS on them, they might cost you a lot and support is amateur at best. Stay away from their VPS-solution."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Helder",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T14:39:04.000Z",
          "Titre": "NameHORROR",
          "Contenu": "NameHORRORThey will accept your account for 3 years. Then after a few (3/4) months they will attempt to cancel and give you 24h to move or backup. They will then keep the other 32 months of the hosting payment. But before they said they would refund you for the remainder of the time. If you are looking for unethical, cheap cheating hosting you found it.Be aware.EDIT 24/02/2021:Ryan the CEO on this response was tagged since the beginning of the request. He is only responding now when it's public. Now to you Ryan...you are telling half the truth Right? Let me clear this in public then.1- I was with you guys for a year. Mediocre to be be honest but was middly satisfied because I came from a ASP server and just changed to WordPress so it was okay.2- I established my website. Read: Always the same website, almost same content since the beginning of having a website.3- Renew date came and I took a good deal with you guys for 3 years paying the discount you offer only for first customers (This was a mistake, probably for you too, only that explains what follows).4. After about 3 months you say that this website that was always the same is in violation. Really?========Important========I now understand why you waited for 3 months to say it was. I also like how you changed your refund policy.I can see why you so bluntly say what you said. In what age are you in? It's PayPal's fault now? Love how you use \"hence\"! (pukes) Only the big guy to explain the big plan! =============5. Your Operations manager, Jamie, promised the prorated refund. 6. I waited for the 30 days for the refund. 7. Went back to see the status of the queue. MY ACCOUNT WAS COMPLETELY CLOSED. 8. I started to understand that what was documented in all the tickets was just a SCAM. Scam, trying to evade $380! Yes guys, they just kept $380 for their business lunches. UAU! 9- After another 2 days of requesting what's the status they opened the account do that I can access the tickets. YES, $380 to be able to access tickets. That meanwhile haven't been answered for 4 days! Finally, what do I need to say...​I don't want to do business with you guys Never again. Why are you keeping my money? Do you really need my $380? So I paid you for 36 months and you canceled the account with 30 months left? Really Ryan? Is your company so in need that you need to take peoples money. GIVE MY MONEY BACK!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Santos Salmeron  Salmeron",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T21:34:37.000Z",
          "Titre": "Website down"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Curtis",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T20:35:38.000Z",
          "Titre": "I need each group to have theirown…",
          "Contenu": "I need each group to have their own news feed. I can't have 25 groups, and all group chats are also on the main news feed!"
        },
        {
          "Note": 2,
          "Lieu": "MA",
          "Pseudo": "simo boujnah",
          "Nb_Reviews": 1,
          "Date": "2022-09-18T16:18:27.000Z",
          "Titre": "after website migration when i connect…",
          "Contenu": "after website migration when i connect my website with CDN's like quic cloud or cloudflare or bunny cdn some plugins dont work well like customer reviews for woocomerce and product feed pro for woocomerce i contact cdn supports they say your server makes alot of requests now im using my website without cdn and it's slower than my previous webhosting"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "david hall",
          "Nb_Reviews": 2,
          "Date": "2022-10-24T12:48:19.000Z",
          "Titre": "Same issue every time",
          "Contenu": "Same issue every time, support is not fast i have to wait and wait. Finally im out"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T21:33:23.000Z",
          "Titre": "Beware credit and refund policy",
          "Contenu": "Their support is very helpful, until you try to get a refund.  They find any reason to deny your refund.  They try to give you credit instead of a refund, even fi you were originally offered a refund.  They also will not give refunds after 30 days, even if you paid for a year of hosting, but want to leave after 3 months."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T06:38:40.000Z",
          "Titre": "The site is cool",
          "Contenu": "The site is cool, but for the amount of money I paid and the web template (hostiko) they suggested I use to setup my reseller business feels a little like a scam (someone was trying to make some bucks from affiliate marketing) for my money, because I still don't have my reseller site up and losing out daily on marketing for clients."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jure Jurcevic",
          "Nb_Reviews": 4,
          "Date": "2021-04-29T13:29:54.000Z",
          "Titre": "Forget about refund",
          "Contenu": "Forget about refund. I requested mine more than one month ago and they issued it one week ago. I contact my bank and they said they dont have any money from Name Hero. I am now in process of complaining against this company and i hope my bank is gona help me on my way. Stay away, or if you request refund just forget about it.Edit 1. Tnx for the replay Ryan, after i got money on my account i will update this review."
        },
        {
          "Note": 2,
          "Lieu": "BD",
          "Pseudo": "Musa Bin Hossain",
          "Nb_Reviews": 6,
          "Date": "2020-11-02T13:05:45.000Z",
          "Titre": "Over priced service!!!",
          "Contenu": "The support was great. But their price and re-source limitation will kill you. After 4 months I had to switch to another hosting provider who is also giving the same server, features, and extended resource at 200 times affordable price which saves me $1600 yearly for a single server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kyle Marvin",
          "Nb_Reviews": 1,
          "Date": "2020-01-26T21:16:28.000Z",
          "Titre": "I've been waiting 3 weeks for my…",
          "Contenu": "I've been waiting 3 weeks for my refund. There is a lack of communication (on their end) and no refund has been sent. Can't believe it takes this long for customer service to help. Bluehost.com customer service is 100x faster and more responsive.EDIT: 24 hours after posting this review, my refund was issued. It was $13 less than the amount that I paid for the service, and it is unclear why this was deducted. I added another star because I appreciate the response here. However, 31 days wait time and the fee required for a refund do not make for superior customer service."
        },
        {
          "Note": 2,
          "Lieu": "MA",
          "Pseudo": "Khalid Noursabah",
          "Nb_Reviews": 1,
          "Date": "2022-03-07T21:06:06.000Z",
          "Titre": "It seems that i must paying more Monet…",
          "Contenu": "It seems that i must paying more Monet ti star Building m'y website"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aijay D",
          "Nb_Reviews": 6,
          "Date": "2020-03-31T03:04:05.000Z",
          "Titre": "Stressful to use",
          "Contenu": "I got stressed out trying to make payment. To think this was based on recommendation..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Not for publication",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T16:12:11.000Z",
          "Titre": "Don't assume your customer knows what they're doing",
          "Contenu": "After 30 years of having Register.com hosting my Websites, I decided to change my hosting service when their call center moved completely to the Phillipines. One of my trusted associates recommended Name Hero since I would now be using WordPress for the first time to replace the dreaded Dreamweaver and orphaned Adobe Muse. When I moved my Web Hosting from Register.com to Name Hero, it seemed simple enough. But it was not evident to me that the transfer would move my email service by default to Name Hero. Five days later, my email was cut off by Register.com. It took the better part of two days to fix this, between calling Register.com (Web.com, Network Solutions) Trying to log on to Name Hero was not working because my email address was not recognized as valid. I did not see a customer service phone number on the Name Hero Website. Finally, Register.com customer service supervisor in Nova Scotia found the number and gave it to me. I called and gave the mx code and cName to your agent and my email was restored. 1. My bad for not understanding the email would switch by default and for missing the phone number, but your bad for not displaying it more prominent. 2. This type of problem is typically caused by lack of knowledge by the customer and lack of clear professional explanation by the service provider. Your CEO must know his stuff about your systems and services, but it's time he turned the blogging detail over to a professional communicator."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe W.",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T18:36:38.000Z",
          "Titre": "not the worst",
          "Contenu": "It works as expected, no issues with function.It didn't get a better rating because of the chat bots. when i have a question i like to get answers from a person not some ai bot that does not understand what i am asking. that's annoying as hell."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert Every",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T16:05:06.000Z",
          "Titre": "You originally said you'd transfer…",
          "Contenu": "You originally said you'd transfer domain manually, and it wasn't. You needed to be contacted a second time before it was done. In addition, the initial package is supposed to include domain transfer and you charged.Sincerely,Bob Every"
        },
        {
          "Note": 3,
          "Lieu": "LB",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T04:45:57.000Z",
          "Titre": "My website is slow although I didn't choose the cheapest option",
          "Contenu": "Honestly I didn't choose the cheapest service, but my website is Slower than expected! :("
        },
        {
          "Note": 3,
          "Lieu": "CR",
          "Pseudo": "Pablo Murillo - DADADA imagen",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T21:41:01.000Z",
          "Titre": "Inode/file amount limit",
          "Contenu": "In general, the service is fine, I just need to stress the importance of bumping up the limit of inodes/files allowed for each plan."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Henson",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T13:44:15.000Z",
          "Titre": "Honest review",
          "Contenu": "The site is not at all intuitive with getting a new domain to work properly.  There is no mention that you have to change your own nameservers and add a new domain in the C-panel.  I had to go back and forth with support just to get a new domain name set up.  I do not know if I will get another one here again - it is much easier at SiteGround."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rip",
          "Nb_Reviews": 2,
          "Date": "2020-08-25T22:43:48.000Z",
          "Titre": "So far the experience has not been as…",
          "Contenu": "So far the experience has not been as smooth as we had hoped or expected it to be. As with anywhere, there are some smart knowledgeable people and some, let’s be nice and say, not so smart support people. While so far the structure seems to be much better than where we came from, can we say iPower? 😆... the support level seems to fluctuate. We are hoping to have clear sailing in the future."
        },
        {
          "Note": 3,
          "Lieu": "ET",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T22:47:53.000Z",
          "Titre": "I dont understand why I had to confirm…",
          "Contenu": "I dont understand why I had to confirm my order suddently sometime later. My website get blocked and I get told its because I didnt respond to this email on time although my website domain was already up and running. That is not ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rotunstall",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T16:03:21.000Z",
          "Titre": "Setup Snafu",
          "Contenu": "Had/having problems with dns setup and ssl. Spoke with tech support but they seemed to be confused by the situation and was not able to really explain the matter."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "AOO MFANOS",
          "Nb_Reviews": 1,
          "Date": "2022-01-02T16:18:52.000Z",
          "Titre": "Email",
          "Contenu": "My is still to early since am learning the interface but am struggling to create emails."
        },
        {
          "Note": 3,
          "Lieu": "SE",
          "Pseudo": "Mats Oscarsson",
          "Nb_Reviews": 1,
          "Date": "2020-01-06T13:52:10.000Z",
          "Titre": "It´s my own inexperience that don't …",
          "Contenu": "It´s my own inexperience that don't  give it a higher rating.Confused newbie, you know"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Mayur Sandbhor Patil",
          "Nb_Reviews": 1,
          "Date": "2020-02-15T07:21:44.000Z",
          "Titre": "no real time service",
          "Contenu": "no real time service. poor informative content availability on social platforms/website"
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Kent Fatt",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T11:57:08.000Z",
          "Titre": "not bad sometimes it went wrong and had…",
          "Contenu": "not bad sometimes it went wrong and had to live chat to get surpport from them"
        },
        {
          "Note": 3,
          "Lieu": "MA",
          "Pseudo": "Amine Tijani",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T20:02:38.000Z",
          "Titre": "Well my website was down for no reason?"
        },
        {
          "Note": 3,
          "Lieu": "AL",
          "Pseudo": "Alder",
          "Nb_Reviews": 2,
          "Date": "2021-09-11T11:59:18.000Z",
          "Titre": "nice",
          "Contenu": "not bad but it could be better"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "bob",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T15:49:19.000Z",
          "Titre": "So far okay thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dillan Foht",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T15:18:06.000Z",
          "Titre": "unprofessional"
        },
        {
          "Note": 3,
          "Lieu": "EC",
          "Pseudo": "Tania Tamayo Mosquera",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T03:33:13.000Z",
          "Titre": "error dominio"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Harshil Gajjar",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T14:02:50.000Z",
          "Titre": "Could be better."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:22:19.000Z",
          "Titre": "I've been a customer for the epast 3…",
          "Contenu": "I've been a customer for the epast 3 years and recently i started having issues with one of my accounts. Poor customer service and constantly overselling me packages. At the moment I have purchased the business VPS hosting and they are still not able to properly configure it. The cpu hits its limit for the simplest of things. They blame it on different things adjust settings then tell the the settings that they have adjusted are wrong with the suggestion that i've done that. I get lots of php fatal-errors in my woocommerce journal and website is down 20 times per day. Every time they didn't knew what to do they told me to upgrade and was not the case. I am very upset on the poorly prepared customer support assistants. I lost money in the past 2 months since i am having this issues.If won't get proper support and configuration of the server i will definitely move my websites to another hosting provider.Edit: I am still having issues but at least i can see some improvement in the support system. Hope everything will be solved."
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Rich man",
          "Nb_Reviews": 3,
          "Date": "2023-09-28T10:05:38.000Z",
          "Titre": "Good service",
          "Contenu": "Hello. I'll start by saying that overall they provide good hosting services. The servers operate reliably, websites load quickly, and I don't have any significant complaints about the quality of the services provided. It would be great if they could reduce response times to customer inquiries."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Carlos Jimenez Las  Ps del Din",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:40:32.000Z",
          "Titre": "Quick answers when I have a doubt."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "William Skimming FringerBIZ",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T09:02:40.000Z",
          "Titre": "I never give 5 stars…",
          "Contenu": "I never give 5 stars until I fully test, trust, and experienced a company's services.In the case of NameHero, I did not give 5 stars because I am too scared they might actually be worth it and break my 'tested formula.' Four stars to me mean ...you are dammed good, responsive, and tolerant (as I do make some mistakes that get laced with false accusations)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Buehler",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T22:13:09.000Z",
          "Titre": "Ticketing Support",
          "Contenu": "I have used your services for personal use for a few years now and I have never had an issue with anything really. When I had to chat or submit a ticket, it was usually answered pretty fast and my issue was taken care of.I purchased KCDC 8GB Cloud VPS for the company I work for and I have had nothing but issues with tickets. It seems that the people who read the tickets do not actually read them all. I have had to have ip addresses whitelisted numerous times because when they said they did it, it was not actually whitelisted. It just seems to me that more recently the support team does not read the message and look into the issues fully. They send a short response and don't fix the issue. You then have to go back and fourth numerous times to have something fixed that should have taken a few minutes."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "dukazz kenya",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T19:22:59.000Z",
          "Titre": "My experience so far has been great",
          "Contenu": "My experience so far has been great, however I’m a little disappointed that my domain has been suspended currently because I did not do verification. I apologize, I have been traveling and didn’t get the time to see the email. Please assist. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ELLEN W",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T16:12:51.000Z",
          "Titre": "It wasn't great",
          "Contenu": "It wasn't great. I transferred domain name service from GoDaddy to NameHero. I found the online directions on GD to be confusing."
        },
        {
          "Note": 4,
          "Lieu": "CM",
          "Pseudo": "LAMI GODLOVE DIGITAL",
          "Nb_Reviews": 2,
          "Date": "2023-03-06T11:54:29.000Z",
          "Titre": "I think Name Hero is very affordable",
          "Contenu": "I think Name Hero is very affordable, secure and reliable... customer support too is doing a nice job."
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Molie",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T22:52:52.000Z",
          "Titre": "Responses are prompt",
          "Contenu": "Responses are prompt. Information provided by support team is useful, educative and very resourceful."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T18:35:53.000Z",
          "Titre": "Good website",
          "Contenu": "Good websiteEasy to accessBut the response can be faster"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elle",
          "Nb_Reviews": 1,
          "Date": "2022-06-26T16:32:00.000Z",
          "Titre": "2 Domains 1 Not Working",
          "Contenu": "My tech helped me thru a few processes and was able to get things working in a short time frame.  Thanks"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Peter  Tsai North River Devlop",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T03:54:22.000Z",
          "Titre": "The major functions are good",
          "Contenu": "The major functions are good. But the login and 2FA are not smooth to be used."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "ALI KHAN",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T13:02:28.000Z",
          "Titre": "I worked with name hero as affiliate…",
          "Contenu": "After 3 months, the release the payment"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T02:28:56.000Z",
          "Titre": "Good pricing and support service"
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "Dive Wiz",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T10:38:14.000Z",
          "Titre": "NameHero overall is a better choice than many other host companies",
          "Contenu": "NameHero overall is a better choice than many other host companies, especially if you are looking for a good overall yet affordable hosting service. Their customer service is super fast in picking up support tickets and replying to customers.However, not all support team members are at the same level of experience. Therefore, you might need to clearly explain the issue and then make sure they got it right. The good thing is that they are always replying and very patient with clients.Thanks to all support team members, and special thanks to Arun Paul."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miss Eva Lim",
          "Nb_Reviews": 3,
          "Date": "2021-04-24T10:56:05.000Z",
          "Titre": "Just moved over from Siteground",
          "Contenu": "Just moved over from Siteground. Overall great and fast support, love the simple classy interface of the backend and my websites seem to load faster!Leaving 4 stars because I had to renew my old hosting plan for a month in order to retrieve a database. If you need to migrate over a sub-domain, make sure you mention it! Otherwise, the tech support and migration team have managed to resolve all my issues well."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Lore",
          "Nb_Reviews": 16,
          "Date": "2020-03-07T14:38:14.000Z",
          "Titre": "Excellent customer support (the reason…",
          "Contenu": "Excellent customer support (the reason why I will renew the service), good general service. They still have a room of improvement because some services they offer are too expensive (e.g. website migrations, poor promo code, etc.), but they are so much better than other webhosting providers. And again their customer support reply faster than their competitors."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rhett Mack",
          "Nb_Reviews": 1,
          "Date": "2020-10-03T21:48:51.000Z",
          "Titre": "Generally Good",
          "Contenu": "Generally, support has been good via chat. Sometimes boilerplate answers when I have provided good explanation. Get feeling operators are running a number of chats concurrently and ask questions I have already answered above. Sometimes have feeling I am chatting into space. Providing docs related to questions is good."
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Kim Mwaus",
          "Nb_Reviews": 1,
          "Date": "2019-10-24T09:58:14.000Z",
          "Titre": "Awesome experience.",
          "Contenu": "I loved the way even when you have no clue on what step to take, they are there to guide you all the way till you have everything set up. At first i thought it was a bit expensive but when i got to use their product, it was quite amazed at how fast it was and the kind of customer care i got. You guys are awesome."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Christie",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T06:58:41.000Z",
          "Titre": "Overall good customer service",
          "Contenu": "Although my first experience with their customer service was a frustrating experience, afterward multiple customer service reps reached out to me to answer my initial questions and were polite and helpful. This helped to alleviate any initial concerns about switching to Namehero."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "LittleOceanUK",
          "Nb_Reviews": 1,
          "Date": "2020-01-20T19:03:25.000Z",
          "Titre": "been a customer for a few weeks great so far!",
          "Contenu": "been a customer for a few weeks now,  so far support has been amazing,  sales too,  moving my accounts for me making sure it’s all workign on the new sever and promptly replying to all requests,  and there has been many!  they have exceeded my expectations so far and have saved me money already :-)"
        },
        {
          "Note": 4,
          "Lieu": "KE",
          "Pseudo": "Mostar Kipkirui",
          "Nb_Reviews": 1,
          "Date": "2021-11-17T06:45:30.000Z",
          "Titre": "Iam very happy with your support.cheers…",
          "Contenu": "Iam very happy with your support.cheers to all namehero staff more so Ryan Gray for your fabolous work.Namehero is my personal favourite.I keep encouraging my fellow designers in Kenya to use Namehero.cheers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca Lake",
          "Nb_Reviews": 1,
          "Date": "2022-02-13T21:24:44.000Z",
          "Titre": "Tech support is always responsive and…",
          "Contenu": "Tech support is always responsive and helpful. They were not able to solve my most recent issue (I figured it out myself) but I appreciate the effort made to help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Wells",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T14:12:09.000Z",
          "Titre": "I now have it operating with your…",
          "Contenu": "I now have it operating with your support teams. Thanks for quick responses. The Darrel Wilson tutorial implies that this is a simple process. Not really. I’m in IT and have a basic understanding of cpanel and a lot of experience with wordpress. I can’t beleive you don’t have a small prequalifing survey so people don’t get in over their head, lose money, and get de-morilized.I have no regrets for this venture and I’m confident I’ll succeed. But with so many gurus out there showing “ how easy” this is, I can” t imagine how many fails there are.Your support team is great.Another thing is that for the time and money people are putting into this there is no instruction on how we are supposed to do support 24/7. In our free time we can forward questins to your team but what happens to our customers when we are working or sleeping. Still not 100% sure about this part."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yemariam Kebede",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T17:32:24.000Z",
          "Titre": "all new to me still trying to learn"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "isaac feldman",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T15:35:11.000Z",
          "Titre": "good price great support"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Gerald Egbuna",
          "Nb_Reviews": 12,
          "Date": "2023-02-28T21:15:07.000Z",
          "Titre": "Fast loading of the pages and setups"
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Vítor Francisco",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T16:10:13.000Z",
          "Titre": "Good",
          "Contenu": "Had some misunderstandings with them in the beginning but it has been perfectly fixed so that's why I gave them 4 stars :)"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Zoom Ayman",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T15:01:18.000Z",
          "Titre": "Very good hosting server But you need…",
          "Contenu": "Very good hosting server But you need to be more faster The page loading time is 2.45 second and I hope to be 1.5 second"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carlos Arceo",
          "Nb_Reviews": 1,
          "Date": "2021-07-28T19:15:33.000Z",
          "Titre": "Athul was very helpful.",
          "Contenu": "Athul was very helpful in guiding me through the issue I was having with a new addon domain."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Meilinda Dsouza",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T11:02:02.000Z",
          "Titre": "The team is very helpful",
          "Contenu": "The team is very helpful, however, it was a bit slower than I expected. Otherwise 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Gagliardi",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:33:44.000Z",
          "Titre": "Smart. Timely.",
          "Contenu": "Smart. Timely. Saved me time."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Adnan Shaji",
          "Nb_Reviews": 1,
          "Date": "2021-08-12T19:15:24.000Z",
          "Titre": "Name Hero, Make us wonder their service",
          "Contenu": "i think your service is good and capable. i like your fast reply system"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Daulitech IT Solutions",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T15:13:15.000Z",
          "Titre": "Order received assistance provided when…",
          "Contenu": "Order received and assistance provided when I needed it. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "AL",
          "Pseudo": "Alder",
          "Nb_Reviews": 2,
          "Date": "2021-08-16T20:29:05.000Z",
          "Titre": "I like your service",
          "Contenu": "I like your service. but i would like better customer service"
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Steve M",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T08:48:27.000Z",
          "Titre": "Good and user friendly"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "boomer bucketlister",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T02:36:01.000Z",
          "Titre": "Not as fast as I was hoping for but…",
          "Contenu": "Not as fast as I was hoping for but overall i'm satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2020-02-28T16:21:22.000Z",
          "Titre": "Love the speed",
          "Contenu": "Love the speed, reliability and the great customer service."
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Abass",
          "Nb_Reviews": 4,
          "Date": "2021-07-03T09:58:52.000Z",
          "Titre": "Good experience",
          "Contenu": "Good experience. Had all the cooperation and help"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Satsiri Winberg",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T08:16:57.000Z",
          "Titre": "Servers are fast - Support is next level amazing!",
          "Contenu": "Servers are fast. Support is next level amazing. Seriously, the best service I have had from a host. I like the backend admin.Room for improvement? Yes. The INODES for \"unlimited\" packages is slightly misleading for un-technical customers like myself. For example: I have purchased the 3 year turbo cloud and it has a hefty 500 000 INODES limit (I discovered after the fact as its not listed in the main price table). I am moving around 20 Wordpress sites to my turbo cloud and over the next 3 years I will likely ad another 10-20.So all in all I might have around 40 Wordpress sites. Now yes that is a lot of Wordpress sites, but it is no where near \"unlimited\". They are all real sites for real clients, no networks, no spam sites. I currently have 13 installed and my INODES usage is already at 100 000. At this rate I will be at 400 000 with Wordpress installs and thats excluding any new posts, new pages, more media uploads, additional plugins etc to all these sites. So I will likely have to pay for an upgrade defeating the savings I wanted to make from moving from my current host to NameHero.So practically for Wordpress this is far from unlimited and for me quite disappointing as I was hoping to be able to use this account for the next 3 years as I paid upfront for it.I understand it's some kind of fair use policy from NameHero's side but unless you understand INODES the \"unlimited websites\" is extremely misleading and far from unlimited.What it should say is. *For Wordpress sites you can have around 40 smaller sites or at a push 10-20 larger sites after that you will have to upgrade to biz cloud or other server. (Which I would have done by the way if I had known).All this said, if not for the INODES I would have given NameHero 5 Stars, as for the price and even compared to more expensive premium WP hosts, the speeds and service are not short of amazing. I highly recommend NameHero as long as you understand INODES."
        },
        {
          "Note": 4,
          "Lieu": "UG",
          "Pseudo": "Omaria Bosco",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T19:21:07.000Z",
          "Titre": "Good service and timely response"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Joao",
          "Nb_Reviews": 3,
          "Date": "2023-03-09T12:10:19.000Z",
          "Titre": "Great hosting infrastructure."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Cook III",
          "Nb_Reviews": 2,
          "Date": "2020-09-28T13:39:30.000Z",
          "Titre": "good",
          "Contenu": "good site for hosting & support"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Lashari",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T15:46:41.000Z",
          "Titre": "Good",
          "Contenu": "nice to have a good server"
        },
        {
          "Note": 4,
          "Lieu": "RS",
          "Pseudo": "Igor Igac",
          "Nb_Reviews": 4,
          "Date": "2021-03-24T01:54:09.000Z",
          "Titre": "Great services",
          "Contenu": "Great services! Free WHMCS"
        },
        {
          "Note": 4,
          "Lieu": "KR",
          "Pseudo": "Hye Jin",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T13:36:16.000Z",
          "Titre": "Yes I received my order"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Ajayi Folasanmi George",
          "Nb_Reviews": 2,
          "Date": "2022-05-03T10:09:52.000Z",
          "Titre": "Very easy to buy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Gugliotto",
          "Nb_Reviews": 1,
          "Date": "2022-03-17T13:17:38.000Z",
          "Titre": "Awesome services!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2019-12-28T02:42:21.000Z",
          "Titre": "Good",
          "Contenu": "Good web host!"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Sphiwe",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T19:13:32.000Z",
          "Titre": "Good products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:21:53.000Z",
          "Titre": "James Hart is AWESOME!",
          "Contenu": "HI Ryan, James got my emails all working perfectly again. My husband and I have been with Stormer Hosting since 1997 and James has always been great at keeping our tech working. This isn't the first time a migration didn't go smoothly but, once again, James got me through and I am SO grateful, and for GoToAssist remote technology. Everything needed to be reset, including the ports, as it turns out, which was beyond my knowledge to do. I look forward to enjoying my experience with NameHero. Thank you! Merry Christmas/Happy Holidays"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Howard Olsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:34:34.000Z",
          "Titre": "Responsive Is What You Want - Responsive Is What You Get!",
          "Contenu": "Your support team is great.  Even though it is all done by ticket, text and email - The Name Hero Support Team is fast friendly and effective and quick to escalate when necessary."
        },
        {
          "Note": 5,
          "Lieu": "SZ",
          "Pseudo": "Tawanda Joseph Mutsena",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:29:15.000Z",
          "Titre": "I love the service",
          "Contenu": "I love the service, the responsiveness, and how I can go on and on and on working without even needing them. Namehero offers so many more resources that work. It comes with amazing customer care."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynda",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T00:06:55.000Z",
          "Titre": "It's awesome to find a tech team that…",
          "Contenu": "It's awesome to find a tech team that is entirely via email-and yet even BETTER than other companies that offer a phone option. Responses are consistently quick, professional, and reflect a high level of skill. I've never had anything but impressive support. They also will generously implement fixes for you if you're not technical. They often will go above and beyond what you might think they're required to do. I'm so thankful for them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "C.W",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T16:24:23.000Z",
          "Titre": "All went well",
          "Contenu": "All went well, very smooth and easy to follow throughout."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Kostas",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T09:43:51.000Z",
          "Titre": "My experience with NameHero so far..",
          "Contenu": "My experience with NameHero is much better than I expected!!!!!Regarding the speed of the websites, they load in ms what else to ask!!!!!Their support is immediate, kind and helpful!Website migration:Was very fast with no downtime."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Blanche K",
          "Nb_Reviews": 5,
          "Date": "2023-11-25T05:37:28.000Z",
          "Titre": "Namehero - The best hosting provider + customer service",
          "Contenu": "I joined Namehero about 2 years ago and while exploring it as a hosting option, I experienced top-notch customer service: speedy, professional, cordial, polite, and patient. The team at Namehero has always ALWAYS made me feel valued as a customer. Because of these experiences, I have now finished transferring all my domains from GoDaddy and 101 domains to Namehero. I'm not trashing my former hosting providers in any way... it's just that the Namehero experience is truly unmatched when it comes to customer service!! I now call Namehero my online home, and I have over 400 domains hosted in one place. I highly recommend Namehero to anyone looking for a reliable web hosting provider with excellent customer service : )"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "MOHAMED YASSER",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T00:52:53.000Z",
          "Titre": "The fastest hosting I have ever used",
          "Contenu": "The fastest hosting I have ever used, excellent support, has a solution to all problems, and the response speed is insane"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Victor  Banderas GLM",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:05:55.000Z",
          "Titre": "The greatest customer service I have ever experienced",
          "Contenu": "It's a great hosting company, but what really set them apart is the awesome customer service, every time I have a problem they Always (with capital A) deliver, so I very happy with them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina King Academic",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:45:01.000Z",
          "Titre": "Outstanding tech support",
          "Contenu": "The tech support has always worked out all my issues. Very knowledgeable, kind and patient. Shout out to Kankappa, who just today solved lots of mysteries for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danny Swanger CDK Enterprises",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T21:27:16.000Z",
          "Titre": "I like these guys",
          "Contenu": "Provides a good service at competitive price. Tutorials that clearly explain what to do and how to do it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WLP",
          "Nb_Reviews": 13,
          "Date": "2023-10-05T05:01:02.000Z",
          "Titre": "I just finished with a support ticket…",
          "Contenu": "I just finished with a support ticket and was very happy with the level of support I received. The most helpful individual was Abhilash R., who went out of his way to assist me even though it was late in the evening. He was patient, kind and very detailed oriented, and gave me tons of useful information. Thank you Abhilash R., for your most valuable support. The following day, this ticket was still open with some additional things I needed assistance with and both Kankappa Mukanawar and Anna S, were very helpful and efficient as well. Thanks to both of you for your top-notch service! The folks at NameHero are always on the ball and always willing to help."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kevin Gray",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T22:39:41.000Z",
          "Titre": "Excellent Support fro Kankappa!",
          "Contenu": "A support agent named Kankappa from India helped me via chat with two issues. The first was pointing my Domain properly after being transferred to Namehero away from WIX and the other, making sure my email was working properly. He helped in record time, was friendly, knowledgeable and just a pleasure to work with, Kankappa - you deserve the recognition! Kevin"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Denson",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:43:13.000Z",
          "Titre": "Best Reseller Hosting",
          "Contenu": "NameHero has always made me feel valued and important. Their customer support is top notch and they are very good at resolving issues in a timely matter plus communicating with me along the way.  My website and my customers sites run fast and clean. I appreciate the fact that I can offer Free and Auto SSL certification and nightly backups to my customers. The nightly backups are a great feature and have saved me some headaches. I am very happy with my choice to partner with NameHero for my website and reseller hosting plan."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Roantree",
          "Nb_Reviews": 28,
          "Date": "2023-08-13T14:52:49.000Z",
          "Titre": "Superb tech support",
          "Contenu": "I've had a few glitches transferring my site from another host, plus then getting it restored from the backup.The support (live chat) I've received from NameHero has been absolutely exemplary.I'm terrible with technology but I've been walked though everything by their tech assistants with incredible patience and clarity, so question has been too stupid or obvious.I'm really impressed with them, highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Emanuel Rebleanu",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T19:25:31.000Z",
          "Titre": "A bit pricey but reliable",
          "Contenu": "A bit pricey but reliable, I recommend Name Hero!They also offer fast support, but most important professional support, they know what they are doing."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Anne Cabriana-Hedwig",
          "Nb_Reviews": 6,
          "Date": "2023-10-31T21:50:45.000Z",
          "Titre": "NameHero support is superb",
          "Contenu": "NameHero support is superb! Their availability, technical knowledge, willingness to help, and professionalism to solve issues are top-notch. Credit to all the support team especially to Abhilash. I have been a happy client of NameHero since I decided to transfer with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael O'dlee",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T05:37:10.000Z",
          "Titre": "The best hosing company ever.",
          "Contenu": "I have been using many different hosting companies. I make like 50–60 websites for my clients every year. Server stability is one of my top priorities. When I am with NameHero. Their support team is on point. They will help me anytime, in real-time. Oh, also their server is so fast. and they will help you with Security, Migration. I don't know all the support you can imagine !! I love NameHero soooo much !"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Hopscotch",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T18:21:45.000Z",
          "Titre": "Excellent Tech Support and cPanel features",
          "Contenu": "I have been with them a few months now and after a few glitches at the start, it has been an excellent experience ever since. The 7 days a week tech support has been a lifesaver. Especially the tech support lad Kankappa I just dealt with was brilliant. He was quite patient with me and solved my own self induced issue within moments. Also my websites achieve the best speed scores with their Litespeed Servers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eye Appeal Design",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T20:58:33.000Z",
          "Titre": "Love the security and the tech support…",
          "Contenu": "Love the security and the tech support chat and phone is awesome! I am in the process of moving all my site from hostgator to namehero weeeeeeeeeeeeee! Love love love the security.. my other /old host would not help with security all they did was ask me to contact a 3rd party company (site lock) to insure my website was secure lol Nope .. loveing NameHero"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beau",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:06:48.000Z",
          "Titre": "Easy to Use",
          "Contenu": "Easy to Use, Great Customer Service!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Staff Gourmet Noir",
          "Nb_Reviews": 8,
          "Date": "2023-06-05T02:51:45.000Z",
          "Titre": "Namehero does everything very well and…",
          "Contenu": "Namehero does everything very well and it is certainly top-notch.Great attention to detail, cares about the customer and it even offers you great discounts while being their client.Well explained and straight forward help videos and configs as well as excellent performance, technical service, knowledge and support.What else can you ask for?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seth Stairs, ReadyAppraise",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T18:37:32.000Z",
          "Titre": "We have NEVER had a negative issue with…",
          "Contenu": "We have NEVER had a negative issue with NameHero. I had 2 self inflected email issues which NameHero staff quickly resolved for me.  Their hosting service is fast, extremely reliable and they are just good folks to do business with.  Refreshing switch from GO you know what."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trina G.",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T02:14:18.000Z",
          "Titre": "5 Stars everytime",
          "Contenu": "I am a self taught newbie to website set up. Your customer service has been so helpful and patient. They are top notch and you should all be very proud of them. It was also important to me to find a US based hosting company. Your pricing was also very affordable. I purchased a three year plan, I hope the renewal price will be reasonable to. I recommend you to anyone who is looking for a hosting company."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Nazeer",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T08:57:18.000Z",
          "Titre": "Great products and services",
          "Contenu": "Great products and services. Offering Hosting and Email solutions that are easy to use, reliable and affordable. Definitely will continue using them for my own needs as well as my clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ABRing",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T19:24:21.000Z",
          "Titre": "The Team at NameHero are Wizards",
          "Contenu": "The team at NameHero are wizards! Sajay walked me through changing the primary domain on my account and many other tasks that puzzled me. I wish other companies had the same level of support as NameHero. This service is truly on another level."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rajesh Gorrela",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T21:04:11.000Z",
          "Titre": "I have been using Name Hero services… Amazing support team.",
          "Contenu": "I have been using Name Hero services for over a year now and I am extremely satisfied with their service. Their support team is amazing and always available to help me with any issues I have. They are knowledgeable, friendly, and always go above and beyond to ensure that my website is running smoothly. I highly recommend Name Hero to anyone looking for a reliable hosting service with excellent support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abe",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T23:36:06.000Z",
          "Titre": "Amazing fast site and great customer service",
          "Contenu": "Amazing customer Service Sajay is a good employee I hope you guys get people like him to help you with your issues. They have simple easy platform to use. websites load fast and they are just amazing overall highly recommend it for anyone looking to host a website."
        },
        {
          "Note": 5,
          "Lieu": "MU",
          "Pseudo": "Zubair Tofy",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T08:18:26.000Z",
          "Titre": "Great Service & Support",
          "Contenu": "Great Service, Great support. Became pricy after we were forced upon by a price change have , but you always get some kind of discounts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AFUWAPE LORENA",
          "Nb_Reviews": 2,
          "Date": "2023-08-15T04:56:35.000Z",
          "Titre": "Amazing Hosting, Domain and customer management.....",
          "Contenu": "We have a lot of beautiful hosting and domain provider out there and to be candid namehero can only do so much to standout, when it comes to the actual service.But do you know why they tick every box for me and I would recommend them to you guy?They have a beautiful team and when I say beautiful, I mean exceptional team.Working with namehero slashed my development budget in half because they handle things I would have paid for if I was flying solo.They are a blessing to me and I know they would do justice to your needs if you choose them. Trust me."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Berkeley Sang",
          "Nb_Reviews": 2,
          "Date": "2023-07-30T02:56:53.000Z",
          "Titre": "Cusomer services very professional and…",
          "Contenu": "Cusomer services very professional and supportly. Particularly very kind and patiencely to answer all questions for cusomers. I believe nam hero is the best web hosting for cusomer, this is why I move from site ground to name hero."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LYNDA SCOTT",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T18:22:40.000Z",
          "Titre": "NameHero provides top notch customer…",
          "Contenu": "NameHero provides top notch customer service. It's all by email, but it's so good, fast and responsive that I don't even miss phone support. And they really know their stuff. Issues are usually resolved very quickly. Friendly and generous in their support, I've even had them help with errors related to my page-builder. I'm not saying they won't kindly refer you to the correct vendor when appropriate, but they're willing to recommend or try a thing or two within their scope of knowledge before making you start over with another support department (and it usually works). Their User Account interface is easy to negotiate, as well. Very happy with Name Hero!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Mauch",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T08:34:02.000Z",
          "Titre": "I am new to Namehero hosting and needed…",
          "Contenu": "I am new to Namehero hosting and needed assistance in migrating my two sites over. The migration was done the same evening I opened a support ticket.  Much quicker than I expected.  It was a seamless transfer with no issues experienced.  I did set up myself the LiteSpeed Cache plugin.  Then I set up the complimentary QUIC.cloud CDN.  I decided to test the site speed with GTmetrix and achieved my best score ever: a big green capital A with excellent web vitals.  Today it is 10 days later and I ran the GTmetrix speed test again.  The results are still a straight A, but the performance score increased to 100%.  I have 102 published pages on my site and I never saw speeds this fast with my previous two hosting providers.  So far my experience with Namehero has been excellent and I do recommend it for hosting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAK LING",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T03:29:44.000Z",
          "Titre": "highly recommended",
          "Contenu": "very fast hosting. good pricing. many extra stuff other companies would charge for are included in the price. very good support, and much information is available from their YouTube channel. highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Bryan Foo Jin Kiat",
          "Nb_Reviews": 4,
          "Date": "2023-08-08T18:09:14.000Z",
          "Titre": "Great NameHero Support Staff Amith",
          "Contenu": "Amith was very helpful in supporting my issue. In fact, I have no doubt about NameHero support staff as they always gave me great support since the day 1 I started to use the NameHero service. Thank you Amith for resolving my website issue."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "DestructiveBurn",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T21:47:11.000Z",
          "Titre": "Love Namehero, and I wish them the best of luck going forward.",
          "Contenu": "Pros1. The service is fast.2. The support is fantastic.3. The price is reasonable.ConsReally not muchI have been with Namehero since May 5, 2020.  I've seen the service have issues but not that much within a couple of years mark.  If it does there on it within minutes.I am super happy, so long as the price stays reasonable I have no reason to look for alternatives leaving me as a permanent customer.I am always recommending Namehero in Facebook groups asking for hosts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terreal Brown Weavers Circle",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T22:08:45.000Z",
          "Titre": "Glad I left DreamHost",
          "Contenu": "I left DreamHost because their hosting service speed is slow & inconsistent. When I reached out for assistance they were unhelpful.I’ve placed a couple tickets with you all and the experience has already far surpassed my previous hosting. Only thing keeping this from being a 6 out of 5 are the slow speeds I’m experiencing on mobile devices."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tadas",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T22:12:26.000Z",
          "Titre": "Issue has been resolved to the highest standard",
          "Contenu": "I wanted to take a moment to express my sincere gratitude for the exceptional support Ryan Gray provided me with recently. His quick response and diligent efforts in resolving my issue were truly impressive and greatly appreciated.What stood out to me was how he went the extra mile and provided me with compensation for the experienced downtime. I did not expect that.I don't encounter such outstanding customer service every day, and I just wanted to take a moment to say thank you. Your efforts have given me confidence in the quality of service provided by NameHero.Thank you once again for all your help. I look forward to continuing to work with you in the future.Regards,Tadas"
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "marcoolinho",
          "Nb_Reviews": 2,
          "Date": "2023-05-09T14:57:44.000Z",
          "Titre": "Anju P gave me a great deal with web…",
          "Contenu": "Anju P gave me a great deal with web hosting, long term wise. Communication was clear and fast. He was up to date with all my purchases from before and took everything into account when forming his offer. I am greatfull and commend him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brigid Kaye",
          "Nb_Reviews": 3,
          "Date": "2023-07-23T18:53:13.000Z",
          "Titre": "Sayjay was incredibly helpful today",
          "Contenu": "Sayjay was incredibly helpful today. He explained the issues, told me how to fix it with screenshots (awesome!) and helped me increase file upload size for one client. Thank you so much for your time and help with these 2 situations!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T00:55:04.000Z",
          "Titre": "No reason to choose another company",
          "Contenu": "Name Hero is the second hosting service I have used while learning to create websites. The ease of set up with so many resources is brilliant, my site is incredibly fast thanks to the LiteSpeed integration. Support is second to none, fast, patient and helpful. Abhilash has helped me a couple of times and it is always everything you need from support staff. I will always recommend Name Hero to people."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Henry Ong CEO/Founder",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T01:01:21.000Z",
          "Titre": "One of the best decision I've ever made!",
          "Contenu": "Choosing this web hosting service has been one of the best decisions I've ever made. The performance, support, and reliability have truly exceeded my expectations. I highly recommend it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Omosa Macrolan Technol",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T13:44:24.000Z",
          "Titre": "Effective services",
          "Contenu": "Extremely reliable and standard services. Your customer support team responds to concerns with understanding and gives room for the customer to provide feedback on the same."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T19:58:29.000Z",
          "Titre": "Everything down...but Namehero is UP!",
          "Contenu": "On an upgrade everything went down for me, but Thara in support stayed on the line with me until we got everything working again. Really appreciate the support from this reseller company. Top notch."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Bryan Foo Jin Kiat",
          "Nb_Reviews": 4,
          "Date": "2023-06-06T06:26:53.000Z",
          "Titre": "Abhilash is a great support staff",
          "Contenu": "Abhilash is a great support staff. His skills and understanding of the web hosting system are amazing. All my issues were resolved by him in a very quick manner. That's the reason why I like to use NameHero web hosting service not because of the hosting plan, is because of the great support. Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Warda",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T18:16:45.000Z",
          "Titre": "For a newbie",
          "Contenu": "For a newbie, anytime I need support, they are on it, patient and informative. More importantly they go ahead and take care of it themselves rather then send me of to figure it out on my own."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Gairy J",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T04:22:57.000Z",
          "Titre": "Awesome Tech Support!",
          "Contenu": "Just about all my tech support needs are handled very well by the support team. Today, Athul was amazing at diagnosing and solving my Wordpress challenges. It's always a pleasure corresponding with the Team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BR",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T17:09:58.000Z",
          "Titre": "Outstanding Help Desk Support for WordPress, Backup, and Restore",
          "Contenu": "I recently encountered a significant issue after transitioning from the \"Backups/Backup Wizard cPanel feature\" to \"Jetbackup5 restore/backup\" with my hosting service. I was completely lost and didn't know where to turn for help.Fortunately, the hosting company's help desk team came to the rescue in a way that truly exceeded my expectations. From the moment I reached out for assistance, they were responsive, patient, and incredibly knowledgeable. Their support went beyond the standard level of service, and I couldn't be happier with the outcome.In a world where customer support experiences can vary greatly, this hosting company's help desk team stands out as a shining example of exceptional service. They turned what seemed like a daunting challenge into a smooth process.I'm truly grateful for their assistance, and I have complete confidence in the hosting company's support services. They've earned my trust, and I highly recommend them to anyone in need of hosting services backed by outstanding help desk support.Thank you to the incredible team at Name Hero!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom L",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T21:06:47.000Z",
          "Titre": "Years of exceptional servce",
          "Contenu": "I have been using NameHero hosting for several years. Their service and customer support are top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Xzendor",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T07:05:07.000Z",
          "Titre": "Namehero Is The Best Hosting Provider",
          "Contenu": "Namehero is the best hosting provider I've used since using hosting services for about 20 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carter Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T07:13:02.000Z",
          "Titre": "I can't articulate how good the…",
          "Contenu": "I can't articulate how good the NameHero support is. I was helped most recently by  Abhilash R. | Level III Support and my issue was resolved promptly, without any further questions for me. It blows me away every time. Please never change lol!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lynda",
          "Nb_Reviews": 2,
          "Date": "2023-05-17T02:34:02.000Z",
          "Titre": "Their free email technical support is…",
          "Contenu": "Their free email technical support is better than paid support I've seen elsewhere. You won't miss phone support. They're very responsive. Super talented techs. I just transferred 2 domains & hosting from GoDaddy to NameHero. Site migration process was effortless (they handled it all), speedy, and everything migrated perfectly.After one of the sites was transferred, I tested it in GTMetrix. It rated 100% A. I know a lot of that can be about how it's built, but I also know it wasn't 100% before. It loaded the homepage much faster (from 1-1.5 seconds to maybe 1/16th of a second? Almost up the same moment I clicked on it Lol. Thank you, NameHero!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Palmer",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T04:59:17.000Z",
          "Titre": "Anna from NameHero provided outstanding…",
          "Contenu": "Anna from NameHero provided outstanding support. Instead of taking the usual route of creating a support ticket, she patiently guided me step-by-step to restore my website to the previous night's backup. I was even able to download our chat for future reference. NameHero consistently delivers excellent service, and Anna is truly exceptional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Y.",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T17:02:50.000Z",
          "Titre": "Great Website Hosting and Customer Service!",
          "Contenu": "I've been slowly transferring all my domains to NameHero. They have been a tremendous help through every step. Support is quick to respond and very knowledgeable. So far the best experience I have had with website hosting providers that I have had."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Bryan Foo Jin Kiat",
          "Nb_Reviews": 4,
          "Date": "2023-06-13T10:04:46.000Z",
          "Titre": "Good Job Rose! Thanks for the help!",
          "Contenu": "Rose did a very good job by assisting me with my website WHMCS update issue. It took me a very long time to try to trace the issue. With the help from Rose, the issue was resolved in no time. Thank you very much Rose for providing such excellent support to your client and that's the reason why I always stick to NameHero."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shadi Dandan",
          "Nb_Reviews": 2,
          "Date": "2023-08-06T18:49:00.000Z",
          "Titre": "Kankappa was great to work with",
          "Contenu": "I have to be honest. I'm a Newb when it comes to building websites & domains/hosting. Still trying to learn all of it. I got on a chat with Kankappa & he was so patient, and understanding & really helped me along the way. I'm very greatfull at this kind of customer service. I'm really glad I chose Namehero for my hosting/domain needs. This is a really great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenny Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T18:15:18.000Z",
          "Titre": "The customer service team was prompt…",
          "Contenu": "The customer service team was prompt and clear on what they needed to resolve an issue, which was on my end and not their software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Gillespie",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T18:22:29.000Z",
          "Titre": "Ashitha solved two site issues quickly",
          "Contenu": "Ashitha solved two site issues quickly, one a SQL warning and one deprecation warning. Expert, friendly, and painless interaction! Couldn't be more pleased with the help."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Wolf Reigns",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T08:43:26.000Z",
          "Titre": "Abhilash was excellent and patient on…",
          "Contenu": "Abhilash was excellent and patient on Live chat and I've decided that they just got themselves a new client with their excellent service, empathy and professionalism. I am very happy so far. Thanks NameHero!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Capital A",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T21:48:26.000Z",
          "Titre": "Knowledgeable Staff",
          "Contenu": "Sajay and all of the staff I've spoken with before, in the past, were knowledgeable of the issues I've faced with my website and helped find a solution in a reasonable amount of time. I am pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NJ Web Consultant",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T21:02:20.000Z",
          "Titre": "Fast Solid Support",
          "Contenu": "Every time I need support which is not all that often your staff is knowledgably and friendly and the task is solved quickly.  Simply, what more can one ask for!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dimitri Zubrich",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T06:08:12.000Z",
          "Titre": "The customer service here is awesome",
          "Contenu": "The customer service here is awesome! They are fast to respond and fix all your issues right away, even at night  on a holiday weekend. Unbelievable! Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Baker",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T23:36:24.000Z",
          "Titre": "I'm a new customer and waiting to get…",
          "Contenu": "I'm a new customer and waiting to get my accounts all set up but so far the support has been very responsive and helpful. I'm hoping this will be a great business experience for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian D.",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:13:28.000Z",
          "Titre": "Reliable for 2 years so far",
          "Contenu": "Reliable for 2 years so far.  Quick and satisfying responses to technical & billing questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg A Hyatt",
          "Nb_Reviews": 2,
          "Date": "2023-06-03T17:21:33.000Z",
          "Titre": "The entire support team at NameHero has…",
          "Contenu": "The entire support team at NameHero has always went above and beyond my expectations. If you’re looking to partner with the best in Re-Seller hosting packages, I dare you to find a better option than NameHero."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Niklas B.",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T00:26:24.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I just switched to NameHero from Bluehost. The difference is night and day. At NameHero I get answers from support and things get permanently fixed. I couldn’t be happier with the switch."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Derek Seath",
          "Nb_Reviews": 3,
          "Date": "2023-05-29T23:55:08.000Z",
          "Titre": "Rose at technical support was brilliant…",
          "Contenu": "Rose at technical support was brilliant in helping me sort out my problem quickly and professionally - even though it wasn't a server or hosting issue she went above and beyond in trying to help me diagnose the issues I had.Brilliant first-class support - well done guys:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Green",
          "Nb_Reviews": 5,
          "Date": "2023-07-08T00:11:14.000Z",
          "Titre": "Customer service is great",
          "Contenu": "Customer service is great. I asked what most would consider a silly question, they answered me quickly, no negative attitude. They were great!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "kashif gooden",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T11:47:17.000Z",
          "Titre": "Honestly the best service ever",
          "Contenu": "Honestly the best service ever! I'm a beginner and have ran into so many problems I didn't understand, but Namehero has helped me through every part."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Abdirizak Isak",
          "Nb_Reviews": 2,
          "Date": "2023-06-29T03:22:03.000Z",
          "Titre": "Very Satisfied Customer",
          "Contenu": "This is honestly a customer service on a different level, support ensured that I was satisfied, and my technical problems were resolved. Shout out to Abhilash and the rest of team at NameHero. It is a sensational feeling to be valued as a customer and cannot speak highly enough about the service received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Artisan Law",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T21:04:25.000Z",
          "Titre": "Love NameHero!",
          "Contenu": "I've used NameHero for my hosting for years and I love it.  Every service I use with them is excellent.  Today, I needed support with a domain name and I received excellent and very patient help from Sajay and Ashitha.  It was great."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nima Asdaghi",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T02:06:53.000Z",
          "Titre": "Customer Service",
          "Contenu": "Great Hosting, Fast, Reliable and when you have a question you will have an expert in the chatbox in less than a minute!"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T13:31:02.000Z",
          "Titre": "Very Good Customer Service",
          "Contenu": "Very Good Customer Service. They value their customers and are fast to help with problems and will provide discounts for long term customers :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank F",
          "Nb_Reviews": 3,
          "Date": "2023-07-20T17:29:23.000Z",
          "Titre": "The service is a game changer- these…",
          "Contenu": "The service is a game changer- these folks are so good and so helpful it is like having a extended team there when you need them"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Royal Membership",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T07:40:41.000Z",
          "Titre": "Great Support, Highly Recommend",
          "Contenu": "All Customer Service is super professional and problem solvers, they are very nice.Especially AbhilashThank you very muchI highly recommend working with Name Hero"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Hersom",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T19:46:25.000Z",
          "Titre": "Namehero customer support are always…",
          "Contenu": "Namehero customer support are always helpful and look out for the best interest of the customer. I couldn’t be happier with their service and product. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Frank Montis",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T17:45:51.000Z",
          "Titre": "Fast host, even faster customer service",
          "Contenu": "Fast host, even faster customer service !One happy customer here. Moved 7 websites from another host and I’m never looking back."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "A C B",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T13:24:16.000Z",
          "Titre": "i was strugling from last few days with…",
          "Contenu": "i was strugling from last few days with my domain thease guys are amazing namehero teame specially rose thank you for solve my problem remember the name namehero"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T22:05:13.000Z",
          "Titre": "Great help!",
          "Contenu": "My website went down and with the help of Sajay he got it up and running real quick!! So thankful for the help your customer service provides us!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dahir Mohamud",
          "Nb_Reviews": 5,
          "Date": "2023-04-29T19:31:31.000Z",
          "Titre": "My site was down",
          "Contenu": "My site was down, and I get quick answers to my problems and how I can fix them easily directly with 2 minutes my site was up and running. Thanks for dedicate support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mona Leggett",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T01:35:45.000Z",
          "Titre": "I am so grateful for Anna!",
          "Contenu": "I am so grateful for Rep. Anna, she was extremely patient, knowledgeable, and polite! Anna relieved me from overthinking. Thank you so much Anna for all your help! Go team NameHero!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Dave",
          "Nb_Reviews": 3,
          "Date": "2023-05-11T11:15:34.000Z",
          "Titre": "I am more than satisfied!",
          "Contenu": "I am more than satisfied! The support is a 1. I have always received fast, friendly and professional help. The performance of the cloud is blazing fast! Thanks to the Namehero team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Hegar Carol Hegar",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:43:51.000Z",
          "Titre": "James Hart is the BEST!"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Kirsten Smith",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T18:32:59.000Z",
          "Titre": "Support was quick",
          "Contenu": "Support was quick, effective and they went out of their way to check I was satisfied with the answer.Awesome!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "cédrick babef",
          "Nb_Reviews": 2,
          "Date": "2023-06-17T09:20:04.000Z",
          "Titre": "Very good work in assisting for http:// redirects",
          "Contenu": "Very good work in assisting for technical issues and so fast. This is by far for me the best hosting service on the internet"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie S.",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T07:00:26.000Z",
          "Titre": "Best customer service ever!",
          "Contenu": "The customer service representative was polite, and willing, and fixed my issue quickly.  I was nervous but he had it all under control. He is the best."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kara",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T05:35:58.000Z",
          "Titre": "Always wonderful support!",
          "Contenu": "Ever since I’ve switched to Name Hero I’ve been extremely happy. My site speed got better and the support team is always on it when I have a question!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T00:00:51.000Z",
          "Titre": "Quick and Accurate Response",
          "Contenu": "Ashitha responded quickly and understood my issue right away. Something I had been struggling with for hours was fixed quickly and without hassle. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Trevoulin Govender",
          "Nb_Reviews": 5,
          "Date": "2023-11-16T13:40:36.000Z",
          "Titre": "Very helpful service at any given time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Tracy",
          "Nb_Reviews": 5,
          "Date": "2023-10-22T23:44:13.000Z",
          "Titre": "James Hart fixed an issue for me…",
          "Contenu": "James Hart fixed an issue for me immediately.  Great service"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "olayinka ajibabi",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T19:31:36.000Z",
          "Titre": "Amith was very patient and…",
          "Contenu": "Amith was very patient and professional... In Addition, he took his time to salvage the situation and that was the peak of my day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ABRing",
          "Nb_Reviews": 3,
          "Date": "2023-06-21T04:58:08.000Z",
          "Titre": "Exceptional Customer Support at NameHero",
          "Contenu": "I had the pleasure of interacting with Anna from NameHero’s customer support when setting up my Cloudflare domain and setting up WordPress. She was incredibly helpful, knowledgeable, and patient.Anna guided me through disabling DNSSEC, adding a new domain in cPanel, and installing WordPress. She also assisted in updating Cloudflare settings and creating the necessary DNS records. Her explanations were clear, and she ensured that I understood each step.Notably, Anna provided valuable insights on DNS propagation and Cloudflare integration, advising on best practices. Her expertise and dedication simplified what could have been a complex process.In conclusion, NameHero's customer support, exemplified by Anna, is first-rate. This smooth and informative experience earns my highest recommendation."
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Ami Jeong",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T19:27:31.000Z",
          "Titre": "Great experience..zero knowledge of the…",
          "Contenu": "Great experience..zero knowledge of the site ..the customer service are willing to help you all the time..thanks"
        },
        {
          "Note": 5,
          "Lieu": "SX",
          "Pseudo": "mindyuhskunt",
          "Nb_Reviews": 2,
          "Date": "2023-05-22T15:22:00.000Z",
          "Titre": "It so easy to use and understand i…",
          "Contenu": "It so easy to use and understand i canceled with bluehost and joined namehero and it was a great decision. My website speed is even faster"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "rsyfum",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:09:43.000Z",
          "Titre": "Web speed is awesome",
          "Contenu": "Web speed is awesome and they have the best support."
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Redwan Rahman",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T19:25:24.000Z",
          "Titre": "Very Friendly and supportive",
          "Contenu": "Used to have their support as always as I have a reseller account even now separate packages too and as always I am always so happy with their live chat support."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rene Major",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:03:58.000Z",
          "Titre": "just amazing service",
          "Contenu": "just amazing serviceYatin T. customer support help me and fix everything in a minutejust amazing service!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Southard",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T18:01:41.000Z",
          "Titre": "NameHero is my go to hosting for…",
          "Contenu": "NameHero is my go to hosting for WordPress websites. Their reliability, stability and optimization is superior. AND just as important, their customer service is outstanding. They are responsive, quick to fix or help you fix whatever might come up. Superior company and superior host!"
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Anna Kaczmarczyk",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T11:14:44.000Z",
          "Titre": "I have reached out to customer service…",
          "Contenu": "I have reached out to customer service so many times and every single time the response is very quick and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "AG",
          "Pseudo": "Elijah",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T00:01:47.000Z",
          "Titre": "GREAT SERVICE - UNMATCHED SUPPORT",
          "Contenu": "I really got to admit that I was a bit skeptical when I made the switch from several other hosts that were just awful - But I'm very much pleased with the ongoing service and especially the support received from NameHero... In tech things will never always be 100% so the service ultimately helps to differentiate from the options in the market and definitely shifting more business NameHero's way..."
        }
      ]
    }
  ]
}