{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "neat.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "steve combe",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T23:59:30.000Z",
          "Titre": "Did not correct the problem and gave no…",
          "Contenu": "Did not correct the problem and gave no advice on how to fix it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bruce Sarazin",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T03:32:11.000Z",
          "Titre": "May Loose Your Data",
          "Contenu": "I used a Neat scanner and software for personal finances for years than they abruptly dropped product support for individuals in favor of their small business product line. Don't trust them with valuabke data, you may not be able to access it when you need it in the future. ilt's all proprietary and when they drop support for your product or raise prices above your current ability to pay, so sorry for you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allender Julie Ann",
          "Nb_Reviews": 7,
          "Date": "2023-08-08T00:25:29.000Z",
          "Titre": "This company is a foreign company that rips you off.",
          "Contenu": "I gave up on my data in 2015 after they canceled a wonderful program and moved to the cloud. I am a doctor and they are not HIPAA compliant. I spent the last 2 years with them getting zero help from their customer service before giving up. For awhile I could get into my data and then that stopped. I lost access to all of those years of data, about 10. I just recently received an email saying they were going to dump my old data. I had to pay $250 to download it, which turned out to be a lie. I did their 30 day trial making it clear I was going to get my data and get my money back in the trial. Cancelling the free 30 days as Val told me would be no problem came with a lot of jargon that would preclude I would NOT get my money back or my data. Another lie. I called billing and left my number for a call back. She just called back and hung up. I assume because I couldn't hear her and told her that; unless it was Val who hung up on me. She claimed to be the sales representative and customer service. She didn't have a clue how to download the data. As others have found they haven't changed and it is now 8 years since my data was deemed useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T10:39:17.000Z",
          "Titre": "Neat is a predatory company that does…",
          "Contenu": "Neat is a predatory company that does not allow customers to cancel their service when no longer needed.  They charged us for another year after we updated our credit card for a monthly subscription, then charged us for a year.  Horrible company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T19:01:15.000Z",
          "Titre": "I didn't get answers to the problem and…",
          "Contenu": "I didn't get answers to the problem and it seems I have more  missing file trouble now.  I'm going to call and see if talking to a person I may be able to  help you understand what the problem is."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Miller",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T19:41:19.000Z",
          "Titre": "Had it with Neat.com",
          "Contenu": "I purchased a scanner and program about 8 years ago. Loved it. Easy to use software, very consumer friendly. I had a small business and it worked very well for me. And then...they made changes in their software and everything is cloud based. Awful. Have spent hours with their \"experts\" only to have them ultimately agree that the software is lacking. Have set phone appointments and never got calls. Chat never open. The rates doubled but the product diminished. I literally threw hard earned money out the window. A few customer service agents have been nice to deal with but have no power to improve the software. Lots of excuses...meanwhile they collected $264. Ultimately I was told the only way to get the expense report (simple request!) is to pull it together manually. Really. How inefficient. And what did I pay for then? If I cancel I lose access to all my past years data. Cannot export it...really crummy. I tried the last 2 years to be \"useful\" and \"helpful.\" Now I am just mad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sameh Mounir",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T17:20:39.086Z",
          "Titre": "It has been 2 years we have been having…",
          "Contenu": "It has been 2 years we have been having difficulty logging in from the 1st time. it takes us sometimes up to 10 times to login. called customers service many times and they always blame it on our internet connection despite having a very reliable and very fast internet speed.for the past 3 weeks we are completely unable to login to access our documents. NO HELP FROM CUSTOMER SERVICEI contacted our IT department, they tried different browsers even different network outside our company  yet still the same problem.Really bad and inexperienced customer service. Even trying to cancel service and retrieve our documents is unsuccessful. I hope this review reaches a senior customer service or a supervisor who can help otherwise we will take a different course of action as Neat have possession of our confidential documents and we don't"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Captain Tom",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T21:15:40.000Z",
          "Titre": "i HAVE BEEN A NEAT CUSTOMER SINCE 2015",
          "Contenu": "i HAVE BEEN A NEAT CUSTOMER SINCE 2015.  I TRIED TODAY WITH 2 OF YOUR FOLKS AND IT IS CLEAR YOUR PRODUCT WILL NO LONGER WORK FOR ME.  YOUR OLD SYSTEM WAS GREAT. NOW IT SUCKS.....!!!!CAPTAIN TOM HANCHETT"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T15:09:18.000Z",
          "Titre": "It is good until you try to delete your…",
          "Contenu": "It is good until you try to delete your account!It got worse when I was told to go call in. I was the #1 call in and I waited 15 mins. no body answered, so I hug up. NO your still BAD! USELESS!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AllCity Technology",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T21:24:08.000Z",
          "Titre": "No sales support whatsoever",
          "Contenu": "No sales support whatsoever. No clear connection between past products and their current line. I have a client with an older version and can find no way to get information as to what they should do to migrate to a new computer system. Apparently they want me to buy something to get support but with no sales support, I can't even figure out what to buy. As an IT professional, everything about this company screams \"Run Away!\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly Williams",
          "Nb_Reviews": 2,
          "Date": "2021-06-08T15:26:22.000Z",
          "Titre": "I received a Neat scanner from my mom",
          "Contenu": "I received a Neat scanner from my mom. Initially I thought I would be set up quickly. However It took hours. I chatted with three reps, too were  unhelpful. Finally the third rep had to remote into into my computer and fixed it within five minutes. I told him I wish I had spoken to him first so that I hadn’t wasted so much time. I believe companies are as good as their customer service and I wouldn’t recommend Neat."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "J.D.",
          "Nb_Reviews": 11,
          "Date": "2021-06-06T06:24:25.000Z",
          "Titre": "Less Than Worthless It Cost Us Money to Get Rid of Them",
          "Contenu": "There is no way the reviews listed on this site are forthcoming.  It is unreliable at best.  The transition to this monthly subscription was done after my office bought a dozen units.  A year later and monthly issues they transition to this scam of monthly subscriptions.  The support is horrible and the product way out dated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john ramsey",
          "Nb_Reviews": 3,
          "Date": "2021-02-23T01:59:25.000Z",
          "Titre": "I loved Neat Desk, The Neat Company. Neat.com",
          "Contenu": "I loved Neat Company. Neat desk/ Neat.com until they went money hungry!! I will not use it any more. Got a regular scanner so they can't control my downloads or charge me to use what I already paid for. Nothing but propaganda!!I have tried to download the product driver from the CD purchased around 7yrs ago and all it will do is direct me to a website wanting money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 5,
          "Date": "2020-12-10T12:22:25.000Z",
          "Titre": "Gimmick to up sale again & again",
          "Contenu": "I would avoid this product if you are using for business.  They up sale you hundreds of dollars on upgrades then within a year try to up sale another $600 plus. It works for small small amount of receipts but \"too many\" and freezes up. Their tech support is a sales team.  When you get a tech they just tell you to use this you need to upgrade"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ed Wallace",
          "Nb_Reviews": 1,
          "Date": "2020-07-18T16:16:22.000Z",
          "Titre": "I have to believe that NEAT wrote these…",
          "Contenu": "I have to believe that NEAT wrote these reviews.  I have not been able to figure out from their FAQs how to migrate legacy NEAT data into their new cloud version.  Moreover, their online assistant was useless.  I left my number several times, and even though their website says I will receive a call when they get back on a weekday.  That did not happen. I recommend to anyone considering updgrading, to not do it.  You are flushing money down the toilet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "samantha Taylor",
          "Nb_Reviews": 2,
          "Date": "2020-05-14T22:44:32.000Z",
          "Titre": "We were told by a representative at…",
          "Contenu": "We were told by a representative at Neat that when we hit the max amount of scans we would be able to pay the difference of $750 for additional scans up to 3,000. When we went to increase the number of scans to use we were told that was not the case and forced to pay $350 for another 1200 scans. The company is not standing by their word! False advertising."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rwr",
          "Nb_Reviews": 2,
          "Date": "2019-11-29T13:08:19.000Z",
          "Titre": "Never purchase this software.",
          "Contenu": "Every time they update it gets worst.  Purchase a scanner based on Neat recommendation but they then tell me they do not fully support.  Many of the links are dead from support.  Worst of all they have no way out, once in your stuck!!!!Never purchase this software.I have reached out to support several times and get no help.  Last attempt requested information from me but gave no way to get it to them!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherry Oppenheim",
          "Nb_Reviews": 1,
          "Date": "2020-02-02T17:13:29.000Z",
          "Titre": "I had a problem with my PAID…",
          "Contenu": "I had a problem with my PAID subscription.  At first, all was well, however, the online connection was lost, the tech did not call to tell me, so I hung out on my computer for over an hour, waiting for something to happen.  Later that day, she finally called back to tell me the connection was lost and COULD SHE CALL THE NEXT DAY?  I said yes, we agreed on a time and I waited TWO hours and she has not yet called back - TWO days have passed!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barry",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T14:26:56.000Z",
          "Titre": "Check you subscription. This company has overcharged me 2 years…",
          "Contenu": "This company has overcharged me 2 years running. My bad the first year. I didn't catch the charge almost 700 dollars for one year. I did not sign up for this kind of plan (personal use) and this year I caught the charge on the card for 750 dollars. I was paying 89 dollars a year for an annual plan up until last year. I frankly have been remiss in not keeping up with the Neat scanning of receipts and missed this charge. I went to the website for support and could not connect to a customer service chat (it looks like the link is dead) and the website site says sorry, no refunds."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Waqar Qureshi",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T16:09:56.000Z",
          "Titre": "They have worst customer service",
          "Contenu": "They have worst customer service. Especially when they charge your card automatically every year. Then when you called them they said they have no record of call. They files size are very big that cannot be emailed. I have worst experience with this scanner. Plus scanner parts they make good money and sometimes it cant be repaired."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nav",
          "Nb_Reviews": 1,
          "Date": "2019-06-11T20:38:00.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "was unable to connect scanner to desktop so raised a ticket & within 24 hours received a call from customer service & issue was resolved. However, within next 24 hours scanner wasn't working well. Images were blur & customer services told us to buy a new scanner as they can't do anything. Our scanner was not more 2 years old."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raoul Gamache",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T18:58:29.000Z",
          "Titre": "Neat left all its legacy customers in a…",
          "Contenu": "Neat left all its legacy customers in a pickle by dropping support for its traditional product and focusing only on its subscription cloud based product.  The legacy product is still used by thousands of users and needs to be supported even it requires a cost.  When I asked who hosted the documents for the cloud solution they would not answer.  I will not trust my private documents to any cloud service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phyllis",
          "Nb_Reviews": 5,
          "Date": "2018-04-27T00:45:07.000Z",
          "Titre": "The phone rep seemed to barely…",
          "Contenu": "The phone rep seemed to barely understand what I wanted him to do. His futile attempts to repeat what I wanted done got to be frustrating. The stupid script needs editing so the reps don't sound so robotic. They need to be trained to ask pertinent questions and listen to the answers so when they get to the scripted question you've alredy answered, the customer won't feel unheard or completely ignored."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "GG LLC",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:43:38.000Z",
          "Titre": "I purchased a NEAT SCANNER used it once…",
          "Contenu": "I purchased a NEAT SCANNER used it once and the little display monitor is frozen. I called NEAT since it is still under warranty spoke to a few people after being on hold for 30-40 minutes each time but with no success or help.Before purchasing the Neat  scanner I was reading up on the reviews and the negative feedback but I purchased the scanner anyhow BUT what a mistake!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "A Neat Scanner Owner",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T22:48:17.000Z",
          "Titre": "Forcing clients to use Neat's paid cloud...",
          "Contenu": "Forcing clients to use your paid for cloud services, not right at all!! I paid for the hardware already which came with software!! No longer able to upgrade or get support unless I pay additional for cloud. When someone purchases a product they do so with the understanding of support and upgrades pulling the plug soon after sale without declaring this is very unethical! Not at all impressed and trust in Neat products is gone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:14:08.000Z",
          "Titre": "Not what we paid for",
          "Contenu": "Your help tutorials are outdated on your site, the program has been stripped down since these were posted and this is basically just an extra office scanner at this point. Your tech support guy had no idea what I was talking about as if he is still learning what the program does himself.We likely will not re-subscribe unless this program is improved. Add the options back that we paid for in the first place, feels like a ripoff now."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Benjamin J.",
          "Nb_Reviews": 2,
          "Date": "2018-04-03T09:41:11.000Z",
          "Titre": "Worst product ever",
          "Contenu": "Worst product ever . You purchases a scanner without being aware that without monthly subscription fees you can’t use it. Then they promise you a free “legacy” software but they make everything possible on their website to make it unavailable for download. So basically you buy a 100usd scanner but you can’t use it without paying $ for a useless software interface"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph G",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:21:08.000Z",
          "Titre": "Awful software that is extremely…",
          "Contenu": "Awful software that is extremely riddled with bugs and feature lacking.  Some of the worst support I've had from any technology in my more than 30 years of working in IT. There is now no \"local' on-premise option and it's cloud only. Attempts to reach out to people in the company to improve the situational were ignored. Seems like you are clear on who you value and its not the customer. I'm seeking alternatives... Do not buy!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Smileuske",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T16:37:52.000Z",
          "Titre": "I have a scanner that I have used for…",
          "Contenu": "I have a scanner that I have used for years.  It is apparently no longer supported and therefore was simply taking up space on my desk.  It is no longer useful to me or my business.  This is frustrating and disappointing, to say the least.  I will recycle the equipment and choose another company for my office needs.  I work in a network of a few thousand people in the service industry across the U.S and have, and will continue, sharing this story."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brent Clingman",
          "Nb_Reviews": 6,
          "Date": "2017-07-13T14:14:33.000Z",
          "Titre": "Took my money and ran. WHAT A RIP OFF!!!!! WHAT A SCAM. CRAP SERVICE, IF ANY.",
          "Contenu": "Took my money, wasted countless hours of my time with no positive outcome. Tech took control of my computer and then opened unrelated files on my desktop. Left my system in a non working mode. Created many strange files and then left them on the desktop. A very poorly managed company. Save your money because they could care less about you. They just want you to think they can do as they promise. WHAT A SCAM, AND I FELL FOR IT :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric W. Gage",
          "Nb_Reviews": 1,
          "Date": "2019-05-10T09:38:08.000Z",
          "Titre": "Avoid This Company",
          "Contenu": "Avoid this company! They are crooked and have horrible customer service. They auto bill your credit card so make sure you don’t allow that! They also say they are an American Company but outsource to the Philippines for Customer Service. Epic failure and a matter of time that their machine becomes a thing of the past!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "steve",
          "Nb_Reviews": 1,
          "Date": "2018-04-28T02:09:42.000Z",
          "Titre": "I asked about your old software to find…",
          "Contenu": "I asked about your old software to find out that it is no longer supported. I can understand that but you should be able to download it  Still. Not interested in your monthly subscription your  cloud service it does not meet my needsI have switched to someone elseDon't reply to this email and remove me from all your email list"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cartmein",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T17:07:54.000Z",
          "Titre": "Don't need subscription base software…",
          "Contenu": "Don't need subscription base software at this moment just for receipts filing. Very poor migration process from previous legacy software to new subscription base software. Have to export data as PDFs and then import into new software. Lots of errors. Not worth \"upgrading\" even though legacy software is no longer supported."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GSK",
          "Nb_Reviews": 1,
          "Date": "2018-05-07T17:04:05.000Z",
          "Titre": "Person on the phone was nice but what…",
          "Contenu": "Person on the phone was nice but what she said to do doesn't work. If you buy a product and don't pay for upgrades they disable your software and render the device unusable. I only used my Neat to make occasional PDFs from paper. I didn't buy it to have to use an online service to keep track of receipts. Caveat Emptor..."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "ROBERT SINCLAIR",
          "Nb_Reviews": 3,
          "Date": "2019-07-22T23:33:33.000Z",
          "Titre": "Neat Desktop Scanner --- absolutely no support",
          "Contenu": "We have a Neat Desktop Scanner which we paid a lot of money for.  We tried to update the latest drivers without success and have been advised that Neat no longer supports/stand behind their products.  It is also impossible to contact anyone at Neat to help address our problem.  A very disappointed customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pe. O",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:23:41.000Z",
          "Titre": "My Scanner Is Now A Paper Weight",
          "Contenu": "My computer got infected so everything was wiped. Upon trying to reconnect my Neat scanner i learned that that drivers are no longer supported by Neat and cannot be downloaded ANYWHERE ELSE!!! It is absolutely ridiculous that the device that was purchased less that 5 yrs ago is now literally a paper weight. For a company to not offer a single solution to people who have purchased their products is down right wrong. Doing business with Neat again is not on my to do list."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customerAllan Spiegelman",
          "Nb_Reviews": 3,
          "Date": "2021-08-26T19:43:31.000Z",
          "Titre": "Neat operations",
          "Contenu": "To operate Neat Functions,you must pay a large FEE, or you are not able to operate the system.The fee can escalate, due to their discretion. They have  cornered  CUSTOMERS who are not able to perform their tasks if they do not subscribe"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vito Porpora",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T19:50:59.000Z",
          "Titre": "I lost the software for MT neat while…putting it ona new conputer",
          "Contenu": "I lost the software for MT neat while putting it on a new computer.When I called neat they wanted me to pay to get the installation software to connect the neat desktop I purchased earlier they wanted to charge me.I feel this was not an action they should have taken on an owner of their equipment.I do hope someone will contact me and explain how they feel this was the way a customer of neat should be treated.I await some to contact me,914 523 1116Vito Porpora I am waiting!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Denise S",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T15:04:24.000Z",
          "Titre": "Update: clickable link does not work.",
          "Contenu": "The guy was nice but he stuck to his company policy. Did not provide a clickable link to the legacy software after I stated my case that I did not need or will not use the latest cloud based system and my reasons why. Now I’m stuck, not able to access my backups and one unhappy camper!Update: 5-4-2018. Agent provided link alright, it just doesn’t open. I tried every known way to get it to work to no avail. Sorry NEAT.COM, you had a good system once, but now it is totally broken."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DAVID",
          "Nb_Reviews": 1,
          "Date": "2020-10-26T16:41:55.000Z",
          "Titre": "My Receipts Held For A Ransom",
          "Contenu": "Bought a Neat Scanner years ago, came with the software, cost over $300. After years of logging receipts, one day I wake up and can't get into the software to add a receipt. Access denied. My subscription expired. What subscription? I bought your scanner. Didn't sign-up for any subscription! Ohhhhh, now your telling me l have to pay you $162/year subscription to have access to my 100's of receipts. What the #@$%??? Isn't that extortion???? Totally HATING on The Neat Company right now!!!!!!! Do yourself a favor, don't even start dealing with these people!"
        },
        {
          "Note": 1,
          "Lieu": "TC",
          "Pseudo": "David Soule",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T16:57:53.000Z",
          "Titre": "Stand alone desktop version should not have become unsupported",
          "Contenu": "Have used Neat stand alone desktop for years and loved it.  Then Neat decided to go cloud based and stopped supporting the stand alone version.  I do not have confidence in loading all my personal documents on the cloud.  Now I am forced that find another Stan alone service and tr t transfer years of documents from Neat."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "richard zipf",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:13:15.000Z",
          "Titre": "I don't know how the previous owner or…your r",
          "Contenu": "I don't know how the previous owner or tessa Williams was abke to login to my account and cancel my contract with NEAT.I opened a new contract with NEAT on 3/19 on order to keep them from having access to my company records! I spent over 2 hours with your rep reestablishing my account with you. How does that happen?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur Johnson",
          "Nb_Reviews": 3,
          "Date": "2018-04-27T16:43:46.000Z",
          "Titre": "Not a trust worthy company",
          "Contenu": "Not a trust worthy company. Greed has taken over. Bought neat under original subscription.They changed it and did not adequately notify all their customers. As a result I am now being asked to pay again for a service I already paid for. Had they done that I would have dropped them then and there. No use for them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra F",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:09:12.000Z",
          "Titre": "Use to be great now you're terrible.",
          "Contenu": "I hate Neat so much now. They use to be great then they did a bait and switch. Now the free software costs a monthly subscription and offers less features and more headaches.  Go back to your old model. You have hurt your old customers and cost me and my business countless hours troubleshooting your nonsense."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Kasl",
          "Nb_Reviews": 2,
          "Date": "2015-07-03T13:41:08.371Z",
          "Titre": "Customer service poor.",
          "Contenu": "Neat stopped working and customer service said to check the system requirements. They said I did not have enough memory to run Neat, but my memory was the same as when I installed Neat and it ran for over a year with that configuration. I think they just wanted me to upgrade to a newer Neat version...which would not run on Windows Vista."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "viet nguyen",
          "Nb_Reviews": 2,
          "Date": "2017-12-04T23:38:12.000Z",
          "Titre": "NEAT IS A SCAM",
          "Contenu": "I did buy neat -desk years ago.  I used to use the legacy program that is no longer exist, and now it ASKS ME TO SUBSCIPE THE SOFT-WAVE THAT I DO NOT NOT NEED AND I HAVE TO PAY ALMOST 100 $ A YEAR.  A PRINTER WITH SCAN CAN DO ALL OF IT AS I AM NOT A BUSSINESS PERSONVERY DISAPPOINTED AND I THINK IT IS A SCAM!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Betsy Hudson",
          "Nb_Reviews": 2,
          "Date": "2018-11-01T18:32:15.000Z",
          "Titre": "If you have an older scanner that you…",
          "Contenu": "If you have an older scanner that you need to continue to use to scan only (not use their paid cloud subscription) TOO BAD. You can't. I thought I was buying a scanner I could use until it died to scan docs & upload them into my database, but once they stop supporting that version of the scanner, you can't do anything with it unless you pay them a monthly fee, whether you use the cloud or not. So basically, they want to charge for you to use the scanner you already paid $500 for. I will never use them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neat - not so cool.  False advertising.",
          "Nb_Reviews": 3,
          "Date": "2018-04-26T19:18:03.000Z",
          "Titre": "It wasn't that my online experience was…",
          "Contenu": "It wasn't that my online experience was bad, but I spent a lot of money to buy a Neat scanner only to find out that a paid subscription to make it work is mandatory.   That is nowhere in their TV ads or otherwise.   So I called to talk tp them about it.   No luck.   I would not recommend this product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Pennington",
          "Nb_Reviews": 1,
          "Date": "2015-04-27T14:33:46.000Z",
          "Titre": "Every one @ Neat is very willing to help but, no one has been able to help",
          "Contenu": "I can not get my desktop scanner to work and it is new Neat has just replaced it.  It stops working after it scans.  It closes or crashes after each time it scans, but the mobile works fine.  One tech got on my computer and rearranged some files now my Neat Data file isn't their and all of my folders are gone. I am lost!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kenneth Howe",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T17:04:31.000Z",
          "Titre": "Preferred to be on the old system",
          "Contenu": "Preferred to be on the old system. If internet is down, Neat is inaccessible. Access depends on speed and availability of internet. With all the problems with hacking, etc. I don't want all my data on the cloud where I have no control on security. Most companies say they are secure only to find out after the fact that they aren't. And to migrate off of Neat is a very involved process. As I have already shredded most of the original documentation, I feel like I am being held for a monthly ransom to access my data."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A Neat Receipts Customer",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T14:32:04.000Z",
          "Titre": "Bate and switch to Software as a Service",
          "Contenu": "I purchased hardware that came with software. They converted it into a software subscription program and told me the device they sold me was \"not supported.\" I ended up not being able to calibrate the hardware they sold me. Being told my only viable option was to be a continual cash cow is not a valid option.______________Vendor claims the scanner is no longer compatible with the newer operating systems. What he means is they don't want to support it with the software that's not a subscription service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "josh",
          "Nb_Reviews": 3,
          "Date": "2018-02-19T17:19:30.000Z",
          "Titre": "this is the worst software ever",
          "Contenu": "this is the worst software ever, never working properly, crashing every few weeks, no live person available to talk to solve it, can not update because the page is kicking me out, it says error each time i log in. it happens few times a year. i am very disappointed I ever purchase it. waste of money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neal Cohen",
          "Nb_Reviews": 5,
          "Date": "2019-06-10T21:36:50.000Z",
          "Titre": "Horrible transition from 5.7 to current…",
          "Contenu": "Horrible transition from 5.7 to current version. Total waste of about 2 hrs and you must be there to let the person in the Philippine’s into your computer. I think a total of 5 calls.  Now I just went to sync it there is a problem.  Must be other easier to use systems out there"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Corcoran",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T11:45:30.000Z",
          "Titre": "You failed to give me access tp my…",
          "Contenu": "You failed to give me access tp my equipment that was supposed to be stand alone meaning not needing a monthly contract to use it. Im out 400 dollars. You should all be very proud of yourself , taking an 80 year old man to the cleaners . More commenly known as stealing. Have a nice day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "pedro soto",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T19:43:11.000Z",
          "Titre": "Bait and Switch",
          "Contenu": "Bought my NEAT several years ago with a scanner Model ND 1000.  Signed up for the 15 day trial, but could not get the scanner to install.  Contacted customer support.  Here is what I was told:  If you want help from them you have to upgrade to a plan costing more $, but I would not upgrade until I find if my scanner is compatible with the new utility program.  Their answer was basically \"too bad\", in order to see if your scanner work, you have to pay more money.  I asked for a supervisor just to be told that they would say the same thing.  Catch-22, just a bait and switch sales pitch"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathleen Predmore",
          "Nb_Reviews": 1,
          "Date": "2015-04-22T19:39:41.000Z",
          "Titre": "Are you kidding!",
          "Contenu": "Your machines don't work correctly. I had to have a rep from your company stay on the phone with me and he had a hard time of it. I'm returning two machines, because I thought it wasn't strong either to handle my reciepts. Neither worked! Please get the labels to me so I can return them both."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy H",
          "Nb_Reviews": 1,
          "Date": "2015-04-24T17:06:50.000Z",
          "Titre": "The billing office service is a scam..",
          "Contenu": "In a desperate can't reconcile being back charged for one year of just continue service, I have tried over 11 times to reach the accounting/billing office. There is no way to contact this infamous department. The customer service and technical support teams cannot transfer to these this infamous department as well. All the links on the automated system only lead to a dead end. I am unable to resolve my problem due to no department available in which to speak to, so I declare that the billing office is a scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:13:13.000Z",
          "Titre": "Horrible company",
          "Contenu": "Horrible company. Unable to use software because it wants to avail itself to an unsecured third party storage, (cloud). Legacy system is no longer allowed which was excellent and personal. When purchasing bulk package you are not told of annual software payment. Will not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 7,
          "Date": "2018-04-26T17:15:37.000Z",
          "Titre": "Have left me with a boat anchor scanner…",
          "Contenu": "Have left me with a boat anchor scanner that they will not even give me the old software so I can still use it even if it is no longer supported. I had a computer crash and lost my programs and I find out they have switched to a pay by the month or something to use my $350 scanner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly Corsino",
          "Nb_Reviews": 3,
          "Date": "2017-01-04T22:15:06.000Z",
          "Titre": "HORRIBLE!!!",
          "Contenu": "I bought the scanner a few years back and had technical support two years ago. I paid $80 and got out of the woods only to find myself there again having used the thing only at tax time to scan receipts!Since there is NO Customer Service phone number, I cannot even take issue with the fact that their product has left me high and dry yet again, unless I am willing to pay again for tech support.I am moving on to another solution as this one is TOO costly and Neat obviously does not care about its clients.Frustrated,Kelly Corsino"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "wesley willis",
          "Nb_Reviews": 1,
          "Date": "2018-04-28T18:17:57.000Z",
          "Titre": "I never received the document I was…",
          "Contenu": "I never received the document I was trying to retain therefore I could not do my taxes.I had no clue after purchasing the machine twice I would be charged a monthly fee if so I would not have purchased it. There are too many free apps on the phone and ipad.Neat Receipts Sucks!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Thom Dennis",
          "Nb_Reviews": 5,
          "Date": "2016-05-02T20:14:53.000Z",
          "Titre": "Neat - support is non-existent",
          "Contenu": "Try to contact Neat - their system appears designed to prevent you getting through - they \"have technical problems\".\rAnd they don't reply to emails via their website.\rDoes anyone know a good alternative? I've been with Neat for years but they don't seem to care one bit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Captain Tom",
          "Nb_Reviews": 2,
          "Date": "2020-12-03T20:14:09.000Z",
          "Titre": "I like the old system",
          "Contenu": "I like the old system.  Will continue with it.  I will not use your new system.  Does not fit my tourboat business.   Old one does.  Been with Neat since 2015.  Might have to look around if old system stops working. Thanks. Captain Tom"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pat M",
          "Nb_Reviews": 2,
          "Date": "2015-03-17T19:52:48.000Z",
          "Titre": "Not a happy costomer",
          "Contenu": "Neat machine itself is not as it is advertised to be.  It is slow and at\rtimes very confusing on how it works.\r Support did not help me resolve an error  problem in spite of being on and working with them for more than 3 hours.  When I tried to contact support\rback by several  emails to advise that error was still there I got no response.\r Calling the company for help has you hanging on the phone for extremely long times.\r I thought I would have this product master very shortly after I received\rit but I must say sadly I do NOT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nancy Feagan",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:25:42.000Z",
          "Titre": "Because in my opinion the sneaking way…",
          "Contenu": "Because in my opinion the sneaking way Neat changed software and then offer only 1 time help I will never buy a Neat product again. I am a income tax service with multiple stores and use neat scanners in all. The next time one breaks I will replace with different brand"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DL",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T18:09:32.000Z",
          "Titre": "I dealt with two different people",
          "Contenu": "I dealt with two different people.  Neither gave me a solution to my issue. I have problems with the fact that they are abandoning customers that do not want their information in the Cloud.  I do not want to have to be online every time I want to use my Neat products!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pete Kilcommons",
          "Nb_Reviews": 1,
          "Date": "2016-12-13T16:43:23.000Z",
          "Titre": "Neat Scanner Support",
          "Contenu": "I purchased a Neat Support plan - NeatCare Essentials Support - for 2 years which includes unlimited phone support. I can get the President of the USA on the phone faster and easier. Neat refuses to publish any phone number, forces you to use email or chat and it's clear they do not want to speak with customers. I'd understand if I hadn't paid for the phone support, but I did, yet its nearly impossible to get to a live, on the phone, technical support agent. Good product - worst service I've come across of any tech company I've encountered. Just terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HenryM",
          "Nb_Reviews": 1,
          "Date": "2017-09-23T00:14:41.000Z",
          "Titre": "WORST CUSTOMER SUPPORT",
          "Contenu": "WORST CUSTOMER SUPPORT.   I RECEIVED THE KEY and now I can not get help to installOn their website they post:    \" Need to talk to Neat? We hear you! Phone support is now available to ALL Neat software subscribers! 888-898-3253\"   --------  This is NOT what it seems.  The number above directs you to their website non-human support.  they force you to open a ticket that then they can take 72 hours to get back to you.  No confirmation, no nothing.Software may be great but company stinks high heavan. This is not a cheap software in comparison to other companies - choose wisely."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Martin",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:13:48.000Z",
          "Titre": "I have a older neat product that I was…",
          "Contenu": "I have a older neat product that I was wanting to utilize and you will not give the software to use it without forcing me to do a monthly plan. I cannot afford the monthly plan but was planning on using it later after I found a new position with a company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2018-03-19T18:52:03.000Z",
          "Titre": "This is Paul , Get something that you don't has to spend more money",
          "Contenu": "This is Paul .   I'm Writing a review . My Neat is only One year , But now it don't work.So I called the Company, was hard to contact.They said could fix my problem if , I pay them $199.00 a year.Why should I have to pay more money ?The Lady that I talked to was very Nice. And offer me a discount of $99.29 a year. She said that my software was out date. That I has to update, to get it to work. That's quite silly, for a unit being only one year old !!! . Actually that's highway ROBBERY.I payed good money , you would think that you get something without having to pay more for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis Rodriguez Roman",
          "Nb_Reviews": 2,
          "Date": "2017-05-01T17:38:15.000Z",
          "Titre": "There is no support",
          "Contenu": "There is no support. Is horrible. So inefficient. You can't call or chat or email.  There is no way around it. There is an automatic answering service that when it give you the options for support it simply doesn't answer. Don't use this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lydia Franz",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:45:17.000Z",
          "Titre": "They suck",
          "Contenu": "They suck. Canceled the service and they kept billing me. Disputed the charges and won the dispute to remove the charges. They still kept billing my card until I finally had to cancel that card and get a new one. I do not recommend this company at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "karen vaughan",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T16:28:45.000Z",
          "Titre": "Bait and switch",
          "Contenu": "I spent a lot of money  to buy the scanner and then later  they changed the way the software worked to charge an annual fee. It was a big bait and switch. Old software doesn't function so expensive machine useless without annual fee. Not happy!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Strand",
          "Nb_Reviews": 1,
          "Date": "2018-05-07T16:34:45.000Z",
          "Titre": "You stated the existing users could…",
          "Contenu": "You stated the existing users could continue using their Neat scanner without subscribing to the new program.  However, my Neat unit stopped working 3 weeks ago and I have not be able to get it working.  First I was asked to upgrade to the new program, then I received notices stating that I needed to upgrade to v5.7.1.474 but all downloads have been removed from the internet.  I've been using the Neat scanner for my receipts for over 2.5 years and not I cannot access my data.  That's very unprofessional from your company and I would not recommend your product to anyone.  Your support is not acceptable."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-06-04T20:43:06.000Z",
          "Titre": "I bought a new PC 2 weeks ago and it…",
          "Contenu": "I bought a new PC 2 weeks ago and it has taken this whole time to get my files into the new Neat system. I have spent multiple hours while techs that can hardly speak English, speaking to me from a noisy sweat shop in India. Today I finally got the scanner connected to my computer after 4 hours of remote access. The tech after getting the scanner connected, sent me a helps link and said goodbye. The new system compared to the system I have used for years is terrible with many added steps to the scan process and I’m still trying to figure out how it works. I would not recommend Neat to anyone and I looking for a system to switch too."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rhea J Burris",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T19:31:53.000Z",
          "Titre": "Neat Company has failed to make customers their most important asset.",
          "Contenu": "Due to a fall, I was unable to use my Neat device that I bought from the Neat company just a few years before. I spoke to several Neat employees that told me I had to purchase a new Neat device. I tried 1 more time and a female employee told me that she would get another employee to give me instructions on how to continue using my Neat machine through my own system. She, then hung up on me. That kind of behavior is despicable. I tried to make contact with others and had the same kind of results. The Neat Company needs to learn that customers come first. And sometimes extenuating circumstances need to be weighed in."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TJL",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T19:45:32.000Z",
          "Titre": "waste of time...I am not able to get…",
          "Contenu": "waste of time...I am not able to get any help with my older version of NEAT and the online help is useless....regret this purchase.  I cannot even access my old files....wasted too much time on this and the link a service rep sent didn't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 7,
          "Date": "2015-10-15T20:41:44.597Z",
          "Titre": "I have been abandoned. Be aware, this will happen to you too.",
          "Contenu": "I have been a Neat customer from the very early days. I have just upgraded my Mac to El Capitan and my Neat Receipts instantly stopped working. The issue is not with the actual Neat software, but rather with the scanner driver.\r Today Neat announced, totally out of the blue, that they are not going to be issuing a revised driver for my scanner version. So, now I am faced with having to buy a new scanner. There is nothing wrong with the scanner I have except that Neat wants the revenue stream generated by pushing loyal customers to invest in (unnecessary) new hardware.\r Caveat emptor.\r Mark."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Allen Leiderman",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T18:12:17.000Z",
          "Titre": "It seems that something happened to my…",
          "Contenu": "It seems that something happened to my neat scanner that caused my Dell labtop to no longer work.I then used another computer using Windows 10 Home Edition to set up my Neat Scanner. I signed up for the premium 30 day trial and within that time, the scanner did not scan docujments to the Neat Software nor to the Cloud. Technicians signed onto my computer twice and were unsucceessful. After a week not hearing for them, I puchased an Epson desktop scanner and chalked up a major loss of older importants documents to Neats inabilitgy to find a solution.  Yes I had backup, but that porbably only would work with Neat software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Very disappointed customer",
          "Nb_Reviews": 2,
          "Date": "2018-04-27T02:39:11.000Z",
          "Titre": "I have had two Neato robotic cleaners",
          "Contenu": "I have had two Neato robotic cleaners.  The first one lasted less then two years, which was two batteries, then it stopped working.  So, I gave Neato another chance and purchased a second, improved model, this one lasted only a year and a half.  I used only genuine Neato products , have no carpets or pets, cleaned the filter every time they ran and dumped the dust bin at the same time.  On the second Neato the battery, which I ordered and was stated to be a genuine Neato part ,over heated and caused my machine to die completely.  I find it very disappointing, as the machine does a great job, but does not last as long as it should"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Cuellar",
          "Nb_Reviews": 1,
          "Date": "2018-04-28T14:24:07.000Z",
          "Titre": "I RARLY USE THIS PRODUCT AND NOW I FIND…",
          "Contenu": "I RARLY USE THIS PRODUCT AND NOW I FIND OUT IT IS NO LONGER BEING SUPPORTED AND HAVE TO PAY FOR FURTHER SUPPORT.THE DARN SCANNER ALWAYS HAS HAD PROBLEMS . I WILL BE REPLACING THIS NEAT SCANNER ASAP.,AND IT WILL NOT BE WITH ANY NEAT PRODUCT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Altieri",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:21:54.000Z",
          "Titre": "Currently every time I'm using the…",
          "Contenu": "Currently every time I'm using the program it shuts down randomly after only being open for about 30 seconds.Also the customer service line was very unhelpful the last time I called. I received conflicting information multiple times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2019-12-30T22:37:26.000Z",
          "Titre": "After updating the software nothing…",
          "Contenu": "After updating the software nothing works. I have tried reinstalling and still nothing works. Upon opening Neat there is an error message. If I try to scan a document in it says paper jam (doesn't attempt to scan at all)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Vaughn",
          "Nb_Reviews": 8,
          "Date": "2019-06-06T21:22:43.000Z",
          "Titre": "I feel defrauded by the Neat Company…",
          "Contenu": "I feel defrauded by the Neat Company and their misleading practices. I am one of the original neatdesk customers who used the version that has local databases for storing data. Now that Neat has move to cloud storage, their sales agents misled me into believing when I signed up that I would not or have to pay an annual fee to use the software. Now I’m being told I have to renew in order to access my data. Sounds like ransomware to me. I specifically told the agent that I ONLY wanted to scan my data to my laptop hard drive or external drive. Now Neat has control over my data and I must pay to access it. I never ever again recommend this deceitful organization to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T11:22:18.000Z",
          "Titre": "The Neat application has issues the…",
          "Contenu": "The Neat application has issues the company will not diagnose or repair. They refuse to provide technical support. What they call technical support is someone uninstalling and reinstalling the application.  Eventually you will have the same issue and have to uninstall and reinstall the application over and over again. I'm looking for a better scanning tax program. There are many out there. CheersThe response below is made up of false information. I have an error code and log files that were never researched or resolved and still have the same issue. I spoke to what I would call a customer service representative who would not escalate the issue for resolution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Felice Levy",
          "Nb_Reviews": 2,
          "Date": "2017-10-17T16:25:14.000Z",
          "Titre": "So disappointed with this neat!",
          "Contenu": "So disappointed with this neat!  I have used this product for somewhere around 10 years.  I purchased equipment from NEAT, and now I have to pay for as much as $100/year.  As a self-employed sales person, this is ridiculous!  I'm happy to pay $50 per year, but $8 per month when I use this 10-15 times a year?  No thanks.  By the way, I also bought a new scanner and now I have to update to your new software, so I will have lost $350 that I paid for this machine.  Thanks for nothing, guess I'll head out to find a scanner that let's me scan as much or as little as I choose, withouth you forcing me to join your new program and post my business in the cloud."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ginette Leblanc",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T23:21:20.000Z",
          "Titre": "Had it on a different computer and it…",
          "Contenu": "Had it on a different computer and it worked ok... now trying to download the drivers on a different computer and it is hell.......Terrible.... just spent hours trying to figure out what to do..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pamela Fajkus",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:25:15.000Z",
          "Titre": "We have had the Neat for about 2 years",
          "Contenu": "We have had the Neat for about 2 years.  It has crashed and you can't even turn it on.  The Neat company does not even support the version that we have, so our only option would be to buy a new one.  No thank you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Harthorn",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:33:11.000Z",
          "Titre": "I am very sorry to lose the usefulness…",
          "Contenu": "I am very sorry to lose the usefulness of your product. I found it very helpful to scan documents but I do not wish to pay a monthly fee to use it, and it no longer works. So I need to find another way to do the job."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leroy Chausse",
          "Nb_Reviews": 1,
          "Date": "2018-05-02T18:39:31.000Z",
          "Titre": "When I tried to open my Neat scanner",
          "Contenu": "When I tried to open my Neat scanner, I found I had to log in.  I do NOT need any access to a cloud function.  All I want to do is scan documents and retain them on my PC.  How can I do that without a subscription?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customerJR",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T19:29:14.000Z",
          "Titre": "An inept company with software that is…",
          "Contenu": "An inept company with software that is nonfunctional , poorly developed and very, very hard to communicate with given their site location in the Phillipeans!Use at your own risk and account outcomes!Good luck!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sid Doering",
          "Nb_Reviews": 1,
          "Date": "2018-02-23T22:17:01.000Z",
          "Titre": "I have used neat scanners since 2010…",
          "Contenu": "I have used neat scanners since 2010 maybe longer. I just bought a new laptop without a cd drive and cannot get the software for my scanner to organize the receipts. They say that they will send you the software for free but then they require you to subscribe to the cloud in order to access it. this was not the agreement I made when I purchased all of their scanners for my business. Very poor customer support for your long term users. you built your business providing software and scanners then switch to monthly subscriptions to milk the customers that get you there.....shame on you!If the rest of us conducted business that way, we would be out of business or facing a lawsuit for bait and switch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-15T13:52:19.000Z",
          "Titre": "Company has abandoned long time users…",
          "Contenu": "Company has abandoned long time users by dropping support for legacy products.  This is a marketing ploy to force new purchases.  I do not trust this company and would never buy their products again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Antoinette",
          "Nb_Reviews": 1,
          "Date": "2018-04-29T17:10:28.000Z",
          "Titre": "I need information before I buy",
          "Contenu": "I need information before I buy.  And the only way to reach u is through email. That doesn’t help me to decide yo buy your services. Before i buy if i have any questions i like to speak to a  live person."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg Kleiner",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T18:02:58.000Z",
          "Titre": "Your company is garbage",
          "Contenu": "Your company is garbage.  I bought a scanner that came with software.  The software no longer works, and now I have to pay for the new version?  That's crap.  I'm never buying your products again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:15:25.000Z",
          "Titre": "Soon there will be a class action  suit…",
          "Contenu": "Soon there will be a class action  suit -- In my opinion , still protected  by the Constitution you guys are nothing better than cheap thieves  -- Hopefully the class action will put you out of business"
        },
        {
          "Note": 1,
          "Lieu": "BS",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2020-02-27T15:04:27.000Z",
          "Titre": "I am so disappointed with the Neat…",
          "Contenu": "I am so disappointed with the Neat Company.  When you sign up for a free trial they require a credit card # be submitted.  At the end of your trial period they automatically sign you up and start charging your credit card.  They don't send an email telling you, you will be charged, they send you an email after the fact.  Then when you call to cancel the subscription  you are questioned why you want to cancel your subscription and after convincing the person their product does not fit my needs and does not seem to integrate with QuickBooks desktop 2020, they cancel your subscription and even though I was one day into the subscription they will still charge me for one month.  I'm sure its in the fine print but please, you should be a little more transparent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nicole cooper",
          "Nb_Reviews": 1,
          "Date": "2019-02-19T20:11:42.000Z",
          "Titre": "Via another review from an unhappy…",
          "Contenu": "Via another review from an unhappy customer: \"Betsy, We do apologize for any frustration or confusion regarding Neat scanners and our newer cloud-based software. You can certainly continue to use your Neat scanner and we provide step by step instructions on how to do that without using the Neat software so you are not required to have a subscription in order to use the scanner. Please see this for details:......... (link not allowed).........We are also on the verge of releasing a free scan utility that will also allow you to use your Neat scanner without any additional cost. We hope you'll be able to take advantage of that when it is released in the very near future.\"So where is this free scan utility???? Because I haven't found anything."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick D. Miller, Ph.D.",
          "Nb_Reviews": 1,
          "Date": "2020-04-23T17:55:01.000Z",
          "Titre": "DO NOT BUY THESE PRODUCTS!!! THEY DESERT YOU!",
          "Contenu": "Well, when I first got my Neat machine I was real happy with it. I copied hundreds of patient files and more. Then, my hard drive crashed and took the program/software with it and was not retrievable. When I contacted Neat, they refuse to help me re-establish the software on my new computer. It's bad enough that I lost all of my files that I shredded after copying them onto my computer that died, but now I have spent a lot of money on a machine that is totally worthless to me now. I will certainly NOT be purchasing another Neat machine given the \"service\" I have received when I really needed their help. They had NO concern for my needs as well as no mercy whatsoever! I will NEVER buy any of their products again! They do not support their own products after a certain amount of time!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike M",
          "Nb_Reviews": 2,
          "Date": "2018-06-18T19:43:36.000Z",
          "Titre": "Support couldn't upload to the Cloud",
          "Contenu": "I think you had a great product that I used for many years but if your support staff is unable to upload our documents to the cloud why do you force us to use a product that doesn't work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce Coulson",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T21:09:50.000Z",
          "Titre": "Could not unstand the person",
          "Contenu": "Could not unstand the person. It took a while."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-29T01:33:29.000Z",
          "Titre": "You support was very helpful when I use…",
          "Contenu": "You support was very helpful when I use the chat link.I did not like the black screen when I turned over control of my computer so he could find the problem and make the repair.Over the years your changes making versions of your software obsolete has caused me problems enough that I did not use it for quite a while.I'm not thrilled when the support person tried very hard to sell me an upgraded version."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 2,
          "Date": "2020-01-16T21:35:07.000Z",
          "Titre": "Migration",
          "Contenu": "I would like to comment on Boogie, who did the bulk of the work.  He was very patient and did help me.As for the process of migration,  It was an abysmal failure.  It has taken over one month to complete.  I will check it in the next few days.My view of the cloud app is very poor.  It does not emulate the ease of use of 5.7 and is not user friendly.  It needs a lot of work.  After all the time it took to migrate, I am considering another platform."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer Rehtsechelsea",
          "Nb_Reviews": 2,
          "Date": "2019-07-05T19:55:35.000Z",
          "Titre": "My Tech Dolly was great",
          "Contenu": "My Tech Dolly was great.  After she finished I thought all I needed to do was access two documents of instructions one for the scan utility and one for my updated Neat Application.  Not so- going to the site was frustrating-no clear documents to download and or print and two items that looked they might open and be helpful that would not open.  I am going to have to work thru these two new Neat sites on my own."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gabbytony",
          "Nb_Reviews": 2,
          "Date": "2019-06-05T16:49:47.000Z",
          "Titre": "Had a great product and screwed it up.",
          "Contenu": "You had a GREAT product with Neat Legacy..................then you screwed it all up with your Neat Cloud.  Features are missing...........it is not user-friendly.....................It is difficult to print documents in the right size................you can't combine scans into one file.......They had something great and screwed it up."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susan Cleary",
          "Nb_Reviews": 2,
          "Date": "2018-06-18T13:16:17.000Z",
          "Titre": "Billed for an account that I didn't have",
          "Contenu": "Customer service representative kept repeating the \"company's position\" which did not answer my question about being billed for an account that I did not think I had and finally she told me that my version of Neat was no longer being supported as Neat was on the Cloud. This is unacceptable to those of us who don't want to leap forward into areas we don't trust."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Cumley",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T15:00:04.000Z",
          "Titre": "bad experience",
          "Contenu": "once we said we wanted to try it for a review the sales person lost interest and told us just to go to the website ourselveswe didn't want to sign up for a year for the quick books integration when we aren't even sure the application will do what we need it to dowe were told the integration was non refundable even if we decided not to use the program after the free trial...that seems kind of foolish!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marsha Beck",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:10:45.000Z",
          "Titre": "Not robust or user friendly",
          "Contenu": "Not robust or user friendlyI recently had to upgrade to the cloud version  and it’s fine for saving receipts but not flexible or customizable. When I called I was sent the links to tutorials and told that’s how it worked when I explained what I wanted I was told I didn’t work like that - I was just running reports I had gotten in the old version and using fields in the system"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Howard Cohen",
          "Nb_Reviews": 3,
          "Date": "2018-05-04T18:21:39.000Z",
          "Titre": "The rep was very good",
          "Contenu": "The rep was very good, unfortunately his hands were tied and couldn't help me with my legacy software. The company turned its back on us customers who started to support the program. BAD NEWS COMPANY. It appears that a lot of people and previous customers are left in the wind. I feel if we knew what direction the company was going, we would have not brought your products"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J. Brenchley",
          "Nb_Reviews": 2,
          "Date": "2018-04-27T02:34:56.000Z",
          "Titre": "I was backing up my neat records onto a…",
          "Contenu": "I was backing up my neat records onto a thumb drive when I pulled the thumb drive out accidentally. In doing so an error was cased in the software.  I called support but they informed me that my version was not supported anymore.  My only option was to \"rent\" your current software which I would not do so I kissed my current software and scanner good by."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "David Gonzales",
          "Nb_Reviews": 2,
          "Date": "2018-04-27T00:14:42.000Z",
          "Titre": "Seems like more focus was on getting me…",
          "Contenu": "Seems like more focus was on getting me to upgrade and signed up for the cloud service, rather than helping me get reconnected with the software to work my scanner . In the  End it took a second call before I got the email with the link to provide me with the software to install the drivers. And after all that I still could not get My scanner to work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 4,
          "Date": "2018-04-27T18:31:23.000Z",
          "Titre": "Horrible customer care",
          "Contenu": "Good grief.  Let Tech take control of my computer and they struggled for a little over 2 hours trying to get my software to work.  Appeared they were multi-tasking with other customers.  I would send a chat and wait and wait and wait for a response.  When they did respond they would send jibberish many times."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doesn't provide tech support past 30 days.",
          "Nb_Reviews": 3,
          "Date": "2019-07-03T13:19:46.000Z",
          "Titre": "CSR that helped LUD",
          "Contenu": "CSR that helped LUD, was fine - not happy with the company itself. Forcing customer to go from their desktop scanner to the could is NOT  cool.  There are certain things I may not want employees to be able to access from their homes at anytime if they have their own log on. We were perfectly fine scanning to our server in our business. Now I will no longer refer NEAT to anyone. I have switched to the Epson Scanner with same functionality and lifetime support. I would rather give money to a company that stands by their product rather than NEAT."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott Ketterer",
          "Nb_Reviews": 4,
          "Date": "2018-04-26T16:18:03.000Z",
          "Titre": "The software is still buggy on Mac",
          "Contenu": "The software is still buggy on Mac.  UX is frustrating, App always opens with the full-screen presentation, zooming on documents is terrible, desktop application times out and a hundred other little things.  They need some UX professionals to watch users interact with the software - way too many gotchas...."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Franklin Hanshaw",
          "Nb_Reviews": 2,
          "Date": "2018-05-17T03:03:41.000Z",
          "Titre": "My Neat Desktop Scanner",
          "Contenu": "My Neat Desktop Scanner quit working so I called for service your service department and they were unable to assist. Nor could they tell me what I should do in order to continue filing all receipts and other items I like to maintain for tax purpose. I admit that at 80 yrs of age I'm not the sharpest tool in the shed in dealing with electronics but neither am I stupid. What can I do about this situation? Please come up with a solution I really need help. Thanking you in advance, I remain F. B. Hanshaw Hernando, FL."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Sween",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T18:38:56.000Z",
          "Titre": "All they do is tell you to look at a…",
          "Contenu": "All they do is tell you to look at a video which has nothing to do with your problem. They promise phone support but don't deliver.Sometimes the app can't find the scanner, sometimes it can but no one can tell me why.The old Neat work well but current upgrades have made it much worse"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronald Young",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T19:32:57.000Z",
          "Titre": "Subbpar Customer Service",
          "Contenu": "Unfortunately none of the customer service people knew why once I changed over to the upgrade option the receipts were legible again. I couldn’t imagine why and they couldn’t either. So basically after 2 years of “free” great results, now I was paying for very subpar service and results."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Farber",
          "Nb_Reviews": 3,
          "Date": "2018-04-26T18:08:26.000Z",
          "Titre": "My Desk Scanner would not scan my…",
          "Contenu": "My Desk Scanner would not scan my reciptes. The young man said that the new OS for my MacBook Pro need a new workaround. He said he would send me an email with the fix. I got the email. THEN THE PROBLEMS BEGAIN! I had to go to several files and delete 2 files  I followed as close as I could, but on one step a zip file needed opening. I was instructed to select the driver for my machine. NO LIST OF ANY KIND SHOWED UP. I tried everything but no resutas. Right now my DeskScanner is not working!!!The app that has been sent to me is not working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bob L",
          "Nb_Reviews": 2,
          "Date": "2015-03-24T14:40:15.000Z",
          "Titre": "Horrible Phone Support",
          "Contenu": "Tried calling in several times for support and the automated attendant had no idea how to route my calls - could not understand me and could not find my Email address or account even though I was a \"PAID\" support member. Probably the most frustrating phone system that I have ever dealt with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerry Kerns",
          "Nb_Reviews": 6,
          "Date": "2018-04-26T21:50:05.000Z",
          "Titre": "I was recently 2000 miles from home and…",
          "Contenu": "I was recently 2000 miles from home and my laptop died so I had to reformat and make it all work.. unfortunately I had all my software at home and couldn'tt make the scanner work..  after not luck from neat trying to fine the older version of my software, I was told to download the new version and do the 30 day trial then would have to cancel ..   that's a real PITA..   I was on a long trip and neat let me down !!, I finally got on the windows scanner and made it work..  I desperately needed tax docs scanned and neat let me down.. im not a happy customer.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deab Allmon",
          "Nb_Reviews": 1,
          "Date": "2018-04-29T23:24:48.000Z",
          "Titre": "I was charged approx",
          "Contenu": "I was charged approx. $70 and told my use of a product that i have used or years would be canceled if i did not pay.   In my 10+ years--i purchased the product and when i changed computers, i purchased it again.  Never did i hear about the \"service\" charge.  i"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin Jennier",
          "Nb_Reviews": 3,
          "Date": "2018-06-18T19:45:28.000Z",
          "Titre": "Current software is lacking.  Customer Service is rude and unhelpful.",
          "Contenu": "Current software lacks the flexibility and useful features of the older software  The format that the reports print out in is far worse.  Customer Service is lacking - the obvious offshore reps can barley speak english and are borderline rude and dishonest."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nate Brown",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:25:23.000Z",
          "Titre": "The agent I felt was pushy and wouldn't…",
          "Contenu": "The agent I felt was pushy and wouldn't let me talk.  I have been using the Legacy Software since Introducing the cloud software that they came out with right after I got my neat scanner.  AND I HATE THE CLOUD SOFTWARE.  As much as both of my scanners cost that should be a standard feature.  I hate how the cloud software logs out all the time and for a company that has unlimited cloud storage already the subscription service is too expensive for rude tech support. The original software, in my opinion, the legacy software version was the best. I dont know why they would do this too it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bill Pennewell",
          "Nb_Reviews": 2,
          "Date": "2018-07-16T17:47:26.000Z",
          "Titre": "Customer Service needs improving!",
          "Contenu": "Your website was nearly impossible to navigate attempting to get specific information!  Then I had to communicate via email that took several days for a response!  Product is good but customer service for purchases/questions needs lots of work!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sande S",
          "Nb_Reviews": 3,
          "Date": "2015-07-10T15:34:48.814Z",
          "Titre": "Neat Mobile Scanner",
          "Contenu": "I have had to have both my USB connector and my scanner replaced, at different times, to solve various problems. I find getting ahold of this company is not easy in the least and I'm bordering on being sorry I purchased this Neat product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pat D.",
          "Nb_Reviews": 3,
          "Date": "2019-06-11T12:08:42.000Z",
          "Titre": "NEAT Scanner",
          "Contenu": "The quality of the scanning really is not that great.  I purchased my NEAT scanner (emphasis on Scanner) about 3 years ago.  I didn't  need to purchase anything for those 3 years and now you have to subscribe to their program every year!  Since I had to replace my scanner because it died I found out from NEAT company that you can use any compatible scanner with there program that you have to purchase anyway.  So I did research and purchased Epson WorkForce ES-500W Wireless Document Scanner for $ 329.99 which is rated 4 stars instead of purchasing another NEAT for $483.90 which is rated 2 star. I really needed a program like Neat and that is the only reason I stay with the program."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Umphries",
          "Nb_Reviews": 4,
          "Date": "2018-04-26T17:46:21.000Z",
          "Titre": "Unstable app/cloud base program",
          "Contenu": "I am finding the app more and more unstable. I enter data only to find it missing the next time I check it. The program quits unexpectedly often. When it works, it works great so I am hopeful Neat will work on the weak spots."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J. Ransom",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:23:13.000Z",
          "Titre": "Long-time Neat Legacy User Makes the Switch",
          "Contenu": "As a long-time Neat Legacy user, I was frustrated the program had become too unusable to continue its use, so I decided to switch to the Neat Cloud system, even though I do not need -- or want -- the cloud storage. The customer service person was very helpful in making the transition.But once I started actually using the Neat Cloud system, I was not only disappointed at how \"buggy\" it seems to be (e.g., multiple sign-ins during the day), but also surprized some major features were missing (i.e., combining documents). It also seems much more labor-intensive that the previous version.I'm hoping I'll improve as I get better using the system, and I'm hoping the program is improved quickly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-05-06T21:39:44.000Z",
          "Titre": "2  Items I use are in development",
          "Contenu": "2  Items I use are in development. Leave option for both versions if not 100% equal.Why I'am I seeing Need Review , I have like all of a sudden 384 . What do i need to get rid of these?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rob OBrien",
          "Nb_Reviews": 2,
          "Date": "2018-04-27T12:19:24.000Z",
          "Titre": "We use the software about 2 wks every…",
          "Contenu": "We use the software about 2 wks every year we had purchased the nest scanner which worked great but is now worthless because the change the software that it will not work with so a waist off money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stevens Santiago",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T22:52:19.000Z",
          "Titre": "I purchased your product thinking I…",
          "Contenu": "I purchased your product thinking I would be able to keep it in use. Know you want more money if I want to use it. Not fair. I payed the price you had set. I should be able to use my scanner."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Wanda French",
          "Nb_Reviews": 1,
          "Date": "2018-01-29T04:13:17.000Z",
          "Titre": "i use to give it 5 stars but now very upset",
          "Contenu": "i use to give it 5 stars. but when i had to purch a new computer i am not able to download the neat 5  software i had that allowed me to scan documents of my clients to their files (pdfs) i don't need cloud storage and i didn't really even use their expense part of software... i utilize my scanner to scan documents to send to clients for signature and other important stuff and now my scanner is useless.. i corresponded with email twice since you cant talk to a real person on phone. and they just claimed they retired my version of software and couldn't help me i would have to pay ... i would rather purch a whole new system then give them another penny for what ive already paid for . actually twice since i have both desktop and the handscanner.  if anyone knows where i can get a copy of software please help!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 2,
          "Date": "2016-06-17T14:09:32.000Z",
          "Titre": "Tech support is the worst",
          "Contenu": "I have 3 of the desk scanners, and for the most part, I like the scanners but there are several glaring problems.  One, if you ever need tech support it takes forever and rarely are the problems fixed. Two, I have been on the phone for hours on single problems, and they always blame some thing else, like it is your adobe app or something else, even when you explain that everything else works perfectly with it.  Three, when they say they have finally fixed a problem, they send you an email and say if it is reoccurring to send them an email and then you will be able to bypass everyone and go to them, problem is they never respond and you have to start all over.  I have a problem where I scan in a document, then enter all the information and a few minutes later all the information is gone and you have to re enter it."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Richard Mayea",
          "Nb_Reviews": 1,
          "Date": "2018-05-01T12:59:11.000Z",
          "Titre": "Disappointed",
          "Contenu": "I received a letter that indicated I owed Neat money for a product I stopped using more than a year ago.  I explained this to the person I called and three times I had to reiterate that I received a letter and not an email.  An email may very well have been sent, however I am not aware of that.  In short I think your product falls short in many areas especially since you went from desktop to SaaS.  Your Saas version does not have the same scanning and reporting abilities that I was accustom to in the desktop version I had been using for more than 10 years. While I'm interested in your SaaS I fear the same minds that created the original desktop versions are still creating the SaaS version as I can see the signs such as week reporting, no scanning directly from the SaaS.  You asked for an honest review and I have provided it, now it's up to Neat to do something about it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pete Z",
          "Nb_Reviews": 1,
          "Date": "2018-05-01T03:56:17.000Z",
          "Titre": "Nice enough tech, but where my software?",
          "Contenu": "Nice enough tech, but the software for my scanner has been discontinued.  INSTEAD, I was invited to purchase an annual license (aka annuity).  Meh!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dominic Sichenzia",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:21:26.000Z",
          "Titre": "One of the problems with Neat is that…",
          "Contenu": "One of the problems with Neat is that they retired their legacy 5.1 softwareand ND 1000 desktop scanner, but said that customers could continue using this if they downloaded the 5.4 software which is listed on Neat website.  However when you go to this website it DOES NOT APPEAR.  After talking to Neat in the Philippines they advised that link is NO LONGER AVAILABLE EVEN THOUGH IT APPEARS ON NEAT WEB SITE.  NOT GOOD!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!Going offshore to the Philippines may have saved Neat money, but for the customer it is not efficient.  For example I called the Philipines gave them my question a polite person said please hold, 10 minutes later somone else picked up and I had to explain the problem again. this person said please hold, another 10 minutes, guess what a new rep. got on had to repeat again.  Bottom line they could not answer & just were trying to sell me the Premuim edition of Neat."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jack Gomes",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T13:14:37.000Z",
          "Titre": "Support did not correct the problem",
          "Contenu": "Support did not correct the problem. Reinstalled NEAT software will not run, and the company will no longer support the product."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lauren Willis",
          "Nb_Reviews": 1,
          "Date": "2018-11-14T04:58:12.000Z",
          "Titre": "While customer service was helpful.",
          "Contenu": "While customer service was helpful.I have not received the refund that was suppose to be put back into my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beth Rowley",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T01:38:32.000Z",
          "Titre": "Should be able to use a piece of…",
          "Contenu": "Should be able to use a piece of equipment you purchased without having to pay a monthly fee."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Matthias Brecht",
          "Nb_Reviews": 2,
          "Date": "2020-07-31T15:58:00.000Z",
          "Titre": "Don't use NEAT for currency conversion",
          "Contenu": "Don't use NEAT for currency conversion. I payed 2.3% additional fee."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Evelyn Gray",
          "Nb_Reviews": 1,
          "Date": "2019-06-05T13:54:20.000Z",
          "Titre": "You don't give the customers the…",
          "Contenu": "All internet based is putting all your eggs in one basket, and bad for the consumer when an internet connection is NOT available holding us hostage.You don't give the customers the features we use to have and don't know what you're doing.Tech is not familiar enough with Fujtisu scanner features. It's all internet based? Still confused. If the internet goes down, then how do I access my info? You're holding me hostage with my private information!!! Not acceptable.I have crappy very slow internet and down a lot, so if I don't have the info on my hard drive, again, I have no access. I have been late and penalized on my taxes because of no access to my information. Now you want to go all internet. Who is this easier for? You or me?  YOU, of course, not the customer who's paying you, especially when you create the problems in the first place with awful IT guys.You've taken all 14+ years off my hard drive, more times than I can count with your software, and then I have to call you back to import it again. What's wrong with you? You are upsetting my lifestyle taking hours to correct a problem YOU created and have nothing to support me and any IRS inquiries when you take my info away from me.Now I'm being told you won't support the Smart Organization System, yet FujIstu has the option in the software to save to the COMPUTER. Isn't that contradictory? You don't know what you're doing. PERIOD!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Abel",
          "Nb_Reviews": 1,
          "Date": "2019-06-12T06:17:27.000Z",
          "Titre": "Extremely Unhappy",
          "Contenu": "I honestly feel that this Neat Cloud system lacks the software to support and function with Apple products.  I have spoken with over 15 reps since I’ve purchased this product and every time it’s a stressful and annoying process.  First of all the third party call center you work with is very frustrating trying to communicate with them or understand their pronunciations on English words.  the constant lack of communication amongst staff, and the fact that you ask all these security questions and contact numbers , but yet I was disconnected by agents more than 4 times and promised a callback which didn’t happen.  Each time having to explain my issue and having agents ask random questions with no explanation of source or step actions to find material they require.  This product is the best paper weight I’ve ever purchased as far as I’m concerned , just don’t ask me about the product. Itself , the call center, customer support , or if I would recommend that someone go through the mess I’m dealing with .  It’s like you expect me to spend 3 whole days working on issue, tell me that the backup or transfer of files will last 5 hours and ask me for a callback the next day once it completes, but on 3 different attempts it fails , or rejects and when I give you the rejection code your so called senior agents don’t know or have never seen these error codes.  I honestly don’t know what else to do, and calling you all for help or assistance is bad for my health as your support team is honestly not trained properly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "joseph lewis",
          "Nb_Reviews": 2,
          "Date": "2018-05-17T02:53:14.000Z",
          "Titre": "I think it's to buy your product than…",
          "Contenu": "I think it's to buy your product than pay for update each year,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Otis Comstock",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T20:06:54.000Z",
          "Titre": "I still have the same problems  can't…",
          "Contenu": "I still have the same problems  can't get it fixed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Martin",
          "Nb_Reviews": 3,
          "Date": "2018-04-27T14:01:51.000Z",
          "Titre": "I called Customer Service because I had…",
          "Contenu": "I called Customer Service because I had a hard drive failure and lost the Neat program.  I knew the Legacy software I had used for years wasn't supported now, and I needed to know which of the subscription programs best suited my small company needs.  I chose to 'chat' with a Customer Service rep and let them guide me and decide which level of service I needed.  I initially provided a little background about my company and poised the question to the Customer Service rep:  Which level of Neat would be best for me.The rep ignored my question and began telling me the difference between the monthly rate and the annual rate of the premium level and no matter what I said, all the rep could do was quote me the prices and tell me how much I would save by getting the Premium level and pay the annual rate.  I hung up in disgust and bought the 'Lite' level of service and the rep called me and started again with babble about the annual versus monthly rate for the Premium program.  I told him I wasn't interested and hanged up.  The next day he called me again and said he was ready to 'finish the transaction'.  I told him to never call me again.  I did have an issue getting the 'scan' button to work for me and I reluctantly called Neat Technical Support.  The dear lady who (almost immediately) answered my call was very helpful and got me going in just a few minutes.  That's not the interaction I'm being asked to rate here but I added one star because she was knowledgeable and helpful.  HOWEVER, there was a party going on in the background:  People laughing and chatting about this and that, background noise unrelated to technical support, and the lady helping me was distracted several times by, I assume, someone speaking to her while she was trying to help me.  So to use just one word to describe Neat Customer Support, that word is UNPROFESSIONAL."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-03T21:11:58.000Z",
          "Titre": "Hard to talk to support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Larry Ferris",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T14:55:13.000Z",
          "Titre": "I CANNOT MAKE IT WORK!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "L Britton",
          "Nb_Reviews": 1,
          "Date": "2015-04-01T19:33:16.000Z",
          "Titre": "If I had it to do over I would NEVER have bought this!",
          "Contenu": "I use for home office use. I have owned the scanner for approximately two years. I have lost years off my life on excruciating long waits for chat, email AND phone support. I have had repeated issues over the two years. I had some of the same issues as other users.  Here are the highlights\r1. Difficult to understand how to operate initially although eventually I figured out the basics but none of the more advanced features.\r2. Scanner that came with purchase package did not work. Replaced under warranty. Wasted one week waiting on exchange.\r2. Poor job of scanning photo business cards or promo cards. Even though the TV ads show that it is designed to scan business cards.\r3. Slow to PROCESS scanned documents, receipts, etc.\r4. Frequently selects wrong amount for sales tax on receipts.\r5. Must review every document input to verify correctness.\r6. Frequently have to re-scan because of lack of clarity on some of pages scanned especially for mult-page documents..\r7.Once scans are in folder, if you have ANY problems (which I have TWICE) and have to reinstall, all of the folders are gone. The scans can be recovered but what good is that when two years of scans are all jumbled up? I can do better with a shoebox!\r8. Customer \"service\" is a joke. They try to hide from helping you behind online FAQs only. UNLESS you pay for a service contract. (Which I object to since it has been a plethora of continual problems from the start) I spent over $400 bucks on this machine and expect it to work. I expect better for a product that has only ONE function! \r9. I have been trying to get email \"help\" since January 26. Today is April 1 (this review is not a joke) and I STILL do not have my issue fixed. I have been unable to use my scanner since January 26. It takes 3-5 days to get an email response. This is the worst customer experience! Don't they know that consumer's number one reason to shop elsewhere is lack of service AND inability to get a phone number to TALK to someone? I guess since they have the only product of it's kind they can be smug about their crappy service but as soon as that patent is up and other players enter the field, I am DONE with them!\r UPDATE 4/1/2015 I FINALLY was escalated to a senior technician named Genine. She was a GENIUS and unraveled ALL of my issues with one screen share. Can't the company see that the favorable impression that occurred in that ONE session could have been done from the start and avoided three months of seething frustration???"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James J McDonnell",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:54:41.000Z",
          "Titre": "Last two times I scanned items when I…",
          "Contenu": "Last two times I scanned items when I tried to edit and file them the screens are blank< before this everything worked pretty well. I've been using NEAT force number of years ever since the records were keep on your own computer, that was my favorite version. It always worked."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T03:33:34.000Z",
          "Titre": "I aunable to edit/file records",
          "Contenu": "I a. Still having trouble gettin to edit/file records I scand into neat yesterday. I did get some info over chat but the problem is NOT resolved."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rob Miller",
          "Nb_Reviews": 4,
          "Date": "2023-11-01T00:30:57.000Z",
          "Titre": "Exporting Data from Neat",
          "Contenu": "I had a constructive interaction with LizA who gave me pointers on downloading my Neat file cabinet. I think the product would be better if within the current web system there was an easy way to port data stored in Neat to a computer or other storage that does not require an annual subscription. Neat is useful whilst a company is active but a solution needs to be available other than the use of unsupported legacy software to help with mandatory storage after business closure."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T14:12:16.000Z",
          "Titre": "Liza ultimately fixed my main problem…",
          "Contenu": "Liza ultimately fixed my main problem of getting Neat to work with my ScanSnap, and I am grateful. However I spent at least two hours not counting the time I tried the Chat and there would be 5 minutes between replies. It was disjointed and stressful. I want a person who can give and take not the process of a Chat communication. It was frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis Olson",
          "Nb_Reviews": 2,
          "Date": "2022-02-04T21:19:30.000Z",
          "Titre": "While Liza did a good job and tried her…",
          "Contenu": "While Liza did a good job and tried her best, I'm sure, the process took too long over 2 days with no resolution. On the 3rd day still no fix though it seems to be a communication problem between QB and the neat program. Overall pleased with Neat and would usually give a higher rating except for this issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Rehtsechelsea",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T14:21:03.000Z",
          "Titre": "Don't blame my tech",
          "Contenu": "Don't blame my tech.  She was 5 Star all the way. she solved my reason for calling to my satisfaction. She also asked if I had any other problems so I told her about a print issue no tech has ever solved well that failed same as always.  In my estimation she deserves an additional 5 stars for trying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rick Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T01:28:59.000Z",
          "Titre": "Not informing customer of potential problem",
          "Contenu": "When I called Neat \"Support\" and waiting for someone to answer I waited over 25 minutes listening to a recording that said I was # 1 in the queue. After I was able to talk to a person they told me they were sorry and they were short-handed. I finally found out that the new MAC upgrade to Ventura was not able to use my NEAT scanner. The MAC Ventura upgrade was in use over a month ago. WHY DIDN'T YOU PUT OUT A NOTICE TO YOUR USERS AND TELL THEM IF THEY UPGRADED THEY WOULD NOT BE ABLE TO SCAN THEIR DOCUMENTS??? IT'S CALLED CUSTOMER SERVICE! I AM A LONG-TIME CUSTOMER AND I EXPECT BETTER."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2022-01-19T02:25:39.000Z",
          "Titre": "Over a month to upload files to the cloud",
          "Contenu": "Over a month to upload files to the cloud is a bit much. Especially when you have to sit at your computer while tech’s perform their duties. Need to have a better way to transfer files to the cloud. I have a business and other responsibilities that don’t allow me to take this type of time. Tech support was very polite and seem to try and do their best. Had to request escalation of the problem before it got resolved. Once resolved everything works fine with the application. New customers should be told up front that the process may take this long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Carter",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T19:13:35.000Z",
          "Titre": "The tech knew what he was doing",
          "Contenu": "The tech knew what he was doing, but didn't convey the relevant information.  I had to reinstall windows and didn't know I had to reinstall the drivers. He had me do a screen share and corrected the problem, but didn't tell me what he did.  I only know because I was watching. I would like to download the drivers in case I ever have to do this again, but he didn't tell me where they are."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-13T13:25:07.000Z",
          "Titre": "It took forever to figure out that the…",
          "Contenu": "It took forever to figure out that the only problem was that I was missing the scan driver.  Rowell was very patient with me, however, and I appreciate his being willing to show me how to manage between the scan screen and the cloud.The previous version had the scan and the files all on one screen.  I feel that having to open two different things to scan and file is a bit bulky and should be put back into one site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom S",
          "Nb_Reviews": 2,
          "Date": "2021-01-20T20:03:00.000Z",
          "Titre": "I recently had an issue with nest…",
          "Contenu": "I recently had an issue with nest receipt.   I am using legacy software.   They would not even talk to me until I purchased a subcription so i had to purchase a gull year upfront.  The fix was relatively easy once they started their support.  They resolved my issue and the support tech was super helpful.  I feel the policy of only helping subscription customers is a little challenging especially since I've been using desktop neat receipt for over 7 years without an issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay Walston",
          "Nb_Reviews": 3,
          "Date": "2021-08-10T00:22:13.000Z",
          "Titre": "I was looking for a driver that would…",
          "Contenu": "I was looking for a driver that would allow me to use a different scanner on their Nest program.  She did not give me the information I was looking for.  She did give me a link to the manufacturer of my scanner but it was of no use. I will no longer be using their software."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Howard Hill",
          "Nb_Reviews": 1,
          "Date": "2021-06-01T16:23:59.000Z",
          "Titre": "Cloud Version Lacks Mass Export Functionality",
          "Contenu": "I have been using NEAT software for scanning receipts since it was just a desktop application,  I switched over to the cloud-based version last year.  It's been handy and useful, but I was very disappointed to learn that from the cloud based version, I cannot do a bulk export of data to a csv file or any other way  I have hundreds of receipts filed, and I need to export them so they can be summarized easily for tax purposes.  Without that function, I am limited to viewing my receipts online or exporting them in increments of 100, which is a lot more work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-02T18:49:33.000Z",
          "Titre": "Victor was really good",
          "Contenu": "Victor was really good. It's the software I have trouble with. Bugs seem to pop up often with the software and it is time consuming to repetitively call tech support. That's why I am happy to be on the User Review group to help influence future software development. I've been using this for years and have invested a LOT of time in it. It needs to work, whether Mac or PC. I am a Mac user. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 1,
          "Date": "2019-06-03T15:25:09.000Z",
          "Titre": "My Neat",
          "Contenu": "I love my Neat, being able to scan multiple docs and store directly, and do NOT like that it is now internet/cloud based. Customer service is through e-chat. I just want to save my stuff to my computer, and not involve an outside entity. It also is expensive to have cloud access (that I don't want), and must be purchased for a year."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bruce Thomas",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T18:27:03.000Z",
          "Titre": "Software does not combine files, and other issues",
          "Contenu": "Software does not combine files. It will not show a full screen image without downloading. Also, thanks to the tech who assisted me, I was able to find a work around to save a business card to my contacts file; however, the software should have worked.This image was good in the preview and would only save 2/3's of the image upon saving. Still more work to be done, before 5 stars can be given."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karen Confessore",
          "Nb_Reviews": 4,
          "Date": "2018-07-28T10:58:10.000Z",
          "Titre": "While I was greatful the agent helped…the sales pitches are annoying",
          "Contenu": "While I was greatful the agent helped me repair my issue quickly,I am disturbed that every time I call for assistance they try to “sell” me an upgraded yearly package. I don’t need anymore services that I subscribe to.im not a business and don’t use quick books. And after telling tje agents this,they STILL try and upgrade me. If I say it once,I wish they’d let it go."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terrence Sanchez",
          "Nb_Reviews": 7,
          "Date": "2018-04-23T14:25:37.000Z",
          "Titre": "Spent over 5 hours on a chat with tech…",
          "Contenu": "Spent over 5 hours on a chat with tech support. The tech agent kept leaving me to spend time on other chat sessions. Waited as long as 45 minutes for him to return to me to continue helping with my issue. That was totally unsatisfactory even though he did finally solve my issue. The agents should deal with just one customer at a time. My issue should have been solved in no more than a couple of hours, not five."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-06T00:08:27.000Z",
          "Titre": "Was happy that this man only took a few…",
          "Contenu": "Was happy that this man only took a few minutes to fix what I had called in for two months ago. At that time I was on the phone for several hours that was the reason I hesitated to call back to have it fixed still don’t know how to use the scanner they make it very complicated and I have a degree in computer applications graduated the Top of my class!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T19:17:18.000Z",
          "Titre": "software",
          "Contenu": "liza was wonderful and very helpfulthe new software is hard to work with and more time consuming than old 5.7 program  i do not recommend it for anyone who is in a hurry or just wants a simple file cabinet to store reciepts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wes",
          "Nb_Reviews": 14,
          "Date": "2018-02-15T23:11:49.000Z",
          "Titre": "Once Per Use Crash",
          "Contenu": "I have been a Neat user since the beginning. I fought hard against the move to the cloud. While I do appreciate the cloud now, I don't know if I have found a much more buggy software than Neat. It seems to have some counter that makes it crash at least once per use for no apparent reason. Why a program that simply does a process that copiers have done for 40 years cannot operate without a crash per incident is beyond me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SCOTT",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T16:29:26.000Z",
          "Titre": "Unhelpful tech support",
          "Contenu": "They were unable to resolve my issue and were totally unconcerned.  The person actually terminated the chat session after telling me that the only solution was to pay a lot of money for an annual subscription.  All I want to do is open my old data on a new computer.  I do not need cloud storage or any of the other features in their new subscription plan."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patricia McKeon",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T18:26:01.000Z",
          "Titre": "I was told you no longer sale scanners…",
          "Contenu": "I was told you no longer sale scanners and that I would have to buy a new one.  I don't know why I even need neat as I don't use any of the neat software....I only scan to my personal computer.  If the scanner gets to where I can't read the documents, I will purchase another one that doesn't need me to pay for the privilege of using it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "H.James Hulton III",
          "Nb_Reviews": 4,
          "Date": "2018-05-16T15:21:29.000Z",
          "Titre": "Your NEAT DESK Scanners Unreliable",
          "Contenu": "Your NEAT DESK Scanners are not very reliable. I have had to return two of them recently because they do not do the job. The documents get stuck in them part way through. It's a common fault. Someone was supposed to send me instructions on how to use my smartphone to scan documents. I have not yet received that. That was over two weeks ago."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Calvin",
          "Nb_Reviews": 4,
          "Date": "2018-04-25T23:55:54.000Z",
          "Titre": "repetitive problem with \"no scanner…",
          "Contenu": "repetitive problem with \"no scanner connected\" when signing onto NEAT.  This is a NEAT problem and has been going on for 18 months.  About time to fix it at NEAT's end so calls not needed to fix problem.  In legacy, NEAT did all the cropping automatically, so cloud can take twice as long unless documents are 8.5\"x11\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy L.",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:41:42.000Z",
          "Titre": "Neat Software Udapte",
          "Contenu": "I could not access my Neat software after updating my Mac to High Sierra.  Kevin Jan D was able to reinstall another version of Neat successfully.  My ongoing problem is now the daily phone calls/hang-ups from Neat.  When I answer the call, the caller hangs up on me.  I cancelled my automatic renewal of my software before Kevin resolved my main issue.  I planned to reinstate my renewal, but If the calls continue I will not renew and will file a complaint with the BBB."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T20:37:10.000Z",
          "Titre": "The person I spoke with was hard to…",
          "Contenu": "The person I spoke with was hard to understand and I don't believe they were very educated on your product.  I asked several questions and they didn't seem to understand what I was asking.  Language barrier was very frustrating!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lawrence",
          "Nb_Reviews": 1,
          "Date": "2019-04-27T14:52:28.000Z",
          "Titre": "My email that my original account was…",
          "Contenu": "My email that my original account was under, became no longer available, so I established a new email. It took from sometime in February until yesterday to get all my documents over to a new account with my new email. That was much too, too much time and required my computer to be tied up for most of each day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy K",
          "Nb_Reviews": 1,
          "Date": "2015-03-25T20:41:12.000Z",
          "Titre": "not with the money",
          "Contenu": "The device does not work with my tablet.  It did not work immediately with my laptop- I had to get assistance- although the techs I talked to were pleasant and helpful.  When it did work for me, it was slow to scan, and slow for the software to read it.  I stopped using it and am photographing my documents and creating my own filing system via my own cloud hard drive.  It was a waste of money for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynn P",
          "Nb_Reviews": 2,
          "Date": "2015-03-12T22:56:57.000Z",
          "Titre": "Backup process is tedious.",
          "Contenu": "When scanning and editing documents the back up gets confused and does not keep up with the changes made. When editing a new document the backup process is running and either drops the title to the document or creates a second copy. The backup does not keep up with the changes made. So you have to turn off back up. Do all the scanning and editing and then turn it back on and wait till the backup completes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathie Thomas",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T17:10:41.000Z",
          "Titre": "Jolyn works hard",
          "Contenu": "Jolyn works hard, yet this process has been very challenging. She needed a preparation check list or something from Neat to help her let the client know how much time and hard drive it takes. It took weeks. I think there has to be a better way to prepare your clients and to explain the length of time it takes to get this done. I had no idea how much hard drive it would take up or the hours it would take. I couldn't just sit by the computer and wait for days. I loved the old system, not crazy about having to learn a new one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gay Cavanaugh",
          "Nb_Reviews": 1,
          "Date": "2018-05-03T16:03:40.000Z",
          "Titre": "Disappointed",
          "Contenu": "My parts order went fine however that didn't fix my ND-1000 issue and you have no repair facilities. Paying $79.00 for tech service that doesn't mean they can fix it either so what is a person to do. Your company wouldn't even answer a letter I wrote. Guess home users are not as important as business folks"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "MinistryOfTV",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:14:02.000Z",
          "Titre": "Neat is fine, and could be so much better.",
          "Contenu": "Neat is fine. I preferred many of the functions of their old software, but the constant crashing was a major issue. The new software is basically the same, but with a less intuitive GUI, less features and functions, slower to load, and no ability to edit (that I've found) multiple items as a group. Unless you're working on a 27\" screen or bigger, the scanned receipts are too small to read without zooming all the way in, which is slow. Neat's basic and fine, but could be so much better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "sharon",
          "Nb_Reviews": 1,
          "Date": "2019-07-18T13:14:07.000Z",
          "Titre": "I have used Neat Receipts for about 5…",
          "Contenu": "I have used Neat Receipts for about 5 years now and they old desktop version is ALOT better than there cloud.  I don't understand why you can't have it so we can customize it so it will work for us.  Such as be able to add our own fields and customize our reports the way we want it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "CB",
          "Nb_Reviews": 1,
          "Date": "2018-11-02T22:55:29.000Z",
          "Titre": "The customer service was great",
          "Contenu": "The customer service was great!  ... But the box states clearly the software and scanner work with Intuit QuickBooks. There is no additional cost IF you use the mobile version QuickBooks. If you don't, there is a monthly charge to have it work with the desktop version. I had hoped to plug it in to my computer like any scanner and have it directly input to my desktop QuickBooks. I feel misled. An ongoing subscription price difference sounds different than the 'includes neat premium bundle' printed on the box."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robert  Schumaker",
          "Nb_Reviews": 1,
          "Date": "2018-06-06T14:10:06.000Z",
          "Titre": "Overall, good concept. It all works consistently 70% of the time.",
          "Contenu": "Customer service is great. The client software is buggy as Hell. Always has been, despite numerous revisions. The Desktop Scanner needs adjustment quite frequently, despite some instructions on accomplishing that. Such examples are paper feed issues, customizing dark or light preferences, disparities between online and offline versions of scanned data, etc. Would be nice to have a service center to do routine maintenance for a very reasonable fee. Otherwise, digitizing my paper world is awesome. I'm very happy with my decision to do that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul Fisher",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:23:36.000Z",
          "Titre": "The customer service was fine",
          "Contenu": "The customer service was fine. My problem is with the loss of a MAJOR function with our \"upgrade\".I find it hard to believe that an \"upgrade\" actually takes away a MAJOR time saving function. That function being, the ability to print from email to NEAT. The fact of the matter is this \"upgrade\" is going to cost more money in administrative wages by taking the time, not to mention printer ink, to actually have print out the email documents, then rescan them into the NEAT system. I'm not happy Thanks Paul Fisher"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cardene",
          "Nb_Reviews": 1,
          "Date": "2018-06-20T01:00:41.000Z",
          "Titre": "Average availability",
          "Contenu": "Whenever I scan a number of documents, my scanner locks up on me and I have to close everything down. If you can explain why this happens, I would greatly appreciate it. I have been using NEAT for a number of years and since I upgraded to NC1000 I have had more problems."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don C-W",
          "Nb_Reviews": 3,
          "Date": "2018-04-26T16:14:01.000Z",
          "Titre": "Decent customer service",
          "Contenu": "Decent customer service.  Some confusion over offer I had been given and whether I was actually eligible.  They ended up making the offer and I accepted.  Then some confusion how it could be activated.  In the end, with some effort, it did all work out for the best."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anthony Marra",
          "Nb_Reviews": 3,
          "Date": "2018-04-26T16:27:32.000Z",
          "Titre": "Not all that happy",
          "Contenu": "The transition to a subscription based system when a user like myself who previously only wanted to scan to his computer is obnoxious and quite sneaky.  There should have been an option to grandfather in prior users who could avoid the subscription rip off if they did not need cloud services.Your support people are helpful but the need to communicate by email wastes too much time.  A phone call could resolve the issue I had in about 5 minutes.  Instead back and forth emails wasted 2 days and too much time.I am not happy with your company and I gave you 3 stars just to be nice!."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R. Bradshaw",
          "Nb_Reviews": 1,
          "Date": "2018-04-30T08:17:58.000Z",
          "Titre": "Used to love",
          "Contenu": "Love the program, but was extremely dissatisfied with the fact that because i lost my original program disk, i am now forced to use the online program.  I do not trust the cloud and i do not understand why i have to now pay monthly for the same service i had already purchased at a premium price when i initially purchased my NeatOffice. If i knew this ws going to happen,  i would not have shelled-out the almost $1k to begin with. I give 3 stars becuase program is great, but i would give negative 3 stars for their lack of assistance in us longtime customers and gouging us for more money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer L",
          "Nb_Reviews": 1,
          "Date": "2015-07-10T00:49:10.191Z",
          "Titre": "Good but not Great",
          "Contenu": "The scanner works well most of the time.  It doesn't always scan the information correctly.  I didn't like the chat option for help - getting someone on the phone works best.  It is nice to be able to email what has been scanned.  Also it's easy to find things."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Forbes Consulting",
          "Nb_Reviews": 3,
          "Date": "2019-08-02T21:22:54.000Z",
          "Titre": "The problem I called to address was I renewed my Neat account that had an old email address. I was transferred to an agent to make the changes necessary to access my files using my new email address.",
          "Contenu": "The problem I called to address was resolved, but the process took longer than I deemed a trained/ experienced service agent should have taken. Either the individual was new or they were handling more than one case note during our interaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T21:08:19.000Z",
          "Titre": "i prefer the original software to the cloud software.",
          "Contenu": "It was difficult to explain what I was trying to do to the support individual. I am still struggling with the cloud version of Neat in terms of functionality, searching, stability, availability versus the original version. I liked my original better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Morgan",
          "Nb_Reviews": 1,
          "Date": "2018-06-18T19:44:42.000Z",
          "Titre": "scan worked well until i was forced to…",
          "Contenu": "scan worked well until i was forced to upgrade to cloud service.  then in effort fo charge me for what i had already purchased the software would not work at all.  spent quite a long time with support in order to get back in service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry Berman",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T20:21:38.000Z",
          "Titre": "Updates and Improvements Needed",
          "Contenu": "I feel the software form, fit and function needs to be updated after so many years. The text recognition needs to be improved. Lastly, the Neat Verify must be checked for correctness. You can't assume they've done it right."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Francis Serio",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T18:27:48.000Z",
          "Titre": "I am not happy with the way they change…",
          "Contenu": "I am not happy with the way they change software to be web based only.I also would like to have entire folders on a  my own thumb drive but told that I could not backup entire cabinet  on a thumb drive like I did in the past."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob R",
          "Nb_Reviews": 11,
          "Date": "2015-07-01T22:46:13.743Z",
          "Titre": "Moderately user friendly.",
          "Contenu": "A lot more though needs to go into simplifying the interface and making it much more intuitive.  It's a great product, but needs much more effort on the user end experience than on the technology side at this point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yvette Bertram",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T23:33:24.000Z",
          "Titre": "$6 a month for ?",
          "Contenu": "I contacted Neat to find out what I am receiving for the monthly payment of $6-instead of getting a call or an explanation I was directed to a web site. I would definitely prefer a more personal interaction."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dennis K",
          "Nb_Reviews": 2,
          "Date": "2015-07-01T22:01:48.761Z",
          "Titre": "review of the Neat",
          "Contenu": "For the most part, the desktop version scans very well and moves items to the computer well.  There are times, however when I am scanning items to several folders and when I move to the next folder, it shifts the folder to be a sub folder of the one I scanned the previous document to.  The mobile app could be more user friendly for finding items and for scanning items back to the cloud and the desktop.  \rThe product has been good for scanning and filing bills and for scanning and forwarding items as attachments with emails.  I seem to need to store the scanned item to my desktop documents and then use the document to attach to my email.  That seems like an added step and does get a little cumbersome.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BARBARA JOHNS",
          "Nb_Reviews": 3,
          "Date": "2019-07-24T17:20:08.000Z",
          "Titre": "Complaint",
          "Contenu": "The. NEw program is very difficult for older people. The 5.4 was very easy. This program is ridiculous! Claire was the person that helped me and she is remarkable. Very patient and very helpful!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Turkovich",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:12:13.000Z",
          "Titre": "I had to wait several days for a cable…",
          "Contenu": "I had to wait several days for a cable to arrive from Neat & then played phone tag for a few days with the Neat Rep.  When we finally got together, he was able to satisfactorily solve the issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Helen Bracciodieta",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T18:57:52.000Z",
          "Titre": "it keeps throwing me out   also the…",
          "Contenu": "it keeps throwing me out   also the headings in different categories don't fit what i am saving i wish i could enter the headings myself   also not able to save to a external drive"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lloyd C",
          "Nb_Reviews": 5,
          "Date": "2018-04-27T00:24:55.000Z",
          "Titre": "Disappointment",
          "Contenu": "I'm not happy with the direction the company has gone. The new cloud based model with monthly or annual subscription fees is a slap in the face for longtime personal users."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-28T22:12:15.000Z",
          "Titre": "I feel like the representative was not…",
          "Contenu": "I feel like the representative was not really \"on top of it\" in terms of understanding the problems and the solutions.  At one point, it appeared that she had to seek help from someone else, and I overheard the conversation in a foreign language, but with no explanation of what was happening.  Eventually everything was worked out, but it took an inordinate amount of time and, in some cases, I had to repeat several times what my problems were before they were understood.  Also, on Friday, she wouldn't connect to my computer to solve the problem but had to re-schedule for several days later (after the Memorial Day weekend).  The call was about 15 - 20 minutes late, with no email saying there would be a delay.  I often had a hard time understanding the representative.  Overall, the experience was inferior to other support sites that I have used."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Reyes",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:24:02.000Z",
          "Titre": "My experience with the representative…",
          "Contenu": "My experience with the representative was fine. It’s the software that I have issues with for the Mac and OS for mobile devices that I’m not happy with. In my opinion the software should work seemlessly together between the iPhone, the iPad and the desktop software with the cloud system and in real time. They also should have the same exact features across all platforms. If you want to be a leader in the industry then you have to get it together. It’s a great concept but needs some fine tuning.  Also I would like to see the same level of dedication to the Mac and it’s mobile devices as to the PC.  I would also like to speak to an American vs a foreign speaking person with a difficult accent to understand. Also would like to spend the time speaking to the agent during the troubleshooting process instead of chtting with the agent in a chat room. The experience is a lot different."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "E Brame",
          "Nb_Reviews": 1,
          "Date": "2018-05-06T22:10:07.000Z",
          "Titre": "Due to the company's change in mission…",
          "Contenu": "Due to the company's change in mission (no longer servicing or selling hardware) I don't have the experience with necessary to rate them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John A",
          "Nb_Reviews": 2,
          "Date": "2015-03-24T16:29:41.000Z",
          "Titre": "NEAT Initial Review",
          "Contenu": "I use for home only. My initial impression follows:\r1. Difficult to understand how to operate initially.. Took over two hours to get correctly installed because of faulty software and only through help of NEAT technicians by purchasing $49.00 two year customer assistance plan. Outstanding customer service once plan was purchased.\r2. Scanner that came with purchase package did not work. Replaced under warranty. Wasted one week waiting on exchange.\r2. Much redundancy to Quicken.\r3. Slow, slow, slow to PROCESS scanned documents, receipts, etc.\r4. Frequently selects wrong amount for sales tax on receipts.\r5. Must review every document input to verify correctness.\r6. Frequently have to re-scan because of lack of clarity on some of pages scanned especially for mult-page documents..\r7.Requirement to set \"combined or separate\" documents and \"one-sided versus two sided\" documents is often forgotten which then requires re-scanning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Schindler",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T15:12:24.000Z",
          "Titre": "Great system for new user, terrible if transferring from Legacy",
          "Contenu": "I had the original Neat system, and was very disappointed when they went from that system to the current system.However due to the poor image quality from the original software I finally bought a subscription of the system they currently have.I tried the system out on a trial basis first and the quality was 100 times better and filled in more info.So after spending $300+ for a year subscription, I was told to contact support to transfer my files from the Legacy version to the cloud.They started the process and I had 22,000 files worth a total of under 2GB of data.After over 2 weeks with my computer on 24/7 I am not even at 50% of upload. My speed is 14 MBPS upload, so it should be completed, yet they keep saying it depends on so many things.I am very disappointed that it take this long to transfer the files with no end in site. I really do not need the online storage, as I back up my data multiple ways, yet the fact that Microsoft no longer supports the old software if I need to transfer in the future I would lose all my data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marty Gold",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T16:39:18.000Z",
          "Titre": "Company  support…",
          "Contenu": "Company is very reluctant to support their legacy products mandating online subscription Therefore not very supportive of legacy customers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nour",
          "Nb_Reviews": 1,
          "Date": "2018-05-05T01:37:56.000Z",
          "Titre": "My Response to Neats Response to my 1st email",
          "Contenu": "The Representative that helped over the phone was great. I appreciate that he helped me resolve the issue I had but I am NOT happy that all of your services are for Cloud Customers Only. That is not fare to all of the clients that have your product and want to continue business with Neat that don’t want or use the cloud. Neat should support ALL aspects and issues that clients have with Neat products. Support All or you will continue losing more loyal clients.Your Response was these are some options and this is what is states in the link you attached to your response “Please keep in mind that the retired desktop software is not supported and the installation link for these versions are no longer available. We cannot guarantee the integrity of your data if you choose to continue to use a retired version of Neat.”What? No guarantee to the integrity of your Data if you use non cloud desk top “Retired” version?!!! That’s bull - - - - Support All aspects or you will lose loyalty."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J R Williams (J&J Racing) Transfer Flow Customer",
          "Nb_Reviews": 4,
          "Date": "2018-12-05T05:50:28.000Z",
          "Titre": "First of all the new program takes…",
          "Contenu": "First of all the new program takes longer to use than the old one. Secondly, I was never informed that my old program would quit loading to the cloud at the end of November. Then, when I finally contacted you the technician who was a very nice man, downloaded the new program to my desktop and laptop, but we lost all of my downloads from Nov. 30th until now. Then, the program had issues that another tech worked on. He resolved the main issue, but in doing so the scanner quit working. He began working on that and then left at the end of his shift without telling me he was leaving. Ten minutes later I contacted your service again and another friendly representative got my scanner working again but I am still having issues and will have to make arrangement to connect with a senior technician. I wasted nine hours today just trying to get your program working and I'm still not sure it will work and if it does it seems to be much slower than the program it is replacing. I am sorry I ever came on board to many years ago."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kurt",
          "Nb_Reviews": 4,
          "Date": "2018-07-16T16:22:34.000Z",
          "Titre": "I love the product that Neat Receipts…",
          "Contenu": "I love the product that Neat Receipts offers, but when I need help it seems very problematic to get resolutions to my problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RH",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:24:39.000Z",
          "Titre": "Long time customers are forced to use…",
          "Contenu": "Long time customers are forced to use their cloud bases system, for a fee, after purchasing the original product. No support."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2015-07-12T16:53:47.747Z",
          "Titre": "Good product but software very slow",
          "Contenu": "I like the way Neat organizes receipts, but both the scanner and the software are very slow, even using a very fast computer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Mars",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T23:16:08.000Z",
          "Titre": "The Tech support person was well informed but...",
          "Contenu": "The support tech was well informed and did a great job. My problem is with neat company itself. They have abandoned everyone who has purchased their scanner. Neat company is no longer producing or updating the software necessary to operate the scanner. They are instead going for the big money and forcing it's customers to subscribe to their online cloud services!! Tragic mistake! I have thrown my scanner in the trash since it is now completely useless. I spent good money for my ND-1000 and I can no longer use it. What a horrible company!!! To assume that every user wants to join a pay per month cloud service to scan receipts and automatically send them into QuickBooks or some other program is just plain defective thinking! I am a realtor and I need a doc scanner to convert paper into PDF files... as do many others I have spoken with about this crazy move!!!  Good luck, but I am outta here! Done with Neat and their money scam cloud BS!!! Why on earth would anyone want to pay another $10 a month for the rest of their lives on top of the already pricey original purchase of the scanner!!??? Someone needs to be fired at neat!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Razmik Minasian",
          "Nb_Reviews": 1,
          "Date": "2019-07-01T21:19:48.000Z",
          "Titre": "Lots of settings needed before  it…",
          "Contenu": "Lots of settings needed before  it becomes great to have tool.Otherwise great customer service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-11-21T18:51:39.000Z",
          "Titre": "I found it difficult to understand the…",
          "Contenu": "I found it difficult to understand the person due to heavy accent; he was polite and helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George Miller",
          "Nb_Reviews": 2,
          "Date": "2019-06-06T17:42:50.000Z",
          "Titre": "Neat's customer service has forgotten…",
          "Contenu": "Neat's customer service has forgotten the benefit of actually talking to a customer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T08:52:33.000Z",
          "Titre": "Like Neat but needs some extra work!",
          "Contenu": "I tried to post suggestions and ideas with in neat program but it wants to change my password before proceeding! I have used neat for several decades and love the simplicity of scanning my receipts to set up for reports during tax season. I have some issues with your recent upgrades. Your orange colored platform was fabulous. It was a one click type deal and you could scan your receipts, edit and send to your folders. Now with this blue utility thing we have to click on the icon, scan doc, open browser, sign into neat, edit doc, then send to folder! In your attempt to make upgrade feature you’ve inadvertently created MANY more step for us to use the software. A quick solution to this, and one I’m surprised you haven’t thought of yet, is to simply add a neat cloud link to the blue scan utility. That will reduce those extra unnecessary steps you’ve created for us.Lastly, your neat books service nice as it is and possibly a decent competition to quick books is WAY TOO EXPENSIVE at almost $500/year! You need to come down significantly on this service if expect us customers to purchase that service and expand your customer base. A nice sweet spot for this program is an annual price of $250-289/year. Otherwise your not going to be me and others to subscribe to that service and many of us just might go ahead and change to quickbooks service. You got a great program! Don’t screw it up by being too greedy by overcharging for the service. At least this is my opinion!!!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Herb Dexter",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:29:22.000Z",
          "Titre": "i want to save my neat on my computers…",
          "Contenu": "i want to save my neat on my computers external hard drive and not cloud base"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karl Stephenson",
          "Nb_Reviews": 3,
          "Date": "2018-05-04T02:42:23.000Z",
          "Titre": "TO LONG TO GET A HOLD OF SUPPORT REP…",
          "Contenu": "TO LONG TO GET A HOLD OF SUPPORT REP DIDN'T KNOW HOW TO HELP. NOT HAPPY"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "susie snyder",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T14:56:31.000Z",
          "Titre": "My problem was not solved but he tried…",
          "Contenu": "My problem was not solved but he tried his best to help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-11T18:43:28.000Z",
          "Titre": "Website had problems...Micah the rep…",
          "Contenu": "Website had problems...Micah the rep was very good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Scapes",
          "Nb_Reviews": 1,
          "Date": "2019-05-31T17:20:28.000Z",
          "Titre": "Love May Ann G.!",
          "Contenu": "Love May Ann G.!Don't love the product, yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim Hall",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:35:48.000Z",
          "Titre": "Too difficult to get to the appropriate…",
          "Contenu": "Too difficult to get to the appropriate advisor."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 2,
          "Date": "2020-01-21T18:19:59.000Z",
          "Titre": "not as convent & easy to use as cliamed"
        },
        {
          "Note": 3,
          "Lieu": "BB",
          "Pseudo": "Eric Fawcett",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T17:38:31.000Z",
          "Titre": "More work needs to be done to the…",
          "Contenu": "More work needs to be done to the app!!!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T16:16:47.000Z",
          "Titre": "Very informative and well worth the…",
          "Contenu": "Very informative and well worth the time, I would have been completely lost without this training,It was hard to get going on the schedule"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Van Horn",
          "Nb_Reviews": 4,
          "Date": "2023-10-24T01:08:36.000Z",
          "Titre": "Slow after clicking on the SEND button. At times, it has taken up to TEN (10) minutes before the document is available .",
          "Contenu": "Had a problem with NO DOCUMENT DISPLAY in any of my folders. I contacted customer service, and was guided through the process of clearing my cachs, (which had caused the problem after an update was done by NEAT without informing the users about the problem it caused)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walker Linda",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T08:37:22.000Z",
          "Titre": "Liza did a wonderful job transferring…",
          "Contenu": "Liza did a wonderful job transferring all the data from the retired Neat app to the new one. It took a while, but, she did it.  Thank you Liza!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T01:19:08.000Z",
          "Titre": "Thanks Liza for Great Customer Service!",
          "Contenu": "Thanks Liza for Great Customer Service!Although it took awhile for a rep to join the chat, once Liza came online she immediately addressed my issue. Strong and capable CSR’s are vitally important, so it appears your properly training your people to meet customers needs and expectations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Nevens",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T16:23:07.000Z",
          "Titre": "Thankful for Liza",
          "Contenu": "The initial interaction of trying to explain in a chat box is frustrating, but the silver lining is that it connected me with Liza. Liza was extremely helpful, and once we spoke on the phone it was easier to convey what my issues were. While my NEAT was down for a week, some issues on my end were some of the cause, Liza worked very hard to get me taken care of."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-15T21:58:11.000Z",
          "Titre": "I like your product and have been using…",
          "Contenu": "I like your product and have been using it for over 5 years and the only reason I did not give it 5 stars is because I haven't been able to see my invoices for my monthly fees for a few months now. I would think a company whose main business is tracking expenses would be able to sort our this issue faster than it has. Liza did a great job in trying to get things resolved and emailed a copy of my invoice so I could reconcile my credit card statement and I appreciate her efforts. As soon as I can see my invoices without jumping through hoops I will give a five star rating."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Desert Batman",
          "Nb_Reviews": 2,
          "Date": "2023-06-13T22:11:08.000Z",
          "Titre": "Password change",
          "Contenu": "Needed a password change which was accomplished successfully by Liza. Took a little longer than I had hoped for when I contacted the chat. Wondered if the rep was working more than my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "StarchMD",
          "Nb_Reviews": 6,
          "Date": "2023-06-29T22:59:04.000Z",
          "Titre": "Neat Scanner software was supported again w/ latest MacOS!",
          "Contenu": "I was very disappointed in 2020 when I learned that the Neat Co announced that they discontinued software support for their scanners. They were moving in the direction of info management. I purchased the software for about 67% of the hardware scanner that I had bought several years ago. I was not able to get it to work & did not have time to address due to competing priorities, instead relying on the iPhone scanning apps. Subsequently, I saw an \"annual\" renewal which I was upset about. When I finally called, the rep stated that the company now was supporting the updated Mac software & had a cheaper package. He walked me through the installation process & I was thrilled to have my scanner functional again! I was also thrilled to see him plan to refund me > $150! If so, I will now again be a supporter of this product (ND-1000)!=== 2023: unfortunately, they discontinued their software support for the great scanner so I discontinued with their service…"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer BE",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T17:06:32.000Z",
          "Titre": "Tech support fell a little short, Billing support was ok",
          "Contenu": "Initially I had a difficult time to get technical support to assist me with my issue.  I could not get chat started and there was no phone number easily found to call Tech Support.  I took out a trial subscription for support and never received an email about being charged for a yearly subscription.  I called the phone number on my credit card statement and was able to get to tech support and get the issue resolved, which is a work around of sorts, but I am finally able to use my neat scanner again.  I then called and talked to billing regarding why I didn't get a notification of the charge and asked if there was a month-to-month option.  The rep requested the refund of the yearly subscription and will process a monthly subscription.  The billing rep was courteous and helpful.  The Tech support rep was a bit difficult to understand and it took over an hour for a process that I believe should have only taken maybe 30 minutes or less."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edna Lou Schaub",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T04:00:44.000Z",
          "Titre": "I should give 5 stars",
          "Contenu": "I should give 5 stars, but with most reviews I do if I do, I seldom give  the highest points. To be honest, a 5 star here should be given due to the fact Liza e-mailed me back in June when I first approached NEAT. Then when I e-mailed her back today 9/22'/22 and didn't connect, she persisted and called me. That's dedication for sure.   If \"things\" would change in the future will be sure to call her. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carol Niforatos",
          "Nb_Reviews": 4,
          "Date": "2022-10-26T16:41:10.000Z",
          "Titre": "Some initial delays in communication…",
          "Contenu": "Some initial delays in communication but they went above and beyond. Their issues are on keeping up with new Apple releases for their scanner drivers, but I think they have phased out of their own scanners. I only wish Neat made it simpler to scan receipts in via other scanners!Hi! I see you think that Liza was able to install a scanner driver - that isn’t true. She was awesome in trying, but if you check with her, you will see it didn’t work. She stated that you all are aware that you don’t have a scanner driver that works with the latest OS for Mac.Thanks! And thank you for working on the issue - you guys rock. Outside of this one thing, everything about NEAT is awesome!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerJ R",
          "Nb_Reviews": 1,
          "Date": "2022-05-17T20:27:38.000Z",
          "Titre": "Great representative",
          "Contenu": "At my old age I have a difficult time with computerize and find that this is a confusing platform - UNTIL I managed to speak with an actual representative and she did an excellent job helping to me correct my problem. Thanks to her I feel that my problem has been rectified."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-01T21:28:20.000Z",
          "Titre": "Had an issue with items taking…",
          "Contenu": "Had an issue with items taking extremely long to process. Liza was able to help me resolve the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerome Meyer",
          "Nb_Reviews": 3,
          "Date": "2023-03-24T22:42:13.000Z",
          "Titre": "Dolly the lady who helped me was very…",
          "Contenu": "Dolly the lady who helped me was very informative and very kind."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "custDennisomer",
          "Nb_Reviews": 2,
          "Date": "2022-10-24T21:51:19.000Z",
          "Titre": "NEATTECH+5 did an excellent JOb and was…",
          "Contenu": "NEATTECH+5 did an excellent JOb and was Professional and Courteous. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T14:03:30.000Z",
          "Titre": "Good patient customer service",
          "Contenu": "Hi Anna helped me Friday afternoon and I learned a lot from her! She was also patient with me as I had to stop her quite a few times for clarification due to my hearing loss. However, I wonder how crystal clear your phone connection is because there seemed to be an issue with her voice breaking up often."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ed Darling",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T10:21:44.000Z",
          "Titre": "It took too long to resolve the issue"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T16:01:10.000Z",
          "Titre": "Great service",
          "Contenu": "Great service! Very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-03-16T03:58:02.000Z",
          "Titre": "Well to start,I was the only one who…",
          "Contenu": "Well to start,I was the only one who showed up to the 1on 1 appt. After 3 hrs -I finally met w/Stephen who was able to get it all flowing after many trial & errors .. it took a while on my part downloading & restarting but, in the end I can say the program has improved tremendously! I can’t wait to get the hang of it so that it is effortless. Still have a few more things to figure out ! Here’s to 2021!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T22:30:10.000Z",
          "Titre": "May Ann G.",
          "Contenu": "I did not have to wait long for an agent.  The agent, May Ann G., was professional and courteous.  She did not show irritation at my lack of technical expertise, and did what she could to solve my problem.  The problem remains, but she gave me clear instructions and a demonstration of how to \"get around\" it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T22:21:47.000Z",
          "Titre": "I was disappointed by the high cost of…",
          "Contenu": "I was disappointed by the high cost of the annual Neat fee and requested cancelation.  The representative, Ramon said he could give me a discounted rate for this year if I'd stay. I stayed for this year, but I'm hoping Neat offers a cheaper product choice for next year."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J.V.C",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T00:45:53.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "Great customer support. I Have been a users for several years and I am a satisfied customer. The only reason I am not offering a 5 star rating is because I feel if I am paying $150 per year for the service I should be able to have a live person to speak to and not online chat support. the online chat support I have always received has been second to none. Very professional. J.V.C Stuart FL"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "carl kaufmann",
          "Nb_Reviews": 8,
          "Date": "2020-08-28T15:00:31.000Z",
          "Titre": "Fantastic support by Liza (neatteck+5)…",
          "Contenu": "Fantastic support by Liza (neatteck+5) getting my files transferred.  I was disappointed that I had to pay $150.00/year for a product that I purchased and was told that there would be no further charges or fees. All of my data was locked out. This was VERY important financial data used for tax filing since 1013.  I realy like the new system. It would have been better if I were not forced to purchase it.  I probably would have opted to upgrade if given the option."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-12T17:08:25.000Z",
          "Titre": "ANGELINA WAS AMAZING ON LIVE CHAT!…",
          "Contenu": "ANGELINA WAS AMAZING ON LIVE CHAT!I was initially disappointed that when contacting the online customer service phone number, it kept disconnecting me when I selected \"tech support\". However, I did try the LIVE CHAT and got connected with ANGELINA.  She was amazing!!  Helped me very quickly to resolve my problem.   I would give her 10 stars.  She was so wonderful!  She also followed up the chat with an email with helpful links to using Neatworks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T16:17:20.000Z",
          "Titre": "Good customer support",
          "Contenu": "Was not aware that the desktop software that I was using was being sunset.After getting a new PC (Windows 10) I was unable to get neat software in a usable state.   Contacted Neat support and after much time (45 minutes), we were able to utilize the software.Luv was very patient and polite.   He stayed on the phone during the entire installation/configuration process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julian",
          "Nb_Reviews": 1,
          "Date": "2020-01-20T21:28:17.000Z",
          "Titre": "Customer Support for Scanners",
          "Contenu": "Today I worked with Customer service to get the NeatConnect scanner set up, This device was purchased before they quit supporting, and has not been used until now. Though their site said it is no longer supported (which is the reason for the 4 stars) customer service still helped. Unfortunately, the first two agents I dealt with left the chat before solving the problem. But the third, Angelina, stuck with me until she resolved the issue and got it all to work. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-30T00:14:02.000Z",
          "Titre": "The process of moving files from legacy…",
          "Contenu": "The process of moving files from legacy software to the new cloud version was tedious. The tech lady was working from home and could only see my screen, but could not take it over.  She had great patience with me and got the job done. I hope the developers can streamline the migration and religion in procedures."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-07-18T02:28:06.000Z",
          "Titre": "Mediocre Software but Good Tech support",
          "Contenu": "Good tech support once I got to them.  The software has some features (limitations) I was not aware of but they are not deal breakers.   We share a five person (sales) group that uses this for receipts.  The sales guys loved seeing the sales manager receipt for the Mustang Ranch.  Apparently, there is no user privacy .The 4 stars are for the techs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T19:17:02.000Z",
          "Titre": "The representative at Tech Support was…",
          "Contenu": "The representative at Tech Support was very helpful and resolved my issue quickly. However, when I call for help with the program, it seems as though I can not get to tech support directly and spend a lot of time with the first operator who collects information that I have to repeat all over again once I reach tech support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-08T01:28:19.000Z",
          "Titre": "After suffering through using the…",
          "Contenu": "After suffering through using the orange icon with neat, they finally have something that does not take all day to process one document.  The customer support rep was more than willing to install the new software on my computer and give me a short tutorial on how to use it.  She was one of the best support reps I have dealt with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Medley",
          "Nb_Reviews": 1,
          "Date": "2018-08-08T14:52:10.000Z",
          "Titre": "My experience today with May Ann in IT at the NEAT company",
          "Contenu": "My experience today with May Ann in IT was very good.  She recognized the problem right away and fixed it in just a few minutes. Excellent service!As for the company, I don't like the fact that you have to pay for the service now and pay more if you want IT service. It may be the way the world is going, I just can't afford to keep paying all these companies a monthly fee."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim W",
          "Nb_Reviews": 1,
          "Date": "2018-12-15T06:23:04.000Z",
          "Titre": "Dedicated agent stayed on my issue until she got the neat software to run",
          "Contenu": "The agent worked very hard to get the neat software installed on my machine.  She had a very difficult time getting around some compatibility issues but stayed at it until she came up with a workaround.  I recently had to reinstall Windows 7 and then upgrade to 10 causing me to lose all of the applications and reinstall all of them.  I am having problems with a couple of other apps so I appreciate the time and effort that the tech spent getting me running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-21T16:16:41.000Z",
          "Titre": "Rep was great!",
          "Contenu": "May Ann G. is the only reason they are receiving a great review, during the training process the program loaded very slowly, the receipt did not load the right numbers and left over half the entries blank. I'm glad I did this 1 on 1 meeting before purchasing the subscription. I will be shopping around more for something that works. But Mary Ann G. was friendly and helped explain how to use everything in detail and let me ask questions. Great customer service skills to Mary!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T18:40:00.000Z",
          "Titre": "Excellent Support",
          "Contenu": "I have had excellent support from the NEAT support team; quickly assessing my issue and using every effort to resolve it, including very good follow up -- actually doing what they say they are going to do!  The only reason this is not a 5 star review is because I would have wished not to have the issues in the first place.  But Neat has a 5-star support team."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janie Orsborn",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T13:35:13.000Z",
          "Titre": "The person I spoke to was hard to…",
          "Contenu": "The person I spoke to was hard to understand and there was static on the line.  Very hard to communicate.  There were other questions I wanted to ask, but couldn't because of the bad communication.  Had to communicate via chat.  I've been learning as I go, but still there are times I would like to talk to a human and one that I can understand.  Please hire people that can speak Texas language for the ones of us that live in Texas."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 4,
          "Date": "2018-04-23T15:36:36.000Z",
          "Titre": "Neat has recently abandoned hardware…",
          "Contenu": "Neat has recently abandoned hardware but the integration of other vendor hardware does not yet have the same ease of use as when they controlled the hardware - yet. Not that it is bad - just different and less fused compared to what I was use to. The new NEAT Software does not recognize network hardware but requires a link to scanned files - cumbersome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "H. L.",
          "Nb_Reviews": 1,
          "Date": "2018-04-23T18:05:40.000Z",
          "Titre": "I had to renew my premium cloud service…",
          "Contenu": "I had to renew my premium cloud service and the assistance I received was very good.I only give 4 stars because I am so disappointed in the software compared to the old legacy software. Being now retired I use Neat for personal use. I miss many of the old features, I can hardly read the scanned items, I cannot forward a folder to my CPA,..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-20T19:55:30.000Z",
          "Titre": "The migration process took much longer…",
          "Contenu": "The migration process took much longer than expected (took place over 3 days), and it was difficult to understand the representative both because of his accent and background noise, but he was very polite and professional and got the job done! I'm very glad I didn't try to migrate the data myself."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Brockett",
          "Nb_Reviews": 1,
          "Date": "2018-07-13T23:26:53.000Z",
          "Titre": "Up and running in the cloud version",
          "Contenu": "Up and running in the cloud version.  Many, many documents were migrated from the desktop version 5.4 but lost their title and date entered.  Has been a real pain to have to open each document, determine what it is and give it a name and date.  Also have found a bug that freezes NEAT.  Am working on this with support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen J",
          "Nb_Reviews": 1,
          "Date": "2015-03-18T17:20:36.000Z",
          "Titre": "Like it very much",
          "Contenu": "When I first got it, it would not process the items scanned.  It just kept saying processing but never finished.  I called for support and they had to do some adjustments to my computer then it worked fine.  This has eliminated all the clutter of paper on my desk and in file cabinets that were over flowing.  Would and have recommended this product to all my friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Ondreako",
          "Nb_Reviews": 1,
          "Date": "2019-09-27T16:59:11.000Z",
          "Titre": "I found NEAT to be indispensable in my…",
          "Contenu": "I found NEAT to be indispensable in my line of work which involved global travel many times to remote areas where copying services etc were not available.For anyone who needs a portable office in a suitcase NEAT is a good choice, It is very light and portable and can be setup for use in seconds."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gayla D",
          "Nb_Reviews": 1,
          "Date": "2015-03-25T23:07:19.000Z",
          "Titre": "Easy to use, simplifies paperwork",
          "Contenu": "I've used Neat Receipts for years. It's fairly easy to use on a Mac, although the Mac software hasn't been updated for a while. I also have Neat Cloud, and loved that until the last update. Adding receipts on the fly should be wham bam easy, and I should be able to set preferences once and take my picture, and move on. Over all, I still will continue to use it, although I may not do as much uploading from the IPhone app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat S",
          "Nb_Reviews": 1,
          "Date": "2021-03-01T20:58:01.000Z",
          "Titre": "Steven worked with me to resolve issues…",
          "Contenu": "Steven worked with me to resolve issues with my neat scan utility on my computer and to walk me through the system, explain my questions with regard to what the system will or won't do, to include printing and reports.  Very patient and understanding."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-09T19:16:44.000Z",
          "Titre": "The Neat customer service…",
          "Contenu": "The Neat customer service representative, Lud, was very professional and helpful with the upgrading process.  The conversion of date to the newer updated software was extremely difficult and quite lengthy.  I would not have upgraded our system if  Lud was not available to help with the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ITHarleyGuy",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T19:01:19.000Z",
          "Titre": "I don't have a specific incident, but...",
          "Contenu": "I don't have a specific incident, but I have been using Neat for many years and although it is a generally fine product and works well with no major issues, I have several points to bring up. 1. The ACCOUNT NO. field only allows whole numbers; no letters, no leading zeros and no periods or other characters. This field should allow these other characters.2. The last time I used the Android version of Neat app, it would only bring up the first page of a stored image. It most of the time refused to show pages after the first one. I haven't had a chance to spend time with the web version so I'm hoping it is more responsive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Sirek",
          "Nb_Reviews": 1,
          "Date": "2018-08-17T14:43:43.000Z",
          "Titre": "Mark was helpful and knowledgeable",
          "Contenu": "Mark was helpful and knowledgeable. He was also easier for me to understand than many of the other people staffing your help center. Speaking of the help center: Please find a way to get rid of the background noise. Callers can barely hear, especially when many of the staffers speak very accented English. Also: it would be helpful if the tech support people were available until at least 10 p.m. weekdays and some weekend hours. I had to take time off from work so that I could finish a Neat migration at home!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-09-03T20:44:58.000Z",
          "Titre": "need Tutorials for each change to Neat",
          "Contenu": "Frustrated by constant changes and new system every time I seem to log in. Plus reports are difficult to generate under new system and I needed a support person to walk me through as the 31 page summary of how to do it was impossible to locate and videos showing how were outdated and irrelevant.  I have been a customer for many years but I think tutorials should go out (by category) so that users can learn the system each time it is revised.  Support person was patient and we were finally able to walk through changes to report generation"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T18:31:49.000Z",
          "Titre": "Customer service fine..New company technology leaves older customers on the fringe",
          "Contenu": "I have little or no problem with tower service, where I have issues is as technology in their company changes they tend to leave older customers and programs in the dust. It is more like here is what we are doing now so purchase the new and improved or tough. We might be able to help and we might not."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn Devine",
          "Nb_Reviews": 1,
          "Date": "2019-10-18T21:50:00.000Z",
          "Titre": "Cyrus helped me through a crisis in my…",
          "Contenu": "Cyrus helped me through a crisis in my office. A former employee had changed the password to my NEAT software AND we discovered she had not upgraded to the latest version.Cyrus spend many hours working with me to upgrade the software and convert our files before finally helping me with the password issue.I appreciate all the time Cyrus spent with me. Communication was a bit tough as I do not sit at that employee's desk and do not use her e-mail. Once I got a phone number, it was much easier to get to him.Thank you again for all your efforts!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom DeYoung",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T20:32:59.000Z",
          "Titre": "Legacy File Migration",
          "Contenu": "Have tried to migrate my legacy files to the cloud which has taken the better part of a week.  Many errors were encountered and fixed along the way.  Working with the cloud version is something that will take a bit of time to get used to but it seems to work okay.  Some of the windows that open to review or move files to their proper destination are a bit cobby.  Trying to navigate in a small window is not comfortable.  Why not make the window larger so that there is less scrolling and clicking.  On another note, Neatteam+6 was very helpful and patient which was appreciated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olivia H",
          "Nb_Reviews": 1,
          "Date": "2015-07-10T17:41:42.768Z",
          "Titre": "can't get on cloud",
          "Contenu": "My name is Geri Yaccarino and my employer is Olivia H.  It keeps asking for her password and she doesn't know it.  I try to put in for a change and asked again for the former password which we don't have.  This is my e-mail not hers and I am the only one TO use this program.  I need help to solve this problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich Brown",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:47:07.000Z",
          "Titre": "My question regarding the sorting of…",
          "Contenu": "My question regarding the sorting of business cards by Last Name was understood by my CSR. Let's hope he is able to communicate the need and logic of Last Name sort over the current First Name sort to the technical staff. Let's make this change; it will make Net a more useful program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Parrish",
          "Nb_Reviews": 1,
          "Date": "2018-04-30T11:25:37.000Z",
          "Titre": "Problem solved for now",
          "Contenu": "Kimart did a good job of resolving my problem.   I believe I had a technical problem with my NeatVerify credits refreshing, but he persevered and sought and gained approval to provide me with the credits I believed I was due.  I will be watching to see if the credits update correctly in May."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Fay W",
          "Nb_Reviews": 2,
          "Date": "2015-07-02T14:53:55.000Z",
          "Titre": "Love being able to find my receipts in one location.",
          "Contenu": "I absolutely love being able to find all of my receipts in one place.  I can make the category titles that make sense to me. I like being able to \"outline\" the category into sub-categories.\rI find it easy to get together the information for my taxes, but\rI still have not seemed to have mastered the ability to make a sensible, usable report though.  I think it's me.\rThanks for this great product.  I also appreciate the help fixing the scanner a while back; it's working great now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diverse Community Partners, Inc.",
          "Nb_Reviews": 5,
          "Date": "2015-04-22T21:29:58.000Z",
          "Titre": "Overall, the system works",
          "Contenu": "Hello, Overall I am pleased with the service. The challenge is the system crashes A LOT!!!  When you need support you have to wait. Then the person says its you? I love how it can store and provide reports.  I love how i can scan with my phone. However, you end up having multiple account set up on your cloud?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lyle",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T20:43:18.000Z",
          "Titre": "The representative was wonderful . . .",
          "Contenu": "I'm not happy that Neat requires a subscription and cloud account.  There are those of us that can't access \"the cloud.\"  All that to say that the representative on my support call (Lorren) was wonderful and patient and was able to graciously help me with my request."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Cichon",
          "Nb_Reviews": 3,
          "Date": "2019-10-09T17:55:47.000Z",
          "Titre": "On-line support Staff",
          "Contenu": "The staff providing on line support has been wonderful. They were patient and helpful resolving any question that occurred. In particular, Caesar ensured that the migration of data from the 'old' system to the new system progressed without difficulty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARK NELSON",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T11:41:34.000Z",
          "Titre": "Mixed feelings but Neat is working again.",
          "Contenu": "It wasn’t always clear what the tech was asking me to do but she was able to take control of my machine and fix the issue. I was confused and a bit annoyed that she then tried to get me to upgrade to a more expensive subscription that didn’t appear to offer anything different than I had and couldn’t give me a good reason why. As an Apple user I have always felt that Neat gives my platform second priority status and there have been many glitches and bugs in the program. If I hadn’t had my data already in Neat I would have abandoned it many times in the past. It does appear better than it was, though, and the quick access to support was refreshing and new in my experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-07T18:55:22.000Z",
          "Titre": "The cable connecting my NC-1000 to the…",
          "Contenu": "The cable connecting my NC-1000 to the computer became defective.  I sent a service request to purchase a new cable.  The cable was shipped within 2 days.  The only issue I have is there is no telephone number to call if there is a problem."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "dina backer",
          "Nb_Reviews": 1,
          "Date": "2018-08-01T17:13:09.000Z",
          "Titre": "i appreicated the help in fixing the… \"VIEW IMAGE\" display",
          "Contenu": "i appreicated the help in fixing the proplem....      we had some communication problems -- i seemed to be disconnected at one point... and i didn't know where the chat went.    In the end it was resolved and i hope the problem is fixed.  thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Burden",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T17:10:39.000Z",
          "Titre": "I have a Neat device that I purchased…",
          "Contenu": "I have a Neat device that I purchased from Best Buy a few years ago and it is not compatible to my computer because it not get updates. To buy a new one I have to pay a monthly fee to use my neat, that sucks. Every thing I have stored over the years I can’t get to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rinaldi Jacobs",
          "Nb_Reviews": 1,
          "Date": "2019-07-11T04:01:55.000Z",
          "Titre": "I had a good experience with my…",
          "Contenu": "I had a good experience with my customer service tech person. Unfortunately my scanner keeps getting a paper jam. I will call in the morning to see if there is a fix to this. Also I tried to export contact to Google but kept getting an error message"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Gliem",
          "Nb_Reviews": 1,
          "Date": "2019-07-03T18:24:41.000Z",
          "Titre": "Leslie M helped conduct a data migration",
          "Contenu": "Leslie M helped conduct a data migration to a new account as I needed to change my email address.  I would have hoped this was an easier task, however, Leslie spent about 5 hours doing the full migration.  Thanks for continuing to upgrade your services, however some could be quicker than others.  Been a loyal customer for more than 4 years now and the improvements are a bit slow compared to the competition.  Hopefully the credit for the unused portion of my previous account is refunded as promised.  All the work required for a simple email address change seems to not be very cost effective for the Neat Company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "curtis",
          "Nb_Reviews": 2,
          "Date": "2019-09-20T17:09:49.000Z",
          "Titre": "I've only had 5.1 installed",
          "Contenu": "I've only had 5.1 installed . I backed up my work , my computer quit now I tried to use my back up copy  it tells me that my back up copy is for a newer version and won't install ??? how did my 5.1 version get to be a newer version???"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jill Kaufmann",
          "Nb_Reviews": 2,
          "Date": "2018-09-12T14:59:44.000Z",
          "Titre": "Liza C helped me this morning with some…",
          "Contenu": "Liza C helped me this morning with some issues that I couldn't figure out using the FAQs.  She solved everything instantly and in a very easy to understand vernacular.  I advise all of my friends (especially the disorganized ones) to get Neat!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jud Sorensen",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T19:27:38.000Z",
          "Titre": "Some of the replies were slow in…",
          "Contenu": "Some of the replies were slow in coming.  I had also sent an after hours message on your live chat a few days ago and never received a response.  Also, I did not need a sales pitch at the end introducing me to new Neat plans."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Merrill",
          "Nb_Reviews": 1,
          "Date": "2019-04-29T22:03:01.000Z",
          "Titre": "The background noise during the call…",
          "Contenu": "The background noise during the call made it very hard to hear the lady providing service. The call took much longer than anticipated because her voice was covered by all kinds of background noise and everything had to be repeated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beth Santosuosso",
          "Nb_Reviews": 1,
          "Date": "2018-09-10T19:55:20.000Z",
          "Titre": "Myron was very helpful in repairing my…",
          "Contenu": "Myron was very helpful in repairing my neat desk issue. He logged in and completed the task very quickly and efficiently. He did a great job! My only complaint would be about how hard it is to find information on contacting neat desk!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Best",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T02:05:36.000Z",
          "Titre": "Problem with latest app update",
          "Contenu": "Had problems accessing the app only to discover it has changed to full web base application. Could not get my Neat scanner to work and called support. Was difficult at first understanding the total change in the application. The support technician was very helpful and worked with me for a couple of hours. Ended up having to install the scanner app on my laptop instead of my desktop PC. Finally got the scanner working but then discovered all of my previous scanned documents from previous years were missing.  The technician informed me I now need to schedule an online tutorial on the new application. This part is very frustrating over the past few years with switching to full web based and all documents in the cloud."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary P",
          "Nb_Reviews": 2,
          "Date": "2015-07-02T02:55:47.116Z",
          "Titre": "Problem with archiving.",
          "Contenu": "Think there should be more specific directions on how to archive on your site.\rDo not like the light gray bar where totals appear on  the bottom of a page. Very difficult to read. Previous bar with the arrows is much better in my opinion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-03-13T19:44:43.000Z",
          "Titre": "It would've been 5 if there wasn't so…",
          "Contenu": "It would've been 5 if there wasn't so much noise in the background, it sound like there are a bunch of people in a foreign country taking within tight quarters, I could hear multiple trouble shooting conversations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodger Smith",
          "Nb_Reviews": 1,
          "Date": "2018-08-29T04:26:26.000Z",
          "Titre": "Good customer service.  Immature product.",
          "Contenu": "I tested Neat as a tool to scan paper and e-mail receipts to organize them in order to submit an expense report to our accounting department.  The OCR features identified about 75% of the data from the scans and e-mails that I submitted.  The interface for cleaning up that data and reporting it in a form sufficient for an expense report is very immature and not sufficient to make the process easy or efficient.  It appears that the company agrees because they said they are in the process of replacing all existing software with something totally new.  But they would not give a timeline for when that new software would be available.  I will look for another alternative."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen Green",
          "Nb_Reviews": 3,
          "Date": "2018-05-18T02:36:57.000Z",
          "Titre": "Sometimes going thru the scanning…",
          "Contenu": "Sometimes going thru the scanning process is not as efficient as one would like to see. Other than that I have loved Neat for 8 years. I love that I have files at my fingertip that I have created to fit my needs any where I am"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-16T16:16:35.000Z",
          "Titre": "Time-Consuming But Effective",
          "Contenu": "This migration took a LONG time but I really appreciated having the support to get it done. The tech, Meryl, was helpful and proactive about contacting me daily to keep the process moving forward until it was done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T18:25:16.000Z",
          "Titre": "Neat is Truly NEAT Again!",
          "Contenu": "Before I say anything else, I will say this: Over the past two years (in my experience) The Neat Company has done an AMAZING job improving their product offerings, support and service.Long ago there were some very dark, frustrating days/weeks/months/years working with them and their products. I can't tell you how happy I am to say, \"Not any more.\" My support issue today was resolved quickly and painlessly by Francis M.Not one to dwell on the past, I'm doubling-down on my Neat investment and will be upgrading to their Premium Cloud Service in January 2019. Thanks, Neat, for not giving up or giving in and doing what is right for both you and your customers!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicki Linder",
          "Nb_Reviews": 5,
          "Date": "2018-05-16T15:07:40.000Z",
          "Titre": "The Cloud Solution is missing lots of…",
          "Contenu": "The Cloud Solution is missing lots of the functionality of the standalone PC version.   You can not copy and split expenses any more.  This functionality is totally gone which makes keeping records more accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-07T00:20:45.000Z",
          "Titre": "The support person that helped me was great",
          "Contenu": "The support person that helped me was excellent.Unfortunately, in the west coast customer support is not available after 5:00 pm, that is very inconvenient for those of us who work until 6:00 pm or later."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jason N.",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T00:10:13.000Z",
          "Titre": "I am happy with the tool and the…",
          "Contenu": "I am happy with the tool and the customer service was spot on.  I was not happy to find out that the human verification feature is limited to 30 a month.  I found out that the business plan has 100 a month.  I received a one on one training that was very helpful by May Ann G.  Navigating the software is very straight forward, Mary Ann clarified all the necessary steps.  The software can see some improvement in being able to classify the type of transaction with several entries at once.  The only downside at the moment is that you have to open every item separately and re-classify the tax type or class of transaction (meals, transportations etc.)  I would be nice to select 15 scans and classify all with one click."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard H Minetti - 772-770-0400",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T19:37:47.000Z",
          "Titre": "Neat is still not capable of providing what they did Pre - Cloud Version",
          "Contenu": "They have a good product now but it is not as versatile as the original product.  I can no longer adjust the Neat program output, in Excel format, to label the columns, move columns to fit my existing database format, and include blank columns as I could easily do before. I also can no longer automatically split receipt amounts in half or thirds and export data in two or three line formats. This has made data entry quite time consuming for me.And I've been trying for some time to get Neat to list the current program version on their website but have not been successful. I need to download the program from the website and try to install it, only to find out that I have the most recent program version."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Platt",
          "Nb_Reviews": 2,
          "Date": "2019-05-08T20:37:08.000Z",
          "Titre": "Great tech support from Leslie M",
          "Contenu": "Great tech support from Leslie M, but the product lost functionality for the same level of previous service. With our premium account, we had multiple users - typical in a family situation. Now the multiple users are only in the business plan, at a higher rate.The reason for the support call was a result of changing an email address. Not uncommon in this day of hacked accounts. It took 3 days of constant work to transfer all of our records to a new email address. Hopefully, this is fixed in the cloud version.Having said that, the Neat product is reliable, scans and interprets very well, and makes tax time that much easier to provide data and images for tax accountants with its built in tax categories and report features."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Les Milne",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T17:17:05.000Z",
          "Titre": "I could not get Neat software to work…",
          "Contenu": "I could not get Neat software to work on my computer.  The Software Tech, accessed my computer, fixed the issues and it now works great.  Very simple, very straightforward and professional.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer Lillian Egleston",
          "Nb_Reviews": 3,
          "Date": "2019-08-02T19:25:21.000Z",
          "Titre": "The experience was okay but it took…",
          "Contenu": "The experience was okay but it took longer than I thought it would and in the process some of my records were dropped and I had to reload half of 2018 and what I had already loaded for 2019."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "President/CEO",
          "Nb_Reviews": 1,
          "Date": "2019-09-27T14:42:37.000Z",
          "Titre": "Cyrus was great",
          "Contenu": "Cyrus was great. He actually stayed on the telephone with me while resolving my issue. I now have a different view of the customer support for the product and will to continue using it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brendon Erker",
          "Nb_Reviews": 1,
          "Date": "2018-09-24T19:14:15.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, great customer service. The rep I dealt with could do to listen a little better, as they misspelled my email after it was spelled out to them 3 times, but it is a minor gripe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis Berry",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T00:09:23.000Z",
          "Titre": "Ramon was great",
          "Contenu": "Ramon was great, as was Angelina who helped me with an earlier need I had. They were both very personable and professional and helped me with my problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gale Rhoades",
          "Nb_Reviews": 2,
          "Date": "2018-04-26T17:48:39.000Z",
          "Titre": "I was a Neat Legacy user for many years…",
          "Contenu": "I was a Neat Legacy user for many years saving my receipts for IRS purposes. When Legacy was no longer available without notification, I moved to the Cloud. A Neat assistant tried to move my Legacy data over to the Cloud, (a small amount of data from 2012 was moved successfully, however a data file of over 1gb could not be moved) I have considered this data a loss and have moved forward.My recent phone call concerned the ability of splitting a receipt i.e. a medical prescription vs household items or groceries. I was informed this work was in progress and would possibly be incorporated at a later date.As an old school user, I still am not convinced the Cloud is safer than storing my data on an external drive and back-up to a flash drive, but I am trying to change my mind.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T19:37:53.000Z",
          "Titre": "Great online support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2019-01-03T17:59:05.000Z",
          "Titre": "Representative's patience",
          "Contenu": "It took quite awhile to resolve my issue. I appreciated the patience of Boogie as we worked through to a resolution. He was able to solve the problem and I am back in business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael rosen",
          "Nb_Reviews": 3,
          "Date": "2019-11-15T20:28:41.000Z",
          "Titre": "Today's interaction was good",
          "Contenu": "Today's interaction was good.  I was not able to actually get my problem resolved, though.In the future, it would help if tech support tickets were responded to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anne",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T01:30:30.000Z",
          "Titre": "Response on customer service",
          "Contenu": "Friendly & helpful. However, it felt like knowledge was lacking in areas & quite a lot of time was taken to read for info to help."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-23T19:04:49.000Z",
          "Titre": "Takes awhile to get tech on line",
          "Contenu": "Takes awhile to get tech on line, however once on is very informative.Then they want to up charge you to premium.I am a retired man and only scan spongelike receipts"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 3,
          "Date": "2020-03-09T20:14:27.000Z",
          "Titre": "New version not what I expected",
          "Contenu": "Fix is not what I expected. It downloads a new app for scanning which is superior by optimizing and reducing file size. It hangs occasionally, but is generally acceptable. The new app does not take you directly to the NEAT app. I was told I was using the old \"orange\" version of NEAT and should use the \"blue version\". The blue scan app is the new version- it doesn't take you to the NEAT desktop. You need to use the old orange version if you want to work on your desktop (which I prefer) or otherwise work in the cloud version going through the website with no quick link. Many of us prefer to work on our desktops and mirror on the web based version. Everything works better but getting custom reports is still difficult. This is a major improvement over the last two years but still lacks the functionality of the original (non web) version from 4 years ago."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SB",
          "Nb_Reviews": 1,
          "Date": "2018-04-26T16:19:41.000Z",
          "Titre": "I am very good with the chat person",
          "Contenu": "I am very good with the chat person. I am very disappointed in the newest cloud version of the product and cancelled it after many years using the previous products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-06-06T14:41:12.000Z",
          "Titre": "Support was able to process my order…",
          "Contenu": "Support was able to process my order but frustrated website would not allow me to order.  Wasted two days trying to order a simple subscription of Neat Desk Lite"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reina Godinez",
          "Nb_Reviews": 1,
          "Date": "2018-10-05T01:16:57.000Z",
          "Titre": "disappointed",
          "Contenu": "HI Ms Liza was very nice and patientbut am dissatisfied because my problem was not solvedI still cant login the neat because the neat I have is a out dated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LTB Home Improvement",
          "Nb_Reviews": 12,
          "Date": "2019-07-12T20:59:28.000Z",
          "Titre": "Sarah was a very patient and kind…",
          "Contenu": "Sarah was a very patient and kind individual.  She was able to answer all my concerns and if she did not have the answer, she would not hesitate to contact someone who could help.  I would have no problem working with her again.On another note however.  Even though I have enjoyed using NEAT over the past 8 years, I personally believe it was a big mistake to change the program from 5.7 to legacy.  Sarah helped me to learn and use the newer program to the point that i fully understood it.  It is not user friendly and not easy to go from scan to home to reporting to saving and printing without going back and forth to the app.  I firmly believe that you had a program that fully satisfied my business needs perfectly and I would like to see you reinstate supporting it.  I will continue to use 5.7.  I hope this is valuable to you and you take it seriously.  Thank you.Larry Boemmels...A LONG TIME USER"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DKohrs",
          "Nb_Reviews": 1,
          "Date": "2018-08-15T20:45:48.000Z",
          "Titre": "After 5 years of using Neat...",
          "Contenu": "I've been using Neat for almost five years. I recently upgraded from the legacy software and Neat support worked with my data to upload it to the Cloud. I had a lot of data, and it took several days to get it all uploaded but the rep I worked with was thorough, responsive, and professional. I've had some frustrations with features that existed in the legacy software that have 'disappeared' in the new version. And when I reach out to support via email, to ask clarification questions I get a canned email response of \"...That feature is not available -- we'll pass it onto the development team\" -- even when that answer does not fit my question at all. I do hope these disappearing features (some of which are obvious programming ball drops) are fixed soon.Per your note below -- how do I reply/forward case # info to you? (Hopefully, you see this edit to this post but...)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon D-Customer",
          "Nb_Reviews": 4,
          "Date": "2020-03-09T22:41:27.000Z",
          "Titre": "Updates on the product followed up with phone call…",
          "Contenu": "First year that changes on the product from last year were followed up with a phone call / online tutorial on how to use the product.  Very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T17:22:13.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, learned how to set Neat and Scan Snap up properly.  Sometimes difficult to understand due to language differences.  Pleasant assistance"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Durie Burns",
          "Nb_Reviews": 8,
          "Date": "2018-04-30T16:45:21.000Z",
          "Titre": "I always get a courteous representative…",
          "Contenu": "I always get a courteous representative whenever I contact Neat. They are very helpful in resolving any issues I have with very little assistance from me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ilia Kleiman",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T22:51:10.000Z",
          "Titre": "Great customer support - Liza C!",
          "Contenu": "I was given exactly the level of attention a customer should receive. I was contemplating converting back from NeatVault to Neat Year (after taking off a year from Neat web experience) and wasn't sure whether it was the right thing to do.Liza listened and convinced me that I'd benefit from the conversion. Additionally, she gave me a price break and a pro-rated NeatVault refund, which I gladly accepted.I am much happier now :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phyllis Bebee",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:28:51.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I must say my problem took quite a few sessions to resolve but the tech that helped me had the patience of Job.  I kept messing up the download but she kept in contact with me and made sure that my problem was resolved.  Kudoes to her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck Ruddy",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:09:17.000Z",
          "Titre": "Help At My Fingertips",
          "Contenu": "I had attended one of the training webinars and remembered a method of duplicating folders but could not recall the process. This call was to recover that technique and use in preparation for next year’s filings.The agent was most helpful and took me right to the solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T19:00:41.000Z",
          "Titre": "Customer service from Liza was great",
          "Contenu": "Customer service from Liza was great. In general, the subscription is expensive, I don’t like that I can’t bulk download pdfs, and I am uncomfortable with my data being on your server instead of my computer. That said, I have not found an alternative. It would be good if I could designate “frequently used” folders, and if opened trees stayed open, to reduce the number of clicks when importing multiple docs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Overshiner",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:37:14.000Z",
          "Titre": "Liza said a great job",
          "Contenu": "Liza said a great job. And figured out my issue then resolved it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Chris Miller",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:44:28.000Z",
          "Titre": "Neat support tec Liza case #00516143",
          "Contenu": "Neat support tec Liza case #00516143 was very understanding of my issue. Liza was efficient and prompt to correct my issue with the Neat Utility driver."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer connie",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T02:04:07.000Z",
          "Titre": "Help from Lisa C.",
          "Contenu": "I needed help getting the icon on my home page for the neat software. Thanks to Lisa C. Help that was accomplished in record time. Thank you. NEAT does need to make a simplier/cheaper version for those just track receipts fir taxes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T00:11:53.000Z",
          "Titre": "Liza was very good!",
          "Contenu": "The representative Liza, that was extremely helpful. This was a pleasant surprise as most of my previous experiences with Neat  support have not been good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jody Crain",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T01:07:46.000Z",
          "Titre": "Patient, Caring, Kind & Professional",
          "Contenu": "Liza was the most patient, caring & kind and Professional Tech I have ever worked with! Merging my 15 years of data from my computer hard drive to my new Neat account online was not a task for the faint at heart! She very carefully checked and rechecked to confirm that every single file and entry was correctly transferred to my Neat cloud account. Thank you Neat for hiring superior quality customer service technicians. And, thank you Liza for carefully walking me through the merging process and helping me get started on scanning into my new cloud account!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T03:01:41.000Z",
          "Titre": "The agent was patient and had no…",
          "Contenu": "The agent was patient and had no problem staying with you until you got it. he was knowledgeable and we succeeded in our task.:)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T17:09:17.000Z",
          "Titre": "I chatted with Liza today to resolve an issue and fixed two at one time",
          "Contenu": "I chatted with Liza today to resolve an issue I was having with viewing images. She provided me with instruction to fix it, which was very quick and easy. I also asked her to show me how to clean up some of my images and she had instructions for that at the ready. This was a great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JIMMY REAGAN",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T02:25:54.000Z",
          "Titre": "Lisa was great",
          "Contenu": "Lisa was great, but it needs to be easier to contact support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "V. Rallis",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T19:03:16.000Z",
          "Titre": "Liza C did a GREAT JOB over chat!",
          "Contenu": "Liza C. did a great job helping me access my documents in Neat.  I did the online chat, which was quick and took very little time. She was helpful, professional, and most importantly, she solved my problem! Thanks, Liza C."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOHN L.",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T21:48:12.000Z",
          "Titre": "Gr8 Support/Customer Service",
          "Contenu": "The quick, convenient, use of alternative password reset, Ty Liza 00512006. I never have issues, love the software and scan utility, this is personal use and makes me paperless, i am confident in the cloud storage as well. Easy, gr8 tool..... John"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lonnie Hamil",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T17:18:40.000Z",
          "Titre": "Neat Employee Saved the Day!",
          "Contenu": "I was having trouble remembering how to do a specific report. I reached out on CHAT and Liza came on to help! After trying, unsuccessfully, to generate a duplicate report from last year, She finally asked to access my computer. That was done through Zoho and after much trial and error, she was able to get my problem solved! She was very patient with me and very persistent in resolving my problem. Liza was top notch in my opinion! Thank you Neat, for hiring good employees!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T19:07:05.000Z",
          "Titre": "Terrific people who work there",
          "Contenu": "The people who work there are terrific.  Knowledgeable, polite, helpful, courteous, want to provide excellent customer service and invite you to call back."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RUSS",
          "Nb_Reviews": 3,
          "Date": "2023-09-18T16:08:33.000Z",
          "Titre": "Scanner not working.",
          "Contenu": "Had an older version of Neat. Started having problems with it and also had a hard drive failure. Purchased the on line version but my scanner would not work. Called in for a tech to help. She was outstanding. Worked through a bunch of processes and was able to not only get the scanner to work, but scan better. She also walked me through the way in which I would input data using the Neat scan tool and then uploading it to my on line account. She showed me how to run the most accurate reports for my particular business. She was polite, professional and a joy to work with. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cecelia",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T18:02:20.000Z",
          "Titre": "ScanSnap scans not uploading to NeatReceipts",
          "Contenu": "While scanning my receipts (ScanSnap ix500), I encountered a problem sending the scans to Neat. The problem was resolved by uninstalling the Neat Scan Utility and reinstalling it. Liza C. was clear and helpful in isolating the issue and resolving the problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelter Structures",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T19:34:52.000Z",
          "Titre": "Liza C has been outstanding to work…",
          "Contenu": "Liza C has been outstanding to work with.  She is very knowledgeable and was able to address our issues.  She also provided valuable advice on how to use the application better"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Stein",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T19:43:25.000Z",
          "Titre": "Liza T",
          "Contenu": "Your tech support representative, Liza T., called back to me to be certain that the previous day's support session had done what I needed.  It had NOT, because Liza's efforts and the support from my new scanner vendor (Fujitsa ScanSnap) were not really working. Liza was concerned enough to follow up today.  She knew your system well, so she was able to direct me to log on to NEAT through Google instead of through Safari.  I'm somewhat disappointed that you no longer support your old Desktop version.  It was faster.  But your tech support was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorenzo",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T22:42:36.000Z",
          "Titre": "Liza C",
          "Contenu": "Liza C. Was wonderful.  She worked perfectly helping an individual who’s technology skills are the best to say the least.  If all the specialists are close to who she is.  The service will definitely be worth the fees.  Thanks Liza C.  Appreciate your assistance. Lorenzo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NANCY RASCH",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T17:16:15.000Z",
          "Titre": "The representative was knowledgeable and patient",
          "Contenu": "The representative was knowledgeable and very patient with me.  He helped me get my new scanner connected to the Neat Utility program enabling me to scan my receipts into the Neat Program.  This was very important to me for I use Neat for my husbands business receipts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Anthony Longoverde",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T04:33:40.000Z",
          "Titre": "Liza",
          "Contenu": "Liza, did a great job solving my problem.  Liza was very patient and helpful.  She did a great job solving the root cause of the Scanchat Home Software and my Fujitsu ix500 printer interface with the Neat program.  She downloaded  a update that was hard to find and downloaded it, she tested  it to make sure it was working and made sure my problem was solved.  Very Skilled.!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:20:49.000Z",
          "Titre": "Very pleasant and helpful",
          "Contenu": "Very pleasant and helpful. Explained in simple details so was easy to follow instructions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Cocciole",
          "Nb_Reviews": 2,
          "Date": "2022-05-27T13:59:18.000Z",
          "Titre": "Liza was persistent and it worked",
          "Contenu": "Liza was persistent and that was what made the process successful. I recently bought a new computer desktop with Windows 11.  My old process didn't work.Liza didn't give up--we made Neat work on my wife's computer which is a Windows 10.Her persistence paid off and she explained I could print cards  and send them tom my computer for storage.She also made the support experience interesting and made me feel confident that we would solve this problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T23:16:13.000Z",
          "Titre": "Dolly helped me",
          "Contenu": "Dolly helped me, she was courteous and extremely helpful. Basically took my hand and walked me through process. I think that if all your tech are like her then you have a perfect customer service department."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Kessel",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T18:38:21.000Z",
          "Titre": "It's all about the people",
          "Contenu": "It's all about the people. Liza C. from the Neat support team is a rock star. She is professional & relentless. She patiently followed my support case for data migration and setting up on a new computer through a painstaking multi-day process, with consistent follow up and detail.   I had to be convinced to pay the small additional fee for the higher level of support after I had just paid for my initial Neat Desk subscription, but I will say it was well worth it. It is great to now have all my accurate data and history on my office pc, and on the go on their excellent mobile app. I was skeptical at first about having to move from the legacy software to the new cloud-based service, but the features and capability are well worth it, and I highly recommend paying the small fee for the extra support for a year. Liza C. and her team are top notch!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Armando",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T20:20:14.000Z",
          "Titre": "Excellent Training & Customer Support!",
          "Contenu": "Steven was professional, thorough, patient and pleasant and left the doors open to future trainings as my needs called for.  The call was enjoyable and productive.  I can tell a MAJOR improvement has taken place at Neat in customer support.  Roxie has been incredible as well along with Mary, Rowell and everyone I have interacted with at Neat.I am looking forward to remaining with Neat for a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles and Madam Secretary",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T00:45:52.000Z",
          "Titre": "Contacted Neat Company for Neat scanner…",
          "Contenu": "Contacted Neat Company for Neat scanner Model ND-1000. Needed help with scanner and computer, they were not talking to each other. The excellent support and customer, and professionalism provided from the many associates we spoke with today.  And a special thanks to Mary who did an amazing job to resolve our concerns.  She deserves10 plus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T22:20:02.000Z",
          "Titre": "Alma made the process which took weeks…",
          "Contenu": "Alma made the process which took weeks to complete easyAfter watching and being instructed by Alma I was able to fix erroneous files and keep the upload of 7000+ images working until all the receipts and documents were in the cloudThank you for being responsive to my emails and checking on my progress"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Wilcox, Sr",
          "Nb_Reviews": 14,
          "Date": "2023-04-17T23:32:06.000Z",
          "Titre": "Charlie Wilcox",
          "Contenu": "The assistance I received from one of your experts, Alma V. She is remarkably experienced in her knowledge and professionalism and her patience with me. I highly commend her for what she does, so very responsible and caring for the person requesting help. Thank you again Alma V.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T18:50:45.000Z",
          "Titre": "I went into the chat room and was provided and efficient service.",
          "Contenu": "I went into the chat room and was immediately serviced by a knowledgeable tech rep who assisted me with a problem I was experiencing getting into Neat.  The problem occurred when I used the wrong password in trying to  open Neat.  I have used Neat for many years and when I need support, someone at Neat is always there."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doug Sands",
          "Nb_Reviews": 2,
          "Date": "2023-05-30T16:47:14.000Z",
          "Titre": "Is the scansnap iX6000 fully compatible with Neat?",
          "Contenu": "I had a question, the question was answered. Hopefully accurately.This was my question: I am considering purhasing a Fujitsu (Ricoh) ScanSnap iX1600 Wireless / USB scanner. If I use the ScanSnap iX1600 with Wi-Fi are there any Neat functions or features that I won't be able to use?The answer I was given was a little further along ...\"All Neat functions will be available to me?\"Sent by: You12:02 PMLiza C.\"Yes that is correct\" (I hope the answer is correct)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Davis, Polymer Concepts",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T18:54:32.000Z",
          "Titre": "Lisa C",
          "Contenu": "Lisa C. was very good.  Understood my issue and quickly help me resolve the problem.  Also, great follow-up and review of the resolve."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D. Cianci",
          "Nb_Reviews": 2,
          "Date": "2022-07-16T18:58:30.000Z",
          "Titre": "I purchased a Neat Desk quite a few…",
          "Contenu": "I purchased a Neat Desk quite a few years ago (five?) and sadly never unboxed it.  Unfortunately, it is no longer fully supported; although they do have a cloud-based service, which they graciously offered to help me set up using the Neat Desk as my scanner.  Steven was extremely helpful and patient in helping me to get started.  Thank you for the excellent support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Rising Sun, in Tagalog",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T21:43:37.000Z",
          "Titre": "Jerimar Beboso is a top rate tech support person!",
          "Contenu": "Jerimar Beboso is a top rate professional tech support individual.  He worked through a long session to correct  my Neat scanner software and firmware.  He is patient, courteous and kind along with knowledgeable.thank you, Jeri."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L Rude",
          "Nb_Reviews": 2,
          "Date": "2022-09-29T23:51:34.000Z",
          "Titre": "LIZA IS FANTASTIC!!!!!!!!",
          "Contenu": "I want to give exceptional praise and gratitude to Liza!  She helped an old lady navigate the transition from my old out of date software to the new one.  Her patience is commendable and her kindness is a treasure in my heart.  Thank you Neat Company for having such amazing customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick O’Brien",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T21:19:13.000Z",
          "Titre": "Lizza",
          "Contenu": "Lizza, the representative that assisted me was outstanding. She knew exactly what needed to be done and walked me through the process to completion. No question about it, if all your technicians are as talented as she is, you can rest easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T18:46:25.000Z",
          "Titre": "I rated my recent experience with Neat…",
          "Contenu": "I rated my recent experience with Neat online chat five stars because of my experience with Liza. Liza listened and answered my questions. I know their job is to get you to buy a different plan, but I had to say NO at this time.  Neat should info their customers of what's new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SANFORD VIEDER",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T20:57:51.000Z",
          "Titre": "Clear cache in order for Neat to work properly",
          "Contenu": "Liza C was very helpful on my Case # 00514198. Quickly and efficiently helped to resolve the program issue I was having"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diana McDowell",
          "Nb_Reviews": 2,
          "Date": "2023-09-06T01:11:18.000Z",
          "Titre": "Liza had to work with me for a few…",
          "Contenu": "Liza had to work with me for a few weeks to get my year-after-year receipts and documents migrated. She was patient, helpful and answered all my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruth Baronda, Baronda Ltd",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T21:39:02.000Z",
          "Titre": "Teacher/ Tree Farmer",
          "Contenu": "Steven did a great job in our 1:1 technology session. He answered all my questions completely and as I kept adding comments and more questions, he responded immediately. As a Ltd subchapter S corporation whose business is education and agriculture, he was very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Rich",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T17:58:38.000Z",
          "Titre": "Liza was awesome!",
          "Contenu": "Liza was awesome!She worked diligently to get me back up and running. Helping to transfer numerous files from my old desktop version to the new cloud version after my hard drive failed. Years and Years of files! Years of Receipts and Documents covering my cancer treatments that I feared were lost forever.from 8/29/2022 until today 9/26/2022 we worked to get this completedShe is a great asset to your company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 6,
          "Date": "2022-10-01T05:03:45.000Z",
          "Titre": "Fully satisfied Neat user",
          "Contenu": "I have been using Neat for a number of years but due to a hardware upgrade I was not being able to upload the software. I reached out to Neat. Lisa took my case and supported me patiently and persistently until the system was working well. I am impressed with the commitment and interest demonstrated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T21:24:30.000Z",
          "Titre": "Review for Steven",
          "Contenu": "I have been a Neat Receipt user for a very long time and not my standalone version is not working, so want to try the cloud version. Steven was masterful in explaining how Neat can help restore and access the old files and that would be the reason, I would use Neat. If that does not work, I will not use Neat. Overall, I appreciate Steven's attention to detail and answering all of my questions."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T02:05:19.000Z",
          "Titre": "Migration",
          "Contenu": "Liza C. was very helpful following through with what she said she was going to do. Very efficient and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T21:49:46.000Z",
          "Titre": "Neat Support is FOR REAL!!",
          "Contenu": "I began my customer service journey, yesterday via the chat option. I was paired with Liza and she tried several times to get my scanner to connect to my Wi-Fi system, but to no avail. She explained that we could use a cord, and directly connect to my laptop, pc. Unfortunately, I had to order a cord from Amazon, and wait for it to arrive. This didn’t stop Liza! She called me today, and we worked together to get the scanner working! There are VERY FEW customer service reps that are willing to go that far to help a customer! I am thrilled! Thank you, Liza for your help, and for going the extra mile to bring my problem to an end!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve H",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T16:59:57.000Z",
          "Titre": "Smooth transition!",
          "Contenu": "After using Neat for over a decade on a Windows platform, IT assistant, Liza made the process of me going to Mac, smooth and professional. NEAT just keeps getting better and better. Thank you NEAT Team!Steve H"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T19:35:23.000Z",
          "Titre": "The representative was extremely…helpful and courteous",
          "Contenu": "The representative was extremely helpful. She managed to navigate me through the process to resolve my issue better than expected. I came out of the call feeling that I gained more than help that imagined. She was pleasant and very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy F",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T22:59:42.000Z",
          "Titre": "Liza did a great job getting my data…",
          "Contenu": "Liza did a great job getting my data from my old Neat software to the cloud based system. It took several days and many hours but she was patient and worked hard to make sure the data was accurately migrated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T02:14:03.000Z",
          "Titre": "My account had been terminated and I…",
          "Contenu": "My account had been terminated and I could not get into the account or contact anyone for help.  I finally got a chat started with Liza who was extremely helpful.  It took quite a while to get through the issues but she did not give up until she had me back into my account!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lois Clatterbuck",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T00:27:22.000Z",
          "Titre": "Liza was amazing",
          "Contenu": "Liza was amazing - very patient.  Explained the process in a way that could be understood.  Liza spent a lot of time with me - explaining the process, fixing my problem, and teaching me how I can import the rest of my documents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T01:55:21.000Z",
          "Titre": "Liza Review",
          "Contenu": "Liza was such an amazing help to me. He helped explain the Neat Scanner Model that I have & how I can still use my scanner. He helped me set up an account, waited while it downloaded, made sure my scanner is set up, how to use my scanner, & he made sure that all my questions were answered & I knew what I was doing before he let me go. Very polite & friendly. Thank you, Liza."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-07-12T20:40:34.000Z",
          "Titre": "My Neat Tech helped me transfer my…",
          "Contenu": "My Neat Tech helped me transfer my files from Neat Cloud to a backup hard drive on my PC. Neat tech support is the only reason to justify the Annual subscription fee. Even though they make it hard to find the phone number once you do the support you get is worth the hassle. Zoho was and is a excellent support rep."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veronica",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T02:00:16.000Z",
          "Titre": "Dolly was my Chat Tech today",
          "Contenu": "Dolly was my Chat Tech today.  I'll tell you she was a great help today in resolving my issues logging in and recovering my files.  She was very patient with me, and I appreciate her and her knowledge. The was very helpful in all aspects of knowledge in ALL areas of the Neat website!  She is an ASSET to the company and should get a raise!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gentry Gentry Clark",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T23:13:44.000Z",
          "Titre": "Update my software",
          "Contenu": "After changing from one computer to another, I needed to get up to date software.   Your service technicians were able to do this in a very efficient manner.  I will be learning the new input methods and feel confident that with your help it will be a great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T22:34:26.000Z",
          "Titre": "Legacy Database Migration",
          "Contenu": "Neat Support was patient as we migrated a 9-year legacy database with over 10,000 records into Neat Cloud.  Many questions answered during the 5-week process."
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "JOHN SHAPIRO",
          "Nb_Reviews": 1,
          "Date": "2022-09-30T19:37:42.000Z",
          "Titre": "Neat data migration",
          "Contenu": "The Neat technician (Liza) had to migrate data from my old laptop hard drive back-up, to my new laptop and Neat cloud. It is a tedious job, but Liza hung with it, was very professional, and got the job done. I appreciate the Neat product/service, and obviously the support that makes the product/service work!! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phyllis Milton",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T21:58:44.000Z",
          "Titre": "The representative was concise and…",
          "Contenu": "The representative was concise and understood fully the issue I had.I have been a long time user and subscriber but was now having utilizing Neat's cloud based program. Support is very important and I am comfortable I am receiving it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Nuetzman",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T19:08:53.000Z",
          "Titre": "Problems Solved",
          "Contenu": "I can’t say enough about the help I received from Liza C., the Neat tech that helped me out of the mess I got myself into.I changed internet servers and the email address I had was deleted. Among other things, I couldn’t log into Neat or change my password and I didn’t know why.   All I could think about was that I need to file my taxes and I need Neat to do that.   It was my luck to have a capable, knowledgeable tech, Liza C., pick up my problems and sort them out for me. Amazing, the distance she went to help me.  Neat tells the truth when they say that they want to be sure the customers are taken care of.  They hire people that do just that. Since 2006, my many years with Neat, they continue to be a Five Star company with Five Star employees."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J and M of ca.",
          "Nb_Reviews": 4,
          "Date": "2023-02-17T18:00:41.000Z",
          "Titre": "Each person I have talked with at Neat…",
          "Contenu": "Each person I have talked with at Neat have been incredibly helpful and very nice and patient and Alma was also excellent.Thank you so much for having such a great team of employees.Margaret"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toby",
          "Nb_Reviews": 4,
          "Date": "2023-06-09T20:44:18.000Z",
          "Titre": "Alma was the tech that worked on my Neat account",
          "Contenu": "Alma was the tech that worked on my issue.  She was professional and patient with my many questions.  She was able to solve the issue and get my software up and running correctly.  I would definitely use her and Neat again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Fischer",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T07:01:45.000Z",
          "Titre": "Using Neat Software with Scan Snap IX 500 scanner",
          "Contenu": "Liza C. Was so persistent and helpful in following up with me to make sure that my scan snap ix 500 worked with the neat sofware. I really appreciated her help and look forward to using the neat software with my scan snap ix 500 scanner. Michael F."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandy",
          "Nb_Reviews": 4,
          "Date": "2023-01-27T00:27:16.000Z",
          "Titre": "Customer Service Is Amazing.",
          "Contenu": "I worked with Dolly today.  She was so helpful and very patient.  I had so much to be trained on today and she was very clear with her training and at the end of our session she sent instructions for future review.  I would like to thank her for everything she did today to make my work better organized and very simple to understand her instructions.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ned L. Spessard Jr.",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T23:59:14.000Z",
          "Titre": "Coupon code not operational.",
          "Contenu": "I wanted to renew my subscription using a two-day-only savings code from Neat.com via email. Unable to make a purchase because Neat.com was not excepting  a savings coupon code. After several unsuccessful attempts to make a purchase, I decided to contact customer service. I made contact with representative \"LIZA C.\" The problem that I was having was more complicated, multi-tasked, and time-consuming than was not even expected! Liza throughout the lengthy process session was very professional and knowledgeable about the product. It was necessary to be placed on hold several times during our session    and each time Liza advised of her intentions and made sure I had any questions or concerns. Liza was always professional and yet Liza was always friendly and made sure all my concerns/questions were answered and or resolved. Liza is one of the best reps I have worked with. Neat.com having employees like Liza will ensure them their current and future goals!!Thank you,Ned L. Spessard Jr."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom DeMeuse",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T20:05:35.000Z",
          "Titre": "Neat well done",
          "Contenu": "took all the time I needed although I was already familiar with neat for many years but not the ne system.  answered all my questions. He new the system very well.  excellent experience for me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Gaines",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T01:08:27.000Z",
          "Titre": "LIza did a great job fixing my issue…",
          "Contenu": "LIza did a great job fixing my issue with a scan error message.  I am back up and using Neat!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherri Rorie",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T14:04:53.000Z",
          "Titre": "New Scanner Install",
          "Contenu": "Our Neat scanner broke and we had to order a third party scanner.  Liz helped install all the necessary drivers, etc. to get it working.  She did a great job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natalie",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T22:15:38.000Z",
          "Titre": "Liza was with me the entire process to get my files transferred!",
          "Contenu": "Liza called me every few days to keep up to date on how many files had transferred to the online NEAT.  She left voice messages if I was not available and emailed if I was not available.  She made me feel confident the whole experience that the problem would be solved... and she was correct.  Thank you for ALL your time Liza!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard DeCair",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T19:10:36.000Z",
          "Titre": "Representative was excellent!!",
          "Contenu": "Representative was excellent!!!   Quickly solved a major problem with my system.  Also provided me information about other new available features that might be of interest to me.  Did not pressure me!!!!  All-in-all a very satisfactory experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Davis",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T17:52:24.000Z",
          "Titre": "Liza was most helpful",
          "Contenu": "Liza was most helpful, very patient with my lack of understanding due to hearing aid issues. She was able to discover a way around both of my issues and I am most grateful to her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Rife",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T19:48:56.000Z",
          "Titre": "Liza was super helpful",
          "Contenu": "Liza was super helpful, very prompt, and super friendly by far one of the best customer  service personnel  I have dealt  with.Thank you so much for your help, and even sending me a link to help with my problem,thank you again ,John"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Wycoff",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T21:29:06.000Z",
          "Titre": "I just joined Neat this week",
          "Contenu": "I just joined Neat this week.  I bought a new computer and after migrating my data from one to the other, I was not able to open up my Neat files.  I used live chat for help.  Liza was my assistant.  Cudo's to Liza.  She was able to remotely connect to my computer and recover my files.  She took the time to transfer and save those files to another folder.  It took us 3 days to accomplish this (about 2 hours at a time) but succeded in doing it.  I want to thank Neat Co for their excellent response time and especially Liza.  She is patient, nice, and very knowledgeable.  Neat Co should be very proud to have such a wonderful dedicated employee, I certainly am.  Thank you again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheli",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T14:52:53.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "Liza didn’t give up on trying to get my scanner working again. She had tremendous patience and understanding. My scanner now works. Thanks Liza:-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T23:15:38.000Z",
          "Titre": "Liza got right to the issues and after…",
          "Contenu": "Liza got right to the issues and after a hickup, she found that I didn't tell her the correct version.  She was able to put in windows 10 instead of what I told her (windows 7).  When this was corrected, she was able to install my drivers, which were erased after update, quickly.  She was kind and thorough.  Thank you Liza"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Theresa of That Girl Taxi Serv",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T22:37:33.000Z",
          "Titre": "Prefer Calling In",
          "Contenu": "I was happy with calling in and putting in my number for a call back. I don't like the chat section to assist with problems. The customer rep (stephen i think?) was wonderful. He made things simple for me as i was having trouble loading the driver for nm1000."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Parker",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T20:09:45.000Z",
          "Titre": "This senior tech knew what he was…",
          "Contenu": "This senior tech knew what he was doing!Prior to talking with him today, it took 2-3 days 5+ hours & the other techs could not get neat working"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ Young",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T18:55:57.000Z",
          "Titre": "Liza C",
          "Contenu": "Liza C. Clearly understood my request for help and quickly resolved issue. Very knowledgeable and thorough"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sally Henry",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T17:29:20.000Z",
          "Titre": "I received my call today and was very…",
          "Contenu": "I received my call today and was very helpful!  He was very patient and helpful!  I would highly recommend the Neat for managing your expenses business or personal’"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Levine",
          "Nb_Reviews": 5,
          "Date": "2023-07-28T01:50:27.000Z",
          "Titre": "The tech who assisted me efficiently solved my issues",
          "Contenu": "The tech who assisted me, I believe her name was Leona was very attentive, answered all my questions and solved my concerns"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gsl",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T20:22:11.000Z",
          "Titre": "This time....FANTASTIC SERVICE..problem solved",
          "Contenu": "This time....the service technician (Alma) was FANTASTIC.  We were able solve this tricky problem that has been hanging out there since last summer!  Thank you!!  **gsl"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T22:25:25.000Z",
          "Titre": "Excellent service once I finally heard…",
          "Contenu": "Excellent service once I finally heard a live person. Don was the agent that was tremendous in his knowledge and able to communicate that to resolving my problem and did so promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Callahan",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T03:04:59.000Z",
          "Titre": "Tech support",
          "Contenu": "Call back was staticky so I called support again and Liza helped me this time.Unfortunately, the conclusion was my scanner was broken and needed to be replaced.I’m buying a Raven Pro"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Art",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T10:29:14.000Z",
          "Titre": "fixed my problem",
          "Contenu": "The tech i chatted with Liza was very knowledgable and was able to quickly answer by questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanne Blanchard",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T02:14:36.000Z",
          "Titre": "Liza was professional and paid…",
          "Contenu": "Liza was professional and paid extensive attention to details.   She was clear, concise and comprehensive in her communications with me.Most importantly she got my scanner working and working properly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T19:32:07.000Z",
          "Titre": "Liza was patient and helpful",
          "Contenu": "Liza tried to help me with my problem.  She offered many suggestions and asked me the right questions.  I had trouble explaining my issue, but we discussed it and I played around on my screen until I got back to where I wanted.  She made me aware that I could take a screen shot, but I don't know how so now I plan to learn.  Thanks for her patience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "liza was extremely hepful .Bar",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T19:30:52.000Z",
          "Titre": "Liza was extremely helpful during the whole process,it was a pleasure working with hers",
          "Contenu": "the agent Liza who was extremely helpfull during the whole process.barbara"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew fuller",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T14:12:16.000Z",
          "Titre": "I haven’t used neatdesk in a few years…",
          "Contenu": "I haven’t used neatdesk in a few years and it took a minute to figure out your upgrades, but you help line gave me everything I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T23:49:25.000Z",
          "Titre": "I had a great experience",
          "Contenu": "I had a great experience The guy tech I had was amazing he was so polite and friendly and I could understand him perfectly. He knew exactly what the problem was and fixed it in a short time. And his response time to my email was very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Doris McAfee",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T20:04:54.000Z",
          "Titre": "Liza was very helpful she went above…",
          "Contenu": "Liza was very helpful she went above and beyond to help me to sync my files from my old files in neat reciept to the new cloud version"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "R. Soto",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T02:53:39.000Z",
          "Titre": "Liza",
          "Contenu": "Liza, was very helpful and answered all my questions and explained to me why I couldn’t integrate with my quickbooks desktop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonial",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T01:14:15.000Z",
          "Titre": "Excellent delivery",
          "Contenu": "Excellent delivery. I look forward to hearing more webinars. She was very patient and informative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Conti",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T00:28:13.000Z",
          "Titre": "My expectations were exceeded",
          "Contenu": "My expectations were exceeded.   The time it took and the patience to correct my issues was more than i could have asked for.  The effort was excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Very Satisfied Customer",
          "Nb_Reviews": 3,
          "Date": "2022-10-04T22:39:52.000Z",
          "Titre": "New iMac user",
          "Contenu": "A great job was done to address my issues.  Proactively provided pointers on how to better utilize the Neatdesk program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Griffith",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T02:17:36.000Z",
          "Titre": "Scanner help.",
          "Contenu": "I was have trouble getting my scanner to work properly. I reached out to Liza and she walked me through the process and how it works. In no time I was using my scanner and copying my receipts in no time. Thank You Liza for your quick response and help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Deans",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T00:32:35.000Z",
          "Titre": "1/24/2023",
          "Contenu": "1/24/2023, Case#503187, Liza was Outstanding! She was professional and very knowledgeable. She resolved my problem quickly and educated me on the proper operation of the software!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mari S",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T21:04:08.000Z",
          "Titre": "Super Fast help",
          "Contenu": "Liza was extremely helpful and was able to solve my problem in a few minutes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Max",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T20:36:22.000Z",
          "Titre": "Super Helpful",
          "Contenu": "Liza was amazing and helped tremendously, she was super patient.  Without her I could of never migrated to the new platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CKD",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T19:08:37.000Z",
          "Titre": "file processing",
          "Contenu": "I had an issue with file processing.  The agent was very helpful and quick with an answer and documentation regarding my issue.  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T19:09:57.000Z",
          "Titre": "Roxie was very helpful and clear in her…",
          "Contenu": "Roxie was very helpful and clear in her communication and was able to clear up the issue I was having. This really was one of the BEST chats I have had with a help desk"
        }
      ]
    }
  ]
}