{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "newair.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:43:28.000Z",
          "Titre": "Still waiting....",
          "Contenu": "It's been three weeks since I placed my order, and I have yet to receive it. I've been calling and am still waiting for someone to pick up the phone. I tried emailing and received a response, but when I replied, I still had not received an answer. Overall, the experience has been horrible. I don't think I will ever buy from this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Daniels",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:15:52.000Z",
          "Titre": "I asked repeatedly for the order to be…",
          "Contenu": "I asked repeatedly for the order to be canceled. It was shipped. Ridiculous"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Wojciak",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:12:58.000Z",
          "Titre": "If you want all of your cigars to be ruined...",
          "Contenu": "Came home to find my humidor reading over 120 degrees F (when it was set to 69). Contacted customer service and they responded with a blanket troubleshooting message like i didn't just lose an entire humidor of cigars to their faulty product. DONT RISK IT"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 5,
          "Date": "2023-12-17T03:03:42.000Z",
          "Titre": "Died within five hours of using it for the first time.",
          "Contenu": "The ice chest worked for the first five hours I owned it, before it completely died and no longer turns on. Total garbage."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gina Romer",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T20:10:27.000Z",
          "Titre": "Product worked well for ONE YEAR",
          "Contenu": "Product worked well for ONE YEAR.  Had to replace it TWICE in two years.  Company sent WRONG part, as well as instructions for WRONG ice maker.  Company refused to replace second ice maker, even though it broke within 10 months of purchasing it. We will NEVER purchase from Newair again. Very disappointing and frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Houtan",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T15:12:53.000Z",
          "Titre": "They sent me damaged item",
          "Contenu": "They charged me $50 for 2-day delivery(it says 2-day delivery on the top left corner when you want to place the order) and i got it after 5days, the side and the door is damaged also, poor customer service unfortunatelyI could buy it from bestbuy or home depot and pay nothing for shipping and easy return in this case"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rupak Bose",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T22:14:49.000Z",
          "Titre": "$800 product - lasts only 2years and no technician repairs - it’s junk",
          "Contenu": "Bought a Dual Zone 24 in. Built-In 18-Bottle and 58 Can Wine and Beverage Cooler Fridge with French Doors - Stainless Steel for $800 in May 2021. Compressor stopped working on Oct 2023. No technician in New Jersey would repair the product - so it’s junk. Plus the service person recommended me first a wrong part (thermostat) to buy - glad I double check. Complete scam of a company with no after service. Do not buy !!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Farmer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:31:48.000Z",
          "Titre": "I told you to cancel fu&@ers!!!",
          "Contenu": "I told you to cancel lame ass!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Egner",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T21:07:42.000Z",
          "Titre": "Bad customer service",
          "Contenu": "Bought a oscillating misting fan worked less than 45 minutes before oscillating function quit. I contacted the company via website was told I would be contacted within 24 hrs, I was  contacted 6 days later. Too much detail to go into I finally returned item to Amazon after 23 days had passed. Two days later Newair informed me they would replace the fan.Hands down worse customer service I have ever had with a company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeramie Dill",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T01:31:10.000Z",
          "Titre": "We bought a countertop ice maker from…",
          "Contenu": "We bought a countertop ice maker from these guys and it lasted about 6 months. All we used was filtered water. I emailed them about the warranty and they asked for a video of what it was doing. I sent the video and the order number and it has been crickets since."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sarah bernard",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T18:41:17.000Z",
          "Titre": "I have called and called emailed and…",
          "Contenu": "I have called and called emailed and emailed....This company does NOT stand behind their products. I had a unit that was less than 1 year old (I also purchased the Extended 1 year warranty), it did not cool the room even tho we bought a bigger unit than the square footage required. I called, they said cut the chord we will send you a refund check.... I have called and called emailed and emailed every time i am told the check is coming. ....     I've been calling and emailing since August of last year!! I have emails to prove it. This company is NOT trustworthy, they DONOT stand behind their products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ashley Hansen",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T02:28:19.000Z",
          "Titre": "Scam!!!",
          "Contenu": "My fridge was delivered somewhere in Florida according to FedEx.  Not an address affiliated with me.  Pretty sure I just got scammed out of 1000 dollars.They reply to reach out to them- which I have tried to do multiple times.  They don't answer calls or emails.  I dont have my fridge and have to do a chargeback. My review stands- 0 STARS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "thomas",
          "Nb_Reviews": 3,
          "Date": "2023-02-04T20:19:25.000Z",
          "Titre": "received a broken unit newair wanted me…",
          "Contenu": "received a broken unit newair wanted me to pay to have it disposed of  I requested an upgrade for taking care of the defective unit Newair then told me they would send a return label for defective unit when I received new unit it also had broken parts the reply from newair is a general response I called the number and asked for Alai was told that person was not available but if I wanted they would have Alai call me back to this date no call back they truly do not care about the costumer ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie F",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T04:51:17.000Z",
          "Titre": "Very valid company credit card rejected…",
          "Contenu": "Very valid company credit card rejected multiple times. I was required to fill out an authorization form and I filled it out and sent it back within 5 minutes of receiving and then I received an email a week later saying I didn't send in the required information in time. Absolutely ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane Sherman",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T12:22:25.000Z",
          "Titre": "The item purchased didn't work as…",
          "Contenu": "The item purchased didn't work as intended.  Site offers a no hassle return process.  Not the case here.  Bee sure this is exactly what you want when purchasing the item of chioice."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shane Sumrow",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T16:22:33.000Z",
          "Titre": "DO NOT BUY NEWAIR",
          "Contenu": "Knowledgeable service technician helped diagnose my issue and provided a great solution.UPDATE: Apparently the technician was not knowledgable. After the part they sent did not fix the issue, Newair then said the entire beverage refrigerator will need to be replaced. It is less than 2 years old. The initial warranty had expired and they only offered a discount on a new unit. So buyer beware. This company does not stand by their products. I understand the warranty is out and that possible repairs may be needed. However, for the entire unit to need to be replaced in less than two years tells me this company does not make long-lasting products and does not stand behind the products they sell. DO NOT PURCHASE NEWAIR."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arizonan",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T04:04:36.000Z",
          "Titre": "Fan motor replacement is missing the…",
          "Contenu": "Fan motor replacement is missing the gray attachment for red and black fan electrical wires in order to properly install fan.  This has been a big waste of time and money, plus, I will need to return the unit and will have to pay return shipping fees due to missing fan motor parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T01:50:51.000Z",
          "Titre": "I was sent a replacement that was not…",
          "Contenu": "I was sent a replacement that was not the original model and was told it only had a handle difference. This was not the case. The replacement also arrived scratched. Do not purchase. poor customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole Reese",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T14:29:04.000Z",
          "Titre": "Purchase from another seller.",
          "Contenu": "EDIT- Machine malfunctioned. After calling for service within my warranty, I was drug through a process to only be told that they wont ship to Hawaii for replacements and would NOT offer a refund. I PURCHASED the item 95 days before it malfunctioned, return window through the retailer was 90. Hope my great aunt enjoys the $400 ice maker that I can’t get shipped to me? What a joke. (The survey below was provided after they continuously requested feedback 30 seconds after me calling for warranty, promises made not kept) This is the first time I called on a manufacturers warranty for any appliance and received a call back within the hour! Laurellee was kind and helpful, she was my only point of contact throughout the process, which was so much better than serviced I’ve received from other retailers. I’m so happy with the product AND service we received from you all, thank you!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jantina Wennerstrom",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T02:20:02.000Z",
          "Titre": "Newair Ice Maker",
          "Contenu": "We received our Newair as a christmas gift. We had to reach out to customer service for an issue and we were never able to get it resolved. It was a lengthy process. They would ask me for a photo, I'd send it. Then they'd say, well the photos needs the serial number. I'd send it. Then they say send a photo of the cut cord. I sent that. No surprise the next communication I got was well, it needs to be cut and with the serial number. I give up. The product only lasted 2 months. The return process is ridiculous. Don't buy it."
        },
        {
          "Note": 1,
          "Lieu": "AZ",
          "Pseudo": "Alexander Zhuravlev",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T20:02:27.000Z",
          "Titre": "Unsatisfactory and dissapointing customer service",
          "Contenu": "After watchning several reviewes, I placed an order for 250 count humidor. Little did I know that instead of getting a tracking number, I will be getting all kinds of fraud accusations from Newair customer service, and even after providing all requested information my orders would still get rejected. They ask for very sensitive information to be sent via email but fail to provide any guarantee of personal information security.It was really dissapointing experience, Newair, never ever would I want to purchase anything from this company. And I recommend everyone to stay away from Newair as instead of getting a nice hassle-free purchase you will have to deal with their horrible customer support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Montana_Mechanic",
          "Nb_Reviews": 4,
          "Date": "2023-05-11T05:12:13.000Z",
          "Titre": "Another worthless company that asks customers to do the bosses job.",
          "Contenu": "I inquired to New Air about a replacement hose for their Air Conditioner. It is a non-standard size, 5.9 inches in diameter. They took 3 days to answer and then wanted $19.95 for the hose. The AC only cost $150.00. So I asked for a quote with shipping to Montana. That added another $20.00! The total would be about 1/3 of what the entire AC cost. I declined. Then they sent me a request to review their employee who gave me the quote. Seriously? They wanted me to evaluate their employee! So I was honest and submitted a review. I said the employee was fine but the company sucked. I told them that if I was their employee I would quit and find a company that trusted my abilities and did not ask customers to do the boss's job. So next I get an obviously automated response profusely thanking me for my employee review and requesting that I place a review on FaceBook, Google, or Trust Pilot. Facebook and Google have their own trust issues. They spy on users and sell private user data to the highest bidder. Why should anyone trust them? So I chose Trust Pilot and left an honest review. New Air sucks and I will never buy any of their products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nope",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T22:20:56.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience, lost my package and tell me theyll refund me, then tell me to file a claim with their shipper (which is not even possible), now i have to file a claim with amazon and and my cc company so i can one day buy something else, its been weeks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KelleyC",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T18:51:50.000Z",
          "Titre": "Decent product-- Poor Customer Service",
          "Contenu": "Purchased an AW-320 ED beverage cooler. I loved it. The right-hand door broke, and I reached out to Customer Service on 8/29/2022. Over months, I spoke via email and phone with Michelle, Kylie, Alai, Camilla and Vanessa. Four times I was sent a \"left\" door.  I sent photographs of the broken \"right\" door, screenshots of my \"right\" door order, and each time a replacement \"left\" door was sent to me. Four left doors sit in my garage. I am LEFT with a broken \"right\" door. Still waiting for a return contact since 11/21/2022. I don't know what I need to do to get a RIGHT door!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ellen",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T14:32:38.000Z",
          "Titre": "Will not honor warranty",
          "Contenu": "Bought 1st unit May of 2022.  It lasted till December.  They replaced it but now this one is not working.  Told me the new unit did not have a warranty.  Not happy!  They want me to buy the newer model for $400.00.  Thanks but no thanks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:41:43.000Z",
          "Titre": "Emails go unanswered in a 48 period",
          "Contenu": "Emails go unanswered in a 48 periodShipping is no help!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharon Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T21:47:30.000Z",
          "Titre": "I need to send ice maker back and your…",
          "Contenu": "I need to send ice maker back and your people won’t answer how I am to go about it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Step Auth",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T02:28:11.000Z",
          "Titre": "Made me cut wire on a/c unit and send…",
          "Contenu": "Made me cut wire on a/c unit and send picture. Then tells me they would not replace unit. So now I have to buy a $30 cord and pay a/c guy to look at unit. Do not buy from them. Will not even send new cord they made me cut for picture to send me new unit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ARTIE WILLIAMS",
          "Nb_Reviews": 5,
          "Date": "2022-12-07T18:25:45.000Z",
          "Titre": "Poor Customer Service",
          "Contenu": "I bought a Newair Nugget Ice Maker in July 2022, in October I started to see brown streaks coming from the top of the machine into the water reservoir.  I called in early November and was given cleaning tips which I had been already doing but tried again.  Three days later brown substance was back.  So I called back again and as asked for pictures of the substance and a copy of the receipt, both of which I provided.  This morning I was told that a replacement was not covered in the warranty and that if I gave a positive review she would waive the shipping charge.  I didn’t pay a shipping charge when I ordered the first one on Amazon Prime so this was not much of an incentive.  As it stands now, I have to clean the machine 3 times each week to try to make sure that whatever the brown substance is, that it won’t poison my family.  This is awful customer service in my opinion.  All I wanted was a replacement on a machine that literally costs Newair a fraction of what I paid for it!  Why on earth would I buy another one that may do the exact same thing? That’s ridiculous!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shangra",
          "Nb_Reviews": 8,
          "Date": "2023-03-02T04:42:44.000Z",
          "Titre": "Do not!!",
          "Contenu": "Do not!!! I SAY DO NOT PURCHASE THIS BRAND I have 2 sitting now and the crazy part they was replaced and went out again a month later A WASTE OF MY HARD MONEY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ozden Pekmezci",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T19:26:26.000Z",
          "Titre": "Incompetent Customer Service!",
          "Contenu": "Do your own due diligence and do not solely trust Newair reviews on Google and Trustpilot as they are, in my opinion, not a reflection of the actual products offered by company or the after sale service. The only reflection here is that majority of these consumers had an issue with their product and they were promised/given a replacement. Hence that’s why you see so many shout outs to the customer service agents who advised them to leave the reviews. In my experience, the name of the game was bait & switch.I purchased a Newair 840 cigar humidor remanufactured by Newair in July 2022. Unit arrived two months later, physically and functionally damaged. I was promised a replacement in lieu of posting reviews on Google and Trustpilot which I did. The very next day, I was informed the unit was out of stock. Even though I was disappointed, I figured I could wait a little longer for a replacement as I really liked the unit.Fast forward to August 2023, skipping out some “are we there yet” communications, I asked for a replacement to be processed and also asked how I could communicate with the senior leadership of the company regarding my disappointing experience. I was never offered a way to communicate with anyone in senior leadership but I was offered a replacement once again! This time instead of reviews, I just needed to cut the power cord to the unit to prepare to discard and take some picture to send back to Newair while I wait for my replacement unit. To my not so surprise, I was informed the next day the unit could not be replaced because it was remanufactured like they didn’t know all along. I was never offered a way to communicate with someone else and received an email stating a refund was processed after filing a complaint with the Better Business Bureau.I’m especially disappointed that Newair could not stand behind their word, twice. If you promise something, it’s your responsibility to follow thorough. If it’s your incompetent customer service’s mistake, then you own up to that and honor what they promise as the representatives of your brand name!I loved the unique look and functions of the Newair 840. The company has some innovative and fun products that are out of norm in small appliances. I could have purchased their 1500 humidor model or a nice beverage cooler in the future but there are brands who I know will stand behind their products with confidence. Newair’s incompetent customer service is enough for me to look elsewhere in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kelly DuVall",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T03:32:49.000Z",
          "Titre": "Known issue with faulty partys",
          "Contenu": "I purchased a beverage cooler and very quickly the temperature sensor wasn't working. They have sent me several replacement sensors at no cost, but clearly there is something wrong with their sensors. They should be fixing the sensors instead of just sending new ones over and over. Their customer service has been friendly and responsive, but overall, i am frustrated with my experience with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Shumate",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T14:59:50.000Z",
          "Titre": "Atrocious customer service",
          "Contenu": "Atrocious customer service a day agoI purchased a new air beverage refrigerator two years ago. The blue colored lightbulbs burnt out so Icontacted New Air to purchase new lightbulbs for the beverage refrigerator.  One of the specific reasons I purchased this particular beverage refrigerator was because it illuminated a blue color and looked really cool. For two months I have reached out six different times via emails(5) and phone calls (6) regarding this beverage refrigerator with model number, SKU number, and photographs to get new light bulbs.  Two separate times I received the incorrect lightbulbs. Each time I was told they would follow up and call me back regarding the correct lightbulb request and never received a follow up whatsoever. I’m going on two months now dealing with this and have decided that I will never get anywhere with this company. All I wanted were simple lightbulbs and I can’t recieve adequate customer service.  I can imagine if I had a serious issue with the beverage refrigerator. They can’t even handle a simple request .Profile imageKim ShumateUpdate… I received a reply from New Air last night, requesting that I call them today and they will take care of the issue. I phoned them twice today and not surprisingly DID NOT receive a phone call back from customer service. I guess I was hoping that they would rectify my tiny request for lightbulbs for my beverage refrigerator. How disappointing. I give up I have never had such horrendous customer service ever for anything.Update regarding customer service. After receiving a letter from New Air, they proceeded to send me the same incorrect lightbulbs for the third time. They seem to have a difficult time finding the correct lightbulbs, even though I sent them photos of the correct lightbulbs that I need but receiving the incorrect lightbulbs three times. I am now sitting with six incorrect lightbulbs for my new air fridge and they can’t seem to get my simple request correct. At this point it is comical, I will keep you updated because now I’m curious to see if they’ll ever get it right.  The definition of stupid is doing the same thing over and over without changing. Let’s see what happens. I sent them a photo of the lightbulb that I need and I don’t understand why it is so hard to fulfill that request. Follow up, I made two phone calls today to the customer service that they asked me to call. I thought they would rectify the problem but they never returned both of my phone calls. I guess I’m not that disappointed since the original customer service was horrible.  Beware of any issues you may have with their products.  All I wanted was two little lightbulbs for the beverage refrigerator, it wasn’t even a serious issue with the product itself. What does that tell you. Beware.UpdateOne month later…… still waiting for A Follow up…… NOTHING 😬ANOTHER ATROCIOUS UPDATE…I received a 3rd attempted lightbulb replacement request… THIS IS MY 3rd incorrect order delivered….this is now comical."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T20:24:41.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service! I purchased a 56 bottle wine cooler that stopped working after 18 months. I was told it was a faulty fuse that needed to be replaced. Turns out this is a common issue with the wine cooler. They send me fuses to replace, which requires taking the entire system apart to replace. How am I suppose to do that! I requested a new unit or a certified technician to repair it. What I got was an offer of 40% off a new unit!. The company knows that this unit has a faulty fuse issue and sells it anyway. They refuse to do anything else because I did not buy an extended warranty!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea Caso",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T18:40:22.000Z",
          "Titre": "Quick response",
          "Contenu": "I had my portable ac unit for a few years up in the attic with with really high and low temperatures which made the hose fall apart.  I bought a few replacements on line and none fit.  I reached out to new air and they responded right away but now 3 months later there still is no resolution.  They are telling me the hose they sent was the right one.  Which it definitely isn’t.  I guess I will trash the new air and buy a different portable ac/heating unit"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy Carr",
          "Nb_Reviews": 2,
          "Date": "2022-09-22T19:37:21.000Z",
          "Titre": "We purchased a Newair wine fridge…",
          "Contenu": "We purchased a Newair wine fridge approx 3-4 years ago. It stopped working in March of this year. We have waited “patiently” for over 6 months for the part and the response we get back when we reach out for an update is “we’re very sorry for the inconvenience, it is still on back order and will be shipped in approx 1-2 mos”. Same message every time and we are now completely out of patience as it’s just been one run around after another. We will never purchase another Newair product going forward. A very dissatisfied customer! Bruce and Cindy Carr"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 4,
          "Date": "2022-09-22T18:15:15.000Z",
          "Titre": "Bad Product Bad Customer Service",
          "Contenu": "I wouldn't recommend these evaporative coolers. Mine lasted only three months before it stopped working. Also, their customer support is very difficult to work with. Their communication is terrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TE",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T22:10:30.000Z",
          "Titre": "Couldn't complete order on mobile device"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 2,
          "Date": "2022-06-09T23:57:24.000Z",
          "Titre": "Poor",
          "Contenu": "I called to place an order for a replacement part for a wine refrigerator. It took 45 minutes to place the order as the customer service girl made several mistakes ( spelling of names and addresses). She sent me several emails to confirm the order information and I had to correct her 4 times before she got my name spelled right and the correct billing and shipping address. Not a good experience. It should have taken maybe 10 minutes to place the order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Morgan",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T02:35:13.000Z",
          "Titre": "There was a glitch on my first order. Wrong part sent.",
          "Contenu": "There was a glitch where I received my package and got sent the wrong part. I told the woman I spoke with to go ahead and send me the correct order: The brown cardboard-looking filter plus the black foam piece for one side and the silver-colored filter for the other side.I felt, when I spoke to her, that we finally had it settled. Please, if necessary, to double check with me before the new package is sent.... It will include 3 parts for the filter.  Ticket #89550).Thank you and Be Blessed, Morgan"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynda Zetnick",
          "Nb_Reviews": 3,
          "Date": "2022-08-04T02:08:05.000Z",
          "Titre": "Newair Misting Fan-cant get replacement hose",
          "Contenu": "I bought a Newair misting fan and the misting hose started leaking after the 2nd or 3rd use.  they don't have a replacement part available, don't take returns when you order the wrong part, promise to send you a replacement fan since they don't have the part if you will give 3 reviews, then tell you they can't send you a replacement fan if you don't still have your receipt.  All I asked for was a return label to send back the replacement part that didnt fit and get a refund and I got this big run-around from Sandra at Newair in California.  I won't buy another one of their products because I can't order replacement parts from them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Molly Pool",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T20:29:36.000Z",
          "Titre": "Gave me the runaround when returning the item",
          "Contenu": "Ordered an AC unit during a heatwave. Website guaranteed Tuesday arrival, didn't arrive til Friday. We ended up finding another unit locally because we couldn't wait that long. I called to return the Newair unit. The customer service rep said she'd send me the shipping label \"in a couple days\". A week passed, it never arrived. I called again, spoke to someone else (Rebecca G). She told me she \"sent my refund\" but never sent me the return shipping label. I emailed a couple days later to inquire, she told me that it would arrive in a separate email from Fedex in 2 more days. It never arrived. Then I went to the website to chat with a customer service rep (Charles T), who finally was able to send me the PDF over chat. I shipped the unit back 10 days ago. Still haven't received my refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Pio",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T00:20:04.000Z",
          "Titre": "My experience was horrible",
          "Contenu": "My experience was horrible.  The customer service department never contacted me.  I had to contact them and then they are holding up the shipping of my replacement fan for a positive review."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi Calka",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T23:28:05.000Z",
          "Titre": "Switch and Bait",
          "Contenu": "Switch and Bait. Does not even deserve one star. My son ordered a Wine Refrigerator and TWICE received the wrong one. Left message for Supervisor- he called back after FIVE days. Refrigerator they ordered is no longer available... they will refund him only after he returns the two other WRONG refrigerators. He has to box and bring to Carrier himself. They would not arrange for their Carrier to pick up, even though it was their error! These items are big and heavy. HORRIBLE, HORRIBLE Customer Service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dennis Taylor",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T13:51:54.000Z",
          "Titre": "I bought a nugget ice maker",
          "Contenu": "I bought a nugget ice maker.  They sent me two broken replacements and now no refund.Don’t buy from these people.  They know their products don’t work, ongoing issues and will send you replacement products that do not work either and finally will not refund your money.  Scam company.  Warning be aware!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hope",
          "Nb_Reviews": 3,
          "Date": "2020-09-11T00:34:00.000Z",
          "Titre": "These people are crooks",
          "Contenu": "These people are crooks. We bought an air cooler which didn't work right. So, we returned it. They kept promising we'd get our money back and never did. I had to dispute the charge with our credit card. Then, they finally refunded us... but shorted us a little money. Now... 2 or 3 months later, they are billing us again!! Now, I have to dispute again. They are a bunch of crooks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hope",
          "Nb_Reviews": 3,
          "Date": "2020-07-14T21:54:11.000Z",
          "Titre": "Never gave me a refund",
          "Contenu": "I ordered and received an air cooler that didn't do much so I returned it. They received it mid June (have fedex receipt to prove it) but as of today, 7/14, they still have not refunded me. I have contacted them numerous times and they keep saying they will let their supervisor know. I will be calling my credit card company to get the money back since they won't give it to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Colvin",
          "Nb_Reviews": 4,
          "Date": "2020-06-24T21:49:03.000Z",
          "Titre": "terrible customer service",
          "Contenu": "I ordered a Humidor cc-300H 400 Count Cigar Humidor, Climate Controlled with Opti-Temp™. Fed ex said they delivered it on 07/21/20 and \"Left at door\" I was home and the driver did not knock on the door or ring the bell as I was home I found out on 07/24/20 about the delivery and called to speak about it. They no longer carry this humidor. they will refund my money in 1-2 weeks. That is unacceptable customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Buckley",
          "Nb_Reviews": 1,
          "Date": "2020-05-04T14:51:56.000Z",
          "Titre": "Probably the worst customer service I…",
          "Contenu": "Probably the worst customer service I have ever experienced!  We are now going on 4 months of back and forth with customer support to get the correct replacement part (which I paid for) and they have sent me FIVE of the same wrong part.  I could have get better service from my neighbor's dog!!  Will never purchase anything from this terrible company again.....WORST EVER!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rams",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T19:16:44.000Z",
          "Titre": "the wine fridge that wasnt",
          "Contenu": "Ordered a reasonably priced wine fridge with a dent. No shipping info provided, and then when i reached out a week later they said it was on back order with no timing on when it would be shipped. I think these guys sold me a fridge and are now just waiting for someone to dent and return one. Guess ill just cancel the order. Weird company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Merry Christmas",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T17:19:09.000Z",
          "Titre": "BAD Customer Service & Shipping!",
          "Contenu": "Been trying to get my 14000 btu air conditioner replaced for almost a year now. It was shipped thru Fed Ex and arrived damaged. Appeared as though the flimsy box was dropped, damaging the product inside. Terrible customer service. It’s been a year and I’m still trying to get the unit replaced. They offered me a less expensive unit and I said no. They’ve told me numerous times it was being shipped, still nothing. It was promised again the beginning of Feb and supposedly being shipped now, hopefully not damaged again. I would not buy again from this company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel V",
          "Nb_Reviews": 1,
          "Date": "2019-05-28T17:08:16.000Z",
          "Titre": "BE VERY CAREFUL WHAT YOU BUY FROM THIS COMPANY!",
          "Contenu": "I purchased a \"small\" (it was much bigger than in the pics), portable heater that listed all numerous safety features except for one -- where the grill would be hot and burn to the touch. No problem, initiated the return and shipped back the heater using their shipping label because they offer a 30 day money back guarantee. A month has passed since sending back the unit and still no refund!!BE VERY CAREFUL WHAT YOU BUY FROM THIS COMPANY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Hardesty",
          "Nb_Reviews": 1,
          "Date": "2019-05-21T18:30:59.000Z",
          "Titre": "I’m not happy",
          "Contenu": "I’m not happy. I purchased a Newair 21 bottle wine cooler that lasted about 13 months AW211ED. Called customer service and they said that the warranty was over and parts to fix fix are 2 months out anyway, so I should purchase a new one and they won’t sell them with longer warranties. I don’t want to buy a new one every year. I am not happy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Raj Hansraj",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T17:05:29.000Z",
          "Titre": "New Air's delivery schedule is really…",
          "Contenu": "New Air's delivery schedule is really horrible, had to cancel the order after 10 days , even though the product was in stock, their customer service were like it will ship in a few days and 10 days later it still has not shipped, i can only imagine what their product service would be like ... HORRIBLE !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maurice E",
          "Nb_Reviews": 6,
          "Date": "2020-12-15T14:08:20.000Z",
          "Titre": "Bought and paid for a dual zone built…",
          "Contenu": "Bought and paid for a dual zone built in wine cooler Received a 177 can beverage coolerWOW how can you screw up an order like this.  Will repost if they take care of thisIf a company like this can mess up on an $800 Oder then definitely will not recommend to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel J. Silverman",
          "Nb_Reviews": 2,
          "Date": "2019-08-05T21:30:09.000Z",
          "Titre": "The first unit I bought from you was…",
          "Contenu": "The first unit I bought from you was replaced before it was 30 days old by the original seller since it went bad.  That unit is now being replaced by the manufacture 6 months later because it went bad.  To add more pain, you could not send out the replacement part because you won't have any in until the end of September, so you are shipping me a replacement unit, but oh yeah, those are on back order also.  It might have made the pain worse if it had not taken me over 1.5 hours through online chat to resolve the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacqui Siefert-Cooke",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T21:19:40.000Z",
          "Titre": "I'd leave 0 stars if I could",
          "Contenu": "I'd leave 0 stars if I could. We ordered a standup air conditioner from their store on Amazon. We hooked it up and set the desired temperature then turned it on. The unit would not stay running to get to the temperature we set. I called their support line and since they could not help they shipped out a new unit. We set that unit up and it did the same as the first one. I called support again and told them I'd be shipping both back and would like a refund for the first one we purchased.Since it was purchased through Amazon, Newair has to cut a check back to me. I was told it could take up to 30 days. They received the units back on July 18th, 2022. It's been almost 10 weeks (80 days) and no refund. Everytime I contact them I get the same response \"it takes up to 30 days\", when I point out that it's been over 2 months all I get is \"please be patient\". It should not take this long to refund my money.I've since filed a claim with my credit card company. They've credited my money back and are now going after them for it.DO NOT DO BUSINESS WITH THIS COMPANY!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 2,
          "Date": "2019-04-19T18:03:04.000Z",
          "Titre": "Bad company, horrible customer non-service reps",
          "Contenu": "We purchased a misting fan made by Newair from a third party vendor (Sams Club.) When we assembled it, it was missing a part. I contacted Newair to ask how we could obtain the missing part. They rudely replied that they would not be restocking the part until July 2, which means we would have 3 months of not being able to use the item. I'm not fully convinced we'd get the missing part even then based on how very unconcerned and disengaged the customer non-service rep was. She stated she hoped this would not inconvenience me. Bad company. Do not support this brand."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chuck Gushlaw",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T22:09:40.000Z",
          "Titre": "Do not buy anything from this seller'…",
          "Contenu": "Do not buy anything from this seller' Junk !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Thwing",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T22:07:07.000Z",
          "Titre": "New air is GARBAGE",
          "Contenu": "New air is GARBAGE! I ordered a 32 bottle wine cooler. 6 days after I placed my order, I get an email saying my order was canceled. When I called customer service I was told the product went out of stock that day. I explained that my order was placed the week prior. They said there is nothing they could do seeing how the product was not going to be back in stock. I asked could they give me a cooler of equal value. They said no. They would just replace my money. Which they did...2 weeks later! I will never do business with this company again! I have worked in some type of customer service my whole life and never would have treated a customer like this!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Egbert Souse'",
          "Nb_Reviews": 2,
          "Date": "2021-02-05T13:08:19.000Z",
          "Titre": "I purchased one of their remanufactured…",
          "Contenu": "I purchased one of their remanufactured products not realizing their definition of remanufactured was simply repackaging damaged goods and shipping to a new customer. Now they are ignoring my attempts to contact them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 1,
          "Date": "2019-10-16T21:49:42.000Z",
          "Titre": "NewAir Warranty is a clownshow",
          "Contenu": "I am disappointed in NewAir's warranty policy.  First, the item stops working in just a few months.  Then I request support and am told that I have to do the repairs myself.  After I agree and send my address (to send the replacement parts) I'm given a followup email saying that I have to pay for shipping...do I mind?  (Do I have a choice?). I say \"no problem\" and provide my CC information and am told in another email that no, I can't send in my information, I have to call in to give my payment info (why didn't you just say all of this in the first email, not the third?).  NewAir Support seems a bit like a clownshow..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sharon Pierce Post",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T00:50:31.000Z",
          "Titre": "Please Please read all reviews and save…",
          "Contenu": "Please Please read all reviews and save your money on this product! Spend the money and get something that will work more then 6 months. I can not get a cll back from Newair to even talk about what's going on!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Morford",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T21:23:46.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Terrible customer service, I have an 18 bottle wine fridge of theirs and I need the motherboard replacement and fan they want to charge me half what the entire fridge cost. I would not recommend this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amy W",
          "Nb_Reviews": 4,
          "Date": "2019-10-11T16:30:35.000Z",
          "Titre": "Still waiting order....for the second time",
          "Contenu": "Ordered a part for Wine Frig. On Sept. 27. On Oct. 8 I called customer service because I had heard nothing about my order. First customer service agent said FedEx said delivery was pending. I asked for tracking #. When I put in tracking number FedEx said ticket was created but item was still in NewAir possession.I called customer service and found out order has never been shipped and it had just slipped through the cracks. Then Christina said that they could expedite my order to two day delivery. Today, Oct 11, I called for tracking number and the delivery date is scheduled for the 14th. Definitely not a two day delivery or expediting from the 8th. Highly frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mir Moghaddam",
          "Nb_Reviews": 1,
          "Date": "2020-08-15T05:13:34.000Z",
          "Titre": "They are bad machines only last one…",
          "Contenu": "They are bad machines only last one year! Terrible customer support! The lady from customer support said she will call back by end of the day which was a week ago! Don’t waste your money on NewAir Products!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah AK",
          "Nb_Reviews": 4,
          "Date": "2022-06-29T19:22:54.000Z",
          "Titre": "Only had our NewAir ice maker for a…",
          "Contenu": "Only had our NewAir ice maker for a short time and it broke and even a couple months later we have not received our new unit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Art Kimmel",
          "Nb_Reviews": 5,
          "Date": "2020-08-11T04:26:22.000Z",
          "Titre": "Remanufactured means send the problem to a new customer",
          "Contenu": "Purchased a remanufactured mister fan for my patio and a two year warranty. Upon receiving the unit I discovered that the plastic gears that provide the oscillating function were bad. A poor design that was obviously never remanufactured. When I contacted customer service they informed me that there was no more stock and that I could only return it for a refund. After sending it back and several more calls I got a partial refund after 3 weeks.  They informed me upon my inquiry of why it was only a partial refund that they do not refund shipping costs. So it cost me ~ $35 and a month of my time to receive and return a defective unit. Don’t buy anything remanufactured by them and especially don’t buy a mister fan, even new, as it is poorly designed. Absolutely an awful experience with New Air!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abby Lowe",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T17:29:47.000Z",
          "Titre": "Opened fridge and plugged in as…",
          "Contenu": "Opened fridge and plugged in as instructed and it has not been able to cool to the desired temperature."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annie",
          "Nb_Reviews": 1,
          "Date": "2020-07-26T01:55:50.000Z",
          "Titre": "Trash company",
          "Contenu": "Trash company. Won’t refund my money even though they don’t have the item in stock and the order was canceled by them. Rep yelled at me on the phone. Don’t waste your money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "michael cano",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T19:50:56.000Z",
          "Titre": "Newair is crap they would only send…",
          "Contenu": "Newair is crap they would only send part under warranty if I left a review. Fixed with new part and it broke agai 3 mos later....Just crap"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don Cappabianca",
          "Nb_Reviews": 2,
          "Date": "2022-03-15T22:22:02.000Z",
          "Titre": "NewAir Customer Support will say anything to not honor a warranty",
          "Contenu": "On 12/18/21 I purchased NewAir NCH840BK00 cigar humidor. From the day it was first plugged in the compressor was extremely noisy loud banging sound that fills the room and runs constantly. Over the past few months the banging has gotten louder and can be heard in other parts of the house. The humidification is set at 70% humidity, however, the cigars have never felt right. I purchased a hygrometer calibration kit. After placing the calibrated hygrometer in the humidor for 48 hours it read 59% not the 70% it is set at. Since the unit is still under warranty, I contacted Customer Support I was asked to send a recording of the sound which I did. I was told the \"noise is normal & is coming from the expansion valve.\" I was also told I had to \"set 3 hygrometers in the unit to accurately measure the humidity.\" I have owned other NewAir humidors and have never heard of such ridiculous statements. NewAir clearly will say anything to get out of honoring the warranty they say exists."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PAS",
          "Nb_Reviews": 2,
          "Date": "2019-03-12T23:00:55.000Z",
          "Titre": "ordered a wine frig from New - Air",
          "Contenu": "ordered a wine frig. never received delivery  confirmation as they said I would. Delivery company left 120 pound wine frig. outside in a uncovered area. I was home all day,Delivery person never rang door bell to notify of delivery. Box was left below steps , in uncovered area completely exposed to the elements. top of box was not sealed , visual structural damage to box on the side. called company as on hold for 20 minutes finally got a rep who indicated he would send a return label, I have yet to receive the return label. Was told to leave box there and fed ex would pick up in the morning.Box is outside in the elements  still after several hours have not received return shipping label.   NewAir has been a complete headache to do business with, save yourself the aggravation and order from another vendor. I will update when i receive a return delivery and credit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy Customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T23:44:39.000Z",
          "Titre": "One star is too many...",
          "Contenu": "Bought a NewAir dual zone beverage cooler in late 2018. In March 2021, I noticed the temperature reading was stuck at 99 degrees Fahrenheit in the left side cooler and everything on the left side was frozen. Tried unplugging, defrosting, cleaning out the spills from the exploded cans, and resetting the temperature to 48 degrees. The temperature reading is showing the set temperature, but everything is frozen again.  Customer service agreed that it’s a faulty temperature sensor, which seems to be a common issue with their products. However, I can’t simply order the part on their website. I need to call and give my credit card info over the phone - to a company I have zero faith in. I’ve offered several alternatives and currently waiting to hear if they’ll accept a MasterCard gift card (it’s not sounding promising). What a scam. STAY FAR, FAR AWAY FROM THIS MANUFACTURER!!!Updated: they do not accept gift cards. So buy their crappy products so they can steal your credit card number when you’re forced to buy replacement parts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan Alexander",
          "Nb_Reviews": 3,
          "Date": "2019-08-27T18:30:37.000Z",
          "Titre": "HORRIBLE CUSTOMER SERVICE.  HORRIBLE",
          "Contenu": "I ordered a handle from NewAir and placed the order.  I received an email telling me it was shipped.  I never received a tracking number.  After 4 days, I emailed customer service and was told they would get me one from the shipping department.  That never happened.  When I inquired after a week of not getting my item, I was told that it was about to ship that day.  Then I find out later it was not in stock and they were trying to get it.  There was no communication that this was the case.  No email, nothing.  They sure didn't care to pull the money out of my account.  But couldn't be courteous enough to send me an email or let me know what was going on with my order.  I finally spoke to someone by phone (Afernee) who was very matter of fact and really offered nothing to fix my issue or make it right.  They said they were trying to get an approval to remove the handle from another item and ship it to me but could not promise anything.  I finally cancelled my order as this company obviously does not have it together.  Horrible customer service.  I will not do business here again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy Carr",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T21:17:42.000Z",
          "Titre": "Excellent Customer Service experience with Newair",
          "Contenu": "Updated review: 9/22/2022Originally I gave this company a 5-star review but now I am revising it.  We have been waiting on a single replacement part to repair our less than 4-year-old beverage cooler.  It has been approx 6 months of us regularly reaching out for an update - and always the same basic answer just with a different date -\"we are expecting a container in (insert a month)\".  When that month arrives we are given another date -  so on and so forth.  Needless to say, we have a fairly new appliance that has not worked for 6 months.  The company was so \"kind\" as to offer us a small discount on purchasing a new unit from them.  Why would we buy another one of your products when we already have a fairly new one that doesn't work and apparently will never be repaired?  VERY DISAPPOINTED - we will not be purchasing your products in the future.Original review date 4/27/2022We are having some temperature issues with our Newair wine/beverage cooler.  I reached out via email to their customer support team and much to my surprise they have been very responsive.  In today's environment, good customer service (especially on a previously purchased product) is hard to find.  They have answered questions, and given troubleshooting tips and solutions.  Thanks for being so responsive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Smith",
          "Nb_Reviews": 1,
          "Date": "2019-08-09T20:07:45.000Z",
          "Titre": "What a Difficult Experience!",
          "Contenu": "Ordered what looked like an awesome beverage refrigerator for my garage. It was priced fairly and the unit had high reviews.I received the unit on 7/24/19. When I opened the package, the glass on the door was broken on the inner side, Completely shattered. I reached out to NEWAIR the following day and was told that a replacement door would be sent to make the repair. I received the email confirmation that the damage had been noted and a door would be sent in 3 to 5 business days.Fast forward 10 days and no door. I called and was told that the Door would again be sent in 3 to 5 business days and I should receive another email with tracking information. No email ever arrived nd no tracking information. I wait 4 days and call back, I am told that they don't know why the door wasn't shipped, they had 3 in stock. Frustrated I asked for a refund as I am tired of dealing with this at this point.Now I get to go home to recreate a box because I threw the other out. Thinking I was going to receive a replacement door. Package everything so as not to allow any further damage to the unit and wait for a FEDEX label do I can send it back to them.Then and Only then, can my refund be processed, again in 5-7 business days AFTER they receive the defective unit?We shall see if they hold to their word on my refund.I would not recommend this company or their products due to the extremely poor service they provide. Be very careful about giving them yoiur hard earned money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2019-12-10T20:38:57.000Z",
          "Titre": "Completely bizarre experience",
          "Contenu": "Completely bizarre experience. TL;DR: Please don't order from these folks, it's just not worth it. If you do, you may end up in a bizarro-world time suck talking to really inept customer service reps. I ordered a fridge from these folks, direct from their website. Site said order should ship within 2 days for the item I purchased. After around a week, I still hadn't received tracking info, so I reached out to their customer service team. I spoke with 4 different CSRs over the course of a few days and phone calls, each read the same canned response off their sheet and said that tracking info is commonly delayed in populating and I'd receive info in the next 24 hrs. Nothing. After 3 more days, I finally opted to cancel my order and move on with my life. Refund received, that should have been the end of it. Then 2 weeks after receiving my refund (almost 4 weeks after date of order), my fridge was delivered even though I'd been refunded already. I kept telling myself to just sell it on craigslist, but my conscience won out...decided it wasn't worth bad karma over a fridge I no longer need. So I call customer service over in Asia again, get put on hold for a while, only to frustrate \"Liz,\" a CSR, and get hung up on. Call back again, speak with \"Bev,\" a manager, and she is now attempting to coordinate pickup of this thing. I really doubt this saga is over, this company is so terrible. If it's still in my garage come xmas, I'm donating it to someone in need."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jayan Singh",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T23:58:44.000Z",
          "Titre": "8/19 Update",
          "Contenu": "8/19 Update: Since my last initial post, this experience has become a veritable nightmare:-After being told the part would be shipped out, I never received tracking info and part did not ship-I had to follow up multiple times to get the part shipped-Part showed up and it was the incorrect part-Sent photos of incorrect and correct part I needed-Another part was sent out-Still the wrong part-Repeated this exercise with another agent-Received wrong part for 3rd time-For the next month, I continually followed up and asked to speak to a manager.  Managers are never available and never called me back.-Finally they determined that they had the correct SKU but that the warehouse somehow keeps shipping the wrong part.  In order for the correct part of be sent, someone at New Air would need to make contact with them and sort this out.-Weeks go by, no update-Never once do they proactively update me.  I always have to follow up.   And I always have to deal with a new person every time I call who is not familiar with the case.  It seems like I am starting from scratch each time-In an act of desperation, I speak with a rep and threaten to email the CEO every day until they fix the issue-Miraculously, the rep makes contact with a manager who indicates that they have finally made contact with the factory and resolved the issue.  New part will be shipped out imminently.-I receive an order confirmation for the new part, but no tracking information.  It says it is going out fedex 2 day air-5 days later, it has not been received-Called and spoke with a rep.  Their system also does not have a tracking #.  She will need to research and will email me an upate.-The saga continues...stay tuned for the final outcome....I'll post my next update in two months when this is still an issue.In the mean time, I can't put my wine fridge against the wall because I broke the drip tray during a defrost because the wine fridge never actually worked right from the start.  Two of the shelves freeze over and the temperature never reaches the desired state.  They said the temperature gauge must be off and sent me a new one to install which requires me to remove every single shelf from the unit.   One of these days I'll get around to that.  In the mean time I am limited to a 50 degree low temp and risk two shelves getting iced to the back every so often.  Will NEVER buy another New Air product so long as I live.  They actually coerced me into writing 3 positive reviews for them by offering free shipping on the part.  So shady."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "xyzpl",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T01:55:57.173Z",
          "Titre": "double charged, won't refund till shipment returned and lied about shipping",
          "Contenu": "Place an order online for a wine cooler on 4/14. The total amount was $2289.69 and the website charged my card. A couple of hour later I received an e-mail from Newair stating that there was additional security measures needed to approve my order and for me to contact them. I call the number on the e-mail and spoke to a Camilla Mendez. She said I needed to send her a copy of my drivers license to approve the order. I was not comfortable sending a copy of my drivers license so I asked her if she can just verify me over the phone. She said she can, but it would be a new order. So I told her that's fine as long as the previous order is canceled and I don't get double charged. She said it is only a hold on the card and if I don't supply my drivers license, the order will get canceled in 48hours. I informed her that I am on my creditcard's website and the charges shows posted and not a hold. she assured me that it was a hold and will be released in 48hours. I checked my account on 4/18 and 2 charges shows up under Newair. I contacted Newair immediately and the customer rep, Fern, told me that both shipment has shipped and they can't refund me until the duplicate shipment gets refused and return to their warehouse. I requested that they contact the shipping company and just cancel the shipment so they can ship it back, but Fern said they contacted the shipping company and they could not do a reroute of the shipment, it had to be refused and sent back. I checked the tracking number for both shipments on 4/21 and both show that it has been at the terminal since 4/15. I called the shipping company to get an update and they said they have been trying to schedule a delivery with me for a week, The BOL had Newair number on it instead of mine and no one at Newair return their call. I explain that I am the consignee and I like to schedule the shipment. I also inquired about the duplicate shipment. The shipping company said according to their notes no one had called contacted them regarding the duplicate shipment and all it takes is a call to them and they would route it back. Because it does not make any sense for them to try and deliver it and have it refused when it is already confirmed to be a cancel shipment. So Newair charged me twice even when they assured me it was a hold, then they lied about the shipping also. Most likely to charge me a restocking fee or some other hidden fees that they are trying to hide. I also never received the free wine tumbler set that was advertised on their website as a free gift with purchase."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Emil Nielsen",
          "Nb_Reviews": 6,
          "Date": "2016-08-23T18:20:12.759Z",
          "Titre": "Everything broke",
          "Contenu": "Bought two wine coolers, both broke."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nicholas Hoppes",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:03:17.000Z",
          "Titre": "Unreliable Shipping Quality",
          "Contenu": "My original order arrived damaged. A replacement was shipped, and it too arrived damaged exactly the same as the original fridge I ordered. Why isn't an appliance company shipping their products in crates to protect them during transit?!! I've told customer service to not send me another replacement because I just don't have the faith that it would arrive in any better condition than the last two....\"Fool me once...\""
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T21:21:42.000Z",
          "Titre": "The customer service representative was very friendly and helpful",
          "Contenu": "The customer service representative was excellent, but the product was a disappointment. We'll see if the replacement unit is any better or at least works..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "calisoldier",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T23:54:03.000Z",
          "Titre": "customer support fell short",
          "Contenu": "I had a problem with a door leak in between the glass on one of my doors. Customer service is supposed to send a replacement door on something that appears to require complex dissembly, without a video or instructions. I have no knowledge or skill to replace the door. I asked customer service for assistance but they stopped responding to me. This should be handled properly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel Serrano",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T01:04:46.000Z",
          "Titre": "On my first call",
          "Contenu": "On my first call, I was told than a replacement part was going to be sent and that I could install it myself. Later in the day I received a call from your representative that you needed more information on the problem. After once again explaining what the issue was with my unit, and finding that the replacement part was not available, your representative made the decision to send a new unit"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Fisher",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T04:18:18.000Z",
          "Titre": "Incomplete sensor replacement instructions",
          "Contenu": "Unfortunately, the instructions sent with the replacement temperature sensor I ordered left out an important detail about my unit, the AWR460DB.  The ladies who tried to help were very kind, courteous and patient.  But, apparently, instructions for removing and re-installing the digital display shelf between the upper and lower compartments do not exist.  I'll make the attempt on my own but imagine I'll be looking for a different brand if I fail.  I wonder why Best Buy no longer carries New Air."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "J Smith",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T21:25:14.000Z",
          "Titre": "New Air product purchased  Jan of  2022…",
          "Contenu": "New Air product purchased  Jan of  2022 and it worked fine in the beginning however It started giving me problems at the end of July  and completely stopped working in August."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mark Prilliman",
          "Nb_Reviews": 1,
          "Date": "2019-08-08T16:20:42.000Z",
          "Titre": "Decent Ice Maker...Bad Customer Service",
          "Contenu": "It is a decent ice maker that kept up with ~ 30 employees using the machine throughout the day.  Ice machine broke within 8 months.  Purchased replacement parts that could not be installed.  Sent back unit since it was under warranty.  Customer service did not follow through on providing return dates.  Then said the UPS tracking number that was in the message string from a month earlier didn't work and then claimed the unit was out of the warranty period.  Had to email a copy of the receipt to prove that it was indeed within the 1-year warranty period.  Finally, Newair decided to send a replacement unit.  Far too difficult to work with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Lazarowski",
          "Nb_Reviews": 1,
          "Date": "2019-09-07T00:22:08.000Z",
          "Titre": "Temp sensor is a hi fail item - expect problems.",
          "Contenu": "Purchased NewAir dual zone beverage cooler model AWB-360DB in Feb of 2018 for about $700. In April of 2019 the right side temp sensor failed. Internet research indicates this is a high fail item, has been for quite some time. In fact, such a high failure rate they were out of stock. The part was $21 plus shipping, about $25 total.  With it I lost three bottles of wine so the total cost of the failure and repair was over $100. Today, September 6, 2019, the left side failed but this time I only froze and burst a few soda cans. Part cost was again $21 and in stock this time.  Point is, for a $700 cooler I expect the parts to last longer.  With such a failure rate, why hasn't NewAir engineered something more reliable and offered it to the customers? I feel it is because the temp sensor is proprietary equipment, meaning only they make it and sell it to make money. I looked at my first bad sensor and it did not have any markings, no indication of voltage required or sensor details. NewAir has customers captive, if they want a working cooler they must buy from NewAir, so why improve it and lose out on making money?  At least I can replace it myself  and not pay a technician. If I had a choice I would return this cooler for a refund however the first failure happened just after the one year warranty expired."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Becky Kimberly",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T21:09:39.000Z",
          "Titre": "The process is ridiculous."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Mitchell",
          "Nb_Reviews": 4,
          "Date": "2019-08-13T01:07:30.000Z",
          "Titre": "Newair isn't a 5 star company based on…",
          "Contenu": "Newair isn't a 5 star company based on there customer service manager not excepting responsibility for the mistake his employees made costing me lots of money due to the cigars I lost and couldnt save and some were cubans based on the info I was given by newair. After calling them and asking them about the newair cc100h humidor and getting all the info not one time days prior to ordering it did they say it was out of stock. So I ordered a lot of expensive cigars to find out the humidor was out of stock until the end of august I talked to the person in customer service 3 days in a row they told me the same thing it was out of stock until the end of august I knew I was in trouble I had cigars coming and they was delivered by ups that day right around a 100 cigars I spent the day trying to find a safe way to store them needless to say I was upset so another day and a half went by so out of the blue I decided to try to order the newair inspite of what they was telling me. And guess what my order went thru I was shocked and happy at the same time. First thing I did was emailed the person I had been talking to and told them what happened all I got was excuses to I made a mistake to I talk to a lot of people every day and I got the product mixed up, mind you I talked to this person three days in a row and I was told the same thing. So I asked to speak to the manager what good that do he made up more excuses for them telling me that I was upset but I let it go, I was worried about my cigars the humidor came 10 days later because of the weekend I had to season it and get the humidity right for my cigars which was another 9 days by this time my cuban cigars was starting to dry out by the time I got them in the humidor I couldnt save them. So I called the customer service mgr he could care less he offered a 5% discount which was $13 I thought to myself that's crazy to make a long story shorter I ask for Mr Luke Peter's which is the CEO he told me Mr Peter's couldnt take my call right now so the next day I called and asked for Mr Peter's  and the lady said she would have him return my call. But as of today I still havent heard from Mr Peter's he is to good to talk to his customers. Today customer service offered 15% discount for a total of $25 for what they put me thru and what it cost me for the incorrect info that was given to me that cost me almost $300 in cigars that went bad. So you see Newair will no longer be my first choice and I will be returning the unit as soon as they send me a return label put yourself in my shoes do you think $25 is enough for the big costly wrong info given by the customer service rep. You make your own decision if you want to buy from here, but this could have easily been you it happened to and I still havent heard from the CEO Mr Peter's. If any thing change I believe in being fair I will put out another review telling you what changed if any thing because I feel you the customer deserve to know who you are trusting with your next purchase big or small."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Weez",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:43:47.000Z",
          "Titre": "Online order didn't work because…",
          "Contenu": "Online order didn't work because wouldn't accept my address.  Had to order by phone so no online order to reference.  The wine cooler I ordered/received has some poor workmanship and cosmetic flaws, but will hope it works well and lasts for years."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T21:18:26.000Z",
          "Titre": "Had a few different models of wine…",
          "Contenu": "Had a few different models of wine fridges that I tried to buy, only to get the message during checkout that the products couldn’t be shipped to my address."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HV",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T19:00:54.000Z",
          "Titre": "My Recent Experience Locating Part",
          "Contenu": "Charles Trapp in Customer support was very helpful. What I didn't like was how difficult it was to find the part that you need on the website. Website could be way better. I would like to see part lists and parts diagram easily accessible. Also instruction pdf on replacing parts. User friendly and durable design is the way to attract and retain customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JZ",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T00:29:48.000Z",
          "Titre": "Good CS But Disappointing Warranty",
          "Contenu": "Very responsive customer service. However, I am being sent a water pump to replace myself - I’m not looking forward to attempting to replace it in my own. I’m not certain the pump is the problem - it seems more like a sensor is not telling the pump to start. I guess I expected more from the warranty department in a unit less than a year old."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lauralyn Mann Salinas",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T17:29:48.000Z",
          "Titre": "NewAir Nugget Icemaker",
          "Contenu": "My ice maker started leaking and making a noise, so I called for support.  Charles was very friendly and helpful.  We love our icemaker and would have like a replacement, unfortunately they could only process a refund otherwise I would have give a 4or5 review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Henry Yeh",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T21:35:02.000Z",
          "Titre": "I purchased the main control board for…",
          "Contenu": "I purchased the main control board for my AWR-520SB unit.  The pictures in the installation instruction does not match my unit and the control board wire plugs also don't match exactly my board's wiring configuration.  Finally, it's a very difficult task and effort to do the replacement and I don't even know if that will fix my unit or not!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DiabloDayv",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T15:36:00.000Z",
          "Titre": "I rolled the dice again",
          "Contenu": "I would say they did ok.Bought a mini fridge less than 3 years ago.  It actually sat in its box for a year.  Worked great for a year and started making noises over the last year.For its price it didn’t last long.  They did give me a 40% discount on a replacement which really didn’t save me a whole lot.  Pretty much paid what I paid for the first one again.Hopefully this lasts more than just under 2 years!  If not then at least I have the extended warranty to help cover some losses this time.  Hopefully  the old wine fridge keeps hanging in there.Kevin from customer service left me a note to contact him.  Not exactly sure why as he literally did nothing at all."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Catalina Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T22:51:54.000Z",
          "Titre": "Replacement parts",
          "Contenu": "When I connected with a rep over chat, Charles Trapp, he was able to help me purchase replacement parts for my ac unit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christine Hill",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T13:30:31.000Z",
          "Titre": "Be ready for a thousand pictures and…",
          "Contenu": "Be ready for a thousand pictures and video being needed for the warranty process. Took a couple weeks but finally a replacement is on the way. The first one lasted 2 months"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Office Clerk",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T18:53:35.000Z",
          "Titre": "Purchased two of these",
          "Contenu": "Purchased two of these. One worked perfectly fine. We haven't been able to use the other product. It was defective. This review serves as payment for shipping. Enjoy!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chadwick McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-02-19T17:13:39.000Z",
          "Titre": "Must leave reviews before processing warranty claims",
          "Contenu": "Customer service asked me to leave reviews before they would process my warranty claim. A little annoying to have to do that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katy",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T21:01:03.000Z",
          "Titre": "Back wall is freezing and seal is…",
          "Contenu": "Back wall is freezing and seal is pulling away from the door. Customer service is quick to help. Unfortunately the replacement came damaged. We are in process of another return. Hopefully the next will be as good as customer service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T06:20:45.000Z",
          "Titre": "I had to order an ice cube bowl or tray..",
          "Contenu": "I received the part that I think should Have been warranted.. I put it in and it seems fine... The machine was only a little over a year old.. The app that I was told to get to track... I would probably not purchase your brand again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amiee Gerdts",
          "Nb_Reviews": 1,
          "Date": "2022-11-14T02:25:17.000Z",
          "Titre": "Great when it’s working, impressed with customer service.",
          "Contenu": "I loved our ice maker. It has been great to have in our home. My only issue has been I purchased my unit in June, and by October is was leaking and had corrosion on the sides. Thankfully, their customer service has been outstanding and they are sending a new one out to replace."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T19:56:49.000Z",
          "Titre": "Took over a week for someone to get…",
          "Contenu": "Took over a week for someone to get back to me after spent 20 min online trying to get a part ordered."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DARIN MIELKE",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T14:20:30.000Z",
          "Titre": "Renuw",
          "Contenu": "I appreciate the fact that we are able to get a new ice machine"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andy Ondrejech",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T10:35:12.000Z",
          "Titre": "High Quality Service, Low Quality Product",
          "Contenu": "There's no doubt that NewAir's customer service is helpful and responsive, almost aggressively so, which is fantastic! I've discussed that you're sure to receive good customer service when shopping under the NewAir umbrella.That being said, the longevity and build quality of their ice makers (in my case the now discontinued Luma Comfort 28) leaves a lot to be desired. I was perfectly happy with mine for about 5 months before the cubes started freezing into one big unbreakable chunk (I believe the problem is a broken sensor that handles the transition from ice creation to dispensing, as I can still do it manually). I was hoping to have it repaired but could not find an appliance shop that would have me and was only offered a replacement by NewAir after trashing mine (for $30 due to its refrigerant) and leaving a few reviews.You would think that posting nearly double the price of a comparibly sized competitors product would ensure a more resilient appliance, but instead you're paying for the year long warranty and speedy, relatively painless customer service as evidenced by the other 300+ NewAir Google reviews regarding their ice makers at the time of writing.I'd hate to create this much waste and hassle for such a minor problem, and maybe that's just the throw away world we live in, but doesn't change that it's abhorrent, especially when you expect a quality product and not just quality service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dwight Daniels II",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T11:56:40.000Z",
          "Titre": "While the service was great",
          "Contenu": "While the service was great, the part in question should be available more readily"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tracy Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T19:52:48.000Z",
          "Titre": "Good when worked",
          "Contenu": "Good when worked. Waiting for replacement."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christi Born",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T17:32:21.000Z",
          "Titre": "Found out the item I ordered was the wrong item and the part I needed wasn't listed in the owner's manual",
          "Contenu": "Found out the item I ordered was the incorrect order, but the part I needed wasn't listed in the owner's manual under parts list.  Nothing was stated by customer service rep about this other item or I would have ordered both parts due to cost was inexpensive for the part and would offset shipping costs because the part I really need is the one \"not\" listed on the parts list.  Need all parts listed in the owner's manual."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Feathersand Flocks",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T22:10:56.000Z",
          "Titre": "I did an Instagram collaboration with…",
          "Contenu": "Faulty wine refrigerator.I received a New Air wine refrigerator and was sent a lemon. It worked for a month and then started to heat up. Eventually dying. Lucy from customer service sent out a new refrigerator right away and this one works great. Thank you Lucy!Other than that, it’s a very nice looking wine fridge and holds a lot wines with its dual zones.Cheers"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Josh Van Lente",
          "Nb_Reviews": 2,
          "Date": "2022-07-06T01:42:04.000Z",
          "Titre": "Great product with some reliability issue but support makes up for it",
          "Contenu": "I purchased a 28-bottle dual zone wine fridge 15 months ago, up until a week ago it was great (quiet, consistent, and looks nice).   A week ago it stopped working but customer service was quick to diagnose the issue (temperature sensor broke) and has offered to send a replacement and instructions to handle it myself.   Assuming this resolves my issue I'd be pleased and give them 4 stars."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kimberly Murans",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T05:35:43.000Z",
          "Titre": "Customer service is better than the actual product.",
          "Contenu": "It's a good product, when it works that is. Went through 3 of them in just little over 2 years."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lena A Hill",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T20:28:31.000Z",
          "Titre": "I purchased two units and after only a…",
          "Contenu": "I purchased two units and after only a few days the pump went out on one of them. I can’t say they are garbage because the other unit works perfectly fine for a small space. However, if you do happen to have an issue, customer service is spectacularl"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laurel O'Daniel",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T23:19:51.000Z",
          "Titre": "It was a frustrating experience",
          "Contenu": "It was a frustrating experience. My mom requested a new heater due to the current one being burnt out after not being used much and was only about a year old. I helped her send the pictures and emails to get the replacement ordered. We sent the documentation and pictures by email  3 times before the order was finally placed and then the order was put in my name and not my moms 🙄😩 I don’t live with my mom and we gave her info over and over. If the order doesn’t get to her correctly neither of us will be very happy. There were too many people handling a simple return. It has been like pulling teeth trying to get the right information relayed in the correct format. Everyone was polite but just not very efficient with explaining what information was needed.Update - The new heater has been received. It was in my name not my moms per our many requests. No idea why it was put in my name as I wasn’t the one making the request but I was the one trying to help my mom get this taken care of. The time to fix these issues was when we were asked to send the same info and pictures over and over. Talking to Alai isn’t going to change the lack of consistency in getting the info in one place. We appreciate the being sent quickly but my mom still needs to get the heater off of her wall and get the return label so she can send it back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T03:25:22.000Z",
          "Titre": "Good customer service on first phone call.....poor on every other interaction",
          "Contenu": "Purchased a split level wine cooler about 5 years ago. Unit failed recently leaving my wine sat at 73 degree for a number of months.  Called up to discuss with Newair and while out of warranty was offered a replacement part (not a whole wine cooler) at no cost.  It was nice to be able to reach a human being within a few moments.  Now what would be really great is A) if the unit hadn't failed in the first place and B) they contributed to replacing the 40 or so bottles of wine i had in there.Here is a follow up on 13th July.  To date i have not received the part, i have not received a response to my email and they are not answering their phones."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ed Samec",
          "Nb_Reviews": 3,
          "Date": "2022-10-01T11:28:02.000Z",
          "Titre": "The unit performed great for about 3…",
          "Contenu": "The unit performed great for about 3 three weeks and then has done very little as far as producing any ice at all"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T02:22:45.000Z",
          "Titre": "Very helpful service rep",
          "Contenu": "The service rep has been really good. Waited an age for a replacement part for a defect. It never came and Newair are giving me a new appliance. Will write another review when it arrives undamaged!Maybe 5 stars for the eventual customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Corinna",
          "Nb_Reviews": 1,
          "Date": "2018-07-07T11:44:40.000Z",
          "Titre": "Purchased an Avalon Bay air fryer",
          "Contenu": "Purchased an Avalon Bay air fryer - September 2017.  My kids are especially in love with the way it cooks French Fries!   After it recently failed I contacted customer service to inquire about my options.... my email was promptly answered by Straton and he provided instructions as to how to obtain a replacement air fryer. Although disappointed that the Air Fryer didn't last very long... I am very pleased with the customer service from Newair.I am hopeful that the replacement Air Fryer lasts longer than 9 months.  3 stars because it stopped working after only 9 months but excellent Customer service since they are going to replace it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T03:14:16.000Z",
          "Titre": "The ice maker worked right up to the…",
          "Contenu": "The ice maker worked right up to the time it stopped making ice. The rep was helpful in working to get the unit replaced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yesenia Morales",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T00:30:43.000Z",
          "Titre": "My first call wasn't processed…",
          "Contenu": "My first call wasn't processed correctly. Fortunately, they reps that helped me on the second call were able help get the issue resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karl Liggin",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T05:04:42.000Z",
          "Titre": "Just a bit of confusion but I am happy…",
          "Contenu": "Just a bit of confusion but I am happy with the results."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "James Joseph McLean",
          "Nb_Reviews": 1,
          "Date": "2019-09-24T14:14:26.000Z",
          "Titre": "My previous new air Stainless steal ice…",
          "Contenu": "My previous new air Stainless steal ice maker broke in under a week.. I was shipped and incorrect one and charged 100 dollars.The Agent Mellissa hopefully fixed this problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John DeVeaux",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:43:43.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. I dropped a star because I had to use customer service. We bought a nugget ice maker through Best Buy, and 10 months in it stopped making ice. We tried to call in and get a call back with no luck. Finally, I chatted with Charles online, and he got us a replacement unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adam Billings",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:45:55.000Z",
          "Titre": "Top Notch Support",
          "Contenu": "3 stars for the equipment busting after a year of owning it. But 4 stars because support was extremely helpful in diagnosing and getting me the part ASAP."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Brillant",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:53:47.000Z",
          "Titre": "Quick delivery",
          "Contenu": "Quick delivery.  Product good so far.  We’ll see how long it lasts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M Hall",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T20:07:38.000Z",
          "Titre": "Getting old",
          "Contenu": "Old and embarrassed!  Realized after I submitted review that the blue tint was the protective film. Can’t believe I did not see it earlier!  Now making ice as expected with stainless steel finish machine!  Enjoy a laugh on me!  ordered the stainless steel color with model # AI-100SS from Lowe’s and NewAir. Both times the model received was a heavily blue tinted stainless with black top.  What i received is not even an option so there is clearly a problem with this particular model.  Buyer beware: The picture and the unit received are not the same."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T17:55:10.000Z",
          "Titre": "We love our refrigerator/freezer",
          "Contenu": "We love our refrigerator/freezer! It's kind of a trick to get the programming down, but then, it works fabulously!  We bought a second because the price was so great, and now we have our food storage, and a drinks storage, complete with fresh ice! It seems that shipping was very difficult, as the tracking said, \"out for delivery,\" and \"failed to deliver\" for 3 days, before it actually arrived..not sure why.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thanh Le",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:44:46.000Z",
          "Titre": "Slow support",
          "Contenu": "Ordering was easy and shipping was fast. After sale support doesn't seem to exist if you encounter any issues. 10/31/2023 Edit: After my review, newair support reached out and resolved the issue. Would be 5 stars if a support ticket can be opened in the normal expected method vs responding via review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DS",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T02:58:53.000Z",
          "Titre": "Helpful Customer Service",
          "Contenu": "I had an issue with a dual wine fridge I received as a gift, where water was pooling in the top tray of the fridge.  I reached out to customer support and worked with Charles over the past few days to troubleshoot the issue.  Unfortunately, the issue wasn’t able to be fixed and Charles was very helpful in processing a warranty replacement of the unit in a short time frame."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theresa",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:30:20.000Z",
          "Titre": "My ice maker unit stopped functioning…",
          "Contenu": "My ice maker unit stopped functioning properly after 8 months of use. However, Charles with Newair was very helpful in replacing my unit (I had to pay shipping though). Customer service was excellent, the product not so much. Hopefully the second unit will last longer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Latina",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T20:20:44.000Z",
          "Titre": "Customer Service",
          "Contenu": "We received a couple defective products that had to be replaced. Due to some miscommunication it caused some frustration but Charles helped smooth over the situation and got a new replacement sent out quickly. Thank you Charles"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicky",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T23:13:52.000Z",
          "Titre": "Hilary was very responsive and helpful…",
          "Contenu": "Hilary was very responsive and helpful with each return.  She was always willing to assist with shipping a replacement unit. I am currently on my fourth unit - trying to get one that will operate in the heat mode.  The Model that does not heat is NAC14KWHD3.  (I tried three units.)  The 4th unit that heats to around 65 degrees is Model NAC14KWHH2.  I will keep this unit, although I wish it would heat higher than 65 degrees."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Becky Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T04:38:37.000Z",
          "Titre": "Caring Customer Service at Newair",
          "Contenu": "It was nice to work with a customer service representative that was caring and responsive.  Vanessa asked appropriate questions and responded in a timely manner to resolve the matter for me.  When my product from Newair stopped working completely, I was assured that my unit would be replaced based on the information gathered during the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N.W. Campbell CampbellChronica",
          "Nb_Reviews": 1,
          "Date": "2023-01-14T17:06:33.000Z",
          "Titre": "Top Notch Customer Service to a Frustrating Product Issue",
          "Contenu": "My expectations were low in contacting Newair directly regarding the issue with my tabletop icemaker.  I was blown away with the prompt addressing of the issue that I was having.  It was refreshing to know that the person on the other end cared. Customer service is everything sometimes and Newair does a phenominal job at providing this.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Suzanne Clarridge",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T21:49:22.000Z",
          "Titre": "Thanks to Charles for answering the…",
          "Contenu": "Thanks to Charles for answering the chat promptly when the phone number went to voice mail. Would have rated the experience higher if I could have placed the order on the website rather than having to call, then chat, then wait for a call back to place the order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yezenia Burgos",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T04:08:38.000Z",
          "Titre": "Happy with our NewAir…",
          "Contenu": "Have been very happy with our NewAir ice maker machine. Unfortunately, it started having some issues. I reached out to NewAir to report the issue. After a few questions about the matter of my order they have offered to replace the defective unit no additional cost. The experience has not been complicated + the representative has been very responsive, professional, and kind. The customer experience has been great. It’s good to know there are still companies providing good service. I highly recommend this product + it’s company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tommi Roehling",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:32:36.000Z",
          "Titre": "Purchased a nugget ice maker that…",
          "Contenu": "Purchased a nugget ice maker that started leaking less than a year after we bought it. I contacted customer service (spoke with Charles) and without hesitation he offered me a refund for my machine. Great customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TL",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T12:46:11.000Z",
          "Titre": "Makes Ice Fast",
          "Contenu": "This ice maker starts to make ice quickly, and will fill the bin in about 6 hours.  After that, the machine continues to keep up with us as we use the ice throughout the afternoon.  Note that it's important to clean the machine once a week, even if you're using filtered water."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lindsey",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T22:24:54.000Z",
          "Titre": "Ice Maker Replacement",
          "Contenu": "The Newair team was responsive and helpful when it came to replacing my ice maker. I only gave 4/5 stars because I had to pay for the shipping of the new ice maker. I believe it should’ve been free since it isn’t my fault that the ice maker stopped working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T21:10:36.000Z",
          "Titre": "Straightforward, and Nice representatives.",
          "Contenu": "Relatively straightforward to get a broken item replaced - even though the original was out of stock, they replaced it with a comparable item which was more expensive. Four stars instead of five because ideally it would not have broken in the first place, and it took a few steps of emailing back and forth throughout the process.The representative I spoke with was very nice, clear and concise about the steps involved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sam Saetern",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T18:46:06.000Z",
          "Titre": "Great transition to checkout, but website it a little faulty.",
          "Contenu": "With the great sale prices and the smooth transaction to checkout, I can't complain much. However, the site is a little faulty when I try to search for specific products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pawsitively Blessed - Luvin' M",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T15:43:38.000Z",
          "Titre": "I am leaving this because I was asked…",
          "Contenu": "I am leaving this because I was asked to in order to receive free shipping of a new unit back to me to replace a broken one. Hoping that I get it. So far the service has been quick by customer service and I feel confident."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HAN",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T08:59:50.000Z",
          "Titre": "Awesome customer service.",
          "Contenu": "Overall great customer service, however it was a bit frustrating going back and forward for 1 week until I got a resolution. Special thanks to Charles who went above and beyond providing a solution to my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T23:46:01.000Z",
          "Titre": "30 lb countertop Nugget Ice. Great product but failed early on.  Customer service very good.",
          "Contenu": "I have a 30 lb countertop Nugget Ice Maker.  My family really enjoyed the quality of the crunchy nugget ice it made for several weeks after purchase.  Unfortunately it experienced mechanical problems within a month of usage.  Great product while it worked.  Customer service was very good and professional.  Unit is being replaced under warranty.  Look forward to getting the new unit and hoping that this was a one off quality problem.  Great otherwise."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Kacer",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T23:56:52.000Z",
          "Titre": "Box was banged up during shipping",
          "Contenu": "Box was banged up during shipping. Product could have been more secure. We will see how it operates during first cleaning cycle and making ice after that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "teddy theb",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T18:37:03.000Z",
          "Titre": "Good as their word",
          "Contenu": "Good as their word. Pump broke after just seven months (which is why I'm knocking a star off) but their customer service was great. Replaced the unit within in a week with no hassles or pushback and the rep (Camilla) was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BARBARA WALTERS",
          "Nb_Reviews": 4,
          "Date": "2023-03-05T01:42:48.000Z",
          "Titre": "Great Customer service",
          "Contenu": "I recently had problems with my nugget ice machine. Customer Service was excellent.  Speedy resolve to my issue. Couldnt be more pleased. I highly recommend this company to anyone looking for a ice machine. Happy happy camper"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tina Fearneyhough",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T05:54:33.000Z",
          "Titre": "Quit working but getting a replacement",
          "Contenu": "We loved our nugget ice maker and were really disappointed that it stopped working after only a year. Their customer service has been very responsive and they will be sending us a replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juliet McDaniel",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T00:43:17.000Z",
          "Titre": "Solid customer service",
          "Contenu": "The product broke after only two month's use, which was disappointing. But the customer service provided by NewAir and specifically their rep, Fern, was excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Russell",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T00:23:44.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "Awesome customer service! My nugget ice maker started leaking in less than a year and Newair will be replacing it. Only reason for 4 stars is because the leak developed in less than a year. Other than that, it was an awesome ice maker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "vanissa bertumen",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T02:37:03.000Z",
          "Titre": "Amazing customer service!",
          "Contenu": "Unfortunately, we had to get a replacement unit but the customer service helped us troubleshoot it and made the process as easy as possible for us! One of the easiest customer services I’ve ever dealt with!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "N. Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T21:22:06.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, although it would be more helpful if Newair also either provided repair service or had a list of trusted repair services."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T04:03:30.000Z",
          "Titre": "Stopped working",
          "Contenu": "Ice machine stopped working after only 2 months of use. New air customer support was very helpful and polite when dealing with my issue. Got a replacement at no cost!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Guillaume Fortin",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T22:37:51.000Z",
          "Titre": "Helpful Support, Good unit",
          "Contenu": "After about 1.5 year of using, the temperature sensor stopped working unfortunately. The support was helpful in resolving this issue for me in a reasonable delay. Otherwise the fridge works great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Presley",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T02:07:28.000Z",
          "Titre": "add an issue with my icemaker contacted…",
          "Contenu": "add an issue with my icemaker contacted customer service after one or two emails. I have a greed to send me a new replacement unit very helpful."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Eric Petit",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T13:10:11.000Z",
          "Titre": "It's good that there was a guarantee on…",
          "Contenu": "It's good that there was a guarantee on the air conditioner. I bought it a month ago and it didn't always turn on. I gave air conditioner. to the store and they changed it to a new one, because mine was of poor quality."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Renee Waterstradt",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T01:18:40.000Z",
          "Titre": "Quick Response for Warranty Issue",
          "Contenu": "Quick Response for Warranty IssueWhile the icemaker we purchased did break (would not make ice), working with customer service was relatively easy to get a replacement unit shipped to us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Precious Spencer",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T02:31:38.000Z",
          "Titre": "This is my first time purchasing a new…",
          "Contenu": "This is my first time purchasing a new air product and so far I was impressed. I did have a snafu where it was not working as it should. I was able to contact customer service and they were able to help me right away so this was a very good experience I thank them  for that."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rudy Leon",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T23:01:34.000Z",
          "Titre": "Shattered glass door replacement",
          "Contenu": "The company approved the replacement of the shattered glass door even though it was already out of warranty. But I will have to pay for the shipment if the new door."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Clawson",
          "Nb_Reviews": 3,
          "Date": "2023-02-15T00:55:55.000Z",
          "Titre": "Ash was very helpful and was quick to…",
          "Contenu": "Ash was very helpful and was quick to resolve the problem. And promises to get me a new heater and ship it after the quality check has been done before shipping. This will be very helpful since I hang this on the wall and I have to bad shoulders."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Dalton",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T19:04:24.000Z",
          "Titre": "Wanting to buy from NewAir because of…product, reviews, customer service!",
          "Contenu": "Wanting to buy from NewAir because of what I had heard about product and what they offered was what I was looking for in out newly remodeled kitchen.I had been on NewAir's website, chatting with other reps, but getting \"No\" where and feeling like getting the run around (via chat / website closing)- so I called NewAir and left a message.  The person that call back was Laurellee. She was the deal breaker through this process, she answered all my question, had exceptional customer serviceand took care of any issues I had prior to talking with her! So, Thank you for your service and communication skills Laurellee.  Has soon as I put the Wine Fridge AWR-460DB, I'll send pictures.Note: I had also was chatting with Melissa Wagner and would like to Thank her has well with the discount given, for prior computer glitches on ordering."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tripp",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T00:29:57.000Z",
          "Titre": "Charles did a good job helping with my…",
          "Contenu": "Charles did a good job helping with my warranty claim.  I hope the replacement product works better than the first but I am willing to give it a try."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Court",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T16:00:53.000Z",
          "Titre": "Our Newair ice maker stopped working…",
          "Contenu": "Our Newair ice maker stopped working after nearly a year, and their support department handled a warranty replacement for us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KC",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T00:06:29.000Z",
          "Titre": "Nothing compares to nugget ice",
          "Contenu": "Nothing compares to nugget ice. Newair nugget ice machine NIMO30SS00 has been a great addition to our kitchen. We love having a seemingly endless supply of crunchy ice, It's been easy to fill and clean. After a few months, we started to notice a puddle underneath the unit. We've notified Newair and they have been very helpful with sending a replacement unit after we provided our receipt and purchase date."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T22:56:48.000Z",
          "Titre": "Fast and helpful customer service",
          "Contenu": "Fast and helpful customer service. My ice maker had a issue and they are sending me a replacement unit."
        },
        {
          "Note": 4,
          "Lieu": "PA",
          "Pseudo": "Jacobus Gideon de la Rey Gideo",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T16:02:15.000Z",
          "Titre": "After many attempts and phone calls I…",
          "Contenu": "After many attempts and phone calls I was help. Please look at employing more sales reps to answer calls as this will increase sales."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Monica Jones",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T19:59:38.000Z",
          "Titre": "Restock of Backordered Parr",
          "Contenu": "Finally was given a date for restock of a backordered part. Hoping to actually receive it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "La-Tia Harris",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T19:09:38.000Z",
          "Titre": "Countertop ice maker",
          "Contenu": "Received help with issuing a warranty claim on my counter ice maker - the fan went out and the turn around time for a response was quicker than I thought, same day actually. Which was exciting for someone like me who loves my ice maker!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rande Mindick",
          "Nb_Reviews": 5,
          "Date": "2023-10-04T20:53:24.000Z",
          "Titre": "it showed up when scheduled.",
          "Contenu": "it showed up when scheduled.. it started up when plugged in.. except for a small dent in the side....all was perfect"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary DeVeau",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T04:19:03.000Z",
          "Titre": "Camilla was very helpful in assisting…",
          "Contenu": "Camilla was very helpful in assisting to provide appropriate information in order for me to get a replacement unit. My anticipated delivery date is this week and I hope it will come undamaged."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn Smith",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T20:46:38.000Z",
          "Titre": "Newair customer service",
          "Contenu": "Customer service was very helpful with warranty issue with my ice maker. Ice maker was working wonderfully but experienced a issue and Newair covered replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dale Hartzell",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T17:35:05.000Z",
          "Titre": "Sent Customer Service an email about a missing part",
          "Contenu": "Sent Customer Service an email about a missing part.  Had to follow up after a week but they are sending the part."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chad Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T22:49:43.000Z",
          "Titre": "Newair and newair CS was great to…",
          "Contenu": "Newair and newair CS was great to replace new ice maker that did not work out of box."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rohan Kinhikar",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T23:15:31.000Z",
          "Titre": "I was on the customer support chat and…",
          "Contenu": "I was on the customer support chat and Charles was extremely helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Florida bound",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T20:24:19.000Z",
          "Titre": "Called in for assistance with a temperature sensor",
          "Contenu": "Called in for assistance with a temperature sensor - Charles, the service rep, was patient, knowledgeable and helpful!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haley Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T19:58:24.000Z",
          "Titre": "Machine was great when it worked",
          "Contenu": "Machine was great when it worked. It suddenly stopped making ice and a loud noise. Customer service is supposed to send a replacement. Hopefully it will last longer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Corliss Cummings",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T20:16:59.000Z",
          "Titre": "My unit gives me the convenience of ice at the ready",
          "Contenu": "My unit gives me the convenience of having ice ready on hand as I am injured and can't go out for ice as usual. I can't drink anything refrigerator cold because I need it ice cold. I also love chewing ice when I'm sitting around watching television. Overall it's a good machine except the water tray cracked due constant use I guess."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FJ",
          "Nb_Reviews": 2,
          "Date": "2022-10-23T15:58:38.000Z",
          "Titre": "Great customer service",
          "Contenu": "Initial unit was defective, but the customer support was excellent and Rebecca did a great job of providing a replacement unit quickly.  The no-hassle return and customer service was why I rated 4 stars along with the price point of the unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beth Austin",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T22:35:49.000Z",
          "Titre": "The company is doing very good at…",
          "Contenu": "The company is doing very good at taking care of the problem iam having with my ice maker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Nocera",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T18:21:14.000Z",
          "Titre": "Fern was helpful",
          "Contenu": "Fern was helpful and got my issue resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Branden",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T05:45:48.000Z",
          "Titre": "Communication great but getting parts not.",
          "Contenu": "The employee of the company was very helpful and great in communication. The 4 stars are for her for the service she provided. She did her absolute best to help me but the company however has failed me. Companies need more employees like this one, because even though the company couldn’t provide me with the correct parts, she still did her absolute best to keep a customer happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "B Vigil",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T00:28:47.000Z",
          "Titre": "Very easy to set up and use",
          "Contenu": "Very easy to set up and use. Cleaning the unit is very easy as well. Sleek design fits into any kitchen design."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terry Key",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T05:23:33.000Z",
          "Titre": "Customer service",
          "Contenu": "Machine did quit working, but customer service did work with me to send replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 2,
          "Date": "2022-12-19T06:46:54.000Z",
          "Titre": "I enjoyed the ability to communicate…",
          "Contenu": "I enjoyed the ability to communicate and come to a resolution for the issue I have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephon Brown",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T04:23:54.000Z",
          "Titre": "Customer Service is Helpful",
          "Contenu": "Customer service was very helpful with replacing the broken unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Neysa Wells",
          "Nb_Reviews": 2,
          "Date": "2022-12-25T21:16:43.000Z",
          "Titre": "I purchased the nugget ice maker in July and it went out in November and I contacted Newair on December 15 and they agreed to replace it and waive the shipping fee I am pleased with the experience.",
          "Contenu": "I purchased the nugget ice maker in July and my machine stopped working in Nova"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JM Woodmansee",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T23:48:45.000Z",
          "Titre": "Newair stands behind their products - excellent customer support",
          "Contenu": "Customer Service has been fast and efficient replacing my unit under warranty."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Lucas",
          "Nb_Reviews": 2,
          "Date": "2022-09-28T16:27:29.000Z",
          "Titre": "Replacement part issue.",
          "Contenu": "Glad that the defective part is being replaced, but since it is still new the tiny part should be overnighted, so I don't have to wait a week and a half for the part. Great product so far, drain plug design could be improved."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Quinn",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T05:26:34.000Z",
          "Titre": "The customer support agent was very…",
          "Contenu": "The customer support agent was very helpful and was able to help me work things out. The reason I gave 4 stars was because the company didn't offer different levels of shipping and I live in Canada and it would have cost me double the value of the product for shipping. This made me feel alienated as a customer simply because I live in a different country. This was not the customer support agents fault, it was the company's fault."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Ford",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:39:29.000Z",
          "Titre": "Order experience Had to wait longer than I wanted on the…",
          "Contenu": "Had to wait longer than I wanted on the phone, but everything else was fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chuck",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T17:49:27.000Z",
          "Titre": "The Newair portable evaporative cooler…",
          "Contenu": "The Newair portable evaporative cooler fan  NEC500WH00 is a good product with a known water pump problem. The fan works really well, and when I manually wet the filter it worked well for cooling.I contacted customer service and was impressed with how the return (no cost to me) and replacement of the unit was handled by the represenative (RG). The new unit is on the way and I look forward to the replacement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Guillermo Marquez",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T02:54:45.000Z",
          "Titre": "Great product and the company customer…",
          "Contenu": "Great product and the company customer service department is very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen Good",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T00:12:49.000Z",
          "Titre": "Would like to have had a manual included"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Misti Roe",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T03:26:06.000Z",
          "Titre": "48 qt cooler…",
          "Contenu": "I purchased the 48 qt cooler to use on my semi. It came with both a 12volt and regular outlet plug. It has been a lifesaver. I have the smaller section setvs the freezer and the larger section set to fridge temp. Customer service is responsive. I wonder though why it is black. Most coolers are light to reflect the heat."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heather Grace",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T01:46:43.000Z",
          "Titre": "I broke my drawer",
          "Contenu": "I broke my drawer and wrote in wanting to buy a replacement. Got an immediate response asking me again what issue was. I responded to that email and didn’t hear for a few days. Then once I received a response back again they told me it was being replaced. I got another email saying it was on back order and I needed to respond and let them know if I wanted it still even if it was on back order so they could put the order in. After that I received and email that the order was placed and I would receive it in the mail as soon as it was back in stock and to do the survey please. I thought that was it. Then I received an email that I needed to respond to my ticket number within 48 hours or the order it would be canceled. I’m terribly confused."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Allston",
          "Nb_Reviews": 3,
          "Date": "2022-07-14T21:41:12.000Z",
          "Titre": "Our wine cooler has been great",
          "Contenu": "Our wine cooler has been great. Went to a larger size to accommodate the varieties of wine we enjoy. After six months we had an issue with the temperature not holding. We contacted Sandra at NewAir customer service. It was determined the temperature sensor was faulty. NewAir opted to replace our unit under warranty. Hopefully we’ll be back in business soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T22:45:38.000Z",
          "Titre": "customer assistance",
          "Contenu": "The customer assistance representative was very helpful, friendly, and easy to work with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicki Colter",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T19:06:45.000Z",
          "Titre": "I ordered the AI-215SS NewAir AI-215SS…",
          "Contenu": "I ordered the AI-215SS NewAir AI-215SS Stainless Steel Portable Ice Maker.  I really loved this icemaker as it makes ice fast and really supplies the need for me.  But I recently had an issue and it broke down.  I called and spoke with customer service and they handled the situation to my liking and are sending a new one to compensate for the broken on. Thank you for all of your assistance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Griffith",
          "Nb_Reviews": 2,
          "Date": "2022-08-05T16:20:05.000Z",
          "Titre": "Great customer service!",
          "Contenu": "I have a thermoelectric wine fridge that stopped working. WIth a great assistance from Newair customer support, I was able to identify the issue, order a replacement part, and find a reasonable solution so I didn't have to trash an otherwise great wine fridge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tamara Maine",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T02:59:12.000Z",
          "Titre": "Our wine cooler stopped functioning",
          "Contenu": "Our wine cooler stopped functioning. Apparently the compressor failed.  The unit was still under warranty.  We contacted the company and they where responsive to our email. They asked us to attempt to reset the temperature but there was no response from the unit. We are awaiting a replacement unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynda Zetnick",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T22:26:15.000Z",
          "Titre": "Newair Misting Fan",
          "Contenu": "I bought a Newair misting fan that I actually use to keep my chickens cooled down a bit in the extreme heat here in Texas in the summer.  the misting hose assembly sprang a leak and I tried to order a replacement part but ordered the wrong part and it didn't fit.  I contacted customer service about getting the right part and they have been helpful in helping me get my fan back up and running. The fan itself is well built and handles the outside elements well, but they don't have the misting hose assembly as a replacement part so instead they are sending me a replacement fan."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Reed",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T18:57:26.000Z",
          "Titre": "Helpful customer service",
          "Contenu": "Ordered two units, one of which did not work when received. Customer service has been helpful, first by sending a part to replace, then when that didn’t work by sending a replacement unit. The fridges themselves look great and my experience with customer service has so far been very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ramon Villongco",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T21:30:50.000Z",
          "Titre": "Great Ice Maker, Reliable Company",
          "Contenu": "This is my first Newair AI-100S Ice Maker and works like a charm. I have been using it everyday and gives me ice every few minutes and how quickly it makes ice. Although it lasted only 9 months, I called Newair told them the problem and they immediately will replace the unit with no hassle.  That's what you call an AMAZING CUSTOMER SERVICE and reliable company that you can depend on.  Love this machine and works excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Cirillo",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T00:53:38.000Z",
          "Titre": "I lost the plug on my ice maker and…",
          "Contenu": "I lost the plug on my ice maker and called the company to see if I could get a replacement. I spoke still a representative named Lucy who was very patient and kind to me.  I’m 80 yrs old and not very good with computers    But she let me take my time and did not lose her patience with me.  She also found the part I need and I will have it next week. Very pleased with the whole experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Chapotel",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T08:28:26.000Z",
          "Titre": "Ice Maker Kaput",
          "Contenu": "Fern was very helpful and smart and took care of everything I needed"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Kieger",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T21:23:41.000Z",
          "Titre": "Replaced NewAir Unit",
          "Contenu": "I had purchased a NewAir beverage cooler from a HomeDepot because of the awesome look and large holding capacity. Before a year was up the fridge stopped working. The customer service team at NewAir was very prompt in responding to my issue. The agreed to replace the unit with proof of purchase. They stand behind their products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle V",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T17:43:32.000Z",
          "Titre": "Satisfied Cusomer",
          "Contenu": "We purchased our ice maker in Dec 2021 but haven't had to use it much until summertime (June 2022).  On our 2nd batch of ice, it had a mechanical issue so we contacted customer service for troubleshooting.  Unfortunately, our machine couldn't just be fixed, it has to be replaced.  We are very pleased with the way it has been handled, the customer service dept has been very helpful, they are informative & response time is incredible.  I would definitely recommend this ice machine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T02:52:27.000Z",
          "Titre": "Everything has been great until I…",
          "Contenu": "Everything has been great until I received an email saying that they needed a response to something from a prior email. There was never a request for a new action. Just an order reference number and installation instructions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T17:50:14.000Z",
          "Titre": "Very friendly customer service technical support agents.",
          "Contenu": "This is my second time dealing with NewAir.  The first time they only sent me one thermistor (temperature probe) even though my refrigerator model has dual climate zones and requires two temperature sensors.  At least they owned up to their oversight and I'm receiving the second sensor at no additional cost.  We'll see if this solves the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Samuel Blocker",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T15:49:59.000Z",
          "Titre": "Thank you for returning my ice machine…",
          "Contenu": "Thank you for returning my ice machine I’m gonna be returning the old one this weekend I just looked it up hopefully this one works better than the other one thank you again for responding so quickly we had a couple of hurdles to overcome but thank you anyway and think Miss Mendez for doing such a good job"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Gerbing",
          "Nb_Reviews": 2,
          "Date": "2022-07-27T18:09:21.000Z",
          "Titre": "Customer service",
          "Contenu": "The unit arrived with a damaged leg. Customer service sent a new leg, almost immediately. After 4 mo. it no longer cooled. Sandra in C.S. was very helpful & eventually, they are sending a new unit. Rated 4 *\"s because of the faulty unit."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin Miller",
          "Nb_Reviews": 1,
          "Date": "2022-05-11T18:47:54.000Z",
          "Titre": "Awesome Machine, good service",
          "Contenu": "I purchased this icemaker for a Christmas present, And it performed really well for about a week. It took up very little space on our kitchen counter, and made good clear ice in a surprisingly short amount of time. After about a weeks time it developed a water leak from inside, so I contacted new air to have it replaced. They were very good about this, and easy to return the old faulty machine and receive a new one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T16:15:00.000Z",
          "Titre": "When my Dual Zone Wine and Beverage…review",
          "Contenu": "When my Dual Zone Wine and Beverage fridge arrived it had an odor in it.  I cleaned it several times with the recommendation I received from the company. It did not take care of the odor and all of the beverages (which was a lot) in the fridge had to be thrown because the odor was so bad. I contacted customer support several times and they have been very helpful and will get the issue resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Carroll",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T16:52:16.000Z",
          "Titre": "Random temp fluctuation",
          "Contenu": "The left side of my two zone cooler was performing erratically... temp was randomly varying from 36F to 48F.The customer service agent helped troubleshoot the problem in a timely and competent manner.They are sending me out a replacement temp sensor."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Shuler",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T00:18:30.000Z",
          "Titre": "Quick response",
          "Contenu": "We received a quick response from customer service to replace our newair ice maker due to a faulty water pump and appreciate the diagnosis online."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walt Frank",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T21:00:08.000Z",
          "Titre": "Quick response (with instructions on…",
          "Contenu": "Quick response (with instructions on how to identify the problematic part) to my email request for assistance in figuring out why my wine fridge quit working. Based on the results of following their instructions, I contacted NewAIr and advised their curteous representative what was indicated for replacement. The representative quickly placed an order for the correct part (cooling kit) and arranged to have it shipped to me.  Assuming everything goes according to plan, the fridge should be running again as soon as I get the part."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jillian Fitzgerald",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T16:32:18.000Z",
          "Titre": "ice machine",
          "Contenu": "Important piece of our new ice machine broke, however customer support has been extremely helpful and responded to my questions in a timely manner. 4/5 stars because I'm writing this before the replacement has been delivered. I was given this opportunity to write a review for free delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "..",
          "Nb_Reviews": 3,
          "Date": "2022-10-19T17:04:09.000Z",
          "Titre": "Newair is replacing our ice machine…",
          "Contenu": "Newair is replacing our ice machine that broke within the first two months. Hoping this new machine lasts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AAJ",
          "Nb_Reviews": 2,
          "Date": "2022-08-08T05:07:22.000Z",
          "Titre": "We have loved our ice maker...",
          "Contenu": "We have loved our ice maker and were totally bummed when it quit working recently.  Costumer service was super helpful in helping us troubleshoot the issue and replace the parts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gillian",
          "Nb_Reviews": 1,
          "Date": "2022-07-22T22:22:31.000Z",
          "Titre": "Great Option for a Nugget Ice Maker",
          "Contenu": "We purchased a NewAir nugget ice maker in April and have been very happy with it. The ice is the same shape as Sonic or Chick-Fil-A ice, but it isn't quite as soft and chewy as their ice. We love that the machine is easy to clean and fill with water and that it makes a good amount of ice for our family of 4. One thing we don't like so much is that the ice drawer doesn't stay up when you pull it out (and it is a little hard to pull out, especially for kids). It seems like for an expensive ice machine the drawer would have been designed a little better. We also had an issue with it in July (3 months after purchasing) where a piece of metal inside the machine broke off into the ice bin. But since it is under warranty still, the company is replacing the machine for us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerome Lachandra Kawiana",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T02:56:32.987Z",
          "Titre": "I’m super grateful to Charles T",
          "Contenu": "I’m super grateful to Charles T. @ NewAir.  I purchased a chiller and upon unboxing I noticed that it had a dent in the back. I reached out and Charles was my advisor, I’m excited to report that my new chiller has arrived.  I have unboxed it and plugged it up to ensure that we don’t have any more issues before filling it.  It seems to be running well so far.  Once again thank you so much Charles now I can have my wines 🍷🍷🍷🍷🍷🍷🍷🍷🍷🍷 at the right temperature!!!winesforhumanitycom/lkblueI’m not sure 🤔 what the question is…I know that wine 🍷 is the answer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Margaret McLaughlin",
          "Nb_Reviews": 1,
          "Date": "2022-05-31T19:43:45.000Z",
          "Titre": "Replacing a broken machine",
          "Contenu": "Our machine stopped producing ice.  When I contacted customer service, they were quick to respond and provided diagnostic info.  When we couldnt fix the issue, they were helpful in replacing the unit right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Johnson",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T12:25:29.000Z",
          "Titre": "Shipping was outstanding",
          "Contenu": "Shipping was outstanding.  Received my package two days after ordering.  The unit was packaged securely with no damage.  The humidor, as of right now, is performing perfectly.  I've read comments about the noise it makes, but mine is barely noticeable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Lee",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T07:11:29.000Z",
          "Titre": "Vanessa was courteous throughout our…",
          "Contenu": "Vanessa was courteous throughout our conversation, she took the time to listen to my questions and resolved all my concerns. Great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Howard",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T02:44:04.000Z",
          "Titre": "Ice Maker replacement",
          "Contenu": "I recently had to use the claims department for a nugget ice maker I bought in August and everyone I dealt with from Newair was fast and courteous and just a total pleasure to talk to. I got my unit replaced and it was shipped out immediately. Color me super impressed~!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan kelliher",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T20:56:43.000Z",
          "Titre": "Customer Service at its finest",
          "Contenu": "Customer Service at its finest. I love my ice maker and will forever be a NewAir customer.  Vanessa is awesome thank you again! They have an awesome product and even better customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Bishop",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:24:35.000Z",
          "Titre": "Ionie Castro's customer service for my…",
          "Contenu": "Ionie Castro's customer service for my issues was handled in a very professional manner and she took the time to insure I had all of the details I needed to resolve the issue. She was kind and patient with me and took the time to wait for me to correspond with information she needed on her end. This was a very pleasant experience, and I would recommend her company and especially her as a customer service professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassie Buth",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:05:18.000Z",
          "Titre": "Issue remedied quickly",
          "Contenu": "We ordered a new wine fridge that stopped working properly shortly after we received it. Customer service was easy to reach and resolved the problem super quickly. They weren’t able to troubleshoot the issue so they replaced it with quick shipping. Couldn’t be happier with my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiem Na",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:09:42.000Z",
          "Titre": "Very Good Service",
          "Contenu": "Thank you so very very much for helping me Charles Trapp, you really acknowledge the work and take care the issue about my broken Ice maker. Your company should give honor. Keep up your good work and the customer will be satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T03:02:01.000Z",
          "Titre": "The agent was extremely helpful and I…",
          "Contenu": "The agent was extremely helpful and I wish all customer service agents were like her."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Sigmon Holliday",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T21:31:48.000Z",
          "Titre": "Laurellee Ashley Stuart  customer service rep (Newair)",
          "Contenu": "Laurellee Ashley Stuart from Newair was one of the best customer service reps I have ever had the pleasure of dealing with.  She was professional, kind & patient.  She walked me through what I needed to do & resolved my issue with no problem.  Thank you Laurellee."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raseth Kirksey",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:35:19.000Z",
          "Titre": "The Newair team has exceptional customer…",
          "Contenu": "The Newar team has exceptional customer service! I have had my 44lb Nugget Countertop Ice Maker for a little over 9 months, and it had a few problems with pumping water. The CS team made sure that my item was replaced, and they did it with sincerity and compassion!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vee Mack",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:03:58.000Z",
          "Titre": "Charles provided A1 customer service",
          "Contenu": "Charles provided A1 customer service. He handled my situation in an expeditious manner. Their are still great Customer Service Reps out here and Charles is one of them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Mesman",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:47:16.000Z",
          "Titre": "Elizabeth was a great help in providing…",
          "Contenu": "Elizabeth was a great help in providing me with technical customer service and providing me with the right parts I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julian Kwasneski",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T22:22:09.000Z",
          "Titre": "I had a warranty issue with our ice…",
          "Contenu": "I had a warranty issue with our ice maker and got the issue resolved promptly and effectively. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eugene Susi",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T18:30:41.000Z",
          "Titre": "Elizabeth Martinez was very helpful and…",
          "Contenu": "Elizabeth Martinez was very helpful and was able to help me with all of my issues"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "leshell wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:59:40.000Z",
          "Titre": "A Satisfied Customer",
          "Contenu": "Vanessa Paula Usher Edwards is awesome. I contacted customer service and spoke with her reference a missing part to my new purchased Newair Refrigerator. Without any hesitation, she gathered my personal information and generated a shipping label for the part I needed. She was very pleasant, personal and professional the entire time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T B",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:52:18.000Z",
          "Titre": "Great customer service",
          "Contenu": "I gave 5 stars even though my 126 can beverage cooler did not work upon arrival.  The reason for this is the excellent customer service I received from Hilary W. at Newair.  She was prompt and sympathetic to my inconvenience and with just a few pictures and information from the unit, sent me a replacement immediately.  I didn't even have to return the orginal unit, (I was not looking forward to trying to repack it).  I just had to cut the cord and send in photos.  Hilary reminded me of how customer service used to be, when the company seemed to appreciate your business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara Buggs",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:51:41.000Z",
          "Titre": "Warranty experience",
          "Contenu": "I had a warranty need and contacted the company. Charles was very professional and helpful. He took care of my warranty and I am thankful for the assistance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:21:06.000Z",
          "Titre": "Fern is awesome!",
          "Contenu": "Fern is awesome! I have had 2 issues now that he has taken care of for me! Super friendly and very quick in response back. Thank you Fern and Newair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "misty jarrett",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:11:34.000Z",
          "Titre": "Ice Machine",
          "Contenu": "Elizabeth was very nice and helpful with getting my replacement on my ice machine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyle Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:54:39.000Z",
          "Titre": "Best Customer Service",
          "Contenu": "I was very fortunate to be connected with Hilary when I called the Newair customer care line. Hilary was able to find the product I needed, price match with a vendor, and get my product shipped to my house in time to surprise my Wife! Hilary, listened, sprang into action to solve my dilemma, and made my purchase and shipping EASY! I work for a company known for Amazing Customer Service, and Hilary is the tip-top of what it means to provide truly OUTSTANDING customer service!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nunya",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:31:52.000Z",
          "Titre": "Very satisfied with customer service",
          "Contenu": "I called in for an order, because the website wasn’t giving me the discount, Lauralee, the customer service agent was very patient and helpful and kind. She handled all my concerns, answered all my questions, in a timely fashion, and pleasantly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Ma",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T21:12:25.000Z",
          "Titre": "Superb Assistance - Charles",
          "Contenu": "Charles was able to get me a replacement since my original was damaged upon delivery. Guided me through the process and was super helpful! Thanks again for the help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Gavlick",
          "Nb_Reviews": 3,
          "Date": "2023-12-05T01:29:24.000Z",
          "Titre": "My wine refridgerator experienced a…",
          "Contenu": "My wine refridgerator experienced a sudden failure recently. I reached out directly to Newair and luckily was connected with Ionie who took time to understand the issue, research the availability of replacement parts, and provide me with the quickest solution. In this case, it was to replace the failed unit with an entirely new unit. It arrived in a few short days, and I couldn't be happier with the service. Ionie was calm throughout the process of diagnosis and assured me everything would be taken care of. And it was! Thank you Ionie, I so appreciate your help and would recommend Newair to anyone interested in a great product backed by great people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john Augustine",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T16:32:23.000Z",
          "Titre": "Perfect customer service delivered by…",
          "Contenu": "Perfect customer service delivered by Laurellee Ashly Stuart. All issues taken care of as fast as could be.  And the nugget icemaker is absolutely fantastic.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "alns Escamilla",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T01:00:13.000Z",
          "Titre": "I would like to thank Vanessa for being…",
          "Contenu": "I would like to thank Vanessa for being so friendly and helpful with my problem with the ice maker. She was very courteous and precise. Thank you so much for taking care of my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ava Konuszewski",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:59:53.000Z",
          "Titre": "Customer Service",
          "Contenu": "Customer Service - The customer service was great. Charles helped me solve my problem with my nugget ice machine. I appreciate how kind and helpful he was."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hoss Stevens",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:30:16.000Z",
          "Titre": "EXCELLENT CUSTOMER SUPPORT!!!!!",
          "Contenu": "I bought a clear ice countertop ice machine which malfunctioned within the first 12-months.  I contacted Newair for technical assistance, and was put into contact with, Vanessa in customer support.  Vanessa was absolutely terrific, and she immediately troubleshot the issue and setup a replacement unit.  Additionally, she provided excellent communication throughout the entire process and promptly answered any/all questions I had, both via telephone and email.  As a result of my experience with Newair, and the top-flight service provided by Vanessa, I would have no hesitations whatsoever with recommending this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kaitlyn",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T02:07:44.000Z",
          "Titre": "The agent Anfernee was super helpful in…",
          "Contenu": "The agent Anfernee was super helpful in getting my order replaced when my ice maker sadly broke. Even with my current product discontinued he was able to find a replacement."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Welborn",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:40:29.000Z",
          "Titre": "Charles helped me with a replacement…",
          "Contenu": "Charles helped me with a replacement unit when my machine stopped working.  Great customer service.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Montauk",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T11:50:35.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Although I have had issues with the products themselves, the customer support and response is great.  Good communication and follow through."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Howard",
          "Nb_Reviews": 8,
          "Date": "2023-12-07T03:36:03.000Z",
          "Titre": "Fantastic support!",
          "Contenu": "I have had three interactions with Newark customer service and all three have been wonderful and very helpful. They took care of my icemaker issue right away and already have its replacement on the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc Braun",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:26:39.000Z",
          "Titre": "newair is a great company",
          "Contenu": "newair is a great company.  I had an issue with the new unit at delivery.  I contacted support and spoke to Charles Trapp and received courteous and quick resolution.  This company is a great company and Charles is a great asset to newair."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie Nelson",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T14:09:27.000Z",
          "Titre": "Great customer service",
          "Contenu": "The ice maker we bought for our daughter for Christmas last year, suddenly started leaking and not making ice. We looked through our manual and realized there was a one year manufacturer warranty. Called the number on the book and got set up with a replacement ice maker, since our style was discontinued. Only took about 15 minutes and Hilary was wonderful to work with. She was very responsive and helpful. We sent pictures and videos of the leaking, paid a shipping cost of about $20 and our new ice machine is on the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leah Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:32:39.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "I worked with Laurellee from start to finish and she was awesome! Got my replacement set and was with me each step of the way! Best customer service I've had in a while."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David meyers",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T03:29:09.000Z",
          "Titre": "Frigidaire cooler",
          "Contenu": "Thank you very much for your help with my Frigidaire cooler. I really love my cooler, it makes the summers here in Los Angeles easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chip Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:11:11.000Z",
          "Titre": "Who you buy from is as important as what you buy.",
          "Contenu": "I have learned to factor in product support as well as price in large purchases. I have purchased an outdoor fridge, humidor, and countertop ice maker from Newair. For the first time, I have needed product support. My call was answered within in 1 minute. The support person was easy to understand and empathetic to my situation. I was prepared for a fight to get my situation resolved, but she just asked for my receipt and the item was instantly scheduled to be replaced. For once, I was right in selecting a company who stands by their product and hires competent people focused on customer satisfaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Montauk",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T11:56:43.000Z",
          "Titre": "Hilary provided great customer service…",
          "Contenu": "Hilary provided great customer service and arranged a replacement unit for me after my second unit stopped working.  Great communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cristy Milner",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:39:36.000Z",
          "Titre": "Charles was very helpful in getting me…",
          "Contenu": "Charles was very helpful in getting me a replacement counter top ice maker and he was very friendly and helped me in a timely manner. 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "luigizi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:38:33.000Z",
          "Titre": "Had an issue with a missing feet on a…",
          "Contenu": "Had an issue with a missing feet on a heater and the agent Laurellee promptly resolved it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Alvarez-Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:08:19.000Z",
          "Titre": "Ms. Martinez",
          "Contenu": "It was very professional and straight to the point."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "MS W",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T19:51:14.000Z",
          "Titre": "I found that my customer experience…excellent!",
          "Contenu": "I found that my customer experience expert, Fern was knowledgeable, organized and very professional in his approach to resolving my issue.  The employees are what make a company great, so keep up the good work!We have other New Air products in our home and are extremely happy with the quality and service from New Air."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeanne Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:59:43.000Z",
          "Titre": "LaurelLee was very helpful in getting a…",
          "Contenu": "LaurelLee was very helpful in getting a replacement unit for me!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Wiggins",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T20:37:33.000Z",
          "Titre": "Contact Form Submission [#161676669]",
          "Contenu": "My recent customer support representative (Anfernee) on my ice maker issues was top notch.  We bought the ice maker last November and became inoperable due to problems with the ice maker shovel and hinges. He was responsive to all of my emails, provided troubleshooting techniques and ultimately helped me get a new one since mine was still under warranty.  As a family of 5, with the parents working from home and 3 kids with multiple sporting events, we are constantly in need of ice.  We cant wait to get the new one!  Hopefully this one will last!  Thanks Anfernee!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dara",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T18:25:16.000Z",
          "Titre": "Best customer service I had in a long…",
          "Contenu": "Best customer service I had in a long time. Felt like my issue was important to them as well as myself. Tried to come up with a solution and when that didn't work, a replacement was offered without hesitation. Most companies give pushback on honoring their warranties. Newair (Hillary Waight) was exceptional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Azure Kitts",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:55:59.000Z",
          "Titre": "Charles did well!",
          "Contenu": "Charles was very helpful with helping me today with my machine issues. He was very courteous and got to the issue quickly. Thanks Charles!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Muse",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:54:02.000Z",
          "Titre": "FERN is the face of NewAir",
          "Contenu": "I was having some challenges placing my order on the internet and ended up having to phone in and Fern was very helpful in getting my part ordered.  When I realized there was another part that I was missing and did not order I contacted Fern for assistance in getting my order complete and correct, and he responded ASAP. He was friendly professional and helpful the whole time I contacted him on the occasions for help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:29:15.000Z",
          "Titre": "The customer service is great",
          "Contenu": "The customer service is great. They are friendly and helpful and very responsive. We had a warranty issue and they were great at handling it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DL",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T22:36:14.000Z",
          "Titre": "What a great experience on customer…",
          "Contenu": "What a great experience on customer service,  no issues very understanding and polite  she handled it like a professional.  Thank you, other companies could take notes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John G.",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:09:16.000Z",
          "Titre": "Hilary Waight is awesome",
          "Contenu": "Hilary was an exceptional customer service specialist. We had an icemaker break and when I called at first the initial agent said all they could do was refund the purchase price, but I didnt want a refund, I wanted a replacement ice maker especially since they cost more now. So then I called back and spoke to Hilary and Hilary looked into the matter and got a replacement ice maker authorized within minutes. Hilary was also so pleasant to speak with and communicate with. I highly recommend her for a promotion at Newair. Thank you Hilary!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Willis",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:53:52.000Z",
          "Titre": "good support and resolution",
          "Contenu": "Anfernee provided good online support and explanations of everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bootie San",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:35:40.000Z",
          "Titre": "I did not think the fix would work but…",
          "Contenu": "I did not think the fix would work but was pleasently  surprised.  Camilla knew exactly what to do and it worked!! Thank you so much, I love this ice maker and hope it ends up being reliable and long lasting. Cleaning is important and I do find that cleaner water is much better for this device. I would recommend these units to anyone and lobe the quality of the ice. Thank Camilla for the great support and staying in communication to make sure things worked out ok. It makes recommending the brand much more with support like Camilla!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christen",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:40:13.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Vanessa from customer experience at NewAir has helped me three times now, and each time I’ve had to reach out she’s been so amazing. She sorted out a warranty claim and has been so kind, attentive, and professional in every communication. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:31:03.000Z",
          "Titre": "Vanessa Paula Usher Edwards was very…",
          "Contenu": "Vanessa Paula Usher Edwards was very kind in every interaction that I had with her.  She told me what the company could provide and made helpful suggestions. She followed through quickly. Great customer service representative."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Reno",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T21:48:31.000Z",
          "Titre": "Warranty issue…",
          "Contenu": "Anfernee Lisbey made my warranty issue easy. Great customer support. Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lloyd Murphy",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T19:06:23.000Z",
          "Titre": "I had a problem with my recent purchase…",
          "Contenu": "I had a problem with my recent purchase of the 6\" 7 bottle wine NewAir Fridge - Ms. Hilary Waight (Customer Service Rep) was very professional and definitely resolved my issue immediately - This is the 2nd Item I have purchased from NewAir and will be purchasing additional items in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ravy Morng",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:38:17.000Z",
          "Titre": "Great experience with customer support",
          "Contenu": "Great experience with customer support. They made filing a claim on Manufactured warranty as quick and painless as possible."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince Bonanno",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T13:16:04.000Z",
          "Titre": "New air dual wine fridge issue",
          "Contenu": "Have been in contact with customer service for several days on a defective unit.  Just received a call back from Kevin.  He took charge and did not make excuses.  At this time he is having the parts sent out as a courtesy to resolve the problem.  His effort and engagement are most appreciated.  Looking forward to seeing the results and will update once problems resolved.  Thanks Kevin"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Ackerman",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:41:12.000Z",
          "Titre": "Excellent customer service experience.",
          "Contenu": "I cannot say enough great things about NewAir. I had an older product that stopped working and Anfernee in customer support addressed the issue with me immediately and helped me replace it.I cannot wait to get my new nugget ice maker."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Jordan",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T18:30:50.000Z",
          "Titre": "In My Prepping Toolbox _ Newair 5 Cu.Ft Freezer in Military Green",
          "Contenu": "My Newair 5 Cu.Ft. chest freezer in military green is perfect for my family. It's compact enough to fit in small spaces but large enough to handle what I need to put in it. It's easy to set up and attractive to look at. The lcd panel on the top lets me know the constant temperature of my unit. I check it with a glance every day I walk past it. More importantly, it plays an important role in the food security for my family. I'm loving this space saving Newair freezer in such a delicious color."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew & Jessica Gilmore",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:57:18.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service, worked quickly to help support my issue!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom M.",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T22:14:09.000Z",
          "Titre": "Hillary represented NewAir very well!",
          "Contenu": "Hillary did an excellent job assisting me with the replacement of our beverage cooler. The replacement was out of stock until December so she proactively found a similar unit that was readily available. Thank you Hillary for your great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Fields",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T23:56:49.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "It's support representative, Ms. Ionie. She was excellent and very knowledgeable. She answered all of my questions and the ones she couldn't, she researched and got the answers I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bilal Patel",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T00:31:37.000Z",
          "Titre": "Fantastic customer service online and…",
          "Contenu": "Fantastic customer service online and on the phone. I needed a spare pet for my air conditioner and they sorted me out straight away. I haven’t had this level of customer service for years. Well done."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ralph deluccia",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T21:00:39.000Z",
          "Titre": "I experienced a problem with my Newair…",
          "Contenu": "I experienced a problem with my Newair Beverage Cooler and first attempted to reach customer service by phone.  That method wasn't satisfactory so I sent them a message via email.  I received a prompt reply from Charles and within a short period of time the issue was resolved.  Two thumbs up to Charles for his handling of this matter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Marks",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T04:17:06.000Z",
          "Titre": "Vanessa was wonderful to work with",
          "Contenu": "Vanessa was wonderful to work with! She was professional and she was very knowledgeable and I thank you all so much! Was a very pleasant experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "musskuss",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:01:25.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great communication and solved my issues fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john Augustine",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T02:18:47.000Z",
          "Titre": "Perfect customer service",
          "Contenu": "Perfect customer service. Issue resolved with no hassle at all.   Thanks Newair"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Avinash Reddy",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T05:04:01.000Z",
          "Titre": "Great customer service!!",
          "Contenu": "There was an issue with the delivery of my Newair fridge and Hilary Waight from customer service was great at chatting with me over the phone and helping resolve the issue. I appreciate the great customer support and look forward to getting the replacement Newair fridge soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Falkowski",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T18:02:14.000Z",
          "Titre": "EXCELLENT customer service",
          "Contenu": "Excellent customer service. My calls and e-mails were answered promptly. The agent walked me thru every step with perfectly written instructions with each step. She was polite, knowledgeable and made the process with my broken appliance run smoothly. Thank you, the great service is truly appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamekia Haygood",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T01:21:27.000Z",
          "Titre": "Ionie Castro (Newair)",
          "Contenu": "Ionie Castro (Newair)Oct 17, 2023, 3:37 PM PDTI received great customer service from Ionie. Unfortunately this is my second encounter with Newair. I purchased a Newair 42-44lb per day Nugget Ice Maker with Drawer Bin Black SS back in December 2022. The first one I received was damaged so I contacted Newair and was sent a replacement. The replacement worked fine until now, October 2023. My machine no longer makes ice. Thankfully I was able to call and be assisted with no problem. Ionie was very friendly and assisted with ordering my replacement. Hopefully I don’t have to call again because my 1 year warranty will be up soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonino Morales",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:26:17.000Z",
          "Titre": "Camilla Mendez is the BEST",
          "Contenu": "I can not say enough about the professional manner in which Camilla Mendez, Customer Support and Newair handled my service issue.She was calm, patient and extremely helpful.  This is particularly impressive given that by the time I spoke to her I had spent several frustrating hours on the phone with the third-party warranty company and I was not in the best mood.Camilla filed my complaint and within 10 days I had a new unit at my doorstep.  THANK YOU NEWAIR AND CAMILLA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie B. Baker",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T20:42:00.000Z",
          "Titre": "Ice machine issue",
          "Contenu": "Elizabeth Martinez did a wonderful job and helping me Rectify my ice machine issue thank you so much Elizabeth for all your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Pearce",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T22:16:51.000Z",
          "Titre": "A part broke on my heater but Hilary in…",
          "Contenu": "A part broke on my heater but Hilary in customer service made it easy to get a replacement.  She listened, was helpful, and placed my order for a replacement in a very short time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Rivera",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T01:00:57.000Z",
          "Titre": "My ice nugget maker stopped working",
          "Contenu": "My ice nugget maker stopped working. I emailed their customer service. I provided them with all the documents they needed and they shipped me a new ice nugget maker. I am very impressed with their customer service department."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David L.",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:16:50.000Z",
          "Titre": "Humidor",
          "Contenu": "Product, delivery and customer service were all first rate. I'm very happy with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth Santana",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:03:33.000Z",
          "Titre": "Customer service is very helpful they…",
          "Contenu": "Customer service is very helpful they always help me with my questions or concerns. Charles Trapp is super professional and very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JaySteezie",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T01:21:40.000Z",
          "Titre": "Wow. Great product and Customer Service to match!",
          "Contenu": "My Humidor door arrived with a defective door.  I called customer service with my fingers crossed.  Camilla was incredibly helpful and attentive.  When I called I was preparing myself for a run around and having to go back through Amazon to get things resolved.  I was very pleasantly surprised as Camilla made my door replacement a seamless process.  She also followed up with a tracking number a couple of days later.  I am very happy with my purchase (as soon as it's all squared away).  And I would recommend Newair to anyone because of the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Louis C",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T00:34:56.000Z",
          "Titre": "so far unit operating as expected",
          "Contenu": "so far unit operating as expected. Excellent shipping and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Ibara",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T23:22:47.000Z",
          "Titre": "Great Customer Service Hilary W",
          "Contenu": "Hilary W was a great customer service representative. Always quick to return emails, Hilary was extremely pleasant, efficient and competent in handling my inquiries. Hilary quickly diagnosed the problem and quoted the required part promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Harden",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T03:58:42.000Z",
          "Titre": "Hilary is an awesome customer service…",
          "Contenu": "Hilary is an awesome customer service tech. She quickly answered my emails and is very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChappyPants",
          "Nb_Reviews": 2,
          "Date": "2023-10-27T00:26:24.000Z",
          "Titre": "Had a simple component that was missing…",
          "Contenu": "Had a simple component that was missing from a refurbished model. No biggie. Melissa W. from NewAir was great and had the component sent out without me having to go 12 rounds with her and turn into a little Karen. I really appreciated that."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherrie Lyon",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:40:04.000Z",
          "Titre": "Customer service rep was very…",
          "Contenu": "Customer service rep was very courteous, professional and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Silva",
          "Nb_Reviews": 4,
          "Date": "2023-10-23T10:25:35.000Z",
          "Titre": "My portable air conditioner wasn't working",
          "Contenu": "I purchased a portable air conditioner a year ago.  It worked beautifully the first year, but when I was ready to use it this year, the water pump was not pumping the water onto the pad.  I contacted support and spoke to Charles Trapp. He told me I was in the gray zone where the manufacturer's warranty had only a few days remaining and the additional warranty I purchased had not quite kicked in yet. After we exchanged a few emails, which I was rather late in doing as my husband was in the hospital with a broken hip, he went ahead and shipped me a new water pump along with the instructions for replacing it.I feel like he went above normal support in sending it to me even though I wasn't real fast in responding back to him.  The instructions were easy to follow and I was so happy to have the air conditioner working again.  Thank you Charlie!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LC",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T22:32:18.000Z",
          "Titre": "troubleshooting of broken wine cooler",
          "Contenu": "Charles quickly helped me to figure out the issue and to order the needed part.competent, polite and efficient.thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:36:07.000Z",
          "Titre": "A class above the rest!",
          "Contenu": "Newair customer service is second to none!  I was having issues with my ice maker and the representative Anfernee was able to assist me quickly in having my issue resolved!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Chellis",
          "Nb_Reviews": 3,
          "Date": "2023-10-20T23:52:22.000Z",
          "Titre": "48 quart cooler",
          "Contenu": "Great price and site very intuitive even registration was easy. Only been using for 2 weeks but works great. The controls on cooler are not intuitive but if you read the manual or watch utube videos it is easy to figure out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T20:36:33.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I would like to give thumbs up for excellent customer service provided by phone with Charles.  He stepped me through everything and assisted in several issues to resolve all problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T22:36:38.000Z",
          "Titre": "Thank you Fern",
          "Contenu": "Fern was gentleman that assisted me with problems with ice maker. It was not working properly and he helped me with tips and suggestions but it ended up not working in the end. He help me get a new one steps on what to do the broken one. He was very helpful, thank you fern."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Hall",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:32:39.000Z",
          "Titre": "Charles (in Customer Service) at Newair…",
          "Contenu": "Charles (in Customer Service) at Newair was super helpful with a technical issue I had. He was responsive and communicative, and good at describing what the issue needed. I appreciated that, although I purchased the item through Amazon, Newair was easy to reach."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erika Maffett",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:49:45.000Z",
          "Titre": "Hilary Waight was wonderful",
          "Contenu": "Hilary Waight was wonderful! She called me back after I’d left a voicemail. She has answered all of my emails in a timely manner & answered all questions & took care of my issue in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CO",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:06:08.000Z",
          "Titre": "Trustworthy Company",
          "Contenu": "Customer support was great to work with and company will stand behind their products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAY",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T22:36:14.000Z",
          "Titre": "Clean, simple to navigate, and got what I needed",
          "Contenu": "The site was well layer out and easy to navigate to the page I was interested in. I did find that products which are available for purchase aren’t available on the site, which is of some inconvenience, but it gave me time to rethink whether the item was suited to my intended use, which was an additional drawer for the 250 size cigar humidor. The chat was also fast and easy to use! All in all a great experience. Makes me think I’ll order directly from them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Collett",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T17:57:10.000Z",
          "Titre": "Laurallie was very please and helped me…",
          "Contenu": "Laurallie was very please and helped me get a replacement  for my ice machine that had stopped working. She was so professional  and I am so happy with the outcome. I love my Newair 45 pd. Nugget Ice Maker! And Newair's customer service is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassie Little",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T03:41:34.000Z",
          "Titre": "Newair Customer Service",
          "Contenu": "Our Newair customer service agent was excellent in helping us get a replacement for our nugget ice maker. I appreciate their willingness to resolve the issue!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leslie",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T00:18:35.000Z",
          "Titre": "Great customer service",
          "Contenu": "The process so far has been easy and responses are quick. This by far has been my very best experience with any customer service issue. My customer support rep, Laurellee, has been so nice and helpful! She's great!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael  McDonald",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T22:17:36.000Z",
          "Titre": "I got my new ice maker yesterday I…",
          "Contenu": "I got my new ice maker yesterday I waited for a hour plugged it in  everything went well but two hours no ice  4 hours no ice the coprocessor not working  I call customer service she took the information and Charles Trapp contact me more emails and pictures I have a replacement on the way thank you again Charles for taking care of your Customer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gary swaboda",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T00:41:14.000Z",
          "Titre": "There are still people who care about their customers!",
          "Contenu": "Need more people like Vanessa in customer service!She resolved my internet order in no time! She is polite, knowledgeable, easy to understand, and had my order complete in minutes! Thanks again for a pleasant transaction!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Privada Cigar Club",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T16:51:01.000Z",
          "Titre": "Newair has Products that are unmatched…",
          "Contenu": "Newair has Products that are unmatched in there quality and usefulness always one of my go too providers whether for cigars or for refrigeration."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:06:39.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Charles helped me with my broken ice machine and he made it so easy! I wont hesitate buying a newair appliance knowing someone like Charles is working there and provides exceptional service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T21:53:58.000Z",
          "Titre": "Customer Service does pick up the phone…",
          "Contenu": "Customer Service does pick up the phone and offers solutions to problems. I have ordered fridges from them in the past. Shipping companies tend to damage items. But I would not hold that against Newair or the staff."
        }
      ]
    }
  ]
}