{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "nextiva.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "VE",
          "Pseudo": "Nicolas Ramirez",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T00:01:36.000Z",
          "Titre": "AWFULL BUYING EXPERIENCE",
          "Contenu": "I just wanted to purchase a phone number, and they find a way to complicate it all by a buch of emails that just simply didn't make any sense. I just want to get a normal shopping experience, but apparently calling an absurb amount of times is better than that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Douglas Klimek",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T09:22:35.000Z",
          "Titre": "Ignores decades old loyal customer!",
          "Contenu": "For the past decade, my experience with Nextiva has been exceptional!However, conversion to their new system a year ago left me stranded without the ability to make any changes to my account which include billing. Dozens of communications with Nextiva  to fix NextOS Portal lockout to change billing info resulted in failed solutions, or being completely ignored.When all I’m trying to do is port my numbers and pay my bill. Is that so hard?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heather Delgado",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T20:38:36.000Z",
          "Titre": "It is a NO from me.",
          "Contenu": "There is nothing easy, intuitive or helpful with Nextiva. I do not recommend."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T17:13:37.000Z",
          "Titre": "We have been overcharged for 5 months…",
          "Contenu": "We have been overcharged for 5 months and my account is still under review as they try and give back the necessary credits. I have spoken with 4 different people and wasted several hours trying to correct Nextiva's error. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Larmeu",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:18:36.000Z",
          "Titre": "Service works OK but customer service…",
          "Contenu": "Service works OK but customer service stinks. Nextiva double billed us starting in March and it is still not resolved. They do not call you back. There is no follow up from Nextiva. It is the customer who has to do the follow up and when you get upset with the rep. over the experience that you are having they hang up on you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T18:34:03.000Z",
          "Titre": "Second guessing contracts because of this company",
          "Contenu": "Nextiva's contracts can be tricky to navigate and having links on the contract that take you to other web pages that have more links that you need to read comes across as sneaky. We were fortunate to get a escalations team member that helped us cancel our account with them but on the whole I would not recommend using them for VoIP. From the beginning we were not set up for success with our phones. While the phones themselves were easy to use, the platform to add or change settings on the phones was not. It wasn't until we decided to cancel our account that Nextiva showed interest in fixing the issues we were having but it was too late for us at that point."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Zevallos",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:36:28.000Z",
          "Titre": "My business phone number was not active…",
          "Contenu": "My business phone number was not active for 1 week because I didn't do a \"consultation\" phone call. So basically I lost a week worth of business just because I did not speak to your representative. It's a damn phone line and not that serious. This is absolutely ridiculous and a joke."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Walter Gray",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:24:29.000Z",
          "Titre": "The worst service and support I've ever…",
          "Contenu": "The worst service and support I've ever received in 30 years being in the IT Field. Please friends stay away from this company they will lie and charge you for services you don't have then never refund what they say they will. I tried to contact the CEO on LinkedIn and you guessed it he never replied because he don't care."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Mullholand",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T16:20:57.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I have been lied to and they do not work with you at all. Just paid an outstanding balance from May. They emailed me if I don't respond to the email they were going to shut off the line, I responded and still shut it off. The first time this happened told me they emailed me after making a payment arrangement and they never did after the payment arrangement didn't go through. It's fine for the most part but customer service and the app isn't great. I am going to explore other companies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Drew Helgeson",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T02:27:51.000Z",
          "Titre": "I'm porting out.",
          "Contenu": "NextivaOne won't refresh on new texts while in a conversation.  I can't use pinch to zoom on images people send to me.  I can't watch 3gp videos on mobile unless I download it and play it in a different player.  I'm asked to submit a feature request for these 3 basic functionality items."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henry Pippin",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T21:32:27.000Z",
          "Titre": "I did not receive my refund yet",
          "Contenu": "I did not receive my refund yet, They overcharged me twice so far, and every time I contact CS they say they are reviewing it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandi Herron",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:09:33.000Z",
          "Titre": "Run around",
          "Contenu": "Do not use this company, I have been trying to cancel them for 4 months now and had to dispute it on my credit card, they are horrible to work with. and are still trying to bill me, and my credit card - Nightmare company to work with!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl Rewick",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T17:33:51.000Z",
          "Titre": "Owner",
          "Contenu": "Horrible company, with too many issues. The phone app has so many issues and they are never resolved.  Tickets are opened and then we never hear back from anyone.  They have no issue taking your money every month for a product that does not function at 100%."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Office Manager",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T22:44:08.000Z",
          "Titre": "After my last review, still useless",
          "Contenu": "After my last review, I have called and emailed, but not received any assistance whatsoever. Instead our issues have worsened to the point where now none of our office numbers are \"licensed\" and still nobody is answering any questions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Veronica Nett",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:21:07.000Z",
          "Titre": "Brand new client who ported over a…",
          "Contenu": "Brand new client who ported over a business phone number. Couldn’t get the Nextiva phone to work. Spoke to two different IT techs who gave me two wrong solutions/answers to troubleshoot the issue. I ended up contacting my business’ IT who were able to fix the issue with a simple solution. Nextiva’s IT and my sales rep were zero help and left me feeling blown off while I struggled to get their product to work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Office Manager",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T00:33:20.000Z",
          "Titre": "Useless",
          "Contenu": "We are completely unable to use the service. I keep calling support but have not once reach an agent. I have emailed the Advocacy Group but haven't received a reply. I am suggesting to the corporate director that we terminate the cooperation with Nextiva and move towards a competitor."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jena B",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:47:17.000Z",
          "Titre": "Did not resolve issue and overall am…",
          "Contenu": "Did not resolve issue and overall am not happy with the platform. It seems silly that sms messages can’t be deleted and just pile up, I continue to have massive problems getting my service set up. Thus far I am extremely disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Climer",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T23:20:21.000Z",
          "Titre": "There were 2 reps that helped that were…",
          "Contenu": "There were 2 reps that helped that were AMAZING....Daria & Alex.  I am very disappointed in the sales rep.  He told me he would be our only contact.  He also said that there would be zero phone downtime, which COMPLETELY was not true.  No one ever called me to start the setup process, I kept having to call myself.  If it wasn't for the 2 reps I mentioned above, I would have completely canceled moving services to Nextiva.  When I called \"my rep\", I mostly got his voicemail and after leaving emergency messages, he still never called me back.  Quite disappointing with the overall experience.  But they had already ported my phone #'s over after I asked them to stop that process, so I had to finish getting everything set up cause we were basically without phones."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Koutney",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T01:25:35.000Z",
          "Titre": "The porting department WASTED over two…",
          "Contenu": "The porting department WASTED over two weeks and hours of my time because THEIR LOA FORM Allows up to 10 numbers, but they wanted one number per form on my LOA request forms."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANDREW MAZER",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T18:40:35.000Z",
          "Titre": "Nextiva botched the setup of our…",
          "Contenu": "Nextiva botched the setup of our account and then they wanted US to go through hoops to get it straightened out. Their onboarding was a mess. The kids that setup the account clearly had no training. Nextiva has been wasting my time with emails and billing ever since and if they wanted to, they would see that not one phone call was made or received. I hate to leave negative reviews but they have earned it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brianna Torres",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:21:27.000Z",
          "Titre": "Nextiva support is horrible",
          "Contenu": "Nextiva support is horrible. Support fixed one issue by causing another. It takes 20 minutes to get someone on the phone. They will be quicker to respond to this review then they have been in the past three weeks to any of my communications. 0/10"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beverly Sepulveda",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T01:55:27.000Z",
          "Titre": "The cordless phones do not connect or…",
          "Contenu": "The cordless phones do not connect or stay connected. If the hardware is poor, the phone service is irrelevant."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ross Brenner",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T19:04:37.000Z",
          "Titre": "Nextiva's service is terrible and…",
          "Contenu": "Nextiva's service is terrible and charge me a $1000 cancellation fee after upping my monthly service fee by over double. This is highway robbery. Do not use Nextiva! They are an awful company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "devan happle",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T21:30:15.000Z",
          "Titre": "Absolutely horrible",
          "Contenu": "Absolutely horrible. I explained exactly what I needed for my phone line in the sales call. They set me up and took my money and then oh wait, you have to pay 4x the amount that we originally agreed on in order to get the setup I wanted originally. And the phone line was never set up, it NEVER rang. Then just getting someone on the phone to help me was unbelievable. I finally just got in touch with someone to cancel the account. And then, even though I had a line that never worked I still had to pay that money for nothing in return. ABSOLUTELY HORRIBLE. Ring Central says they are continually getting people moving over from your company. And I will do everything possible to let everyone know not to do business with you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jon G.",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T00:48:28.000Z",
          "Titre": "Dishonest Pricing and poor customer…",
          "Contenu": "Dishonest Pricing and poor customer support.They promised a stated rate per line but end up charging a much higher rate. After reaching out multiple times over the course of three months to get the situation addressed, there is still no resolution or updates on when a resolution will happen. The support emails do not provide a contact person for resolution and over the phone no one will take accountability. Would recommend to stay away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Myron McCumber",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T02:38:08.000Z",
          "Titre": "Not with Starlink",
          "Contenu": "Was not able to utilize Nextiva service with my Starlink system despite the salesmans assurances."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Naylor",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T17:41:20.000Z",
          "Titre": "My issue is still not resolved",
          "Contenu": "My issue is still not resolved. I’m paying for a service that does not have full functionality and is not usable for business in its current state."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Hugo Ham",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T19:33:34.000Z",
          "Titre": "This is the second  Friday Nextiva Log us Out",
          "Contenu": "This is the second  Friday , that Nextiva One is logging out several agents in our Law firm, and our other Law firms partners too, simply you can not log in even if your credentials are valid, or if you are admin in the platform, system does not recognize you or grant you access , worst thing..! you call support and only access a voice mail, not a live agent to answer, Chat support Online.. what a joke ! no agents there only BOTS, the only remaining thing hoping someone read it and forward it to reach the right person (pray before you send it) is write an email... IF you are a customer and pay for a service, at least expect to have a decent support, with humans to answer and provide you some kind of update and status, otherwise suggest Nextiva QA use AI and debug the system that is facing recurrent issues , seems since Nextiva One rev 1.0 to the latest one continue to have BUGS..BIG ONES , and fix it at ONCE ! we rely on a good communication system to keep our business up and running!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marion Dimick",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T23:59:11.000Z",
          "Titre": "tech support is not competent",
          "Contenu": "tech support is not competentBeen using you for years - cannot get issues resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "UpAndComing",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:56:26.000Z",
          "Titre": "They do not honor cancellation by…",
          "Contenu": "They do not honor cancellation by emails - even when the actual OWNER of the company sends to them an email to CANCEL service IMMEDIATELY. Had to call card company to block future unauthorized charges and to reimburse charges that erroneously took place AFTER cancellation notices that included the account's CPNI."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trisha Swinton",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T03:43:45.000Z",
          "Titre": "I have had a terrible experience with…",
          "Contenu": "I have had a terrible experience with nextiva. I would go with another company if you are thinking about this one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Craig Hall",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T23:08:14.000Z",
          "Titre": "Poor support getting started",
          "Contenu": "I am trying to get my service up and running and keep getting handed off to one person after another and finally to a form that I should have been given in the first place."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T17:16:06.000Z",
          "Titre": "Sales reps will lie and say whatever to…",
          "Contenu": "Sales reps will lie and say whatever to get you to sign up.  Was told they have mass emails, text and silent whisper features.  After signing up, they don't have email, mass texts or whisper.  Tech support is clueless when it comes to assisting you.  Set up took 3 hours on 4 different days.  Stay far away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fadi",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T15:28:13.000Z",
          "Titre": "Contact Issues/Port Issues/Message History Deleted",
          "Contenu": "Contact Issues/Port IssuesPorting paused our call system for an hour in the middle of the dayText messaging disabled by default messed up our teamContact importing not going wellAdding contacts not working, loses text/call history once we add an contactUPDATE:It's been 7 days and still no response from anyone from the \"Escalations\" or the \"Support\" team."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T00:23:34.000Z",
          "Titre": "Nextiva is the most openly dishonest…",
          "Contenu": "Nextiva is the most openly dishonest company I've dealt with.   They break promises on pricing and their customer service is terrible.  They also want to lock you into service and then continually raise prices.  Avoid like the plague.  I switched to Intermedia.   Better tech, lower cost, no contract, price guarantee for life."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T03:04:39.000Z",
          "Titre": "Not resolved",
          "Contenu": "Not resolved. It seems that each time I call for assistance, one thing gets fixed and others fail. Heavy foreign accent, inexperienced, or don’t have the tools necessary to address your problem. It worked fine yesterday, what could have changed so much at to not be easily repaired. Please contact me with resolution to the issue of dictation line/team working properly. On the phone for 2 hrs total with no resolution. Unfortunate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annette Lake",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T22:37:01.000Z",
          "Titre": "Nextiva Desk App Problems",
          "Contenu": "There have been far too many issues with Nextiva One App. The research time needed with Tech Remote access is extensive and does not solve the issue. Usually, they are level-one technicians. The case is escalated to the engineering team and sits without any updates. If am asked if I have additional issues the concerns are stacked on the same case not logged as a separate issue.  The support email received after the troubleshooting call states the case is closed when the problem has not been fixed. Our business is small and every interruption cost us revenue. We don't have time for outages or missed calls. I am trying to remain hopeful that Nextiva will improve the Desktop App issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T21:27:41.000Z",
          "Titre": "Completes waste of time",
          "Contenu": "After 21 minutes of asking \"do the locations get billing by amount of licenses I purchase or by the amount of devices configured at that location\" the rep finally told me I would have to talk to someone else to build out 5 phones. Completely missed the point, completely useless information, complete waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T00:23:46.000Z",
          "Titre": "Do not use Nextiva if you want good…",
          "Contenu": "Do not use Nextiva if you want good support or reliable service.  If you want to be on hold for hours, and then get to an unhelpful agent who will hang up without solving the problems, and if you want unreliable phone service, then Nextiva is for you.  We have spent several man days (not hours but days) unsuccessfully trying to get Nextiva to resolve the problems.  If Nextiva doesn't correct the problem  today, the next stop is filing suit in the California Superior Court."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anshuman",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T23:39:42.000Z",
          "Titre": "Nextiva games their prospects ...",
          "Contenu": "I signed up for the service based on Sales Rep telling me that a feature exists. The feature was not there; so, I requested that my service be terminated immediately. The Sales Rep went missing in action and entire team started passing my account like hot potato! They created over a half a dozen ticket and took almost two weeks! I had to call the credit card company to block the charge as Nextiva folks were playing games!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Bonn",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T20:19:21.000Z",
          "Titre": "Features simply don't work",
          "Contenu": "Features simply don't work. Constant licensing errors. The support is one of the worst I have ever experienced from any company, with hold times exceeding 1 hour for initial contact. The level of service has been progressively worse. At this point, we will not be renewing our contract."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T18:35:46.000Z",
          "Titre": "Every time and I mean every time I call…",
          "Contenu": "Every time and I mean every time I call with a routing issue or new setup, your techs have to transfer me multiple times as if they don't know they are doing.  I was just told today we have an outside PBX system and they only register the line but we have to configure. I was given a number for \"Enterprise support\" and they still do not know and takes many tries to fix.  I had Nextiva setup 2 new locations and copy how the other locations work and they basicly can only take calls.  No routing of any type, except to voicemail, is setup."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Petty",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T20:39:36.000Z",
          "Titre": "Nextiva talks a good game but cant…",
          "Contenu": "Nextiva talks a good game but cant deliver.  When you try to take your number back they shut off service to the numbers.  They hold the numbers hostage and reject port away requests by renaming your accounts or adjusting the address so there is a mismatch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T18:34:06.000Z",
          "Titre": "How many of these am I going to get",
          "Contenu": "How many of these am I going to get? Please cancel my account and refund my money as promised so that I can block Nextiva from sending me constant emails wanting me to grade their performance, of which you obviously don't take to heart anyway!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Terry",
          "Nb_Reviews": 5,
          "Date": "2023-06-14T21:29:48.000Z",
          "Titre": "There really is NO Customer Service",
          "Contenu": "The instructions I received, that I was suppose to follow, to solve my issue were inadequate.  The tabs I was suppose to access weren't there.  The \"live\" person I chatted with wasn't any help either.  The time to respond to me was long.  Don't bother trying to call in to speak with anyone unless you have hours to waste.  All I was trying to do was change the credit card on file so that Nextiva could get paid.  It was in their interest to help me, but that didn't seem to matter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ishanthie",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T17:46:24.000Z",
          "Titre": "HORRIBLE SERVICE",
          "Contenu": "Your customer service representative never returns the calls.  The porting process sucks and you have taken payments from me and no service yet.  Trying to find a representative to talk to but no luck.  Have been with Nextiva customer care since 9 am this morning for over 4 hours, and still keep getting moved from customer care agen to another and then finally they hang up."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Abdul Qahir",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T19:02:35.000Z",
          "Titre": "Bad service and Ineffective Client support",
          "Contenu": "We have purchased our subscription on 2/14 and to this day we have not been able to use the service we subscribed for. When we call their customer support the best we hear from them is that we need to wait more and the case is assigned to someone from the next tier and once will contact us. Very ineffective way of managing client support. We are forced to switch to another carrier and have bought alternate subscription."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PeterJ",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T09:29:59.000Z",
          "Titre": "Poor support",
          "Contenu": "Poor support, 0 out of 5, lack of effective communication from either tech support or managers.We submitted a request for support and training a few months ago, as well as providing new business requirements, and their project manager was quite unprofessional, replying 1-2 times to emails there and then nothing back.We don't even know how to find out who to contact, don't waste any more money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Juliette",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T21:30:44.000Z",
          "Titre": "Tiffany was super helpful",
          "Contenu": "Tiffany was super helpful. Very organized. Easy to understand and follow. Methodical in her troubleshooting process. This was the 1st time I have had such good experience in the past several years.5/1/23 NEW UPDATE - AWFUL experience with support. 2 hours into call, transferred to Mitchell who asked for my account #. Problem still not resolved. Why is service so inconsistent?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angie D",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T21:47:35.000Z",
          "Titre": "You are a little late",
          "Contenu": "You are a little late.  I no longer have service.  I cancelled my service on 3/17/2023.  I had made MANY attempts to contact customer service regarding the name change as well as other concerns.  Each time I was told it was taken care of, after 45 minutes on the phone with several different Nextiva employees.  I also got unknown \"extra\" charges added on that no one was able to explain.  I cancelled my subscription, went ahead and paid the \"extra\" charges that were actually duplicate charges and left your service on 3/17/2023.  Unfortunately, I will not be recommending this service to any other professionals.I am supposed to referencenick@CR01605211"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danijel Dobrijevic",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T20:20:35.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience. I am trying for over 3 weeks now to port my numbers from them, and they always keep rejecting my new provider, saying that is wrong name on file. I am only account user and I have called Nextiva over 10 times for this matter and every single time they told me it is fixed and than when my ne company call in for port they reject again. This used to be good company, now, I can't wait to be out, if they ever let my phone numbers released. They are playing shady games and I have started recording all of my conversations and saving all of my emails. I would stay away from them for sue going forward."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Atnip",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T18:30:18.000Z",
          "Titre": "Someone at Nextiva is padding their…",
          "Contenu": "Someone at Nextiva is padding their ticket stats. I never closed the ticket or instructed them to. I said I was waiting on the customer to respond if my workaround from last night worked. Nextiva didn’t help with anything. Instead they were only worried about my PIN number which I provided. Total failure."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Billy",
          "Nb_Reviews": 6,
          "Date": "2023-06-07T20:05:49.000Z",
          "Titre": "Joke of a company",
          "Contenu": "They are now trying to have my original review removed from. I had to go to my credit card company lodge an official complaint, file a charge back and cancel my card because this company cannot stop billing you and inter department communication is no where to be found.Because I cant reply to Alex, first comment... You guys wronged me on so many levels. 3 Months it took me, hours of my life and several \"confirmations\" of billing be cancelled and then no refund processing for the 2 charges post confirmation you provided me, that I then sent back to your billing department. I have never experienced such hardship and outright theft by a company. It pathetic I had to result  to charging back and cancelling a card to block you guys from stealing my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T17:52:50.000Z",
          "Titre": "Inconsistent information on chat group…",
          "Contenu": "Inconsistent information on chat group rep and live call reps. And you're not 24/7 support. Porting numbers I was told is whenever I want, it was discussed that it would be after hours so it will not disrupt business hours..  The next day you guys port it during office hours in the morning and the phone lines were down. The rep who assisted to said no the porting dept just port whenever they want and you cannot set up a time. Thanks for lying to make us feel better about the setup. So far the \"easy setup\" has been a disaster."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lionel",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T00:30:09.000Z",
          "Titre": "Fraudulent business practices",
          "Contenu": "Fraudulent business practices - reported to CA Attorney GeneralOrdered the fax service. Worked fine. But when I tried to cancel fell into Nextiva Customer Service Hell. They ignored my cancellation email which was sent timely exactly per their instructions. They billed my card anyway.They will not respond to emails sentIt takes hours to get through on phonelinesThen you get bounced around from one \"department\" to anotherIronic for a \"communications\" company to have such dismal communications.I have reported them for fraudulent business practices and filed a fraud claim with my bank."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "robert ingram",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T04:59:02.000Z",
          "Titre": "I canceled my service 18 days after…",
          "Contenu": "I canceled my service 18 days after starting with Nextiva due to the poor customer service. Requested cancellation via email on 10/17/2022 which they acknowledge. They continue to bill me. Last bill was in December. something is terribly wrong with Nextiva.I moved to Ring Central  which has been a great experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T23:13:56.000Z",
          "Titre": "Absolutely the worst phone experience",
          "Contenu": "Absolutely the worst phone experience! We were constantly dropping calls and lost thousands in sales because of the unreliable service. It was a full time job to be on the phone with Nextiva support to try make the service better. Nothing helped. To make matters worse they won't let you out of your contract despite not keeping their end of the contract - reliable service.If you think this isn't so bad, just remember every time you call for support it will be at least a 45 min call by the time you hold for a representative and then actually try to trouble shoot issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sumyunguy",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T20:57:40.000Z",
          "Titre": "Nextiva Motto : Dead last and fine with that",
          "Contenu": "Nextiva's Software is in the minimum state of development necessary to keep them legally clear of fraud charges.  The app interface looks like a freshman coding project, missing most QOL features consumers of other VOIP services will mistakenly assume are included without even asking. To name a few.   Users cannot block callers.  Users do not have visual voicemail from the app.  Users can not join meetings from the app. Users cannot send or views Faxes from the app. The voice recording and fax features have separate portals both from the basic Voip App and from each other.  Users must maintain 3 browser logins to access the features you would expect from a single web application.   .   In summary, the company is a woke grift that buys very positive reviews from \"reputable\" media like forbes and business.com, tech crunch, etc.  Who boast of the company's  inclusive forward thinking values and business ethics.  Nextiva then uses the assumption of legitimacy these reviews put in the customers minds to hustle them into lengthy 3-5 year contracts."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T00:07:19.000Z",
          "Titre": "Very sneaky company",
          "Contenu": "They make it a very difficult process to cancel the service. And they will keep charging your credit card even after you tell them you wanted to cancel by phone and by email. \"try to cancel\" and you will be passed to several different departments about some BS process... and then they are still charging you... they will tell you that you did not officially sign a Docusign that you wanted to close the account LOL.  Stay away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheri Forbes",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T23:40:08.000Z",
          "Titre": "I am trying to delete the call log…",
          "Contenu": "I am trying to delete the call log whether its on my personal cellphone or computer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Veronica Astashonok",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T19:29:30.000Z",
          "Titre": "Stay away and trust bad reviews",
          "Contenu": "Stay away and trust bad reviews. It never even got to setting up the system because after holding me on the line for a few hours they ended up telling me to call another day because the technical support couldn’t help. Before signing an agreement they will be very nice and tell you that you can “cancel any time with no fees”, but reality is that you are responsible for the whole contract. I’ve been in business for 8 years and Nextuve is the most awful company I’ve encountered during these years."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T06:40:09.000Z",
          "Titre": "Evil, Incompetent or Lazy? Is this a company you want setting up your phone system",
          "Contenu": "I have attempted multiple times over the last year to cancel a simple personal fax account. I have been told innumerable times, including by an \"escalation representative\" that the cancellation is in process.  This is an operation that should take fewer than 5 minutes. Frankly, it should be instantaneous -- they should provide a cancel button in their interface.The only viable explanations for this behavior are:1. Evil. They are trying to continue to charge my credit card2. Rank incompetence. They have no one who can handle the rudimentary technical task.3. Laziness. They're making promises that they just aren't interested in keeping.If they can't handle cancelling a simple personal account, do you want them in charge of your phone system?BTW -- Ignore the response from Nextiva below. They are trying to cover their tracks. They have not, nor will they ever actually do anything about this issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tara",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T18:14:44.000Z",
          "Titre": "We have lost business",
          "Contenu": "We have lost business, and therefore money, due to 2 separate issues with Nextiva service- one of which, MISSING VOICEMAILS, has yet to be resolved. Never should have transferred service to this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Webb",
          "Nb_Reviews": 4,
          "Date": "2022-03-16T01:07:00.000Z",
          "Titre": "Unreliable service even worse customer support.",
          "Contenu": "Service is complete garbage that does not work. It drops more calls than it successfully completes and is the most unreliable phone service I’ve ever seen. The funny part is their customer service is even worse. No way to truly escalate and no way to keep talking to same tech. I’ve spent literally over 40 hours with their inept support team and they still can’t get the service to be half way reliable. I never had these issues with vonage or 8x8. Nextiva tech just doesn’t work. Right now I’m being contacted by some 3rd party support group that Nextiva has hired to try and fix their bad situation. Only problem is this team is even more incapable.Run away and never look back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darbi Michel Bodie",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T20:00:04.000Z",
          "Titre": "Nextiva has the worst customer service. I don't recommend.",
          "Contenu": "I was with Nextiva for over 2 years and noticed my service fees had increased. Since I was on a monthly plan, I submitted a support ticket to get my fees reduced with an annual plan. I submitted the ticket in early November 2022 and after call wait times of over an hour, fake returned calls, and several emails, it took over a month to get someone on the phone to help me. The representative walked me through my rate adjustment but when it came time to update my contract, she said she would call me back. She never did and I was charged another month at the high rate. Nextiva ended up closing my support ticket and closed any new tickets I submitted related to my fee decrease. I ended up signing up with 8x8. I don't recommend Nextiva."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JJ",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T17:44:09.000Z",
          "Titre": "Awful Awful Awful...",
          "Contenu": "Awful Awful Awful.... Annoying sales that called multiple times a day pressuring you to use their amazing service. THEN NO SUPPORT to setup or when trying to setup yourself and you cant get it setup because it is confusing, they put you on hold for hours (even though Teaser said less than minute wait times). AND when you call and email the sales man (Teaser Sweeney) who called you multiple times and emailed you multiple times in a day, ignores you. Never got it set up after two weeks of trying. AND still need to get it canceled but no one is there to support you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jazmin",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T01:01:54.000Z",
          "Titre": "There was not enough guidance on…",
          "Contenu": "There was not enough guidance on following steps to take. A better hand off would have made us feel like this was the right decision for us. Has taken a lot of admin time to train on own and research on own time to ensure this is smooth. We are a high volume medical clinic that depends a lot on the phone lines. There hasn't been check in's if we are doing it correctly or anything on that end. If this was a self set up service it should have been mentioned since the beginning. We don't have the staff or time to have done this at this time and would have gone with a company that does offer better support on that end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Candice Widuch Mert",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T19:45:28.000Z",
          "Titre": "FAX AGENT ISSUE",
          "Contenu": "The fax issue keeps happening and it's not getting fixed.  We are a medical office and need our fax machine.  We have been without it for 2 days now.  I keep contacting support, they remote, at my suggestion and go in and fix it, then later it goes out again and we have to go through the whole process again and it is a lot of wasted time on our end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:38:09.000Z",
          "Titre": "no solution the problem after spending…",
          "Contenu": "no solution the problem after spending hour on the phone.   incompetency is the biggest issue at nextiva. not sure how this co received high rate reviews.  it has been a nightmare setting the system. it is not a plug and play.  i have spent over 20 hours on the phone.  takes about 45 minutes avg to get hold of support.  Do not recommend it unless you like listening to classic music for an hour."
        },
        {
          "Note": 1,
          "Lieu": "VC",
          "Pseudo": "Srinath",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T20:28:23.000Z",
          "Titre": "Poor Sales to Implementation Transition",
          "Contenu": "Account Rep did not schedule the onboarding as needed. Missed critical deadlinesOnboarding Rep rushed through the configuration. Post implementation had issues. Contacted Tech Support. Tech support mentioned about some requirements that should have been done during onboarding.Tech support was not knowledgeable of the technology. Felt like he was reading scripts.Just an overall bad experience"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerard Finegan",
          "Nb_Reviews": 2,
          "Date": "2022-09-15T22:17:40.000Z",
          "Titre": "Make it impossible to switch plans or cancel service... go elsewhere",
          "Contenu": "Tried to reduce the amount of service lines when we had to cut back on staff size during the pandemic, and they told me that was only possible if I extend my plan.  Tried to cancel multiple times, but they make it very difficult. Finally getting rid of Nextiva service today after wasting thousands of dollars due to their poor customer support, and couldn't be happier to get with a new provider."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Diane",
          "Nb_Reviews": 3,
          "Date": "2022-01-26T23:27:03.000Z",
          "Titre": "What a nightmare",
          "Contenu": "What a nightmare. You can't get out of the contract, support is terrible, and nothing ever works well. Believe all of the bad reviews and run far away from this company. They are masters at marketing and a horror show at technology and service. It's all broken promises."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Ladner",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T19:02:02.000Z",
          "Titre": "I have been with Nextiva for 4+ years",
          "Contenu": "I have been with Nextiva for 4+ years.  We recently were bought out by a new company so I had to make changes to my plan.  The process to make these changes were convaluted and clunky.  After many hours invested I finally got everything moved and set up only to find that they failed to port a Fax number.  They have admitted their error but basically refuse to fix it.  I have spent hours on the phone.  I have sent 20 plus emails.  I have asked to speak with managers.  I have called the original sales people.  Nothing.  I HIGHLY recommend anyone looking for a phone service look elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nithin Reddy",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T00:16:51.000Z",
          "Titre": "This company refuses to accept cancellation of service.",
          "Contenu": "This company refuses to accept cancellation of service. They have literally charged my for more than one year of reoccurring charges without my consent, with an **expired credit card** and a \"null\" address for me in their own invoices.Recently, showing them the years old cancellation request email chain where they acknowledge receipt years ago, they change the goalpost and say they need extra information for cancellation as a poor attempt to salvage their mess up as they didn't ask for that extra information in that years old email. And they still refuse to cancel the service to this day. Completely unacceptable conduct for company. Literally in 20+ years never had any company be this bad with cancelling a service. Unacceptable. Stay away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "GNGTNT",
          "Nb_Reviews": 4,
          "Date": "2022-05-24T03:43:22.000Z",
          "Titre": "Absolutely TERRIBLE customer service…",
          "Contenu": "Absolutely TERRIBLE customer service and phone policies. They only allow you to use one of a few VERY OVERPRICED phones with their service. Then when I called about it because it broke after just a few weeks I was lied to and told since they couldn't provide a phone that worked (the expensive one they sold me broke right away) they would allow me out of the contract. Once I signed up with a new company they charged me for the rest of the contract anyway even after telling me they would allow me out of the contract! They are DISHONEST CREEPS who can't get honest business so they overcharge anyone who did sign up with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amee Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T18:15:26.000Z",
          "Titre": "Lack of support",
          "Contenu": "It is difficult to speak to a representative that can identify issues and resolve them  We have experienced issues where we cannot hear the customer, calls dropping and dashboard showing missed calls, when the phone did not ring.  The same issue occurs for remote employees as well as office employees but the Nextiva support states it is our router.  If so, why would remote employees experience the same issue?  I also use a daily talk time report that shows total inbound and outbound calls with total talk time from analytics.  This does not match what my CSR shows on their dashboard, but I cannot find a Nextiva support person to identify the discrepancies."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jen Mallett",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T18:35:16.000Z",
          "Titre": "Stay Away - Go to Aicall or somewhere else",
          "Contenu": "Have been a Nextiva for over two years.  I put a request in to port my nuymber to a different carrier as the Nextiva interface is lacking and I found a better interface at less cost.  A sign of a good company is how they treat you when you are leaving.  They shut down my 1-800 number without notifying me and left all my clients and business hanging.  They are impossible to get a hold of to rectify it.  They have collected over 4,000 from me in the last two years and have screwed my company over.  We have paid for this month and I want a full refund.   Stay away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blaine",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T22:08:35.000Z",
          "Titre": "zero help with what was needed",
          "Contenu": "I'm not sure your customer support know how to make changes to the schedule. Again, I can for help creating an out of office event for another holiday and it does not work..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Sawtelle",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T13:57:03.000Z",
          "Titre": "Difficulties Canceling Account",
          "Contenu": "The Nextiva service was not a good fit for our business - we simply need a phone solution that works without constantly trying to troubleshoot.  As a result, we sent an account cancelation request via email (per Nextiva instructions) on December 20, 2022.  Nextiva sent an email response indicating a case had been opened (\"Your Case has been received and a member of our staff will review it and reply accordingly.\")  The Case # is 01536843.  Despite several follow up phone calls where I end up being put on hold indefinitely waiting to speak to someone in \"Customer Relations\" and emails, there has been no response or acknowledgement our account has been closed.  Canceling service should not be this difficult - this is terrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T19:56:10.000Z",
          "Titre": "Would not recommend this company",
          "Contenu": "We have been dealing with the same issue since we got Nextiva where we switch our phones to an office meeting notice once a month but the phones still ring. It took a month for someone who knew what they were doing to call me and get this resolved. The supervisors WILL NOT call to help, they will only email and it causes more confusion and frustration because they repeatedly ask the same questions. The support member who helped me at the end was very helpful but every other person I interacted with up until then was not helpful at all. I would also note that the contracts between users and Nextiva need to be combed over (and make sure you open EVERY single hyperlink in the document) because you have to make sure and give plenty of notice to cancel service before your autorenewal date comes or you will be stuck with them for another term of their choosing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Snowflake Limousine",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T17:08:58.000Z",
          "Titre": "We are a small business and need an…",
          "Contenu": "We are a small business and need an additional number on 2 cell phones to run our business. We were in need of an upgrade from Grashopper and the Nextiva Sales Agent promised us a service that simply dosent work. I paid for a year via a contract, upfront for 3 lines eventhough I only need to connect 2 devices via the app. The 3rd line was to give both cell phones TXT capability. I cant even receive phone calls let alone the ability to txt out. I have spent hours of time on hold waiting for \"customer\" service. I thought this would be an upgrade from Grasshopper and it certainly is not. I will be holding them accountable for not upholding their end of the deal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T19:26:23.000Z",
          "Titre": "RUN away. Manipulative and lacking compassion and simple human decency.",
          "Contenu": "Not sure where to start, this company was so kind and believable at first, they made us think we would be in a trial period. Within the first week we decided not to use the service as it wasn't quite the right fit, they refused to cancel the contract without a huge payment, and are now charging us monthly and we are not even using their service. Absolutely the worst, most manipulative experience I have had in my business dealings to date, with 3 different businesses that have a large call volume. They refuse, even now after we were very human with them, to budge at all. They continue to take our money and we are not even using their service. This company actually disgusts me and has no compassion for the human experience. I will adjust this review if they decide to rethink their treatment of us. I am happy to show all emails backing this up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eli Feig",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T00:00:30.000Z",
          "Titre": "Inconsistent Billing and Poor Customer Support - 1 Star",
          "Contenu": "I have been dealing with Nextiva's phone service for a while now, and my experience has been highly frustrating. The issues began with the billing, as every month we were presented with a different amount, often higher than what we were expecting. Even after canceling half of our lines, we continued to be billed for them for 12 months.Attempts to resolve these problems were met with extended wait times and inadequate support. Whether through phone or chat, reaching customer service became an ordeal, often resulting in waits of over an hour.These experiences have culminated in a severe lack of trust and satisfaction with Nextiva. Inconsistencies in billing and the difficulties in reaching customer support have made our relationship with this company unsustainable.I urge potential customers to consider these issues carefully and explore other options before committing to Nextiva's services. The lack of transparency and support has made our experience with them one to avoid."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T19:57:49.000Z",
          "Titre": "Many issues has been reported over time…",
          "Contenu": "Many issues has been reported over time and no resolution yet. Cannot get into Smart Topics, cannot make a system to send emails automatically, emails sent from CRM sometimes are not received by other party. Customer Service rep disconected remote session and phone call without any resolution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T21:10:48.000Z",
          "Titre": "onboarding was quite awkward and…",
          "Contenu": "onboarding was quite awkward and certainly incomplete. Slava did not know how to choose the numbers, and made me wait for hours before he figured out that the numbers are pretty much unavailable. Not sure if that's so. He did not clearly explain how to receive and send faxes in the app and online. What I understood there is an email I have to send the document that I intend to fax(?). Quite unusual. I am not sure he even gave me that email address to send documents to be faxed, let alone explaining sending and receiving settings. On top of all of this, I learned that texting was not even included in my plan, although Leif Pilegaard promised to match Ring Central rate for the service, which includes essentials: unlimited call, text & fax (and more, such as video conf., internal messaging, etc.). But, here we go! Promises are not kept in case of Nextiva's team, I guess. On top of that, I learned that Nextiva's app is quite incomplete/unfinished and still under development. Not a nice introduction. I thought it was similar to Ring Central. I need to share this kind of experience... Well, I am eating"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adam Korngold",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T03:29:33.000Z",
          "Titre": "Terrible new customer experience",
          "Contenu": "My go live with Nextiva has been an absolute disaster.  The Amazing support team is anything but... I spent 6 hours today on the phone with 15 different employees.  I was hung up on twice (I assume this was by accident).  I also asked to speak with a manger 8 times, and was always told that none was available and that one couldnt call me back.Things to improve:1. Terrible Onboarding ExperienceI was promised an onboarding department to assist with new accounts.  I called a few days ago and a customer set up one phone.  We decided together that once my number was ported (today) I could call her department back to configure the other phones.  Today I was told by multiple people that they did not receive permission to transfer me to the onboarding department, even though I hadn't started using my account, because the agent a few days ago closed the ticket.  2. No one takes ownershipI was transferred a dozen times between the hardware and configuration department.  Apparently the phone configuration agents do not understand the hardware and the hardware agents do not understand configuration??  The first thought anyone has is to transfer and make my problem someone else's problem.3. Sales staff overpromisesWhen I spoke with Walter last week, he promised that you pride yourself on excellent customer service.   He told me he worked for the company multiple years and the company has great support. After speaking with 15 people I contacted Walter, who was a. Unable (unwilling) to escalate my case, b. unwilling to have a manager call me back and c. unwilling to reassign my to the onboarding department. 4. Not able to speak with a managerI asked 10 times today to speak with a manager or receive a callback.  All managers were busy.5. Upper management doesn't care.  I escalated my issues to upper management, who have yet to respond to my request to have a support manager call me back.  Its not surprising that upper management doesn't care, since their bad attitude and lack of response shows through all levels of their customer service.I want someone who is knowledgeable about the entire system to call me tomorrow (Friday) so I can finish setup."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack  Iyer",
          "Nb_Reviews": 3,
          "Date": "2023-03-12T02:13:07.000Z",
          "Titre": "Nextiva Stole my money",
          "Contenu": "The worst experience. After the contract was signed, they were going to help me download the software and set up the system for use. They charged me for a year and inspite of asking to cancel immediately they kept charging me. It took them over a year to finally cancel and they said they could only refund the last month. Absolute theives is what I think they are. They knew they did not provide me a penny's worth of service but still kept my money they charged for over a year. KEEP AWAY FROM THIS COMPANY AND SAVE YOUR MONEY!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Huizenga",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T23:40:52.000Z",
          "Titre": "Did not address the issue and closed…",
          "Contenu": "Did not address the issue and closed the ticket. Terrible service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric K.",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T19:08:45.000Z",
          "Titre": "This company sucks!!",
          "Contenu": "This company sucks!!! They take hours with you on the phone to fix a problem. When you call, they keep you on hold for hours while your phone service is down and missing potential client calls.PS: I just received the obligatory apology email from this company. I call B%$# Sh&%! Try getting through to this person???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Habourside Communications",
          "Nb_Reviews": 4,
          "Date": "2022-11-21T17:49:18.000Z",
          "Titre": "Couldn't be worse",
          "Contenu": "Couldn't be worse. I signed up on 10/26 after meeting with a Rep and clearly discussing our needs. To the point where I showed him our phone system and he said \"NO PROBLEM it will do the same.\" Big problem, 6 day's in and hours with tech support, I said this doesn't work and I need to cancel on 11/2. Today 11/21 I still have gotten Zero communications. I call in and am told I need to trouble shoot again with support after already spending HOURS with them and they can't refund. Nightmare of an experience and now I am out money because I was mislead. Not to mention I am inside the 30 money back guarentee. DON'T USE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trusted Water Systems",
          "Nb_Reviews": 2,
          "Date": "2022-10-29T03:36:01.000Z",
          "Titre": "Absolutely DO NOT sign up!!!",
          "Contenu": "Absolutely DO NOT sign up with this company. Read all these reviews!! I signed up, been trying to get it set up for over a month, I can’t port my business phone number so I’m unable to use the service, and now they tell me I can’t cancel unless I pay almost $300. GIVE ME A REFUND YOU SCAMERS!! Hopefully you are reading this before you’ve signed up if you aren’t then you are here to add your one star review to the pile. Booooooo Nextiva!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T18:44:43.000Z",
          "Titre": "Do not use this company",
          "Contenu": "Do not use this company! Or at least DO NOT ENTER A CONTRACT! You will be stuck with a terrible, difficult to use phone system that has many issues including terrible sound, echoes and glitches. The customer service was almost ok, but who wants to be on the phone every other week for another problem?? IT'S A PHONE! How difficult does it have to be? I have other things to worry about. And (the worst part) GOOD LUCK SWITCHING BACK!! GOOD LUCK- I ended up paying off Nextiva for the rest of the year just to switch back- I wish I would have read THESE reviews and not the fake ones on other websites before switching :("
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ratan Baid",
          "Nb_Reviews": 4,
          "Date": "2023-05-13T01:13:27.000Z",
          "Titre": "The customerservice of Nextiva is…",
          "Contenu": "The customerservice of Nextiva is dishonest. Zero services provided by them and kept on charging my card. They could never build the product they promised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darlene",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T17:44:50.000Z",
          "Titre": "I waited over 40 minutes to have an…",
          "Contenu": "I waited over 40 minutes to have an online chat with a Nextiva representative.  The rep tried to help but didn't seem to know enough or understand enough to help me.  I asked chat rep if I could speak with someone on the telephone.  I was given a phone number which I called.  I waited over an hour for someone at Nextiva to help me on the phone.  I hung up in frustration.  This is NOT good customer service.  If I have any pull at my Firm, we will NOT be using Nextiva for future needs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kashif Iqbal",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T21:41:45.000Z",
          "Titre": "Bad Service",
          "Contenu": "First of all, their customer support is an absolute joke. It's as if they go out of their way to be unhelpful and rude. Every time I called in with an issue, I was met with condescending tones and clueless representatives who seemed to have no idea how to resolve anything. It's almost impressive how consistently terrible their support is.But wait, it gets worse. Hidden charges seem to be Nextiva's favorite game to play. Just when you think you've signed up for a reasonable plan, they hit you with surprise fees that would make your head spin. It's like they have a secret menu of charges they unveil just to mess with you. If you're lucky, you might find out about these charges buried in the fine print of their terms and conditions, but good luck deciphering that labyrinth of deceit.Nextiva's penchant for hidden charges is just the tip of the iceberg. Their overall service is a mess of glitches, dropped calls, and outages. It's like they took a time machine back to the 1990s and decided to provide us with the technology of yesteryears. And don't even get me started on their outdated user interface – it's like navigating a maze designed by someone who's never used a computer before.In conclusion, I can't stress this enough – do not waste your time, money, or sanity on Nextiva. Their customer support is a masterclass in how not to treat customers, their hidden charges will drain your wallet faster than you can say \"scam,\" and their service is a technological disaster. Save yourself the headache and look elsewhere for a reliable and honest business communications provider. Nextiva is a sinking ship, and you don't want to be on board when it goes under."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A L",
          "Nb_Reviews": 4,
          "Date": "2023-04-25T21:39:25.000Z",
          "Titre": "RUN!",
          "Contenu": "RUN! This company is a SCAMMER!! Did their free trial and none of the functions worked, even after I sat on the phone with three different members from their technical support for TWO HOURS and they couldn’t help me. The very next day I said cancel the trial I will not be moving forward because this company is clearly incompetent. They say on the phone with me and told me the account was canceled. Then one week later they charged me $40!!  I called for three days in a row and every teamMember gave me the run around lying and saying it was cancelled and it wasn’t!! I’m still sitting on the phone with them trying to get proof that it’s cancelled and and proof of a refund. They are SCAMMERS!! Take your money and time elsewhere!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Petty",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T01:13:18.000Z",
          "Titre": "Good luck ever closing an account with…",
          "Contenu": "UPDATE:  Less then 12 hours after this review I got a cancellation email.  Was that so difficult? Shouldn’t take this to do the right thing.  Good luck ever closing an account with them.  5 times now I have tried to get them to close the account and they do nothing but keep charging my Credit Card."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Beth Yang",
          "Nb_Reviews": 4,
          "Date": "2022-08-04T20:21:56.000Z",
          "Titre": "When I first went to Nextiva",
          "Contenu": "When I first went to Nextiva, they told me that I can text on my computer to cell phone numbers which is a LIE. Their calling features are quite cumbersome and not smart at all. If you enter a phone number with a 1 in front of it, it will not go through- it's not smart enough like cell phones to fix this itself. Also, the company locks you into a 18 month contract subpar service. Their customer service takes 30 minutes to pick up your call to tell you that someone will return your call with your issue and if you don't pick up the phone exactly when they call you, they will cancel your request and you have to submit a new request for whatever issue you have. They are quick to close ticket and slow to respond to them. I'd give NEXTIVA negative stars if I could. STEER CLEAR OF THIS COMPANY - use 8x8 instead"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T17:49:58.000Z",
          "Titre": "Nextiva Chat on Fax",
          "Contenu": "They were able to answer something related to the account but not help get me in contact with someone to fix it and I was waiting for 20 minutes or more to get ahold of someone on the chat."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T09:05:13.000Z",
          "Titre": "TRYING TO CANCEL SINCE OCTOBER 2022",
          "Contenu": "\" Nextiva was built on the idea that all businesses deserve better\".....That is what you hear while you are on hold, I should know because I was on hold 1 hour, 35 minutes and 27 seconds before I was hung up...FOR THE SECOND TIME TODAY!  We have been trying to cancel this service since October 2022. Finally, Joshua, made some headway in getting this service canceled. He emailed me the cancelation form, via docusign, for me to sign and make our final payment, which is paying for the \"free phones\" they sent us.  After I put in our credit card information and signed the documents, the screen said THANK YOU and went blank.  He assured me that I would receive a conformation email shortly...we sat on the phone together for several minutes, he placed me on another hold, only to hang up on me.  Everything about Nextiva is BULLCRAP!  If I could give a \"0\" review, you bet I would.   I know Nextiva is going to reply to this review telling me how sorry they are and all that crap, and to email them at reviews at nextiva.com.  Only to get nothing back in response, this isn't my first rodeo with this company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allan",
          "Nb_Reviews": 5,
          "Date": "2023-11-18T22:10:43.000Z",
          "Titre": "Still waiting on my service request to…",
          "Contenu": "Still waiting on my service request to be completed. I asked a simple task to change my billing plan, case is set up but not resolved as of now. It’s been 3 days"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jorge Camacho",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:48:29.000Z",
          "Titre": "I just signed up for service and…",
          "Contenu": "I just signed up for service and Nextiva One is not working and I can't log into my account."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Phillip Pence",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T15:47:55.000Z",
          "Titre": "What a difficult time I had",
          "Contenu": "What a difficult time I had. Procedures and policies are very difficult to navigate. Even the chet had a difficult finding my account. Needs work for sure."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Larry",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T05:37:37.000Z",
          "Titre": "I’ve been a customer of Nextiva since…",
          "Contenu": "I’ve been a customer of Nextiva since 2009. They used to be a great company, super service, reliable support, etc. Three month ago I switch for their legacy Pactosis system to their lastest Nextiva One system, based upon what I perceived were more feature and better pricing that met my needs. The problem is their customer service has declined to what I consider TERRIBLE. They market their services as awesome but don’t believe a word of it. Their app on IOS for an iPhone or iPad does not work properly and it will not indicate when calls are inbound. It worked fine on my desk phone or on my Mac but not on the phone or iPad. I spent four hours on the phone over several days with their app team and got switched from person to person and then finally got someone that indicated this was a know problem that many customers were having.  You would think that everyone in the company would know this and not waste their customers time. I even email Tomas Gorny, their CEO and not even the courtesy of a response or anyone from his team reaching out. Ultimately my sales person got this escalated and I was assigned a escalation manager who acknowledged their problem and told me it should be resolved over two months ago and that he would keep me informed of their progress. Never received an email or call from him again. If i treated my customers this way I would expect to be fired! Don’t believe their marketing and don’t waste your time. I wish their customer support was what they used to have."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Masea Lok",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:54:44.000Z",
          "Titre": "Technically support take 2 weeks just…",
          "Contenu": "Technically support take 2 weeks just transfer phone number."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T12:49:40.000Z",
          "Titre": "Issue after issue",
          "Contenu": "Issue after issue. The sales experience started off good but it took over a month to get replacement phones for our new office, due to an error caused by Nextiva. During that time communication and customer service was very poor and unorganized. I would not recommend Nextiva."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "A Cherry",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T17:01:03.000Z",
          "Titre": "Instability",
          "Contenu": "Instability.  Our licenses got \"lost\" and overall we're really not having a great experience rolling out advanced features.  It feels like there are 1000 great features Nextiva offers, but for some reason, they aren't available unless we contact support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T14:37:25.000Z",
          "Titre": "It was an ok service",
          "Contenu": "It was an ok service, but we aren't allowed to do much on our own.  Every time we needed to forward phones, it was a process.  We have now been trying to close our account for a week because that particular office is closing, but we can't get Nextiva to answer phone, chat, email....nothing!  That is why they are only getting 2 stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "King",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T15:41:56.000Z",
          "Titre": "Clunky Nextiva",
          "Contenu": "First, customer service agents were friendly and professional. No complaints there. That being said, Nextiva needs to get their systems and act together. Needed to change the credit card info on file for our account. I should be able to do this online. However, our dashboard is missing the key 'billing' link. That in itself is ridiculous. I called customer service. I talked with four different people, because each person I spoke with could not fix the problem and had to transfer me to someone else. They said that since we were an \"old\" customer, our dashboard was not up-to-date. Seriously? You can't get existing customers updated with the latest systems? I was told they would send me a link that would take me directly to the billing portal where I could change our information. Waited forever with each person, only to be told their system was having problems. Long & short - on the phone with them for and hour and a half and still did not get the problem resolved. I hate doing business with companies that make it difficult to give them money. Time to find a new phone provider."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Teresa",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T20:47:16.000Z",
          "Titre": "We could not print out our invoice",
          "Contenu": "We could not print out our invoice. I chatted and was emailed a linked to update my credit card.Still could not print invoice. Called waited 30 minutes, was transfer asked to wait another 5-10 minutes to fix. I asked to just have my invoiced emailed and he did email it. Customer service the second time was fine, wait time was rediculous."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rivka",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T19:26:24.000Z",
          "Titre": "Customer service takes a long time to…",
          "Contenu": "Customer service takes a long time to get in touch with +> Hour, once connected the person then will read from scipt,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 10,
          "Date": "2022-01-10T21:26:27.000Z",
          "Titre": "Sales staff not in sync with customer…",
          "Contenu": "Sales staff not in sync with customer service, back office and tech support.  Sales staff will say anything to get your business.  Problem is back office isn't on the same page."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:37:40.000Z",
          "Titre": "Physical phone not receiving calls",
          "Contenu": "We had a user who's physical phone could not receive calls. It took 3 hours to get it to work but, the desktop App is now not working. I called back again for desktop support another hour and it was fixed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T18:32:32.000Z",
          "Titre": "No personalized setup or assigned rep…",
          "Contenu": "No personalized setup or assigned rep to help assist.  They do a quick overview and tell you to do the rest yourself."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T17:35:57.000Z",
          "Titre": "Having problems receiving calls after…",
          "Contenu": "Having problems receiving calls after making changes to call flow. Problem not resolved."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T03:02:38.000Z",
          "Titre": "customer response to our calls went an…answered",
          "Contenu": "customer response to our calls went an answered"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chis",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T03:48:53.000Z",
          "Titre": "The sales rep told me when I signed up. That their customer support was much better then the competitor",
          "Contenu": "The sales rep told me when I signed up, that he would be my personal customer support for the first 90 days, he messaged me almost everyday, until I signed up, then after I signed up, sometimes it would take days to get a response, and I was never able to reach him by phone, I had to call customer service myself, to try and resolve a lot of issues, of which it takes being on hold for 30 minutes to reach anyone, and always seems to be a language barrier, I hope it gets better, but it hasn't yet, we have had a lot of connection problems with the app, so I'm not sure we will continue with them, if it doesn't get better."
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T22:11:28.000Z",
          "Titre": "the chat was fine but waiting times on…",
          "Contenu": "the chat was fine but waiting times on calls is forever"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Klein",
          "Nb_Reviews": 1,
          "Date": "2020-08-17T16:42:06.000Z",
          "Titre": "Terrible Tech Support and Equipment",
          "Contenu": "I don't know how this company obtained favorable reviews, but the service this company provides is awful!!! On average, I spend about 3 hours on the phone with customer tech support. Although the cost for phone service is low, the savings does not justify the time lost with incompetent techs. I am stuck in a 3 year contract with this terrible company. caveat emptor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 3,
          "Date": "2019-10-24T18:23:16.000Z",
          "Titre": "I am a 8 year customer of Nextiva constant tech support issues.",
          "Contenu": "I am a 8 year customer of Nextiva.  Overall the feature list is very comprehensive as well as having a good pricing structure.  The problem in my opinion is poor reliability and support.  Almost without exception my tech support call is more than 60 minutes and usually requires multiple calls to fix somewhat easy problems.  For example, phone extension configurations not maintaining their settings.  Also tech support is handles out of the Ukraine which can be a problem when explaining the problem and or getting issues resolved.  I suspect that is why I am tied up on the phone for 1-2 hours trying to resolve problems."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Shawn L",
          "Nb_Reviews": 1,
          "Date": "2019-12-20T18:26:45.000Z",
          "Titre": "Michael was great.He was tremendous in…",
          "Contenu": "Michael was great.He was tremendous in solving proplem. The 2 Stars are for Company not Michael. I spent 2 hours on 12/19 to solve not getting all of my customers' incoming calls for 3 months. I merged 2 offices with multiple numbers and only partial message receipts from the Company. I discovered over 100 back messages in a call group of which I was unaware. When my account was set up 09/01/19, I should have been provided the email backup/extra step which Michael provided today. I lost 10 customers and $7000.00 in revenue since the poor and inadequate initial setup of my account, in addition to multiple calls and time to reach a solution."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Raphael",
          "Nb_Reviews": 14,
          "Date": "2020-08-27T21:13:10.000Z",
          "Titre": "Very poor.",
          "Contenu": "Very poor.Software full of bugs and staff don't know what they're saying.To their credit, cancellation was easy with no nagging which is why they don't get 1 star."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly Jones",
          "Nb_Reviews": 2,
          "Date": "2019-11-19T22:17:06.000Z",
          "Titre": "Nextiva review",
          "Contenu": "We've been with Nextiva for years and within the past year they lost ownership of 3 of our phone lines and we had to get new numbers and redo all of our marketing materials which is super expensive.  No refunds, no customer service, horrible experience.  RUN FAST, anyone is better than Nextiva.Wow, so Nextiva responds quickly to reviews but not to customer service requests, how fitting!  Just confirms how bad they are at dealing with actual issues.  And you can't find my account?  Good Grief!  That's just a joke.  My account has been with the same email I used for this review.  Quit the lies Nextiva.I've also filed with Better Busines Buruea.  Anyone interested in Nextiva should check out how many claims are against nextiva with BBB.UPDATED Nov 2019 - Nextiva did give me a refund for the hassle I had to endure."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roland Durocher",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T15:47:49.000Z",
          "Titre": "STAY FAR AWAY IF YOU NEED PHONES FOR WORK",
          "Contenu": "Nextiva sales make the system sound great.  Once they make the promises and get the billing set up, sales will not return a call and rarely responds to email. Once set up with plan, phones were shipped to us and we were told just hook them up and we will be fine.  Being a small professional office, we do not have dedicated IT, or time to mess with that.  It took weeks to get installation added, at additional cost.  Their \"installation\" was a fraud.  After more delays, we were finally told they could not find anyone, so we were back to square one.  Once we got all the phones hooked up, we had myriad glitches--like our night attendant not working, our passwords needing constant reset, etc.  Now our contacts are a black hole.  Still cannot get refund for installation charges, or even the first two months of \"service\" where we never made a call."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jace",
          "Nb_Reviews": 3,
          "Date": "2020-05-28T23:15:02.000Z",
          "Titre": "Anticipating the annual renewal",
          "Contenu": "Anticipating the annual renewal, I telephoned Customer Service 3 days before my renewal kicked in and discovered their deliberate attempt to make cancellations hard.  My first call, I was told I must speak with a special department that handles this and they are CLOSED.  My 2nd call I waited 40 minutes to get to general Customer Service, only to be told, the department I need to speak with is VERY busy (Naturally, as everyone else is trying to cancel).  They suggest I leave my # and I will get a call back.  Of course 48 hours later, NO call back.  My 3rd call again a long wait to get to Customer Service and told the special team that I need to speak with has an extended wait time, but I am free to wait.  I waited 40 more minutes and after a grilling interview of WHY I WANTED TO CANCEL, I was told that my \"request will be submitted\".  Their deliberate ploy to make it difficult to cancel has been duly noted and I will go to great lengths to make sure this negative review is posted everywhere on social media.  SHAME ON YOU NEXTIVA."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nate M.",
          "Nb_Reviews": 20,
          "Date": "2020-12-22T08:58:56.000Z",
          "Titre": "Very Disappointing",
          "Contenu": "I left Google Voice to be 'saved' by Nextiva. This is because Nextiva has a lot more features. But I'm not pleased with Nextiva either. I don't know why people boast about their support. Nextiva support lacks tremendously. Good support doesn't entail a support phone number. Good support entails proper setup, proper comprehension and getting things done right the first time. Their sales department is flawless. But as soon as you pay for services, you realize that you are kind of on your own. It takes forever to port numbers out. You have to create tickets and reach out to support for every part of the setup, it's simply not seamless or white glove to any degree. There's nothing cohesive about the company. It's like you need to deal with a whole new platform for each feature. Like SMS, recording voicemail, etc. They have a LONG way to go for their platform to be adequate. NOTICE! Their mobile app is complete garbage. You CANNOT run your business through their mobile app. It works 1/4 of the time and has list of bugs from NY to Mexico. It's mind blowing that they onboard customers to an app so deficient. Do they not understand that phone calls are an integral part of running a business? Anyway, so much more to say, but I need to go. I'm switching providers yet again and I'm not even one month in. Horrible experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Debbie Allen",
          "Nb_Reviews": 1,
          "Date": "2020-03-10T13:27:58.000Z",
          "Titre": "Amazing service?",
          "Contenu": "I've been with Nextiva for about 2 years now and initially they were great. Customer service and the support team was very responsive when we called in and resolved any issues we had quickly. When our company started growing and began adding extensions we opted to transition from a month to month plan to a 3 year contract so that we could receive discounted pricing. Nearly a month and a half later Nextiva has not transitioned us to the contract and we are paying nearly $100.00 more per month because of it. We've called to follow up on our request at least 8 times and each time we're told someone will call us back to take care of the request and that our ticket has been escalated to a manager but yet no manager calls back. This makes me question the integrity of this company and it's advertising. The \"Amazing service\" they coin themselves on leaves much to be desired. Will be looking for another service provider who can stand behind their customers.UPDATE 3/10/20: It's been over 2 weeks since I wrote this review and wanted to provide an update. I did receive a message and email from one of the managers at Nextiva however response time back was slow (days) and resulted in no resolution. Emails back and forth asking if a contract was sent to me and then no response and no contract. Tier 1 support is much better than those that supervise them at this company. Unfortunately, Tier 1 support doesn't have the authority to implement contracts. Something is seriously not right here. Do your research and select your phone provider wisely."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lachrisha Walker",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T19:27:24.000Z",
          "Titre": "We do appreciate the quick responses",
          "Contenu": "We do appreciate the quick responses. Anytime I leave a message I get a call back that day. We disliked the lack of knowledge that the phones needed WIFI adaptors, sold separately for them to work. We've had the phones for over a month not able to use them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marilyn Solsky",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T15:40:26.000Z",
          "Titre": "Horrible customer service.",
          "Contenu": "Horrible customer service.Although they have a Scotsdale, AZ address they work out of Central Europe.The turn around time for problem solving is about 48 hours.I am trying to get a simple log in password changed and it has been a nightmare that has now spanned almost 5 weeks!Addendum:  after I posted this review and received the response from Alex I did get the issue resolved.  However, it still did take 5 weeks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Arndt",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T05:12:54.000Z",
          "Titre": "Poor communication to clients",
          "Contenu": "We called support and were told there is a problem with our licenses. However, support could not help us and we were directed to call our agent who is not at the extension I've been calling for years and no one told me that. So, I have to sit on hold for a support rep again who told me that there is team support number now that answered on first ring and was great. Problem is that no one told me that so I had to call support twice and sit on hold for an hour."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Armando Miranda",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:27:36.000Z",
          "Titre": "the pin its not necessary",
          "Contenu": "the pin its not necessarytoo much trouble to change card for paymentwebsite very confused"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Jones",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:22:25.000Z",
          "Titre": "Everyone I spoke with was very professional and knowledgable.",
          "Contenu": "Everyone I spoke with was very professional and very knowledgeable. The only reason I did not provide a stellar review is that the processes within Nextiva are so stove piped that there was not a clean handoff between personnel and I ended up duplicating activities with each person. It would be a huge improvement if an agent would stay on the line when making a transfer to another agent. Provide introductions. And explain what has already been accomplished. My time is valuable too!!!!It seems that Nextiva is more interested in keeping their support productivity numbers high than they are in solving issues in an efficient and timely manner."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T16:27:51.000Z",
          "Titre": "Their setup is not intuitive",
          "Contenu": "Their setup is not intuitive.  Online support is also not intuitive unless you know their jargon. Response to support requests can be slow.The actual phone service has been good. Features are useful and allow flexibility.  But don't try to change something once it is set up.  You may cause disruption in other areas. and lose functionality and then have to go to support to get it rectified."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juan Castro",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T01:48:30.000Z",
          "Titre": "Did not meet expectations",
          "Contenu": "Did not meet expectations I wish you were given the change to try product before purchasing…"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:01:09.000Z",
          "Titre": "While support staff worked diligently…",
          "Contenu": "While support staff worked diligently to understand and fix my issue, the fact that they can not explain why my system was totally rerouted or changed from how it was set up and working for the last 10 years is a little bit of a bummer.  It sure caused major issues not having phones work at the store for the last few days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hakam",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T21:53:51.000Z",
          "Titre": "Decent but Lacking",
          "Contenu": "For the most part, I like how everything works. The customer service is pretty prompt and helpful, and generally, I like our service. What I don't like is how unreliable our fax service is, and we have to constantly unplug our fax bridge and plug it back in as it goes out almost weekly, sometimes multiple times a week, which is a huge issue for a doctor's office that operates on paper charts only. The next issue I am having is every time we get a call, sometimes, it takes 5 seconds for someone to be able to hear me after I pick up, which can be frustrating and has resulted in patients hanging up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fulco SocialMedia",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T16:11:15.000Z",
          "Titre": "Account Manager Himself Should Get 5 Stars",
          "Contenu": "The only reason I gave such a high score was because of our account manager, Travis Branham.  He has, unknowingly, talked me out of switching to a new company a few times.  The system is very difficult to follow and many times I've been on the phone for over an hour while a tech tries to set something up. Travis does all he can to take care of problems that I've brought to him."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paws First",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T20:23:29.000Z",
          "Titre": "5 different transfers, 2 hours on phones",
          "Contenu": "I was on the phone for over 2 hours, transferred 5 different times to different departments to get to the root of the issue I was having. I was simply trying to reduce the cost of our bill or change plans. Different team members told me conflicting information. All team members were very kind, however, I felt bounced around and being on the phone for too long to resolve what we thought would be a simple issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Coleman Severson",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T21:30:23.000Z",
          "Titre": "Lacking Back End Features",
          "Contenu": "Nextiva as a phone system works, however it's quite difficult to manage. From an IT perspective:1. There's no way to generate an extension list2. When you delete an account, then the employee returns the old account still exists in the system and can't be reused3. The restrictive licensing means that accounts need to be renamed to people who take over their positions, but if someone does that or gets married it's impossible to re record somebody's name without talking to support.4. When you try to create an account without licenses left, you're told that there's an error making the account and to try again later.If you have more than 10 users and need to manage a large number of extensions I would recommend against Nextiva until some significant fixes are made on the back end. Support is helpful and prompt."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Regina",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T18:41:32.000Z",
          "Titre": "Took ALOT of our time & effort - Hopefully will have been worth the effort",
          "Contenu": "I liked that everyone was very nice to deal with.We feel very strongly that there should be an onsite Nextiva employee at some point in the transition.  We were transitioning 3 businesses - 2 from Vonage - 1 from Verizon.  There's many moving parts and it just took A LOT of our time to make this happen.  For a service we are paying for - there should a minimum onsite employee for guidance.  We wouldn't have moved to Nextiva if we didn't see it bringing an ease of running our businesses that we didn't have before so let's hope 3 months from now that all the time and energy put into it pays off & we love the system!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ellie",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T19:10:15.000Z",
          "Titre": "delayed",
          "Contenu": "It took much longer (weeks) than originally planned. We were told it was because the implementation person at Nextiva went on vacation/off and the work could continue by an interim person. We chose to wait for the person to come back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg Hine",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T21:22:33.000Z",
          "Titre": "I think the employees did their best to resolve the problem…",
          "Contenu": "I think the employees did their best to help me but the problem that cost us hours was an \"s\" was added to my last name when converting to the new system from the old one and being my pin number was hard for me to recall, someone could have said try the last 4 numbers in your XX number. I had painstaking exercises in Identifying myself even though It was just done on a different account. The second account was created by Nextiva in 2011 and have been charged an annual premium each year. Although I periodically checked the renewal email, I never caught the 4/19 billing every year to my bank account. If so I would have addressed this years ago. My suggestion with everyone is to check everything. To process to correct this is in motion so we will see how it comes out. So employees good, prior mistakes, costly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cindy Edwards",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T01:14:38.000Z",
          "Titre": "Things finally got resolved when after…",
          "Contenu": "Things finally got resolved when after multiple attempts over multiple days and weeks to connect with the right support person, our phone service is back online today after more than 20 days at a hard stop. Jason was the kind of guy that was not going to let us go another day without business phone service. He was able to push up the line to Robert the \"advanced support\" manager. He made it all work beautifully with Jason's insistence. Keep these two guys Nextiva as they got it done! Next time you get the run around for 20 days... insist on \" the advanced support manager\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brent Leas",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T18:53:49.000Z",
          "Titre": "The Nextiva vFAX system is very easy to use but...",
          "Contenu": "The Nextiva vFAX system is very easy to use but the onboarding was pretty clunky and not user friendly. Seemed that it could have been done easily via an on-line system.  I wasn't expecting that I would have to talk through the process with an support person."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deanne",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T17:54:06.000Z",
          "Titre": "They were able to help me with my…",
          "Contenu": "They were able to help me with my request of editing extensions for employees who have left our company. I really thought it should be something I would be able to do but evidently it was not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T00:39:00.000Z",
          "Titre": "Still learning the whole system",
          "Contenu": "Still learning the whole system - What would make it better - when you open up \"help\" you have to work from that screen - if you hit a link - you are directed to your help session dissapears."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T18:56:55.000Z",
          "Titre": "The start of the call didn't go well",
          "Contenu": "The start of the call didn't go well.  I could not understand what he said his name was.  After that, he said that my name was not on the authorized list.  I asked to speak to someone else, there was a pause and I guess he found me.  I introduced the 2 topics for the call.  One topic he fixed (I sure hope it doesn't break something else) the other topic he argued with me about how Nextiva doesn't offer a service that I was following up.  I decided to drop the topic and reach out to our rep.  I just didn't feel like my tech wanted to help with my options from the start."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Isabel",
          "Nb_Reviews": 2,
          "Date": "2023-05-04T18:15:26.000Z",
          "Titre": "Nextiva needs improve on the CCX 500…",
          "Contenu": "Nextiva needs improve on the CCX 500 phone, mic occasionally works and NextivaOne app missed call count can not be deleted all at once."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ashley Dick",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T22:32:06.000Z",
          "Titre": "Implementation could use some improvement",
          "Contenu": "We transitioned to Nextiva from a similar platform. We were told Nextiva was the best, and was a more secure solution for us. However, this has been what I would call a clunky transition. For at least a week our call flow was not working properly, and I am still not 100% satisfied with the function of a few things."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marcos Rodriguez Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T06:32:46.000Z",
          "Titre": "I have been asking for help to install…",
          "Contenu": "I have been asking for help to install and configure the CRM for more than six months and no one returns the call, no help by phone or emails.  I have contacted Kiersten Shehadi, Katie Austin, Danielle Harris and especially Kristi Poehls who is not helpful at all and does not give me a solution.  I have a business with twenty-three telephone lines and with future expansion to acquire 20 more in the next six months and they treat me like the worst of their clients.  I have opened cases in the CRM department and they tell me that they are going to contact me by email and nothing.  I recommend you not to do business with this company, the lack of communication would generate losses and if your account is managed by Kristi Poehls, I would wish you luck because she never takes calls and even less would help you by emails."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nanci Zehner",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T14:00:09.000Z",
          "Titre": "Great Account Manager ... Not So Great Support",
          "Contenu": "Honestly, it's been rocky the past several months. One of our biggest issues is with the new NextivaOne App. We lost much of the simplicity and functionality of the old app. It's not been a smooth transition at all. Several of our employees refuse to switch to it until they absolutely have to. The other big issue is we are unable to call some customers and prospects because their phone number gets stuck in porting it out of your system. And it literally takes DAYS to get that fixed. It's a very frustrating and time-consuming process. We are a sales and customer service company. To be unable to contact our prospects and customers is totally unacceptable. Also, wait times for both phones and chats are ridiculous. I've waited up to 40 minutes to talk/chat with someone. On the positive side, our account manager, Jason Quist is fantastic. He's responsive and truly concerned about getting our issues resolved. Unfortunately, he can only do so much. It seems once an issue gets to the support side, things go downhill. I hope this is a temporary situation as we've been with Nextiva a long time and really don't want to switch. Thank you for being open and receptive to feedback."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Patti Vrabel",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:08:19.000Z",
          "Titre": "Technical help very good - Wait time bad",
          "Contenu": "The help I received was very good and they were very patient with me.  However, I had to wait 40 minutes on hold to talk to someone."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Veronica",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T19:06:46.000Z",
          "Titre": "This product is not working and I can't…",
          "Contenu": "Original review-This product is not working and I can't seem to get help.Since the review was left, I have gotten help and we are working together to get the program figured out for my company. I am very hopeful.I am happy to have the help and I hope that for future people don’t have to leave a 1 star to get a reply or help."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chance",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T20:44:02.000Z",
          "Titre": "The agent was super friendly and…",
          "Contenu": "The agent was super friendly and helpful!It took roughly half an hour to get assistance, which seems to be the average between phone and chat support. There are so many issues that we don't bother to report, because they go away on their own before I can even get ahold of anyone, and they specified that they are overwhelmed today because they had an outage, which is true, and was experienced by our business. There are many issues with the new NextivaONE app, usability, reliability, etc. Additionally, there have been many issues where a device or feature isn't working properly, the error message seems to point to a setting that was not set up properly, and yet when we contact support they seem to be the result of back-end malfunctions. For example, we have assigned a license to the user, but are receiving the error that there is no valid license, only for support to quickly solve the issue. Support staff is always very helpful, positive, and friendly. But you will have to contact them for things you shouldn't have to contact them for, because the changes you make to your account through their online portal are not always successful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T22:34:21.000Z",
          "Titre": "Needed a tier 2 support to cover my…",
          "Contenu": "Needed a tier 2 support to cover my config. needs Still took almost 1hr to get to the right person. She did great. Been trying to get phones right for over 2 weeks now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andy Allanson",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T00:05:49.000Z",
          "Titre": "Too long on hold to reach live…",
          "Contenu": "Too long on hold to reach live representative. But amazing support once I did. Worth the wait."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angie Morgan",
          "Nb_Reviews": 3,
          "Date": "2023-06-14T21:21:46.000Z",
          "Titre": "I do love Nextiva but this particular…",
          "Contenu": "I do love Nextiva but this particular day it took quite some time to get the help I needed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T19:24:19.000Z",
          "Titre": "What do I do!",
          "Contenu": "I am not really sure when things get switched over...how to use any of the system. If I even put the numbers in correctly..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robin  C",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T19:04:08.000Z",
          "Titre": "It takes too long on the phone to solve…",
          "Contenu": "It takes too long on the phone to solve simple issues. Over an hour for each call!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eashaan",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T19:36:42.000Z",
          "Titre": "Onboarding was pretty bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eugene",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T19:40:15.000Z",
          "Titre": "Agent did not seem to know what they…",
          "Contenu": "Agent did not seem to know what they were doing. Took too long."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T17:53:52.000Z",
          "Titre": "Close, but not there yet.",
          "Contenu": "Nextiva is/was marketed as a competitor of RingCentral.  However, after a few months of using their product (specifically the web-based phone system) we've noticed the dependability and user friendly experience isn't quite where it needs to bet yet.  We have been kept in the loop with updates to the products and happenings in the company, which is nice, but just doesn't make up for a few pitfalls thus far."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cougarwoman",
          "Nb_Reviews": 11,
          "Date": "2021-12-14T17:51:58.000Z",
          "Titre": "Easy to use!!",
          "Contenu": "Overall I really like Nextiva, for being able to get faxes on my computer and receiving incoming calls. However, 90% of the calls I receive are Spam calls. Nextiva recognizes them as spam about 10% of the time. Also, the call log does not decrease on the screen unless I log out and back in. Tech services is unable to fix it. The other thing that I don't like is that you must sign up for three years. My business has closed and still have to continue paying for over two more years."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lori Juma",
          "Nb_Reviews": 6,
          "Date": "2019-10-05T08:42:28.000Z",
          "Titre": "Great until they do updates",
          "Contenu": "Great until they do updates. Just lost all my contacts and feature that helped me track text dialogue with my customers. Customer support trying to help but they seem at a loss too. 😣. They also can't figure out why the Nextiva number does not show when texting. Glitch sent all text from my private number...now clients are calling me on that number. It's all a mess."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rayiomhealthandwellness",
          "Nb_Reviews": 1,
          "Date": "2019-12-26T17:07:06.000Z",
          "Titre": "It was average",
          "Contenu": "It was an okay experience. I felt there should have been a little more engagement with this being my first time using Nextiva. I really did not know what questions to ask... I was asked \"what questions do I have?\" Overall Igor was polite and he was mindful of my time. I appreciate it. Future... feedback have questions established for newcomers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D Barnes",
          "Nb_Reviews": 5,
          "Date": "2019-06-25T19:59:27.000Z",
          "Titre": "Misunderstanding with Nextiva about installation",
          "Contenu": "I just spoke with my original Nextiva sales person, who listened and was courteous.  He promised to review with supervisors and get back to me.We agree that this has been a bad misunderstanding.  Stuff happens and I was pretty upset, but seems like there is progress towards resolution.  Hopefully it can be resolved soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joan Ince",
          "Nb_Reviews": 1,
          "Date": "2019-12-07T10:41:07.000Z",
          "Titre": "I like that each step of the customer…",
          "Contenu": "I like that each step of the customer process from the first phone call through to the email follow up survey, it’s all managed in Nextiva. Data is tracked accurately and we don’t have to do manual updates as it’s highly automated. It saves a huge amount of time."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "ProFlixSales",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T07:10:01.000Z",
          "Titre": "They insist that I stay on the line while they work.",
          "Contenu": "I have been a customer for a few years.  Call quality has been just fine.I needed to make a conference call.  The feature didn't work.  I called support.  After spending 45 minutes on the phone while they tried to get it to work, I had other things to do and asked them contact me when it was fixed. No Go.  They insist that I stay on the line or they will not work on it.I am not helping them fix it and I have other things to do than listen to them try to get their system to work.The only thing that I can compare this to, is if you take your car to the mechanic to have something repaired and they say to you \"Please stand next to your car while we work on it... this might take a couple of hours\"Looking for a new service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Grant",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T17:10:45.000Z",
          "Titre": "Aren was successful.",
          "Contenu": "Aren was successful in setting my application up for SMS. While he was successful I would also say he seemed impatient with me and a tad put out that I was not as devise literate as he would like me to be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T18:05:31.000Z",
          "Titre": "Quick service when needed",
          "Contenu": "Nextiva is a good company"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mercedes Schlaffer",
          "Nb_Reviews": 4,
          "Date": "2019-04-29T02:30:06.000Z",
          "Titre": "I did work with them for a while and…",
          "Contenu": "They won't let you port your number to another carrier. I did work with them for a while and the customer service was ok. When I wanted to put my account on hold they made me jump through hoops for ever with several phone calls and unnecessary steps, plus they made me pay for it, $15 a  month to keep my account active. Then when I called, they said that they wont let me use my number because I would have to pay an extra month to activate it so that they would give me the \"right\" to port the number. They finally helped me out after I put a bad review of them. Then they called me every single day to \"fix my issue\" so that I would remove my bad review. I told them I wouldn't do it until the process of portability was done and they still called me and emailed me every day. Why didn't they care about my problem BEFORE I put the bad review?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randy Preston",
          "Nb_Reviews": 3,
          "Date": "2016-04-24T06:07:15.000Z",
          "Titre": "Great service but very pricey.",
          "Contenu": "I have been using Nextiva for a few months now and the service is great. However I have the the package deals are very pricey compared to others in the VOIP market."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SWProspector",
          "Nb_Reviews": 2,
          "Date": "2019-07-21T22:42:46.000Z",
          "Titre": "Avoid Nextiva. Over promise and under deliver.",
          "Contenu": "Beware, our Nextiva sales rep promised VOIP features which apparently do not exist.  They ported over our number, customers received an out of service message for the first day until we called in to report it and something was changed. The next day we had to call in again just to get our phone voice system working again.Texting is very important to our business.  We repeatedly voiced our concerns and needs regarding texting both verbally and in writing.  We were assured that texting and the texting features we requested were going to be implemented on launch day.  Since the day of the port, they neglected to tell us that texting was not set up.  We discovered that texting was not up from complaining customers.  We asked them to correct this but it could not be completed for another 4 days since the weekend was coming and it could not be done until Monday or Tuesday.  Forget all of the texting features we were promised, those don't actually exist.  Now we would settle for basic texting. It has been a disaster.  The \"local\" customer service is actually from the Ukraine when it is after hours, the weekend, or the call center is full or whatever reason you can think of.  Only go with Nextiva if your businesses a hobby and you have no calls for a month during the set up process.  Even then it may not be worth the effort and calls to customer service to try and make it work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Breakey",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:19:57.000Z",
          "Titre": "Issue was understood and resolved quickly",
          "Contenu": "Issue was understood, and a resolution offered within a few minutes. Agent was helpful and concise, and put up with my confusing questions, but once he understood them, they were answered. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AT",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T17:42:01.000Z",
          "Titre": "Nextiva Care is nice and helpful",
          "Contenu": "Nextiva Care is nice and helpful. I was passed on several Analyst and I'm happy that Paige F. and the other guy I spoke to this morning assisted me very well. They are both good at answering my questions and providing clarifications."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GROUNDS, JOHN R",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T21:46:47.000Z",
          "Titre": "Well at first it wasn’t all that great…",
          "Contenu": "Well at first it wasn’t all that great I was told that my application didn’t make it through your security check. I got an email telling me my case was closed. I called one of your representatives and here at office email that I never received that my account was approved and so on and so on so we set up the account that wasn’t smooth sailing"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryant Reid",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:33:07.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service.  Not the clearest and easiest to setup but much better than others."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara Dierks",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T22:09:42.000Z",
          "Titre": "My onboarding pilot",
          "Contenu": "My onboarding pilot, Anastasiia Pavlenko, was phenomenal. She was thorough, patient, kind, and had a good sense of humor. She made sure all of my questions were addressed. She did not try to rush the process, instead, she was very careful to ensure everything I needed was provided in detail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Cunningham",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T17:16:04.000Z",
          "Titre": "Great service and Tech Support - Affiliate Broker",
          "Contenu": "The customer service and tech request was handled exceptional.  I would reccomment Nextiva to anyone who wants to increase their business...Larry Cunningham, Affiliate Broker,Monarch Realty Group, TN"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T21:27:14.000Z",
          "Titre": "Upgrade Up",
          "Contenu": "Have been using Nextiva for over a year and with company growth wanted to expand - ordered 2 additional phones and lines and something occurred with shipment.  Had to contact a higher rep which got involved (my sales guy did not respond) but this guy did.  He came thru and made sure everything was taken care of immediately."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scanlon",
          "Nb_Reviews": 6,
          "Date": "2023-09-13T17:33:53.000Z",
          "Titre": "Seamless onboard at sales",
          "Contenu": "Seamless onboard at sales. The process of completing the process on the website was somewhat fragmented as the rep was not sure, at some points, where to navigate on the page. Overall, a very positive experience to start the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "April Craven",
          "Nb_Reviews": 2,
          "Date": "2023-07-20T20:39:31.000Z",
          "Titre": "Finally a CS Rep that could help me.",
          "Contenu": "I am pleased to report that my long-standing issue has finally been resolved. After a year of unsuccessful attempts and frustrating calls, I gave up. However, Nick at CR proved to be a fantastic and accommodating individual to work with. Despite my initial frustration at hearing the same thing that was previously said, Nick quickly resolved the issue. While I am grateful for Nick's assistance, I cannot help but feel that I could have saved more money if the CR representatives I spoke to earlier had handled the situation as efficiently as Nick did. Overall, I give Nick and CR 4 stars for their excellent service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 2,
          "Date": "2023-04-05T18:48:10.000Z",
          "Titre": "OMG..how does Nextiva get high ratings",
          "Contenu": "OMG..how does Nextiva get high ratings. Honestly, we had serious issues when they moved to Nextiva-One. It took several long phone calls over several weeks to fix. Finally, they escalated our case, worked on it for a whole day. Now everything is working fine going on a week now with no problems. It's the customer service that gets them high ratings.  Thanks Nextiva"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Bambrough",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:58:54.000Z",
          "Titre": "The Tech Support team was very helpful…",
          "Contenu": "The Tech Support team was very helpful and went above and beyond in helping me with my issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T19:12:54.000Z",
          "Titre": "Alex was very helpful",
          "Contenu": "Alex was very helpful, she listened to my concerns and addressed them the best she could.  We are a new customer, and some of our phone equipment was not shipped out.  That is not a reflection on Alex, but it is an inconvenience to us, as we are using our personal cell phones for business needs and the ease of transferring calls, checking messages, and recognizing calls is not as efficient as we'd like."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T21:12:40.000Z",
          "Titre": "Passed off to 3 people but last one was best.",
          "Contenu": "Took being passed off to 3 people but the last one was easier to talk to and had a workaround to the problem of email wouldn't receive email from Nextiva. Also there was no call center background noise and it was easier to understand and less distracting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Moss",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T23:00:56.000Z",
          "Titre": "My Customer Relations Rep is the BEST",
          "Contenu": "My Customer Relations Rep was great in assisting me on getting access to my many many accounts. The process is a pain, but he made it better by being patient and kind to me. It can be a hit or miss when speaking to Nextiva, make sure you have ALL the correct information before calling."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rose",
          "Nb_Reviews": 2,
          "Date": "2023-05-23T23:01:46.000Z",
          "Titre": "Brandon was helpful.",
          "Contenu": "I spoke to Brandon today regarding our phone issues. He was able to help with the problem and explain what was happening.  I wish I was able to speak with him every time I called Nextiva. On another note Please UPDATE/CHANGE your customer hold music.  It becomes hard to listen to repeatedly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lanes End, Inc.",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:02:45.000Z",
          "Titre": "They were eager to assist",
          "Contenu": "They were eager to assist.  We were transferred a few times before the issue was resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane Hartz Warsoff",
          "Nb_Reviews": 3,
          "Date": "2023-06-21T18:50:01.000Z",
          "Titre": "Peppa",
          "Contenu": "Peppa, who helped me was FANTASTIC. She was able to help me get what I needed done.However, I didn't like that I had to take several extra steps to obtain a new phone line for a new employee. Nextiva needs a better process to add phone lines."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JACQUELINE MERSON",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T07:07:57.000Z",
          "Titre": "After 3 calls to the Nextiva call…",
          "Contenu": "After 3 calls to the Nextiva call center, I finally got connected with Customer Care Specialist Charles.  He was professional, courteous,  and resolved the issue in short order.  It was a pleasure working with him.  The subtraction of one star reflects the general difficulty getting timely customer support.  Lots of long hold times.  Generally speaking, I really like the versatility of the product and find your agents to be knowledgable and interested in helping.  I would highly recommend it to others but encourage investment in additional support personnel."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edward Jaekel",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T21:57:07.000Z",
          "Titre": "Bad upgrade, but good follow-through",
          "Contenu": "Update - Nextiva One reached out to review my issues.  They actively listened and quickly made improvements to the app to improve the functionality and then follow-up to make sure the updates were working.  Five stars on their effort and follow-through.  Four on the app as it still has a way to go to get where they want to go with it.Original post:The new Nextiva One application removed all the simplicity and easy of use from the old application.  No longer do I get a separate tickler notifying me of text messages vs phone calls.  They are all lumped into one notifications screen.  The has led to multiple missed text messages.  The app updates frequently and messes with my blue tooth setting cutting off access to my mic, but not the speaker.   The layout offers either too much or too little in the viewing screen and I need to bring in a technician to mess with the settings.  This should not be this difficult."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T18:15:25.000Z",
          "Titre": "It took several calls in to get someone…",
          "Contenu": "It took several calls in to get someone that actually helped me to get my brand new system working.  The last person was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Telelink",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T18:17:48.000Z",
          "Titre": "Very Helpful and Thorough",
          "Contenu": "The PSP person I worked with was VERY thorough and knowledgeable.  He even called back to follow.  Unfortunately for the customer, he is still not able to log into the mobile app on his phone, so we're still working through the isse."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joaquin",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T18:31:51.000Z",
          "Titre": "My experience with my representative…",
          "Contenu": "My experience with my representative from Nextiva was fantastic. She did a great job trying to help me. The problem was with the Nextiva App. At this point there is no solution to my problem on deleting partial call logs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T19:03:09.000Z",
          "Titre": "Nextiva provides 24 hours technical…",
          "Contenu": "Nextiva provides 24 hours technical support, which is very important for our business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erica",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:59:54.000Z",
          "Titre": "Issue resolved.",
          "Contenu": "I was glad the person could remote connect to help troubleshoot the issue I was having with hearing clients and clients hearing me. I was grateful to have the issue resolved so I could get back to work asap."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brent Vanden Heuvel",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T13:30:57.000Z",
          "Titre": "I am disappointed beyond belief",
          "Contenu": "(They have contacted me and are trying to accommodate all of my issues. I gave them a 4 for their effort and see how it goes from here)  I am disappointed beyond belief. What Nextiva tells you is not what you will get from pricing to function. We have a simple 3 phone 4 number system that took many hours of my time with support to set up and it still isn’t working properly. They also quoted me a price to integrate with my pos software. What a joke, they are telling me I wasn’t quoted properly by my sales person and now the price is double. If I would have just looked at the rest of these reviews it would have saved me a lot of time and money. Hopefully this review saves someone from the stress I am going through."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chanel Campos",
          "Nb_Reviews": 4,
          "Date": "2023-05-26T19:15:40.000Z",
          "Titre": "Nextiva was very helpful",
          "Contenu": "Nextiva was very helpful, in helping me setup my Holiday Greeting.  As well as double checking to see if I wanted to update the greeting.  The response time is a little long, but once you get someone you are taken care of!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ray D.",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T10:58:14.000Z",
          "Titre": "Customer service is outstanding",
          "Contenu": "Customer service is outstanding.  Anytime I've experience an issue large or small, I receive the same level of service.  SLA's are always met.  Whether I'm calling in or emailing my Customer Account Manager turn-around has been excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T21:29:29.000Z",
          "Titre": "great customer service",
          "Contenu": "great customer service, i hardly have to wait, its rare that im on hold more than a few minutes waiting for tech support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haley",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T20:57:41.000Z",
          "Titre": "Awesome Reps",
          "Contenu": "The representatives are always very nice and helpful. The only downfall is the amount of time it takes to get resolution. This experience for example took almost 3 hours to restore my system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T19:29:55.000Z",
          "Titre": "The call was answered in a reasonable…",
          "Contenu": "The call was answered in a reasonable time and the problem was fixed. My only concern is that his accent was heavy and difficult to understand."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T18:24:08.000Z",
          "Titre": "Shelly was great!",
          "Contenu": "Shelly was great are getting us all the resources we needed to figure out the best way to deploy call center"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "malkadavis",
          "Nb_Reviews": 5,
          "Date": "2023-05-03T19:13:03.000Z",
          "Titre": "The tech rep helped me resolve the…",
          "Contenu": "The tech rep helped me resolve the issue, although she was obviously in a hurry to end the call as soon as possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Troy Grant",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T23:34:55.000Z",
          "Titre": "This request was processed quickly and…",
          "Contenu": "This request was processed quickly and correctly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T15:24:25.000Z",
          "Titre": "The onboarding process went well",
          "Contenu": "The onboarding process went well.  The team was flexible and accommodating.   Billing was automatic which did not take into account timing of the onboarding.  More coordination between billing and service would have prevented client involvement to correct."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T19:56:22.000Z",
          "Titre": "It was good",
          "Contenu": "It was not quiet hard, they have  designed the app understandable for everybody, and mostly the things are similar as the other apps"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:26:12.000Z",
          "Titre": "The support agent was able to help me…",
          "Contenu": "The support agent was able to help me figure out the right settings for our calling center."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dayton Behavioral Care",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T18:10:15.000Z",
          "Titre": "Great",
          "Contenu": "Support team looked into the problem in details. Problem has not been diagnosed yet and working on the case."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Luis Atanacio",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T15:28:28.000Z",
          "Titre": "We have been using Nextiva for years…",
          "Contenu": "We have been using Nextiva for years and their service and support are excellent. Their new Nextiva One app is user friendly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blake Niemeyer",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T18:35:47.000Z",
          "Titre": "The rep stayed online with me until it…",
          "Contenu": "The rep stayed online with me until it was resolved. They were responsive and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T19:54:20.000Z",
          "Titre": "Service Works Well",
          "Contenu": "Though my on-boarding experience was not the best, after a few times interacting with my account manager in the support team we have things ironed out and the service is working well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T18:19:02.000Z",
          "Titre": "Fast response to my problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gmclaughlin",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T00:20:24.000Z",
          "Titre": "Ivan was diligent in answering my query…",
          "Contenu": "Ivan was diligent in answering my query and I was satisfied with what he came up with."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dr B",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T01:02:17.000Z",
          "Titre": "holiday schedule",
          "Contenu": "The tech folk always mean well but the system is so complex and non-intuitive that even the seemingly knowledgeable and experienced ones make significant errors in setting things up.  I wanted to make Memorial Day a holiday and it didn't get set up correctly, forwarding callers inappropriately"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T19:07:37.000Z",
          "Titre": "Did just fine",
          "Contenu": "Did just fine.  Thankfully, I did not have a complicated issue and it was resolved very quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Redline Direct Media",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T20:27:56.000Z",
          "Titre": "Always good feedback and instructive…",
          "Contenu": "Always good feedback and instructive directions of how to solve any issues I have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eileen Coleman",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T20:32:03.000Z",
          "Titre": "The customer service is fast!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sohaib rehman",
          "Nb_Reviews": 2,
          "Date": "2023-01-11T18:55:31.000Z",
          "Titre": "Good VOIP and Fax if your own internet service is decent; confusing method to downgrade service",
          "Contenu": "UPDATED POST (Jan 11, 2023):Nextiva's team escalated my matter about a week ago; I had received notice via email from them. From there, Nextiva was helpful in ultimately refunding me the amount I felt was appropriate for the unwanted-double-accounts and cancelling the unwanted account/services. I  appreciate that they ultimately fixed the situation to what I was seeking, but I wish it didn't take up so much time and energy to get their attention to this.Final thoughts: —Good/reliable online-fax services. —Good/reliable VOIP services if your own internet connection is good enough to maintain a stead/clear phone call (good internet download speed and upload speed). —Price is competitive/good. —Terrible experience in downgrading services. ORIGINAL POST (Jan 3, 2023): Service seemed fine if my connection was good. But they will not timely cancel an account even if it was created in order to downgrade a prior account. Background: Around August 2020 I had originally signed up for their mid-tier VOIP service plan (multiple phone lines and a fax). After two-years, I wanted to downgrade because we simply didn't need multiple lines.In order to downgrade, Nextiva's representative (W. Myers) had me sign up for a new account; he explained that my desired phone number would be ported to the new account and the old account would be closed. He gave me a whole analogy to explain why a second account was needed \"we need to build a new house (account) and move-your old phone number into it, then tear down the old house (account)\" to explain why merely downgrading my service-plan required opening a second account. First, it took him several weeks to get me the contract for the new account (caused me to get billed on the mid-tier account). He said it was Nextiva's system that wasn't ultimately delivering the contract for the new account. I finally got the new account contract in October 2022. I was told that they would be immediately cancelling the account. However, three-months later (and about 4 hour-long phone calls to their customer service), I am still having to call and email them. Keep in mind, the account that needed to be cancelled was on a month-to-month subscription. There was no required notice of cancellation nor wait-time. Nextiva: Terrible at downgrading your service or cancelling an account (even if that account was created at their suggested for the mere purpose of downgrading services). To be honest, their customer service tried to help during those hour-long calls. I received follow up emails from them stating they were tryting to cancel and to wait a little extra due to the holiday season, which I was fine with, but this problem lingering like this is unacceptable. I do not respect the sales-team there."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elxis",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T18:28:12.000Z",
          "Titre": "Good",
          "Contenu": "I forgot the guys name but he was a very big help. My app was not working on the computer and he was able to fix it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "'o'",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T22:41:34.000Z",
          "Titre": "They fixed the problem",
          "Contenu": "They fixed the problem, but it was like pulling teeth.Are they not allowed to say, \"We need the first AND last name.\""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Towanda",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T18:07:46.000Z",
          "Titre": "Pepa was very helpful and nice",
          "Contenu": "Pepa was very helpful and nice. She walked me through the steps and answered all my questions. She did not rush me off the phone ,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana Gromkov",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T01:13:18.000Z",
          "Titre": "Wait was long, but..",
          "Contenu": "Wait was long, but I got the help I needed to use the service. Customer service was nice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T18:25:10.000Z",
          "Titre": "Vlad was very helpful!",
          "Contenu": "I had some difficulties understanding the representative, but aside from that he was extremely helpful and was able to resolve my issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terri",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T18:30:54.000Z",
          "Titre": "They always solve our problems",
          "Contenu": "They always solve our problems!  Hold time is the only issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bart C.",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T19:10:53.000Z",
          "Titre": "The tech took her time and helped me…",
          "Contenu": "The tech took her time and helped me set it up and fixed some things i had done incorrectly.  thanks,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T15:57:17.000Z",
          "Titre": "Quick call answer",
          "Contenu": "Quick call answer. The goal of the call was completed. The tech could have been a bit nicer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Krad",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T20:46:06.000Z",
          "Titre": "Good support and a great helpful…",
          "Contenu": "Good support and a great helpful attitude."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sana",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T18:29:51.000Z",
          "Titre": "Nextiva Support",
          "Contenu": "The rep was able to help and answer all my questions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cory S",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T23:35:05.000Z",
          "Titre": "Took a long time to get help but the…",
          "Contenu": "Took a long time to get help but the tech was great! 5 stars for the tech, 3 stars for the wait to get to the tech."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T20:40:31.000Z",
          "Titre": "My issue was resolved"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dee",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T18:15:20.000Z",
          "Titre": "The level of service was great!",
          "Contenu": "The response time was nice. The knowledge was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2021-12-13T20:02:24.000Z",
          "Titre": "Generally Happy -- Just a couple of issues.",
          "Contenu": "I'm generally quite happy with Nextiva however lately I've been having the same problems I had with Vonage, which is what made me change to Nextiva in the first place.  That is,  I can hear the person on the other end but they can't hear me.  It's only happened a few times, but if it continues,  I will have to find another solution.  (It started slowly with Vonage as well, then over time got to be almost every call. I really hope I don't have a repeat of that.)Also,  I really wish you would make Nextiva compatible with NoMoRoBo so customers can let THEM weed out all those annoying robo calls."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alexandra",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T16:01:37.000Z",
          "Titre": "My experience with Nextiva support was…",
          "Contenu": "My experience with Nextiva support was positive. It took a couple days of speaking with representatives to get the problem resolved. The last rep I spoke with was Michael Krutenko, he was patient and helped figure out the problem and after making a few system changes on his end was able to resolve the issue. I appreciated his time and energy in helping. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Sandy",
          "Nb_Reviews": 2,
          "Date": "2019-12-13T19:59:08.000Z",
          "Titre": "The first rep I talked to (Alex) was…",
          "Contenu": "The first rep I talked to (Alex) was terrible.  He wasn’t listening to my problem and he essentially told me that it was my equipment’s fault.   I didn’t even have my equipment connected!   I had to insist on talking to a supervisor or someone else.   The next guy was great.  He fixed the problem.  Thank goodness I asked for another rep!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Distler",
          "Nb_Reviews": 1,
          "Date": "2021-12-14T14:38:31.000Z",
          "Titre": "Many options meant longer setup, but very happy once customization complete",
          "Contenu": "Setup took a little more effort and learning curve than I would have expected, but a lot of this had to do with the many options available. Very happy with the service once the initial setup and customization was complete."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard C",
          "Nb_Reviews": 2,
          "Date": "2020-01-06T19:39:55.000Z",
          "Titre": "Sergio B",
          "Contenu": "Sergio B. helped me today.  Customer service is quick and responsive by chat.  I wish the system was a little easier to navigate so we would not need to use customer service but our overall experience with Nextiva is good and I would recommend it to growing business needing multiple lines."
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:36:46.000Z",
          "Titre": "excellent for customer service/…",
          "Contenu": "excellent for customer service/ telemarketing supervision and statistics.  Answering period little long."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JessicaT.",
          "Nb_Reviews": 1,
          "Date": "2019-12-10T17:39:26.000Z",
          "Titre": "Alex K Thank you!",
          "Contenu": "Alex K offered great help and guidance in reviewing my issue together using the online chat service. His quick response time was appreciated and I was able to resolve my issue within minutes. Thank you for offering this option!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Rimer",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T21:17:12.000Z",
          "Titre": "The system didn't connect initially",
          "Contenu": "The system didn't connect initially. I waited so long I thought the Chat service was closed. Victor did a great job getting me up and running in the chat and helping me with some questions. Thank youl"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa J",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T21:39:10.000Z",
          "Titre": "Great customer service",
          "Contenu": "Mr. Laba was incredibly helpful in resolving the issue I called in about. The only reason I didn't do a 5 star rating is that this is the 3rd time I've had to call in about the same issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chavez T. Bowman",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T21:02:44.000Z",
          "Titre": "Helen did a great job answering all of…",
          "Contenu": "Helen did a great job answering all of my questions. If she didn't have the answer she went the extra mile to create a case to ensure my question gets directed to the appropriate individual."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ChicagoUser",
          "Nb_Reviews": 1,
          "Date": "2019-12-20T17:11:23.000Z",
          "Titre": "Initial setup was smooth",
          "Contenu": "Setting up a single line for a residence using a cisco SPA112.Setup took about an hour on the phone, because I had trouble explaining that I needed both ports on the ATA active - 1 for a single phone, and the other to connect the other phones in the house using the existing POTS wiring. Once that was understood, setup was straightforward.Voice quality is excellent with a 75/20 Mbps Uverse pipe.An issue remains with getting all the extensions in the home to ring. This seems to be due to the REN limitations on the ATA, and is being addressed with another solution.Because Nextiva is business oriented, the voicemail greeting system is a little impersonal for a home line. Sergio B was very helpful in reseting my voicemail so I could record a more appropriate greeting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pam A.",
          "Nb_Reviews": 3,
          "Date": "2021-12-13T22:55:43.000Z",
          "Titre": "Great Service",
          "Contenu": "I have been with Nextiva for over a year now and have to say that they offer very good customer service. Their agents are very professional and courteous."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SG",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T18:42:31.000Z",
          "Titre": "Customer Service - Iryna D",
          "Contenu": "Iryna D was pleasant and helpful. The only reason she didn't receive 5 stars was because we are new to Nextiva and I want to see how long it takes to get results.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2019-12-30T15:29:22.000Z",
          "Titre": "Ivan Kotsubynsky was very helpful and…",
          "Contenu": "Ivan Kotsubynsky was very helpful and getting our soft phones set up the way we would like.  So far our experience with Nextiva has been good.  Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T14:03:49.000Z",
          "Titre": "Slavik H.",
          "Contenu": "Slavik H.Easy to work with. I needed a home office phone from my old provider put onto our new Nextiva network... was easy. Thanks for the help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eron's HH",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T21:57:25.000Z",
          "Titre": "Excellent customer service,very understanding and patient.Im particularly pleased with Nick@CR in  case  02148334 for outstanding customer service,very skillful. Will recommend without reservation",
          "Contenu": "Excellent customer service,attention to details,very hands-on,professional"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "test Contact",
          "Nb_Reviews": 9,
          "Date": "2023-11-13T20:36:09.000Z",
          "Titre": "Testing inbound"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steph E",
          "Nb_Reviews": 1,
          "Date": "2019-12-30T17:12:07.000Z",
          "Titre": "Chat",
          "Contenu": "I used Nextiva chat feature with Yana T to set a holiday schedule. She worked quickly and it was a very easy transaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Noah",
          "Nb_Reviews": 1,
          "Date": "2020-01-02T22:08:32.000Z",
          "Titre": "Had an issue with a Cisco CP-8861…",
          "Contenu": "Had an issue with a Cisco CP-8861 configuration and Mr. Orlov resolved the issue quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vasyl Rublyov",
          "Nb_Reviews": 1,
          "Date": "2019-07-18T08:26:06.000Z",
          "Titre": "For a month trying to port 2 DIDs and…",
          "Contenu": "update (July 18, 2019):finally sorted out everything. takes toooo much time and tooo many calls. But finally it is working.----For a month trying to port 2 DIDs and set up account. Made a small mistake in the form first time but the customer service never follow up with me on it, had waited when I contacted them. The messages they sent always hit to SPAM folder. So have to whitelist whole their domains. After correcting that mistake - it takes a while for migrate the numbers. Somehow they migrated one DID out of 2. One is key one is missing. Screwed up all inbound faxes. The faxes for the number which has not been migrated - not coming anymore to email from old vendors nor on new one. The customer service representative always trying to put a blame on the customer.I have to pay full month extra, ending up for paying 2 extra months for old vendor plus Nextiva. Even I cannot use anything on Nextiva for that month - they keep telling the problem is mine. Maximum that they willing to reimburse 2 weeks, even full month is not used.Customer service always try to call you, discuss issues on their convenient schedule, disregarding you asking them email me. Do not care if you on travel, do not care if you have to pay for roaming changes while on travel.The account, online access, somehow keept removing without ability to reset password. Every time you have to write / call them.They response when they want. Not the same date. Be aware."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al LaPrino",
          "Nb_Reviews": 1,
          "Date": "2019-12-11T21:43:15.000Z",
          "Titre": "Alex Orlov - Nextiva",
          "Contenu": "Alex was excellent and showed remarkable patience with my confusion."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Cracolice",
          "Nb_Reviews": 2,
          "Date": "2019-12-26T20:12:44.000Z",
          "Titre": "Today's experience was the first truly…",
          "Contenu": "Today's experience was the first truly positive interaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Bonebrake",
          "Nb_Reviews": 1,
          "Date": "2020-01-05T21:43:18.000Z",
          "Titre": "Mr Laba from support was very good to…",
          "Contenu": "Mr Laba from support was very good to work with. Very patient"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley Mohammed",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T22:27:04.000Z",
          "Titre": "It does the job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Rainey",
          "Nb_Reviews": 1,
          "Date": "2019-12-26T19:30:43.000Z",
          "Titre": "Dmitriy Orel Was helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Roach",
          "Nb_Reviews": 1,
          "Date": "2019-12-19T22:25:40.000Z",
          "Titre": "Michael was very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Ford",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T19:22:50.000Z",
          "Titre": "You listen and address the exact need and ask is there anything else?",
          "Contenu": "Good Experience"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John D.",
          "Nb_Reviews": 1,
          "Date": "2020-02-26T00:12:58.000Z",
          "Titre": "Frustrated client experience turned around.",
          "Contenu": "EDIT: Leaving my original review below for authenticity, but leaving my latest experience at the top for focus on the outcome.Ultimately was connected with a gentleman named John who took ownership of the situation. He made clear with no uncertainty that they saw an issue, were taking ownership of it, allowed me to be heard, and were immediately implementing a resolution.True to his word, they overnighted a wireless accessible device, got an engineer to connect it immediately, and only then did we discuss the reviews that were left. Accidents happen and I don't fault them for that. It was a frustrating few days working for a resolution and feeling burned. That said, push come to shove - they owned it, they apologized, they listened, they made it right, and they said they would take the situation into account for improving their policies and procedures for situations similar to this moving forward. If anything, I must say the acted with integrity here in the end. Frustrated customer turned around and I would say I feel loyalty to them after all is said and done.Original Review:Called in for help provisioning a Yealink T48G phone with upgraded Wifi capabilities. Representative goofed up and downgraded the firmware to the point the Wifi capability was eradicated. The initial solution was for me to go around and find a neighbor who would be able to assist with correcting his error. 2 hours on the phone with support and I'm told they would be able to have a replacement sent to them, they could get the Wifi functionality working, and then send me way. I was told this would take many days with 2 different deliveries between manufacturer, Nextiva, and ultimately me. This was unsatisfactory and I was told to wait 24-48 hours for a manager to escalate and come up with a better solution. 48 hours went by and no information, so I called back in. This time I was offered to use their app on my cell phone and was ridiculed for not having my phone hard wired vs using wirelessly... in the year 2020. The he then said his best solution, which was now not as effective as the first, was that he would credit my account for a shipping label. That I was to package, ship, wait days for them to attempt to fix phone, receive phone back, and then ultimately begin back where I started. When I confronted how absurd this was and that the previous solution offered was poor, but far superior - I was then told to speak to the escalations department (ei cancellations). I confronted that I never said nor insinuated that I was looking to cancel my service, but simply be set back to my original condition prior to their mishap, I was told to then wait for a call from escalations and that was their best and final solution. At this point my Wifi enabled phone is no longer Wifi enabled, my service has not been functioning as I've been paying for during this time, and I'm no closer to any solution that after my initial 2 hour conversation. I would highly suggest anyone considering this company for their services explore alternative options. The tech support team isn't trained well enough, their mid level managers explored intelligent options, but have their hands tied, and their senior level managers are dismissive and not reasonable nor fair in their problem solving endeavors."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T03:21:59.000Z",
          "Titre": "Nextiva's customer service is truly Amazing!!",
          "Contenu": "Nextiva's customer service is truly exceptional! While I typically don't leave reviews, I had a few challenges setting up my account and decided to contact their customer service line. Fortunately, I was connected with a representative named Nick @ CR, handling my case. Nick not only efficiently resolved my issue but also went the extra mile by following up a few days later to check on my overall experience and ensure everything was working smoothly. I'm impressed by the level of service and personalized attention I received from Nick. Kudos to Nextiva for having such a dedicated and responsive team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Robinson",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T18:49:41.000Z",
          "Titre": "Phone system that actually works",
          "Contenu": "The process was clear and they followed up any questions. Our IT team also played a helpful part.The system is working well and we like the new phones.  I'd recommend this company to businesses looking to upgrade their phone system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hwa Yi",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:59:44.000Z",
          "Titre": "The agent was very polite and…",
          "Contenu": "The agent was very polite and knowdegeable.It was pleassant experience to work with her, and my problem was resolved.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Barrett",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:58:53.000Z",
          "Titre": "Worked with Erik Schuur to help answer…",
          "Contenu": "Worked with Erik Schuur to help answer any and all of our questions and personalize a solution that would work for us, really a top notch and knowledgeable sales person."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gretchen",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T21:23:09.000Z",
          "Titre": "Excellent Customer Service Nick@CR",
          "Contenu": "Nick @ CR assisted me with case number 02561444. He was able to help me get access to update the credit card number on file and update the email address on file."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Kesterson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T20:46:46.000Z",
          "Titre": "Great experience working with Karen Fink!",
          "Contenu": "Karen has been so patient with us, explaining things and helping us understand how to customize Nextiva's service to fit our needs.  She is also efficient, moving from each step to the next, with the goal of having a satisfied customer.  I highly recommend both Nextiva and Karen.  People make the difference, Karen made us very comfortable with our Nextiva service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Borchers",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:20:40.000Z",
          "Titre": "Nextiva cares about their customers!",
          "Contenu": "We are happy to work with  Nextiva and look forward to working with them going forward. While our transfer to Nextiva from our PBX had a few minor issues along the way, Karen Fink (our Onboarding Specialist) was outstanding and helped us clear any issues up immediately or get us in touch with the correct Specialists to clear them up. She and her team really made us feel as if they cared and wanted to make our experience smooth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G A D",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:22:15.000Z",
          "Titre": "02776311",
          "Contenu": "02776311My experience today was great he was really helpful and he answered all my questions and he also take the time out to make sure that everything was right on my behalf thanks a lot appreciate it God bless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sena Munoz",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:02:45.000Z",
          "Titre": "They really listened and had empathy",
          "Contenu": "Jeziel G was great!  His customer service skills are impeccable.  I was very impressed with his ability to handle people with ease and really make a person feel important.  Customer Service seems to be a lost art but not with Jeziel!  He even wished me Happy Holidays - you so seldom hear that anymore, he made my day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kayla Nale",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T17:04:31.000Z",
          "Titre": "We are so happy with this system!",
          "Contenu": "We are so happy with this system!! It was very easy to transition to and to setup!! Natalia and her team ensured we had everything we needed and any issues that we found were resolved very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan McMullan",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:01:34.000Z",
          "Titre": "Everyone was helpful and knowledgeable",
          "Contenu": "Everyone was helpful and knowledgeable. They could furnish answers when I asked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Archna Sharma",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:42:59.000Z",
          "Titre": "Excellent experience with Jeziel G.",
          "Contenu": "I had an excellent experience with Jeziel G. as he worked on updating our account and contract. He was very thoughtful and patient - he advocated for our business' specific needs. His service proves that we have made a wise choice in partnering with Nextiva!!Thank you,Archna SharmaFire Safe Council of Nevada County"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carter Storin",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T21:37:08.000Z",
          "Titre": "Joshua listened to our concerns and was…",
          "Contenu": "Joshua listened to our concerns and was able to help us with our account and solve our issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:43:56.000Z",
          "Titre": "Nick assisted with adding and removing…",
          "Contenu": "Nick assisted with adding and removing admin users and was very supportive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Morse",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:45:57.000Z",
          "Titre": "Working with Lisa Deaton!",
          "Contenu": "Working with Lisa Deaton!Having Lisa Deaton as our implementation manager was a treat!  She was thorough, fast, easy to contact, and our implementation went very well.  The only hangups were on our side with our network!  I thought the Nextiva program is well done and Lisa did an excellent job at getting us through the process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christela Estiverne",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:15:19.000Z",
          "Titre": "Customer service is wonderful",
          "Contenu": "Service  was wonderful today. My sale rep was wonderful. My support person was wonderful. Patient and very kind her name is Alina and I hope I will get her next time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Newey",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:07:31.000Z",
          "Titre": "Friendly and easy",
          "Contenu": "Nextiva representative was very friendly and took the time to explain everything even though we are a very small business.  I was able to get up and running in about 15 minutes!  (and this was after trying for a week to get up and running with another VOIP provider!)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danquole Robinson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:31:25.000Z",
          "Titre": "It was amazing experience",
          "Contenu": "Thank you for the service provided. My rep was amazing and allowed me to feel special with my decision to use your company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Fuller",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T15:11:47.000Z",
          "Titre": "Ivan Demyda…",
          "Contenu": "The one thing that made it Great was \"Ivan Demyda\"   he stayed with me on the phone until all systems where working properly and continued to assist me in the little details afterwards,  until all was completed in full.   Thanks Ivan..   Ya'll need more Delivery Agents like him..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeannie Dalrymple",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:34:26.000Z",
          "Titre": "Thank you Nextiva",
          "Contenu": "Thank you Nextiva, for hiring excellent customer service reps who were able to guide me through the setup process of the phone system.  From the initial person who helped us pick the right plan, Stephen, to the gentleman who walked me through the set up, it has been a pleasant experience.Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Gallo",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T02:09:34.000Z",
          "Titre": "Responsive to Business Needs",
          "Contenu": "I spoke with Nick @ CR about needing the best deal for the services my business needed and not having to pay for services we don't intend to use.  He was very responsive to my needs and proposed a solution that was the ideal fit for my business.  I was so happy with his service I entered into a longer term relationship with Nextiva and look forward to doing business into the future with them as I feel they are a partner to me in meeting my business needs and goals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Boyd Carr",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:59:05.000Z",
          "Titre": "Julian was knowledgeable and helpful…",
          "Contenu": "Julian was knowledgeable and helpful with all of my questions. He was very personable and handled my account in a professional manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence Levinson MD",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:46:03.000Z",
          "Titre": "Acknowledging the excellence of my interaction",
          "Contenu": "Very experienced and patient individual who was effective in resolving my issues and concerns. He is an excellent representative of your company and needs to be acknowledged as such. It is a rare opportunity that I have had my problems so well attended to by such an outstanding individual.Lawrence S Levinson MD Diplomate ABAM,Fellow ASAM,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Myriam Borrayo",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T05:25:09.000Z",
          "Titre": "1207",
          "Contenu": "Ann was awesome made me feel comfortable with all processes when it came to getting set up. I even paid more money than I originally thought I should pay, however the rep that set me up Daria, she just was very quiet on the phone and well she did not walk through the system with me at all. I got set up but I have not idea how to use the app. It was not very interactive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ee",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:38:36.000Z",
          "Titre": "Good customer service",
          "Contenu": "Good customer service, Nick @ CR was helpful, patient ad tried his best to help me with my account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:07:13.000Z",
          "Titre": "OMG ..",
          "Contenu": "OMG ... when I answered the call, I expected it to go a totally different way.  However, Kacy was amazing. His attitude made me want to talk with him.   He expressed his concern for me and my time and not having the desire to waste it.  That changed the course of the phone call.  After working with Kacy... he sent me to Jordan.  Let me just say...he was more pleasant than Kacy. Jordan was very accommodating. He and I worked out the details of my plan...which I was extremely happy about... Jordan then sent me to my on-boarder...Oksana.  She was also amazing and very efficient.  They say they are going to walk you through the setup, but they actually take over and do everything for you.  I pretty much just sat back and watched...and I loved it!!!  Kacy, Jordan and Oksana had answers to all my questions, made me feel like a person not a number and provided me with a service that exceeded my expectations in ALL areas.  I am excited to start my new venture with Nextiva!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriella Freeman",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:05:58.000Z",
          "Titre": "Porting Issue",
          "Contenu": "Nick@CR was exceptional at helping me resolve my porting issue.  His communication was clear and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zannie",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:12:38.000Z",
          "Titre": "Thank You Nick",
          "Contenu": "I recently had the pleasure of interacting with Nick from Customer Relations (CR), and I cannot express enough how impressed I am with the level of service I received.Thank you for going above and beyond my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deanne Wenrich",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:36:24.000Z",
          "Titre": "Jeziel G",
          "Contenu": "Jeziel G. did!  He was so patient and helpful.  He listened and heard, responding to my issue and then went even further to try to help me with the account as a whole not just the matter at hand.  Then followed up to assure that it was all resolved before leaving our account hanging."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HL",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T00:48:07.000Z",
          "Titre": "Nextiva’s team was able to make my…",
          "Contenu": "Nextiva’s team was able to make my transition flawless. Their account executive, Maggie, was personal and professional. And the customer service team made my set-up a smooth transition!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Audrie Miller",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T21:07:40.000Z",
          "Titre": "Excellent Experience from Start to Finish",
          "Contenu": "Received excellent support from working on contract details to onboarding/implementation of the service and guidance on the admin portal.  Each person was professional, knowledgeable and very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Attebery",
          "Nb_Reviews": 7,
          "Date": "2023-12-04T23:19:14.000Z",
          "Titre": "Loyal Customer of Nextiva",
          "Contenu": "I have been a customer of Nextiva for a long time now and there is a reason for this! Nextiva is the most reliable, responsive, caring company! when I have a question or need help Nextiva is quick to respond, always makes sure my questions are answered and always follows up to make sure everything is ok."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buck Degener",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:22:38.000Z",
          "Titre": "Even though I am canceling the service…",
          "Contenu": "Even though I am canceling the service Your customer representative was very helpful in a polite way"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ChosenKare",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:35:12.000Z",
          "Titre": "Nick @ CR was prompt",
          "Contenu": "Nick @ CR was prompt, efficient and outright AMAZING with paying attention to the issue finding a solution and resolving the same day, after I've attempted to get a resolution for weeks dealing with multiple other agents.  He definitely deserves to be a leader if he already isn't. PROMOTE THIS MAN ASAP!!!!! He is the reason why I stayed.  NICK KEEP DOING WHAT YOU DO BEST, WE APPRECIATE YOU!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:22:00.000Z",
          "Titre": "Jeziel was tremendous this morning",
          "Contenu": "Jeziel was tremendous this morning. He assisted me this with getting our service promptly restored after helping navigate sending the payment on some past due balance. He was kind, courteous, and professional throughout the process. He was also very patient with me while I also had to communicate with my accountant during the call. Thank you, Jeziel for a wonderful experience in a stressful situation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Newell",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T00:49:34.000Z",
          "Titre": "Jeziel was GREAT!  He is a valuable employee!",
          "Contenu": "I really enjoyed working with Jeziel.  He was very through and made sure all my questions were answered before ending the call.  I do feel Jeziel went above and beyond to return my call today, even through my email was addressed to Margarita.  It was a pleasure being assisted by Jeziel and look forward to working with him again.  Thank you Jeziel for a job well done and for making us feel like we are valued as a customer. Case number 02727326"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ranger Kidwell-Ross",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T03:20:00.000Z",
          "Titre": "Capable, Personable, Understandable",
          "Contenu": "Both my contact person, Joe, and the onboarding PROfessional, Elena, have done superb jobs of getting me onboard with Nextiva and getting all set up. Although I just onboarded today, I'm very impressed with your system and look forward to getting more acquainted in the coming days/weeks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T20:57:56.000Z",
          "Titre": "Could not ask for easier service.",
          "Contenu": "Nick @ CR was great, very helpful and fast. Could not ask for easier service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Mathison",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T19:06:29.000Z",
          "Titre": "Re Account name update and change",
          "Contenu": "Re:  case #02776422        Nick@CRNick was very thorough and made sure my account name was updated and correct.  He's a keeper!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose Bahena",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:37:55.000Z",
          "Titre": "Nextiva Keeps our business running",
          "Contenu": "Nextiva Keeps our business running. The ease of use and simplicity of their VoIP service has been critical in our use for transportation dispatching. From the ability to use the NextivaOne app from our cell phones for forwarding calls to being able to use the browser-based client to access call logs, team chats, and more Nextiva has been the answer we've needed. Their customer service has been there for use when we've had the occasionally issue with our equipment or had the need to update it. Fast and simple is the way I like our tech products to be and Nextiva has done everything we've asked and more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda.",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T19:39:11.000Z",
          "Titre": "Jeziel was very understanding and…",
          "Contenu": "Jeziel was very understanding and helpful.  It was very nice to have someone to talk through my contract issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Betsy B",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T19:33:28.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "Nick was very helpful. I appreciated that he spoke clear English. He demonstrated concern and understood my situation. He was able to transfer me and get the issues resolved quickly. I valued not having to explain the issues over and over. Always a positive experience working with Nextiva."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa Falzone",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:40:18.000Z",
          "Titre": "Johnny, Anastasia and Aria",
          "Contenu": "Nextiva employees made this switch great.  Johnny in sales accommodated all my needs and concerns and gave me a 36 month contract I could pay yearly. Anastasia in Customer Service gave me just what I needed to transfer my number from another company I was at for 13 years who did not care enough to address my issues with bill pay, so I changed over to  to Nextiva. Aria in support helped me download and save to my desktop and browser the programing from Nextiva.  She made a comfortable customer out of me by spent 2 hours making me understand how your system for call, voicemail, faxing, saving PDF, deleting, and turn off features I did not need was to be accessed and used."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Polkus",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T22:27:09.000Z",
          "Titre": "Nextiva Support",
          "Contenu": "Our 3 yr. contract ended recently. We have reduced our staff, made many changes and we no longer have a sales rep for our account. All of our requests are now handled by your support team, specifically Benjamin. He has been extremely quick and efficient throughout this process. He returns calls rapidly, is very detailed in his explanations and sends follow-up emails that summarize our conversations. I requested quotes from other companies but will continue to use Nextiva due to this excellent support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billie Hugg",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T18:20:58.000Z",
          "Titre": "Nextiva has made my life easier",
          "Contenu": "Nextiva has made my life easier.  No extra phone bill!  With the computer and phone working together I can call or text my customer with information.  They can also text me pictures without giving them my personal cell phone number.  That is the BEST part."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernice Hayden",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:26:02.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "I had a great experience because I was helped by someone teaching me about setting up new lines because it was my first time doing this task.  He walked me step-by-step through the task and I was helped the first time they contacted me.  We also get assistance with other telecommunication issues and they have always handled it with the same great customer service.  This is a very reliable company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:41:04.000Z",
          "Titre": "Custom solution, just what we needed",
          "Contenu": "Nextiva was able to provide us with the exact VOIP solution we needed. No more paying for 4 seats that we never used. Onboarding was very simple and easy and the facilitator was patient and personable as they walked me through the process.We've been using NextivaONE since January 2023 and every interaction I've had with their customer service staff has been positive and helpful.Based on my experience, I would highly recommend Nextiva to anyone searching for a flexible small-business solution."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andrew Mansour Safi",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T01:43:37.000Z",
          "Titre": "Supportive team",
          "Contenu": "Ann and Oxana were super supportive in choosing and setting up my plans"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrienne Hibbert",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:36:24.000Z",
          "Titre": "Set up was smooth and easy!",
          "Contenu": "Set up was smooth and easy. My set up specialist was helpful and knowledgeable. Great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kellie Huffman",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:31:00.000Z",
          "Titre": "Excellent customer service and resolution",
          "Contenu": "Nick @ CR listened to my concerns and helped find a resolution based on my needs.  The initial individual that took my call origins was also very professional and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:27:40.000Z",
          "Titre": "Gratitude for Nextiva",
          "Contenu": "We have been extremely happy with Nextiva since we switched over from a different VOIP system.  I've had amazing customer support when I need it, and everyone has been an ease to work with thus far."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Dominic Salt",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:38:17.000Z",
          "Titre": "Best Experience",
          "Contenu": "Best Experience, I wish I could give 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AT",
          "Nb_Reviews": 2,
          "Date": "2023-11-18T01:38:56.000Z",
          "Titre": "Joshua Ortega is a great customer representative!",
          "Contenu": "During our interaction with Joshua Ortega, we found him to be very affable and approachable. He carefully listened to our concerns and queries and was able to address them with great professionalism and expertise. We felt that he established a good rapport with us and his recap of the matter was very detailed and thorough. Overall, we were very pleased with the assistance provided by Joshua Ortega and would gladly fill up this form."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Emilio Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T22:14:56.000Z",
          "Titre": "Satisfied user here!",
          "Contenu": "Thanks to Nextiva I've been able to carry out my daily work activities which involve a handful of long-distance calls with potential candidates. The service's always been reliable and of great quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T16:05:29.000Z",
          "Titre": "I absolutely love working with Nextiva!",
          "Contenu": "I absolutely love working with Nextiva!  I've worked in telephony for 15 years, and this is by far the easiest phone system I've ever had the pleasure of installing and administrating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Dyess",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T22:40:39.000Z",
          "Titre": "Co Owner",
          "Contenu": "I am very thankful for the gentleman that helped me today, I wished he would of been avail several months ago"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Orly",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:12:41.000Z",
          "Titre": "The experience was quick and easy and…",
          "Contenu": "The experience was quick and easy and Nick @ CR was great!  He handled my concerns well and I am grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul S",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T20:35:23.000Z",
          "Titre": "The agent was professional and helpful",
          "Contenu": "The agent was professional and helpful, even though I was ending my service because my business is closing.  It was a quick discussion, and I am sorry to go after 15 plus years with your fax service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aster Integrative Medicine",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:50:04.000Z",
          "Titre": "Carlos made sure he completely…",
          "Contenu": "Carlos made sure he completely understood my request which was recommended by a Nextiva rep I spoke to previously.  Carlos informed me that I did not need to go month to month (contract) in order to remove the SMS on my account. The other rep, told me that. Carlos continued to call me until we were able to connect.  I appreciate his help.  I have not had this experience with other reps at Nextiva in the past, this is the first, so I feel that Carlos needs to be recognized.  I have always received conflicting information and Carlos finally was able to set the record straight. Thank you, Carlos!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sal Garritano",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T20:10:29.000Z",
          "Titre": "Extraordinary support",
          "Contenu": "Always easy to deal with their technical support. Love the callback feature. I recently had a fax issue that needed to be escalated and they were very responsive and thorough with getting it resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Veasna Leang",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:56:22.000Z",
          "Titre": "Great follow up and making sure the…",
          "Contenu": "Great follow up and making sure the client is satified."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chanel Campos",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T22:28:56.000Z",
          "Titre": "Nextiva is winning in Customer Support",
          "Contenu": "Nextiva is winning in my eyes with customer loyalty.  I have had to reach out a few times over the last six months from technical support to support with adjusting our monthly rate.  Each experience has been efficient, comfortable, and left us extremely satisfied with our customer experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:17:15.000Z",
          "Titre": "Problem solved",
          "Contenu": "Eddie was very helpful and contacted me to explain what happened and made sure the issue was solved in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Culver",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:39:49.000Z",
          "Titre": "Ian was fantastic in assisting with the…",
          "Contenu": "Ian was fantastic in assisting with the onboarding and getting us up and running when we were experiencing great difficulties with our old phone system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "egypt divine",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:05:07.000Z",
          "Titre": "The reps were fantastic from beginning…",
          "Contenu": "The reps were fantastic from beginning to end! no pressure to commit and text support was kind, patient and informative! Highly recommend their product and services"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Xelda Parker",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T00:08:33.000Z",
          "Titre": "So far so good!",
          "Contenu": "We are about halfway through our transition and so far the transition has been very easy. I love the application online to make adjustments and record greetings. It's so simple! Each representative has been easy to talk to, and professional, and has made me feel comfortable in this transition."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leya",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:16:47.000Z",
          "Titre": "Wonderful",
          "Contenu": "Their website was user-friendly making it easy to find everything I needed. The set up process was smooth  I’m thrilled with the overall quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "L. Sherril Davis, Esq.",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T17:36:22.000Z",
          "Titre": "Amazing Customer Service Experience with Jay",
          "Contenu": "I had an amazing customer service experience with Jay! Jay took the time to understand the reason for my call, he was very patient, and answered ALL of my questions. He even went a step further to educate me on Nextiva's offerings, as well as upcoming changes (to my benefit). I am a busy small business owner and often dread calling any businesses customer service line. Jay definitely made this a pleasant experience and his customer service skills far exceeded my expectations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:17:05.000Z",
          "Titre": "*02724959",
          "Contenu": "*02724959.  Luis Lopez was polite, helpful, and friendly.  It appears that he was successful in helping me update my payment method."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pedram G",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:23:03.000Z",
          "Titre": "Great customer service",
          "Contenu": "The customer service was exceptional, as they kept me updated throughout the entire process. I needed some changes to be made to the product, and their support team responded promptly and professionally. Overall, my experience with Ivan was outstanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mm",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T22:41:18.000Z",
          "Titre": "Agent was knowledgable and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fehling Surgical",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:29:21.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "Nick @ CR was able to provide an informed explanation of my service plan and identify potential areas to reduce costs for my business.  Very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:13:38.000Z",
          "Titre": "Everything was well explained and had a…",
          "Contenu": "Everything was well explained and had a solution for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Admin Garza-Heron",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:04:29.000Z",
          "Titre": "Easy process",
          "Contenu": "Nick @ CR Was very helpful since day 1 in what we need, he gave us full attention and service. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:50:18.000Z",
          "Titre": "Unlike the first three individuals who…",
          "Contenu": "Unlike the first three individuals who were completely unhelpful, Joshua (ref #02740404) went out of his way by going the extra to see that I was in fact an administrator of our account.  He should be promoted to a supervisory position as this is the type of effort and leadership that should be employed in the customer service and support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reviewer",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T16:08:35.000Z",
          "Titre": "Paige was very helpful and patient",
          "Contenu": "Paige was very helpful and patient. She took the time to research my account issue and provided me with very helpful advice. I felt like she did not need to go above and beyond which is why I am writing this review since Nextiva drops the ball more often than I appreciate. Give Paige a raise so that she sticks around, if you're smart."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buz Brown",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:24:33.000Z",
          "Titre": "Billing issue",
          "Contenu": "Carlos addressed my billing concerns very professionally. He has handled my case# 02645563 with great understanding for my concerns and is working very hard to resolve the issue in the best interest of all parties.Thank you Carlos! Case# 02645563"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Brown",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:55:07.000Z",
          "Titre": "Nick @ CR",
          "Contenu": "Even though I was having a lot of trouble getting authorized, Nick came in and helped save the day. I was at the point of being highly frustrated, but Nick helped calm me down and gave me everything that I needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J.Medinelli",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:42:37.000Z",
          "Titre": "You make it easy for our business",
          "Contenu": "I had an excellent and very satisfying and less cost. Amazingly grateful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Forrest",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:07:20.000Z",
          "Titre": "Quick, efficient, solid",
          "Contenu": "Nick at CR was amazing in assisting, and extremely efficient in taking care of what our team needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tara Swanson",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T03:49:09.000Z",
          "Titre": "Great so far!  Easy process.  Robust controls.",
          "Contenu": "So far, our experience has been great.  We received a low monthly price for our small business phone service, all the new phones were included for \"free,\" and the phones arrived within a week and as billed.  We set up the phones today with the help of a virtual Nextiva installation consultant who walked us step-by-step through the process.  We are still waiting to port our business numbers (local, toll-free, and fax numbers) over to the new phone system, but if that goes well then we are going to be very pleased with the new system.  It is all easily customizable through the online account website, we have the control to change or modify almost everything instantly (phone tree, display on each phone, voicemail system, etc), and the many clear and helpful online video tutorials make every change super easy.  If our numbers port over without a glitch, then Nextiva is amazing.  Our new phone systems is going to be much more robust than we ever expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Zurica (Zurica Law)",
          "Nb_Reviews": 4,
          "Date": "2023-11-28T19:27:57.000Z",
          "Titre": "Always a pleasure dealing with nextiva",
          "Contenu": "Always a pleasure dealing with nextiva.  They have great customer service and really care about all their customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T21:54:57.000Z",
          "Titre": "Great customer & support service",
          "Contenu": "Everyone was great explained things we didn’t understand, they were patient & very knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-11-19T22:25:39.000Z",
          "Titre": "Yuriy Sema The Great!",
          "Contenu": "My experience was great, because of how knowledgeable Yuriy Sema was in the service they offer. He made me feel like I was special and never rushed to get off the phone until I was satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T04:12:45.000Z",
          "Titre": "Great support-for any issue!",
          "Contenu": "I love Nextiva support. No problem is too large or small, you receive the same great professional assistance in resolving it. I've called about a phone not working and also to change a name on a phone. No problem, same great aptitude and resolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abner",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:47:44.000Z",
          "Titre": "Helpful sales people",
          "Contenu": "Helpful sales people. Helpful onboarding people. Great experience so far!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Butch Gunter",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T19:32:12.000Z",
          "Titre": "Outstanding Customer Support",
          "Contenu": "Nextiva was exceptional to get started with.  The sales process and onboarding were just the right pace and urgency.  Attitudes were outstanding, efficiency was excellent, and helping me get what I needed - spot on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary Dulevitz",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T17:49:00.000Z",
          "Titre": "You can count on Nextiva Support",
          "Contenu": "Nextiva support is always friendly, knowledgeable, and solves the issue when I reach out. I cannot thank Alex (Oleksander) for his courteous and professional help yesterday. Thank you Alex!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:21:00.000Z",
          "Titre": "Helpful and quick response."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Delgadillo",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T04:10:02.000Z",
          "Titre": "Happy to Have Such Great Service!",
          "Contenu": "Customer Service was top notch. Got us up and running in no time. Call quality is amazing, and all the options our phones have impressed everyone. Needless to say we are very happy so far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Douglas",
          "Nb_Reviews": 4,
          "Date": "2023-11-21T23:51:12.000Z",
          "Titre": "Jeziel was wonderful",
          "Contenu": "Jeziel was wonderful! Everything was handled professionally, efficiently and friendly.  He is truly an asset to your firm."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ali Valeti",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:14:16.000Z",
          "Titre": "Nick case no 02690071 went above and…",
          "Contenu": "Nick case no 02690071 went above and beyond to help us reaccess our account that was under an old employee email. Thanks Nick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Rivera",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:44:03.000Z",
          "Titre": "case # 02655658",
          "Contenu": "case # 02655658 Customer service was great. He took his time and listened and gave solutions. Very upbeat and friendly. Thanks for all your help! So refreshing to talk to someone that sounds like they enjoy helping the customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurel Morrison",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T13:11:30.000Z",
          "Titre": "Nextiva > Experience working with Denys…",
          "Contenu": "Nextiva > Experience working with Denys Kavetskyi on setting up our new phones was smooth and easy. He did a wonderful job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pinnacle Building",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:35:51.000Z",
          "Titre": "Great Rates and Service",
          "Contenu": "Thank you Nextiva for helping with our phone set-up. We are looking forward to utilizing our new phone system, and the number of features included is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa Carter-  OneViewCommunications",
          "Nb_Reviews": 6,
          "Date": "2023-11-20T16:08:45.000Z",
          "Titre": "The team at Nextiva is outstanding and…",
          "Contenu": "The team at Nextiva is outstanding and so far has the best porting and set up, installation process on the planet.  A great experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Everett Rincan",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T18:26:42.000Z",
          "Titre": "The customer Service",
          "Contenu": "The customer service and IT Team at Nextiva are excellent. Any issues get solved with ease and promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Fulmer",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T23:11:21.000Z",
          "Titre": "Nick@cr",
          "Contenu": "Nick@cr was very helpful throughout the entire process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Logan Ehrick",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T23:24:36.000Z",
          "Titre": "Super easy to work with",
          "Contenu": "Super easy to work with. Can take my busienss line anywhere with me. Their app is supper easy to use. I have seen a boost in business ever since I started using them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin Almonte",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T23:18:27.000Z",
          "Titre": "Nextiva has streamlined my workflow by…",
          "Contenu": "Nextiva has streamlined my workflow by eliminating the need for an additional phone bill. The integration between my computer and phone enables me to call or text customers with ease. Additionally, customers can send me pictures via text without having access to my personal cell number, which is the highlight of this service. This integration provides a seamless, efficient communication channel that enhances customer interaction while maintaining personal privacy."
        }
      ]
    }
  ]
}