{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "onsetcomp.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bryan Becker",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T02:58:35.000Z",
          "Titre": "Lack of integrity.",
          "Contenu": "The sales rep promised they would ship 2nd day air and only charge me standard ground shipping due to a miscommunication. When the smoke cleared, I was charged full price for expedited shipment. I emailed Onset and there was response. The products are good but I was misled during the buying process."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Beitelspacher",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T06:34:55.000Z",
          "Titre": "Well your question:\"What's wrong this time.",
          "Contenu": "Well your question:\"What's wrong this time/\" appears to me to be the correct question..how in the hell can some thing so simple? Degree days ...be simple to figure out and so difficult to tell me...what the degrees day have been and when???all on my phone that does almost everything but sleep with me.  Why the hell does your system cost so much and tell me so little?  Why can't you make it simpler to use?   Is the average number of degree days that tough to decipher and tell me in a simple graph on my iPhone?   Good luck...you all are going to need it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Malcolm McClure",
          "Nb_Reviews": 2,
          "Date": "2021-08-10T19:04:19.000Z",
          "Titre": "Poor follow-through",
          "Contenu": "My RX system is only 2 years old, but I have had several major problems with it.  First, it would not reliably connect to my WiFi system, then the barometric pressure sensor went out.  The service techs were friendly enough, but their follow-through was absolutely TERRIBLE!  It took over a year to get the first issue sorted out.  The second issue took 8 months."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Norm Dittmann/PLC-Multipoint",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T16:57:07.000Z",
          "Titre": "No response for defective TMC6 HD ticket 00D80PTR1._5002E1ta5Sv:ref",
          "Contenu": "I have a defective TMC6 HD thermocouple. On 12/16/21,  I sent Onset technical support the log graphs that showed that it wasn't operating correctly. I asked for an RMA for a defective to get it replaced and followed up with a phone call a few days later.  I have had no response. I need to complete temperature testing and now have to do it without a necessary measurement."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PRIVATE",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T18:51:41.000Z",
          "Titre": "Would not purchase, no support!",
          "Contenu": "We have had InTemp for over a year with our clinics.  The telephone number is not helpful. They let you know that you need to fill out an online help and they will contact you promptly.  When we have done this, they promptly close out our request with no assistance.  The InTemp you need an app to log in and manage and is not manageable by the desktop version.  In order to download the temperatures you need to be in that particular building, within range of the InTemp and then proceed to download.  Again, this can not be managed by the desktop version.  Highly suggest that you not purchase this."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Henry Glass",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T16:07:13.000Z",
          "Titre": "Due to high demand",
          "Contenu": "Due to high demand, delivery could not be made in time to satisfy my evaluation (two months!). Delivery was expedited, but still after I was able to acquire the loggers needed from other sources. I received the order from Onset, but now I cannot arrange a return due to a reported power outage. This is going on two weeks with no response. If demand is so high, I would think Onset would want the loggers returned to satisfy another customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Greene",
          "Nb_Reviews": 2,
          "Date": "2021-10-14T15:14:35.000Z",
          "Titre": "I had trouble using the product",
          "Contenu": "I had trouble using the product. So I called - 3 times and left voicemails. Finally I got an email with detailed instructions that STILL DID NOT help enough. My staff couldn't understand them well enough either. I had already ordered more, but ended up just returning them when I realized the customer support was inadequate. I switched to TempTail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bizhen Hu",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T15:11:08.000Z",
          "Titre": "Very slow technical support.",
          "Contenu": "Very slow technical support.We received the equipment we purchased in May and found one was not working, but we had to contact the technical support MANY times, and waited until August before we were told that it would be replaced in Sep."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Tully",
          "Nb_Reviews": 2,
          "Date": "2021-07-06T16:48:00.000Z",
          "Titre": "Extremely disappointed in level of…",
          "Contenu": "Extremely disappointed in level of service at Onset/Hobo lately. Longer than usual wait times on the phone...sometimes so long I have to hang up (over 30 mins). Most of the time I don't get an answer back via email for at least a week. I still haven't heard back about a photo sensor that isn't working on one of my weather stations...please send a new one, as this one is under warranty."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T18:20:54.000Z",
          "Titre": "I thought the item was in stock, it took over a month to ship",
          "Contenu": "No indication until after the order was placed that it would be over a month lead time.  Overall poor communication.  I would have ordered it from another vendor had I known it would take so long.  Missed my deadline."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brendan Wiltse",
          "Nb_Reviews": 1,
          "Date": "2022-02-04T19:38:08.000Z",
          "Titre": "Unreliable Equipment and Support",
          "Contenu": "We've been Onset customers for many years but our recent purchase of an RX2100 water level station from them has been far from ideal. The station has been non-functional for over two weeks. Support claims engineering is working on it, meanwhile, we are missing the collection of valuable environmental data. Inquiries about warranty replacement are met with a \"we're working on a fix\" response. Given this experience, we are looking at other vendors to meet our data logger and environmental monitoring needs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chip Fillingane",
          "Nb_Reviews": 3,
          "Date": "2021-06-24T16:05:00.000Z",
          "Titre": "Very poor functionality",
          "Contenu": "Very poor functionality.  We have to contact customer support to make any changes.  I would describe the interface for the app and website as 'user hostile'.  Would not purchase again."
        },
        {
          "Note": 1,
          "Lieu": "BG",
          "Pseudo": "Vessela",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T18:34:36.000Z",
          "Titre": "I still did not get the products I…",
          "Contenu": "I still did not get the products I bought.I got in touch with the local distributor of Onset on the 14th of September, requesting straight away proforma invoice so that I could order HOBO loggers and a base unit. I made sure to explain that I need these for an expedition in Antarctica which cannot be rescheduled for obvious reasons and I would not need the loggers if they were to arrive after my departure for the South Pole.The expected delivery time stated on the proforma invoice was 65-90 days.Imagine my frustrations when on the 24th of November (more than two months later) I got in touch with the local distributor and was told the products had not been shipped from the U.S.A. and to expect them in mid January, 4 months after I 1st requested the invoice, and one week after my departure for the South Pole.I do hope I will get the HOBOs before I leave and will get the chance to learn to use them before my departure. As an alternative, they could be sent to Punta Arenas.Looking forward to your response!P.S.I hope to give you 5* once I get to use your devices."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ron Zurlinden",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T15:37:39.000Z",
          "Titre": "Two of the four water level sensors…",
          "Contenu": "Two of the four water level sensors have needed replacement.  Now one of the cables also need replacement.  A 5 meter replacement cable should have been sent.  Instead a 2 foot cable was sent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SOUHA MAHMOUDI",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T13:52:10.000Z",
          "Titre": "I have been trying to reach out to…",
          "Contenu": "I have been trying to reach out to technical support but nobody seems to care enough to return my calls or my emails"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew M",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T23:21:28.000Z",
          "Titre": "Not durable",
          "Contenu": "Unfortunately this product is not durable. Broke within 1 week of use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Dees",
          "Nb_Reviews": 2,
          "Date": "2023-05-05T22:59:53.000Z",
          "Titre": "Untrustworthy website",
          "Contenu": "The products advertised on the website were not available (discontinued actually) prompting a complete system redesign on our end after a lengthy delay in information from Onset"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Allen",
          "Nb_Reviews": 1,
          "Date": "2021-03-26T18:16:22.000Z",
          "Titre": "Wish there was another data logger company",
          "Contenu": "In January 2020, I ordered 18 data logger and since then i have had to replace nearly half of them. The last time i requested replacements, it was over two weeks before i received a response from customer service, and that was only because  I emailed everyone i have had previous contact with within the company. The MX2201 is a poor product that needs upgrading it is a lemon"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lew Harriman",
          "Nb_Reviews": 2,
          "Date": "2019-09-17T19:26:16.000Z",
          "Titre": "New MX gateway dead on arrival",
          "Contenu": "Purchased one of the new MX gateways. I could not get the device to start up. And when I attempted to reach Tech Support (5 calls over two days) the phone system cut me off twice, and the message center failed to take my recording once. I'm still attempting to reach tech support and hoping that this set of failures does not indicate that the company has been sold or that all the competent people I knew so well have left."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Azeez Shaik",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T18:21:03.000Z",
          "Titre": "Temperature and humidity sensor not…",
          "Contenu": "Temperature and humidity sensor not working. I have been contacting sales representative but there is no response. I have been using for my ongoing greenhouse experiment and I am losing my data to record inside greenhouse which is very important to analyse my crop growth with weather data. I am really disappointed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SW",
          "Nb_Reviews": 1,
          "Date": "2021-02-12T22:37:06.000Z",
          "Titre": "I believe the equipment is going to…",
          "Contenu": "I believe the equipment is going to work fine. However, everything about InTempConnect (online platform) and the app are very much a step backwards from our previous solution. The platform just isn't built well for our needs to deploy multiple sensors to multiple locations and have multiple people notified of alarms. Tech support struggled to provide a usable solution to our needs. We finally found a way that I think we can make work. I certainly understand why the price point is so much better than the previous solution. Sometimes you pay for what you get."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2021-04-01T17:32:18.000Z",
          "Titre": "Placed an order",
          "Contenu": "Placed an order. After waiting over a week I checked the status of my order, only to find it hadn't shipped and would be out of stock for some time. I asked them to switch it to a different product. Instead, they tell me they \"found\" one and sent it. Finally received my order and I realized I had accidentally ordered the wrong product (my bad, the two products look almost identical on their website). I contacted them the very same day asking if I could do a swap. They said since it had been opened there would be a restocking fee. I agreed. 10 days later they send me an email saying they can't take it back. Worst service. Ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Tourigny",
          "Nb_Reviews": 1,
          "Date": "2020-12-18T17:08:32.000Z",
          "Titre": "I received your U22-001 HOBO Water Temp…",
          "Contenu": "I received your U22-001 HOBO Water Temp Pro v2 and attempted to follow instructions from your \"quick start\". I was told by your rep that this procedure was simple and I tried to tell him that I'm not very savvy on the computer and asked whether there was a chance the logger could be shipped to me ready to use. That was not an option. I spent some time looking through the various parts in your shipment and, so far, have not been able to even start this function.I am an oyster farmer and have little understanding of the computer as it relates to your product. Maybe you can contact me  with an offer to help.Thanks, Bob Tourigny"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Butler",
          "Nb_Reviews": 1,
          "Date": "2018-01-02T17:05:30.000Z",
          "Titre": "Have used Onset for a long time",
          "Contenu": "Have used Onset for a long time, this order was just a few additional sensors, but they kept bothering me to provide a review.In the future just let the product quality speak for itself, my opinion of Onset has been diminished by this experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2018-01-13T01:09:12.000Z",
          "Titre": "Customer service is great, products not as much",
          "Contenu": "Customer service is great! People are very friendly. Products (dataloggers and base stations) have steadily declined in quality and performance. It would be nice if they offered volume discounts, which they don't."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Muhammad Khan",
          "Nb_Reviews": 1,
          "Date": "2018-01-13T01:47:49.000Z",
          "Titre": "It should be user friendly,alarm went …",
          "Contenu": "It should be user friendly,alarm went off and the person who has profile was not around and we couldn't sound it off.we called tech support and they couldn't either.Make it easy to operate."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Josiah",
          "Nb_Reviews": 1,
          "Date": "2021-02-06T13:55:40.000Z",
          "Titre": "No clear expected delivery date",
          "Contenu": "No clear expected delivery date during check out. Ordered on Jan 11, ship date isn't till Feb 12 didn't find that out till after order was placed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicholas Thornton",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T15:40:59.000Z",
          "Titre": "Still waiting for product....",
          "Contenu": "Still waiting for product....it’s been a month."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Mark",
          "Nb_Reviews": 7,
          "Date": "2022-05-23T05:40:17.000Z",
          "Titre": "Unstable and unreliable piece of kit",
          "Contenu": "Having seen all the positive reviews I feel very unlucky.I have had nothing but problems with the RX3000. Mainly with the wifi connectivity.I tested the unit at the office. Connected to the wifi, logged three temp sensors and they looked nicely calibrated. Installed it at site and it has been a pig from day 1. Wouldnt connect to the wifi network, spent hours trying to prove that the modem on site is working on 2.4ghz and 5ghz. The RX3000 will only connect to 2.4g. And you have to enter the SSID manually.Long and short of it is we had to install a GSM modem.Even then it drops constantly. We installed a $40 Watchman to prove that the connection is there.One of the sensors had an error and removed itself. Added it back and now it runs half the temp of the other sensors. The logging has unexplained down peaks and gaps in the graphs.All in all it is really poor for $5000. Onset are very reluctant to replace anything faulty.Update: That is inacurate from Gregg. The unit was never hit by an elevator. Fake news! :)"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeff Busch",
          "Nb_Reviews": 1,
          "Date": "2020-05-24T22:22:10.000Z",
          "Titre": "I have left 2 messages to support for…",
          "Contenu": "I have left 2 messages to support for your DO logger the tip you sent will not calibrate but you have yet too return my call"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott  Keeley",
          "Nb_Reviews": 1,
          "Date": "2017-09-27T14:23:47.000Z",
          "Titre": "Sent a HOBO U30 in for repair",
          "Contenu": "Sent a HOBO U30 in for repair. They didn't finish the job, sent the unit back with all of the wires cut. I re-wired it and it wouldn't record the current.  They said I needed a new current sensor.  For which, they sold me the wrong one. When I found out it wouldn't work with my data-logger, they sold me the right one.  In the meantime they decided that the first one wasn't broken (after I had purchased two needlessly and taken up valuable time), and that the first current sensor only needed to be re-programmed.  This was also not done during the repair.  In helping me re-program it, they suggested adjusting the scale: \"turn that screw counter clockwise till it stops.\"  me: \"It's not stopping, it just keeps turning.\"  Assistant: \"Wait, there's a warning about that, only turn it three times.\"  So now it's permanently out of scale but it records something.  I get to fix the scale factor myself in excel after collecting the data. I even got to pay for the shipping of the needless components.  It has been an incredible experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angel Rosendo",
          "Nb_Reviews": 2,
          "Date": "2020-05-08T20:01:32.000Z",
          "Titre": "Has been a nightmare to for me to get…",
          "Contenu": "Has been a nightmare to for me to get my data up in Hobolink!Still waiting for your call..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Hahn",
          "Nb_Reviews": 1,
          "Date": "2021-03-11T20:34:22.000Z",
          "Titre": "I ordered my product several weeks ago",
          "Contenu": "I ordered my product several weeks ago, but they still haven't shipped yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CURTIS SCHREIER",
          "Nb_Reviews": 1,
          "Date": "2018-05-28T14:53:34.000Z",
          "Titre": "Not of Onset but of TRUSTpIlot's review…",
          "Contenu": "Not of Onset but of TRUSTpIlot's review strategy. The HOBO UX120 is under test now"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marco  Burgos",
          "Nb_Reviews": 2,
          "Date": "2021-04-05T15:11:53.000Z",
          "Titre": "I ordered the data loggers three weeks…",
          "Contenu": "I ordered the data loggers three weeks ago and I have not received them yet."
        },
        {
          "Note": 1,
          "Lieu": "BM",
          "Pseudo": "Stuart",
          "Nb_Reviews": 1,
          "Date": "2017-06-22T17:43:21.000Z",
          "Titre": "The cable I ordered and paid for did …",
          "Contenu": "The cable I ordered and paid for did not show up in the package received."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pieter Van Delft",
          "Nb_Reviews": 1,
          "Date": "2020-12-10T22:11:46.000Z",
          "Titre": "Never received order yet I am being…",
          "Contenu": "Never received order yet I am being asked to review it?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "craig clark",
          "Nb_Reviews": 1,
          "Date": "2021-01-19T16:29:36.000Z",
          "Titre": "Couldn't download hobo software."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Linda Turner",
          "Nb_Reviews": 2,
          "Date": "2021-02-12T03:45:08.000Z",
          "Titre": "Temp measurements not reliable"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug Jackson",
          "Nb_Reviews": 1,
          "Date": "2020-03-12T21:01:49.000Z",
          "Titre": "Ignored my email",
          "Contenu": "Ignored my email. Frowny Face."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephen  Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:33:20.000Z",
          "Titre": "The recommendation for the correct…",
          "Contenu": "The recommendation for the correct product for my requirements and shipping was quick and seamless. Thanks!But setting up using the data logger app and HOBOLink is not intuitive. As of today I still can't figure out how to download data never mind store it in HOBOLinkAll I can access is the current temperature and that's when I'm next to the logger and activate it with the push buttonOur IT guy can't figure it out either, he plans to call for adviceThat shouldn't be necessary"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ab",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T16:12:44.000Z",
          "Titre": "HOBO Sondes",
          "Contenu": "Products arrived on time and were easy to use. After a couple months of use, sondes started to stop recording data and/or calibrating. Tech support was helpful at times but often times responses took days to a week to get a response after messages and emails were left. After a several weeks of back and forth I was able to get one warrantied out but now 9-12 weeks before a replacement will arrive due to supply chain issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zack",
          "Nb_Reviews": 1,
          "Date": "2021-07-20T21:40:18.000Z",
          "Titre": "Customer Service and Hardware Issues",
          "Contenu": "I've had a lot trouble getting timely responses from Onset's Tech Support team. Sometimes their responses do not fully answer the questions I've asked. As far as the hardware, I'm trying to work through all the equipment's bugs before I can even make a decision on whether I want to purchase more products."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "SR",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:04:59.000Z",
          "Titre": "Tune-up misleading",
          "Contenu": "We had to send in our loggers to have the batteries changed. In the process, we were asked if we would like to do a full tune-up which included the battery, sensor, and calibration. However, when we got our loggers back after the tune-up, the DO sensor caps had not been replaced and we were informed that \"sensor\" only applied to the temperature sensor. It felt as though that should have been clarified, and it at least should have been an option for us to pay extra to have the DO sensors replaced during the service. Overall it just felt misleading, and then we had to purchase, install, and calibrate the sensor caps which required additional time and money."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Mummert",
          "Nb_Reviews": 1,
          "Date": "2021-06-16T13:53:00.000Z",
          "Titre": "That'll do pig.",
          "Contenu": "Every time I have an issue, technical support, someone with real answers is almost none existent. I opened 3 cases/tickets and never heard back. Found more information by just digging and going through their website. I learned more through troubleshooting/testing the equipment by trial and error."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Creswell",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T17:53:45.000Z",
          "Titre": "Mandatory service agreement fee and difficult set-up",
          "Contenu": "UPDATE 05/25/2023:  The response from the company is not accurate, as I have responded, and the issue is not resolved!I am not clear on why I have to pay a mandatory $50 for the service agreement and what I get out of it.  Also, I am having a difficult time setting it up in the software.  There are discrepancies between the software and what the manual says, and it is making it tougher."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "spdif",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T23:11:13.000Z",
          "Titre": "Can't read sensor when it is immersed in water",
          "Contenu": "The sensor cannot communicate when it is immersed in water so it doesn't work for my application.  The memory is small for the price of the sensor.  I dislike the Hoboconnect app UI.  For example,  in the dashboard view they use my greater than HD resolution screen to display values in a way that resembles a 1980's LCD and is about as easy to read.+1 star for the ability to record statistics for the sample period even though  they are missing a median option."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T18:12:55.000Z",
          "Titre": "I am disappointed in the HOBO device I…",
          "Contenu": "I am disappointed in the HOBO device I bought that was just beyond the warranty expiration date.  The device was not measuring humidity correctly so I purchase the new chip and realized the neither are staying in the indicated connection spot.  So now I have an unusable device with 2 humidity \"chips\".  What do I do now?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john harty",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T17:55:32.000Z",
          "Titre": "the last couple times i have ordered…",
          "Contenu": "the last couple times i have ordered from you guys i received the materials with in a couple weeks. this order i placed on 4/2/21 and it wont ship till 5/10/21 not happy about that but i still need the monitoring equipment. the fact that you ask for a revue before delivery with this far out of a delivery date is why the ratting is low."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erika",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T15:59:00.000Z",
          "Titre": "Hard to reach customer service, poor work time estimates",
          "Contenu": "I recently helped facilitate the shipment and receipt of two loggers, one water level and one conductivity logger, for repair due to failing optic sensors. I received notice that the repair would take 6-8 weeks, but was about double that in time taken to repair the loggers and ship them back to my institution. I mailed the loggers as soon as I had the service number, and shipped them overnight so they reached Onset in a very timely manner. When asking Onset for updates on the order (after they had them for over a month), it was difficult to reach them or hear back. Once they shipped the loggers, one of them was sent back without the cap protecting the optical sensor. A replacement was quickly dispatched, but this was still inconvenient for us."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T14:21:58.000Z",
          "Titre": "Very stressful and long ordering process",
          "Contenu": "This order was very stressful due to communication and wait times of replies from agents. My inquiry started on Jan 10, and was unable to resolve with agent by Feb 6. I was ordering from Europe. The shipping cost from the US was very high, so I hoped to look into shipping options from Europe. Through chat I was connected with Ines Westra, the rep serving Europe. The level of response and thoroughness of reply quickly declined when I asked about other shipping options. In the end, I took things into my own hands and spent a lot of time to get quotes through European distributers, redirect shipping and ordered online. I left shipping instructions in the note section of the order to address shipping to another person's name and definitely do not include my name to avoid losing the package. Despite that, labelling and billing mistakes were made, shipping was addressed to my name, billing was addressed to the shipment receiver, address was wrong. I called twice and emailed to rectify this mistake. The agents who replied to the shipping labelling mistake varied from showing no willingness to help to being very helpful and apologetic. In the end my name was still on the package, and the billing address was still wrong."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Derwin Cartmel",
          "Nb_Reviews": 1,
          "Date": "2021-09-14T16:36:28.000Z",
          "Titre": "When I ordered the product on the web…",
          "Contenu": "When I ordered the product on the web nothing stated it was out of stock or on back order.  I selected 2 day shipping as I needed the product.  On the day I was to recieve the product I recieved an email that it was 8 weeks out.  So I called and the product was magically at my door in 2 additional days with a tracking number.  I needed the product when I ordered it and expected it.  In general it is bad pracitice to treat a customer this way but when it came to loosing the order the tone changed and I recieved my product.  Seems like a refresher in 101 customer service is needed."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Laura T",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T09:19:48.000Z",
          "Titre": "Although very satisfied for the…",
          "Contenu": "Although very satisfied for the product, I had unsolved problems with the receipt. Unfortunately, the receipient of the product was not the buyer, and the invoice did not reflect this difference, as expressed at the time of purchase. This was not solved after receiving the receipt and asking for a change."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Cain",
          "Nb_Reviews": 1,
          "Date": "2022-01-28T18:34:21.000Z",
          "Titre": "This equipment does not work well with…",
          "Contenu": "This equipment does not work well with Apple computers. I spent hours trying to troubleshoot it and called twice for support. Second support call ended with, \"we will send you an email with instructions\" that I still have yet to receive."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Benjamin Tobin",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T20:08:28.000Z",
          "Titre": "The lack of communication…",
          "Contenu": "As always the products are high value for price but the customer service was awful. The lack of communication up front regarding lag times (prior to placing my order) between order and delivery plus the additional delays without any notice was awful. It wasn't until I received my order confirmation that I found out about a two month delay before the item would ship. As I approached that two month window and inquired about the delivery data, I was informed of additional delays in shipment. While I understand the unfortunate nature of delays, the fact that the company never proactively provided updates on my order or gave me any information at all until the day before delivery meant that my project was left in limbo with the funds already committed. This lack of communication is a huge issue that will make me think twice about purchasing from Onset again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie Hendricks",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T22:06:10.000Z",
          "Titre": "The instructions were terrible and your…",
          "Contenu": "The instructions were terrible and your verbiage on Connect is not relatable unless you work in equipment such as that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RICHARD J",
          "Nb_Reviews": 2,
          "Date": "2021-11-06T01:10:00.000Z",
          "Titre": "Not as ordered",
          "Contenu": "I was charged for four, received four, only wanted and asked for two if they could not ship when I originally ordered them. two months ago. a refund of two of the adapter would be nice. or a phone call 602-620-6367"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tiago Costa",
          "Nb_Reviews": 1,
          "Date": "2021-08-31T18:01:48.000Z",
          "Titre": "Very long wait time for replacing a…",
          "Contenu": "Very long wait time for replacing a defective logger."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kaleb Smith",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T15:29:56.000Z",
          "Titre": "It took over two months to get the 10…",
          "Contenu": "It took over two months to get the 10 temp. loggers I ordered.  Good thing I didn't need them right away!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bryan Kinch",
          "Nb_Reviews": 1,
          "Date": "2020-04-08T19:11:52.000Z",
          "Titre": "The equipment I purchased was missing…",
          "Contenu": "The equipment I purchased was missing important wiring cabling to connect the UX120-017M and the T-VER-E50B2.  I would have liked to know that this would not be included, as it was never identified to me that any equipment, especially essential wiring connection would not be included."
        },
        {
          "Note": 2,
          "Lieu": "KE",
          "Pseudo": "Lilian Kihoro",
          "Nb_Reviews": 1,
          "Date": "2018-02-12T09:24:59.000Z",
          "Titre": "I didn't like how the shipment was …",
          "Contenu": "I didn't like how the shipment was handled. I requested shipment to be packed in two different packages since they were to go to two different countries and if that was not possible, this should have been communicated on time. now its too late and the shipment is still being held by customs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "GENE S. BERKOWITZ",
          "Nb_Reviews": 1,
          "Date": "2018-04-17T19:07:28.000Z",
          "Titre": "HW Good, SW Bad.",
          "Contenu": "Despite technical support from Onset, the Java-based Hobo software refuses to run on my Win7 64-bit computer, apparently due to conflicts with Java library files installed by other applications.The logger itself is more than adequate, but the software *required to operate it* is fickle."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 2,
          "Date": "2017-06-27T21:04:23.000Z",
          "Titre": "Sent loggers/sensors that were not compatible",
          "Contenu": "Filled my order for loggers and sensors without telling me they are not compatible.  Granted, they sent what I requested, could have saved me a lot of trouble by catching my misunderstanding."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Travis Wambeke",
          "Nb_Reviews": 2,
          "Date": "2019-02-20T14:09:15.000Z",
          "Titre": "Didn't ship in accordance with paid…",
          "Contenu": "Didn't ship in accordance with paid shipping expectations. Required additional parts for connectivity not fully explained during sale and seemingly upsold software I did not need."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2019-03-01T13:48:10.000Z",
          "Titre": "The software NEEDS to have much more…",
          "Contenu": "The software NEEDS to have much more customization options. Need to be able to maintain a default setting so that all the detached, attached coupling columns don't download every time without having click on them every time, customized header labeled (truely) - can add your own names but then HOBO feels the need to attach additional stuff to them. This additional stuff plays havoc inside a database.The Windows 10 driver need to be fixed - continue to have to unplug and plug cable in to re-connect to sensor. Windows 10 has been out more than enough time to get this figured out. Batch processing (and reg processing) - need to be able to keep the system in UTC without having to change computer times.A better file system that allows command line to access the raw files.I better stop now.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Long time customer, PE, CEM",
          "Nb_Reviews": 1,
          "Date": "2017-12-17T14:24:32.000Z",
          "Titre": "Not happy with onset as they …",
          "Contenu": "Not happy with onset as they discontinue their simple less expensive loggers and replace with fancy expensive loggers with features we don’t need."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Myron",
          "Nb_Reviews": 2,
          "Date": "2020-10-04T14:16:38.000Z",
          "Titre": "My order was confirmed more than a week…",
          "Contenu": "My order was confirmed more than a week ago.  Shipping will not occur until more than a week from today.  Why is it taking so long?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nate P.",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T21:56:11.000Z",
          "Titre": "Buyer Beware",
          "Contenu": "This review pertains strictly to the purchase process and subsequent return process for the product purchased, but does NOT address the actual product. The purchase process was simple and efficient. I placed an order via the internet for 11 data loggers and they arrived within 7-10 days. Had I not had issues with the product which in turn led to a prolonged, frustrating return process, the rating would be 5-stars, but alas, this was not the case. Immediately upon receiving and testing the data loggers, the data indicated several of them were inaccurate. At that point, I initiated what I thought would be a simple return process...I was wrong. After speaking with several reps (both customer service and tech. service), I was essentially \"too bad\" b/c I had \"used\" the loggers. How would I know they were bad if I didn't use them? Eventually, I was able to come to an agreement with the Tech. Support Manager to send the loggers back so they could perform an internal evaluation. It took over 2-months for the evaluation (after being promised turn-around would be abt 1-week). Finally, they agreed there were issues with several of the units and agreed to issue a full refund. I'm certain I never would have received a refund had I not been overly diligent throughout the process. Ultimately, what initially seemed like a positive experience turned into a negative one. I won't be purchasing from Onset again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Roger Gordon",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T14:18:57.000Z",
          "Titre": "A month for data loggers.....last time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2017-11-02T17:04:10.000Z",
          "Titre": "Product is great"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave Ryan",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T00:22:44.000Z",
          "Titre": "the AC CTs I bought were different than…",
          "Contenu": "the AC CTs I bought were different than others I purchased in the past, and the directions were not really very clear as to how to get the CTs open."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Timothy Smith",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T17:49:16.000Z",
          "Titre": "I have used HOBO temperature monitors…",
          "Contenu": "Edit: I finally did connect with the tech representative and demonstrated that the shuttle was not working. The company has remedied the problem and I'm satisfied that they have made a good faith effort...minus closing the support ticket last year. I have used HOBO temperature monitors in the past without a problem, but I received a shipment of them last year that did not work. The shuttle did not communicate with the loggers. When I contacted tech support they said change out the batteries in the loggers, but they still did not work. Then they closed the support ticket despite my request despite telling them that the loggers were not working and that they should not do so. I had to put aside those monitors to do other projects and when I finally got back to them tech support has told me the warranty has expired and they will not replace them despite their never having worked. Today I've been sitting in my office since 7 am, leaving messages for tech support that has not shown up for a scheduled call. I think there must be problems at Onset now. This was not my experience with them in the past."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlee Cramer",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T17:36:06.000Z",
          "Titre": "incomplete help",
          "Contenu": "I asked multiple questions and the person responding only assisted with two/three issues, the third being the most critical which is problems with the phone app communicating with any of the loggers/my main app on my computer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Ajo-Franklin",
          "Nb_Reviews": 1,
          "Date": "2021-09-10T14:24:32.000Z",
          "Titre": "We love our various HOBO systems but .....",
          "Contenu": "We love our various HOBO systems (functional, good value) but the long turn-around time on purchases  (purchase-to-delivery) is getting to be onerous. I know this is likey supply chain disruption but our order was quite delayed w. respect to the original invoice estimate. It would be great if the website and quotes provided more accurate information on this, particularly for time-critical projects. Keep making great stuff, just send it more quickly. Best - Jonathan"
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Eugen Eastman",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T13:05:48.000Z",
          "Titre": "Good products.",
          "Contenu": "Good products.Rating is lower due to incredible long waiting time. Paid in advance and wait almost 3 months for delivery. This is really painful for projects where installing sensors in the field is strongly dependent on season."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Theodore Bryson",
          "Nb_Reviews": 1,
          "Date": "2021-09-02T22:33:51.000Z",
          "Titre": "You need to order a charging cord too!!!!!!",
          "Contenu": "We ordered the data logger and it took a considerable time to arrive. Due to COVID related shipping issues that was understandable. Unfortunately, once it did finally arrive, it was unusable as it required an external charging cord which was not included in the purchase. After waiting so long I was very disappointed not to be able to use my device upon receipt. I returned to their site, ordered the cord and they did ship much more quickly than the several months I had awaited the device itself, but I feel this issue was a sad oversight. I was able to employ an old camera charging USB and had it operable the same day but by then my order had already been processed."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kelly Junge",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T16:32:25.000Z",
          "Titre": "Well I bought a 4 channel data logger",
          "Contenu": "Well I bought a 4 channel data logger.  It isn't really a 4-channel, because all channels have to have the same ground voltage.  Thus I had to buy 3 units, instead of using 1 unit.  Next time I will know better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mary Santelmann",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T00:11:26.000Z",
          "Titre": "Need more access to immediate tech support via chat",
          "Contenu": "I wanted to get an online chat because I had an immediate need for information and had to wait for an email reply.The response I eventually received was good but I needed the information two days earlier"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Munday",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T20:32:21.000Z",
          "Titre": "Ordered a replacement data logger & it…",
          "Contenu": "Ordered a replacement data logger & it did not come with a usb cable so it was unusable until I could order one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer Watts",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T16:00:34.000Z",
          "Titre": "Onset quality control issues?",
          "Contenu": "We've been having many more issues (sensor & logger failure) with Onset equipment, to the point that it is causing issues for our remote arctic work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T15:26:19.000Z",
          "Titre": "Shipping was very slow",
          "Contenu": "Shipping was very slow. I had to borrow equipment to finish my work for the season."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Miguel Diaz",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T16:48:05.000Z",
          "Titre": "Great but slow shipping",
          "Contenu": "Everything is great but from the time of the order confirmation to the shipment confirmation takes several days."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MH",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T14:35:04.000Z",
          "Titre": "Great product, long wait",
          "Contenu": "Onset's products are terrific, 3 stars for the 3 month wait to get them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Whitney Billett",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T11:23:21.000Z",
          "Titre": "Lots of room for improvement",
          "Contenu": "Lots of room for improvement. Bought multiple 4 channel loggers on different occasions and in each batch was a faulty probe. Turn around time for calibration is very long regardless of time of year, a minimum of a month at least. Customer service is slow to respond. One positive is that their HOBO stainless steel loggers are practically indestructible making them ideal for shipping data."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Florida",
          "Nb_Reviews": 1,
          "Date": "2020-06-23T19:43:25.000Z",
          "Titre": "A HOBO MX failed after 7 months (not…",
          "Contenu": "A HOBO MX failed after 7 months (not the first, second, tenth, or probably last time it will happen). Fortunately, it was still under warranty and a new logger was sent to me. However, a new sensor was not included, so I had to wait another week for the sensor to be sent out. Meanwhile, the data that I need for a client was not being collected.The whole replacement process took about one month. I won't know if the replacement logger works or not until the next time I go download."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alex Krohn",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T22:03:18.000Z",
          "Titre": "Missing Key Parts",
          "Contenu": "Good customer service, but it seems like everything is extra. We ordered a S-ADAPT box to be able to plug more than one sensor into one sensor port, and the device didn't even come with the extension cable to plug the S-ADAPT into the HOBO sensor ports. How is it supposed to function without that extension cable??!? Quality stuff, quality support, just don't be surprised about hidden or extra fees."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Avery",
          "Nb_Reviews": 2,
          "Date": "2019-07-06T09:19:30.000Z",
          "Titre": "Sales info was not consistent",
          "Contenu": "Sales info was not consistent. Told at EWE everything on an app; it is not. Even using a smartphone browser the website is iffy. For ex, I can't see rain data. Some functions only work on a PC not on an ipad. So forget about mobility. Next salesperson outwrite lied to me. Once I switched to a senior person I got good information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cal Poly",
          "Nb_Reviews": 1,
          "Date": "2018-08-18T20:47:57.000Z",
          "Titre": "Onset Software Testing",
          "Contenu": "The customer service for ordering items is amazing and well done. What needs work is more testing up front on data logging software. It took me several weeks of crashing software and my own process of elimination to figure out the kinks in the OSX version of the software not compatible with the latest version of Java. But after I figured it out, the fix was made and Onset fixed the software and re uploaded it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "mark slabaugh CEM, CBCP, CmvP",
          "Nb_Reviews": 1,
          "Date": "2019-01-25T22:14:21.000Z",
          "Titre": "the new onset loggers are nice",
          "Contenu": "the new onset loggers are nice, but - not as robust as the older ones.  Have had a few fail after a fall, due to the screen dieing.  The logger may still work, but if the screen does not, how do we know. Also seems that the battery life is shorter too.  That said they are the best ones still on the market for afordable logging solutions."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Woods Worker",
          "Nb_Reviews": 1,
          "Date": "2017-11-16T00:53:27.000Z",
          "Titre": "Works great ... when it works.",
          "Contenu": "I have 11 rain gauges out in the woods that get downloaded/serviced once a year. I usually have one or two that failed for unknown reasons. And I've given up on the Shuttle because it was unreliable.But the worst part is even when it works, the output is just the date and time of each bucket tip. It's very difficult to get monthly or daily rainfall totals. I finally had to write my own software. The output is NOT user-friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-09-19T20:33:45.000Z",
          "Titre": "No notification of backorder",
          "Contenu": "I was not notified that my items were backordered or given a tracking number. The customer service agent assured me they had been sent and asked that I check my spam. I didn't have any e-mails from Onset in Span, but I've received the order confirmation and this survey from the company, so I'm pretty sure I'm getting their emails just fine.  The timeline is important on this project, so this delay has been frustrating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2017-05-31T22:48:53.000Z",
          "Titre": "Onset Tidbits are a great product!",
          "Contenu": "Onset Tidbits are a great product! I use around 30-40 a year, this year I ordered 20 new Tidbits. Unfortunately, one came nonfunctional. It took me 4-5 emails to resolve this issue. In the end the right thing was done. Just could have been with some less friction and waste of my time. I still will continue to use this product as they function very well."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Curt",
          "Nb_Reviews": 1,
          "Date": "2018-09-04T20:30:12.000Z",
          "Titre": "Bad data logger",
          "Contenu": "Ordered data logger and could not make it functional.  After several  sessions with tech support, the data logger was deemed bad and returned.  Considerable time and money was was wasted to set up and troubleshoot the data logger.  The data loggers should be factory tested to make sure they don't show up non-functional."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Fisher",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T20:02:32.000Z",
          "Titre": "Glad I could talk to someone on the…",
          "Contenu": "Glad I could talk to someone on the phone. My only complaint was the salesperson didn't know we had to have the data manager or antenna to use the system she quoted. We received the equipment only to have to troubleshoot for an hour and find out we were missing something."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eleanor L.",
          "Nb_Reviews": 2,
          "Date": "2018-07-31T13:16:25.000Z",
          "Titre": "Took a bit to get a call back",
          "Contenu": "Took a bit to get a call back, however, the rep answered my question.  I was still concerned about the issue and called back and left a message but did not get a call back, rather just an auto reply about the case.  Short duration of just 2 days before the issue is closed is too short with a busy schedule."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Phillips",
          "Nb_Reviews": 2,
          "Date": "2018-05-29T13:49:40.000Z",
          "Titre": "When I purchased it",
          "Contenu": "When I purchased it, I wasn't aware that the USB connections used an older version so I had to buy an additional part. Also, wasn't aware that I had to download software, buy the cable just to get it to work. For the money, wouldn't buy this product had I known that and won't buy it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Edward Ganshirt",
          "Nb_Reviews": 1,
          "Date": "2019-10-09T17:27:27.000Z",
          "Titre": "The software downloaded is a 30 day…",
          "Contenu": "The software downloaded is a 30 day trial. Not sure if I can reload at end of period to analyze my data which will take 6 months to collect although I have a second PC not loaded if that proves to be a problem. I do understand the permanent version of hoboware is  is a good buy if you are a serious data collector.These hobo loggers are good but not cheap for a casual user like me. If possible maybe a rudimentary dumbed down of  hoboware outputting a .CSV  transfer to Excel spreadsheet. After all Hoboware is not really useful except for use with the hobo dataloggers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joe Krieter",
          "Nb_Reviews": 1,
          "Date": "2018-05-16T22:44:08.000Z",
          "Titre": "Water level logger MX2001 & related issues",
          "Contenu": "I've been using onset products for many years and I'm very happy with most. My last order (water level logger mx2001), however, came without a cable which would normally render the product useless.  However, since I was replacing an older unit, I was able to reuse the old cable.  Another unit also has a glitch with the battery readings, alternating between 0 and 100 percent, immediately after new batteries were installed.  These units seem to go bad after 2 yrs. I do like the bluetooth connectivity and data appear reasonably accurate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Corp User",
          "Nb_Reviews": 1,
          "Date": "2019-08-05T18:00:52.000Z",
          "Titre": "The data interface is not good",
          "Contenu": "The data interface is not good. You should be able to erase the data with a button instead of it doing it in the background when starting to record. The memory size is way too small especially for the price. External storage should also be an option."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris Watson",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T13:59:42.000Z",
          "Titre": "I do like your data loggers",
          "Contenu": "I do like your data loggers, but I recently pulled an older unit out for service. When I turned it on, it immediately asked for an upgrade. The upgrade downloaded and the unit stopped communicating to me by Bluetooth. I did try to reload the upgrade multiple times before I called in. The gentleman on the phone was sorry this happened, but needed to check on something for me. He took my information to get back with me later. He was going to give me an RMA to fix, I think. Never got a call back from him. Did have to buy another unit to fill the void. The new unit was delayed do to components not being available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trevor Fox",
          "Nb_Reviews": 1,
          "Date": "2020-01-16T21:23:06.000Z",
          "Titre": "I'm disappointed that there is no way…",
          "Contenu": "I'm disappointed that there is no way to highlight sections of the data and delete it. The clip feature is limited in scope and does not allow for quick and easy removal of anomalous data or trimming the front and back of the recordings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Soctt",
          "Nb_Reviews": 2,
          "Date": "2019-04-22T19:55:33.000Z",
          "Titre": "Sales people need to be more knowledgeable",
          "Contenu": "The equipment works perfectly.  However, the people I spoke to were not able to describe the differences in the Hobo Temp dataloggers.  The newest logger (Hobo Pendant MX) is supposed to be able to use bluetooth to download data, but no one really knew what format the data would download in or if the format was the same or different than the Hobo Pendant 64K where you use a \"shuttle\" to download the data.  I was excited about the bluetooth capability, but I ended up getting the 64K Pendants since not one person could tell me much about the Pendant MX.  Staff should be more knowledgeable about the products"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick Agins",
          "Nb_Reviews": 1,
          "Date": "2017-10-17T17:12:48.000Z",
          "Titre": "Purchased a total of 7 HOBO U20L …",
          "Contenu": "Purchased a total of 7 HOBO U20L loggers. two have malfunctioned within 1 year causing missed data.  They were never mishandled that I know of and deployed in a very safe condition. Warranty took care of the issue with no problems, which is what you can expect"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Sileo",
          "Nb_Reviews": 2,
          "Date": "2020-09-18T21:43:19.000Z",
          "Titre": "Disappointed that Order took a full week to ship",
          "Contenu": "Merchandise arrived on time, however I nearly paid for expediting shipping because it took 1 week for my order to ship.   Merchandise was out of stock at the time of my order but I was not made aware"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven  S.",
          "Nb_Reviews": 2,
          "Date": "2017-12-14T05:52:48.000Z",
          "Titre": "Still an engineering prototype",
          "Contenu": "On one side, after some fiddling, you do get the data (most times) - and after all, this is a niche market and they are not selling millions of these.But it would be nice when using windows 10 that I do not have to close the Hobo application and re-open it each time I put a different logger into the dock.  It would also be nice if the plastic parts of the dock fit together nicely and all used the same adapter - and their instructions actually told you the proper sequence of assembling logger, docking station, plugging in USB - THEN starting the software - so that it actually will see the logger. And etc.  However, except for the one time so far that it just said \"end of file encountered\" I do get the data - eventually."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jill",
          "Nb_Reviews": 1,
          "Date": "2018-01-18T16:42:05.000Z",
          "Titre": "Good",
          "Contenu": "Good, received product quickly but did not receive invoice in email after purchase. Only received an email order confirmation immediately after placing order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don Kerstetter",
          "Nb_Reviews": 2,
          "Date": "2020-07-19T18:22:55.000Z",
          "Titre": "Slow shipping & high cost",
          "Contenu": "The order for one common logger & 4 protective boots was only packed 4 days following my order. Each boot was $20 - a bit high."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Truong",
          "Nb_Reviews": 1,
          "Date": "2019-05-14T14:30:45.000Z",
          "Titre": "Devices came as ordered but there…",
          "Contenu": "Devices came as ordered but there seemed to be some miscommunication and lack of care in preparing the equipment. I ordered a depth sensor with the base kit which came with a set of various couplers. Because we already ordered the base kit I also ordered a water temp sensor (Hobo V2) to use with the base kit that was ordered with my depth sensor. I asked an agent whether or not I needed a coupler even though I already ordered the base kit which seemed to come with a set of couplers. I was advised to purchase an extra coupler for the water temp sensor, which I found out was not necessary so now I have two couplers and the hassle to return would not be worth it. Additionally, when I looked at the base kit I found a hair trapped in the sensors housing which I cannot open to remove. I feel like a quick quality check before sending out the equipment could have prevented this. I am unsure how the sensors will perform just yet. We've just deployed them and will be retrieving the data soon, hopefully, there are no issues there."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Carroll",
          "Nb_Reviews": 1,
          "Date": "2017-08-17T23:13:52.000Z",
          "Titre": "Unrealized expectations",
          "Contenu": "I need the software experience your promotion seemed to promise but did not deliver.I need for my well operators to be able to drive up close to a well location in their pickup, punch the hobo icon on their phone and immediately see the last day of data.  No picking a device.  No looking at yesterdays file. no picking a file.  Just look at the last days data displayed as variable vs time.  Always on the same vertical scale.  Their job is to keep the field producing, not manipulate data devices.  They find phones challengingNo amount of discussion with programmers or rationalization about what someone could do with the data will make any difference to this need.  We gather and display tons of data.   I work with programmers every day.  Some days we have to discuss termination in order to bring the product in line with simple, essential, critical needs un-obscured by creative answers to never-asked questions.Fix the problem and we will buy some more of them.John Carroll  EEInstrumental Systems307 751 3020"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philip  Terrell",
          "Nb_Reviews": 1,
          "Date": "2019-03-01T14:25:06.000Z",
          "Titre": "very rocky experience with data logger…",
          "Contenu": "very rocky experience with data logger software. took 6 months to get it to work on my Mac. Had to use a spare PC."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "fishbio3",
          "Nb_Reviews": 1,
          "Date": "2017-11-13T16:39:32.000Z",
          "Titre": "shipment",
          "Contenu": "shipment, however prompt, was mailed to the wrong address (no one checked in with me to verify current address)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dania Smith",
          "Nb_Reviews": 1,
          "Date": "2020-01-21T17:30:23.000Z",
          "Titre": "The website is a bit clunky",
          "Contenu": "The website is a bit clunky, but the product was as expected and it arrived in good condition."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tony Ziegler",
          "Nb_Reviews": 1,
          "Date": "2021-02-24T18:38:46.000Z",
          "Titre": "It took two weeks to determine that…",
          "Contenu": "It took two weeks to determine that there was a problem before a new part was shipped."
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Espen S.",
          "Nb_Reviews": 3,
          "Date": "2018-03-16T08:46:11.000Z",
          "Titre": "Lack of invoicing to our company makes…",
          "Contenu": "Lack of invoicing to our company makes paying for licence by personal credit card annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Rakow",
          "Nb_Reviews": 2,
          "Date": "2017-10-28T15:02:12.000Z",
          "Titre": "I don't prefer the Bluetooth  …",
          "Contenu": "I don't prefer the Bluetooth  recording.  It's difficult to use and apply."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Douglas Silver",
          "Nb_Reviews": 1,
          "Date": "2020-06-22T23:06:18.000Z",
          "Titre": "I ordered the product a week ago and…",
          "Contenu": "I ordered the product a week ago and still haven't seen it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler Upham",
          "Nb_Reviews": 1,
          "Date": "2020-02-11T16:52:02.000Z",
          "Titre": "You Site could be easier to navigate",
          "Contenu": "You Site could be easier to navigate, but purchasing was easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Oliver Bennett",
          "Nb_Reviews": 1,
          "Date": "2019-06-09T13:17:04.000Z",
          "Titre": "One component is missing",
          "Contenu": "One component is missing, unable to install the device."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-09-11T15:38:30.000Z",
          "Titre": "Good, bad, ugly",
          "Contenu": "U30 stations are solid, everything else kinda not."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "A Jayakaran",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T02:25:20.000Z",
          "Titre": "Sales great, product cost good, longevity short, customer service poor",
          "Contenu": "a)\tInexpensive, Easy to Set Up Wireless Sensor Network: Seems great, but the wireless sensors are of poor quality and often fail. In my mind it would make logical sense to make soil moisture and rain gauge sensors water proof, but I have noticed moisture intrusion multiple times. Also, the data being recorded with the soil moisture probes is highly variable and the rain gauge’s plastic construction seems flimsy and does not help protect against needles and other debris.b)\tCloud Data Storage with an API: I really liked this idea, but both the API and online data download interface are clunky. The API has super low limits when it comes to how much data it can pull (1-day at a time basically) and has virtually no support. The Hobolink webpage offers exports but is also limited in the number of records it can export. If a sensor is ever unplugged and replugged it shows up as a new data export column and needs to be manually reselected during export. Also, I noticed some truncation issues with significant figures in exports especially in regards to rain gauge data.I am showing 6 that have permanently gone offline for one reason or another since February 2020 (out of ~35) - its Sept 2020 now. I believe all of them have failed for different reasons. We had one that wouldn't hold a charge for more than a week, one that was reading the same soil moisture reading regardless of soil moisture, one that was unable to connect to the logger out of the box, one that had a faulty seal and let moisture in, one that lost its connection and never recovered, and I believe the 6th was a similar connection issue. This list of 6 doesn't include ones that we have been able to fix through resetting or reconnecting.  My biggest complaint, however, would be long wait times on hold with customer service, emails that have gone ignored, and promises to get back with me that have gone unfulfilled, the biggest example would be the sensor that we got in yesterday was from a case I opened at the beginning of August.  When I have be able to talk with someone, they are always helpful and willing to send replacements under warranty but getting a voice on the other end of the line, or an email response is often difficult."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cody",
          "Nb_Reviews": 1,
          "Date": "2018-01-18T16:10:30.000Z",
          "Titre": "Issues",
          "Contenu": "Had issue with customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan Volkmann",
          "Nb_Reviews": 1,
          "Date": "2019-10-02T17:31:46.000Z",
          "Titre": "item recieved missing parts"
        },
        {
          "Note": 3,
          "Lieu": "CN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-07-07T07:38:09.000Z",
          "Titre": "Too many deals"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justine Chumley",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T19:31:30.000Z",
          "Titre": "Very helpful staff",
          "Contenu": "Kayla was very helpful and responded to my emails quickly"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "RobW",
          "Nb_Reviews": 2,
          "Date": "2022-05-18T15:30:37.000Z",
          "Titre": "No real issues with the logger",
          "Contenu": "No real issues with the logger, we use around 5000 of them globally at various temperature ranges and they work well.Would like a way to perform the software updates in bulk though rather than individually. Thank you Reece Staat for offering tech support when needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CPA",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T13:11:25.000Z",
          "Titre": "Good products, not enough direction/support upfront",
          "Contenu": "The products are great, but there wasn't any material with the items which gave advice on how to properly use the items. The customer has to do too much work on their end to do something as simple as figure out the HOBO connect app and how to export and compile data readings in HOBOware.This is basic information that you shouldn't have to reach out to customer services to get."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Happy academic customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T18:07:48.000Z",
          "Titre": "Fine fieldwork facilitation",
          "Contenu": "I work in academia and was helping a researcher prepare for their first fieldwork expedition since the pandemic. Because of the pandemic, and funding, we needed product quickly. I indicated this in an email to Onset alongside an order, to no avail, so I had the researcher give them a call. This was a big success as Onset shipped the items overnight, and the researcher is using them in the field as I write this review and is quite pleased with the quality and ease of use. I will definitely be using Onset going forward!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sara Q.",
          "Nb_Reviews": 1,
          "Date": "2021-11-02T19:32:44.000Z",
          "Titre": "Out of 14 newly purchased Hobo U20…",
          "Contenu": "Out of 14 newly purchased Hobo U20 loggers, I had trouble with 5 of them acting glitchy during the first data download.  I was able to download all the data from them and ultimately able to get 1 of them working and relaunched, but the other 4 were still under warranty and not able to be relaunched.  It took a few weeks for them to respond to my inquiry with a solution (in this case, offer for replacement), but Onset did replace the 4 inoperable loggers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lew McC.",
          "Nb_Reviews": 1,
          "Date": "2021-11-13T20:42:49.000Z",
          "Titre": "MX2201 rugged, accurate, but slow to arrive and prices increasing",
          "Contenu": "We just deployed a MX2201 to a deep lake, 100ft depth for 10 days down to 4 deg C. Logged flawlessly, retrieval is fast and efficient. I would give 5 stars but delivery was slow and their prices went up suddenly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Beauchene",
          "Nb_Reviews": 2,
          "Date": "2022-06-27T20:14:15.000Z",
          "Titre": "Shipping took about a week longer than…",
          "Contenu": "Shipping took about a week longer than expected considering what I ordered was in stock. Other than that the Hobo data loggers are pretty nice and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rafael",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T17:52:33.000Z",
          "Titre": "Quick delivery and issues with items have great response time.",
          "Contenu": "I received the items ordered quickly and customer service has a fast response time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Quoc Luong",
          "Nb_Reviews": 2,
          "Date": "2022-01-12T18:26:41.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response. easy to use. the mobile app times out a bit, otherwise it works great. would like a smoother UI on the mobile app and they seem to be working on that. (pw save)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike P",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T16:47:21.000Z",
          "Titre": "Chip delays were a real pain",
          "Contenu": "Chip delays were a real pain. Other than that staff were great to work with, even when we had a change order prior to shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Beatriz  Ruiz",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T22:01:47.000Z",
          "Titre": "We have some problems with one…",
          "Contenu": "We have some problems with one thermometer with out reazon turns off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dawn Luna",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T17:39:53.000Z",
          "Titre": "Bad websit....Good product",
          "Contenu": "This was a terrible experience using your website but using the product has been great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Geoffrey Hibbert",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T13:24:32.000Z",
          "Titre": "Excellent size",
          "Contenu": "Excellent size, this is our second and we are pleased with the reliability"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rich DiBiase",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T18:59:46.000Z",
          "Titre": "The Customer service was great!",
          "Contenu": "The Customer service was great!However your description of what is included is misleading"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathryn Hassinger",
          "Nb_Reviews": 1,
          "Date": "2021-06-04T18:10:03.000Z",
          "Titre": "RECEIVED WHAT WAS ORDERED",
          "Contenu": "RECEIVED WHAT WAS ORDERED.  CHARGE AMOUNT WAS CORRECT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Stalker",
          "Nb_Reviews": 1,
          "Date": "2021-03-04T20:04:31.000Z",
          "Titre": "Your need more detailed information on…",
          "Contenu": "Your need more detailed information on your web site on how to use and set things up and how to download it.  Great product and great service but hard for my employees to show schools how to use they all want more detail videoswe also just used your product in a presentation for schools to use through out their buildingsI will be ordering more shortly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeanette Wyneken",
          "Nb_Reviews": 2,
          "Date": "2020-09-13T16:22:53.000Z",
          "Titre": "Good products, great customer support.",
          "Contenu": "My experiences with Onset's customer support have been very good, consistently.  My only gripe is with the software connectivity for those of us who use Mac computers to connect to some of our older devices.  The devices still work, but hours of software troubleshooting doesn't help.  Ultimately having to go online to buy a 10-year-old computer just to connect to a microstation is neither convenient nor practical."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 5,
          "Date": "2022-01-11T22:42:47.000Z",
          "Titre": "Great product and staff",
          "Contenu": "Great product and staff. Delivery is a little slow."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shelly McCord, RN",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T13:32:29.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I appreciate all the assistance they provided in explaining the product options and helping me sort out which best fit our needs.  The DDLs and Gateway help met our unique needs.  The Tech Support folks have been extremely helpful - willing to answer all questions and provide step by step assistance when we bump into a question.    The devices are not exactly plug and play, but their excellent customer service helps us over that hump."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daniel Lenel",
          "Nb_Reviews": 1,
          "Date": "2020-09-09T17:46:20.000Z",
          "Titre": "Website is well organized",
          "Contenu": "Website is well organized, datasheets and manuals available for download to make sure it's right for the application. Order was processed quickly. I was able to configure the loggers using the phone app. The phone app (Android) froze twice configuring the loggers, had to terminate the app and start again. Hence 4 stars. Loggers are simple, but right for the application (temporary temperature monitoring on a transformer). Time will tell how well they performed."
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "Zainab Faruqui Ali",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T05:44:02.000Z",
          "Titre": "The order with Onset went well.",
          "Contenu": "The order with Onset went well.But I was later contacted via email thT there was something wrong about the zip code. I contacted them back after e few days. By then Covid 19 was a big issue. Even if I had corrected the zip code, there were no guarantee when I would have gotten the protective boxes, because Bangladesh had complete lockdown by then. So I cancelled the order. Ms. Janet was very cooperative. Hope to order again when the situation gets under control by the grace of God. Thanks. Stay safe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2018-02-09T16:06:55.000Z",
          "Titre": "Fast delivery service, trouble operating the button",
          "Contenu": "Fast delivery service.  I had significant trouble with getting the button to work on HOBO MX2201 water temperature data logger also selecting one software option (to save on battery use) was confusing and seemed to make the button even less functional.  Tech support was very helpful.  I can now get the button to work but it sure takes more force (and patience) than indicated in the instructions."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jane S.",
          "Nb_Reviews": 1,
          "Date": "2018-10-23T13:04:02.000Z",
          "Titre": "So far everything is great with the…",
          "Contenu": "So far everything is great with the product. There were just a few bumps in knowing what to order so we were able to use the data logger in the way we needed to. Some confusion on what accessories were needed, but all was sorted out. Maybe this information is laid out somewhere on the website, I just didn't see anything when I was looking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacqui Thomas",
          "Nb_Reviews": 1,
          "Date": "2018-07-13T23:15:06.000Z",
          "Titre": "Five star customer service",
          "Contenu": "My customer service dealings have been 5-star 100% satisfactory and I would recommend Onset technical people and sales people to anyone.The four star rating is because the Onset equipment we are using now has had a few issues, all of which are finally resolved. The current equipment replaced our now-obsolete loggers and shuttle and software. The obsolete equipment was easier to operate and to work with in our (un-optimal) outdoor work environment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Wyse",
          "Nb_Reviews": 1,
          "Date": "2017-09-21T12:43:48.000Z",
          "Titre": "Good product, maybe better battery",
          "Contenu": "I like the quality of the product and appears to interface well with the App software.  I haven't done an exhaustive evaluation yet, but I'm anxious to explore more of its features.Initially, I'm wondering if the battery life should be longer, being that its a sealed system.  I'm assuming this requires me to purchase a completely new device when the battery is dead."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christoph Walser",
          "Nb_Reviews": 2,
          "Date": "2019-07-11T19:47:55.000Z",
          "Titre": "I have used Onset Data Loggers for over a decade",
          "Contenu": "I have used Onset Data Loggers (HOBO tidbit, DO logger) for over a decade and they have always performed well.  I would give them 5 stars except for the fact that I recently purchased the underwater temperature loggers (Bluetooth) and have been a bit disappointed with the ease of downloading data when in the field.  Communication between the logger and my Iphone only works when the logger is out of the water.  Once the logger is retrieved, data download to the phone is seamless, however."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frickus Rungus",
          "Nb_Reviews": 2,
          "Date": "2018-03-20T18:41:45.000Z",
          "Titre": "I love this logger with 1 exception",
          "Contenu": "I love this logger with 1 exception. It seems to want me to enable location service on my phone before I can interact with it. I purposely keep this function disabled to prevent unwanted tracking and do not see why this device would require it. This does not seem to be my requirement for logging and I would appreciate it more if it was optional."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CW",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T14:40:18.000Z",
          "Titre": "no wifi with CX5000",
          "Contenu": "wifi is hard to configure with the CX 5000 gateway. however all the other features of the data loggers work well. I have taken it upon myself to find a solution to the wifi problem with the gateway and when resolved will share the solution with onset."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Abdul Rehman",
          "Nb_Reviews": 2,
          "Date": "2017-11-02T16:16:22.000Z",
          "Titre": "guidance in Demo videos, How initially quick start and easy installation Instrument / logger Practically in the field",
          "Contenu": "Its pretty good to recommend best suitable as per our Application and process order gently and quickly in a shortest time. One thing to be added for guidance in Demo videos, How initially quick start and easy installation Instrument / logger Practically in the field/ Relevant Environment  video for new customer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Malcolm McClure",
          "Nb_Reviews": 2,
          "Date": "2019-11-18T22:39:55.000Z",
          "Titre": "Shannon Ryerson was outstanding at…",
          "Contenu": "Shannon Ryerson was outstanding at promptly answering my questions and walking me through the Onset ordering system.Having said that, the Onset catalog and ordering system are quite confusing.  They seems to assume the user is already fully acquainted with the product line and would instinctively know what parts will work together.  Without help, I could not figure out what sensors would work on my hard-wired (yet WIFI linked!) system.  For instance: Will Bluetooth sensors only relay data to a phone?  Or a data pod?  Or will they also link to an Onset base station?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Hinson",
          "Nb_Reviews": 1,
          "Date": "2019-01-28T16:56:26.000Z",
          "Titre": "Staff I dealt with was very helpful but problem not solved",
          "Contenu": "Staff I dealt with was very helpful and quick to respond. However, the Stevens water gauge device I bought from Onset appears to be faulty and I have talked with my case worker 6 days ago and have not gotten any more help. I have called several times and gotten no response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Hollenbeck",
          "Nb_Reviews": 1,
          "Date": "2020-02-19T20:25:19.000Z",
          "Titre": "Everything went well",
          "Contenu": "Everything went well.  I had a slight problem with printing out an order confirmation/receipt at the end of my order (I clicked through the last page not realizing it was my last opportunity).  I didn't receive an email confirmation for a couple days.  However, my accounting folks wanted something immediately.  An email to customer service and I received an order confirmation in a couple days, along with the usual automated version.This does not deter me from using OnSet again in the future.  I'll be more careful next time.  Good products and friendly customer service.  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Knappenberger",
          "Nb_Reviews": 2,
          "Date": "2021-02-15T13:42:37.000Z",
          "Titre": "Reliable reporting of data",
          "Contenu": "We installed an Onset HOBO station last February with the standard sensors as well as soil temperature and moisture sensors at a depth of 6\".  The cellular connection has been very reliable and the data has been consistent.  One thing that I would like to see is a better historical record that is accessible on the hobolink website.  As far as I can see it can only go back 1 month. The data does vary slightly from an older station that is also present, which does not make an initial difference, but as the growing season progresses we are noticing quite a difference in projected pest models.  This season we plan to look into this more."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Parrino",
          "Nb_Reviews": 1,
          "Date": "2018-05-02T13:34:43.000Z",
          "Titre": "I wish they would connect to my Wi-Fi",
          "Contenu": "I wish they would connect to my home Wi-Fi so I could see them remotely, and connect more easily instead of Bluetooth.  Maybe Bluetooth is used for battery longevity, but this would be nice.Also would like to be able to replace the batteries in the field."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "william Halloran",
          "Nb_Reviews": 1,
          "Date": "2018-02-14T15:03:31.000Z",
          "Titre": "Not only were the loggers a brilliant…",
          "Contenu": "Not only were the loggers a brilliant classroom tool, and really easy to use, but students who work in the field immediately saw applications for them in their \"real\" jobs....unfortunately, we did have one fail after one use....will contact support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Camarena",
          "Nb_Reviews": 1,
          "Date": "2019-11-27T01:47:34.000Z",
          "Titre": "I received a unit that did not work out…",
          "Contenu": "I received a unit that did not work out of the box.I called customer service and they were very helpful.They replaced the unit ordered with an upgraded one at no additional cost and they expedited the unit.Excellent customer service."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "SG",
          "Nb_Reviews": 1,
          "Date": "2019-01-31T21:24:19.000Z",
          "Titre": "Works great with minimal issues",
          "Contenu": "Works great with minimal issuesThere have been minimal issues with connectivity. It has always connected back to the network after losing connection. Although, it did require resetting the hardware a couple of times to get it to reconnect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T16:35:23.000Z",
          "Titre": "Great, but room for improvement.",
          "Contenu": "Overall the loggers work great.  Love the way the bluetooth can be disabled so they can't be tampered with when used in a public place. HoboMobile app is excellent.  On my wishlist: - Being able to re-start the loggers after a pushbutton stop (the 4-channel UXM-120 can do this) - A different color or blink pattern for the LED's to know if they are actively recording or are awaiting a start command (again, the UXM-120 is clear on the current mode) - Use a battery I can find at any corner store. The 2/3-AA Lithium is expensive and hard to find. Would much prefer a CR123, or 9V, or even a Lithium AAA like, ahem, the UXM-120 (sensing a theme here?)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Brown",
          "Nb_Reviews": 1,
          "Date": "2017-05-31T21:26:34.000Z",
          "Titre": "Good web support",
          "Contenu": "Good web support. Fast and accurate order completion.  We have worked with these sensors for several years now.  It did take some time to learn all the ins and outs of these sensors in terms of sensor placement, calibration, etc.Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Husic",
          "Nb_Reviews": 1,
          "Date": "2020-02-27T19:31:08.000Z",
          "Titre": "Awesome Product",
          "Contenu": "Awesome Product, quick service.Have used the OnSet Hobo product for over 20 years for temperature and humidity monitoring in an office environment:  The Bluetooth option is a real time saver for data collection."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Moshenrose",
          "Nb_Reviews": 1,
          "Date": "2019-06-26T18:52:20.000Z",
          "Titre": "Just started using the data logger",
          "Contenu": "Just started using the data logger.  So far it seems fairly intuitive.  I think the enclosure could be slightly larger to allow more room for the plugs and wires.  Also a dc adapter port would be a good addition"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karl",
          "Nb_Reviews": 1,
          "Date": "2020-01-23T13:14:27.000Z",
          "Titre": "Great products and the extra benefit of…",
          "Contenu": "Great products and the extra benefit of free downloadable software that can be used with most of them.  Perhaps because of popularity my order was slow to ship and one of the items was back-ordered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan",
          "Nb_Reviews": 1,
          "Date": "2019-07-17T13:42:13.000Z",
          "Titre": "I have used their products for several…",
          "Contenu": "I have used their products for several years. Some of the instrumentation document is not as easy to follow as I would like, especially on the website. They work well once you figure out what you need."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cx/RCx Happy User",
          "Nb_Reviews": 1,
          "Date": "2017-06-09T12:03:11.000Z",
          "Titre": "Everything was ordered and delivered …",
          "Contenu": "Everything was ordered and delivered without any issue.  The only critique is that in today's age (2017) of technology there should be significantly more memory storage capacity in the U12 devices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matthew  Desmarais",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T19:50:00.000Z",
          "Titre": "Great products and support",
          "Contenu": "Great products and support, but a bit pricy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jay Freeman",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T14:47:34.000Z",
          "Titre": "Ordered loggers on a Thursday and paid…",
          "Contenu": "Ordered loggers on a Thursday and paid for overnight delivery to get them by Saturday.  They didn't get shipped until Monday and I was already out of town for 3 days. Jay"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chad",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T18:29:38.000Z",
          "Titre": "Great data loggers",
          "Contenu": "Great data loggers. Generally work as intended, occasionally have issues with probes or corrupted data files. Would be nice if they would get away from the mini USB and go to micro or C type USB."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANTHONY STARESINIC",
          "Nb_Reviews": 2,
          "Date": "2020-07-16T21:57:19.000Z",
          "Titre": "Ordering was straightforward enough",
          "Contenu": "Ordering was straightforward enough. No notable problems. I would like to have seen an easier way to filter products that track temperature and humidity and then see the choices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Kersten",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T22:57:31.000Z",
          "Titre": "Products are great shipping took awhile."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Sutherland",
          "Nb_Reviews": 8,
          "Date": "2021-03-10T12:16:25.000Z",
          "Titre": "Dependable products",
          "Contenu": "Ordered a U24-001 conductivity data-logger.  Didn't expect that it would take almost a month to fulfill the order.  Otherwise, very satisfied with this company."
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "Donatus Angnuureng",
          "Nb_Reviews": 1,
          "Date": "2018-02-23T19:36:55.000Z",
          "Titre": "Everything was perfect",
          "Contenu": "Everything was perfect. The only problem is that I was expecting door to door delivery but the package was left at the port and i had to go and pay duty tax before clearance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shaharah",
          "Nb_Reviews": 2,
          "Date": "2021-03-26T19:53:14.000Z",
          "Titre": "Needs minor improvements",
          "Contenu": "I like that mostly everything can be done on line. But... for a company that buys as many loggers as we do, entering only 5 at a time is cumbersome."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Dunshie",
          "Nb_Reviews": 1,
          "Date": "2018-08-16T12:11:14.000Z",
          "Titre": "We eventually got what we needed",
          "Contenu": "We eventually got what we needed.  There was a misunderstanding on the product with the first order, but we resolved that and the return was easy and went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2017-06-30T00:22:14.000Z",
          "Titre": "Does what they are reported to do.",
          "Contenu": "I ordered the product, there was no price break for quantity.  I paid the asking price.  Done deal.  Great product.  Tidbits do everything they are supposed too."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Luis Dominguez",
          "Nb_Reviews": 1,
          "Date": "2017-08-05T14:52:42.000Z",
          "Titre": "Very good product but need manuals",
          "Contenu": "Very good product, but to in addition to tutorial videos, will be nice you to provide good user manuals in regards how to operate the different divices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AECOS",
          "Nb_Reviews": 1,
          "Date": "2017-11-01T01:05:19.000Z",
          "Titre": "Ordering was easy",
          "Contenu": "Ordering was easy.  We have not yet used the items so I can't say much about them regarding usage, quality, whether or not they will hold up, etc."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T18:48:17.000Z",
          "Titre": "The process was simple and efficient",
          "Contenu": "The process was simple and efficient. I was missing the shipping label for the return, but reaching out and resolving the issue was painless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2018-01-29T02:02:20.000Z",
          "Titre": "Just started using the data loggers I …",
          "Contenu": "Just started using the data loggers I got, but so far they've been easy to set up and deploy.  Customer service was great, folks were helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcus Duke",
          "Nb_Reviews": 1,
          "Date": "2018-07-23T23:42:30.000Z",
          "Titre": "Only had it a week",
          "Contenu": "Only had it a week, so a bit soon to give a substantive rating, but so far, so good. Very nice feature having a smartphone app to read the data."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve W",
          "Nb_Reviews": 2,
          "Date": "2018-11-27T15:08:32.000Z",
          "Titre": "phone support may or may not be…",
          "Contenu": "phone support may or may not be immediately available when called. they do call back. only on one occasion did they not figure out the problem"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Smith",
          "Nb_Reviews": 1,
          "Date": "2019-12-09T22:28:34.000Z",
          "Titre": "The button action",
          "Contenu": "The button action to activate the pendant is erratic. It takes several attempts each time I try to activate the unit.  Needs improvement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tony Koch",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T18:33:49.000Z",
          "Titre": "Prompt service via on-line purchase",
          "Contenu": "Prompt service via on-line purchase.  Well labeled and understood price.  Excellent purchase experience.  Equipment shipped very promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2017-10-05T13:56:10.000Z",
          "Titre": "Good product",
          "Contenu": "Overall, a decent product from a good company. The only thing I didn't receive was an invoice, but I got one after contacting the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Leigh",
          "Nb_Reviews": 1,
          "Date": "2019-01-04T20:13:57.000Z",
          "Titre": "Instructions that should be in the manual, but aren't.",
          "Contenu": "I purchased two MX2201 temperature loggers. I had significant problems getting them to operate, which were resolved by courteous and knowledgeable tech David MacDonald. But the fact is that I should not have had to call in, since what he told me should have been in the manuals, perhaps in boldface.1 - You must push down really hard on the little dot to turn the unit on. I pushed firmly, but it's an instrument, and I didn't realize I needed to push far harder than for any normal switch. Dave explained it's to prevent accidental on/off action, which is fine, but there should be a note in the manual and the \"quick start.\" 2 - I had the two devices next to each other and to the iPhone on my desk. Only one would connect. Dave had me move them apart, saying the Bluetooth streams could interfere with each other. Problem solved. This should be in the manual and the \"Quick Start\" as well.  I look forward to many happy days of data logging. -Richard Leigh"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JAM",
          "Nb_Reviews": 1,
          "Date": "2017-06-01T13:42:36.000Z",
          "Titre": "Quick Turn Data Collection and Testing",
          "Contenu": "I bought a number of devices for a quick turn testing job. Chat customer service was really good. They helped point me to the correct devices and I was able to get a quick turn on the devices. The devices are pretty simple to use - there are a few tweaks that I would suggest to the development team, but they are simply better on good enough. I paid for the \"better\" version of the software. The software is so-so. The plotting capability reminds me of 1997. It is a bit clunky but I plodded my way through it. In the end I just got it to a point where I could export a decent CSV format and did all of the real analysis and data munging with Jupyter Notebooks, Pandas, NumPy, and SpiPy. These devices, and there is a great family of hardware, coupled with a good export routine linked to a Python back end (Jupyter, Pandas, NumPy & SciPy) provide a very powerful framework. The only reason I deducted 1 star was because the software is clunky and long in the tooth. Really nice hardware."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Virginia Boney",
          "Nb_Reviews": 1,
          "Date": "2018-04-30T13:29:01.000Z",
          "Titre": "The directions are too much",
          "Contenu": "The directions are too much.  Wish there was a more simple way to explain the set up.  So far I really like the data loggers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Hawkins",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T03:00:01.000Z",
          "Titre": "Excellent equipment and very responsive…",
          "Contenu": "Excellent equipment and very responsive on handling the buying transaction!Keep up the great work!Richard Hawkins"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Attn: Matt Wolicki",
          "Nb_Reviews": 1,
          "Date": "2018-06-26T16:22:54.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  Sometimes wonder on it being too easy and could miss certain steps ie stop when full or stop with button."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Josue Guer",
          "Nb_Reviews": 1,
          "Date": "2017-07-20T21:09:47.000Z",
          "Titre": "Quality customer service",
          "Contenu": "Quality customer service and devices. They attempt to have any and all issues completely resolved to your satisfaction."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MS",
          "Nb_Reviews": 1,
          "Date": "2018-03-27T01:23:32.000Z",
          "Titre": "Would have rated at 5 stars except 200A…",
          "Contenu": "Would have rated at 5 stars except 200A CTs we’re physically much larger than any conductor that is rated for 200A."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Knappenberger",
          "Nb_Reviews": 2,
          "Date": "2020-02-18T18:15:37.000Z",
          "Titre": "Great Flexibility in Sensors",
          "Contenu": "Our new station is up and running.  It arrived in many boxes, which was a bit intimidating, but was great for really understanding how it goes together.  This will come in handy if problems arise in the future.  I like how the parts are independent and can be added or taken out of the system.The reason I didn't give 5 stars is because our shipment didn't come with a mast or tripod.  I ended up going to Home Depot to get a pole to set all of the equipment on.  Also, I felt like I had to dig to get the overall setup instructions.  Each item came with directions, but as a whole I needed to know how to get it to come together.  I called customer support and they were very helpful in pointing me to the white papers that describe in greater detail what needs to be done.  Also there was not a user manual included.  this also was found under the resources tab on the website.  I am currently trying to configure the dashboard to my liking, which is not as easy as expected.  Perhaps a standard dashboard should be presented and edits allowed???  We are getting there!We plan to install 2 more sensors when the weather is agreeable - soil moisture and temperature."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary F. Shaw",
          "Nb_Reviews": 1,
          "Date": "2018-01-03T06:05:09.000Z",
          "Titre": "Unit could go to a lower temperature as …",
          "Contenu": "Unit could go to a lower temperature as I work with -25 degrees and the remote access is less then 100 feet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Glenn Dria",
          "Nb_Reviews": 1,
          "Date": "2018-04-06T02:10:23.000Z",
          "Titre": "Website is a little hard to navigate at…",
          "Contenu": "Website is a little hard to navigate at times, otherwise I've had great service for a number of years."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Stancil",
          "Nb_Reviews": 1,
          "Date": "2019-09-05T20:40:11.000Z",
          "Titre": "Ordering data loggers was easy and…",
          "Contenu": "Ordering data loggers was easy and quick delivery. Just thought what I bought was a little expensive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "george kalweit",
          "Nb_Reviews": 1,
          "Date": "2017-09-26T12:58:48.000Z",
          "Titre": "First use I was locked out of the room",
          "Contenu": "First use I was locked out of the room. Was able to connect and read it from the hall. Worked perfect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nice thermometer, great app",
          "Nb_Reviews": 1,
          "Date": "2018-09-26T11:19:17.000Z",
          "Titre": "Like this product but wish it had…",
          "Contenu": "Like this product but wish it had certificate of calibration and could be used for VFC vaccines."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregg Breese",
          "Nb_Reviews": 1,
          "Date": "2017-12-28T15:15:36.000Z",
          "Titre": "Because of the newness of the item it …",
          "Contenu": "Because of the newness of the item it was a little long in receiving the actual item"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Melhouse",
          "Nb_Reviews": 1,
          "Date": "2019-09-26T12:03:28.000Z",
          "Titre": "As a data logger works great",
          "Contenu": "As a data logger works great, software for analysis of data needs a little work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Espinosa",
          "Nb_Reviews": 1,
          "Date": "2019-05-31T21:32:21.000Z",
          "Titre": "I received the product quickly once I…",
          "Contenu": "I received the product quickly once I got it on order The website id difficult"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Z.",
          "Nb_Reviews": 1,
          "Date": "2017-08-14T13:27:07.000Z",
          "Titre": "Logger is perfect.",
          "Contenu": "Logger is perfect.Software isn't intuitive and could be easier to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jefferson County",
          "Nb_Reviews": 1,
          "Date": "2019-09-04T12:48:12.000Z",
          "Titre": "Easy set up and configure",
          "Contenu": "Easy set up and configure, took awhile to find app on iOS in Colorado."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal",
          "Nb_Reviews": 1,
          "Date": "2019-07-30T15:36:52.000Z",
          "Titre": "Great",
          "Contenu": "Great! Easy to use. Perfect for monitoring our warm and cold storage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence Bryant",
          "Nb_Reviews": 1,
          "Date": "2019-04-24T10:24:58.000Z",
          "Titre": "Great for monitoring humidity",
          "Contenu": "Great for monitoring humidity. but distance connection is not strong."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DALE MAUE",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T22:23:28.000Z",
          "Titre": "Good response to question and follow-up…",
          "Contenu": "Good response to question and follow-up information about product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Balon",
          "Nb_Reviews": 1,
          "Date": "2017-08-29T11:41:29.000Z",
          "Titre": "I had to call for the license …",
          "Contenu": "I had to call for the license #......otherwise everything  was A-OK"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Ellis",
          "Nb_Reviews": 1,
          "Date": "2017-05-31T21:40:01.000Z",
          "Titre": "Product problem upon receipt.",
          "Contenu": "Product problem upon receipt.Very prompt attention to the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Slanga",
          "Nb_Reviews": 1,
          "Date": "2017-11-06T00:32:50.000Z",
          "Titre": "Customer Service in helping me complete …",
          "Contenu": "Customer Service in helping me complete my order was excellent."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "PH ELECTRONICA",
          "Nb_Reviews": 1,
          "Date": "2017-08-15T12:25:40.000Z",
          "Titre": "The final client is happy but always …",
          "Contenu": "The final client is happy but always quality could inprove."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William H Clark",
          "Nb_Reviews": 3,
          "Date": "2017-11-14T16:30:22.000Z",
          "Titre": "Problems with the U23 PRO V2 RH/Temp recorders",
          "Contenu": "Onset HOBO data loggers have been fairly good and reliable.  We have had some problems with the design aspects of the U23 PRO V2 RH/Temp recorders.  Some of the problems have been addressed and fixed by ONSET and some have not.  The plastic lens would become clouded in the outdoor environment and thus we could not download the data.  In trying to remove the lens it would then just crumble.  ONSET developed an inexpensive plastic cap that protects the lens and that works great.  I don't know how any one would be able to purchase these as I don't find them in the catalog.  The RH end of the recorder is open to the environment and we always have holes in the membrane caused by insects or other animals.  This can not be good.  Some sort of protection needs to be added here.  The service kits are messed up:  The service kit for the battery included the replacement battery and orange O ring to hold the battery.  BUT the O ring that seals this end of the U23 is found in the service kit for the RH end of the recorder!  So one would have to buy the replacement RH sensor to get the O ring for the other end of the recorder.  Makes no sense.  Ordering instructions don't give sufficient info to sort all this out.Nov. 14 added note:  Also the service kit for the battery replacement needs to have the little silica gel packs added to it.  Instructions say that if they are pink they should be replaced (no real way to dry them in the field).  But there are none included in the package.  At a minimum the catalog should indicate that they are not present so that they could be purchased.  One would think these things would be tested before being placed in the catalog for sale....."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2019-06-26T09:55:34.000Z",
          "Titre": "Easy to place order by phone-prompt…",
          "Contenu": "Easy to place order by phone-prompt help and delivery"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "STEVEN A  FENNIMORE",
          "Nb_Reviews": 1,
          "Date": "2018-08-06T17:15:22.000Z",
          "Titre": "good dependable loggers",
          "Contenu": "good dependable loggers. we have used them for years"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph Page",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T22:06:39.000Z",
          "Titre": "I like the product and service has been…",
          "Contenu": "I like the product and service has been good"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Brad",
          "Nb_Reviews": 3,
          "Date": "2019-07-22T19:20:28.000Z",
          "Titre": "Fairly prompt service and order was…",
          "Contenu": "Fairly prompt service and order was correct."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Radhouane Akermi",
          "Nb_Reviews": 1,
          "Date": "2018-02-09T07:09:50.000Z",
          "Titre": "the improvement of HOBO system is …",
          "Contenu": "the improvement of HOBO system is appreciated"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LARRY DEFREES",
          "Nb_Reviews": 1,
          "Date": "2019-05-28T18:49:53.000Z",
          "Titre": "Great!",
          "Contenu": "Great! Worked out fine customer was happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Davisson",
          "Nb_Reviews": 1,
          "Date": "2018-02-20T23:21:13.000Z",
          "Titre": "reliable",
          "Contenu": "reliable, and have have very few problems."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Boyd",
          "Nb_Reviews": 1,
          "Date": "2019-12-04T13:45:07.000Z",
          "Titre": "It's good!",
          "Contenu": "It's good!Thank you,Steve"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gar",
          "Nb_Reviews": 1,
          "Date": "2018-04-17T15:27:09.000Z",
          "Titre": "Nice diagnostic tool and easy use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Moore",
          "Nb_Reviews": 1,
          "Date": "2018-01-19T00:16:12.000Z",
          "Titre": "Order and databack went smoothly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WHF",
          "Nb_Reviews": 4,
          "Date": "2019-10-31T18:19:57.000Z",
          "Titre": "Easy to set up and download"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gideon Dunkley III, C.",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T02:39:26.000Z",
          "Titre": "sales rep eileen sandherr helped me get…",
          "Contenu": "sales rep eileen sandherr helped me get everything I needed-- a lot of times with vendors they just ship me what I asked for, and don't take the time to show me additional add ons or required accessories, which is very frustratingbut this time around with the purchase of pressure transducers and data logging equipment, eileen helped me get everything I need. Also, Shannon Ryerson is really cool too and has helped me a lot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew O'Connor",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T23:46:46.000Z",
          "Titre": "Smooth order and delivery of items"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonya Myers",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T16:42:54.000Z",
          "Titre": "Representative was very helpful and…",
          "Contenu": "We had previously purchased a data logger and temperature probe, however we ended up needing a longer probe.  The representative was very helpful and friendly and was able to provide the information I needed to ensure I had the correct product. Product was exactly what we needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gordon Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T15:50:46.000Z",
          "Titre": "Ease of installation and support helped…",
          "Contenu": "Ease of installation and support helped greatly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben R",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T14:46:00.000Z",
          "Titre": "Great experience with a MicroRX station…",
          "Contenu": "Great experience with a MicroRX station repair. Something malfunctioned that could not be fixed by support talking me through the process, so they sent me a shipping label and have quickly repaired the station. Elton C. in particular has walked me through so many small issues that pop up, and through the repair process of the station. Really great support staff!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Bedford",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T03:13:21.000Z",
          "Titre": "Timely shipping, good communications",
          "Contenu": "Items were sent in a very timely fashion, exactly as ordered, and everything worked very well. Onset kept me well informed about the order status, and has provided multiple opportunities to learn how best to use the data loggers via webinars and other online resources."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Steenhuysen",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:24:11.000Z",
          "Titre": "Friendly and Fast",
          "Contenu": "Friendly, professional and FAST service from every person I was in touch with. Even when one of the temp loggers had to be delivered sooner than the lead time, they were able to send me a temporary unit. Great service indeed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Peterson",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T23:52:04.000Z",
          "Titre": "Bluetooth is genius",
          "Contenu": "No one makes  better long term, continuous, deployable  surface water temp loggers, and now they come with Bluetooth to connect and download without a pesky connector pack...  \"Take my money!\"   Great if you continuously  monitor smaller stream, rivers, irrigation tail water. Cheers!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 4,
          "Date": "2021-09-29T22:19:41.000Z",
          "Titre": "Onset loggers: \"they just work\" for over 35 years",
          "Contenu": "I've been using Onset loggers for 35 years and they have never failed me. They just work. The few times I've had problems, it was operator error, such as setting the sampling period wrong. They are rugged, precise, accurate, and last a long time. Communication between a host computer (now smart phones or tablets) is reliable and intuitive. Having used earlier software, I found I had  to understand a new routine with the latest HOBOConnect (phone and tablet-based) software, but that was only a minor bump in the road."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Whitney Skaling",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T22:25:15.000Z",
          "Titre": "ONSET a company that serves your needs, when you need it !",
          "Contenu": "Our company has relied on ONSET for a number of items including a special modified USB logging device for proprietary use.  We needed a thermocouple logger for ceramic production and they delivered a unit in days instead of weeks during these Covid shortages.  - ThanksMr. Whitney Skaling President SOILMOISTURE EQUIPMENT CORP."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martha Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T02:18:06.000Z",
          "Titre": "Jeremy was helpful!",
          "Contenu": "Jeremy was helpful when our debit card wouldn't accept one large payment, and broke the payment into two over two days. He made sure the equipment was shipped all at once."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Hilling",
          "Nb_Reviews": 1,
          "Date": "2021-09-28T19:10:49.000Z",
          "Titre": "3 out  of four units arrived with good…",
          "Contenu": "3 out  of four units arrived with good batteries, one was dead on arrival.    Update: Company quickly contacted me and sent out another unit which has been working great.  5 stars for customer service !Software install smooth and easy to use, intuitive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith",
          "Nb_Reviews": 4,
          "Date": "2023-07-06T18:00:03.000Z",
          "Titre": "Their equipment and software are great…",
          "Contenu": "Their equipment and software are great and easy to use 5 stars. However, having things in stock and customer service is far from excellent, I would give stock on hand 2 stars, and customer service 3 stars."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Munyon",
          "Nb_Reviews": 1,
          "Date": "2021-10-21T15:33:28.000Z",
          "Titre": "One tooth, two tooth. Red tooth, Bluetooth.",
          "Contenu": "Our new set of MX Water Level loggers arrived on schedule and were packaged safely and securely. I really like the Bluetooth feature which makes downloading data easy on rainy days in the Pacific Northwest."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Lasala",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T23:18:59.000Z",
          "Titre": "Very pleased with timing",
          "Contenu": "I was fully expecting to get these data loggers in July and was thinking about contingency plans. I was pleasantly surprised when they got here earlier than I expected and I think earlier than your rep had even guessed. I've never had an issue with onset's loggers onboarding and I fully appreciate their consistency."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hazel levine",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T02:59:23.000Z",
          "Titre": "Bill Farris has been extremely helpful…",
          "Contenu": "Bill Farris has been extremely helpful setting me up with the tools I need to conduct my research. Every time I call I learn something new from him and he is very patient with my questions pertaining to data loggers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C M",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T22:03:31.000Z",
          "Titre": "Incredible",
          "Contenu": "Incredible.  They pulled through with a late order, up against east coast shipping cutoff and made a miracle happen with overnight shipping.  Truly above-and-beyond service.  I am thoroughly impressed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Gardner",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T19:27:08.000Z",
          "Titre": "Absolutely fantastic customer service",
          "Contenu": "Absolutely fantastic customer service.  From the first phone call inquiring about a product need for a stream project we are required to implement, to the fast delivery of our product - the entire experience so far has been outstanding.  Thank you.  Matt"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn Pike",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T23:56:05.000Z",
          "Titre": "You beat your shipping estimate by 2 weeks!",
          "Contenu": "You beat your shipping estimate by weeks, and it got here in less than a week!  The Hobo U-20L-x logger is the backbone of my business; I use others but this provides the majority of measurements for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Simpson",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T12:22:36.000Z",
          "Titre": "The equipment works fine",
          "Contenu": "The equipment works fine, but when a problem comes up, it has been difficult to get prompt answers to my questions. When after a long series of email exchanges, a piece of equipment needed to be replaced, it was backordered for many weeks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff HAMON",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T13:24:49.000Z",
          "Titre": "Expedited service.",
          "Contenu": "Our HOBO data shuttle broke after many years of service.  We ordered another one and the projected ship date was going to be too late to collect mandatory compliance data in February.  I contacted ONSET and they were able to move the ship date up a month for me.  Very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 5,
          "Date": "2023-02-09T16:03:00.000Z",
          "Titre": "I had an issue with configuring  the…",
          "Contenu": "I had an issue with configuring  the HOBOs but Paula Murphy was great responding.Only disappointment is I did not know the HOBOs had non-replaceable batteries.  meaning they are disposable after a year.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Myers",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T22:26:56.000Z",
          "Titre": "Happy HOBO User",
          "Contenu": "I have been operating a network with dozens of HOBO sensors, including six different models, for a few years now. The equipment is reliable and the software interface is not too bad. I have interacted with both sales and technical service people and with only one exception they have all been extremely helpful. Ordering equipment and parts has always been easy and delivery on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard in Hayfork, CA",
          "Nb_Reviews": 1,
          "Date": "2021-12-22T16:51:53.000Z",
          "Titre": "Telephone customer service was excellent!",
          "Contenu": "Telephone customer service was excellent. I got good advice about the product that I needed and was told a realistic delivery date that was met.  These days I find that many companies promise a quick delivery and then follow up with repeated delays that amount to months.  Thank you Onset, for providing honest delivery expectations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valjeanne Estes",
          "Nb_Reviews": 1,
          "Date": "2022-06-19T16:48:29.000Z",
          "Titre": "Got my HOBOs",
          "Contenu": "Given supply chain, transportation, and other issues around getting anything delivered, Onset came through with fast delivery of the HOBOs I needed.  It was so easy.Thank you.Valjeanne"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Taylor Darnell",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T12:40:52.000Z",
          "Titre": "Customer service is next to none",
          "Contenu": "Customer service is next to none! I had placed an order for three sensors with an estimated ship date of late December but needed them to start a research project sooner. I was in contact with customer service and they moved my order up for early fulfillment and the sensors arrived within 3 weeks from placing the order (versus the original 10 weeks)."
        },
        {
          "Note": 5,
          "Lieu": "FJ",
          "Pseudo": "Helen Sykes",
          "Nb_Reviews": 4,
          "Date": "2022-07-11T05:09:47.000Z",
          "Titre": "I'm a long time user of Hobo U22…",
          "Contenu": "I'm a long time user of Hobo U22 temperature loggers and Onset have always been helpful with order follow up and urgent needs, and this was no different. I needed an order sent out urgently to meet a traveller, and they sent it extremely promptly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Donaho MSER",
          "Nb_Reviews": 1,
          "Date": "2022-07-20T19:56:39.000Z",
          "Titre": "We've been using Onset Hobos for several years",
          "Contenu": "We've been using Onset Hobos for several years now. I recently needed some additional USB cables.  The order was placed, shipped and received within a matter of a couple of days.  Service was excellent!  Hobo data loggers are a critical component of our environmental quality assurance program."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ethan Thomason",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T14:16:07.000Z",
          "Titre": "Longtime HOBO data logger user.",
          "Contenu": "We have been using Onset/HOBO products for years with high reliability. This order of sixty MX1101's came in with one bad unit but Onset replaced it quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aurora",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:57:15.000Z",
          "Titre": "Everything was a smooth and easy…",
          "Contenu": "Everything was a smooth and easy process. Easy to read, and easy to order. Fast delivery. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime Suarez",
          "Nb_Reviews": 1,
          "Date": "2021-12-20T15:24:05.000Z",
          "Titre": "Good morning",
          "Contenu": "Good morning, service was great, you worked with us regarding delivery times, we had some issues with the credit card charges last minute but, all worked out at the end.thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michaela Marincic",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T16:13:45.000Z",
          "Titre": "Seamlessly assisted us with using our…",
          "Contenu": "Seamlessly assisted us with using our tax exempt form as a nonprofit and changing the shipping address for our order as needed. Order arrived in a timely manner and well ahead of schedule."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dale Maue",
          "Nb_Reviews": 1,
          "Date": "2022-01-24T22:37:24.000Z",
          "Titre": "We have not installed the new units…",
          "Contenu": "We have not installed the new units yet, having to download the app and then go through the setup.However, the loggers were delivered much earlier than quoted and the shipping box was in good shape."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CyclingChemist",
          "Nb_Reviews": 2,
          "Date": "2021-08-16T22:33:09.000Z",
          "Titre": "Serious inexpensive devices.",
          "Contenu": "Onset hobo data loggers are serious devices for a very reasonable price. The free software does everything I need and works flawlessly. I have used their products for nearly 30 years. Not one of them has disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gilbert",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T21:37:14.000Z",
          "Titre": "Needed something rush",
          "Contenu": "Needed something rush and requested the product and 2-day shipping. Everything was on time. They had a confusion with my address and even called me to clarify it before sending it to make sure I got it without issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joann",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T18:06:00.000Z",
          "Titre": "The sales rep that I dealt with was…Janet Vacino",
          "Contenu": "The sales rep that I dealt with was very informative and made the whole process seamless. I received everything in a timely manner and did not have to go out of compliance with VFC like I thought would happen. Very satisfied with Onset."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tyler Joki",
          "Nb_Reviews": 1,
          "Date": "2021-10-19T15:34:17.000Z",
          "Titre": "Easy online ordering",
          "Contenu": "The purchasing process online was seamless and when I had an issue regarding shipping dates the customer service staff were extremely helpful.  Special shout out to Jeremy and the production team!  Everything's working great and all was in order."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Stephan Bruns",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T09:39:38.000Z",
          "Titre": "Thank you Onset Team",
          "Contenu": "Thank you Onset Team. Really helpful in all regards, answered all my questions and advised me properly, especially since I never used those kind of equipment before!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Sahagian",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T19:29:02.000Z",
          "Titre": "Onset is generally very good",
          "Contenu": "Onset is generally very good in terms of products and customer support.  I've used their products for decades and have rarely, if ever, been disappointed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pete",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T21:08:21.000Z",
          "Titre": "Warranty Replacement Success",
          "Contenu": "A 4-channel analog data logger was purchased and received. After extensive trials during the logger setup, it was determined that the display was malfunctioning. Technical support was then contacted to report and discuss the problem. As a result of the discussion, a warranty replacement unit was sent including a pre-paid return shipping label for the defective unit. The replacement logger was setup the same as the first unit and everything worked as expected. Thank you... technical support for your expert and prompt response!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jess gregory",
          "Nb_Reviews": 4,
          "Date": "2021-07-13T14:36:39.000Z",
          "Titre": "Pressure transducers an excellent pick!",
          "Contenu": "The transducers and equipment I've purchased from Onset have been wonderful to use.  They are a good product, the free software works great, and they are dependable.  I use them for freshwater depth for pond water surface elevation and weir water surface elevation.  Highly recommended product and company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chloe DeSousa",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T14:15:33.000Z",
          "Titre": "Great company",
          "Contenu": "It was recommended that I contact this company for information on their products as I run an animal blood bank at a veterinary emergency hospital. I called and left a voicemail to a sales rep asking about products. The rep called me back about extremely quickly and spent several minutes on the phone with me answering all of my questions. I never once felt rushed off the phone the sales rep was knowledgeable and able to answer every question. Once I ordered my products I was received them faster than was expected. The product was easy to set up with great instructions that were clear to follow. This product works exactly as I need it to and how it was explained to me. This is a great local company with staff that knows their product inside and out. They are willing to take the time to answer any questions. I highly recommend this company and will continue to use their products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T17:04:22.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I was very pleased with the customer service with my order.  Shannon R. was very patient and knowledgeable as he answered all my questions and gave me advice on which products to buy.  We received the products (UX100-003 dataloggers) and are very happy with them!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gus Yates",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T16:34:57.000Z",
          "Titre": "Prompt delivery just for me",
          "Contenu": "I needed one additional water level logger on short notice for a groundwater monitioring project. They were out of stock at the moment, but Onset hustled to come up with one for me before my site visit. Much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T20:19:25.000Z",
          "Titre": "I had called into customer service to…",
          "Contenu": "I had called into customer service to see which product would best fit my needs. They were so helpful in choosing the right fit. Ordering and install was easy. The unit has worked great. Will be using more of these products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Giles",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T15:27:16.000Z",
          "Titre": "Support is awesome - you will get the help you need to set it up!",
          "Contenu": "Had an issue with the first unit, they replaced it without to much issue. The data is very well displayed. A little complicated to set up however they have a tech team that was very very helpful. Sent videos and how to operate the device and spent time with me on the phone to go over the settings. Would recommend the device and the company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andres Meglioli",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T17:46:09.000Z",
          "Titre": "The web site is easy to navigate",
          "Contenu": "The web site is easy to navigate.  Products have are reasonably priced.  Delivery was on time.  I have used ONSET products for several years and the overall performance is good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tate Colbert",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T18:38:59.000Z",
          "Titre": "I was in need of Temp/RH loggers for a…",
          "Contenu": "I was in need of Temp/RH loggers for a pharmaceutical manufacturer temperature distribution study, and Onset was able to point me to the best logger for the job, deliver a large quantity ahead of schedule, for a low cost, and with great customer service.What more could someone ask for? I'll be looking to Onset equipment for all my logger and data acquisition needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K Halter",
          "Nb_Reviews": 1,
          "Date": "2021-05-23T15:58:31.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "ONSET is always helpful and friendly when I reach out to them. My company requires that we use a procurement system, and ONSET reps work with me in a timely manner every step of the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Rhoades",
          "Nb_Reviews": 1,
          "Date": "2021-12-15T14:08:26.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Calls are taken and responded to rapidly. Tech support was accessible and adept. They were able to answer our questions quickly and efficiently."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Ferrara",
          "Nb_Reviews": 3,
          "Date": "2022-11-17T17:12:37.000Z",
          "Titre": "Customer Support Superior",
          "Contenu": "Purchased a MX 2202 da ta logger. Customer service technician was able answer all my questions and work with me to setup the logger and run all necessary HOBO software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sr. DogFish",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T22:05:42.000Z",
          "Titre": "Always helpful and prompt",
          "Contenu": "You are always helpful and as prompt as supply chains will allow.  And I appreciate your patience with the CC issue given the end of the FY.  Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 1,
          "Date": "2021-04-12T14:07:34.000Z",
          "Titre": "Prompt response, excellent product",
          "Contenu": "I really appreciate Cindy helping to expedite my order!  I got the datalogger just in time for my needs.  It works great, and the software they provide is very comprehensive.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Art",
          "Nb_Reviews": 2,
          "Date": "2021-10-26T15:27:29.000Z",
          "Titre": "Love these loggers",
          "Contenu": "Love these loggers! Great way for us to compare the room tempos and humidity levels. Been using these units for years with complete satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Toennies",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T15:09:05.000Z",
          "Titre": "Great Customer Service.",
          "Contenu": "Great Customer Service.After order was placed, Onset honored our discount and credited the purchase.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fifield Cranberry",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T21:30:40.000Z",
          "Titre": "From initial contact to support after…",
          "Contenu": "From initial contact to support after purchase company has been very courteous and professional. Products seem to be well manufactured and set-up was very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amjad Farooq",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T15:51:08.000Z",
          "Titre": "In Temp logger set up",
          "Contenu": "Very good experience.  Ms. Megan was very patient in helping me set up the loggers.  It seemed complicated in the beginning to set it up but she went through the steps very slowly with me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T06:04:44.000Z",
          "Titre": "Great customer service experience",
          "Contenu": "Thank you so much for the replacement MX gateway adapter. It'll be great to have automated data collection again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ko Ko Zin",
          "Nb_Reviews": 1,
          "Date": "2021-08-04T19:08:54.000Z",
          "Titre": "We have been Onset customer for many…",
          "Contenu": "We have been Onset customer for many years. Onset-HOBO Data Logger products are great. Customer service is excellent. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Kleppinger",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T14:04:28.000Z",
          "Titre": "Onset provided prompt assistance to a…",
          "Contenu": "Onset provided prompt assistance to a technical issue I was having with a sensor.  They fully resolved it.  Thank you!I highly recommend Onset."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Georgakakos",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T15:56:29.000Z",
          "Titre": "Awesome customer service.",
          "Contenu": "Awesome customer service.Onset went above and beyond to get me sensors for a time sensitive study. Additionally, the sensors are convenient and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erik Crosman",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T02:14:39.000Z",
          "Titre": "Excellent product and great warranty",
          "Contenu": "Excellent product and great warranty. I ordered a bunch of temperature sensors for research. 95% of my sensors worked perfectly, and the 5% I had issues with after a few months they replaced right away. Great product! Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff N",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T16:38:20.000Z",
          "Titre": "Unmatched Customer Service",
          "Contenu": "Unmatched Customer ServiceExtremely easy to get a friendly, knowledgeable, and helpful representative on the phone. They were willing and able to get me a rush order for a time sensitive project."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BHT",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T19:57:26.000Z",
          "Titre": "We had issues with loggers that didn’t…",
          "Contenu": "We had issues with loggers that didn’t work and onset was so easy to work with and replace them with loggers that did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lesli Boles",
          "Nb_Reviews": 1,
          "Date": "2021-06-18T15:14:45.000Z",
          "Titre": "We received our order just as we…",
          "Contenu": "We received our order just as we requested.   We asked for specific dates for the NIST certification to occur, and they accommodated us with no problems at all.  Great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Kimmel",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T22:11:36.000Z",
          "Titre": "These meters are great",
          "Contenu": "These meters are great!  They are easy to install and they are user friendly.  The staff and technical support people are fantastic and very helpful.  I would highly recommend these meters and this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T12:46:09.000Z",
          "Titre": "Made a call to confirm a product was in…",
          "Contenu": "Made a call to confirm a product was in stock.  Received some of the best customer service.  I recommend this company and  products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dr",
          "Nb_Reviews": 2,
          "Date": "2021-08-18T02:09:38.000Z",
          "Titre": "Efficient and Helpful",
          "Contenu": "Their online order system was down but they still helped answer questions and prepare. Seems like a well run business. Very good products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Wilhour",
          "Nb_Reviews": 2,
          "Date": "2023-08-04T21:04:16.000Z",
          "Titre": "Onset is a to knotch company",
          "Contenu": "Onset is a to notch company, I really enjoy doing business with the friendly folks there"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angelia Curran",
          "Nb_Reviews": 3,
          "Date": "2022-08-26T19:30:12.000Z",
          "Titre": "Mobile Infusion Team",
          "Contenu": "Arrived on time.  Love the units.  We are providing Mobile Services for COVID Infusions and these work great in our vehicles with the fridges."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Korn",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T17:32:29.000Z",
          "Titre": "Great Service",
          "Contenu": "Shannon is a great rep.  He efficiently gets us quotes and expedites shipping when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Barnard",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:23:36.000Z",
          "Titre": "Fast shipping and correct products…",
          "Contenu": "Fast shipping and correct products every time!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "environmenttaklafn.ca",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T16:48:15.000Z",
          "Titre": "I learned a to use the new temperature…",
          "Contenu": "I learned a to use the new temperature logger. It’s great the new units have Bluetooth! Very excited about using these in the field"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandon Holzbauer-Schweitzer",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T21:37:52.000Z",
          "Titre": "Environmental Scientist Using the RX3000 in Alpine Conditions",
          "Contenu": "The Onset staff, specifically Mr. Thomson, was an incredible Sales Application Specialist. His responsiveness and knowledge of various topics made selecting the RX3000 monitoring station a no-brainer. Understanding the product was simple with the provided documentation and continued technical support. Installation at 10,000' ASL on a waste rock pile at the angle of repose was straightforward and was completed without issue. Having worked with similar systems, the product and personnel Onset offers are unmatched."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rhonda Naldo",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T20:00:23.000Z",
          "Titre": "Customer service is the absolute best",
          "Contenu": "Customer service is the absolute best! Very patient and helped me set up the loggers and gateways for 3 offices"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C. Elliott",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T13:21:15.000Z",
          "Titre": "First time storing vaccines",
          "Contenu": "Received in a timely manner. Instructions for set up can be better explained. Otherwise very satisfied with the product."
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Oleksandr Berzoy",
          "Nb_Reviews": 3,
          "Date": "2021-06-20T16:32:51.000Z",
          "Titre": "Have these loggers for more than 5…",
          "Contenu": "Have these loggers for more than 5 years already. Still the best solution for Clinical Trial IP monitoring."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nate from San Diego",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T00:37:26.000Z",
          "Titre": "Great products and service",
          "Contenu": "Great products.  Great service!  I have installed onset systems for several clients and it has been a success every time.  Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ted Beauvais",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T13:32:42.000Z",
          "Titre": "I only needed one HOBO to replace one…",
          "Contenu": "I only needed one HOBO to replace one that went missing.  They were very responsive and helpful and got it delivered rapidly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Lott",
          "Nb_Reviews": 2,
          "Date": "2022-07-13T13:18:08.000Z",
          "Titre": "Great customer service, great product and on time delivery.",
          "Contenu": "As always great customer service and great product!The digital hobos hold up and do the job for us. Will be buying again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gustavo Vazquez",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T18:40:51.000Z",
          "Titre": "It's a solid instrument",
          "Contenu": "It's a solid instrument, and I was able to call a human and ask questions about the software.  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Ohno",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T21:46:07.000Z",
          "Titre": "Would Highly recommend",
          "Contenu": "Very quick shipment and great email communication.  Special thank you to the sales personnel that provide quality contacts and advice."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradly Sturgeon",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T13:16:13.000Z",
          "Titre": "I requested a quick tour around on the…",
          "Contenu": "I requested a quick tour around on the purchase of a sensor and i received the product in 4 days in time for my research trip. THANKS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Shively",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T20:27:56.000Z",
          "Titre": "NNSLWC Review",
          "Contenu": "HOBO loggers and other items ordered were delivered ahead of projected delivery time with no fuss!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Vargas",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T16:34:30.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, material was quoted quickly. Order was placed and shipped on time.Thanks!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Lawson",
          "Nb_Reviews": 2,
          "Date": "2021-05-12T17:23:35.000Z",
          "Titre": "I have multiple generations of Onset…",
          "Contenu": "I have multiple generations of Onset devices and I like the way that they work seamless with the latest software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ned Lichpsinn",
          "Nb_Reviews": 1,
          "Date": "2021-06-28T14:01:36.000Z",
          "Titre": "It has been pleasant working with you…",
          "Contenu": "It has been pleasant working with you people. Hope to continue as we implement your product. Again thanks for all the help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "john sowles",
          "Nb_Reviews": 4,
          "Date": "2023-10-05T01:27:58.000Z",
          "Titre": "Customer service has always been and…",
          "Contenu": "Customer service has always been and continues to be the best!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dean Smith",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T14:52:41.000Z",
          "Titre": "Have used your products previously",
          "Contenu": "Have used your products previously, and always impressed with the quality. Not utilized this one yet; plan to soon. Thanks, DeanTri State Floors918.343.2553"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Starr",
          "Nb_Reviews": 1,
          "Date": "2022-07-27T14:26:22.000Z",
          "Titre": "Returning Process",
          "Contenu": "I had to return an item I purchased the Onset staff was extremely helpful and the return process occurred quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor",
          "Nb_Reviews": 4,
          "Date": "2021-05-13T15:32:22.000Z",
          "Titre": "Data Logger Order",
          "Contenu": "Easy to use website. Ordering was simple. Shipment of Data Loggers came in the date promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Miller",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T21:41:08.000Z",
          "Titre": "Worked great for our need",
          "Contenu": "These worked great for our need. We were glad to put them to use and verify the controls operation we have in place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Laforest",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T15:54:22.000Z",
          "Titre": "Fast, Friendly, and Helpful",
          "Contenu": "Friendly on the phone. Helped me choose correct item. Shipped immediately and arrived quickly."
        },
        {
          "Note": 5,
          "Lieu": "KG",
          "Pseudo": "Mirlan Daiyrov",
          "Nb_Reviews": 1,
          "Date": "2021-12-30T03:55:37.000Z",
          "Titre": "I am totally satisfied with the ONSET…",
          "Contenu": "I am totally satisfied with the ONSET company services. I will order again next time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Sillers",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T22:10:04.000Z",
          "Titre": "ONSET is AWESOME!",
          "Contenu": "Ordering the item was easy and we received it within a week of ordering. Great customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Collins",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T23:55:27.000Z",
          "Titre": "Equipment delivered on time",
          "Contenu": "Equipment delivered on time.  Plan to begin using it next week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Schmidl",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T14:06:51.000Z",
          "Titre": "I would like to recognize Andrew Thompson for excellent customer service",
          "Contenu": "I would like to recognize Andrew Thompson for his continued excellent customer service. He has provided me a continued stream of excellent guidance and referrals to technical support that has enabled me to radically expand the range of field activities the NH Department of Environmental Services Instream Flow Program is able to perform, based almost entirely on Onset equipment. I consider Andrew MY GUY at Onset. This week, Andrew acted quickly to resolve an internal Onset credit issue that threatened to prevent NHDES from ordering more of Onset's fine environmental monitoring equipment. I really appreciate his timely attention to this issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "albert Wallash",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T18:33:18.000Z",
          "Titre": "Onset went the extra mile and shipped…",
          "Contenu": "Onset went the extra mile and shipped mine out sooner...High quality help and support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Spaulding",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T17:24:05.000Z",
          "Titre": "Great to work with",
          "Contenu": "Andrew Thomson was great to work with and very helpful with all my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cliff Tyson",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T21:06:42.000Z",
          "Titre": "Andrew Thomson was great"
        }
      ]
    }
  ]
}