{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "optimustracker.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Corey",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T13:58:14.000Z",
          "Titre": "Got a product that doesn't work and…",
          "Contenu": "Got a product that doesn't work and paid for 6 months service that is no use to me. Said was going to send another tracker. Never got it. Tired of dealing with yall"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alicia Berry",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T01:02:43.000Z",
          "Titre": "It’ shuts off on its own for 3 days and…",
          "Contenu": "It’ shuts off on its own for 3 days and the owners witnessed it ..it is not accurate to the location at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dana J",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T23:09:55.000Z",
          "Titre": "Worked spectacular - Now it's Useless.",
          "Contenu": "Worked spectacularly Perfect for 3-months. OBD Unit.. Then- Optimus did what they termed as a 'Server Transfer' and the thing is useless. Do Not Transfer Servers - it never works / Leave them alone if they are working properly.  Why ? !! Please- either put the servers back as they were, or, reach out and replace this unit. - It worked so well.  What the heck happened? - Frustrating."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Ogletree",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T21:32:03.000Z",
          "Titre": "Terrible customer support I have 3…",
          "Contenu": "Terrible customer support I have 3 trackers two work great have been trying to get my defective tracker replaced been getting the run around for weeks.It wasn’t a rural area. If I am holding two gps in the same area and one is getting great signal and the other isn’t what does that tell. The rep on the phone said it’s no way a sims card or the antenna could possibly bad."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick  Rede",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T05:56:53.000Z",
          "Titre": "Wish I had a good experience but did…",
          "Contenu": "Wish I had a good experience but did not. Was sent a bad tracker. It got replaced. New one worked for a day. So I orderd another. Now I have 3 and none of them work. Just wasted my time and effort. VERY VERY FRUSTRATED AND DISAPPOINTED."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cheryl Bass",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T12:14:41.000Z",
          "Titre": "I received your recorder and it doesn’t…",
          "Contenu": "I received your recorder and it doesn’t work.  I plugged it in for a few hours to charge but that didn’t help, it still doesn’t work.  I sent an email to you guys about a week ago requesting a refund and have heard nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Velma Vega",
          "Nb_Reviews": 2,
          "Date": "2021-11-21T02:19:45.000Z",
          "Titre": "This tracker does not indicate when the car is shaking.  He only says the trips he made.  The other indicated any movement to me.  If my car is stolen, I don't know.  In complete disagreement",
          "Contenu": "No way to contac you!😡This tracker does not indicate when the car is shaking.  He only says the trips he made.  The other indicated any movement to me.  If my car is stolen, I don't know.  In complete disagreement"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ricky Jones",
          "Nb_Reviews": 2,
          "Date": "2021-09-03T20:20:39.000Z",
          "Titre": "This app is horrible",
          "Contenu": "This app is horrible. Still shows my trucks exceeding speeds that I know is impossible. Going going to figure out something else to do very soon"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Rogers",
          "Nb_Reviews": 1,
          "Date": "2022-07-10T02:27:30.000Z",
          "Titre": "Fraudulent charges",
          "Contenu": "Fraudulent charges. Not authorized payment. Took money out of account without permission."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Adcock",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T00:28:46.000Z",
          "Titre": "Tracker rarely worked and sent updates…",
          "Contenu": "Tracker rarely worked and sent updates for location. Paid for service couldn't even use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jodi Robertson Plaster",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T16:52:51.000Z",
          "Titre": "Rude customer service",
          "Contenu": "When I first got this tracker it was great! Worked for several months no problem then about 4 months later it stopped working and I sent 3 emails before I got a response. The employee for the company called me to troubleshoot and was nothing short of a smartass on the phone. Rude, and short. Also told me it hadn’t tracked in 23 days and why am I just now calling. This hit a nerve with me! My father has been in the hospital critically ill and this tracker was the last thing on my mind. Now that I have the time to follow up on it, I’m going to get a smart mouth attitude who wanted to argue me on the phone. I am really tempted to cut off service find another company but I will attempt to talk to someone else from the company before I do this but I suggest that this company starts recording these phone calls and maybe they will see how their employees handle calls. I told him I would call back tomorrow to talk to someone else other than him, His name was Joseph and I talked to him today, May 30th around 12:30pm and the call came from a Texas. I highly suggest that he never call me again. Thanks! J Plaster"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Cervantes",
          "Nb_Reviews": 1,
          "Date": "2021-07-23T16:54:24.000Z",
          "Titre": "Piece of crap never got signal",
          "Contenu": "Piece of crap never got signal, customer service were very rude, had to return tracker."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Burden",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T20:42:27.000Z",
          "Titre": "This gps does not work!!!!!!",
          "Contenu": "This gps does not work!!!!!!! The app is useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hunter Corson",
          "Nb_Reviews": 1,
          "Date": "2022-01-17T23:24:22.000Z",
          "Titre": "Battery only last 1.5 days",
          "Contenu": "Battery only last 1.5 days. On the 10 minute report"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer not happy",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T03:49:22.000Z",
          "Titre": "Slows.ow delivery",
          "Contenu": "Slow, delivery and no urgency from customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jer W",
          "Nb_Reviews": 2,
          "Date": "2021-10-28T20:56:11.000Z",
          "Titre": "I need aftersale support"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcee Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T18:44:35.000Z",
          "Titre": "Quit working after 3 days"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T13:45:17.000Z",
          "Titre": "The signal is not good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ernest Berdugo",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T23:40:26.000Z",
          "Titre": "Still having a lot of issues with the…",
          "Contenu": "Still having a lot of issues with the tracker and one of my vehicles, it's constantly losing GPS signal and it's used in a big city where cell towers are everywhere. Don't know how much longer I can deal with it until I need to switch to a different company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "mickey",
          "Nb_Reviews": 2,
          "Date": "2023-05-12T03:22:52.000Z",
          "Titre": "Not happy in Michigan",
          "Contenu": "My name is Mickey Shelby I've been with this company about 4 months I've had two different trackers and neither one seems to live up to its potential I have the 3.0 which is supposed to last 30 days between charging the most I've gotten is about 12 days very disappointed in Michigan"
        },
        {
          "Note": 2,
          "Lieu": "GH",
          "Pseudo": "Kobena",
          "Nb_Reviews": 2,
          "Date": "2023-10-24T22:41:46.000Z",
          "Titre": "This site is good and real"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Keith Jennings",
          "Nb_Reviews": 2,
          "Date": "2022-09-25T17:32:51.000Z",
          "Titre": "Tracker is not reading accurate no more and the signal is always on 0%",
          "Contenu": "Something is off about these trackers now they use to be great but now they are not as good as they use to be. The signal is always on 0%!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-05T03:55:10.000Z",
          "Titre": "I do not like that it does so quickly I…",
          "Contenu": "I do not like that it does so quickly I had to purchase an extra battery go it toLast more then 5 days and I don’t not like how inaccurate the track is in the map it will show the cat parcked in houses or traveling through them and also the worst thing is it’s consatant movement during parked time on the map and the many lines it creates with no movement"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ricky Jones",
          "Nb_Reviews": 1,
          "Date": "2022-05-06T21:54:47.000Z",
          "Titre": "Always having issues with my app.Have…",
          "Contenu": "Always having issues with my app.Have tried multiple attempts,nothing seems to fix.Contacted optimus several times,no good.Can’t zoom in or out on the track of the vehicles.Would not recommend…."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2019-09-17T03:33:10.000Z",
          "Titre": "Tracking Information",
          "Contenu": "Tracking InformationStill haven't received any tracking information. Will update this review as appropriate. Hopefully, I get my device! I need it soon and the lack of tracking information or even an email saying it has been shipped is extremely frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JANAE RANDALL",
          "Nb_Reviews": 1,
          "Date": "2021-07-18T21:38:18.000Z",
          "Titre": "I am disappointed",
          "Contenu": "I am disappointed. I was told in your ad that there would be a discount for my subscription since I have purchased 3 GPS devices from you. FALSE ADVERTISING"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ricky Jones",
          "Nb_Reviews": 2,
          "Date": "2021-07-20T18:52:09.000Z",
          "Titre": "You can't ever get someone to chat"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alley Ballard",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T01:25:07.000Z",
          "Titre": "Like your product",
          "Contenu": "Like your product , but need reminders about when subscription are about to expire and email stating options to renew ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NCj",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T03:31:24.000Z",
          "Titre": "My tracker quit working",
          "Contenu": "My tracker quit working June 11, 2023. A replacement was sent and it also doesn’t work. It is now Aug 22, 2023 and I still don’t have a properly functioning tracker."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T00:08:34.000Z",
          "Titre": "Great tech support",
          "Contenu": "Had issues with receiving updates help and solved really quickly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Parham",
          "Nb_Reviews": 3,
          "Date": "2023-07-18T20:04:51.000Z",
          "Titre": "Service is good most the time",
          "Contenu": "Service is good most the time, device is easy to charge and attach with the magnetic case to the car for your teen. Wish the battery was longer lasting, and the tracker had better graphics with more pinpoint locations the tracker bounces off buildings / sites often giving a bad location for final stop. Service seems 45.00 to high probably will switch to cheaper service for the next child."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T20:46:40.000Z",
          "Titre": "The tracking system does not follow the…",
          "Contenu": "The tracking system does not follow the plotted roads, streets, etc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom Blair",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T14:37:59.000Z",
          "Titre": "Some customer service guyes are a great…",
          "Contenu": "Some customer service guyes are a great help then others are not so good i been having issues with my tracker for a couple weeks now and i was sent out a version sim card experience got better for a few days so im being sent a replacement unit in all optimus products are great quality .. customer service  mite not be good depending on who answers the phone ..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 5,
          "Date": "2022-12-27T14:50:27.000Z",
          "Titre": "App and computer usage are quite a bit…",
          "Contenu": "App and computer usage are quite a bit different, had initial troubles with the unit. They had to send another with different settings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roman bayan",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T20:16:15.000Z",
          "Titre": "I thought the gps was live but it…",
          "Contenu": "I thought the gps was live but it wasn't when I was using it when the car is stop it doesn't tell me it stop on the location."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bonnie Peters",
          "Nb_Reviews": 5,
          "Date": "2022-10-06T22:15:49.000Z",
          "Titre": "Frustrating Experience",
          "Contenu": "Have the 2.0 for two weeks now and still can’t figure out how it works. No manual, no instructions I’m not even certain how it turns on. I think it’s charged and think it’s on as I put it in my car and could see it moving. Now I want to erase all that “sample” data and start out new but no idea how to do that. It should be noted I’m 77 and have little patience with these electronic stuff."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-05-07T23:05:30.000Z",
          "Titre": "Optimus 2.0 Tracker",
          "Contenu": "I got the tracker fast so the shipping was great, but I had trouble with the tracker because it would track my location I had to call the service number twice before they realized I had the wrong tracker number on my account, but other than that the tracker has a precise location and I love it!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steven Burden",
          "Nb_Reviews": 2,
          "Date": "2022-09-02T22:56:23.000Z",
          "Titre": "Recently I gave this gps a 1 star",
          "Contenu": "Recently I gave this gps a 1 star, however after playing around with it I’ve decided I was to harsh. I couldnt figure out the app but now I understand it a little better, so I raised it to 3 stars. Still having problems but hopefully I’ll figure it out and eventually give it more stars. :)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald G Anderson",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T09:11:23.000Z",
          "Titre": "Great product",
          "Contenu": "Great product sorry it cannot work in Jamaica"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 3,
          "Date": "2022-05-22T21:10:06.000Z",
          "Titre": "Pretty good so far",
          "Contenu": "Pretty good so far, but every 30 minutes is sends an alert that the trailer is moving when infact I havent moved it for over 24 hours. The G P S is off by 50 feet on location so when it gives a signal is shows moving 50 ft. OPTIMUS NEEDS TO REFINE THIS TO KEEP IT FROM ALL THESE FALSE MOVES."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SL",
          "Nb_Reviews": 2,
          "Date": "2022-02-01T19:48:57.000Z",
          "Titre": "Considering that I have been charged…",
          "Contenu": "Considering that I have been charged $19.99/mo for the past 11 months for a tracker that did not work and was only given one free month for reimbursement, I guess now that I received a working tracker, it works okay. Battery life appears to be decent, I just wish that it would provide an option for viewing exact addresses or locations other than just a zip code."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eric Winter",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T01:32:13.000Z",
          "Titre": "Constant product issues customer…",
          "Contenu": "Constant product issues customer service is good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Teresa Horne",
          "Nb_Reviews": 2,
          "Date": "2022-04-22T15:23:52.138Z",
          "Titre": "I love this product when it works",
          "Contenu": "I love this product when it works.  Easy to monitor and can control how often it updates which controls the battery usage.  However, once in awhile it will lose it's signal to the satellite therefore stops updating.  Be sure you have the right cell company in your tracker for your area.  I think it defaults to use AT&T which does not work well near my house.  Customer service personnel were nice and sent us a new one with Verizon programmed in.  It is better now but still drops connection on occasion and may take a day or two to reestablish.  I live in the city limits but bordering the country so that may effect the connection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Allison",
          "Nb_Reviews": 4,
          "Date": "2020-10-02T18:52:19.000Z",
          "Titre": "Okay, wouldn't bet anyone's life on it.",
          "Contenu": "There is a time where you have to reboot the app in order to get a updated account of where the GPS tracker is. It's not very accountable or reliable. I have a handicapped family member that I want to keep track because he can be in an accident or hurt. I would hate for that to occur and this be my only way to find him."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Too Trusting",
          "Nb_Reviews": 1,
          "Date": "2021-10-15T08:27:22.000Z",
          "Titre": "Everything was good except it wouldn’t…",
          "Contenu": "Everything was good except it wouldn’t give me the accurate location with the accurate time and it would show full signal but not current location"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "April  Jones",
          "Nb_Reviews": 1,
          "Date": "2021-09-20T13:21:02.000Z",
          "Titre": "Specific locations",
          "Contenu": "I am not please that the locations the vehicle is parked at are not listed.  Just a general city and state.  Not even a street name."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T09:56:43.440Z",
          "Titre": "I feel that the app needs to give more…",
          "Contenu": "I feel that the app needs to give more options as to where the tracker has been and bigger map options"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-01T11:30:23.000Z",
          "Titre": "would be nice to have better accurate…",
          "Contenu": "would be nice to have better accurate locations positions, most of the time it shows my vehicles either in the woods or inside buildings."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Loay Abo Eyad",
          "Nb_Reviews": 1,
          "Date": "2020-04-03T01:38:36.000Z",
          "Titre": "i set it up and it didn’t show on my…",
          "Contenu": "i set it up and it didn’t show on my phone what i should do ? i drove my car for 20 min and it didn’t work :("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wesley",
          "Nb_Reviews": 2,
          "Date": "2021-07-14T21:36:46.000Z",
          "Titre": "Better then the last one.",
          "Contenu": "It tracks better then the last one I had for the area I live in. Better features and options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2018-04-12T17:07:59.000Z",
          "Titre": "NOT CHEAP",
          "Contenu": "YOU COST TOO MUCH FOR PPL. THAT ONLY USE ONCE OR TWICE A MONTH. YOU NEED CHEAPER RATES"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "john scannell",
          "Nb_Reviews": 5,
          "Date": "2020-12-24T21:44:02.000Z",
          "Titre": "Sent three requests to change password…",
          "Contenu": "Sent three requests to change password and got no reset email"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos Landin",
          "Nb_Reviews": 2,
          "Date": "2021-07-27T19:13:12.000Z",
          "Titre": "Replacement unit arrived a week later…",
          "Contenu": "Replacement unit arrived a week later than promised."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2021-11-22T23:46:46.000Z",
          "Titre": "Battery life only lasted 2 weeks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 2,
          "Date": "2019-01-17T18:36:39.000Z",
          "Titre": "Tracking path SUX not accurate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John pride",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T22:25:57.000Z",
          "Titre": "Sales guy helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Magnum",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T17:37:41.000Z",
          "Titre": "Minor location glitch.",
          "Contenu": "Accurate location 99% of the time but occasionally it would have the tracker located about 5-10 miles away from my house when I had it stationary at home and not using it, weird. Other times it would get stuck in a location while it was actually moving but then eventually catch back up to actual location in a second."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T02:49:40.000Z",
          "Titre": "We had some issues at first but we got…",
          "Contenu": "We had some issues at first but we got sent a new unit and everything seems to be working great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Domenick Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T16:58:32.000Z",
          "Titre": "Overall, a solid investment.",
          "Contenu": "Product seems to be made with quality, and the tracking system works well. My only complaint is that the battery direct trackers don't have attachments for side-post batteries and require some extra work to attach."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Trying it out",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T02:01:04.000Z",
          "Titre": "It has been easier to use than I…",
          "Contenu": "It has been easier to use than I expected. However, there is no turn-by-turn on the map. There are straight lines that run at angles and it looks odd.  The final destination and the starting destination are not always accurate.  I plan to continue using it for the time being."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "emiliano",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T19:48:15.000Z",
          "Titre": "Great Customer Service: I bought this Optimus Tracker device…",
          "Contenu": "I bought this Optimus Tracker device and everything was easy and user-friendly. Now that i wont be needing for a while, it is even easier cancelling my subscription and tje person i talked to was very professional. More Power to Optimus👍"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "RSA",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T22:35:30.000Z",
          "Titre": "First time issue",
          "Contenu": "Usually absolutely fantastic.This week I had a movement alert...then tracking it my vehicle was moving..not being next to it, I had to call authorities to go see if it was being stolen. Found vehicle In place not moving. Gps tracker shows it moving and tracker still in the vehicle."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wilmer Marcano",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T19:15:27.000Z",
          "Titre": "Very good",
          "Contenu": "Very good, the fact that gps receives direct power from battery and is always working is a plus. I been testing it with my personal transportation to see the performance I am thinking to use it on my fleet company something that I noticed is the lost of signal in a few parts of the trip but also my wife cell phone lost the signal at the same moment, so I think is not a problem of the equipment"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gordon Perry",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T00:42:42.000Z",
          "Titre": "Longer battery life would be…",
          "Contenu": "Longer battery life would be appreciated.   Other than that it works great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marlon Brimmer",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T18:43:45.000Z",
          "Titre": "Very well",
          "Contenu": "Very well, good experience with this company so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Freddie Dwozan",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T18:48:28.000Z",
          "Titre": "Alerts on movement of equipment",
          "Contenu": "Alerts on movement of equipmentCancelation of monitoring contract was helpful.Will re-activate unit(s) when situation dictates.Customer Service was outstanding, courteous, helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marti",
          "Nb_Reviews": 4,
          "Date": "2023-03-20T03:13:32.000Z",
          "Titre": "Item works well",
          "Contenu": "Item works well. Could use a little more direction and description of what things do and how to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Antoinette Randolph",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T20:22:07.000Z",
          "Titre": "GPS seem to have trouble with accuracy",
          "Contenu": "GPS seem to have trouble with accuracy. I thought a couple of times to cancel."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven M Reinhart",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T00:12:30.000Z",
          "Titre": "Good tracker",
          "Contenu": "Has been a decent tracker for the price. My original one went bad after 5 months. Called the help line and they promptly sent me out a replacement at no cost. The app could definitely use some work as could the alerts, but for the money it's a good buy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bonnie",
          "Nb_Reviews": 2,
          "Date": "2022-09-17T17:28:13.000Z",
          "Titre": "One tracker worked as it should",
          "Contenu": "One tracker worked as it should. 2nd tracker had to be returned. The tracking is easy and simple to use. Have a 2.0. Getting a 3.0 for extended battery life. Customer service isn’t always on the same page but they are there and do try to help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "robert b georgeff",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T20:10:57.000Z",
          "Titre": "Abner told me where to go",
          "Contenu": "Abner told me where to go . And it wasn’t where most people tell me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T21:08:38.000Z",
          "Titre": "Initial unit didn’t work",
          "Contenu": "Initial unit didn’t work, but the team was responsive and sent out a replacement. Unfortunately, replacement was the wrong unit. They immediately sent the correct one when notified. Overall good service, just unfortunate it took two tries to get it right."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert L Barr",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T17:26:28.000Z",
          "Titre": "The guy was very patient and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amber Carey",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T01:03:04.000Z",
          "Titre": "Very nice and very professional and…",
          "Contenu": "Very nice and very professional and helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elaina Griffith",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T21:19:55.000Z",
          "Titre": "His headset was hard to hear tho"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank Freese",
          "Nb_Reviews": 4,
          "Date": "2022-08-17T19:15:49.000Z",
          "Titre": "It appears that software changes would…",
          "Contenu": "It appears that software changes would help track our vehicles, We see where one vehicle is tracking the wrong vehicle but at the correct location. The app really does very little to help"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2021-10-07T18:08:09.000Z",
          "Titre": "It works like it should",
          "Contenu": "It works like it should. Has an app to go with it which is great but I'm not sure how accurate it is. It doesn't really show you the exact location they are at more of a general area. Doesn't show them moving in live time just every time you refresh it it will move. I think it's good for the price but if you want something on point and spectacular you'll have to put some money into it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Evan Patterson",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T16:38:56.000Z",
          "Titre": "Tracker works great",
          "Contenu": "Tracker works great, shows where my car and my wife’s car is while we are out driving. Good features letting me know if we brake hard, drive too fast, harsh turning and other things. I think the price for this device is fair and the monthly subscription isn’t expensive at all. Would recommend this to anyone needing a GPS tracker."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen White",
          "Nb_Reviews": 1,
          "Date": "2020-12-02T20:31:30.000Z",
          "Titre": "Worth the Money!",
          "Contenu": "Excellent product. Very reliable and accurate.  I have hit a few glitches and sent an email asking for assistance. Every email was met with a quick response (within minutes).  I then had charging issues with my device, which were quickly resolved when they sent a new unit with a new cord.  Problem solved!  I will continue with the monthly service - - it's well worth it!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff Koz",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T22:08:49.000Z",
          "Titre": "We got this product because we wanted…",
          "Contenu": "We got this product because we wanted to keep track of an elderly driver. Worked as advertised. No problems.  The only issue I had was it needed charging. Before this we had an Automatic adapter. This was great because it plugged into computer port on the car and never needed charging. Automatic was bought out and that product was discontinued . The Optimus device has the advantage of other uses similar to the Spot Tracker where you could take it on a hike or bike and friends and family could track you. Depends on what you want but the Optimus is a very good product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lee Michael",
          "Nb_Reviews": 2,
          "Date": "2021-04-08T16:47:47.000Z",
          "Titre": "Great support team, solid hardware.",
          "Contenu": "Hardware: 5/5 so far after almost a year of useSupport Team: 5/5Constellation: 4/5 (some angles cause very delayed position reporting)App/Web interface: 3/5 (some basic functions are lacking, connection % always reads 0% regardless of positioning, etc. but apparently updates are underway)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robin Vitiello",
          "Nb_Reviews": 1,
          "Date": "2022-02-20T18:55:00.000Z",
          "Titre": "My tracker was no longer holding a…",
          "Contenu": "My tracker was no longer holding a charge. They sent me a new unit regular mail. When I finally received it they had sent the wrong plug to charge the new unit. I emailed immediately and they recognized their error and sent out the correct plug again regular mail. It took weeks to get the correct plug and unit and they did waive my monthly fee since I couldn’t use the unit. Had they overnighted the correct product they would have received a 5 star rating for amazing customer service. This is something I don’t want to be without for any long periods of time which resulted since I had to wait a long time for replacement to be sent regular mail instead of an overnight service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn Pippert",
          "Nb_Reviews": 2,
          "Date": "2022-07-22T01:06:57.000Z",
          "Titre": "Moms car tracker",
          "Contenu": "I would have given it a 5 but the first tracker we received had to be returned. But other than that we’re very pleased especially your customer service was top notch."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert  Little",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T21:02:02.000Z",
          "Titre": "I am satisfied with the tracker after I…",
          "Contenu": "I am satisfied with the tracker after I upgraded to 3.0. However, 3.0 did not have the \"SOS\" button. But using Verizon solved my (Frozen) problem as far as being able to timely locate the tracker's location."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Super Agent",
          "Nb_Reviews": 1,
          "Date": "2018-04-12T19:41:14.000Z",
          "Titre": "The tiny tracker that’s works",
          "Contenu": "The tiny tracker that’s the size of your hand will enable you to see where the vehicle or equipment is moving. The only down side is that at midnight the tracker will not be accurate due to the satellites passing over and picking up the tracker. Sometimes will make you think that the tracker was found and somone moved it, but in reality it’s just the GPS satellites been off by a couple of feet. Other than that the tracker will last up to 7 days and then will need to replace and recharge. It’s has an awesome app for it and you can see the it move."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 2,
          "Date": "2021-09-14T20:23:55.000Z",
          "Titre": "This device did exactly what it said it…",
          "Contenu": "This device did exactly what it said it would do… I love it… the only thing I wish is that you could get text messages instead of emails.  I would recommend this device if anyone is looking for a gps tracker"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anthony R",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T19:38:24.000Z",
          "Titre": "It is a simple and fairly reliable…",
          "Contenu": "It is a simple and fairly reliable application, with a very responsive support team. I've written to them a few times, specially at the early stages due to lack of knowledge working the app. Their support team made all the difference with their responsiveness, thorough explanations, and follow up messages.  As for the application, it could use a couple of enhancements on the reporting features, particularly, in the History inquiry, where a clock is displayed for you to input your inquiry. I find that a bit clunky, but not a big deal given that in the end, the tracker does what is supposed to do. And for those instances when I think there could be an issue, I contact their support team or my vendor and the matter is clear within minutes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHANNON HALEY",
          "Nb_Reviews": 2,
          "Date": "2019-08-27T04:46:45.000Z",
          "Titre": "I really like this unit...but",
          "Contenu": "I really like this unit, easy to use and the app works great! I just had an issue pop up today though and it's kind of frustrating. My unit is saying \"there is no date to report on this day\" & it's being driven all over today. The app shows the last thing that happened was 2 days ago. I never rec'd an alert of low battery, nor that it was turned off like my last unit. Any idea why it's reporting that there isn't any to report for today 8/26? Am I supposed to do something to the unit? I turned it on before attaching it to the vehicle, was there something else I was to push or? I never had this issue with my other unit. Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lou Manring",
          "Nb_Reviews": 1,
          "Date": "2019-09-02T11:01:54.000Z",
          "Titre": "I gave it 4 stars because it was easy…",
          "Contenu": "I gave it 4 stars because it was easy to install and set up. It was also easy to set up the geofences. I didn't give it 5 stars only because I haven't actually used it. If it works like claimed I would give it 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jadesha courton",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T15:31:32.000Z",
          "Titre": "So far so good",
          "Contenu": "I only had the device a few days.   So far its good GPS tracking, just didnt understand the functionality of map so i called customer service , for clarification and i think i am good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "bunny61",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T22:09:02.000Z",
          "Titre": "Bought this tracker to keep an eye on…",
          "Contenu": "Bought this tracker to keep an eye on my daughter.    I usually charge it on a weekly basis.   It  does have to be charged over night to get a full charge .    I would still recommend purchasing it. It’s  very accurate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 4,
          "Date": "2021-09-17T15:23:29.000Z",
          "Titre": "Great options for getting alerts and…",
          "Contenu": "Great options for getting alerts and notifications. Seems to be giving an accurate location, although sometimes seems to show different locations when parking in the same area."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T17:44:49.000Z",
          "Titre": "Support has been good",
          "Contenu": "Support has been good - timely responses and knowledgeable people. The tracker itself has had more glitches - false positive and false negative - than I expected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matt Tanner Luker",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T01:40:31.000Z",
          "Titre": "Exact location is a bit off and it…",
          "Contenu": "Exact location is a bit off and it seems like it jumps around sometimes while sitting still. But over all great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abigail pena de almonte",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T18:35:49.000Z",
          "Titre": "Very good excellent"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-02T04:08:11.000Z",
          "Titre": "Pleased",
          "Contenu": "I’ve only had it a few days. It got stuck once for a day but I called  and the issue was resolved quickly. I am pleased with the device and the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-12-03T10:30:09.000Z",
          "Titre": "Good customer service",
          "Contenu": "Device arrived with no instructions. Staff was extremely helpful to get the device activated snd working on my iPhone. Good value purchase !!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Marquez",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T22:29:53.000Z",
          "Titre": "My experience was great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lawrence OConnor",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T01:33:26.000Z",
          "Titre": "Great Service",
          "Contenu": "No issues,, questions were dealt with promptly,, excellent service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T00:26:13.000Z",
          "Titre": "Super helpful  Responds quickly to help…",
          "Contenu": "Super helpful  Responds quickly to help with troubleshooting."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2022-06-29T19:16:02.000Z",
          "Titre": "Nice tracker",
          "Contenu": "Nice tracker ,   No issues with this unit.  The app is very easy to use. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sunshine Greer",
          "Nb_Reviews": 3,
          "Date": "2022-02-28T15:31:06.000Z",
          "Titre": "Worked precisely",
          "Contenu": "Worked precisely. Wish the battery life was a little longer but certainly does what it needs to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Hughes",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T03:41:58.000Z",
          "Titre": "Good product",
          "Contenu": "Good product.  Set up was quick and easy.  Tracker now operational and sending a clear signal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WILLIAM S",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T04:12:52.000Z",
          "Titre": "Optimus Tracker is recommended",
          "Contenu": "(Update)September 14,2021Although there were some issues, they were eventually fixed. I requested my old tracker that had issues be replaced along with a new annual subscrption that I already had. Optimus Prime quickly responded to my request and my tracker was replaced within 2 business days. I do recommend Optimus Tracker because even though some problems may occur, their staff will be there to fix it.(Updated)Aug 25, 2021At first they were quick to help. Responds from emails were coming within minutes. Now I am receiving about 1 email per 24 hours. I'm am having issues for the past 5 days and is still going on. The tracking service I paid for an entire year keeps canceling on it's own everyday. I had to send emails to Optimus Tracker to fix it. It was fixed for the first 3 days but now the tracker has been inactive for the past 2 days and still on-going. Its quite disappointing. Due to poor services, I would not recommend this tracker to anyone.Aug 19, 2021Optimus Tracker support is great. They are very quick to responding to emails and helping customers. And the tracker works well and battery is true to the description. Recommened. Works well enough that I just had to buy 2 annual subscriptions. :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 2,
          "Date": "2021-04-04T23:45:27.000Z",
          "Titre": "Great! But pricey",
          "Contenu": "Love this unit. Wish it updated more than 10s. Biggest complaint is the cost $20 seems very steep."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-17T19:34:38.000Z",
          "Titre": "Very good!",
          "Contenu": "It’s really good 99% of time but lately it’s off a little just letting you guys know. To look in to it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-12T23:42:44.000Z",
          "Titre": "Works great",
          "Contenu": "Works great, only complaint is have to restart the app 2 or 3 times it crashes when you first open it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth K Adams",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T04:34:54.000Z",
          "Titre": "The representative was knowledgeable…",
          "Contenu": "The representative was knowledgeable helpful and quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DJM",
          "Nb_Reviews": 1,
          "Date": "2020-01-08T18:59:42.000Z",
          "Titre": "The tracker was easy to use and worked…",
          "Contenu": "The tracker was easy to use and worked precisely as to the purpose of my purchase!! Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NF",
          "Nb_Reviews": 1,
          "Date": "2021-12-26T12:52:46.000Z",
          "Titre": "We live in a rural area and sometimes…",
          "Contenu": "We live in a rural area and sometimes it freezes up or doesn't work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-22T17:18:25.000Z",
          "Titre": "Works really good",
          "Contenu": "Works really good, just a little slow on the timing of when the vehicle is moving"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ben Pearson",
          "Nb_Reviews": 1,
          "Date": "2018-04-12T19:36:18.000Z",
          "Titre": "I am Happy",
          "Contenu": "I am glad I am using the optimus tracking system in lieu of another I tried."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-18T19:55:06.000Z",
          "Titre": "Tracker is slow to update position",
          "Contenu": "Tracker is slow to update position of vehicle I have it on"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 3,
          "Date": "2021-06-02T22:35:41.000Z",
          "Titre": "Best service",
          "Contenu": "Great product and service for tracking my car.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2021-12-12T23:35:43.000Z",
          "Titre": "very inconspicuous but it did raise…",
          "Contenu": "very inconspicuous but it did raise eyebrows."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-28T18:25:03.000Z",
          "Titre": "Only had unit for a few weeks now",
          "Contenu": "Only had unit for a few weeks now. Works great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2020-04-08T14:42:28.000Z",
          "Titre": "Battery last well and sends a good…",
          "Contenu": "Battery last well and sends a good signal"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie Anderson",
          "Nb_Reviews": 1,
          "Date": "2021-08-03T01:35:49.000Z",
          "Titre": "Great product,Great customer service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-04T21:56:15.000Z",
          "Titre": "Not to accurate and short battery life"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TIMOTHY HOFFMAN",
          "Nb_Reviews": 2,
          "Date": "2021-09-29T19:24:51.000Z",
          "Titre": "Easy to use and effective."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jin",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T05:56:35.000Z",
          "Titre": "Good",
          "Contenu": "Very good !!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T21:15:06.000Z",
          "Titre": "The app crashed many times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald L Lofgren",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:40:07.000Z",
          "Titre": "Just got the system up and running…",
          "Contenu": "Just got the system up and running still exploring possibilities.Wish that it had live tracking but the 60 second intervals works. I knew this when I bought it.Sleep better at night with the system Installed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KS",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:39:17.000Z",
          "Titre": "Erick Was Amazing",
          "Contenu": "Erick was very kind, helpful and took care everything so quickly and seamlessly. He was also able to let me know why I wasn't able to take care of things myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:03:10.000Z",
          "Titre": "Optimus Tracker is the best of its kind and so is the company!",
          "Contenu": "Optimus Tracker is not only a product I have used and trusted for about a decade now but every time I have had a question or needed something, the customer service I have received just further exemplifies what a great company this is.  I highly recommend the product as well as the customer service that backs up the product.  They are fast to get back to you and always have taken care of my needs.  The only bad thing I can say is that they make me feel my age, because they remind me of the good old days when companies stood behind their products and cared about their customer base."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Ellen Crane",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:22:22.000Z",
          "Titre": "Quick call back and great service",
          "Contenu": "Quick call back and great service. Eric was professional and easy to understand. All my questions were answered. We will be using your service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Thompson",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T03:10:42.000Z",
          "Titre": "This tracker works exactly as …",
          "Contenu": "This tracker works exactly as  specified ! Very happy with my purchase !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramona Clements",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T18:31:16.000Z",
          "Titre": "Best customer service and product ever!",
          "Contenu": "Customer service for this company is at an all time high!!!!! I have never had such quick responses to fix a minor glitch in my tracker, as with this company. Anytime I have had a question or request, it has been immediately taken care of. Will definitely refer family and friends here and will definitely be back! Thank you for such a pleasant experience. 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Satisfied customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T04:01:33.000Z",
          "Titre": "Great customer service & product",
          "Contenu": "Great customer service, user friendly tracker with excellent dashboard and report portal. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T19:34:41.000Z",
          "Titre": "Great staff clear answers and quick…",
          "Contenu": "Great staff clear answers and quick response"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred Williams Jr",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T17:47:52.000Z",
          "Titre": "Very knowledgeable man",
          "Contenu": "Very knowledgeable man. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tee Lustica",
          "Nb_Reviews": 3,
          "Date": "2023-12-04T17:17:11.000Z",
          "Titre": "I would like to say one thing about…",
          "Contenu": "I would like to say one thing about Optimus Tracking.Thank God it exists. It has tracked my mother so many times when she got lost and it made it so easy to find her and when we were not available, we had the police stop her from driving around aimlessly until we got there. I would recommend this device for anyone, young or old, to be tracked so you know where they are. It's a small price to pay for peace of mind.Thank You Optimus Tracker.T.L., New Jersey"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Rice",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T22:47:59.000Z",
          "Titre": "A gentleman named Eric in customer…",
          "Contenu": "A gentleman named Eric in customer service helped me over the phone to set up a new account. Anyone reading this, I want you to know that my vehicle was stolen on the 22nd this month, and the individuals took out my on star box. Thankfully I had this little tracker on my vehicle and I was able to go straight to it and retrieve my vehicle. It's worth having."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanne hoeg",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:56:47.000Z",
          "Titre": "Very professional and patient",
          "Contenu": "Very professional and patient. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Ellis",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T00:18:35.000Z",
          "Titre": "Was a very big help and very respectful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Audrey",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T22:11:12.000Z",
          "Titre": "He has 100 customer service with a…5 star",
          "Contenu": "He has 100 customer service with a great personality and very helpful thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donnie Tilley",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T19:15:08.000Z",
          "Titre": "Product works great",
          "Contenu": "Product works great. Good customer service. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcia Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:42:04.000Z",
          "Titre": "AMAZING COMPANY!",
          "Contenu": "This device has made my life so much easier.  I have it in my son's car.  He is an adult, however, has Type 3 Diabetes and sometimes does not know where he is.  When it stopped working, I emailed Support and I had a response within minutes.  It truly is a Lifesaver!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Poblete",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:30:39.000Z",
          "Titre": "Besides the excellent products you…Satisfied and Returning Customer",
          "Contenu": "Besides the excellent products you sell, I was very impressed with the customer service that I just received from your company representative. He was very pleasant and courteous and was able to promptly resolve my issue at this time. Thank you and I will continue to be a satisfied customer.John Poblete"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicolas I Cantu",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T17:12:15.000Z",
          "Titre": "Great service quick access quick…",
          "Contenu": "Great service quick access quick results thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ulysses Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T00:57:08.000Z",
          "Titre": "I had problems finding my info the rep…",
          "Contenu": "I had problems finding my info the rep wait for me to find everything I need so  business minded and knew what was the problemA great experience for me😎"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aida Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T21:27:06.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service. Steven handle my call in a very professional and efficient manner.  He took care of my issue with the tracker immediately.  I been subscribed to this company for 2 years now. Never had a problem.  Highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenyatta S Brant",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T21:08:12.000Z",
          "Titre": "A1 service",
          "Contenu": "I've purchased a couple of trackers to monitor our vehicles due to recent break-ins, vehicle theft, and our previous apartment complex lack of security. I have not had any issue so far and it has been well over a year with both devices. I am sure there MIGHT be a better product out there with more features BUT for its small form factor, accurate location monitoring, alerts, and coverage its a great purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T19:25:26.000Z",
          "Titre": "Great device for location tracking",
          "Contenu": "Ease of use, 1 charge lasted a full week mostly, accurate location updates"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Clouse",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:33:35.000Z",
          "Titre": "My tracker lost connectivity with the…",
          "Contenu": "My tracker lost connectivity with the local cell carrier. Optimus sent me a new unit right away that was compatible with my local cell tower."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Whitehead",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T23:32:42.000Z",
          "Titre": "This Optimus is an incredible product…",
          "Contenu": "This Optimus is an incredible product that was easy to use. I was able to track my husband's vehicle when his confusion was at the beginning stages. I  followed the accurate map the Optimus app provided and drove to where he was \"lost\" to lead him home. As his driving became less safe, we decided he had to give up his keys. That is a big step. The process was made easier because of the Optimus Tracker app. The people at Optimus provided excellent customer service and the monthly fee was reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty Hanson",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T17:44:49.000Z",
          "Titre": "I have tried two different other…",
          "Contenu": "I have tried two different other tracking companies, Tracki being the first one, and I’m here to tell you none of them compare to the quality of Optimus I’ve done a side-by-side comparison Optimus is always consistent and correct. Don’t be fooled by the others. This truly is the best tracker on the market. I use them on multiple vehicles. The customer service is second to none I can’t say enough good about them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed quist",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:01:44.000Z",
          "Titre": "Very helpful 👌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SS",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:46:21.000Z",
          "Titre": "Adding new Tracker",
          "Contenu": "I received my new tracker today and I needed to add it to my account and remove my old one. I contacted Optimus through the Chat area of the website and chatted with Elisa and she made the process super easy and was veryfast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Attila Benoit",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T23:53:55.000Z",
          "Titre": "Wonderful device and great service",
          "Contenu": "Wonderful device and great service! I'll be a customer again for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T18:45:22.000Z",
          "Titre": "Answered all questions and was fast",
          "Contenu": "Answered all questions and was fast. Didn't have to wait on responses. Thank you very much. Love the product!!"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Andres Valencia",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:23:03.000Z",
          "Titre": "Amazing service",
          "Contenu": "Amazing service ! Super recommended ! Saved me every time ! No problems ever ! Great warranty"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yooooo",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T23:46:38.000Z",
          "Titre": "Did exactly what I needed done"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andi Adams",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T13:52:42.000Z",
          "Titre": "Recovered Stolen Skidloader",
          "Contenu": "We recently installed 75 GPS trackers on our heavy equipment fleet excavators, bulldozers, skidloaders, etc.  We had our brand new skidloader stolen over the weekend. The thieves cut the factor installed GPS. The power was also cut to the Optimus Tracker. The backup battery on the tracker allowed us to recover the $100K machine knowing its exact location. Highly recommend the tracker and the company. The customer service is outstanding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C Gurrra",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T13:43:13.000Z",
          "Titre": "A real customers opinion. 👍🏼👍🏼",
          "Contenu": "Devices are great.I have a couple. Service 2 thumbs up. Incredible customer service also. Quick with a response, professional and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cecilia Salas",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T21:25:50.000Z",
          "Titre": "Erick was Very helpful and quick to…",
          "Contenu": "Erick was Very helpful and quick to resolve my issue. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Crothers",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:39:12.000Z",
          "Titre": "It is a great investment",
          "Contenu": "i like the real time information and the exact location and speed my driver is doing. This was a test for us and we are going to purchase 2 more for our other vans."
        },
        {
          "Note": 5,
          "Lieu": "KG",
          "Pseudo": "Sergey Tamrazov",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T22:13:29.000Z",
          "Titre": "Abner is the best",
          "Contenu": "Abner is the best! He help me with my questions very fast and efficiently. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T19:00:02.000Z",
          "Titre": "Best Tracker I've Ever Had",
          "Contenu": "I use this device for my Turo Car Rental business so I can keep up with where my vehicle is and has been.     This little device will notify me at 10 Second intervals, so I can real time track it.Additionally, if the car is stolen, I at least have the last known location."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Alfaro",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T23:03:11.000Z",
          "Titre": "Eric made the phone call very easy",
          "Contenu": "Eric made the phone call very easy. He answered all my questions about my trackers up and running quickly and efficiently, took the time to ask me to rename the units to what I wanted nothing but a pleasurable experience with Eric today. Highly recommend him."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle E Gaub",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T20:09:26.000Z",
          "Titre": "Device works great",
          "Contenu": "Device works great. Ordered this tracker for my golf cart after reading reviews. Unfortunately the first tracker that was sent was faulty, Customer service was extremely helpful in troubleshooting the issue but resulted in a bad unit. but Optimus sent a replacement immediately (arrived the next day) and it works great. Though be mindful this tracker GB100 only works for batteries between 12-24V so I had to get a DC converter for it but ended up working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric Tidrick",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T23:09:54.000Z",
          "Titre": "I used the Optimus tracker on delivery trucks",
          "Contenu": "I used the Optimus tracker on two trucks that were making deliveries. I knew how long it would take them to return to base to pick up new deliveries. The trackers showed the speed of the trucks, so I also knew that my drivers were not breaking the law. It all worked out really well from a management standpoint. Thanks for your great trackers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John F - USA",
          "Nb_Reviews": 3,
          "Date": "2023-11-05T21:02:05.000Z",
          "Titre": "The folks at Optimus were great…",
          "Contenu": "The folks at Optimus were great resolving my issue.  I have two trackers - car and motorcycle - and my car tracker stopped working a few weeks back.  They had me run through a few tests and after those failed they quickly got a new unit to me in the mail.  They had me up and running again in a week."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristopher Ehlen",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T22:02:59.000Z",
          "Titre": "Abner was awsome",
          "Contenu": "Abner was awsome! Love your guys service it really helps our business function great. Great customer service!  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darrell K",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T17:44:14.000Z",
          "Titre": "The support staff went out of their way to ensure I was a 100% satisfied customer 😀",
          "Contenu": "The support staff went out of their way to ensure that I was a happy and satisfied customer! They replaced an item without my asking, and suggested potential remedies incase I was not 100% satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karma S.",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T20:27:26.000Z",
          "Titre": "Tracking device worked well and the…",
          "Contenu": "Tracking device worked well and the company was easy to contact and get help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike  M.",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T22:24:49.000Z",
          "Titre": "Experience in dealing with Optimus Trackers",
          "Contenu": "We bought these trackers a few weeks ago to keep track of our service trucks/employees.  They have been great knowing where they are and when they are there. We made a few account changes, and added two additional trackers.  The whole set up process was really easy and the people we've dealt with have been nice and prompt too.  One of our trackers came up missing (hummmmm) and we had to replace it with another. Just spoke with Elisa and she was very helpful in moving a new tracker to the subscription.  Thanks you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MLMC",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T18:22:03.000Z",
          "Titre": "Tracker product - great value, great performance",
          "Contenu": "The produce they offer, the trackers, and the web-based interface/app worked great for me.  I was in the middle of a contentious custody issue... and accused of being places I wasn't, and this was able to help me show what was really going on and helped turn the tide.  I really needed something I could rely on, and that was easy to use, and easy to document for proof.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LENNY QUINTANA",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T17:50:02.000Z",
          "Titre": "I got this to monitor both teenagers…",
          "Contenu": "I got this to monitor both teenagers who started driving at the same time. Gave me piece of mind knowing where they were at all times. Only issue was getting alerts for harsh braking and acceleration. At times they swore up and down that it had to have been a false alert. Although it very well might have been, it still made them be safer drivers as they didn't want to hear me get on to them about their driving."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gwen Brown",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T17:48:00.000Z",
          "Titre": "The gentleman at this company is so…",
          "Contenu": "The gentleman at this company is so wonderful and very nice to talk to about any situation, problem, or concerns you may have and they are so easy to work with you.  Eric was the customer representative that I spoke with on 9/12/23 and he was so sweet and helpful towards my questions that I asked.  Thank you so much for everything, companies need more people such as yourselves. God Bless!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARCAL R POULLARD",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T00:06:29.000Z",
          "Titre": "Answer the phone quickly.  Provided accurate and easy to follow instructions. Courteous.",
          "Contenu": "Representative answered my questions quickly and was very courteous.   Was easy to understand his speech."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T20:03:58.000Z",
          "Titre": "Tracker helped recover stolen truck - worth the money!",
          "Contenu": "Having the tracker installed in our fleet of vehicles helped us to recover a stolen vehicle within hours. If it weren't for the tracker, we would have never seen our truck again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camie Herkomer",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T01:47:45.000Z",
          "Titre": "The staff I spoke with were helpful and…",
          "Contenu": "The staff I spoke with were helpful and quick to respond to my email communication. I appreciate that they sent a new tracker because mine broke. I will return the broken one next week. Very professional staff. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine T",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T20:45:51.000Z",
          "Titre": "I was having trouble canceling the…",
          "Contenu": "I was having trouble canceling the account online. I spoke to Eric over the phone. He was courteous, professional and was able to walk me through canceling within minutes. I would not hesitate to use Optimus again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Quezada",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T20:49:30.000Z",
          "Titre": "I am very happy with your service",
          "Contenu": "I am very happy with your service. They responded whenever I contacted them and they solved my problem. For me, your service is Excellent.Thank you 😊😊😊"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Yosmany Paez",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:37:02.000Z",
          "Titre": "Excellent equipment",
          "Contenu": "Excellent equipment, I’m very happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katryn Kesler",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T17:17:21.000Z",
          "Titre": "Small price to pay for peace of mind",
          "Contenu": "Today I canceled my service, but it’s not the company’s fault. I purchased this GPS when I had a teenager who I needed to keep track of. It worked as it should, and gave me peace of mind. In my opinion, the monthly fee was reasonable. To my remembrance, I’ve only called the company twice, and both times the representative was very helpful. I have nothing but positive things to say about them. My child is now an adult, so I no longer need, but I would not hesitate to use again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William G",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T23:59:40.000Z",
          "Titre": "Kings of Customer Service",
          "Contenu": "Initially bought the incorrect tracker for my moped. Called customer service and they immediately answered and sent me a link for the correct one. They even refunded my maintenance fee for the incorrect device. 10/10 service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alastair Gordon",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T01:00:18.000Z",
          "Titre": "Fast response and great support",
          "Contenu": "Eric walked me through the steps needed to activate notifications. THANK YOU Eric !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Craig",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T00:15:58.000Z",
          "Titre": "I loved the tracker",
          "Contenu": "I loved the tracker, up to date and minute accurate location would recommend it if you want to see where your kids and car are."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trudy Gary",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T00:38:02.000Z",
          "Titre": "Very informative and helpful in sending…",
          "Contenu": "Very informative and helpful in sending a legend of possible alerts on tracker map. Thank you 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Borougerdi",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T17:05:36.000Z",
          "Titre": "Very easy to install",
          "Contenu": "Very easy to install. And customer service was very good and easy. We just bought a second one because of how happy we are with the first one. Customer service even added to second to my account for me saving me time. Great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria M. Palaios",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T01:19:51.000Z",
          "Titre": "Staff was friendly and knowledgeable",
          "Contenu": "Staff was friendly and knowledgeable. Made the entire experience an easy process from purchasing, to set up, and to managing the equipment!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T16:38:57.000Z",
          "Titre": "Superb customer service",
          "Contenu": "Eric was VERY helpful with my password. It text me to see if he entered it correctly and made sure I was able to login as well. Superb customer service!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T18:53:49.000Z",
          "Titre": "Wonderful company",
          "Contenu": "Have had service with this company for over 3 years. Started with one tracker. Now have 5. They are awesome. The devices perform great. Such peace of mind in this day and time. Every time I’ve had to call with a question about my account, or to add a new device. The staff has been wonderful.  Thank you Eric for your help today."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Samuel J Lencke",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T04:17:59.000Z",
          "Titre": "The service was incredible",
          "Contenu": "The service was incredible. The rep on the phone was very patient in working with me to try to solve my service issue and finally decided to send me a replacement unit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe S",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T04:08:54.000Z",
          "Titre": "I have the Optimus GV75MG tracker",
          "Contenu": "I have the Optimus GV75MG tracker. The install is simple. I have spoken with a representative from the company twice. It was in the evening both times. I was surprised to find a person to speak with, instead of a recording directing me to a website. The service was excellent.The accuracy of the tracker is outstanding. It drops breadcrumbs, or whatever they call them. The cellphone app is easy to use.The GV75MG is designed to be connected to power; however, it has a backup battery that's main purpose is short term backup. I needed to use the unit for a short trip without a power connection. I called Optimus to see if there was a way I could extend the battery life. The company successfully sent a command to my unit which allowed the tracker to completely sleep while not in motion. The tracker accurately detailed my location for 180 miles to the destination. The vehicle was moved a few times during the next three days. Those moves were recorded. The tracker lasted approximately 60 miles on the return trip. I believe that's excellent for a unit that has a backup battery that I was using for an unintended purpose. After the trip, I called the company and they remove the battery saving command. They have GPS trackers that are designed to be used without being connected to a battery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronnie Latham",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T20:40:34.000Z",
          "Titre": "Answered my questions and provided the…",
          "Contenu": "Answered my questions and provided the information I needed to correct the problem. Very pleased with customer service and the product!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Humphries",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T21:12:04.000Z",
          "Titre": "Very nice and helpful and quick…",
          "Contenu": "Very nice and helpful and quick couldn't ask for a better company really appreciate the wonderful service  Thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:49:05.000Z",
          "Titre": "Review of my track down units",
          "Contenu": "The tracking system is easy to use once you get use to it. I like the 30 sec updates. I will be installing 2 trackers more on my vehicles soon. I hope you give discounts on more installed units."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T22:02:29.000Z",
          "Titre": "Easy swap out!",
          "Contenu": "Very quick & easy. Very professional!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Quickel",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:30:41.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Will use again when needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris harrison",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:52:19.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, fast and reliable. Thank you for your help so much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Nicholson",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T23:33:37.000Z",
          "Titre": "So much more information, not just where the vehicle is.",
          "Contenu": "It tracked the car perfectly. It lets you know when it's parked and the speed limit along with other information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T15:30:19.000Z",
          "Titre": "Quality Service",
          "Contenu": "I have been using Optimus trackers for several years. They are always reliable and the customer service is first-rate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry Todd",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T20:33:19.000Z",
          "Titre": "Great experience. Will recommend",
          "Contenu": "Great service. Folks are easy to work with.. customer service is outstanding"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "G L M",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T23:59:24.000Z",
          "Titre": "to call or use chat, simple and very helpful",
          "Contenu": "It was your man on the other end of chat, guided me through the process of setting it up on my computer. thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert brown",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T00:47:35.000Z",
          "Titre": "Abner  was a big help he was the only…",
          "Contenu": "Abner  was a big help he was the only one who could get me back on line and he walked me through everything he was great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Bieschke",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T16:04:39.000Z",
          "Titre": "Easy to activate",
          "Contenu": "Easy to activate, most important very easy to suspend when not needed.Very good service and functionality"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Babara Shores",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T17:58:16.000Z",
          "Titre": "Works as I hoped it would",
          "Contenu": "Gave me the information that I needed. Found out what I was looking for in a short amount of time. May reactivate in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Croasdale",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T16:06:59.000Z",
          "Titre": "Great customer service",
          "Contenu": "A problem with shipment was dealt with by immediately sending me a new order.  Great service!Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RON B.",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T17:13:54.000Z",
          "Titre": "Great very knowledgeable customer…",
          "Contenu": "Great very knowledgeable customer service, this company has everything together! Impressed! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne Wendel",
          "Nb_Reviews": 3,
          "Date": "2023-09-12T22:28:29.000Z",
          "Titre": "I found this tracker to be everything I…",
          "Contenu": "I found this tracker to be everything I need.  It worked 100% as advertised, and the service was great. I would recommend the Optimus tracker to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "conrad b",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T23:52:00.000Z",
          "Titre": "Abner, the best thing since sliced bread",
          "Contenu": "Abner, that’s what made it great. He helped us immediately and he put us at ease. We’re old people and stress does not agree with us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bren",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T18:58:12.000Z",
          "Titre": "Eric was very kind",
          "Contenu": "Eric was very kind, patient and extremely helpful. He was great about explaining everything to me, and how the tracker worked."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "carielka gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T19:20:58.000Z",
          "Titre": "Amazing Service and great products",
          "Contenu": "Steven was very helpful and knowledgeable. When I call the young lady that answered helped me. I have been a customer of Optimus for over 5 years and I am very happy with this company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sigurd Ruskedal",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:00:12.000Z",
          "Titre": "Great",
          "Contenu": "Answered and you'll all of my questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julain Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T21:54:12.000Z",
          "Titre": "Great service and someone are always…",
          "Contenu": "Great service and someone are always available when needed.."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake Llewellyn",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T18:36:32.000Z",
          "Titre": "ELISE is great",
          "Contenu": "ELISE is great. service is great. I wouldnt be here if the yearly rate wasnt as low as it is.  Good price, good service.   will keep getting more."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Heckel",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T19:32:50.000Z",
          "Titre": "They made it very easy to understand…",
          "Contenu": "They made it very easy to understand what I was having issues with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederick A Friton",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:18:44.000Z",
          "Titre": "The device works perfect and the people…",
          "Contenu": "The device works perfect and the people that work here are awesome.  So great to have a human being answer the phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd S. Wohlsen",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T22:30:45.000Z",
          "Titre": "First time experience",
          "Contenu": "Eric was friendly and knowledgeable with helping me set up my account!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neema Simon",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T23:50:58.000Z",
          "Titre": "My device was not working",
          "Contenu": "My device was not working, optimus sent me a new one in no time! Very good customer service. Thank you Optimus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Ferrer",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T19:48:53.000Z",
          "Titre": "Elisa was Very Helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio Dade",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T00:50:11.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, I highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Young",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:54:35.000Z",
          "Titre": "Bill pay",
          "Contenu": "You should give him a higher pay. Very knowledgeable with system and very friendly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leverne Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T23:21:25.000Z",
          "Titre": "Always great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane M Moore",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T18:19:24.000Z",
          "Titre": "I highly recommend this company!",
          "Contenu": "I highly recommend this company!! The customer service is amazing and the product and service is awesome"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Racheal Farris",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T00:11:49.000Z",
          "Titre": "He made my call so easy",
          "Contenu": "He made my call so easy and was very helpful. One of the best  calls I've had with this company. This man needs a raise. hahaha"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andi Adams",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:47:08.000Z",
          "Titre": "Great product at Fair Price",
          "Contenu": "Great negotiations. Great product at a fair price.  Currently using on 70 vehicle fleet."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Sylva",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T14:34:48.000Z",
          "Titre": "Seemless delivery",
          "Contenu": "Seemless servicesElectronic in abundance and availableGo to go"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard M.",
          "Nb_Reviews": 2,
          "Date": "2023-09-15T18:14:27.000Z",
          "Titre": "Would recommend",
          "Contenu": "As of now (1 week), we are very happy with the product and the service. It doesn't have all the bells and whistles that we do not need, so it is perfect for our fleet."
        }
      ]
    }
  ]
}