{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "partshnc.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sean Frazier",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T13:31:00.000Z",
          "Titre": "The part that I purchased from you…",
          "Contenu": "The part that I purchased from you isn’t correct/is defective. I’ve provided photographic evidence and resolution isn’t being offered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edward Rosicky",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T00:06:48.000Z",
          "Titre": "Dumb",
          "Contenu": "Why would you keep sending emails to rate you. when you said you had the product and then didn't?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RAYNALDO PINA",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T02:10:07.000Z",
          "Titre": "Shaking my head",
          "Contenu": "Ordered 2 of same part1 faulty never received a replacementSent in bad now waiting for refund.Endless emails my customer still down.Scam company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victoria Beach-Ridsdale",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T16:50:51.000Z",
          "Titre": "I ordered a specific part for my furnace to convert from Fuel Oil/kerosene to propane",
          "Contenu": "I ordered a specific part for my furnace, I chose to go thru the company that we purchased the furnace through 5 years ago. With the cost of fuel oil going up this was necessary to be able to afford to heat our me. I purchased a burner assembly which will convert my furnace from fuel oil kerosene to propane. I scheduled the technician to come in and install it and unfortunately I was not sent the correct parts to be able to do so. This is the first time that I've ordered any parts from this company, I'm not upset as far as a product being missed pulled in the ship it happens.. my frustration lies with me immediately reaching out sending an email of the issue and concerns and have yet been contacted by a customer service rep. I was very clear of the situation and what situation that I am in right now to be able to heat my home. I feel, because of the lack of response the customer service is not this company's number one priority. Honestly I'm not certain if I would order through this company again, I guess when I reach out to inquire the status and see what kind of verbal communication I received will determine that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "tony y",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T04:58:47.000Z",
          "Titre": "Don't waste your money and time to do…",
          "Contenu": "Don't waste your money and time to do business with those guys. They just sent you a whatever part which is not the one you ordered and you sent it back and never get reimbursement. A bad company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vincent zhao",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T18:20:39.000Z",
          "Titre": "took too long before shipping out the…",
          "Contenu": "took too long before shipping out the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "G. Moua",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T08:06:05.000Z",
          "Titre": "I was expected to received the product…",
          "Contenu": "I was expected to received the product on May 3. Today is May 7 and still have not receive it. I was unable to get any water.  I ordered from you and paid more than the other vendor"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug w Freeman",
          "Nb_Reviews": 1,
          "Date": "2021-11-05T11:52:28.000Z",
          "Titre": "After I payed through paypal you…",
          "Contenu": "After I payed through paypal you claimed the item had the wrong price and you increased it 30%, so I cancelled. Bunch a liars - never shop your site again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T23:42:29.000Z",
          "Titre": "No same day shipping",
          "Contenu": "It’s been 7 days, no shipping notification no communication other than order confirmation. Not happy. Far from same day shipping"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy Wilmoth",
          "Nb_Reviews": 2,
          "Date": "2023-01-01T03:00:18.000Z",
          "Titre": "Until I get my refund I will give 1 stsr"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T20:52:39.000Z",
          "Titre": "Not great.",
          "Contenu": "Ordering was easy, but the packaging was too big. It doubled the price. Further, the overkill packaging didn’t protect the gasket. There are creases in the corners that will probably ruin the integrity of the gasket. I contacted the company two days ago, and they haven’t responded."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth Head",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T17:26:27.000Z",
          "Titre": "Inlet water filter for a navian Combi…",
          "Contenu": "Inlet water filter for a navian Combi boiler good price but filter came in complete no o-rings luckily I have a good hardware store nearby. Did expect a complete filter."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Larry Morrison",
          "Nb_Reviews": 3,
          "Date": "2022-07-22T21:18:56.000Z",
          "Titre": "Arrived Damaged due to poor packaging by manufacturer, IMHO.",
          "Contenu": "I assume Partshnc is just a distributor and had little control over this outcome.  Ordering was easy and delivery took 5 days, prompt enough, no complaint.  My issue was the part arrived in a mildly damaged condition.  I blame a lack of careful packaging with no thought to immobilizing the part.  It was thrown loose into a box with the two gaskets, and left to freely bounce around; even though the fins cause it to be a little fragile.  I assume it is still functional, but it has more damaged, crushed & mangled fins than is justifiable when I paid a \"New\" part price.  I expect it in \"New\" part condition.  The only reason I didn't contact and discuss a replacement is I had the same issue with the Primary heat exchanger for this furnace from another vendor, and other potential suppliers were all out of stock.  Under current supply constraints, I am willing to try to comb out the fins myself and use it, but I shouldn't have too."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "By Fong",
          "Nb_Reviews": 2,
          "Date": "2021-12-11T13:30:52.000Z",
          "Titre": "I try to cancel my order but couldn’t…",
          "Contenu": "I try to cancel my order but couldn’t on the web site and I email to cancel and call and left a voicemail the next day but they said they didn’t get the email or the voicemail. The part came on time but it was to big and I look up the model and that’s what came to that part. I would still use them in the future"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elmer  Pesecky",
          "Nb_Reviews": 3,
          "Date": "2022-02-14T01:11:09.000Z",
          "Titre": "No one ever answered the phone and…",
          "Contenu": "No one ever answered the phone and never called me back after I left a message also didn’t respond to my emails. No mention of warranty with the part"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew  Kochaba",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:59:41.000Z",
          "Titre": "Only issue I had was that the picture…",
          "Contenu": "Only issue I had was that the picture did not match the actual part. Luckily I did research on what I needed and the part number was correct. Everything else was perfect"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Crystal Clabes",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T19:25:43.000Z",
          "Titre": "Good product",
          "Contenu": "Has trouble with customer service, but they eventually got me what I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marla Rennison",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T14:40:13.000Z",
          "Titre": "Fast and Reliable delivery of the item…",
          "Contenu": "Fast and Reliable delivery of the item needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian  Glassing",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T01:58:09.000Z",
          "Titre": "Shipped fast...good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie  Marispini",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T01:10:22.000Z",
          "Titre": "Easy ordering, fast arrival time, would recommend to everyone",
          "Contenu": "Easy ordering, fast arrival time, best part site"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl.a Buck",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:25:17.000Z",
          "Titre": "Very easy to order and quick delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Walker",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T14:37:17.000Z",
          "Titre": "Part arrived overnight as planned",
          "Contenu": "Part arrived overnight as planned.  I would recommend protecting the graphite gaskets better however. They were bent and almost broken from within the box.  Fortunately I was able to use them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marco Findley",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:07:16.000Z",
          "Titre": "On time delivery and product works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T21:17:07.000Z",
          "Titre": "They had the part I needed",
          "Contenu": "They had the part I needed that I couldn't find elsewhere. Website made it easy to order. Shipping was quick, with detailed email status messages sent. Overall an excellent experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan Henderson",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T00:04:09.000Z",
          "Titre": "never heard of them",
          "Contenu": "never heard of them, so suspicious.  However, the website and people I spoke with reassured me that this is a reputable distributor.  They understood my request, confirmed their inventory and shipped on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio Rojas",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T23:53:23.000Z",
          "Titre": "A good experience",
          "Contenu": "A good experience, the only observation I want to make is that the packaging was very weak and does not provide security to the compressors.Of the 5 compressors, 1 arrived with a bent leg and the suction inlet dented."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T01:51:45.000Z",
          "Titre": "Great service!",
          "Contenu": "The part I needed was in stock and two days later, it was on my doorstep! Local supplier wanted $300.00 more and at least two more weeks for delivery. Very happy with this experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T00:43:09.000Z",
          "Titre": "Prompt service",
          "Contenu": "They responded to my inquiry about a part quickly, and shipped it quickly. I got exactly what I needed to repair my Viessmann boiler and I wouldn't hesitate to order again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:01:40.000Z",
          "Titre": "I received the package!",
          "Contenu": "I received the package in a timely manner and it was even the correct part placed within said package. Excellent job and thank you for your attention to detail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 3,
          "Date": "2023-02-11T18:59:57.000Z",
          "Titre": "I was looking to replace older…",
          "Contenu": "I was looking to replace older components which you were still able to carry.  You maintained a good price and once the order was placed, was pleasantly surprised to have the product on my doorstep within a day.Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K. Hall",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T02:23:09.000Z",
          "Titre": "One of the only locations to have OEM…",
          "Contenu": "One of the only locations to have OEM part for my ICM oil burner forced hot air furnace. 2 day delivery was on time! Very large selection of parts. Will recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Habjanetz",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T02:45:05.000Z",
          "Titre": "Service Technician Lied",
          "Contenu": "Service technician said the parts I needed were discontinued for the heating system I have.I found everything I needed right here.And installed the parts myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T17:40:02.000Z",
          "Titre": "Great price,fast shipping,worked…",
          "Contenu": "Great price,fast shipping,worked perfectly, very satisfied with purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Petroff",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T18:59:41.000Z",
          "Titre": "Thanks for helping with returning wrong…",
          "Contenu": "Thanks for helping with returning wrong and ordering the correct part.My mistake and you corrected the issue as painlessly as possible. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAUL P",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T20:58:52.000Z",
          "Titre": "Quick shipment, easy install.",
          "Contenu": "Received the fan quickly and had it installed 10 minutes after arrival. All works ok. One item to note - thin box was damaged on arrival (however item was fine)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Moore",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:23:09.000Z",
          "Titre": "Ordering was easy and the order got…",
          "Contenu": "Ordering was easy and the order got shipped in only a day. Happy with the product and company"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcus Jennings",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T15:59:19.000Z",
          "Titre": "Part received in a timely manner",
          "Contenu": "Part received in a timely manner. It was the correct part."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wayne",
          "Nb_Reviews": 10,
          "Date": "2021-12-06T19:39:07.000Z",
          "Titre": "On line experience was easy to order",
          "Contenu": "On line experience was easy to order. the privce was good. I received the shipment quickly. the part was an excellent OEM replacement"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirk Christopherson",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T23:36:28.000Z",
          "Titre": "Parts person looked up correct part by…",
          "Contenu": "Parts person looked up correct part by model and serial number, shipping was expedited very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAUL WRIGHT",
          "Nb_Reviews": 2,
          "Date": "2022-01-13T16:52:44.000Z",
          "Titre": "Part was shipped ahead of schedule",
          "Contenu": "Part was shipped ahead of schedule, and arrived exactly as expected.  My furnace is back up and running!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-07-11T15:08:58.000Z",
          "Titre": "Just what I needed",
          "Contenu": "My HVAC is many years old and really happy that I was still able to get the part. Fast and easy online order and installation was easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicole",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T16:08:44.000Z",
          "Titre": "They had the parts I needed",
          "Contenu": "They had the parts I needed, they shipped same day and communicated with me to let me know when the parts would ship out."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jeffery tirey",
          "Nb_Reviews": 1,
          "Date": "2022-01-01T23:13:27.000Z",
          "Titre": "My furnace heat exchanger cracked from…",
          "Contenu": "My furnace heat exchanger cracked from age. Parts hnc provided me with a new exchanger at a reasonable cost. Quick and good quality"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CRYSTAL M",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T16:21:53.000Z",
          "Titre": "Part we desperately needed was in…",
          "Contenu": "Part we desperately needed was in stock. Shipped fast. Got our equipment up and running same day it was delivered"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nelson Greer",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T14:34:25.000Z",
          "Titre": "A little weak on follow up!",
          "Contenu": "A little weak on follow up. I had to call and check on the part and get a tracking number.  After that, it came really quickly part worked well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Cates",
          "Nb_Reviews": 1,
          "Date": "2023-07-09T01:03:49.000Z",
          "Titre": "Great service",
          "Contenu": "Great service had item in a decent manner no complaints"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy",
          "Nb_Reviews": 6,
          "Date": "2023-09-19T00:27:00.000Z",
          "Titre": "Part was as advertised and delivery was…",
          "Contenu": "Part was as advertised and delivery was on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce R",
          "Nb_Reviews": 2,
          "Date": "2023-06-11T19:38:33.000Z",
          "Titre": "Compressor motor",
          "Contenu": "Right part works flawlessly fast shipping a little expensive to ship but overall excellent transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Croff",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T21:55:59.000Z",
          "Titre": "I admit I was nervous",
          "Contenu": "I admit I was nervous.  Right part. Best price I could find.  Reasonable shipping time.  Everything worked!Thank you Partshnc.  I will be back again."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Tecnologia e Ingenieria Verde",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:10:23.000Z",
          "Titre": "Fast and good price.",
          "Contenu": "Large Stock, fast and great service. The prices are very good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gina Herrman",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T17:18:21.000Z",
          "Titre": "Very easy to navigate website and great…",
          "Contenu": "Very easy to navigate website and great turn around time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Clark",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T20:51:28.000Z",
          "Titre": "Had what I needed at a fair price and…",
          "Contenu": "Had what I needed at a fair price and delivered it in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandy Napier",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T02:46:10.000Z",
          "Titre": "Easy ordering",
          "Contenu": "Easy ordering, and fast shipment. The part was perfect and works great, thank y’all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelli Green",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T00:54:27.000Z",
          "Titre": "It fit and worked",
          "Contenu": "The part was a great fit and the water has even temperature again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jo E Roe",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T19:00:54.000Z",
          "Titre": "Furnace filter",
          "Contenu": "I had a tough time finding this filter and finally found it here. it's exactly what I needed and works great. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steven bester",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T02:14:09.000Z",
          "Titre": "Ordering",
          "Contenu": "Ordering, shipping , and the part fit perfect , thanks again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W.L.",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T04:05:34.000Z",
          "Titre": "Fast delivery",
          "Contenu": "Fast delivery, the transformer works well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Ramirez",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T18:54:50.000Z",
          "Titre": "A/C condensation drain line connection.",
          "Contenu": "It was the correct part as shown and arrived on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy Ballone",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T22:56:43.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, the part was a perfect.  Will order from Partshnc again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin White",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T02:11:25.000Z",
          "Titre": "I would trust them with my wife",
          "Contenu": "The parts had images, buying experience felt safe, plenty of shipping options and appropriate update emails on package progress."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giuseppe  Muraca",
          "Nb_Reviews": 1,
          "Date": "2022-09-24T02:43:32.000Z",
          "Titre": "It was a pleasure dealing with you…",
          "Contenu": "It was a pleasure dealing with you guys, delivered on time, thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T00:24:05.000Z",
          "Titre": "Fast shipping dispatch",
          "Contenu": "Fast shipping dispatch; 2nd day air delivery!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John J Hernandez",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T17:27:16.000Z",
          "Titre": "I was looking for Lennox part and they…",
          "Contenu": "I was looking for Lennox part and they had it in stock. The package arrived the next day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tim flynn",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T03:03:30.000Z",
          "Titre": "Parts in stock and fast delivery…",
          "Contenu": "Parts in stock and fast delivery service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Watkins",
          "Nb_Reviews": 3,
          "Date": "2022-11-02T02:34:09.000Z",
          "Titre": "Provided me with the induce fan…",
          "Contenu": "Provided me with the induce fan wheel,on time  delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Courtney",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:36:00.000Z",
          "Titre": ":-) *****",
          "Contenu": ":-) **********"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karl Rigrish",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T21:51:52.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, fast shipping. Part as described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Lyon",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T20:28:28.000Z",
          "Titre": "Timely, knowledgeable service",
          "Contenu": "Part quickly identified. Shipping options explored and recommended. Part arrived as forecast. Great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael  Szczepanski",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T17:31:03.000Z",
          "Titre": "Absolutely fit perfect",
          "Contenu": "Fast on time delivery and correct part"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T17:00:27.000Z",
          "Titre": "I ordered straps for our rollback and…",
          "Contenu": "I ordered straps for our rollback and they were delivered the next day. I was Surprised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Phillips",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T15:41:35.000Z",
          "Titre": "Everything was as advertised",
          "Contenu": "Everything was as advertised. Shipping was very fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendall Swenson",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T22:46:54.000Z",
          "Titre": "Excellent experience",
          "Contenu": "The part was delivered promptly and was well packed.  Exactly what I needed.  Website was easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven",
          "Nb_Reviews": 4,
          "Date": "2023-09-08T15:58:21.000Z",
          "Titre": "Great Service",
          "Contenu": "Fast service with the exact parts I needed. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn M.",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T21:37:25.000Z",
          "Titre": "Easy search for part, fast shipping, perfect fit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stanley  Musial",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T12:41:08.000Z",
          "Titre": "Got my order fast with no problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael  Waters",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T13:04:03.000Z",
          "Titre": "Easy to order part came in a timely…Pequot house",
          "Contenu": "Easy to order part came in a timely manner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Strawbridge",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T21:34:02.000Z",
          "Titre": "Part arrived on time",
          "Contenu": "Part arrived on time. Part fixed issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Jodon",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T18:26:19.000Z",
          "Titre": "Speedy delivery",
          "Contenu": "Speedy delivery! Easy to order"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T01:09:07.000Z",
          "Titre": "No hassle shipment and fast very fast",
          "Contenu": "No hassle shipment and fast very fast. I received it in a couple of days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Seay",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T20:05:01.000Z",
          "Titre": "had the part and got it to me as soon…",
          "Contenu": "had the part and got it to me as soon as possible"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Grant",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T21:19:53.000Z",
          "Titre": "Exactly the parts I needed",
          "Contenu": "Exactly the parts I needed, arrived quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T17:07:59.000Z",
          "Titre": "Great shipping",
          "Contenu": "Gast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marie Hunt",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T14:16:14.000Z",
          "Titre": "Great selection and fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Stimmel",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T15:34:31.000Z",
          "Titre": "Everything working again.",
          "Contenu": "I got the right part to fix my furnace. I got the part in 2 days."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T19:47:53.000Z",
          "Titre": "Amazing and quick shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donn Rushing",
          "Nb_Reviews": 2,
          "Date": "2021-11-04T14:15:07.000Z",
          "Titre": "Great item",
          "Contenu": "Great item! fast delivery! Thanks so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DV",
          "Nb_Reviews": 1,
          "Date": "2021-11-08T17:40:09.000Z",
          "Titre": "prompt service and fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Soroush Zaer",
          "Nb_Reviews": 1,
          "Date": "2021-12-16T22:57:02.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you. Fast shipping and correct partU"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alyssa Meyers",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T04:15:44.000Z",
          "Titre": "Quick shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zivko Stankovic",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T02:04:52.000Z",
          "Titre": "Thank you for your good and fast delivery",
          "Contenu": "OkThank you for your fast deliveredBig and good  that house"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T19:05:39.000Z",
          "Titre": "Right part",
          "Contenu": "Right part, fair price, and arrived early."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Huchko",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T21:11:53.000Z",
          "Titre": "Great",
          "Contenu": "Great , service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alonzo Coiley",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T14:59:59.000Z",
          "Titre": "Everything happed as promised"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dakota Langdon",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T17:59:44.000Z",
          "Titre": "Part worked exactly as needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James C.",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T07:43:33.000Z",
          "Titre": "Delivered as promised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Fenter",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T22:00:28.000Z",
          "Titre": "Part delivered on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "clarence burgan",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T16:54:22.000Z",
          "Titre": "Fast shipping good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaye",
          "Nb_Reviews": 3,
          "Date": "2022-01-03T11:10:56.000Z",
          "Titre": "Great price,Quick shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DALE FOREMAN",
          "Nb_Reviews": 3,
          "Date": "2022-11-17T06:38:26.000Z",
          "Titre": "Great service and price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey Tallentire",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T06:57:45.000Z",
          "Titre": "Got the right part",
          "Contenu": "Got the right part, on time, ready to go."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Stewart",
          "Nb_Reviews": 2,
          "Date": "2022-10-27T18:46:55.000Z",
          "Titre": "Service",
          "Contenu": "Fast and ease of service. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Rawls",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T17:49:54.000Z",
          "Titre": "It was what I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ROGER DUFFEY DUFFEY CYCLES",
          "Nb_Reviews": 2,
          "Date": "2023-01-10T20:11:43.000Z",
          "Titre": "Thanx Very quick to ship!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim Lee",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T05:15:37.000Z",
          "Titre": "Need notification upon delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzanne Hentschel",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T01:09:19.000Z",
          "Titre": "Excellent customer service!!"
        }
      ]
    }
  ]
}