{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "paytomorrow.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gerri",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T16:08:07.000Z",
          "Titre": "What a scam",
          "Contenu": "What a scam, went on saferwholesale.com to buy a utv and needed to finance part of it, approved for $4000 and they paid the merchant than sent me the contracts, yes that's 2 first is a lease agreement which was supposed to be a finance agreement and a second with lease end options to buy the unit for almost $3000 more or return it, this was NEVER disclosed. Cancelling order before I get ripped off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike moore",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T08:48:35.000Z",
          "Titre": "So far so bad I don’t even have what I…",
          "Contenu": "So far so bad I don’t even have what I purchased but there taking there money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brionna lewis",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T16:36:16.000Z",
          "Titre": "can't contact anyone",
          "Contenu": "can't contact anyone. I try to reset my password but never get the link to do so. got a late payment reminder but no transaction was attempted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank",
          "Nb_Reviews": 4,
          "Date": "2023-11-06T15:45:47.000Z",
          "Titre": "I would have used this group",
          "Contenu": "I would have used this group, interest rate was not terrible, but I was unaware of a policy that you cannot have a billing address, separate from a shipping address. So all of your business owners that are looking for additional credit lines this will not work for you. As a result, I order $2000 in equipment going to a billing address which route refused delivery, and the procedure to change. The address in route was very complicated as if no one seems to know what to do. Ultimately the product was sent back to the sender  And canceled. It’s really nice when people actually know what’s going on, I would not count on this group to really know what’s going on especially when you get different responses from different people at different points in the transaction not a group I will use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T01:40:59.000Z",
          "Titre": "I kept having to refill out the…",
          "Contenu": "I kept having to refill out the application about 3 times because every time I shopped I had to refill it out (which makes it seem fake)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donna Seabolt",
          "Nb_Reviews": 3,
          "Date": "2023-09-27T18:35:05.000Z",
          "Titre": "I don't care for the pay portal it…",
          "Contenu": "I don't care for the pay portal it shows no details in the entire purchase as far as interest rate and what I'll actually be paying! It's deceiving and hiding critical amounts"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "crystal",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T15:28:55.000Z",
          "Titre": "ive had items 3 days now,",
          "Contenu": "ive had items 3 days now,, go to pay tomorrow app, says ' you dont have an account with us! cant change payment method, cant see balance, nothing! then you wonder why ppl dont pay!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ELBERT H",
          "Nb_Reviews": 2,
          "Date": "2023-02-03T16:36:36.000Z",
          "Titre": "your customer service wasn't able to …",
          "Contenu": "your customer service wasn't able to  vendor refund my money. I was advised to not contact my bank, but I did anyway, they are now handling it with a dispute, account frozen so no more money can be extracted fraudulently.  What a scam your company has going, or perhaps EZcredit is a scam as well.  What should of been an easy fix turned into a nightmare."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Mcfatridge",
          "Nb_Reviews": 2,
          "Date": "2023-08-24T15:15:36.000Z",
          "Titre": "Repayment amount was way too high",
          "Contenu": "The approval process was quick and easy. When I asked the person what the interest rate would be I was told that would depend on which repayment option I chose. Once I was approved and placed the order I needed financing for I received an email with the pay plan and interest. I chose the 24 month option for the lower payments. The first 12 months had no interest listed. The second 12 months showed 6%. However, I was borrowing $2136 and after adding up how much all payments came to it was $3271. Sorry but I'm not willing to pay $1200 in order to barrow $2100."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gladys Briscoe",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T19:22:16.000Z",
          "Titre": "Insane Interest for 23 days",
          "Contenu": "On July 1 2023 I borrowed $3276 to do a quick flip buying a gokart.  Easy application and approval process.  I received a phone call from the company assuring me that there would not be a penalty for early payoff.  On July 24, 2023 I called the company to pay off the loan, the pay off being $3570.51.  So it is buy beware, I will never use this company again,"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "L Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T18:20:10.000Z",
          "Titre": "I ordered rims from BB wheels and they…",
          "Contenu": "I ordered rims from BB wheels and they sent the wrong size. I returned them and and just wanted the correct size and once I contacted BB wheels to start the process I was denied by pay tomorrow. No one has told me why so I went to another company and purchased the wheels I needed without any issues I would not use your service in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harold Nicholas",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T21:04:40.000Z",
          "Titre": "There needs to be more interaction…",
          "Contenu": "There needs to be more interaction between seller and financer. I placed a order for a item that isn't in stock and won't be for 2-4 weeks. This should've been something I was nothing off in advanced because I wouldn't have purchased item if I knew it would be a month before receiving it. Bad experience!."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T16:04:04.000Z",
          "Titre": "Company not honest",
          "Contenu": "Company not honest on March 3rd. Was totally shocked of two contracts they emailed me with my unauthorized signature march 3rd.Company doesn't allow buyer to agree upon contracts. Company signs your signature without consent. Company force you into something that wasn't agreed upon. Called company on March 3rd,in a hour and thirty minutes of submitting purchase with merchant. Speaking with company  representative asking to cancel there serivices and company still continued to finance with merchant without my consent. 24 months of payments is what i applied for not 27 months of payments. Worst experience ever feel scammed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Hook",
          "Nb_Reviews": 2,
          "Date": "2023-04-18T15:31:45.000Z",
          "Titre": "Where to start",
          "Contenu": "Where to start. Well, I made the order and read some reviews that didn't sit right with me so I decided to cancel and contacted both Exotic PC and pay tomorrow around 10:30-11:00 am the morning after I ordered the laptop. I emailed paytomorrow and they instructed me to contact merchant and hit refund button so I did just that. Exotic PC assured me they would do so and cancel order. Everything seemed like it was gonna work out until about 6 hours later when checked my email and seen that I received an email stating my package has been shipped. So I have no idea what's going on with either of these 2 companies or they both decided to screw me but I have no intention of paying this debt. Stay clear away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 3,
          "Date": "2023-01-31T07:39:13.000Z",
          "Titre": "This company is literally the worst way…",
          "Contenu": "This company is literally the worst way to purchase anything. Their contracts are extremely misleading confusing, show one contract for one term and a second contract for another term, you won't even realize you signed two contracts for the highest interest rates known to financing. I had no idea I was paying $3000 for a $1700 worth in tires. These rates should be illegal, almost 50% for one pair of tires on a car I sold a year ago....I still have another 9 months to go for a car I sold in Feb of 2022. Go ahead and buy something with this company, they'll never be out of your bank account."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Adam Levy",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T19:40:33.000Z",
          "Titre": "1.9/5 review on BBB",
          "Contenu": "1.9/5 review on BBB. 1.3/5 on PissedConsumer.This company is not only a scam, but they're scamming their reviews on Trustpilot, which I don't think I feel comfortable believing anymore.This is exploitation at the absolute maximum. I am helping my somewhat financially less literate friend understand this insane agreement he joined with PayTomorrow for a \"lease\" on his tires, a contract that doesn't need to show an APR because it's a lease but which has an effective APR that is INSANE. It's like tax evasion, dodging transparency to rip financially illiterate people off.I'm filing a complaint with the Illinois Attorney General's Office with my friend against both PayTomorrow and the dealer from which he made this agreement. This is completely insane, and honestly, I can't see how this isn't illegal. It just may be."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vicentico Pringle",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T11:25:43.000Z",
          "Titre": "Didn’t get my tires because your company gave the installers no info on myself or weather tires are paid .",
          "Contenu": "Went to schedule appt for tire install. Installers informed me there was NO information in there system that the tires where paid for and size and that You had sent the Wrong vehicle make and model to them. So with that being said I Will BE CALLING THIS MORNING TO FIND OUT HOW YOU RUN YOUR COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Shirley",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T02:01:00.000Z",
          "Titre": "No no no",
          "Contenu": "No no noDo not listen to any of these reviews. How has nobody mentioned the fact that you think you are agreeing to a loan, but the bait/switch you into a \"lease to own\", and then into the actual loan?For example I ordered a $3000 computer, selected the term I wanted, and agreed. 2 weeks later they send me the documents that show I will be leasing the computer for $3000, then once the lease is paid I will have to pay the actual loan which is another $3000. I'M PAYING DOUBLE WHAT THE PRODUCT WAS WORTH, BECAUSE THIS COMPANY IS NOT AT ALL TRANSPARENT AND THEY RELY ON CONSUMERS TO AGREE WITHOUT READING THE FINE PRINT.THEY SHOULD BE IN PRISON"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T16:02:39.000Z",
          "Titre": "DO NOT USE THEM",
          "Contenu": "Apparently I'm being charged 75% interest, there was no document that stated anything greater then an annual 12%.  So my 4,000 finance will cost me over 7,000.00.  Way to help people Paytomorrow.  Literal robbery."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John W Reno",
          "Nb_Reviews": 2,
          "Date": "2023-07-15T03:19:20.000Z",
          "Titre": "This company has harassed me more than…",
          "Contenu": "This company has harassed me more than any other company I've ever borrowed money from. They call me before 8am just to ask me questions that I'd answered the day beforeThe way they conduct business is not the best in my opinion. I've never had a loan company call me so many times and. Ask the identical questions I'd answered in the previous 24 hour. I'm retired and have had a fair amount of loans in the 63 years I've been alive and never have I dealt with a company like this."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T17:01:26.000Z",
          "Titre": "I called asked for help with my concern…",
          "Contenu": "I called asked for help with my concern about the motor swap SW engines had done and didn’t notify me on it at all. They lied to me and wouldn’t answer my calls it would forward my call then hang up every time. I was hoping y’all could get answers from a manger but that didn’t happen either."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Waylon Jones",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T18:22:03.000Z",
          "Titre": "Poor advertisement",
          "Contenu": "Poor advertisement. Didn’t know I was getting a lease until it was finalized. I was under the impression of getting a loan, but I guess not."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T16:43:54.000Z",
          "Titre": "If I could rate lower",
          "Contenu": "If I could rate lower, I would.  You approved a loan for an obvious identity theft and refused to close it when notified of the issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Connie Tifft",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T02:06:12.000Z",
          "Titre": "I have not revieved my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jasbir singha",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T20:15:35.000Z",
          "Titre": "I have no clue as.to why it is so…",
          "Contenu": "I have no clue as.to why it is so difficult for your company to provide customer service to its customer. Wrong shipping address. I hope to reconcile this matter and when we do I assure you I will not be a  returning customer service"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Naso",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T14:35:10.000Z",
          "Titre": "Finance charge is extremely high",
          "Contenu": "Finance charge is extremely high, early pay off fees are not legal in my state. Will never use again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T15:56:18.000Z",
          "Titre": "Pay tomorrow owes me 10 dollars",
          "Contenu": "Pay tomorrow owes me 10 dollars. I paid TWICE for the finance application.  The issue is still not resolved. Please contact me with update"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "E. W.",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T01:22:11.000Z",
          "Titre": "Not trusting of online shopping",
          "Contenu": "The engine I purchased was in poor condition. I had to return it. They did not have a replacement so they explained that they would have to issue a refund. This could only happen after the engine was shipped back to them. I reached out after 4 days and no one has responded.I currently have no money and no engine."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julie Hamann",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T15:41:44.000Z",
          "Titre": "Misrepresented the nature of the…",
          "Contenu": "Misrepresented the nature of the contract. Did not disclose that this is a lease . As a result I have cancelled the order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T20:27:26.000Z",
          "Titre": "i didn't purchase anything because its…",
          "Contenu": "i didn't purchase anything because its out of stock so we canceled the order and now im getting messages saying im late . please address this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T16:53:45.000Z",
          "Titre": "Lease to Loan program looks like a scam…",
          "Contenu": "Lease to Loan program looks like a scam since we are literally paying for our items twice!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carrie Owsley",
          "Nb_Reviews": 7,
          "Date": "2023-12-18T16:03:21.000Z",
          "Titre": "Early pay off fees"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T18:30:12.000Z",
          "Titre": "totally underhanded and sneaky 0-- poor…",
          "Contenu": "totally underhanded and sneaky 0-- poor customr service after the sale you cant reach anyone ! buyer beware"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T15:01:56.000Z",
          "Titre": "Very disappointed at them not…",
          "Contenu": "Very disappointed at them not explaining the full terms. Even if you pay them early (1 or 2 days) your still charged a percentage. Scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven dias",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T16:22:46.000Z",
          "Titre": "I still have not received my updated…",
          "Contenu": "I still have not received my updated payment method."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 5,
          "Date": "2022-12-19T14:26:42.000Z",
          "Titre": "Don’t Do IT",
          "Contenu": "Purchased tires, but paying double theprice. The worst decision I made. Will be my first and last time, using the buy now, pay later service from the company. The monthly statements are even more confusing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T19:02:11.000Z",
          "Titre": "Says 0% interest on the 6 month plan…",
          "Contenu": "Says 0% interest on the 6 month plan however it is deceptive. Had I known they would charge so much I would have just waited 2 weeks and bought it with cash. Will never use them again and hope nobody else ever does"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Slim Gem",
          "Nb_Reviews": 2,
          "Date": "2023-04-21T00:06:25.000Z",
          "Titre": "Scammed",
          "Contenu": "Fraser processed my application when I told them not to and gave me a cancellation fee of almost 300 dollars.   Scammed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daphne Buchanan",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T01:58:35.000Z",
          "Titre": "I was very dissatisfied with your…",
          "Contenu": "I was very dissatisfied with your company's policy on requesting a refund.The product I purchased was not what was stated in the webinar."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T04:43:08.000Z",
          "Titre": "I never applied for financing",
          "Contenu": "I never applied for financing.  My identity was stolen and they somehow got a loan for tires without and flags being raised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kevin Trinh",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T00:34:53.000Z",
          "Titre": "Complete scam..",
          "Contenu": "Complete scam... You are placed on a lease for 27 months after which you still have to pay 80% cost of the item or add on 24 months more on a loan. So you really are paying 180%... Comes out to be 15% APR drawn over 4 yrs. And you cannot end the lease at anytime."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T03:33:45.000Z",
          "Titre": "The interest they charge is extremely…",
          "Contenu": "The interest they charge is extremely excessive tried to cancel they didn't take that good"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karvell Stewart",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T21:05:05.000Z",
          "Titre": "I made two separate purchases and you…",
          "Contenu": "I made two separate purchases and you wanted 4 separate payments per month would not combine them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "D Smylie",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T19:06:25.000Z",
          "Titre": "I have cancelled the order.",
          "Contenu": "I have cancelled the order.. It will not ship in time, but even more so I realized the interest rate ?????????? I will spend 2 years just paying the interest off twice a month."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Solo Kev",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:26:26.000Z",
          "Titre": "Scam artistespecially Wanda",
          "Contenu": "Scam especially Wanda"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonah",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T16:10:28.000Z",
          "Titre": "Payment Amount Changed Without My Ok",
          "Contenu": "My payment amount I was originally told and agreed on was changed to more last minute which I never agreed on."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T16:36:28.000Z",
          "Titre": "Bad experience 4 wheeler arrived…",
          "Contenu": "Bad experience 4 wheeler arrived damaged and not safe to operate and I can’t just return it I don’t want the item"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T12:18:10.000Z",
          "Titre": "High interest company",
          "Contenu": "Got approved but interest is high for 2 year term with good credit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathon Grimes",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T23:34:54.000Z",
          "Titre": "This place has opened a fraudulent…",
          "Contenu": "This place has opened a fraudulent account in my name for some tiers"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rajan George",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T16:53:14.000Z",
          "Titre": "Whole financed amount will be paid off…",
          "Contenu": "Whole financed amount will be paid off in 10 months and the another 9 months of additional payment do understand interest however not specifying anything about paying off early to lower the intrest"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T16:16:14.000Z",
          "Titre": "I will never use again!",
          "Contenu": "I will never use again!! Awful!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miguel brigyik",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T18:24:50.000Z",
          "Titre": "I was not happy my package never got…",
          "Contenu": "I was not happy my package never got here and I hope I don't get charged for it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kaci C.",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T23:05:19.000Z",
          "Titre": "Total scam",
          "Contenu": "Total scam. This is not a purchase option. It's a lease w an option to buy. I called to cancel right after and got the run around. You will end up paying at least twice the amount listed then have the OPTION to purchase for even more $$$  Don't do it. It is for stupid people who want to throw their monet away."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T16:18:21.000Z",
          "Titre": "Are you like I said before I never got…",
          "Contenu": "Are you like I said before I never got the product I don’t understand why I’m making payments of some thing it never got terrible terrible experience Talk to both parties and nobody seems don’t know what’s going on"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Concerned Customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T19:30:18.000Z",
          "Titre": "DON'T DO BUSINESS WITH",
          "Contenu": "This is a tricky contract with fine print and high interest rates. I cancelled my purchase once I read it.  Vendors using this options for their customers are not familiar PayTomorrow's contracts terms and feel it is not their issue if you need or want to finance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aedyn",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T03:38:03.000Z",
          "Titre": "Lack of information given when using service",
          "Contenu": "The contract filled out does not give all the information and they try to say afterwards that you agreed to things not in the contract you are signing.It also is not financing, it is a lease.Not to be trusted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mariann Paulsen",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T21:01:00.000Z",
          "Titre": "No response to any call .I paid 10$ for…",
          "Contenu": "No response to any call .I paid 10$ for a scam .I am reporting as a scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ross harrison",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T22:42:10.000Z",
          "Titre": "Avoid at all costs",
          "Contenu": "Avoid at all costs! They are a scam and in the end you will pay almost 50% in interest charges."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T15:53:41.000Z",
          "Titre": "Dishonest about interest in initial…",
          "Contenu": "Dishonest about interest in initial contact. I canceled my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T17:30:04.000Z",
          "Titre": "Company is horrible and has horrible…",
          "Contenu": "Company is horrible and has horrible customer service I do not recommend this company to anyone !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T14:55:34.000Z",
          "Titre": "Terrible finance company",
          "Contenu": "At no point in time when making a purchase utilizing PayTomorrow was it ever disclosed that the payments were going to be automatically charged and that those payments could only be the minimum amount. I had planned on making more than just the minimum payment amount but was told by the unsatisfactory customer service representative that I would have to call a number every single time I want to make a payment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T19:21:38.000Z",
          "Titre": "Bait and switch",
          "Contenu": "Bait and switch! BUYER BEWARE! They only offer loans after you’ve paid to lease the item. Once your lease is paid off (usually the total cost of the item,) you have to pay to keep it. Be prepared to spend and least 2x what your item costs. They don’t t tell you this until it’s too late."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Felicia",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T15:20:28.000Z",
          "Titre": "As Soon as I got the bike home it…",
          "Contenu": "As Soon as I got the bike home it didn't start up at all"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T16:30:06.000Z",
          "Titre": "No tires shipped order was canceled"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T21:22:03.000Z",
          "Titre": "$9.99 refund",
          "Contenu": "I feel the $9.99 charge should be refunded as it was not our fault the business didn't have the product we were attempting to purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T01:07:26.000Z",
          "Titre": "Haven't gotten tires no call no nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T16:37:11.000Z",
          "Titre": "Do you care?",
          "Contenu": "I am currently under investigation with a misdelivery of my tires meanwhile pay tomorrow must don't care because they continue to withdrawal my payment out of my account and I have no tires. This has been going on almost a month and I still haven't had a finalize case yet."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T01:43:29.000Z",
          "Titre": "Horrendous",
          "Contenu": "Horrendous! I’d even go so far as to call them evil. Completely predatory in their business model and highly unethical. Slapped my signature on documents I did not sign! Grimey company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-05T00:53:32.000Z",
          "Titre": "Someone named Velma Nichols is using my…",
          "Contenu": "Someone named Velma Nichols is using my email and last name and any other info to open an account in my name. No one is helping me. I'm going to report you to the Illinois state attorneys office if this doesn't get taken care of"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T17:00:54.000Z",
          "Titre": "I've contacted your company twice…",
          "Contenu": "I've contacted your company twice regarding paying off the full amount. I sent an email that was never responded to and called and left a detailed voice message, and that too was never returned. It feels like the avoidance is intentional. How is not paying off the full amount an option on your website or in the app?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer w/$&friemds",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T15:12:31.000Z",
          "Titre": "Absolutely, poor to non existent customer service.",
          "Contenu": "Absolutely, no assistance what so ever.  Wow! Have you not heard of the 290 rule?Mot only do I want a refund or cancellation, but now I have to share this sad story with my co-teachers! ThanksUpdate… i knew this was going to be an on-line nightmare! I tried cancelling at both finance co Paytomorrow, and Citimarine… No luck .  Buyer beware!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A web buyer",
          "Nb_Reviews": 3,
          "Date": "2022-05-19T00:45:41.000Z",
          "Titre": "Misleading sales tactic",
          "Contenu": "I was misled into thinking that I would only have to pay one price. Now, it appears that I will have to pay double the amount for a set of tires. I think this is called bait and switch. Someone should call me and explain to me what is going on with my account. Like why is there a Stage 1 and a Stage 2 for my account?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T18:03:06.000Z",
          "Titre": "Definitely not was I expected",
          "Contenu": "Definitely not was I expected.   The gentleman who helped me sounded like he was on a beach. Couldn’t hear me and was not even trying to answer my question and could not help.    Was not happy with this company and will never use again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANTHONY SIMPSON",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T16:46:07.000Z",
          "Titre": "This is bull crap I've been text…",
          "Contenu": "This is bull crap I've been text calling and emailing to come pic this mower up I have got kicked out of my home cuse it got sold and the mower will be gone soon if it don't get picked up soon I'll not do business in the future as well I have reached out to the merchant as well and they have refused to contact me as well"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-24T04:19:17.000Z",
          "Titre": "I am really angry and am about to seek legal help",
          "Contenu": "I am still being charged for goods that I have never received. I have received zero response from extreme customs on my cancelation nor have I received any confirmation of the loan cancelation progress. And I continue to be charged. The last communication I received, was you \"pay tomorrow\" were going to contact them directly to expedite the process. I want a refund for everything I have been charged, or I am going to seek legal advice. I would appreciate a sense of urgency on this matter. Jason Stiner2155 Golden Gardens St Eugene Oregon 97402 541-357-2944"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T15:44:34.000Z",
          "Titre": "Pathetic accounting",
          "Contenu": "I immediately canceled and order from a vendor and was told it would be taken care of by both them and you. Today, money was taken from my account that I do not owe and when I called there is just finger pointing. I called the vendor and they said they sent you the refund in the 27th of January. I’m being given the run around and it’s costing me money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Upset customer",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T04:41:42.000Z",
          "Titre": "Bought a motorcycle with this company…",
          "Contenu": "Bought a motorcycle with this company and I thought I was buying it out right. Wrong! For the first two years, I will be leasing the motorcycle. Then on the third year, I will be purchasing the bike through this company. Basically, I will pay three times what the bike is worth. Never again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Petrovich",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T20:24:52.000Z",
          "Titre": "Tracking says engine was delivered",
          "Contenu": "Tracking says engine was delivered.  Mechanic has not seen it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 3,
          "Date": "2022-01-14T14:39:05.000Z",
          "Titre": "I’m really upset over pay tomorrow…",
          "Contenu": "I’m really upset over pay tomorrow because the finance chargers are really really high. If I could have given no stars I would have. The tires that I was going to buy would cost me 1300.00 .I’m sorry but I drive a Dodge Ram 4x4 with 20” tires and they would only cost me 800.00 to 1000.00 and these 16” tires was going to cost me 1300.00 . Thank you! Harry Lilley"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-18T21:25:12.000Z",
          "Titre": "Superjewler is scam",
          "Contenu": "Superjewler is scam, they sold me a ring for $3800 and when I received it 3 weeks late it appraised for $1800, won't be doing busniess with them or a company that finances and therefore contributes to fraud."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tommy Everett",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T22:56:17.000Z",
          "Titre": "Still taking payments after pay off",
          "Contenu": "Well I paid my account on full and asked them to remove my credit card from their system.They said we can't do that yet just in case we need to send you a refund. That made no sense until the next payment date came around and they took out another payment that I didn't owe. Still trying to get my overpayment back before the next billing cycle. Wish me luck 🤞"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T04:15:20.000Z",
          "Titre": "Read carefully before you purchase…",
          "Contenu": "Read carefully before you purchase using Pay Tomorrow! This isn’t a finance contract rather its a lease then you finance the interest, vary deceptive! Would never have opt for Pay tomorrow had I read through more clearly.  It wasn’t clear until it’s to late.  It my fault I didn’t look into it more but this is a horrible option!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "shanetta richardson",
          "Nb_Reviews": 2,
          "Date": "2022-06-09T21:10:59.000Z",
          "Titre": "Be careful!!!!",
          "Contenu": "I had to use my road hazard in my first week of installing my new tires. I also, had to purchase a fifth tire before I could use my road hazard warranty. Before choosing a company to finance your purchase call them to verify all parts of your contract. What you can and can't do. Most of the have a finance minimum of $300. I couldn't add the replacement tire to my current contract. I had to start another contract with a different company because the total amount was below $300. The agent I spoke with suggested I add TPS sensors or other items to the order I did not need. I am so disappointed with my first experience. Be careful when selecting your financing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-08-01T17:21:48.000Z",
          "Titre": "I have tried to contact you people to…",
          "Contenu": "I have tried to contact you people to cancel my order 10 minutes after I saw the terms an the prices no one will not even answer or give a call back the number are bogus no one answers them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick Blackburn,",
          "Nb_Reviews": 2,
          "Date": "2022-03-16T14:08:53.000Z",
          "Titre": "Loan sharks",
          "Contenu": "Loan sharks, Instead of loaning you the funds to purchase an item at a reasonable interest rate, they buy it and lease it to you, then they sell it to you with interest after you have paid for its full cost with the lease funds . So, your paying double for your item or they are making 100% interest on their money. Conclusion this is a Scam and PayTomorrow is laughing at you all the way to the bank. You will be paying well into tomorrow if you do business with them. P.S. Just to show the level of greed this compay has they even charge you a fee for the lease appliaction."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T21:06:05.000Z",
          "Titre": "I was upset with how I have a credit…",
          "Contenu": "I was upset with how I have a credit score in the 700's and had to pay weekly by ACH withdrawal.  Supposedly your company states has 90 days to get out of contract with no fee but yet 9 days after my purchased I called to make a $5000.00 payment to pay off my loan and was told the payoff balance was 5249.00.  This company is a joke and next time I will just get financing from my bank instead of retailers financing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tracy Gibbons",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T00:16:01.567Z",
          "Titre": "I was approved",
          "Contenu": "I was approved, then unfortunately had to cancel the fraiser engine, due to fraiser not calling me to set up delivery information and account was refunded to you,  then was denied when I tried  to get approved  again, made absolutely no sense!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phillip Wright",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T19:24:30.000Z",
          "Titre": "Even after I paid off my loan they kept…",
          "Contenu": "Even after I paid off my loan they kept taking money. Getting someone to answer the phone is a process. This company is shady in many ways. It's not something I will ever use again. They are NOT trustworthy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Knea Council-Williams",
          "Nb_Reviews": 1,
          "Date": "2021-09-08T11:15:39.000Z",
          "Titre": "This company is A SCAM and customer…",
          "Contenu": "This company is A SCAM and customer service is HORRIBLE!!!! My total for my tires were 711.61 I received 3 different amounts. 711, 761.66 and then 1,141.61!!!! No where in the lease or contract did it say tires had to be returned or paid off in 90 days!! Who would pay 1,141.61 for tires!!!!DON'T DO IT SAVE YOUR MONEY!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T03:07:55.000Z",
          "Titre": "Horrific help",
          "Contenu": "Horrific help, tried to cancel my loan with in 4-6 hrs of making the order. I was told that is not possible when by law it is. and in all the paperwork it say it is. everytime i called i was denialed when i asked for a manager of to talk with their boss and always told me to wait a month. maybe then someone could do something about it. this company i horrific scamers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-29T15:21:01.000Z",
          "Titre": "Been laid off for awhile because of the…",
          "Contenu": "Been laid off for awhile because of the Coronavirus.Received an offer from Pay Tomorrow for a No Credit loan/lease option for new tires.Well I wasn't approved because of my credit score.So they are misleading by saying No credit needed.You do need credit to get approved by Pay Tomorrow so don't be mislead by their No Credit Needed B.S. 👎"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shannon a Painter",
          "Nb_Reviews": 3,
          "Date": "2021-12-17T18:31:05.000Z",
          "Titre": "Well at first everything seems great…",
          "Contenu": "Well at first everything seems great easy ordering fast application process and shipping.Then u go to start paying and there saying I missed my first payment wen I have the receipt and the portal to make payments is basic. No way of auto pay and I thought that's wat it was"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary King",
          "Nb_Reviews": 1,
          "Date": "2021-08-07T10:01:31.000Z",
          "Titre": "They never said anything about paying a…",
          "Contenu": "They never said anything about paying a loan agreement first for about the amount you spend then having to buy out your merchandise off the lease you were on for another double the amount you spent... i looked at everything that was available to me for paperwork and there was nothing stating that's what i was getting into then after signing you get to agreements 1 is a loan and other is a lease... complete crooks!! Don't do it no matter how bad u want the stuff is not worth it!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-27T13:30:43.000Z",
          "Titre": "Your lender accepted my loan and then…",
          "Contenu": "Your lender accepted my loan and then canceled my loan and then never issued me a refund for my down payment of a $102.00. Almost a month later and over 60 emails and I finally got confirmation of getting my refund back.  A week after that I’m still waiting for my refund and that’s business 7 business days not counting weekends or Friday. Unless your desperate or have horrible credit don’t use them. USE AFFIRM there much better and much more widely used so you’ll have more purchase power plus a lot lower payments."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 4,
          "Date": "2021-05-09T08:29:05.000Z",
          "Titre": "DONT DO IT BECAUSE YOU WILL BE TURNED DOWN",
          "Contenu": "WELL FIRST AND FOREMOST IM ONE TO LEAVE REVIEWS AND FOR THE \"PAY TOMORROW\" AND THEM SAYING HOW THEY APPROVE PRETTY MUCH ANYONE AND FOR ME TO HAVE FAIRLY DECENT CREDIT AND TO GET TURNED DOWN IS BEYOND ME. I WOULD NOT TRUST NOR WILL I RECOMMEND \"PAY TOMORROW\" TO ANY FAMILY, FRIENDS, OR COWORKERS, AND TRUST AND BELIEVE THERE ALWAYS LOOKING FOR PLACES TO DO BUSINESS THAT THERE ABLE TO GET CREDIT AND THERE SCORES ARE 800+ BUT IM SORRY THINGS DID NOT WORK OUT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Javi",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T19:34:09.000Z",
          "Titre": "Bad company",
          "Contenu": "Bad company, DONT finance with these people they don't mention that it is a lease, on top of that they go ahead and charge you $60 for an \"application fee\" when it says it's free. I cancelled my order my money never got refunded. it's a scam very bad customer service. I repeat DONT FINANCE WITH PAYTOMORROW."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "peyton bryant",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T14:33:36.000Z",
          "Titre": "WARNING!!",
          "Contenu": "WARNING!!! Do not finance anything with this company You'll pay DOUBLE the amount financed, you Lease first afterwards you'll finance your interest under two contracts ( Which is not Legal in most states ) I am putting in motion a class action recovery. if anyone has fallen for this or have a loan with this company please contact me as soon as possible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-30T20:31:28.000Z",
          "Titre": "Terrible service will never buy from…",
          "Contenu": "Terrible service will never buy from them again gotta pay to return something that they said would fit it but it was way too big and then u gotta pay a restocking fee then pay shipping to send ur return back so i will never shop again with them terrible customer Service and rudeness"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Massey",
          "Nb_Reviews": 1,
          "Date": "2021-05-13T20:39:53.000Z",
          "Titre": "PayTomorrow is a BIG SCAM",
          "Contenu": "PayTomorrow is a BIG SCAM! RUN away they are not upfront and honest. You think you are getting a loan when the are actually putting you under a lease agreement. After you pay a full 12 months on what you think is a loan, they then charge an addition 12 months worth of loan payments. I hate this company. I will never use them again or buy from a company that uses their services. They got me, but I have nothing but time to write bad reviews on them on every social media platform. I'm the wrong person to scam!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-06T00:56:43.000Z",
          "Titre": "This service is a ripoff",
          "Contenu": "This service is a ripoff. How can you bill be extra 600$ for a 900$ tire purchase?? 1500$ for 4 tires? Like why you charging us 600$ more over the price??? This finance deal is theft"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T14:49:53.000Z",
          "Titre": "Ignored my request …",
          "Contenu": "Had asked to hold off on processing the order until I could verify the rims would properly fit nobody bothered to listen nor contact me regarding my concerns. Completely ignored my request and rushed the order and shipping process so I'm stuck with rims that I will most likely have to buy a new tires as well which is  nonsense. After waiting several days and still never gotten a solid yes or no as far as proper fit on my BMW they just shipped I questioned their motive being I'm now forced by new tires as well.I already have new tires that will not fit my new rims"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Fernando  v",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T18:59:52.000Z",
          "Titre": "They did tell me have to pay anything…",
          "Contenu": "They did tell me have to pay anything now. Told them when I get payed why ask for money now.might have to cancel this"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Hicks",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T19:04:26.000Z",
          "Titre": "The price is too high and the term is…",
          "Contenu": "The price is too high and the term is too long. Averaging three times the original price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah E",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T15:28:03.000Z",
          "Titre": "Misleading",
          "Contenu": "There was no indication that there will be “extra” payments outside of the biweekly for the first 2 months at one price then biweekly for the additional 4 months at another price. The email containing the pdf contract was not sent out until after confirmation of using PayTomorrow for payment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gerald Stanford",
          "Nb_Reviews": 4,
          "Date": "2022-08-02T15:17:13.000Z",
          "Titre": "I paid $20 for next day shipping to be…",
          "Contenu": "I paid $20 for next day shipping to be on time to get engaged with the rings I bought the rings did not show up until 4 days later I feel I got ripped off paying that much for shipping which could have came through the mail just as quick . I feel I should be reimbursed the $20"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-16T00:54:07.000Z",
          "Titre": "You need to seriously rework your…",
          "Contenu": "You need to seriously rework your account system, make it more user friendly and more informative. We should be allowed to see things like pay off dates, account balances and being able to make larger payments without having to contact you each time. The way you have it setup currently you make people think you want only the minimum to take advantage of people making them pay the higher intrest."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "James Sam",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T02:15:53.000Z",
          "Titre": "I call today to make a payment",
          "Contenu": "I call today to make a payment! Well no one pick up the phone after several minutes waiting. So I left a voice mail with my name and number. Several hours later still no return call! This is my 1st payment!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Deena M",
          "Nb_Reviews": 16,
          "Date": "2022-01-17T22:37:03.000Z",
          "Titre": "Not The Best, But They Helped Me",
          "Contenu": "I needed to get new tires for my car. I didn't have enough money at the time, so I decided to give PayTomorrow a try. Customer service is pretty good, but they have hidden fees. If I wasn't able to pay their \"90 day buyout\", I would have payed hundreds more just to pay off the loan from them. I would have payed more in fees verses what the tires actually costed! I didn't find anything about fees before agreeing to the loan, but of course, that's how they get you. Just be careful with PayTomorrow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T16:35:34.000Z",
          "Titre": "There was too much confusion with my…",
          "Contenu": "There was too much confusion with my order.  Seem like there was confusion between the loan provider and the company making the computer.  First I was suppose to turn in a form and then I didn’t have to, and then I didn’t choose a power cord.  Every time the say something is wrong it prolongs the shipping.  Probably why it takes almost 2 months to receive your order.  It really takes to long for a computer, they don’t take that long to build."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nigel Lopez",
          "Nb_Reviews": 4,
          "Date": "2021-08-19T02:51:04.000Z",
          "Titre": "I won't use Paytomorrow again.",
          "Contenu": "You spend all this time shopping for wheels and tires. You see this monthly payment number advertising Paytomorrow. Then you go to checkout and it's much more complex. Had I realized the way the payments broke down and the extent of the agreement, prior to selecting my wheel and tire pkg. I would have gone to another site and used paypal pay in 4. Not Paytomorrow's fault, I still haven't received my wheels after a month. I won't use this finance service or buy from that company again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-04-09T16:48:45.000Z",
          "Titre": "There app is no good",
          "Contenu": "There app is no good, can’t schedule payments or skip (pay ahead) have to call and wait to pay ahead, then they won’t reschedule ur payment date, set up for Friday now it withdrawals at 4am, my money ain’t there till 8:30 so I asked them to reset it for Saturday and they still pulling it at 4am Friday..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nellie Washington",
          "Nb_Reviews": 2,
          "Date": "2020-10-16T11:58:22.000Z",
          "Titre": "Good and Bad",
          "Contenu": "It’s a good opportunity to get an item you really want and pay over time. What they don’t tell you is after the payment term you will still have about 40% left that’s due in a lump sum. So you will likely pay 40% more with this payment option. You have the option to pay it off the first 90 days to avoid this. If not, you’re really screwed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-12T19:59:09.000Z",
          "Titre": "Although the customer service was…",
          "Contenu": "Although the customer service was amazing the overall experience with the fees that I would of had to pay less then a month into the contact gives this a low score..I had this loan for 3 weeks at 6% interest and hidden fees was well over 300 for the loan.  Again Amy was amazing and I want a special shout out to her customer service. Will not be making the mistake using this lending service in the future"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frederick Moody",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T20:18:40.000Z",
          "Titre": "Was not made aware of the fact that…",
          "Contenu": "Was not made aware of the fact that there was a 12-month lease soon. Prior to paying off the loan although the interest rate World's Fair the fact that you are leasing the item for 12 months you wind up paying $3,900 for a $2,400 item over a two-year."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darline Navarrete",
          "Nb_Reviews": 2,
          "Date": "2019-09-26T16:16:41.000Z",
          "Titre": "I'm very unhappy with pay tomorrow…",
          "Contenu": "I'm very unhappy with pay tomorrow because I've have been trying to get this account closed out over a month. Was told it had been two weeks ago yet they took money out of my account for payment on a bed that was supposed to be a king and they had it as a queen. If it wasn't for Robin who works there a wouldn't have got that pymnt back. They still owe my account for the first pymnt a month ago.  Cant till its closed they said. But I'm told it was. Not what's the problem?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T04:39:43.000Z",
          "Titre": "The lady that handled my request was…",
          "Contenu": "The lady that handled my request was very disrespectful to you. Had a problem answering questions. And just the East I was treated. Half my order is wrong. And I’m taking legal action against CGI, LED Equiment and Fenix. Dustin have treated me very disrespectful. The brackets for the 50’ light bar that were ordered as red and white are red only. There are no controls built into the LED visors and the Fenix were to be red and blue mine are all red with no brackets to mount them.. so I pay about $300.00 over for the stuff I get I instead of the items I ordered. The running board brackets don’t fit my truck too."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T20:37:45.000Z",
          "Titre": "Make sure you understand your contract",
          "Contenu": "I will admit that I missed some of the fine prints on the contract but that’s not why they are losing stars. They are losing stars because when asked about lease / loan, I was told condescendingly that it’s in the contract. I needed clarification not a “duh go read it again”. Then they send my monthly statement which is full of mistakes. When asked for these mistakes to be fixed, I just get sent the same statement with the same mistakes. In the statement it says I am making a monthly payment of $XX but that’s a weekly payment. I gave up trying to have it fixed. Other than that, they approved me when no one else would so they still get some stars."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T15:44:50.000Z",
          "Titre": "I was not followed up with from the…",
          "Contenu": "I was not followed up with from the company. When I called about my payment, the person that answered the phone said that they closed. Then, about three months later, I receive an email about making a payment."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T03:26:44.000Z",
          "Titre": "Do not use them unless it is your last alternative",
          "Contenu": "This company really like to charge for every little thing whether it is ethical, good business, or just flat out wrong .   They really do not give you all of the information until after everything is pushed through."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-10-27T13:26:24.000Z",
          "Titre": "The app doesn't show a payment…",
          "Contenu": "The app doesn't show a payment schedule. I made my first payment a few days early and a another payment was deducted on the actual due date. Nowhere on the app am I able to see my balance."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2021-04-16T11:55:30.000Z",
          "Titre": "Took forever to send the money over so…",
          "Contenu": "Took forever to send the money over so my tires could be shipped. I didn’t get my tires fit 3 weeks . I was moving out of state and got them the day before I moved . Was ridiculous"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T16:28:18.000Z",
          "Titre": "A higher up decided your fate.",
          "Contenu": "Great company with a solid mindset, but offer a “other amount” selection when making a payment!! If I want to pay a few extra dollars every week, I should be allowed to!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Robert Fillmore",
          "Nb_Reviews": 2,
          "Date": "2020-07-01T18:09:38.000Z",
          "Titre": "I rated poor because I only received…",
          "Contenu": "I rated poor because I only received two of the four tires initially but the first payment was taken in full.  It took over a month to receive all four tires but finally recieved them."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T20:08:57.000Z",
          "Titre": "Purchased item over a month and a half…",
          "Contenu": "Purchased item over a month and a half ago. Have already made 2 payments and also  what I think was a large down payment and still haven't received my purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T13:13:05.000Z",
          "Titre": "I wasnt provided with a reminder about…",
          "Contenu": "I wasnt provided with a reminder about scheduled payment a few days in advance. I get reminders about regular payments elsewhere but not from you guys."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T22:32:13.000Z",
          "Titre": "Not able to pay before they set up…",
          "Contenu": "Not able to pay before they set up don’t like it that way never see how it is going what I owe"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-01T14:19:39.000Z",
          "Titre": "Can’t see full account information on…",
          "Contenu": "Can’t see full account information on website.   Very important to be able to see when it has to do with financial information."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-16T20:59:25.000Z",
          "Titre": "Your website has absolute trash",
          "Contenu": "Your website has absolute trash. It has proven impossible to make a payment so I’m assuming I’m just going further into debt."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-06-03T14:29:41.000Z",
          "Titre": "Didn’t really clarify that it was…",
          "Contenu": "Didn’t really clarify that it was biweekly payments.  Stated it was $x/month. Ended up being 2 payments per month."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edwina gibson",
          "Nb_Reviews": 1,
          "Date": "2020-09-30T14:03:59.000Z",
          "Titre": "I don’t like the fact that I was…",
          "Contenu": "I don’t like the fact that I was approved for 5000 I couldn’t use it all to get two bikes but only one that was less"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Smith",
          "Nb_Reviews": 2,
          "Date": "2022-07-25T19:25:53.000Z",
          "Titre": "Got tires have not gotten rims ,got to…",
          "Contenu": "Got tires have not gotten rims ,got to have both at wons to make it work"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "dan swenson",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T18:49:37.000Z",
          "Titre": "The app is not very user friendly and I…",
          "Contenu": "The app is not very user friendly and I couldn’t find where to login online."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T19:16:36.000Z",
          "Titre": "I requested a change in the credit card…",
          "Contenu": "I requested a change in the credit card to be used for payment but it charged the payment to the original card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T05:01:19.000Z",
          "Titre": "Lady on phonecwhen u call for…",
          "Contenu": "Lady on phonecwhen u call for information is rude doesn't seen to care about  customers"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mason",
          "Nb_Reviews": 1,
          "Date": "2019-10-29T13:06:11.000Z",
          "Titre": "Never told me my wheels were not the…",
          "Contenu": "Never told me my wheels were not the same patter so one side look good the other look different"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-03T21:45:41.000Z",
          "Titre": "My bill at the store came to $3,100.00",
          "Contenu": "My bill at the store came to $3,100.00. I owe them $4,770.  That's a lot of fees."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T01:37:08.000Z",
          "Titre": "Yall should put up a way to pay more on…",
          "Contenu": "Yall should put up a way to pay more on your payment app."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "louis .",
          "Nb_Reviews": 4,
          "Date": "2021-04-12T14:17:58.000Z",
          "Titre": "If you use them you end up paying…",
          "Contenu": "If you use them you end up paying double the price for you it am ordered"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-28T18:33:21.000Z",
          "Titre": "I asked to get a call to give another…",
          "Contenu": "I asked to get a call to give another card so I can pay with other card"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CGood",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T21:46:44.000Z",
          "Titre": "I paid my loan off in full last week…",
          "Contenu": "I paid my loan off in full last week and today I got a bill!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandy Eckman",
          "Nb_Reviews": 2,
          "Date": "2020-02-09T21:42:28.000Z",
          "Titre": "Family Pool Fun/BMI and PayTommorrow.  Go elsewhere if possible!!!",
          "Contenu": "Hi I got a loan for a pool from family pool fun this company, Pay Tommorow/BMI.  I have made all my payments on time.  Last month the rep pulled my payment 12-31-19.  This month the money was in the act and I just talked to them yesterday 1-30-20.  I even said that I understand my payment is in process of being pulled.  Rep Taylor replied yes it is.  So today 1-31-20 I get 2 nasty messages that I've been late with several payments.  Your act is in distress status.  I will be getting late charges & bouncing fees.  So I called back and insisted he pull payment and it insisted that he pull it immediately.  Payment went thru no issues.  Taylor never apologized or said I am sorry for his phone messages or rudeness.  This is how they treat people not professional in any way.  I'm highly dissatisfied and disappointed with Pay Tommorrow, BMI, and family pool fun.  PayTommorow could of politely called or asked while I was on the phone with them yesterday. As weve been battling them since the winter pool cover was supposed the armour cover and we got just a thin tarp which is shredded from the Pa winter storms.  In addition to the upgraded pool has gotten a tear which it's been months of communicating thru Jay and the warranty which still neither has been replaced, we have a lot of run around.  A lot of disappointment. We followed directions in building said.  Also sent emails and pictures of problems.Thanks S Eckman Review stays the same your customer service is horrible and useless.  Will pay this loan off.  No real comment from company except for blaming the other part of the company.  We have heard it before."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T21:27:35.000Z",
          "Titre": "They take money before payment dates"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-11T10:26:06.000Z",
          "Titre": "Decent service but can never login to…",
          "Contenu": "Decent service but can never login to pay my bill"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-04T21:49:37.000Z",
          "Titre": "Can't make my own payments"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dissatisfied Customer",
          "Nb_Reviews": 2,
          "Date": "2021-05-13T19:45:44.000Z",
          "Titre": "Constructive is a matter of…",
          "Contenu": "Constructive is a matter of perspective- first of all 🤣Secondly- \"interest free\" if paid in 90 days, but you still have interest on it....pretty sure that's not \"interest free\" but OKAYAlso the way you phrased things in the setup is misleading in the way some stores price one item for like $5.00, then like the 2pk is like $10.99 (but they like hide it way better because they advertise it in a way that makes you THINK you're getting a better deal).Your contracts arent very clear in the what you would pay, what you are paying, how long, etc. I literally talked to one of your reps that said she finds people often are confused when reading your contracts. Soooo clearly either that's one of your ways to get money out of people easier, or something.Also one of your reps was kinda short. Told me basically \"per my last email\" when her last email didn't have anything to do with my question. I had to remind her \"didn't you say if I don't have my order by my first payment due date, you'd push it out?\" Then she wasn't short with me. She was short in email and over the phone. Last one or two I spoke to were nice though.I just remember Sadie was not so much (remembered her name only because that's my nickname).Next issue I had was that PayTomorrow and the company I bought from DO NOT COMMUNICATE whatsoever. And PayTomorrow doesnt tell you your full outstanding balance online. You have to call each time you need that info.Also cannot pay more than you actually owe at that time without calling.When my order was not only late, but they shipped without customizations I ordered- and reached out after the fact saying they did so- they refused to send the check to PayTomorrow.But they sent me my contract that I have with PayTomorrow before PayTomorrow did 🤣Sadie also told me in my initial call that I would be contacted by one of their reps....that NEVER happened....she thought it was weird they didn't....well I mean the company that you paid wouldn't even send my $500 reimbursement to you for the customizations they failed to honor. So like, clearly this whole this was just simply a terrible experience. Should've just waited a bit longer to pay in full out of pocket, MAJOR regrets even though it's all paid off in the 90 day period. Do not recommend"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William N.",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T14:26:06.000Z",
          "Titre": "COMMUNICATION",
          "Contenu": "I appreciate the expediency in which the approval process took place.  However, all the back and forth, on the phone, between pay tomorrow and the vendor, was a hassle.  If it were not for me calling, neither end would have processed my request.  One or the other was waiting on the other to do something, the only way they knew to do something, was through my call."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Masters",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T20:52:31.000Z",
          "Titre": "It's took way to long to get product"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Mori",
          "Nb_Reviews": 3,
          "Date": "2023-01-05T18:56:26.000Z",
          "Titre": "It’s a good experience but…",
          "Contenu": "It’s a good experience, fast approval but the website itself is a little confusing. I thought once you weee approved “they” (pay tomorrow) would recognize my email and be able to retrieve information about you account. I wanted to start paying sooner but there’s no way of doing that. I guess they wait till the products have been shipped? But once again there is nothing that stipulates that information."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T21:29:14.000Z",
          "Titre": "To fast  to judge",
          "Contenu": "You should be  so eager  to turn people down for a loan since they  had perfect  payment  record with   your  company then a day  later   I was  approved for a  loan  through  the company"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John W Reno",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T09:39:42.000Z",
          "Titre": "Sleep Deprivied",
          "Contenu": "So far everything has been O.K. until delivery. Paytomorrow agent called me an woke me up first thing this morning, was not happy and hung up only to have them call back. dont need a company breathing down my neck. Not appriciated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Mori",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T05:05:19.000Z",
          "Titre": "VERY VERY EXPENSIVE buyer beware",
          "Contenu": "VERY VERY EXPENSIVE buyer beware! I think it’s a great concept in theory, but once adding the interest it’s extremely expensive. Give you an example. I purchased wheels and an exhaust system for $3600. I  Read about “pay tomorrow” thought the payments were definitely manageable. Due to the low monthly payments. I purchased my products Jan 23rd…after looking at the contracts, (VERY confusing) I added up what the final payments were and that $3600 is over $5000 in 2 years. I decided to pay it off. Now consider that I purchased the equipment Jan 23, I paid it off Feb 4. In 12 days they charged me over $200 to pay it off. That comes out to about 30% interest! A high interest credit card at 27% interest rate would have been better to use. I get that people are strapped for cash, but try to look into other option prior to accepting the pay tomorrow contract. I only lost $200 and I make a decent living! But the alternative in paying that high interest is alarming to say the least!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dissatisfied N. Damon",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T17:55:47.000Z",
          "Titre": "The total lease price need to be listed…",
          "Contenu": "The total lease price need to be listed up front, not three weeks after you have purchased your item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Devin w",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T16:33:09.000Z",
          "Titre": "Had to cancel my order and redo it and…",
          "Contenu": "Had to cancel my order and redo it and had to pay a 2nd application fee."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeffrey  Bechen",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T21:19:10.000Z",
          "Titre": "I would of gave you a 5 star but when I…",
          "Contenu": "I would of gave you a 5 star but when I first went to apply. It gave me a price of 45 something every two weeks. For so long then 40.54 for the remainder but I hit back button on accident had to do it all over and it came up 6$ more a pay. But whatever. I just didn't understand why it charged me more second time in."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-07T15:37:43.000Z",
          "Titre": "Satisfied",
          "Contenu": "I wasn't able to add on an extra $28/month for the warranty. Overall I'm happy with the services."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason T",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T19:56:04.000Z",
          "Titre": "Damaged.",
          "Contenu": "The shipment was damaged and I ended up having to pick it up myself instead of it being delivered to my address.   It took 10 days for the shipper to address the problems.   And now the 1st payment was due to come out automatically on the 15th of August and is HAS NOT been taken out yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yvonne",
          "Nb_Reviews": 2,
          "Date": "2022-07-04T22:04:06.000Z",
          "Titre": "This is not a real buy now program",
          "Contenu": "This is not a real buy now program.  When I printed out the paperwork noticed it said LEASE.  Payment  plan is outrageous, paying $4,000 for tires and wheels unless have $2800 by September.  I have dealt with other buy now pay later firms and have not been ripped off  like this!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T17:36:28.000Z",
          "Titre": "Have yet to receive any shipping info",
          "Contenu": "Have yet to receive any shipping info. Not sure of a time expectancy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pepei Proter",
          "Nb_Reviews": 4,
          "Date": "2021-09-14T20:38:44.000Z",
          "Titre": "Pay Tomorrow has been good to me so…",
          "Contenu": "Pay Tomorrow has been good to me so far. The only thing I hold against them is the website they use for taking payments needs work, there is hardly no functionality after logging in. I wanted to pay my bill early and I couldn’t. Somebody had to get an email communication from me in order to take a regular payment. It took 3 days for something that should have took 5 minutes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-12T13:52:34.000Z",
          "Titre": "Easy loan process, but website needs some work",
          "Contenu": "The loan process is super easy and the employees are very helpful and positive. I would give a better review, but  I was not given clear information about pay dates or interest rates until after I was approved and given the money. Also, if you want to pay early or more, you can't access any information or make any additional payments online, but you have to call them during office hours, so it makes it more complicated to pay extra."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-14T18:56:56.000Z",
          "Titre": "They charge way too much",
          "Contenu": "I had bought a couch and paid in full with another store and they kept pushing my delivery date back due to COVID so I decided to do financing until I got my refund back. I had planned on paying it off immediately and chose this route since I’m buying a house and didn’t want it on my credit, I didn’t realize the amount they charged was so much. While it was convenient I would not recommend unless you’re okay paying $700 plus extra."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Heather Hale",
          "Nb_Reviews": 2,
          "Date": "2020-04-06T20:53:32.000Z",
          "Titre": "Online portion isn't great, phone-based customer service is",
          "Contenu": "The online account portion doesn't display helpful information (like current loan balance & payoff amount - or even an option to get either of those).  You can't make extra payments or do much of ANYthing online.Had to call customer service & the despite hating to ever use the phone, the customer service person was really easy to work with.  So the online portion pretty much sucks, but the customer support folks are nice.  Please make the online a LOT more user-friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Abbey",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T19:06:08.000Z",
          "Titre": "Please update the customer website",
          "Contenu": "It would be great if as a customer I could make additional payments using the website without having to call customer service and wait for 10 minutes to speak with a person to take my information just to make an additional payment."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T22:10:47.000Z",
          "Titre": "My experience with pay tomorrow was…",
          "Contenu": "My experience with pay tomorrow was good other than the shipping. I purchased a motorcycle for my grandson for his 8th birthday and paytomorrow didn't allow the store where I purchased it from to be shipped to my daughter's house for his birthday so I had to spend $285 to ship my grandsons bike.I don't think that is right because I am spending my money they have my bank information and I can't have an item shipped where I want to be shipped. I truly think that they should change that policy other than that the experience was great. I might do more business with them if they change that policy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lulu",
          "Nb_Reviews": 1,
          "Date": "2019-05-22T01:09:14.000Z",
          "Titre": "Did its job. Could have been better but no real complaints.",
          "Contenu": "Never had any issues with payments as they were automatically deducted from my card. Although there were a few times where I wanted to make additional payments but the provided link didn't work. Not a huge issue but I would have liked to pay my item off sooner.Secondly, sometimes the automatic payments wouldn't come out exactly on the first as intended. I never had a late payment so either someone was slacking on their side or their script wasn't working right. Payment was always taking from the 1st to the 5th of the month, whenever it felt like it which can cause big problems for other people."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 6,
          "Date": "2020-05-14T21:14:16.000Z",
          "Titre": "It’s just ok",
          "Contenu": "My account when I logged in it don’t say much just shows my payment that’s all .... not what I owe or what I have paid . I’ve used affirm in the past it was a lot better to me my account would show me everything the way it should be."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Britton",
          "Nb_Reviews": 1,
          "Date": "2019-05-21T16:33:54.000Z",
          "Titre": "Read fine print before agreeing",
          "Contenu": "Was not happy with terms of loan....my fault as I did not read the fine print before agreeing to it.  The issue I had with the terms is that it turned out to be a hybrid loan (6 month lease followed by 6 months of financed remaining balance) instead of just a staright 12 month financed loan. The financed portion interest rate was not too bad and it shouldn't have been as my credit rating is 800. The problem is....unless you pay off the full term amount right off the bat they gouge you with the lease payment ...i ended up paying about 400 dollars more than the product I purchased and still paid off the loan 4 months early.  :("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T13:54:43.000Z",
          "Titre": "Overall good company",
          "Contenu": "Overall good company, a little bit shy on giving all the info, payment start time was a month sooner than they were supposed to and the loan info was different than when applied and promised, otherwise great company"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PATRICK",
          "Nb_Reviews": 1,
          "Date": "2019-11-02T03:01:58.000Z",
          "Titre": "Rims look great on my truck",
          "Contenu": "Rims look great on my truck. Had to wait for a check to come in and pay tomorrow  let me get my rims faster. ThanksBe careful with the contract,you may be paying a lot more then you think...read carefully.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2019-10-01T15:33:11.000Z",
          "Titre": "I gave three stars due to the manner of their financing",
          "Contenu": "I gave three stars due to the manner of how they do financing. While manageable, they make it into a lease and then a loan. Could have just done an entire loan but hey. Gotta make that money."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-23T17:40:11.000Z",
          "Titre": "Getting approval for the loan was easy",
          "Contenu": "Getting approval for the loan was easy; however, cancelling the loan due to Great Sport cancelling my order was a different issue. Would like to see this settled."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T16:46:48.000Z",
          "Titre": "There is a set payment to pay and what…",
          "Contenu": "There is a set payment to pay and what is upsetting is that I can not change the payment amount if I want to pay more or less."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer bj",
          "Nb_Reviews": 1,
          "Date": "2019-10-28T20:46:48.000Z",
          "Titre": "The process i had to go through…",
          "Contenu": "The process i had to go through could've been more simple, but the store and creditor pay tomorrow weren't in sink with each other. Other than that it was ok."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dustin",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T04:41:33.493Z",
          "Titre": "IM giving 3 stars just because there's…",
          "Contenu": "IM giving 3 stars just because there's not an option where you can pay more than the amount due  to pay off faster"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2021-10-28T11:54:51.000Z",
          "Titre": "The reason for the mediocre rating is…",
          "Contenu": "The reason for the mediocre rating is due to not being able to sign in to my account. I want to pay it off and can’t see what I owe."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Anonymous computer purchaser",
          "Nb_Reviews": 1,
          "Date": "2019-09-17T19:14:11.000Z",
          "Titre": "INTEREST TOO HIGH! AVOID ALL COST!",
          "Contenu": "The interest is so high that your paying way more then what the product actually cost. Don’t recommend doing, rather pay with credit card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevin Moa",
          "Nb_Reviews": 1,
          "Date": "2019-11-08T21:30:12.000Z",
          "Titre": "Awsome finance company quick and pleasent customer service.",
          "Contenu": "Financing was a breeze in a couple days had the item shipped overall very happy with pay tommarrow would recommend to anyone a+++ thanks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Chris G",
          "Nb_Reviews": 1,
          "Date": "2019-05-14T16:12:58.000Z",
          "Titre": "Good...not great",
          "Contenu": "The experience went pretty well. I appreciate the ability to finance repairs needed on my car at the time. The complaints that I have are...1. Seemed to take a longtime to get someone on the phone. The last couple times were not bad, but the first few times were. So maybe they improved that. 2. I called in August, maybe September last year to see about fully paying off my loan. The lady i spoke with said that it would not save me any money by paying early...and that they report to the credit bureau and by paying monthly, it will help my credit. So I opted not to pay it off early. Then, this month, I got an email when they pulled the monthly payment out  saying that I would save roughly $50 by paying it off early. I was pretty upset that this was the case. I could have paid it off earlier and saved quite a bit more money. Maybe it is a training issue, or a way to get more money out of me, I dont know. But it will make me second guess financing with pay tomorrow if there is a next time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-05-25T01:47:09.000Z",
          "Titre": "Not a bad company but they do not…",
          "Contenu": "Not a bad company but they do not return phone calls so if you need to move your payment you cant"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerJoe P.",
          "Nb_Reviews": 1,
          "Date": "2020-07-18T04:24:01.000Z",
          "Titre": "I made my down payment before they…",
          "Contenu": "I made my down payment before they shipped the scooter, now you guys are charging me again for the down payment, WHY?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff mpls.",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T17:29:53.000Z",
          "Titre": "Great loan time",
          "Contenu": "Great loan time. In minutes. Loan rate very high, but would use them again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-20T15:17:05.000Z",
          "Titre": "Pay tomorrow did good at getting the…",
          "Contenu": "Pay tomorrow did good at getting the funds done. Safer wholesale didn't do what they said."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-14T16:00:41.000Z",
          "Titre": "Pay tomorrow app",
          "Contenu": "An app where i could see my progress and make bigger payments would make a huge difference."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mitchell",
          "Nb_Reviews": 1,
          "Date": "2021-06-07T19:49:53.000Z",
          "Titre": "Great program just don't like the…",
          "Contenu": "Great program just don't like the option to pay on you own without direct pay."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-05-11T19:59:49.000Z",
          "Titre": "Had some issues to begin with as far as…",
          "Contenu": "Had some issues to begin with as far as getting set up an your customer portal sucks"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Diana Brown",
          "Nb_Reviews": 4,
          "Date": "2021-03-12T19:05:05.000Z",
          "Titre": "Easy to work with but high costs to use",
          "Contenu": "Easy to work with and they do keep you informedVery High costs to utilize them"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bob Reichert",
          "Nb_Reviews": 6,
          "Date": "2022-07-21T18:36:31.000Z",
          "Titre": "Very expensive",
          "Contenu": "Thanks for helping me but, it's very expensive."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amer -customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T15:52:21.000Z",
          "Titre": "Applying the application, had some glitches, and it was slow",
          "Contenu": "OkHad a lot of glitches"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 1,
          "Date": "2021-06-11T08:47:32.000Z",
          "Titre": "Average nothing to hoot & holler about",
          "Contenu": "Average nothing to hoot & holler about. Keep up the good work"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T02:54:54.000Z",
          "Titre": "Wouod be better if i could sign in and…",
          "Contenu": "Wouod be better if i could sign in and do a double payment"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Russell",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T15:11:21.000Z",
          "Titre": "Great product bad shipping time",
          "Contenu": "Everything is fine just took awhile to receive tires"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T20:26:32.000Z",
          "Titre": "Payments could be a little lower"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Benson Bare",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T14:24:12.000Z",
          "Titre": "Price couldve been a little lower."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T20:30:50.000Z",
          "Titre": "Not alot feature on your customer…",
          "Contenu": "Not alot feature on your customer portal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer Keith",
          "Nb_Reviews": 8,
          "Date": "2022-05-27T21:27:06.000Z",
          "Titre": "Ahhhhhhhhhhhhhhhhhhhhhhhh"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-10T19:02:45.000Z",
          "Titre": "It ok",
          "Contenu": "It ok it is ok for right now"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James  Cool",
          "Nb_Reviews": 2,
          "Date": "2021-08-25T15:25:02.000Z",
          "Titre": "Easy approval it high interest"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T20:16:01.000Z",
          "Titre": "I thank them for providing me with the…",
          "Contenu": "I thank them for providing me with the convenience, ease of use with using their financing, but I do not like how generic the app is. I can't change my shipping address, billing is different than shipping and when ordering, it has to be what address is on my payment card on file so if that was better, I'd give it 4 stars. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas Fanning",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T02:32:15.000Z",
          "Titre": "It was easy 123",
          "Contenu": "It was easy to process. I was notified by paytomorrow immediately. So far so good. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:56:30.000Z",
          "Titre": "Very easy process and quick."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Scott Garner",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T18:15:10.000Z",
          "Titre": "Interest rates are higher than expected…",
          "Contenu": "Interest rates are higher than expected but ease of credit service is quick and easy and painless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BRETT",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T18:35:52.000Z",
          "Titre": "The overall experience has been good",
          "Contenu": "The overall experience has been good. The contracts sent out are difficult to wrap your head around, but after speaking to a rep, it makes more sense. It would be better to give a full explanation before you send the contracts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WR",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T16:02:20.000Z",
          "Titre": "There is a greater overall cost to this…",
          "Contenu": "There is a greater overall cost to this service HOWEVER they have never turned me down, they have been reliable, consistent and I am now on my second lease/loan with them on the second purchase! For certain situations and if you manage your account this can be solution again albeit with a steep cost in their favor financially."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Needed Tites & Worked at the t",
          "Nb_Reviews": 2,
          "Date": "2023-01-05T23:27:44.000Z",
          "Titre": "Living in Chicago winter is among us…",
          "Contenu": "Living in Chicago winter is among us needed tires for my truck really didn’t have the $$ for a set. Looked online for tires, and with not the best credit could not get financing,, looked into PayTomorrow paid a bit more for them then if I paid cash but funds were low rite after the holidays. Everything went smooth,and had my tires 4 days later."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 5,
          "Date": "2022-11-28T19:02:14.000Z",
          "Titre": "I had a lot of trouble getting the…",
          "Contenu": "I had a lot of trouble getting the security code to put through the request. Vendor told me to call you, your rep told me to call the vendor. Probably just a computer gliche. It all worked out,just took a little extra time. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROD MASTERJOHN",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T04:38:26.000Z",
          "Titre": "It went relatively easy",
          "Contenu": "It went relatively easy, at first it wouldn't work with dept card from a credit union. It was resolved easily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MizeRacing",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T15:29:46.000Z",
          "Titre": "PayTomorrow was just easy to work with…",
          "Contenu": "PayTomorrow was just easy to work with and the person that called me after my purchase was super friendly. Look forward to seeing how the rest of my experience with them will be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leslie",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T04:05:38.000Z",
          "Titre": "The ease of the process was easy and…",
          "Contenu": "The ease of the process was easy and fast and I also like the fact that I had multiple options to choose from. In my opinion I feel that the interest could be a little bit lower other than that it seems to be alright so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joe Cofer",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T15:48:59.000Z",
          "Titre": "Only concern was if I was being sold…",
          "Contenu": "Only concern was if I was being sold used unit at new price . It has few spots where it looked as if it was drug on ground back rail and body looked somewhat worn , stickers starting come off. Guys where great explained Purchase and helped me load out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shadowone Quaife",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T22:14:39.000Z",
          "Titre": "I'm FREE Thanks for Finally getting a mobility scooter to…",
          "Contenu": "Finally getting a mobility scooter to work with approved amount. Thanks for making an old Vet mobile. only wish it could have been a little higher amount, to get what I really wanted. It would have made me year round mobile LoLMaybe after I pay this off"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T19:46:51.000Z",
          "Titre": "Relatively easy to navigate selections",
          "Contenu": "Relatively easy to navigate selections. I would prefer all loans to be reported for credit scores. Quick turnaround on shipping."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rod wiltz",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T16:50:53.000Z",
          "Titre": "Fast and efficient service",
          "Contenu": "Fast and efficient services. My loan was approved in minutes and was able to order the product in a timely manner"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T17:25:30.000Z",
          "Titre": "It didn’t take long to work on my…",
          "Contenu": "It didn’t take long to work on my request, the service was very quick and accurate. So far I have no complaints about the company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Bowen",
          "Nb_Reviews": 3,
          "Date": "2023-09-30T01:53:31.000Z",
          "Titre": "Great company",
          "Contenu": "Great company If any issue arises with the merchant these folks will go to bat for you to get it resolved . I'm very pleased with the service. They have gone above and beyond for me !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T15:13:33.000Z",
          "Titre": "Service",
          "Contenu": "Helpful and understanding staff, and willing to work with you, the young lady that help me deserve five stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAMON FONTENOT",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T21:13:18.000Z",
          "Titre": "Smooth sailing",
          "Contenu": "I was very excited and eager to repay my loan the process was easy and quick however, I was unable schedule payments without assistance but that's Cool whatever."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tonya Parker",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T23:27:33.000Z",
          "Titre": "Every this went great ppl was nice…",
          "Contenu": "Every this went great ppl was nice process wasn’t to long but I haven’t received my atv more heard any more about it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T15:31:20.000Z",
          "Titre": "Fast and honest!",
          "Contenu": "Service went well and in a timely manner. I have no receipt or pay schedule for my payments.  Also need a breakdown of everything I paid for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "FELIXcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:47:09.000Z",
          "Titre": "Good service.",
          "Contenu": "Help with finance when you needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T16:20:17.000Z",
          "Titre": "I wish the paperwork you sent was…",
          "Contenu": "I wish the paperwork you sent was regular size instead of me making it better. I don’t even no when my payments are do. Rather then that it’s been good. That’s why it’s a 4 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tx Sue",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T17:31:24.000Z",
          "Titre": "2nd day in-So far so good",
          "Contenu": "Since it’s only been 2 days I don’t think I can give much of a review. Why not ask for one after we’ve had a chance to use your services?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T16:47:27.000Z",
          "Titre": "Simple, fast and easy.",
          "Contenu": "Simple,fast and had an answer within minutes. Options for cash out the door or payments was a plus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert lowden",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T23:31:56.000Z",
          "Titre": "Fast and easy financing need more rims…",
          "Contenu": "Fast and easy financing need more rims to choose from only had 4 types to choose from but choosed the best thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:16:52.000Z",
          "Titre": "So far really good excellent service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-15T09:33:08.000Z",
          "Titre": "i need to knwo how much i have paid off…",
          "Contenu": "i need to knwo how much i have paid off and how much i have left to pay off on thw app and website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug B",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T18:37:08.000Z",
          "Titre": "Easy financing",
          "Contenu": "Easy financing, process was super easy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARK BARRETT",
          "Nb_Reviews": 4,
          "Date": "2023-11-11T19:18:14.000Z",
          "Titre": "Snafu with my address but ended up ok…",
          "Contenu": "Snafu with my address but ended up ok in the end."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T21:58:19.000Z",
          "Titre": "nice experience",
          "Contenu": "I had a nice experience good customer service and very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T14:33:22.000Z",
          "Titre": "We think the timely matter to deposit…",
          "Contenu": "We think the timely matter to deposit and commucation is good over the phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "🤫",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T16:28:04.000Z",
          "Titre": "Very easy to deal with and the customer…",
          "Contenu": "Very easy to deal with and the customer service was excellent & very helpful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vincent Foceri",
          "Nb_Reviews": 3,
          "Date": "2022-11-17T16:38:45.000Z",
          "Titre": "Easy ,Affordable and no credit damage",
          "Contenu": "Easy , no damage to credit score,very affordable rate and a 99 payoff option for a small loan free of 8.0% ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T07:53:27.000Z",
          "Titre": "Made the ability to purchase equipment…",
          "Contenu": "Made the ability to purchase equipment much easier"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lacosha Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T03:17:53.000Z",
          "Titre": "Fast approval and quick service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wade Butler",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T18:28:39.000Z",
          "Titre": "Very professional"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edmond Heard",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T16:58:31.000Z",
          "Titre": "Great Experience",
          "Contenu": "I don’t have much to say but I’m totally Happy with my agreement!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tx Sue",
          "Nb_Reviews": 3,
          "Date": "2023-07-05T15:42:56.000Z",
          "Titre": "So far so good-hard to review after…",
          "Contenu": "So far so good-hard to review after only 2 days…."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Buggs",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T18:39:27.000Z",
          "Titre": "I like payTomorrow",
          "Contenu": "It was fast approaching"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T22:07:36.000Z",
          "Titre": "It was quick and easy but too much…",
          "Contenu": "It was quick and easy but too much relying on text messages and emails I would have liked the voice confirmation talking to a person is nice sometimes"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Robertson",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T18:33:29.000Z",
          "Titre": "Super simple",
          "Contenu": "Super simple, easy to get approval. Good correspondence."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruth warren",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T10:18:40.000Z",
          "Titre": "I had several  issues getting approved …",
          "Contenu": "I had several  issues getting approved  it ke]t telling me that ID did not match even gave an error  code of )d-0014 I had to call back 3 time before I got someone who didn't talk to me like I was to much trouble to deal with. Now keep in mind I never once was loud,hateful,or disrespectful  to any of them finally got a woman named Tonya ext 111 super nice got the problem fixed told me what I needed to do . Need more people like her who knows what customer service is. Thank you tonya"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Calvin b",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T17:11:46.000Z",
          "Titre": "I am happy with PayTomorrow help with…",
          "Contenu": "I am happy with PayTomorrow help with making my recent purchase. But, I think it was a little misleading due to the way the first contract was written. I assumed the loan amount was the number and I would pay the remaining balance. But, it was the lease and not the full contract amount. I got clarity once I was contacted by the representative and she was very helpful in explaining and breaking down the contract."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 2,
          "Date": "2022-07-28T05:22:56.000Z",
          "Titre": "No way to pay it faster",
          "Contenu": "It is a nice option to only have a soft credit check that won't affect your credit history. The downside is that I can't find the option to pay it down faster. There's no login or ways to manage it after you sign the agreement.  So far it seems pretty legitimate and for that I am grateful."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T14:47:58.000Z",
          "Titre": "Easy process"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenishia",
          "Nb_Reviews": 2,
          "Date": "2022-11-04T23:08:00.000Z",
          "Titre": "I had a good experience with purchasing…",
          "Contenu": "I had a good experience with purchasing my tires and choosing a payment plan that would work for"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jimmy Y",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T19:34:04.000Z",
          "Titre": "Fast and easy",
          "Contenu": "Fast and easy, wish my rate was a little lower.Thank yo"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Bynum",
          "Nb_Reviews": 2,
          "Date": "2022-08-11T17:15:27.000Z",
          "Titre": "A great experience",
          "Contenu": "A great experience. Applied and was approved in minutes. And every time I spoke to customer service, they were courteous, professional, and knowledgeable about each question I had. I am very thankful for their help financing my transmission to go in my truck."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROBERT",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T16:28:30.000Z",
          "Titre": "good experience",
          "Contenu": "What fast and easy experience rates a little high if you need to go longer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BRIAN",
          "Nb_Reviews": 5,
          "Date": "2022-07-22T18:18:24.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, only thing that’s kind of fraudulent or shady is that I tried to pay more than the minimum and it doesn’t allow you to!! That’s kind of sketchy and could be reported as several things to the FTC"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tara Sterling",
          "Nb_Reviews": 4,
          "Date": "2021-11-17T12:53:03.000Z",
          "Titre": "Great",
          "Contenu": "Great. Was able to help my sister get a scooter to get to work.  They made it super easy to get financing.   Just don't forget to let them know u get your item so they can start payments.  I didn't know this til afterwards. Was worried I did something wrong when 1st payment didn't come out when I thoit was supposed to.  Other then that thank u for aotupay"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:00:28.000Z",
          "Titre": "What is very helpful process for very quick so far so good thank you guys",
          "Contenu": "My experience was really good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin C.",
          "Nb_Reviews": 1,
          "Date": "2020-12-28T17:45:27.000Z",
          "Titre": "So far, I'm a Fan!!",
          "Contenu": "So far, So good!!Pay Tomorrow was easy to set up and to process, and the ability to pay-off early at lower interest rates is a definite plus. It's early in the process, but so far I am definitely a fan!! I needed to replace an order which complicated the process a bit, so it might be good to offer flexibility with order adjustments, but that was more a problem with me and the vendor. Thanks, Pay Tomorrow!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 1,
          "Date": "2020-12-01T02:27:23.000Z",
          "Titre": "I like the vehicles I got",
          "Contenu": "I like the vehicles I got. But still don’t know what really happened. The sales person went so fast and did the paper work so fast that I put up $2500  and still don’t know why. We I did get in a word he said everything was done and could not be changed or redone. So all that cash and I still somehow owe over $5000.00 . So I do feel that I got took or at least paid more than should have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "kdc",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T16:58:33.000Z",
          "Titre": "Clear offer and easy approval",
          "Contenu": "Clear offer, application instructions and approval process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adele Gadlin",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T18:46:12.000Z",
          "Titre": "Great option in a stressful time",
          "Contenu": "This was a very easy proces.. I did not have a full understanding of the terms but I was able to call and the agent simplified things for me.  So, glad I did this."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Curt White",
          "Nb_Reviews": 2,
          "Date": "2023-07-24T15:49:12.000Z",
          "Titre": "Fast response!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rickey Franklin",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T17:32:32.000Z",
          "Titre": "Fast service and helping customers…",
          "Contenu": "Fast service and helping customers process their orders"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Goose",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T09:27:24.000Z",
          "Titre": "I had to cancel an item which was done…",
          "Contenu": "I had to cancel an item which was done quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JBags",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T13:31:00.000Z",
          "Titre": "Not a bad deal",
          "Contenu": "Its not a bad deal. Im not.one that can save money for or budget for.somethimg i.want but i will pay the.bill every week.of.i have oneso i would never have.been able to buy.rims and tires if.it.wasnt for pay 2moro.. They finance you and allow.you.to.pay weekly which works.out.great for me..I would definitely.give them a try"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nivonis",
          "Nb_Reviews": 1,
          "Date": "2020-08-20T21:47:06.000Z",
          "Titre": "A little underhanded on the intrest. But...not unreasonable",
          "Contenu": "The interest on this purchase was not made clear immediately.Its not unreasonable, but it definitely wasnt stated outright. Or to what i believe would have been honest buisness. But i can lower the cost if i pay ahead of schedule.No one else would have okayed my credit for a purchase like this.So 4 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Starr",
          "Nb_Reviews": 2,
          "Date": "2020-11-06T20:31:46.000Z",
          "Titre": "Pay Tomorrow ...Simple ,fast, and easy....",
          "Contenu": "I went on a site where  I needed some help paying for my item. I looked on the site And  found Pay Tomorrow as an option.  I checked up on it and found it interesting and decided to try it . It was really Easy and simple to  understand It didn’t take very long before I got an answer back that I was approved. I chose which plan I wanted and Pay Tomorrow  got to it right away and paid for my item. Now I pay per week Automatically and easily. I do like the system that they use.  Thank you Pay Tomorrow for helping me access what I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T12:14:18.000Z",
          "Titre": "It's been a very good just need a few more options",
          "Contenu": "It's been a very good experience. The only change I would like to see is having your total balance and amount left to pay available for viewing on the app and the option to be able to pay a higher amount from the app instead of just the minimum due. Other than that it's been great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brooke Holmes",
          "Nb_Reviews": 3,
          "Date": "2020-10-28T17:32:47.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good! Haven’t had any issues. I’ve only dealt with pleasant people when needing to get in touch with customer service. I think their monthly payments are decent but the leasing/loan fees are astronomical. That’s the price you pay for having a low credit score, I guess."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T17:40:18.000Z",
          "Titre": "Easy access",
          "Contenu": "Don’t know what can be done great service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T16:16:16.000Z",
          "Titre": "Worked out cause I didn't have the…",
          "Contenu": "Worked out cause I didn't have the money on hand to pay for tires out right but I will wind up paying a fair amount more then if I had paid for them up front. No bad review just wish I had been able to save that few hundred dollars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-09-27T15:14:17.000Z",
          "Titre": "At first I was just a little confused…",
          "Contenu": "At first I was just a little confused but after talking to them I got things figured out thinks again"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:09:29.000Z",
          "Titre": "Service has been quick and easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Morgenstern",
          "Nb_Reviews": 9,
          "Date": "2019-05-30T17:17:58.000Z",
          "Titre": "Pay Tomorrow is a great company to do business with",
          "Contenu": "Pay Tomorrow always sends an email statement and reminder that our payment is due.  Things are done in a timely fashion and there have been no problems with our account. This is a very reputable company.  I would recommend them to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 3,
          "Date": "2019-05-21T20:36:25.000Z",
          "Titre": "I leased a scooter for 2years the…",
          "Contenu": "I leased a scooter for 2years the company every month would send email reminding me payment was coming out and what payoff amount would be. Payed in full a couple months early and the payments stopped being withdrawn from my account."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2019-05-14T15:36:23.000Z",
          "Titre": "The process was fairly easy and it was…",
          "Contenu": "The process was fairly easy and it was nice to just have the payments automatically withdrawn each month. My only complaint is that I found I needed a four wheel mobility scooter for the curbs and whatnot in my neighborhood, but I was unable to finance a second scooter. My plan was to finance a new one, sell the old one, and pay off the old one. I wasn’t able to do that though, even though I have an excellent credit record. So I ended up with the hassle of a second payment through another company. It would have been nice to just have a higher credit limit rather than only being able to finance one item at a time. Other than that though, it’s been a very good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T02:42:02.000Z",
          "Titre": "Tires",
          "Contenu": "I ordered 2 sets of tires from Tire Agent and I have not been disappointed. They arrived in a timely manner and the tires were quality tires."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RAUL  SOUSA",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T14:00:05.000Z",
          "Titre": "Very good and easy transition"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeremy",
          "Nb_Reviews": 2,
          "Date": "2021-06-08T23:03:35.000Z",
          "Titre": "Refreshingly easy",
          "Contenu": "Approval was quick with multiple options, payments were manageable and delivery of my purchase was quick. I ordered new tires on a Monday and they were at my doorstep Wednesday."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T22:00:57.000Z",
          "Titre": "Overall the process was fast and simple…",
          "Contenu": "Overall the process was fast and simple .  My only caveat was when I had to pay another  $59.00 processing fee when the vender recommended that I change my initial wheel/tire selection ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "roger gaskin",
          "Nb_Reviews": 6,
          "Date": "2022-08-06T06:09:52.000Z",
          "Titre": "Easy to apply and work with",
          "Contenu": "Easy to apply and work with. I was able to purchase what I needed without the financial strain of paying in full."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T15:36:59.000Z",
          "Titre": "Just the service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter Mazuchowski",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T04:00:21.000Z",
          "Titre": "Review",
          "Contenu": "Called back, very concise"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T16:43:38.000Z",
          "Titre": "Easy",
          "Contenu": "Fast and easy experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Bengston",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T03:36:11.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, fast application and answer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald gross",
          "Nb_Reviews": 2,
          "Date": "2021-06-29T14:40:11.000Z",
          "Titre": "I purchased new wheels & tires hit…",
          "Contenu": "I purchased new wheels & tires hit pothole n busted both passenger wheels and u were there 2 loan me the finances needed 2 get my car on rd again thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ewreck00",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T19:08:29.000Z",
          "Titre": "Very easy to apply for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tim Green",
          "Nb_Reviews": 2,
          "Date": "2022-07-16T01:43:52.000Z",
          "Titre": "Thanks for financing the Hawk",
          "Contenu": "Thanks for financing the Hawk. Could not get anyone to answer the phone. Or call me back    But it’s all good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "WILDFIRE",
          "Nb_Reviews": 2,
          "Date": "2020-07-09T17:37:37.000Z",
          "Titre": "I am very happy with my experience",
          "Contenu": "I am very happy with my experience.  However, it would be a lot easier with payment reminders of some sort.  That is the only downfall I see.  Thank you so much!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T19:58:43.000Z",
          "Titre": "Love the pay system and the whole…",
          "Contenu": "Love the pay system and the whole process. I do wish I could pay additional with a different card. However it will only let me pay the fixed amount."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customerzero",
          "Nb_Reviews": 1,
          "Date": "2021-11-29T22:17:04.000Z",
          "Titre": "Awesome!!!",
          "Contenu": "It was very easy to use except my only problem is there isnt autopay. They have my card on file but there is no option to set up an autopay"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shanna Boatwright",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T10:30:48.000Z",
          "Titre": "Awesome and very fast for ordering my…",
          "Contenu": "Awesome and very fast for ordering my tires and wheels"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-05-22T21:20:26.000Z",
          "Titre": "Great experience and no problem with…",
          "Contenu": "Great experience and no problem with having to make sure its paid for since its automatically taken from my account.  Might buy some more stuff threw them."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T16:10:43.000Z",
          "Titre": "Fast service complete online"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-31T15:07:37.000Z",
          "Titre": "No complaints from day one of our…",
          "Contenu": "No complaints from day one of our relationship. Maybe ask again in a couple of months."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T17:40:49.000Z",
          "Titre": "The process was easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roger Drake",
          "Nb_Reviews": 2,
          "Date": "2023-08-07T17:56:26.000Z",
          "Titre": "It was easy and you had the best terms"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rodney",
          "Nb_Reviews": 1,
          "Date": "2021-08-25T18:51:44.000Z",
          "Titre": "Was on back order but still came pretty…",
          "Contenu": "Was on back order but still came pretty fast very nice easy to assemble good price for it like the pay tomorrow plan great job guys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T18:55:49.000Z",
          "Titre": "The process was quick ans easy and the…",
          "Contenu": "The process was quick ans easy and the offer was great considering my current credit situation"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "S Mahone",
          "Nb_Reviews": 6,
          "Date": "2022-08-11T17:39:56.000Z",
          "Titre": "It took a little longer than expected",
          "Contenu": "It took a little longer than expected.  Everything worked out at end.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T02:07:57.000Z",
          "Titre": "Everything was processed quick and very…",
          "Contenu": "Everything was processed quick and very easy"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T12:32:40.000Z",
          "Titre": "So far so good haven't made first…",
          "Contenu": "So far so good haven't made first payment yet just got tires but happy with overall ease of transaction so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna Butler",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T02:26:42.000Z",
          "Titre": "I thought it was,a lot of hoops to jump…",
          "Contenu": "I thought it was,a lot of hoops to jump through to get approved but it all worked out in the end and I love my new scooter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Homer",
          "Nb_Reviews": 5,
          "Date": "2021-02-04T19:44:09.000Z",
          "Titre": "You only thing that needs some redesign…",
          "Contenu": "You only thing that needs some redesign on your website to return a product, is;    The ling you have to put in a photo of the item (s) being returned isn't user friendly. I don't understand why a picture cannot be taken and printed and put in box to speed that process up. Other than this, I think you deserve a 5 Star review. However this is important to me because you are one of only 2 sites I cannot put a photo onto your site. Your service is great. Your representatives are friendly and helpful and the products I purchased were of good quality. Well the tires were and I have them on my car and they work just fine. However the 4 smaller items I am sending back for the reasons you are aware of, can't be sent until I upload a photo of them to the return page link you sent me. I cannot accomplish that. I can put that photo on other sites but not yours. WHY?        Just asking and am working on that currently still!Thank You, for your service and I will reccomend that anyone in need, apply to you for their needs which you cover. Homer WardCc:  on file"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerry Torres",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:38:03.000Z",
          "Titre": "Satisfied",
          "Contenu": "Very helpfull staff ,kept me informed of all that was being done and when my motor was being shipped"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rm",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:31:34.000Z",
          "Titre": "So far no negatives to say",
          "Contenu": "This company has done everything to gain my confidence. From step one which was my approval they have given me the choices that best suit my needs as far as payments/terms. After doing my purchase, within 24hrs they were calling me in case i had any questions,concerns etc and welcoming on board."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan C",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:12:43.000Z",
          "Titre": "Very easy and great terms",
          "Contenu": "Very easy and great terms. They make it easy to the wheels and tires you need without breaking the bank. Customer service is great to work with also.  They are very quick to respond to your needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Page",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:38:05.000Z",
          "Titre": "The service i received was AWESOME",
          "Contenu": "The service i received was great, super easy and super fast. Could not ask for a better staff, they answered all questions and i was really impressed with how fast the process went. Even though it was close to quitting time they still made it happen. I know my grandkids will be super excited when they see their Christmas Gifts. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mo",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:14:57.000Z",
          "Titre": "I've use your services in the past",
          "Contenu": "I've use your services in the past. Your reputation preceded itself. Right on time. I will always continue to utilize services when needed. I hope in future u would allow better manipulation in the website to make more than required payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fabian padila",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T21:46:58.000Z",
          "Titre": "Exellent service i use this before and is a real good company",
          "Contenu": "I use this company before they approve me right the way and i had a real good experience with them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:28:55.000Z",
          "Titre": "I'd like to thank everyone with the…",
          "Contenu": "I'd like to thank everyone with the customer service department for their helping me with my changes to my order and I look forward to working with you in the future have a great day 😀"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:55:29.000Z",
          "Titre": "Quick simple process",
          "Contenu": "Quick simple process, approval in seconds"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T15:50:22.000Z",
          "Titre": "The application process was quick and…",
          "Contenu": "The application process was quick and easy. They actually approved me for quite a bit more than I actually needed. I would definitely recommend them to someone who can't afford to pay cash outright. They set the payments up to be due on my once a month payday which is very helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian S.",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:12:42.000Z",
          "Titre": "Fastest easiest financing I've ever…",
          "Contenu": "Fastest easiest financing I've ever got! It was so easy I didn't believe it until my product showed up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Ashe",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:20:52.000Z",
          "Titre": "Love this company",
          "Contenu": "Love this company! Definitely helps you out when you need it the most and easy and affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerald",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T23:22:51.000Z",
          "Titre": "Great for small big purchases",
          "Contenu": "You all were able to help when I got stuck in the application....On the weekend. You all are amazing at getting financing for small purchases without needing to pull credit!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:19:43.000Z",
          "Titre": "A great company that helps there customers",
          "Contenu": "It’s a great way to get financing when you really need it and they are a good company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie S",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T16:00:45.000Z",
          "Titre": "I knew I wanted to upgrade my tire and…",
          "Contenu": "I knew I wanted to upgrade my tire and wheel setup. I came to you for financing, and you made the process much more smoothly and hassle-free than all the others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T17:10:26.000Z",
          "Titre": "Fast easy great for unexpected…",
          "Contenu": "Fast easy great for unexpected expenses. In our case a motor. Originally didn't think it was going to work because of the amount they said I qualified for but what I didn't realize is the qualification amount changes for each website that you look at so keep looking. Yes the fees in the end are a little high but in an emergency you can't worry about that thanks to the site my son will be back on the road and not lose his job. And to avoid the higher fees that you pay back at the overall loan pay more each month both problem solved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:01:11.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! Willing to help and walk you through the order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vanessa McCadney",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T16:45:38.000Z",
          "Titre": "Affordable items",
          "Contenu": "Great payment plans, great merchandise and great prices. Great services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:35:44.000Z",
          "Titre": "Fast and dependable!",
          "Contenu": "Fast and dependable responses and support to get you the products you need! Winter tires are a must for where I live and PayTomorrow has always come through so I can invest in a product to keep my family safe."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve D Palm Bay Florida",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:40:19.000Z",
          "Titre": "Very fast credit approval",
          "Contenu": "Very fast credit approval. This is my second time using Pay Tomorrow and it won't be my last. The staff is very courteous and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KDH",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T15:59:48.000Z",
          "Titre": "Very easy to use",
          "Contenu": "Very easy to use, searches for lenders which makes it beneficial."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jose",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T07:24:00.000Z",
          "Titre": "Have not had any issues yet",
          "Contenu": "Have not had any issues yet. There is an expected payment like right away have you order your item. Mine was past the middle of the month and they wanted both payments for this month immediately. Which is fine. Just didn’t know that prior to opening the app"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Luna",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:50:51.000Z",
          "Titre": "I am very pleased with the process and…",
          "Contenu": "I am very pleased with the process and plans you have."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T17:17:47.000Z",
          "Titre": "First time buyer",
          "Contenu": "I wasn't sure about buying tires from a website, since I have never done it. But I am happy with the process and the simplicity of the transaction. Thank you !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T03:26:21.000Z",
          "Titre": "The site was very good",
          "Contenu": "The site was very good. Easy to navigate, not a lot of questions, basic info, and a fast response to the approval of the loan I need to get the engine I wanted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelvin Houston",
          "Nb_Reviews": 3,
          "Date": "2023-11-06T15:53:22.000Z",
          "Titre": "This was the easiest and quikiest loan…",
          "Contenu": "This was the easiest and quikiest loan I've ever applied for... I wasn't sure at 1st if I was going to use the money bcuz tires I wanted were out of order and I kept looking until I found another company that uses pay tomorrow"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:31:19.000Z",
          "Titre": "Stress-free, hassle-free Financing",
          "Contenu": "Our experience was stress-free, Tom and every other person spoken to have been patient, kind, and very professional. Any questions, clarification, or concerns were addressed with clarity and all was well and understood. Thanks for this opportunity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph M",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T16:46:01.000Z",
          "Titre": "Tires for My truck",
          "Contenu": "Smooth and easy transaction as well as affordable payments within the budget-this is my third time buying from this company -recommended for anyone looking for quality products and good prices 👍🏻"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicolas Rodriguez",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T16:46:36.000Z",
          "Titre": "The easy help and access to a right now…",
          "Contenu": "The easy help and access to a right now buy and the time frame in how they got my order ready to be sent out, like they almost knew that I needed them quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John F",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T03:53:36.000Z",
          "Titre": "Financing for Blessed Performance Parts",
          "Contenu": "The process was very easy to go through and after all was approved someone called to ask if I had any questions and I appreciated that very much. Great customer service and wish more companies would do this."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Gardner",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:04:06.000Z",
          "Titre": "Fast & painless"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hegel B",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T22:24:23.000Z",
          "Titre": "Great service !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oxford Nordberg",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T18:57:28.000Z",
          "Titre": "Customer Support has been awesome",
          "Contenu": "Customer Support has been awesome.  Very polite and professional.  Takes the time to explain everything to you.  Takes the time to answer all questions.  Highly recommend if u intend to payoff within 100 days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "andrew",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T04:01:21.000Z",
          "Titre": "This was a very easy and smooth…",
          "Contenu": "This was a very easy and smooth process. I was pre-approved and when it came to checking out the approval was instant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Valantene Tyler",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T17:58:56.000Z",
          "Titre": "Shout Out to Mr. Ena",
          "Contenu": "Mr. Ena was very patient kind nice and respectful making sure that everything was taken care of, That's the kind of service needed in society today. Go Mr.Ena for your outstanding patience and helpfulness. Have a blessed day!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T18:30:55.000Z",
          "Titre": "Great Service",
          "Contenu": "The process was simple and fast! Customer service rep reached out to me to know if everything went well. Greatly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kd",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T21:57:35.000Z",
          "Titre": "Application was easy and quick",
          "Contenu": "Application was easy and quick. Was nice service to be able to finance and not pay out of pocket all at once."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andre",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T21:26:55.000Z",
          "Titre": "I was able to receive a fast approval…",
          "Contenu": "I was able to receive a fast approval and a payment plan that was affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dani Englehart",
          "Nb_Reviews": 5,
          "Date": "2023-11-25T18:54:21.000Z",
          "Titre": "They were delivered fast and I was able…",
          "Contenu": "They were delivered fast and I was able to get a better quality tire than I would have.   I would highly recommend these guys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Moore",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T02:02:27.000Z",
          "Titre": "The ease of placing your order and also…",
          "Contenu": "The ease of placing your order and also one of the workers called to give you a welcome call I thought that that was very nice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T16:54:38.000Z",
          "Titre": "It was a very easy process and…",
          "Contenu": "It was a very easy process and everything went very smooth for my purchase"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mk",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T16:08:14.000Z",
          "Titre": "Easy and convenient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:04:59.000Z",
          "Titre": "Very easy to apply.",
          "Contenu": "Very easy to navigate and apply for the loan. Questions were straight and to the point."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:40:31.000Z",
          "Titre": "Super easy and convenient options"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Solomon Olofinsua",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:08:50.000Z",
          "Titre": "Glad to let you know that you performed…",
          "Contenu": "Glad to let you know that you performed excellently and I appreciate all"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mait",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T15:36:47.000Z",
          "Titre": "Quick and Painless Experience",
          "Contenu": "They were easy to work with and approved me even despite my lest than stellar credit."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T01:16:06.000Z",
          "Titre": "Had no problem getting a loan with a…",
          "Contenu": "Had no problem getting a loan with a great apr. I ordered tires from tire agent it was quick getting the tires unfortunately they were the wrong size. I plan on ordering again hoping to get the right size."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:15:45.000Z",
          "Titre": "Happy with the process and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:43:31.000Z",
          "Titre": "It's my first time getting approved and…",
          "Contenu": "It's my first time getting approved and they where very helpful and everything was explained would do business again in the future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:15:47.000Z",
          "Titre": "So far everything has been great only…",
          "Contenu": "So far everything has been great only been a couple days since took out the loan. customer service has been great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CASSANDRA CHAMBERS",
          "Nb_Reviews": 9,
          "Date": "2023-10-29T00:30:48.000Z",
          "Titre": "My very first online jewelry purchase",
          "Contenu": "My very first online jewelry purchase. Lana made the experience very pleasant and I had no questions or concerns. A perfect purchase.❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T17:35:30.000Z",
          "Titre": "The ease of choosing items and the…",
          "Contenu": "The ease of choosing items and the rapid approval time is unparalleled."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elliott",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:18:33.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Pay tomorrow is quick and easy. Took less than 20 minutes to get approved and get set up. Will definitely recommend to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VALERIE SABIN",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T15:41:40.000Z",
          "Titre": "Easy finance",
          "Contenu": "Easy finance and results were immediate. The contract was easy to understand"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darren Smithcustomer",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:50:30.000Z",
          "Titre": "Pay Tomorrow was very helpful in helping me to purchase a motor for my car that I need for winter.…",
          "Contenu": "Pay Tomorrow was very helpful in assisting me and making it possible for me to purchase my motor. Thank you for all of your help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:41:40.000Z",
          "Titre": "Everything was made simple and easy…",
          "Contenu": "Everything was made simple and easy from start to finish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T15:48:25.000Z",
          "Titre": "What an excellent resource to get new…",
          "Contenu": "What an excellent resource to get new tires for my car without having to have all that money up front. You're a life saver!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T17:12:45.000Z",
          "Titre": "Transparent and easy to apply."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerMichael",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:57:19.000Z",
          "Titre": "The friedly folow up call after…",
          "Contenu": "The friedly folow up call after approval and the ease of which to complete the process was great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T17:39:57.000Z",
          "Titre": "Glad I Shopped here",
          "Contenu": "Very easy find what you want,very easy financing,and really fast delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michaela",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:08:25.000Z",
          "Titre": "PayTomorrow is great",
          "Contenu": "PayTomorrow is great, very efficient and easy to get approved for funding."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Luckett",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T14:46:58.000Z",
          "Titre": "Excellent finance company",
          "Contenu": "Approval was fast and easy and the application process was smooth and simple.  And the payment options are the icing on the cake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J d vance",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:28:25.000Z",
          "Titre": "11/28",
          "Contenu": "Good company to work with especially Wanda"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PAUL",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T17:32:47.000Z",
          "Titre": "Pretty easy set up",
          "Contenu": "Pretty easy set up, fast approval, a little pricey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T05:17:38.000Z",
          "Titre": "The simplest",
          "Contenu": "The simplicity of every aspect from start to finish was amazing. I look forward to future purchases with you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Silva",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T20:19:51.000Z",
          "Titre": "Thank you so much for your support…",
          "Contenu": "Thank you so much for your support during this purchase, glad you got my back during a time of need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake Fred",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:49:37.000Z",
          "Titre": "EASY",
          "Contenu": "Authorization was easy and fast. It is nice to be able to finance without the headache..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerBrett Stayer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T21:32:56.000Z",
          "Titre": "1,2,3",
          "Contenu": "Answered a few questions ,received approval immediately,and ordered my wheels."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Moreno",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T16:54:10.000Z",
          "Titre": "That I will receive my merchandise…",
          "Contenu": "That I will receive my merchandise quickly and I am grateful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T01:13:50.000Z",
          "Titre": "customer service",
          "Contenu": "The customer service and yea I think the company is great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:30:09.000Z",
          "Titre": "The process was very easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T15:41:01.000Z",
          "Titre": "Simple easy and affordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Marshall",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T21:35:07.000Z",
          "Titre": "It was a very good experience for 1st…",
          "Contenu": "It was a very good experience for 1st timers. I was skeptical but I'm glad I did it. Thanks so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:43:04.000Z",
          "Titre": "Great company if you are on a budget to…",
          "Contenu": "Great company if you are on a budget to buy things u need"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Derek Watson",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T15:46:35.000Z",
          "Titre": "Worked with my bad credit",
          "Contenu": "Worked with my bad credit. Gave several payment options."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:14:48.000Z",
          "Titre": "Easy process and quick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richleue",
          "Nb_Reviews": 9,
          "Date": "2023-10-12T21:01:10.000Z",
          "Titre": "Oh my God!",
          "Contenu": "Oh my God!With everything going on with my credit, I wasn't sure that I was going to be qualified for a loan. But I just tried and everything worked out well and easy. I was qualified on the same day. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Oliver Moore",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T19:15:04.000Z",
          "Titre": "Excellent professionalism",
          "Contenu": "Excellent professionalism, very knowledgeable of my needs and desires.  Extremely helpful and at a very good price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T16:19:18.000Z",
          "Titre": "Great response time and Curtis",
          "Contenu": "Great. Easy financing. Keep in touch with you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BOBBY REED",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T15:58:47.000Z",
          "Titre": "I'M VERY HAPPY WITH MY EXPERIENCE WITH…",
          "Contenu": "I'M VERY HAPPY WITH MY EXPERIENCE WITH THIS COMPANY THANKS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Michael lament",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T15:03:37.000Z",
          "Titre": "Jonathan was very helpful and patient…",
          "Contenu": "Jonathan was very helpful and patient as well as everybody else thank you so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ALESIA ROBINSON",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T03:39:12.000Z",
          "Titre": "The process was quick",
          "Contenu": "The process was quick, simple and easy.  Will use you company services. Again Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Spires",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T16:42:02.000Z",
          "Titre": "They were fast on getting me approved…",
          "Contenu": "They were fast on getting me approved for a loan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T22:42:07.000Z",
          "Titre": "I was able to select the time frame I…",
          "Contenu": "I was able to select the time frame I wanted. It also show me the how much I would pay total."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T17:11:03.000Z",
          "Titre": "Easy!",
          "Contenu": "Always made my life easy with financing tires back in 2020!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rafael macias",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T19:15:30.000Z",
          "Titre": "It was a amazing 🤩"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Mize",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T18:30:03.000Z",
          "Titre": "Owner",
          "Contenu": "Great experience with customer service and hope to continue my business with you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T09:19:39.000Z",
          "Titre": "I liked the payment terms that yall…",
          "Contenu": "I liked the payment terms that yall offered. That's what made my experience great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:57:44.000Z",
          "Titre": "Easiest Experience so far.",
          "Contenu": "Easiest Experience so far. Communication seems to be consistent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nigel Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T22:00:25.000Z",
          "Titre": "Very easy to deal with",
          "Contenu": "Very easy to deal with, and ultra fast delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike tate",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T16:49:32.000Z",
          "Titre": "Just awesome!!!!!!",
          "Contenu": "The ease of use getting what I needed….such good information on the product I wanted"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:32:54.000Z",
          "Titre": "Loan approved in 5 min no problems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben carter",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:01:11.000Z",
          "Titre": "Very easy and affordable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Cuthbertson",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T20:04:35.000Z",
          "Titre": "The easiest way to apply"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T19:09:00.000Z",
          "Titre": "Easy process straight forward highly…",
          "Contenu": "Easy process straight forward highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 4,
          "Date": "2023-10-12T17:07:29.000Z",
          "Titre": "Very thorough and quick follow up",
          "Contenu": "Very thorough and quick follow up.  Good experience with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rafael Mixon",
          "Nb_Reviews": 5,
          "Date": "2023-10-10T18:29:56.000Z",
          "Titre": "Smooth transaction",
          "Contenu": "Everything was easy; the payments and interest rates were reasonable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T16:34:54.000Z",
          "Titre": "Fast and quick response",
          "Contenu": "Fast and quick response. Love the feed back that was given. Highly recommend to my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Mosher",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T16:21:12.000Z",
          "Titre": "Answered my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chief",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T14:48:01.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, fast response,fast delivery...hope to get more tires for 2 more vehicles"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J. Walker",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T15:43:41.000Z",
          "Titre": "Customer service was great in helping…",
          "Contenu": "Customer service was great in helping to locate order and insure website transaction was handled correctly."
        }
      ]
    }
  ]
}