{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "pcmasters-shop.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rick",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:38:17.000Z",
          "Titre": "Invalid License Key",
          "Contenu": "Ordered Windows 10 Pro and received an invalid License Key. Tried calling but gave up waiting on hold. Tried emailing and making a request via website with no response. This is bad customer service even by today's standard!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Unhappy N Wisconsin",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T00:33:12.000Z",
          "Titre": "Pcmasters Shop appears to be selling…",
          "Contenu": "Pcmasters Shop appears to be selling computer software that will not load on your PC, without jumping through many hoops.  It is fine if you a are computer wiz, but a real pain in the butt if you are not.  BUYER BEWARE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Howard Goldberg",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T03:38:56.000Z",
          "Titre": "I ordered Windows 10 Professional and…",
          "Contenu": "I ordered Windows 10 Professional and was provided a key.  After installation, the key would not authenticate.  Microsoft reported the key was already in use.  I tried contacting customer support by email.  The email was returned as undeliverable.  Tried calling the customer support line.  There is no identifying greeting, only goes on hold with music."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gail Rider",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T00:35:33.000Z",
          "Titre": "I never did get the program i purchased/"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LISA BRUNEAU",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T10:22:45.000Z",
          "Titre": "I wrote to you a half hour after I…",
          "Contenu": "I wrote to you a half hour after I mistakenly ordered the windows 10 update and asked you to cancel the order. I am unable to upgrade to 10 because my computer is too old. Someone responded and said they would get back to me, but never did, instead, you charged me and sent it anyway. I am displeased with your tactics and will be sending it back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Williams",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T22:38:06.000Z",
          "Titre": "Where is my damned software???",
          "Contenu": "Where is my damned software????  I was supposed to get a key to open it immediately. I did not.I am still waiting for the software to be delivered electronically. It has not appeared. They are supposedly waiting for payment to clear...it was paid by credit card which cleared immediately."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steven Kossoris",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T07:57:41.000Z",
          "Titre": "PC Master Shop experience on 7/1/2023",
          "Contenu": "I want to revise my review of PC Masters who are selling Microsoft Office Suite 2021 software and the activation codes. The 2cd set of activation codes also did not work. The trick is to get one of their tech people on the phone (not thru a chat box) and work with them until the issue is solved and the Office product is working. I am a satisfied customer now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pam Swanson",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T02:31:46.000Z",
          "Titre": "I purchased MS Office and was given a useless product and they have not returned my funds",
          "Contenu": "I purchased MS Office and was given a activation code and product key.  I was unable to activate the software - when I called Microsoft for help, they told me that the codes had been exhausted and I should request a fresh one or demand a refund.  I have asked for the refund 3 times and have not been given one.  I will be launching a fraud investigation to get my money back.  DO NOT BUY from this company. They do not stand behind their products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Lindenberg",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T03:18:59.000Z",
          "Titre": "Windows failed to activate even after…",
          "Contenu": "Windows failed to activate even after second code was issued to me...#3734 order..From Microsoft,  \" you don't have a valid digital license or Product Key \"I downloaded Win 10 pro right from Microsoft's web site..Any other suggestions ?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rolf Henretty",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T16:59:31.000Z",
          "Titre": "cannot down load",
          "Contenu": "cannot down load, not user friendly."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "JEAN FISICO",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T01:51:44.000Z",
          "Titre": "Failure to find a solution. Technicians were outstanding in their effort to find a solution …",
          "Contenu": "The technicians did an astounding job of trying to get the OS windows 10 installed on my computer. I give them a ten. Unfortunately they could not get it installed they worked about 6 hrs. But the fact that they could not find a solution is why it is a 1 star for failure to solve the problem The website indicates that if a solution cannot be found then a refund will be given. I expect a full refund but another customer indicated they take 20% off and she is still waiting for the refund. Is this false advertising?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Penn",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T19:01:06.000Z",
          "Titre": "RE: Order 1573 Shipment Late /Delayed",
          "Contenu": "RE: Order 1573I have been waiting for 10-days to get the Windows 10 PRO that I ordered on 2022-12-01.  To date I have not received any notification of the DVD having been shipped!My shipping address is as follows:6210 Belcrest Road Apartment 1330Hyattsville, MD 20782-2969."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Charity Bigelow-Edm",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T02:28:11.000Z",
          "Titre": "After purchase I worked with an agent…",
          "Contenu": "After purchase I worked with an agent to get it to work but unfortunately my computer was too far gone and I had to get rid of my entire computer. So naturally I asked for a refund. After several emails into them and a phone call I finally was told they would give me 80 percent back and the other 20 would be to cover their online costs?? I never used the product and it’s not up to me to make their business continue. Also nowhere on their refund policy does it say “ oh by the way we will always need 20 percent to do business” lol. Still haven’t seen a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Random Money Loser",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T07:09:12.000Z",
          "Titre": "Windows key invalid",
          "Contenu": "I was sold a windows product key that was invalid. I asked for a refund and now I'm in the loop. I'll accept that I'm just out $30. Now i'm hoping my card information isn't going to be used by this company, or any affiliates, in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PAUL JONES",
          "Nb_Reviews": 1,
          "Date": "2022-09-04T16:10:10.000Z",
          "Titre": "I attempted to download windows 10 via…",
          "Contenu": "I attempted to download windows 10 via the link provided; FAILED. I received a key code that is not valid. Unable to update to windows 10. Contacted tech support only to receive numerous instruction that made zero sense. HORRIBLE EXPERIENCE!!!! I attempted the additional steps provided along with the 7 additional key codes; same outcome."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer SteveA",
          "Nb_Reviews": 4,
          "Date": "2023-06-19T22:45:13.000Z",
          "Titre": "Key never worked.",
          "Contenu": "Hopefully I can get a refund. You get what you pay for. The first few responses were very quick and I was impressed but those responses never led to working software. As the problems added up the responses were fewer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 5,
          "Date": "2022-09-13T16:08:15.000Z",
          "Titre": "Ordered Windows 11 Pro download…",
          "Contenu": "Ordered Windows 11 Pro download with a product key. Successfully downloaded to a USB flash drive, but when I installed to the new computer, the key was bogus, according to Microsoft."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Weiner",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T02:23:41.000Z",
          "Titre": "All you did was send me free Microsoft…",
          "Contenu": "All you did was send me free Microsoft down loads,I already tried and didn't work. Thought I was getting a clean boot of win 10. That I could install on a clean drive. My computer has never been able to install 8.1. and all I have is 8 with some sort of defects that won't allow important updates. Always reverts back.. so no not pleased about any of this for 10 years now. I am currently running a clean reboot of win 8. Think that doesn't work either, but may not have tried starting with a clean disk. Maybe 8.1 will update then."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Abby Purcell",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T15:06:55.000Z",
          "Titre": "I ordered office and ended up not…",
          "Contenu": "I ordered office and ended up not needing it and asked for a refund. The code has never been activated and its been a month and I'm still waiting on a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fred G. Harper",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T19:30:46.000Z",
          "Titre": "Non refundable",
          "Contenu": "charged for a download of Windows 11 -which failed to load after attempting to install & charged for the software with no way to get a refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Austin",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T00:04:43.000Z",
          "Titre": "Have not receive long to download…",
          "Contenu": "Have not receive long to download software"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "The Journey of the Julie",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T00:14:43.000Z",
          "Titre": "Stole my money; got nothing but the run-around",
          "Contenu": "All I can say is this: They could not figure out how to find me in their system when my product did not arrive. However, they found my bank account easily and charged it. So ... infer what you will, lol."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T19:36:53.000Z",
          "Titre": "Key did not work",
          "Contenu": "Key did not work. After hours on phone with Microsoft key invalidity not resolved and refundability void."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samuel Paquin",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T02:23:19.000Z",
          "Titre": "i purchased a windows 10 key i thought…",
          "Contenu": "i purchased a windows 10 key i thought was oem but it would not authenticate. took my money didnt work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T01:57:55.000Z",
          "Titre": "Windows 10 Pro license did not work",
          "Contenu": "Purchased the Windows 10 Pro valid lifetime license and when I entered data it says the number is being used by another computer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Matthew O'Brien",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T01:49:16.000Z",
          "Titre": "Code didn’t work",
          "Contenu": "Code didn’t work. I requested refund and support team did not respond to my request"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ki llourself",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T06:06:44.000Z",
          "Titre": "I got scammed and your stupid refund…",
          "Contenu": "I got scammed and your stupid refund policy won’t let me get a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Stivers",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T02:12:28.000Z",
          "Titre": "Download dis not work",
          "Contenu": "Download dis not work.  I get an error code like before which is why I purchased the new product key.  That key turned out to be worthless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Geezy Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T10:50:57.000Z",
          "Titre": "You guys sold me a window’s key that…",
          "Contenu": "You guys sold me a window’s key that didn’t work"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randall Williams",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T16:02:21.000Z",
          "Titre": "Key code invalid....got several from…",
          "Contenu": "Key code invalid....got several from chat support none worked"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Myron Asleson",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T20:48:20.000Z",
          "Titre": "Do not purchase this",
          "Contenu": "Do not purchase this. It will take you to a windows website that you can download windows for free."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LONNIE LINN",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T20:04:29.000Z",
          "Titre": "the product key won't work",
          "Contenu": "the product key won't work. tried uninstalling & reinstalling 5 or 6 times"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carol Colburn",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T16:54:29.000Z",
          "Titre": "I have yet to receive the item I…",
          "Contenu": "I have yet to receive the item I purchased."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "George Thada",
          "Nb_Reviews": 1,
          "Date": "2023-01-02T02:46:42.000Z",
          "Titre": "I'm having trouble getting the programs…",
          "Contenu": "I'm having trouble getting the programs to load and need more instructions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Williams",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T15:12:06.000Z",
          "Titre": "I have installed the download of Office…",
          "Contenu": "I have installed the download of Office 2019 several times, the activation key does not work and therefore office will not work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Bassett",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T02:17:58.000Z",
          "Titre": "I got ripped off",
          "Contenu": "I got ripped off. The software cannot activate. Codes expired."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K. M.",
          "Nb_Reviews": 2,
          "Date": "2023-01-02T20:02:21.000Z",
          "Titre": "It was a previously used Windows 10 Key…",
          "Contenu": "It was a previously used Windows 10 Key and it locked out of Windows."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Crow",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T04:16:37.000Z",
          "Titre": "Scam website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roy Aloisio",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T21:33:54.000Z",
          "Titre": "I have not received the download for…",
          "Contenu": "I have not received the download for Windows 10. What gives."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2022-11-01T15:35:20.000Z",
          "Titre": "The product key sent does not work",
          "Contenu": "The product key sent does not work. I have email support and have not received a response."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Me",
          "Nb_Reviews": 2,
          "Date": "2023-03-18T08:20:45.000Z",
          "Titre": "Still waiting for the refund",
          "Contenu": "Still waiting for the refund. Still. They just don’t answer now."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stonelyrics",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T01:52:46.000Z",
          "Titre": "Terrible",
          "Contenu": "Terrible Did NOT WORKSTILL HAVE NOT BEEN REFUNDEDMAD"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laetienne Chambliss",
          "Nb_Reviews": 1,
          "Date": "2023-05-06T01:13:02.000Z",
          "Titre": "The code I bought was already used",
          "Contenu": "The code I bought was already used, and they took forever to refund my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Lanspeary",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T02:52:21.000Z",
          "Titre": "Could not register with Microsoft.",
          "Contenu": "Could not register with Microsoft.Code no good"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Me",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T15:05:56.000Z",
          "Titre": "Still no refund and no response"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sidney Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-08-10T01:24:36.000Z",
          "Titre": "These people are impossible to get in…",
          "Contenu": "These people are impossible to get in touch with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "chase d",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T05:23:14.000Z",
          "Titre": "Never received product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Lloyd",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T16:24:38.000Z",
          "Titre": "The key I was sold didn't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Espinoza",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T05:52:40.000Z",
          "Titre": "You gave me a code that didn’t work!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nighthawk",
          "Nb_Reviews": 2,
          "Date": "2022-11-20T22:26:22.000Z",
          "Titre": "Did not get my product"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beth",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T04:20:31.000Z",
          "Titre": "HE DIDNT TRY TO HELP ME SOLVE MY ISSUES"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Ed Lawniczak",
          "Nb_Reviews": 5,
          "Date": "2023-08-02T18:47:20.000Z",
          "Titre": "You left out \"destructive\"",
          "Contenu": "You left out \"destructive\", didn't you???Start to \"really \"listen\" to what we say and follow up!Being pompous only confirms the true you!When your agenda is left to geeks and nerds, customers are subjected to abstract, conflicting, confusing and infuriating situations!LOSE the DOWNLOADING \" B U T T O N \" !!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Courtney Reed",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T16:31:02.000Z",
          "Titre": "Purchased 2 licenses and one was…",
          "Contenu": "Purchased 2 licenses and one was already activated and unusable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Ortega",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T21:36:13.000Z",
          "Titre": "Activation failures",
          "Contenu": "The order process, flawless (Win10 Pro and Win11Pro licenses). Activation for Win 10 failed, tech sent new key and was successful. Activation for Win 11 failed, tech sent instructions this time to call Microsoft activation (customer should not have to go this route), after 10-15 minutes typing in ID codes, Win 11 now activated too. Gave a lower score just because of the leg work I had to do in order to get the OS's activated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Valued Customer Dave",
          "Nb_Reviews": 2,
          "Date": "2022-09-10T23:05:30.000Z",
          "Titre": "Did not return calls for assistance"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Church",
          "Nb_Reviews": 1,
          "Date": "2023-12-22T00:41:00.000Z",
          "Titre": "The price was great",
          "Contenu": "The price was great! Quick delivery online. The only problem I have ever had with PC Masters is activating the software. The only surefire way is by telephone. On the internet method has almost never worked for me because the license key was already used."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David W.",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:19:49.000Z",
          "Titre": "Good Price, but Authentication Woes",
          "Contenu": "The whole process of ordering was straight forward, not complicated.  But the key did not authenticate on initial try and had to go through phone process to authenticate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TS",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T23:10:11.000Z",
          "Titre": "The downloadThe download name was different than what was purchased...a tad confusing. name was different than…",
          "Contenu": "It's okay...thanks you.The download name was different than what was purchased...a tad confusing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henrick Le",
          "Nb_Reviews": 3,
          "Date": "2023-12-06T11:44:10.000Z",
          "Titre": "can not activate the product  with my computer, but with my cell phone",
          "Contenu": "can not activate the product  with my computer , but with my cell phone"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Simpson",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T16:03:19.000Z",
          "Titre": "I'm reasonably computer literate.",
          "Contenu": "They delivered an official Microsoft licensed product (Office) at an incredible price. I was able to install without any support, however it was cumbersome.  I had to call Microsoft and work through a 54 digit input If you'rereasonably computer literate,  and are willing to invest a half hour, it'sa great deal. I would order from them again.."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Benoit Menard",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T16:30:58.000Z",
          "Titre": "I bought 2 licenses (Windows 10 and…",
          "Contenu": "I bought 2 licenses (Windows 10 and office) and they didn't work the first time! Your chat service had to intervene for me. Your customer service is impeccable and they have still settled my problem quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. Chance DeBoe",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T22:54:41.000Z",
          "Titre": "Hang-in There! They Stand By Their Product.",
          "Contenu": "The Microsoft key didn't work at first, but with a few back-and-forth emails, and their clear instructions, I was able to activate this software. Hang-in There! For me it was well worth the wait and I don't have pay a yearly subscription anymore."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Church",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T21:09:19.000Z",
          "Titre": "Easy to navigate and select the product…",
          "Contenu": "Easy to navigate and select the product Office 2019 Pro. Great price and easy installation. One drawback is they didn't tell me that the software activation would have to be done by the laborious telephone method and not by the faster and easier internet method."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly Tipton",
          "Nb_Reviews": 4,
          "Date": "2022-08-18T16:48:38.000Z",
          "Titre": "Everything went great until activation…",
          "Contenu": "Everything went great until activation when opening any of the applications I typed in theproduct ID a message was displayed that it could not activate because it was already activated and ony one PC was allowed on this license. This was the first install on one PC, contacted Microsoft product support they help me get it activated, It's a pretty long process the software displays a bunch of numbers I had to tell the support tech ect.."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brian Lloyd",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T17:06:55.000Z",
          "Titre": "Changed review from 1 star to 4 stars",
          "Contenu": "I previously gave it 1 star because the first key did not work. Support was good and relatively quick. The second key I was issued worked fine. I would give 5 stars except for the first key not working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry Fey",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T14:26:16.000Z",
          "Titre": "Worked out good",
          "Contenu": "Windows ten at great price , I upgraded from Windows 7 , Had to use online chat on what to do . Chat agent e mailed me instructions and it loaded fine. Took a long time ,But is working fine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LARRY J.",
          "Nb_Reviews": 2,
          "Date": "2022-09-05T21:38:25.000Z",
          "Titre": "After a little problem with the upgrade…",
          "Contenu": "After a little problem with the upgrade and activation all ended well and a very good price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "james byrd",
          "Nb_Reviews": 4,
          "Date": "2022-09-02T09:53:09.000Z",
          "Titre": "Easy purchasing process but had…",
          "Contenu": "Easy purchasing process but had difficulty with install, however tech assist fixed problem quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph Elmer",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T01:13:03.000Z",
          "Titre": "The product is very nice",
          "Contenu": "The product is very nice, it did take some time in shipping or I would give it 5 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Cosbie",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T01:07:33.000Z",
          "Titre": "Great",
          "Contenu": "Just as described.  Great price and fast delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T21:56:29.000Z",
          "Titre": "Reliable people and merchandise"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neil P",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T23:57:11.000Z",
          "Titre": "Legacy Windows 10 Activation Key Saved the Day!",
          "Contenu": "The Windows Activation Key I needed after reformatting my older laptop was minimal cost and immediately available for download, plus it worked perfectly.  Great option and I appreciate PC Masters providing this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany Goss",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:21:15.000Z",
          "Titre": "Fast, Easy and Inexpensive",
          "Contenu": "The shopping experience was fast and easy, and pricing was very competitive! Overall, I’m very satisfied with my purchase and will be back when my needs require it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roshetta Fluellen",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:39:39.000Z",
          "Titre": "Delivery of software and prompt ability…",
          "Contenu": "Delivery of software and prompt ability to download software file. Installation worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KB Kansas",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:40:28.000Z",
          "Titre": "Price was amazing and the download and…",
          "Contenu": "Price was amazing and the download and installation was fast and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert M Jenkins",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T03:29:06.000Z",
          "Titre": "The ordering process was simple & Customer Support was fant",
          "Contenu": "The ordering process was simple.  We ran into problems getting our Windows 7 to update to 10.  Contacted Customer Service and they walked us through the process with links to fix the initial issue and then install Windows  7 It worked!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NoStall",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T19:39:39.000Z",
          "Titre": "W10 Pro activation !",
          "Contenu": "Having downloaded and installed W10Pro directly from MS, could not activate it.  Did several hours of search for reputable company dealing in activation keys. Settled on PC Masters, especially since they linked through Newegg.WOW! Both phone and chat service was quick and proficient and friendly. Purchased a key and it showed up immediately in my email account (the one that another etailer said 'didn't exist, wasn't valid' last night). Entered the code in the activation window and about 15 seconds (!!)later W10Pro was activated: No contact with Microsoft nor PC Masters was needed.   I am not really used to this EXCELLENT level of service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Knisley",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T19:06:44.000Z",
          "Titre": "Outstanding assistance",
          "Contenu": "I was having trouble loading the software because of my lack of skills.  Alexander from your online help done his magic and I now have a fully function software package.  The team and service is outstanding.  Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Renzoni",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T18:36:39.000Z",
          "Titre": "You would not think this is a legitimate site because of the pricing.",
          "Contenu": "I bought MS Office and I did stumble as I was trying to activate it. Later I sent an email and got a quick reply. This morning I called and was given instructions on activating the software. I was preparing myself for the worst because the software was inexpensive. Awesome customer service! I highly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Neal Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:12:20.000Z",
          "Titre": "They did great I bought the wrong key…",
          "Contenu": "They did great I bought the wrong key for the system I have and the help me out. This was the second time I bought form them and will continue to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Byron Wolfe",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T22:36:00.000Z",
          "Titre": "I couldn't be happier",
          "Contenu": "I purchased some software from Pcmasters.It downloaded just fine but i had an issue getting the software authenticated. I got on on the chat sight and the customer service person walked me through the entire procedure.I couldn't be happier..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace Instrument Calendar",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T23:37:13.000Z",
          "Titre": "I loved it",
          "Contenu": "I loved it! Super helpful and patient with me. Got my issue fixed and up and running! I will recommend them to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Software Purchaser",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T21:46:50.000Z",
          "Titre": "Alexander was super patient as we…",
          "Contenu": "Alexander was super patient as we navigated the activation issue.  I was working via remote desktop, so it was slow as heck, but he said to take my time as went back and fourth and finally must have contacted Microsoft and resolved the matter."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T19:43:27.000Z",
          "Titre": "Great Price",
          "Contenu": "Great Price.  I ran into an error verifying the COA for the software.  PC Masters chat was able to assist with the process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean Foote",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T12:53:02.000Z",
          "Titre": "Needed to activate Windows 10 Pro...",
          "Contenu": "I needed a windows 10 pro product key and didn't want to pay almost $100... I read the reviews on here and majority of people said the key they received didn't work BUT customer service fixed it right away... So I took at $20 chance... Got the key instantly, did NOT work lol.... I thought great, I got scammed... called customer support, read the error message.. they called Microsoft for me and within 8 minutes, my computers OS was activated... Thank you Alexander..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hvactech",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T20:56:43.000Z",
          "Titre": "Win 10 Pro Update - Stellar assistance",
          "Contenu": "Renan provided me with steps to upgrade Win 10 Home to Pro. System upgrade was smooth and completed quickly.  Activation became an issue and would not complete.  Once again Renan stuck with me and after going through a few attempts we were successful.  This company is definitely a 5 star place with people who deserve that rating as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JG",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T15:08:00.000Z",
          "Titre": "I ordered a Windows 10 license key that…",
          "Contenu": "I ordered a Windows 10 license key that allowed me to install the software without issue but did not allow activation. I reached out to their tech support and received a prompt reply with a resolution that worked. So any low marks from the initial issue were more than fixed and made up for with the super-fast tech support reply and resolution, plus their low prices. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana Moores",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T19:49:01.000Z",
          "Titre": "Your company very professional and courteous.",
          "Contenu": "My experience with your company was wonderful.  Nice employees. Very professional.  THANK you.."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T20:43:34.000Z",
          "Titre": "Price was really good so it was worth a…",
          "Contenu": "Price was really good so it was worth a shot.  Had difficulty installing and let support know.   Their response was almost immediate.  Called them for further clarification and everything worked in two minutes.  Great serviceChris"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Timothy Wertz",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T05:38:25.000Z",
          "Titre": "I highly recommend PC Masters!",
          "Contenu": "The product I was looking for was available for much cheaper than other online stores. After purchase the customer service was extremely helpful and quick to respond when I encountered an error during my set-up process. Within an hour my issue was diagnosed, solved, and I was on my way. I would highly recommend PC Masters to my friends and family!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Swope",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T04:56:18.000Z",
          "Titre": "Great price and assistance",
          "Contenu": "Once installed and functioning the Office 2019 package I purchased proved to be exactly what I wanted and at a very reasonable price.  The download and installation started out difficult, mostly the fault of Microsoft OneDrive.  I called for assistance and the PC Masters tech worked the problem and stayed with me until she was sure all apps were functioning.  I would definitely purchase from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Atwood",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T23:44:06.000Z",
          "Titre": "everything worked without any issues",
          "Contenu": "everything worked without any issues.  the easiest installation i had in a long time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy Marshall",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T03:21:33.000Z",
          "Titre": "I experienced excellent customer…",
          "Contenu": "I experienced excellent customer service with PCmasters with Queenie tonight and others the day before.  I could not be more pleased.  These people work their magic for those of us who need it!  Thanks so much for hiring exceptional people to assist our customers.  I am amazed.  All were very professional, polite, and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T17:59:10.000Z",
          "Titre": "Great help desk",
          "Contenu": "Had an issue, contacted thier help desk,They responded quickly with a solution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherri",
          "Nb_Reviews": 5,
          "Date": "2023-01-29T23:25:04.000Z",
          "Titre": "Wow - tremendous customer support!",
          "Contenu": "Wow - PCMaster provided top notch quick and thorough customer support when I had trouble installing a Windows Pro upgrade.  I would totally recommend this site for software purchases.  It was such a pleasant surprise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CURTISS",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T16:07:02.000Z",
          "Titre": "Great experience at PC Masters",
          "Contenu": "Found best prices and 24/7 support for Office 2021. Paid a one time price/no subscription and immediately received download. Used tech support for advice during download and the agent was very helpful and thorough for answering questions for me. I will definitely use PC Masters in the future!.  Check they're website!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charley Galassini",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T22:23:33.000Z",
          "Titre": "The customer service person was very patient,…",
          "Contenu": "The customer service person was very patient and walked me the through the whole install process.  I am not tech savvy, so I really appreciated this service being available.  He answered all my questions.  He never made me feel rushed.  I would highly recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Larry James Reyes",
          "Nb_Reviews": 1,
          "Date": "2022-08-03T12:39:32.000Z",
          "Titre": "Alexander was amazing!",
          "Contenu": "If I could give him 10 stars, I would. Whatever reason, Windows was not recognizing my Office install, and he patiently walked me through the steps until we realized it wasn't an Office issue but a Windows issue. He's patient and polite. Recommend the store for amazing product and support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-31T20:15:51.000Z",
          "Titre": "they don't stop until you are up and running",
          "Contenu": "Rep stayed with me through process of downloading software after I came across glitch. He offered assistance and  ensured software downloaded properly and offered reassurance that I would be able to get their help at any time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Loveth_A",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T15:31:53.000Z",
          "Titre": "Cheap price! and 5 Star Customer Service!",
          "Contenu": "I purchased MS Office from PCMasters and received the key instantly. Everything goes well,  efficiently fast got it installed on my Windows 11 I can now use excel!The live chat support well mannered and knowledgeable Excellent Customer Service!me a  Satisfied Customer! TYSM PCMASTER"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John B",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T01:46:57.000Z",
          "Titre": "I was having a lot of trouble…Great Customer Service!!",
          "Contenu": "I was having a lot of trouble activating windows 10, customer service Rep was very helpful and patient with me, stayed with me until I got it done! Thanks again Dan for your patience and kindness!!I give customer service 5 STARS!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Asher K.",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T01:44:22.000Z",
          "Titre": "The Win 10 Pro Activatioon",
          "Contenu": "The Win 10 Pro Activation which I have purchased from PCmasters did not work and I got an error that the key was already used. When I have reached out to Support they have guided me Nd fully supported until the Key worked.Very happy with support, will continue to shop at PCmasters for my need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mavi L",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T07:05:23.000Z",
          "Titre": "What's so interesting is that",
          "Contenu": "What's so interesting is that, the email was received right away and without losing so much time with myself figuring what to do with the MS Office error, I right away called customer service and Dan did answer right away. Within minutes, my license was activated! I do understand the Terms of Service and I'm very satisfied with it.If you want to do to have it all - cheap, genuine & with great customer service choose PCMASTERS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Hall",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T02:54:07.000Z",
          "Titre": "Honest",
          "Contenu": "The 100% honesty and the great customer service who helped me activate Windows 10 via phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfred Zinkernagel",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T15:46:38.000Z",
          "Titre": "Once I got my order",
          "Contenu": "Once I got my order, it would not work. Contacted PCMasters and received numerous ways to make it install. These instructions were simple and offered several ways to get me up and running. Very happy and grateful I chose PCM. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Buddy Gable",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T02:40:34.000Z",
          "Titre": "Very nicely priced products and…",
          "Contenu": "Very nicely priced products and excellent online support!  I highly recommend PC Masters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "horseman55",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T20:57:31.000Z",
          "Titre": "Best tech support ever!!!!!",
          "Contenu": "This is the very best technical help that I have ever received in my life! Prompt response time!! Response time was less than 5 seconds to my first inquiry. The person promptly informed me that they would help me activate my product and walked me through the steps I needed to accomplish my task. Again, this is the best support that I have ever received. I cannot recommend this site higher than I have. It should be used as an example of how to properly support your products!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Porter",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T02:46:03.000Z",
          "Titre": "great customer service.",
          "Contenu": "bought a windows key and it didn't work but it was easily resolved thanks to Angel in chat.  excellent service I will be buying from PC masters again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wesley Delaney",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T20:09:07.000Z",
          "Titre": "Hiccup Handled Smoothly.",
          "Contenu": "My purchase was easy which is saying something. I had attempted to use another site (unnamed intentially) and every step was an issue. Once I got my key-code, it didn't work. (OH NO!)I messaged the chat which was already at the corner with the issue and my order verification number. Glenn responded IMMEDIATELY and in language that I instantly knew I was talking to a person and not a bot. He was kind, walked me through each step, made phone calls for me. In TWELVE minutes he had me up and running. I don't expect busness to go perfectly every time. (I also seem to be the person that things never work as intented on so I have a lot of experience dealing with customer service.)The integrity of a company and the individuals working for a company is really shown when there are problems. Glenn made my \"problem\" a minor hiccup. Because of that, I'll be back for any of my future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "jopy bebawy",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T22:45:41.000Z",
          "Titre": "Although I chose the wrong product that…",
          "Contenu": "Although I chose the wrong product that wasn’t suitable to my computer’s system, the customer service was so helpful.They helped me to choose the right product, made the exchange for me and guide me step by step to install it. They used to reply to all my emails.I highly recommend pcmasters."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VALERIE Dyer",
          "Nb_Reviews": 3,
          "Date": "2022-08-28T14:08:55.000Z",
          "Titre": "Great Service, Excellent Product",
          "Contenu": "After being notified by Microsoft that my Windows 8.1 would no longer be supported, I decided to download Windows 10.  My attempts were unsuccessful, so I then ordered Windows 10 in a disc format.  My disc arrived quickly, and it installed flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T17:11:43.000Z",
          "Titre": "I purchased a Microsoft 10 license",
          "Contenu": "I purchased a Microsoft 10 license, but the activation code didn’t work. I chatted with Lee and he sent me another code. That one also didn’t initially work, but on contacting Microsoft by phone, I was able to activate it with a code Microsoft sent me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "douglas addis",
          "Nb_Reviews": 3,
          "Date": "2023-11-01T17:03:37.000Z",
          "Titre": "Ease in finding the product we needed",
          "Contenu": "Ease in finding the product we needed. Very fast in getting it to us. A little issue on downloading but your tech help was quick to help"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "chris arseneau",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T20:43:46.000Z",
          "Titre": "Digital copy of windows key",
          "Contenu": "Made a purchase for digital copy of windows key was emailed the key right away typed it in working with no problems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David from Texas",
          "Nb_Reviews": 3,
          "Date": "2022-09-01T21:37:43.000Z",
          "Titre": "A little unsettling but worked out well",
          "Contenu": "I purchased MS Home and Student 2021 at a very favorable rate. The activation code did not work. I called tech support, and they were able to activate the account for me with no worries. Individual was very helpful and had me up and running in a few minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Hoffman",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T22:41:53.000Z",
          "Titre": "Software purchase and install",
          "Contenu": "They helped me through the selection process and the process of buying what I needed. I  a bit novice about computers, so yhe Techs walked me through each step and guided me to successfully having my software loaded and operational."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Atkinson",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T22:48:26.000Z",
          "Titre": "Economic alternative works well",
          "Contenu": "It didn't work at first but your tech put me in touch with Microsoft to get some codes and do it by phone also offered to do it for me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge Rodriguez",
          "Nb_Reviews": 3,
          "Date": "2023-09-02T23:09:29.000Z",
          "Titre": "Upgrade to Windows PRO",
          "Contenu": "The upgrade to Windows 10 Pro was smooth as silk. The Key, files, and clear instructions made my experience absolutely amazing! Strongly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rowland Freeman",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T04:51:55.000Z",
          "Titre": "Good price",
          "Contenu": "Good price. Download worked exactly like you said it wouldChat feature was helpful. The program was more than I expectedGood deal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Hober",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T04:28:43.000Z",
          "Titre": "Great purchase choice.",
          "Contenu": "1st was the ease in making the purchase. While I thought I had some issues getting the Product key, your chat AI person took good care of me! Then I had an issue activating, but again, your AI Chat came to the rescue!All in all, a very good experience. Thank you for the good support, and for returnign my phone call. :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick C",
          "Nb_Reviews": 1,
          "Date": "2022-12-31T19:09:25.000Z",
          "Titre": "Able to Download Windows 10 Within Minutes of Purchase",
          "Contenu": "Trustpilot says it all.  Based on customer reviews and price, I was able to make a quick decision to  purchase Windows 10.  Being able to download the product within minutes of purchase straight from the site was great.  The installation also went very smooth and all files programs and files were in tact.I’ll use this site again if needed.Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Gilstrap",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T02:37:48.000Z",
          "Titre": "update to Windows 10",
          "Contenu": "It would help if instructions for the download were provided upon ordering for the product.   Otherwise, once I got the instructions, it was very helpful and successful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T11:05:29.000Z",
          "Titre": "The software Windows-10-Home to replace…",
          "Contenu": "The software Windows-10-Home to replace my old Windows 7 works well on my old PC. Mr Garry of Customer Service provided excellent assistance on-line to install the software. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Cline",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T07:33:29.000Z",
          "Titre": "The person that assisted me was…",
          "Contenu": "The person that assisted me was extremely helpful and polite.She quickly resolved the situation and made sure everything was working correctly.I am totally satisfied with the support I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glen",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T12:36:39.000Z",
          "Titre": "Got the product I want real quick",
          "Contenu": "Got the product i want real quick. Save a lot and hassle free. Just minor issue with activation but solved right away after calling the customer service. Happy customer here! would recommend."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ellepaul Renzales",
          "Nb_Reviews": 1,
          "Date": "2023-03-11T05:10:39.000Z",
          "Titre": "I'm in relief right now I thought I…",
          "Contenu": "I'm in relief right now I thought I messed up but thanks to Dan. First the License key doesn't work I entered the code many times and wait so long because It won't work. Then I decided to asked for help in the bubble that pops out and I asked him what happened so I wait and then he solve the problem for me and I do everything what he said. My pc restarted and talk to him ones more to ask what happened why my pc says that my Windows 10 pro is not activated and follow what he said again and boom! What a relief! Thanks a lot! Best Experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Eder",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T02:49:06.000Z",
          "Titre": "Great price, easy process and outstanding support after purchase",
          "Contenu": "Great price and easy ordering. Best part was service after the purchase. I had issues activating and got on online chat and it was handled perfectly. Would recommend to everyone and will shop here first in future"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Smith",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T22:04:20.000Z",
          "Titre": "Very Satisfied Customer",
          "Contenu": "I ordered a product and immediately received an email with the download link and the product key, then follow on installation was easy and quickly accomplished. All at a great price. Thank you so much, save so much! I'll recommend this store to my friends and family."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Arlene Sweeny",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T13:40:09.000Z",
          "Titre": "Kudos PC Masters!",
          "Contenu": "Kudos PC Masters! You are masters, indeed. Great product, lower price, excellent, professioanal, and friendly customer support. Will recommend this store to my friends and relatives. Cheers PC Masters!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Gilmour",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T04:07:03.000Z",
          "Titre": "First I bought the wrong version",
          "Contenu": "First I bought the wrong version. They sorted that out immediately. Then I had activation problems. They proceeded to sort that out as well. The whole thing took a couple of days, through no fault of theirs, but all was unicorns and rainbows in the end. They stuck with me the whole time. I would highly recommend these guys and will absolutely buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Higuera",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T04:23:54.000Z",
          "Titre": "The code didn't work but the online…",
          "Contenu": "The code didn't work but the online chat helped me get it up and running in no time in getting the Office suite registered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl Parker",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T21:02:07.000Z",
          "Titre": "Just bought Office 2021 Professional…",
          "Contenu": "Just bought Office 2021 Professional Plus Lifetime License key at a great price.  However, I could not seem to get it registered.  Dan from tech support was amazing.  Walked me through each step and was so patience with this little old lady.  I am so happy now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mimi",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T13:59:56.000Z",
          "Titre": "I ordered MS 2019 Professional Plus",
          "Contenu": "I ordered Office 2019 Pro Plus. Everything went super fast with no problems.Anytime I need software, thus is the place I go. Great products and services.I will order again! Since this is my first time to order this website and I recommend this website to everyone. Thumbs up!!!! I am very happy with my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kieran Firenze",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T06:07:36.000Z",
          "Titre": "Problem but fixed after tech support",
          "Contenu": "I had a problem with registration but I contacted tech support and they were able to get me information on how to fix it. It worked out and is working great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sally Brown",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T22:46:46.000Z",
          "Titre": "Super Thankful to Customer Support",
          "Contenu": "Excellent Service. I had a few issues with installation and activation. I called the help service. They're very quick and polite! Would recommend this site! Thank you so much again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Moats",
          "Nb_Reviews": 1,
          "Date": "2022-09-05T16:34:42.000Z",
          "Titre": "Simple and easy place to buy from",
          "Contenu": "Simple and easy place to buy from. Love the fact it digital download. Had the activation key before I had it downloaded. Will definitely be using there service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aris Bo",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T19:36:44.000Z",
          "Titre": "Helpful and Nice Staff!",
          "Contenu": "Angel and Glen were very helpful. They help me navigate through the process. They were nice especially to those who are not that computer techy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Amores",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T23:18:27.000Z",
          "Titre": "Good Product, legit, and cheap",
          "Contenu": "I'm so happy with the product and customer service! Legit product and super cool customer service. I know now where to purchase my next software. Satisfied customer here! Thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "UnGlued",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T22:19:06.000Z",
          "Titre": "Activation Issue Resolved",
          "Contenu": "I was unable to resolve the issue myself, the representative on chat was great, sent screen shots and ultimately resolved the issue for me! Thank you for the great support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Marshall",
          "Nb_Reviews": 3,
          "Date": "2023-01-01T22:03:12.000Z",
          "Titre": "I was frustrated at first",
          "Contenu": "I was frustrated at first, because the code didn’t work, but after contacting Support through their chat option, they got it fixed right away. Thank you Glen!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Garity",
          "Nb_Reviews": 4,
          "Date": "2022-10-08T23:32:48.000Z",
          "Titre": "HELP WHEN I NEEDED IT",
          "Contenu": "I had restored a 12 year old computer to original status and found it with Windows 7 and Internet Explorer.  I needed to get Windows 10.  It was not an easy task with everything on the computer out of date.  It took 2 calls to customer service and it is up and running again.  They were great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David G",
          "Nb_Reviews": 3,
          "Date": "2023-07-15T21:10:23.000Z",
          "Titre": "The download appeared in my inbox so…",
          "Contenu": "The download appeared in my inbox so quickly that I thought it was just advance notice. I finally figured it out and it worked seamlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MiLe",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T04:18:06.000Z",
          "Titre": "bought office 2019 for windows and it…",
          "Contenu": "bought office 2019 for windows and it was worth it! Both the price and service are good! Had an issue during installation but called their support and was able to solve it! Thanks PC Masters!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joseph Olson",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T06:23:41.000Z",
          "Titre": "Activation",
          "Contenu": "I had a bit of problem with my office activation.  When I requested help it only took minutes.   Very fast customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2022-07-27T16:35:53.000Z",
          "Titre": "I was very surprised by the quick and…",
          "Contenu": "I was very surprised by the quick and efficient help in installing the new Offica. Alex helped me through the process patiently and efficiently. Thank you Pc-Mastes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Les Miller",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T02:50:00.000Z",
          "Titre": "Bought 2 copies of Office 2021",
          "Contenu": "Bought 2 copies of Office 2021. Had trouble activating both copies but a call was all it took to straighten them both out. They answered right away and had me up and running in 5 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dirt scapers",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T22:01:11.000Z",
          "Titre": "My support person Queenie was Great",
          "Contenu": "My support person Queenie was very helpful and had my license issue taken care of within a few minutes Queenie was awesome to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T22:46:43.000Z",
          "Titre": "Great price and customer service",
          "Contenu": "Product is exactly as the stated in the ad at the greatest price. Had an issue installing the product and when I contacted them online they talked me through the process and even did some of the steps for me. The whole process took about 10 minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daven Rojas",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T23:26:46.000Z",
          "Titre": "Super Legit",
          "Contenu": "Great job. Had issue with activation then call the hotline and boom! problem solved. Thank you so much! Will be back for another purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Randy Piggott",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T23:25:05.000Z",
          "Titre": "Support for activation was good",
          "Contenu": "Download and installation was easy. We needed help with Office activation on two machines. Kathleen was patient and very helpful. SUCCESS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "phroggie61",
          "Nb_Reviews": 2,
          "Date": "2023-02-23T23:32:40.000Z",
          "Titre": "Excellent Customer Support",
          "Contenu": "Easy to purchase a license.  Had trouble getting one to install properly, and the chat feature helped get that accomplished.  Excellent experience and top notch customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tino",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T23:36:12.000Z",
          "Titre": "Purchased and installed Office 2021…",
          "Contenu": "Purchased and installed Office 2021 Home and Student Lifetime License. Download was smooth and quick, however, I am unable to print any of the things I have typed. Everything goes to \"SAVE\". And even after this I am unable to open item to print. Help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer Joanne",
          "Nb_Reviews": 2,
          "Date": "2023-06-02T02:40:37.000Z",
          "Titre": "I could not download the product I…",
          "Contenu": "I could not download the product I bought.  After, getting help from several people, 3 phone calls to Pcmasters, the problem was found and finally I had peace! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mick cho",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T05:41:55.000Z",
          "Titre": "so i wasn't really expecting live chat…",
          "Contenu": "so i wasn't really expecting live chat at this time of night.  it was like 9pm et.  i was going to leave an email but there was live chat.  it took like an hour to fix my pc.  the guys hourly rate must have been more than what i paid for the software.  yet he fixed it.  after going back and forth he asked if he could do remote and within like 10 mins he had my pc running. amazing service."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Paul STEMMLER",
          "Nb_Reviews": 2,
          "Date": "2023-06-23T15:04:12.000Z",
          "Titre": "Great Tech Support",
          "Contenu": "Had a minor issue getting my product to activate but they fixed the issue within a few hours  very happy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Knight",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T09:58:48.000Z",
          "Titre": "Excellent support",
          "Contenu": "Excellent support!  From Star in particular.  I ran into a small issue and they solved it the same day.  Highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Kristen Smith",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T12:58:03.000Z",
          "Titre": "Helpful Staff and Great Prices",
          "Contenu": "Helpful Staff and Great PricesI purchased Office 2019 . The customer service folks where very quick to respond to my inquiries and to help with resolving issues relating to the download and installation. It was a good experience and I actually purchased another download for another computer. Happy Customer! Thank you Pcmasters!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 5,
          "Date": "2022-11-01T17:46:42.000Z",
          "Titre": "Called Support and got a new product…",
          "Contenu": "Called Support and got a new product key. The person stayed on the phone until I got the klaptop activated.Very helpful and great customer support."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Aperture Decker",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T03:45:45.000Z",
          "Titre": "Purchased Windows 10",
          "Contenu": "Purchased Windows 10, it's a good buy, and the key works perfectly. I was amazed that their live technical support operates"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Le",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T16:58:41.000Z",
          "Titre": "Windows 10 key didn't work",
          "Contenu": "I had an issue with windows 10 key that didn't activate. I reached out to customer service and they were super responsive on contacting me back and resolving my issue!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Komarek",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T00:33:42.000Z",
          "Titre": "Great Customer Support",
          "Contenu": "I experienced some trouble while installing (got an error code that said this code has been activated on another computer), but when I reached out for a refund a customer representative was able to provide me instructions on how to succeed in the activation (had to do a short phone call with Microsoft). Great customer support, and on a Sunday too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Lee",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T03:38:32.000Z",
          "Titre": "The lady I talked with this morning was…",
          "Contenu": "The lady I talked with this morning was excellent and solved the problem quickly after I explained what had happened the evening before.  I was very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T04:18:12.000Z",
          "Titre": "I purchased a license for Windows 10…",
          "Contenu": "I purchased a license for Windows 10 Professional. I called and received expert instruction on how to get it activated. Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James R",
          "Nb_Reviews": 1,
          "Date": "2022-08-25T14:56:27.000Z",
          "Titre": "Highly recommended!",
          "Contenu": "Highly recommended!The product was delivered through email instantly.The program is working well and the support is so responsive and knowledgeable!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Loftis",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T21:48:03.000Z",
          "Titre": "was fast and easy and i see no charges…",
          "Contenu": "was fast and easy and i see no charges on my card other than what i ordered. i ask them a few things they gave me a answer and it all worked as they said so all is good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 3,
          "Date": "2023-02-10T06:17:58.000Z",
          "Titre": "A few teething issues with the product…",
          "Contenu": "A few teething issues with the product key, took two phone calls to sort it out, but the techs worked quickly and professionally. All is well. Will purchase from again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ariel Barrios",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T01:02:46.000Z",
          "Titre": "Service was great and the issue I had…",
          "Contenu": "Service was great and the issue I had was resolved immediately. Instructions were provided very straight forward. Excellent service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jean Marie Muhindo Kamukehere",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T12:18:32.000Z",
          "Titre": "I easily found the solution to my…",
          "Contenu": "I easily found the solution to my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "edward richardson",
          "Nb_Reviews": 3,
          "Date": "2022-11-24T05:21:36.000Z",
          "Titre": "Their service department is the best ever. Great job guys and thanks.",
          "Contenu": "They worked very hard to get my service up and going. I thought I had bought a program and was going to get stiffed with it. But when I contacted them they were right there to help me get up and running. They have a great staff and I want to say thank you to everyone that helped me. Great group of people. The best help I have ever gotten when I bought a online product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bradley Schuster",
          "Nb_Reviews": 3,
          "Date": "2023-02-09T17:15:46.000Z",
          "Titre": "Item is as described",
          "Contenu": "Item is as described. Works perfectly. Fast shipping will definitely use this seller again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Hauser",
          "Nb_Reviews": 5,
          "Date": "2022-11-24T01:37:47.000Z",
          "Titre": "CS was very responsive",
          "Contenu": "After my computer failed mid boot I was expecting the worst, but CS was very responsive and helpful in getting my new program reinstalled."
        }
      ]
    }
  ]
}