{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "pcprotect.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Robert Glenn",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T04:46:17.000Z",
          "Titre": "Software wouldn't work",
          "Contenu": "Software wouldn't work, multiple live chat with tech support didn't solve problem. Told it \"MIGHT\" be a technical problem try again in 24-48 hours. Have now deleted and gone elsewhere.Refund has been requested by I am not hopeful, they are hard to contact"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Michalene D. Ironbow",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T16:28:34.000Z",
          "Titre": "This program does not work",
          "Contenu": "This program does not work. It locates files and skips quarantining them so you have to manually search for the affected files. I am trying to cancel and they will not even listen to me. I WANT TO CANCEL. NO renewal for this and they will not even confirm the cancelation. No email to contact these snake oil salesman and no respect of the wishes of the customer."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jacob Lovell",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T14:56:41.000Z",
          "Titre": "Unable to cancel subscription.",
          "Contenu": "Unable to cancel subscription.Company won’t let me cancel my grandfathers payment as he didn’t realise he signed up to them! This has been ongoing for the 2 years and he’s had over £300 taken from his account unknowingly as he signed up for something not understanding what it is When you try to cancel the subscription it takes you back to a resubscribe page without any further knowledge. Total lack of communication and really unhelpful website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Worley",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T11:11:39.000Z",
          "Titre": "Worthless",
          "Contenu": "This company will steal your money. Even if you don't want their protection, which is way below par, it will still steal your money from your bank account!! It is the most low life company I have ever had the displeasure to deal with!! CANCEL my account!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "PC Baker",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T04:00:26.000Z",
          "Titre": "I was charged for a service that was…",
          "Contenu": "I was charged for a service that was not authorized. I canceled the service last year and did not realize they were still charging me the fee through a Paypal service. I canceled because they did not provide service as stated. Thumbs down and be aware."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul Craig",
          "Nb_Reviews": 3,
          "Date": "2023-06-28T15:16:58.000Z",
          "Titre": "cancelled our agreement ,company…still took money",
          "Contenu": "cancelled our agreement ,company refused to give money back even though they have a 30 day money back guarantee ,now taking this legally as i have several emails from company saying it will be refunded from the 29th May and still no money back  you have my email and account details so you can sort this out"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andy W",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T17:04:51.000Z",
          "Titre": "Subscription Trap",
          "Contenu": "Edit: In reply to PCProtect, I was promised a refund and the Billing department were either negligent or incompetent, as I had to raise a claim for my refund. So much for your money back Guarantee ‘400% increase in price through a subscription renewal, and when I tried to get a refund I was given the run around. Was assured that my subscription of £119 had been refunded (original price was £34)Only got my money back through a claim with PayPal’"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clyde Schmidt",
          "Nb_Reviews": 2,
          "Date": "2023-10-13T15:16:13.000Z",
          "Titre": "I signed up for there service in 2021…",
          "Contenu": "I signed up for there service in 2021 and it was $24.00--I also signed up for auto renewal--the last renewal fee was $145.00--a total scam on the pricing --watch out"
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Pia",
          "Nb_Reviews": 8,
          "Date": "2023-01-01T17:39:59.000Z",
          "Titre": "Beware this is not a free software",
          "Contenu": "Went to Google and searched for the top best free antivirus software, Total AV was #2 (the first one was a paid option and it was CLEARLY stated in the ad) I downloaded that but it didn't have real time protection if you didn't upgrade to a pro version. Uninstalled and tried PC Protect instead, and to my surprise the whole program looked EXACTLY the same as Total AV (it's probably the same software just packaged under a different name) Same interface same icons at the exact same order and everything and like the former software didn't have real time protection. Total garbage, avoid. They must have a huge bot farm to get all the high ratings."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Walston",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T20:50:07.000Z",
          "Titre": "buyer beware",
          "Contenu": "buyer beware,thier vpn crashes and when it does your locked out of your wifi.the software crashed my new laptop,i uninstalled the software immediatley i requsted a refund and didnt hear anything from them.i had to have my bank get my money back."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rachael",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T17:52:55.000Z",
          "Titre": "Beware - Expensive auto renew",
          "Contenu": "Signed up for software in October 2020.  Cost $49.50 with a discount.  No mention of auto renew taking money from by debit card, or I wouldn't have signed up. Billed $27.80 in December 2021. No email warning to tell me that I had auto renewed.  Such a small amount I didn't even notice it coming off my debit card. Billed $179 in December 2022 from my debit card. No email reminder or warning. Just noticed. Excruciatingly difficult to turn auto-renew off on the website.  Keep sending you round in circles if you want to cancel.  Beware.Further to PC Protects comments below, going to the the 'Disable auto renew' section gives three options.  Regardless of the option chosen they just send you back into the classic loop of not wanting to lose your business and making it unbelievably difficult to simply cancel auto renew.  If you select 'Pricing issue'  you get 'We're sorry to hear you have a concern with the price of your PCProtect subscription, and we'd really hate to see you leave, running the risk of being unprotected from harmful threats online. If you really want to cancel your account and risk being unprotected from online threats you can do so in your account, or you can continue below by clicking next.'  There is no 'next' button on the page.  The other 2 options are in a similar vein. Even when you follow the  'my account' link (which is the only place it appears on their website,) and you are able to disable autorenew, they STILL KEEP YOUR DEBIT CARD DETAILS on your account screen even though my account is paid up for the next 11 months and I don't want to renew.  Now I'm going to have to go through the hassle of cancelling that debit card to make sure they don't take any more payments.  Once again. Beware."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mrs Evelyn Terry",
          "Nb_Reviews": 6,
          "Date": "2023-09-26T12:21:41.000Z",
          "Titre": "This company is an Asian run scam",
          "Contenu": "This company is an Asian run scam. The five star reviews are false."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mrs Evelyn Terry",
          "Nb_Reviews": 6,
          "Date": "2023-09-25T01:02:10.000Z",
          "Titre": "It's an Asian run scam",
          "Contenu": "It's an Asian run scam. The 5 star reviews are false."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sarah Grage",
          "Nb_Reviews": 3,
          "Date": "2022-07-26T21:48:10.000Z",
          "Titre": "Stole my money, worst customer service ever",
          "Contenu": "Update.. useless live support or emailing because all they do is reply with an already generated reply.  These customer service people aren't human or won't behave like humans. They won't or can't reply using their brains... So they hide behind their emails. I have requested over 15 times for a manager to contact me directly... Yet nothing, same pathetic auto generated replies... The request is ignored!! And what makes it worse even know I have been assured over and over everything is cancelled they tried to take my money again... OMG they are liars that steal your money.. luckily my credit card expired..So don't direct me on here what to do cause your staff are hopeless, have a manager contact me and sort this out once and for all. You owe me $99. You're an IT virus protection company I'm sure you can look back at your emails... Cause you'll see YOU stuffed up and actually legally have to refund me. But instead you make it impossible to talk to a real person with a working brain who can speak for themselves and actually helpMy first review, again you didn't even realise what the issue was.. It's not the amount of money, it's that I cancelled, email and told your company to cancel and stop the auto renewal.. But that didn't work... You never cancelled it or stopped the auto renewal..i uninstalled it.. Did everything right.. But you still charged me again.. Your stuff up.. So what you tell you customers to do... Didn't work.. You still charged me... Now refusing to refund me...Their software might be fine.. But they're customer service is terrible..I have sent over 30 emails this time and maybe 20 last time with issues..Product worked but after having log on issues..I emailed, they replied and I replied back only to get a different customer service rep.. So basically repeating yourself over and over again.. Often just getting an auto-generated reply.. so in the end I cancelled, said no more. I'm not using the product don't renew this. Stop the automatic renewal and don't charge me... Advised all done and very apologetic... Then.. I'm charged again.. Again email and email, they say yes they will refund me etc.. then I get another email saying click on the link to stop the renewal.. I email again.. Hello..I cancelled cause I can't log on.. You already told me it's stopped..I can't log on.. So link doesn't work.. I get on with my life.. Until I get another email a year later ( last month) saying they will take next year's amount out... So nothing was cancelled, stopped.. Nothing..I check and realise they never refunded me ( stupidly, I took their word ) so now the battle continues... I have been told by many different staff that yes auto renewal stopped..mmm also got sent that link again.. told because I didn't use the link they took back my refund... Even know I've explained over and over.. Can't log on.. Sending me a link to do so.. Useless... Have asked for 1 person to take ownership and handle this.. Look back at last year's emails etc.. asked for a manager or team leader to contact me... Nothing, no one.. Just the same stupid auto general replies.. I used language and then they replied themselves.. Lol.. so they are real.. Just pathetic at their jobs..Absolute worst customer service I have ever experienced.. staff stuffed up, didn't do their job correctly, and advised me they had!  and I was changed because of this.. and now they are refusing to refund me.. Even know they said they would as they shouldn't have charged me in the first place..."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tom R",
          "Nb_Reviews": 5,
          "Date": "2023-01-18T19:31:30.000Z",
          "Titre": "too complicated to work"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve H",
          "Nb_Reviews": 4,
          "Date": "2021-12-02T17:29:20.000Z",
          "Titre": "Very poor site",
          "Contenu": "Very poor site, my son set it up for me & paid the full price, Each month i get a message that says my trial has expired I have not had a trial as the full price was paid, . My son comes over & puts in his password I Everything is then fine for another month, then I get the \"your trial has now expired\" message reappears So my son has to come over yet again. Your staff don't seem to know what they are doing, as a result, when the year is finally up, I will definitely NOT be renewing!"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "S1",
          "Nb_Reviews": 2,
          "Date": "2022-03-10T12:38:48.000Z",
          "Titre": "AVOID! - Huge amount taken from debit card!!!",
          "Contenu": "PCProtect charged me 146 euros for one years coverage. I only discovered this months after the transaction had taken place. Billing support didn't want to know. Not even an explanation as to how I was charged such an extortionate amount. AVOID!!!"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Haag",
          "Nb_Reviews": 1,
          "Date": "2021-06-10T17:00:54.000Z",
          "Titre": "Very user unfriendly and very agressive SPAM senders",
          "Contenu": "Very user unfriendly, the protection was blocked all the time. Besides that:  if you want to cancel they keep sending you emails to 'assist' you and get you back to them, but if you respond that you did unsubscribe, they inform you that messages are only taken into account by paying customers, with other words: they keep sening you unwanted emails and you have to subscribe and pay in order to be able to inform them that you did not continue the automatic continuation. Very very frustrating!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Raphael",
          "Nb_Reviews": 33,
          "Date": "2021-05-13T09:33:34.000Z",
          "Titre": "This company has an immoral way of…",
          "Contenu": "This company has an immoral way of handling their business.  A year ago I cancelled my account with them. It was just a trial but somehow became fixed in place and I had to pay to get released. I have a record of all the emails.  To my horror today they put through a charge of £118.80 through PayPal.  Now I have to go through the whole process of getting a refund.They answer every email to them with longwinded replies as to how much you are loosing etc.  I have other antivirus, anti malware protection."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Lyn Wallis",
          "Nb_Reviews": 7,
          "Date": "2020-12-29T22:34:02.000Z",
          "Titre": "This is an update to my previous review…",
          "Contenu": "This is an update to my previous review in October.  I was shocked to find that I had been charged $99 for something I never asked for from PC Protect.  I had downloaded the program as a \"free\" option but two months later received a charge.  I have deleted the program now.  Thankfully, they have agreed to issue a credit - after first agreeing to $70 credit and $29 to cover 12 month subscription - this has now been changed to $99 credit!!!  Be careful people!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "MG",
          "Nb_Reviews": 3,
          "Date": "2020-05-12T11:10:28.000Z",
          "Titre": "Taken 84 pounds out my account instead…",
          "Contenu": "Taken 84 pounds out my account instead of 34.80. Was meant to be 29 pounds until I input my bank details then said there was 5.80 vat to pay so total was £34.80. After 10 minutes a note popped up on my laptop saying they are debiting 84 pounds without a clue as to why. From the high ratings im sure the protection must be great but i aint paying 84 pounds for the pleasure, very shady."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Kupo",
          "Nb_Reviews": 6,
          "Date": "2020-04-26T09:22:18.000Z",
          "Titre": "I would give a 0 rating if possible",
          "Contenu": "I would give a 0 rating if possible! I have tried to contact this company several times over months to cancel my subscription and to remove my bank details from their database. My emails have been ignored and I had to block their payments through my bank. Somehow they are still managing to take unauthorised payments from my account! Avoid at all costs! PC Protect are fraudulent! I will be reporting to the financial ombudsman!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mrs Michelle Raina Teresa Parker",
          "Nb_Reviews": 2,
          "Date": "2020-02-16T18:46:01.000Z",
          "Titre": "My computer has crashed again",
          "Contenu": "My computer has crashed again, and would not start up properly, both times whilst having PC Protect installed.The first time this happened it would not restart at all, and was a direct result of PC Protects system tune-up results. I had to purchase a brand new drive and lost a number of files, thankfully ones that weren't too much of a sentimental value and others that I had stored elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joanna McDowell",
          "Nb_Reviews": 7,
          "Date": "2019-10-18T09:21:59.000Z",
          "Titre": "I bought 1 yr of PC protect antivirus…",
          "Contenu": "Revolving payment!!! Beware !!!! I bought 1 yr of PC protect antivirus without my permission they just took £118.00 out of my account via PayPal putting me overdrawn. They did this on a revolving annual payment scheme which I would NEVER have signed up to if I saw it it Big letters and not hidden in small print! I’m trying to get my £118.00 back.  Everyone don’t buy it until your sure!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doug",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T02:14:48.000Z",
          "Titre": "If you think you're going to talk to a…",
          "Contenu": "If you think you're going to talk to a tech to help you figure things out:  think again.  They'll send you a list of articles to read.Did try to reply to the email listing those articles, and it would not deliver."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel P Adley",
          "Nb_Reviews": 1,
          "Date": "2021-06-05T20:28:38.000Z",
          "Titre": "This software stopped working sometime…",
          "Contenu": "This software stopped working sometime in the past - PCProtect technician could not determine when it stopped working. It may have NEVER protected me after initial installation. I see no reason to continue this product after my subscription ends on 08AUG21. Very disappointed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gerard Hearne",
          "Nb_Reviews": 106,
          "Date": "2017-09-05T12:34:45.000Z",
          "Titre": "Phishing call to a TPS-registered number",
          "Contenu": "An employee from this company rang me to promote their services. My number is registered with the Telephone Preference Service: 'It is unlawful to make unsolicited direct marketing calls to telephone numbers registered with TPS.'They claimed to be providing me with a PC Protect service at £10 per month, they don't, they were phishing. Also arrogant and rude."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nadim Akel",
          "Nb_Reviews": 1,
          "Date": "2020-04-15T19:30:54.000Z",
          "Titre": "it doesn't work",
          "Contenu": "I paid for the service in order to protect my data, some hacker was able to disable PCProtect and encrypt all my data, and now I am struggling to get support from PCProtect, they sent me an email with instructions that has nothing to do with my issue, they don't have live support where you can talk to someone, the tech support on the chat portal tried to send me also a link that is very general and doesn't have specific instruction related to my issue, I will have to buy another anivirus as soon as I recover from this attack"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Robert bowley",
          "Nb_Reviews": 3,
          "Date": "2020-09-28T16:46:09.000Z",
          "Titre": "I have been using pc for a year now…",
          "Contenu": "I have been using pc for a year now with no problems but now have recieved an email informing me thatMy subscription has been renewedAt the price of £118 .80p which i feel is very expensive ,i had no prior warning about this i have emailed the company and await a reply"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Graeme Robertson",
          "Nb_Reviews": 5,
          "Date": "2020-10-27T08:49:11.000Z",
          "Titre": "Its not USER FRIENDLY",
          "Contenu": "Its not USER FRIENDLYIt is supposedly running a scan but gives no indication that it is happening, what it is scanning, and what progress it is making, if any. It is not about the provider, it is all about the CUSTOMER.Get real and tell me what this thing is doing"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Steve saxby",
          "Nb_Reviews": 2,
          "Date": "2020-03-14T05:43:18.000Z",
          "Titre": "Purchased 3 PC license had to restore…",
          "Contenu": "Purchased 3 PC license had to restore OS on one PC now it only works on 2. But they took auto payment at the expiry date even though I only have two thirds of the product. Need to find out how to permanently end the contract prior to the next expiry."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Jill",
          "Nb_Reviews": 15,
          "Date": "2020-08-02T07:11:22.000Z",
          "Titre": "Advertised as free but not free",
          "Contenu": "Interesting reading that people consider it free. It is €29 to sign up then a further $58 is billed during the year. When I queried this they just kept evading the question as to the actual costs which will be charged to your card. I know it says free but that is the actuality. Then when you try and download it is a minefield of optional extras which all cost more. After more than 6 hours of unsuccessfully attempting to download supposedly with the help of customer service I gave up and requested my money back as per their site. Cue another battle with customer service who really did not want to do that. A definite case of buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annie White",
          "Nb_Reviews": 2,
          "Date": "2020-10-15T02:22:02.000Z",
          "Titre": "PC Protect does nothing about Adware",
          "Contenu": "PC Protect does nothing about Adware. I can't even see my full screen because of the pop-up ads. One after the other, sometimes 30-40 pop-ups. I paid for and downloaded this useless piece of nothing! I'm so disappointed."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Lynne Humphries",
          "Nb_Reviews": 17,
          "Date": "2021-03-04T11:36:46.000Z",
          "Titre": "Bought from this company in good faith because of good Trustpilot reviews",
          "Contenu": "I signed up in good faith in 2019 for a package to cover up to 3 devices. Without my knowledge I was billed for an additional service for 12 devices-as a pensioner living with my husband I have no need for additional support yet was billed for 2 accounts in both 2019 and 2020. At no time did I receive invoices by email to alert me to this. I have requested a refund but have ad no reply. I trusted this company because of their good reviews on Trustpilot. I was mistaken -the VPN never worked and I have not been refunded for a product I never authorised. There has been no response to my request for a refund of the additional service. I feel that I cannot trust this company ever again."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Lillian Dolomont",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T16:36:44.000Z",
          "Titre": "I cannot engage my PC Protect",
          "Contenu": "I cannot engage my PC Protect. It tells me to turn it on but when I do it says there is an error and to restart my computer and try again. I did this several times but get the same message.Also I can't get into a help section."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shailesh  Saigal",
          "Nb_Reviews": 2,
          "Date": "2022-02-25T16:28:52.000Z",
          "Titre": "combo cleaner found much more…",
          "Contenu": "combo cleaner found much more furthermore when ads pop uo in browser due to a trojan or other they should be eliminated and not just stopped from opening. eliminate the problem"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dear Mr Wilmott",
          "Nb_Reviews": 3,
          "Date": "2021-04-21T07:48:42.000Z",
          "Titre": "I decided to unsubscribe from PC…",
          "Contenu": "I decided to unsubscribe from PC Protect and had to tell them 7 times before they got the message but i am still getting messages every day to take out another account.Not happy with the constant badgering..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lori",
          "Nb_Reviews": 2,
          "Date": "2022-03-16T11:57:09.000Z",
          "Titre": "i have updated and restarted my…",
          "Contenu": "i have updated and restarted my computer and it still will not let me run a scan or enable my protection. i am super pissed. i pay too much for this to be like this!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Darren J Bransden",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T08:05:25.000Z",
          "Titre": "The VPN won't connect and the whole…",
          "Contenu": "The VPN won't connect and the whole system won't work with mobile data on,  it says I need a land line WiFi connection...what a waste of $19This is crap don't buy it."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "ulrick carlo nielsen",
          "Nb_Reviews": 9,
          "Date": "2019-11-22T19:49:35.000Z",
          "Titre": "WARNING TO ALL.",
          "Contenu": "WARNING TO ALL.Don't use \"PCPROTECT and TOTAL AV\" antivirus, when you don't want to use them anymore, they send you lots of emails with offers on their antivirus. even if you've asked them to delete you from their list, they stil keep sending you mails.How many times do I have to tell you I do NOT want your virus program, I have several times sent you an email saying you have to delete my email address so I will not receive any more from you, but you still continue to send me lots of emails . every time I get emails from you I \"unsubscribe\" myself from your emails but you still keep sending me emails ..... If you write negative about them on facebook, your messages will also be deleted."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mark Taylor",
          "Nb_Reviews": 6,
          "Date": "2019-10-06T18:15:05.000Z",
          "Titre": "BEWARE!!!!!!!",
          "Contenu": "As with most free Antivirus the most important features are not free (but they don't tell you this until you sign up) so I uninstalled the program and it crashed my laptop. AVOID LIKE THE PLAGUE!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Paul",
          "Nb_Reviews": 2,
          "Date": "2021-03-19T19:51:10.000Z",
          "Titre": "I told them to cancel my subscription…",
          "Contenu": "I told them to cancel my subscription and instead I found out that they charged me £120 pounds on my credit card instead. Absolutely dishonest. Avoid."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ron Sept",
          "Nb_Reviews": 1,
          "Date": "2020-02-22T19:59:13.000Z",
          "Titre": "This is a product dedicated to…",
          "Contenu": "This is a product dedicated to upselling users on the company's other products.  it's slow and awkward to use, and seldom delivers what it promised."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Midalys Cutino",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T00:56:38.000Z",
          "Titre": "verry bad",
          "Contenu": "i don like the service, is not free, and even if you pay is the same, because i pay, and i didn't like the service, i don not recommend it"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "GARY HUNTER",
          "Nb_Reviews": 1,
          "Date": "2020-06-06T09:33:08.000Z",
          "Titre": "security nil",
          "Contenu": "the protection refuses to work scan or anything waste of money stopping dd. it used o be a reliant computer cleaner but its gone downhill"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Sigmund Sundsbø",
          "Nb_Reviews": 1,
          "Date": "2020-09-12T11:12:55.000Z",
          "Titre": "Unwanted subscription",
          "Contenu": "In July 2019, I wanted to try PCProtect on a tablet. Downloaded what I thought was Free trial. I do not remember that I registered payment card (but I obviously must have done - PayPal). Found that PCProtect was not easier or better than another antivirus program I had subscribed to, so I deleted PCProtect.In August this year I did something I rarely do, used PayPal and saw that 99 EUR had been deducted from PCProtect (25 EUR in 2019).-Did not know that I had a subscription to PCProtect.-Had not been notified of renewal.-PCProtect had trouble finding me in their system when I contacted them.-I have sent several inquiries to cancel the subscription with reference to \"30 Days Money Back Guarantee\".-Response to the emails from PCProtect has been that they have worked hard to create a good and safe antivirus program, and point out that my devices are exposed without antivirus.-I have not had PCProtect installed on any device since last July 2019, and consequently have not received updates.-30. July was my first inquiry to PCProctet, the case is not yet closed 12 September."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Timothy Galloway Galloway",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T03:56:34.000Z",
          "Titre": "They said it would stop pop ups",
          "Contenu": "They said it would stop pop ups. Since buying this i have more and computer runs slower. I want to cancel!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Suzanna L Roushar",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T23:50:11.000Z",
          "Titre": "I bought the pro special for ad blocks",
          "Contenu": "I bought the pro special for ad blocks.  Now I am bombarded with ads.  My computer is slow and trashing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angelynn H  Cuthbertson",
          "Nb_Reviews": 1,
          "Date": "2020-08-15T17:37:22.000Z",
          "Titre": "Not as simple/easy as they lead to…",
          "Contenu": "Not as simple/easy as they lead to believe it will be.  Too much to go through to get to the end result."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "N",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T02:58:38.000Z",
          "Titre": "Disappoint with program as it is…",
          "Contenu": "Disappoint with program as it is disconnect and disable protection status showing up and frozen often."
        },
        {
          "Note": 1,
          "Lieu": "GI",
          "Pseudo": "Marv",
          "Nb_Reviews": 2,
          "Date": "2020-09-29T11:15:55.000Z",
          "Titre": "Super dodgy experience",
          "Contenu": "I felt like I was mis-sold the product because it did not offer all features that were advertised. Also the offer on the pop-up did not state that the 25€ were for a Yearly Subscription (I was particularly looking for this information beforehand!). So I cancelled the subscription... but instead of complying with my wish I got sent more offers and incentives by their customer service agents. Even VIP offers or Roll-ups to other, more expensive products.... And their (German) language of the service was simply a bad joke. You get better results from using ANY free translator from the web (e.g. Google or Deepl).In the end I had to write 3 Emails to finally receive a confirmation of my cancellation - which were always answered with more marketing offers in bad language. Sadly I can not recommend this company.EDIT: In the cancellation process you have to verify your translation after denying 2 more pop-up offers by typing your registered Email address and Pasword while EVERY FEW SECONDS another poop-up with their \"very cheapest offer\" pops-up (So if you want to get the best value-for-money, you might want to do that, but I would personally not recommend using a company with such aggressive marketing)"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2022-03-13T16:30:40.000Z",
          "Titre": "It has not been working for the last…",
          "Contenu": "It has not been working for the last few months and the scans will not work."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Jacob",
          "Nb_Reviews": 6,
          "Date": "2020-05-06T21:53:16.000Z",
          "Titre": "Horrible Customer Service and missing refunds",
          "Contenu": "I usually never do any reviews like this, but I decided to make an exception in this case. For some reason, I was signed up as a subscriber to their service at $8.99 monthly, although I never used their service. I noticed this on my bank account my coincidence some months later, and sent a cancellation mail as directed via pcprotect.com. That confirmation was never confirmed (although I have written email to confirm with ALL details) or activated, and I forget about it, until I noticed another monthly $8.99 fee on my bank account.I spoke with pcprotect last week, and they promised to return the last fee, which they just did - and then they freaking billed me $8.99 AGAIN!!! All the other months they had to get management approvel to refund - still haven't heard anything back on that ....In total I have now paid $89.99 for their service, which I've never used, and only talked with an ignorant guy in their customer department, who seemed like he couldn't care less. I love and have recommended A LOT of different services and companies - now I've tried giving a bad review too. But it's completely deserved, and I cannot recommend using pcprotect at all although they probably have a decent product.@PCPROTECT: Feel free to reach out to me directly if anything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "one year user",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T14:29:09.000Z",
          "Titre": "Far overpriced by comparison to similar…",
          "Contenu": "Far overpriced by comparison to similar products.  VPN connection is clumsy to use."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2021-07-17T17:00:27.000Z",
          "Titre": "Many companies put all there protect at…",
          "Contenu": "Many companies put all there protect at one price your nickel and dimming"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephen Archibald",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T06:07:02.000Z",
          "Titre": "Did delete my duplicate files...that…",
          "Contenu": "Did delete my duplicate files...that issue has been solved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michaele H Garner",
          "Nb_Reviews": 2,
          "Date": "2021-02-15T13:20:19.000Z",
          "Titre": "did not clear unwanted files....PC…",
          "Contenu": "did not clear unwanted files....PC Protect closed before completion"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Marcolx",
          "Nb_Reviews": 1,
          "Date": "2021-03-25T14:58:21.000Z",
          "Titre": "not very happy with the level of…",
          "Contenu": "not very happy with the level of protection i get for what i paid"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JOHN GRIME",
          "Nb_Reviews": 12,
          "Date": "2021-01-09T16:36:42.000Z",
          "Titre": "unable to run smart scan ,keeps…",
          "Contenu": "unable to run smart scan ,keeps stopping part way through scan?."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Monty",
          "Nb_Reviews": 11,
          "Date": "2021-01-19T19:28:18.000Z",
          "Titre": "ALL THAT GLITTERS IS NOT GOLD",
          "Contenu": "I understood that I had left this company about a year ago having fallen out with them over double charging. I reached the conclusion that cutting my losses was preferable to letting things run. Two weeks ago they send me renewal details adding that £142 would be taken from my account next month. I immediately contacted them saying I'd left and under no circumstances were they to try and remove  funds from my account otherwise it will be theft. There reply amazed me as I had written 12 months ago advising them of cancellation I was told that unless I completed their cancellation system I would still be classed as having been a member. Eventually a further email is received that shows the true nature of this company. The email had a link for you to follow, that opened a further page that continually swapped between leave and remain. The remain button, as I inadvertently found out sets off a celebratory message saying stuff like 'Great you are staying' and other such crap. The leave button required your password confirming your decision. As  I had stripped my machine of all mention of this lot I had to try and find my password. I should point out that I suffer with a nerve problem akin to Parkinsonism but thank God it is not quite that bad. In my rush to shed myself of this crap business I pressed the wrong button. Why didn't I need a password to remain, why do they ignore everything that has gone before and why have they yet to reply to my communications. My message to this shower is simple, you've been fired, you are not wanted and in my world you are a bunch of charlatans feigning respectability.If they decide to dip into my PayPal account I'll let you know."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Doreen Mathas",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T01:46:38.000Z",
          "Titre": "Real problem getting started",
          "Contenu": "Real problem getting started. Online chat no help!  Uggh!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Maureen Mutch",
          "Nb_Reviews": 23,
          "Date": "2021-01-08T22:06:21.000Z",
          "Titre": "Enable protection is off and won't…",
          "Contenu": "Enable protection is off and won't change"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 10,
          "Date": "2020-09-15T16:49:17.000Z",
          "Titre": "Very very expensive and slows my…",
          "Contenu": "Very very expensive and slows my computer down"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Gary Dawson",
          "Nb_Reviews": 1,
          "Date": "2021-08-05T00:03:39.000Z",
          "Titre": "Paid for full service",
          "Contenu": "Paid for full service but cant get VPN"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zachary A Lewis",
          "Nb_Reviews": 2,
          "Date": "2021-01-17T21:49:03.000Z",
          "Titre": "Error connection update fails ..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Cannata",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T14:06:53.000Z",
          "Titre": "DID NOT REMOVE VIRUSES!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Roy Eburn",
          "Nb_Reviews": 2,
          "Date": "2021-02-19T14:10:30.000Z",
          "Titre": "been faulty since installed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sarah Harper",
          "Nb_Reviews": 1,
          "Date": "2022-02-21T22:05:41.000Z",
          "Titre": "VPN is super slow"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Shirin Hojamkuliyeva",
          "Nb_Reviews": 1,
          "Date": "2022-03-05T15:34:10.000Z",
          "Titre": "horrible service"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Richard Fautly",
          "Nb_Reviews": 1,
          "Date": "2018-10-26T16:48:02.000Z",
          "Titre": "Unscrupulous Practices and Appalling Customer Services - Avoid!",
          "Contenu": "This company is unscrupulous, devious and untrustworthy.  Their customer services people consistently ignore your questions & requests and they appear to be clueless when it comes to managing a technical problem through to resolution.   My system failed recently leaving me without the internet security & virus protection I had paid for.  I initially contacted the company’s Chat Support line for help, but after 3 days and numerous product uninstall/reinstall procedures (at their request) it became apparent that they were no closer to a solution, so I asked that the issue be escalated.Their 'Technical Supervisors' group eventually replied and for the next 8 days they did nothing but return inept suggestions & responses, showed no urgency whatsoever and no willingness to (attempt to) isolate or circumvent the problem in order to get me back online - and they tried to blame my system/Windows for the problem!   Finally, after 13 days, I decided to call their UK number in order to raise a complaint and no sooner had I completed the call than an email popped up outlining a solution to the problem!   So, they wasted my time, 'fobbed me off' for almost two weeks, were clueless as to how to tackle the problem and they obviously knew about it all along - and they do not have a complaints procedure! I have an audit trail of exchanged emails to support all of the above.The company also operate a scandalous subscription renewal practice which defaults to 'auto-renew' at registration time (if there's a choice it is very well hidden!) and when a reminder email is sent 30-days prior to term expiry they sneakily do not mention the renewal cost!If you do not cancel before term end you are charged a scandalous amount for renewal - probably four times what you paid for the first year's cover.  Whether this practice is legal or not is one thing, but there's no doubt in my mind that it is unscrupulous and IMO has no place if a company genuinely wishes to operate in a fair and decent manner. I paid £29.94 for the first year and discovered that the renewal cost would have been £119.70. Please be aware that this company market both the Total AV and PC Protect products, but the customer support services are effectively managed by the same people/organisation within the parent company (SS Protect Limited).   Just check the Terms of Service for each product website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Odiso Nnani",
          "Nb_Reviews": 1,
          "Date": "2020-03-06T02:20:36.000Z",
          "Titre": "nothing is working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Julio Ospina",
          "Nb_Reviews": 2,
          "Date": "2019-10-05T01:29:48.000Z",
          "Titre": "I love it",
          "Contenu": "I love it Good job"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T00:06:05.000Z",
          "Titre": "I don't know whose fault it is",
          "Contenu": "I don't know whose fault it is, but it was running a clean-up scan and it pulled up a list of junk files to be removed; I tried to click on them to have them removed, but I couldn't. I kept getting a pop-up message telling me to close my Edge browser first. While I do have Windows 11, I don't use Edge; my main browsers are Duck-Duck-Go, Opera and Chrome. So Edge was, to my knowledge, not running; if it was, I couldn't close it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald",
          "Nb_Reviews": 8,
          "Date": "2021-10-25T21:27:33.000Z",
          "Titre": "Too many problems and time wasted. Refund please.",
          "Contenu": "Would not work on laptop until pc Protect manager fixed most of it from remote. Now it tells me I can not delete tracking cookies until I close web browser (which was closed at the time). Opened and closed Microsoft edge 3 times and still got the same message. Not happy. Refund please."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T22:05:15.000Z",
          "Titre": "It is kind of hard to understand what…",
          "Contenu": "It is kind of hard to understand what is all doing and if I am even protected.  I paid for the service of this to protect me on the internet and I really couldn't even tell you if it is working or not.  It is constantly asking me to pay more money for better service.  I am not sure if I will renew this because of how difficult it seems to be to use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronnal Bostic",
          "Nb_Reviews": 2,
          "Date": "2020-01-26T13:25:14.000Z",
          "Titre": "Poor had PC Protect since 11/2/19 today…",
          "Contenu": "Poor had PC Protect since 11/2/19 today 1/25/20 1st day to get downloaded to computer. Not impressed at all. Every time you see a problem PC Protect wants me to buy another product to help me with my computer. Not as advertised. Had chat sessions with reps. and sent emails with complaints, very hard to get support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amber Nicole",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T06:19:56.000Z",
          "Titre": "Nothing",
          "Contenu": "Nothing, but problems!!!!!!!!!!!Ever since I downloaded this app, my computer has completely screwed up.  It took me almost an hour to log onto it today.  It keeps freezing up and my pages become unresponsive.  Seriously disappointed!!!!!!!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "pamela wilson",
          "Nb_Reviews": 2,
          "Date": "2020-07-05T00:46:35.000Z",
          "Titre": "When I try to clean my junk file it…",
          "Contenu": "When I try to clean my junk file it only takes 1/2 of the junk leaves the rest, but system shows much more there...It used to clean all junk then stopped and only cleans 1/2. So thats why my review changed from great to poor."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bruce Carter",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T19:33:01.000Z",
          "Titre": "Really!!!!",
          "Contenu": "You should be able to utilize all functions no matter the discount offered. Plus what going on with need wifi vs cell data? I should have the option to select either or when using a fuction....Smh."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Blackledge",
          "Nb_Reviews": 1,
          "Date": "2020-04-01T18:10:43.000Z",
          "Titre": "VERY DISHONEST MARKETING TACTICS",
          "Contenu": "VERY DISHONEST MARKETING TACTICS. A COMPANY THAT IS RESPONSIBLE FOR THE SAFETY SHOULDNT MAKE YOU FEEL UNSAFE BY BOMBARDING YOU WITH ADS AND TRYING TO GET YOU TO BUY STUFF ALL THE TIME. SHAME ON YOU PC PROTECT!!!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Customer chris skuse",
          "Nb_Reviews": 13,
          "Date": "2020-03-04T23:59:25.000Z",
          "Titre": "NOT AS GOOD AS YOU SAY YOU ARE",
          "Contenu": "NOT AS GOOD AS YOU SAY YOU ARE TO GET FULL PROTECTION YOU WANT MORE MONEYWILL GO BACK TO MC AFEE WHEN I RENEW YOU KNOW WHAT YOUR GETTING FROM THE START WITH THEM  THATS IT ALL I HAVE TO SAY"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "brenda",
          "Nb_Reviews": 1,
          "Date": "2021-01-11T01:42:36.000Z",
          "Titre": "i have not had time to really know how…",
          "Contenu": "i have not had time to really know how good this antivirus is,i scored 2 stars because i am upset how they said 19 dollars total protection,even password manager,but yet when i started it kept saying to get this and that add more money and more money and more money,i had to decline most but i DID have to add another 9 dollars to get password manager,when they said it supposedly was included on the 19 dollar price,if i had added all they ended up not covering,oh my,it would have cost way over 19 dollars,so i am not a happy camper right now,i was going to get kaspersky for 40 dollars,but i chose this instead because i thought i got all protection for 20 dollars less,now i don't think i have near as much protectioon as i thought i would,should have went ahead and paid 40 for the other protection,that told the truth"
        },
        {
          "Note": 2,
          "Lieu": "HR",
          "Pseudo": "Jurica Margitic",
          "Nb_Reviews": 2,
          "Date": "2021-05-06T19:43:34.000Z",
          "Titre": "To much bully on buy this buy that",
          "Contenu": "To much bully on buy this buy that, and in the middel of cleaning process , while not completed actualy, asking to rate your product. I payed it , let me live."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Brenda Butt",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T14:35:37.000Z",
          "Titre": "I have cleared my computer out of all… I dont use",
          "Contenu": "I have cleared my computer out of all the stuff I don't use and its still very slow and carnt play most of my games  please help and tell me what to do"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Rusty",
          "Nb_Reviews": 1,
          "Date": "2021-08-09T22:00:28.000Z",
          "Titre": "no facility to programe scan times",
          "Contenu": "no facility to program scan times. you can only chose weekly, monthly etc not a time of day or night that is convenient to the user."
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Jose Francisco Rebola Casaleir",
          "Nb_Reviews": 4,
          "Date": "2020-11-08T09:50:06.000Z",
          "Titre": "recurrent system error",
          "Contenu": "recurrent system error, or connection or whatever,...webshild off all the time, system scan error many times,...very bad ....."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donald Guerrettaz",
          "Nb_Reviews": 3,
          "Date": "2021-09-04T21:58:59.000Z",
          "Titre": "Mislead.",
          "Contenu": "Service prompts not very user friendly. Was informed of automatic renewal at 10X the price AFTER paying."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 3,
          "Date": "2021-01-26T17:50:42.000Z",
          "Titre": "I didn't like the autopay feature that…",
          "Contenu": "I didn't like the autopay feature that I cannot turn off. This makes we not want to use this program...at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Paul Gargis",
          "Nb_Reviews": 1,
          "Date": "2020-04-14T22:37:34.000Z",
          "Titre": "When I scan to find temp files and then…",
          "Contenu": "When I scan to find temp files and then click on clean, the same file keeps coming back, it does not eliminate the file!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary Delsohn",
          "Nb_Reviews": 2,
          "Date": "2020-07-14T11:59:54.000Z",
          "Titre": "It locks up my system and slows it down…",
          "Contenu": "It locks up my system and slows it down to a snail's pace when it's scanning, etc.  This is a real drawback."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Roger Philpott",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T12:37:19.000Z",
          "Titre": "Just fed up trying to connect VPN and…",
          "Contenu": "Just fed up trying to connect VPN and getting different messages and this is after reporting to PC Protect twice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Georgina Abrahams",
          "Nb_Reviews": 1,
          "Date": "2021-05-30T17:14:27.000Z",
          "Titre": "1.The App keep on crashing",
          "Contenu": "1.The App keep on crashing2.I can't connect to VPN 3.My connection is waiting on Wifi,why??"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Ronnie Nauendorf",
          "Nb_Reviews": 1,
          "Date": "2021-02-21T05:16:16.000Z",
          "Titre": "This program has not made my computer…",
          "Contenu": "This program has not made my computer any better. If anything it is running very poorly."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jueid",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T03:43:59.000Z",
          "Titre": "It allowed spyware or mallware that…",
          "Contenu": "It allowed spyware or mallware that disabled many of my programs so it did not protect my pc"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Peter Davis",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T00:52:57.000Z",
          "Titre": "did not like them trying to sell you a…",
          "Contenu": "did not like them trying to sell you a bunch more stuff after you download the main program"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T16:26:25.000Z",
          "Titre": "does not do what I paid for",
          "Contenu": "does not do what I paid for. asked for help, got nowhere with that."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Wayne Brown",
          "Nb_Reviews": 1,
          "Date": "2021-03-03T17:12:33.000Z",
          "Titre": "My VPN keeps disconnecting when im…",
          "Contenu": "My VPN keeps disconnecting when im online! it keeps freezing often"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "cc",
          "Nb_Reviews": 1,
          "Date": "2020-01-25T23:27:00.000Z",
          "Titre": "Real Time protection does not work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JAMES C",
          "Nb_Reviews": 1,
          "Date": "2020-07-16T05:07:03.000Z",
          "Titre": "VPN WONT STAY ON"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Stuart",
          "Nb_Reviews": 5,
          "Date": "2020-02-19T22:44:57.000Z",
          "Titre": "Ish..",
          "Contenu": "Not good at all"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ian Bellingham",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T07:02:59.000Z",
          "Titre": "JUST GETTING STARTED",
          "Contenu": "JUST GETTING STARTED  -  SUBJECT TO REVISION"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Anluise",
          "Nb_Reviews": 14,
          "Date": "2021-12-27T09:30:37.000Z",
          "Titre": "I have just installed PC Protect",
          "Contenu": "I have just installed PC Protect and am in the process of my first scan.One of the options is to 'clear tracking cookies'.   This is proving impossible because it insists I close Microsoft Edge first.  I am not running Micrsoft Edge.  My browsing window is closed !!!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Dawn Sheldon",
          "Nb_Reviews": 1,
          "Date": "2021-08-22T03:15:14.000Z",
          "Titre": "I have had your product running the…",
          "Contenu": "I have had your product running the whole time and yet i have something that keeps popping up telling me my subscription has expired and that i need to renew or uninstall. I have to select one of these options or i am unable to move on or leave. I have contacted your office. M y subscription is paid . What ever has happened your protection has allowed it through :("
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "J.A.",
          "Nb_Reviews": 1,
          "Date": "2021-07-01T16:28:18.000Z",
          "Titre": "Initialisation of",
          "Contenu": "I have just engaged with the above protection and do hope it prevents access from opportunists seeking a return from private files etc. I use a tablet, within an apartment/flat and worry that signals can be compromised. Plus, my phone, although it has received the Pc Protect download, due to it not having a WiFi connection, it is not connected and providing my phone with the advertised protection."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dora Lerch",
          "Nb_Reviews": 4,
          "Date": "2021-04-25T17:01:07.000Z",
          "Titre": "1./I don't believe it 'Trustpilot' is…",
          "Contenu": "1./I don't believe it 'Trustpilot' is really a place of 'trust'.2./ To buy 'pcprotect -  after my experience  - not well organized, or the automatic system unusual and not the best.3./I found the system similarity with TotalAV system but yours must be older.4./I would like to see if your system is a 'safety one' .Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kenneth R  Buchanan",
          "Nb_Reviews": 1,
          "Date": "2021-12-19T08:32:48.000Z",
          "Titre": "my web shield has been dissabled since…",
          "Contenu": "my web shield has been dissabled since i installed pc protect. it has a butten to click to inable it, but it doesn't do it. i've called the number on the site and get no help. no person can be reached. i will not renew when my time is up."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "ZarkosianUser User",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T12:13:14.000Z",
          "Titre": "Every time my computer updates,after…",
          "Contenu": "Every time my computer updates,after the update finishes,a message comes up,telling me my subscription is expired.then I have to relog,and sometimes it accepts my password,and more times it dose not.then I have to reset my password.This is getting to be annoying,,,,and it cause me to wonder if something was to happen during the update,would pcprotect be lost entirely?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "David Neufeld",
          "Nb_Reviews": 1,
          "Date": "2022-01-04T16:54:59.000Z",
          "Titre": "It seems to be taking care of the…",
          "Contenu": "It seems to be taking care of the viruses; but not the flood of emails from McAfee, Norton, Microsoft Edge and other that tell me my computer is in danger or is actually infected.  How can I get rid of them?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mila Ranovic",
          "Nb_Reviews": 2,
          "Date": "2020-10-01T19:04:53.000Z",
          "Titre": "They advertised that other devices…",
          "Contenu": "They advertised that other devices would be protected on the same program, but at the end I had to pay extra for that, and then when I downloaded it on my iPhone they still wanted me to buy yet another program to keep it protected??!! Not very honest, but then this seems to be the norm lately."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Marianne Carnell",
          "Nb_Reviews": 10,
          "Date": "2021-03-27T08:00:51.000Z",
          "Titre": "First impressions",
          "Contenu": "Well, as a novice, I have to trust you. But seeing your photos deleted, with no explanation as to why, can be scarey ! You have to then search for everything that was important to you, to see if it's still there or deleted. A bit scarey !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Shaffer",
          "Nb_Reviews": 1,
          "Date": "2020-03-18T02:53:17.000Z",
          "Titre": "before I purchased product the…",
          "Contenu": "before I purchased product the repetitive pop ups one after other for up to 5/4 times was so obnoxious and invasive I almost chose a different service. To aggressive on sell. I'll use for this year and see if I see if customer service privacy takes a turn.  thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "William Laffen",
          "Nb_Reviews": 2,
          "Date": "2020-06-01T17:14:38.000Z",
          "Titre": "You have some serious issues with…",
          "Contenu": "You have some serious issues with customer service. Because of the incompetence of your customer service personnel and their insulting attitudes you nearly lost my business. I seriously suggest you do some training and/or some firings."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Daddy Rich",
          "Nb_Reviews": 1,
          "Date": "2021-11-13T22:15:36.000Z",
          "Titre": "Not bad",
          "Contenu": "Not bad, but when it scans for viruses it slows down the computer and does not allow the user to delay the scan or put it on a timed scan. Fix that and it would get a higher rating."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michael Edwards",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T23:04:29.000Z",
          "Titre": "i only rated it a 3 cuz sometimes when…",
          "Contenu": "i only rated it a 3 cuz sometimes when i click on the icon to scan theres a ........Your not protected ....And i have to click on it to get protected again.So i have to check my pc protect account everyday and its annoying"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaimes",
          "Nb_Reviews": 2,
          "Date": "2020-12-14T02:04:40.000Z",
          "Titre": "I tried to run a \"virus scan\" but it…",
          "Contenu": "I tried to run a \"virus scan\" but it seems like that option is no longer available. I was only able to run a \"malware\" scan. Good, but not good enough. What happened to the virus scan feature ? ?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "L Young",
          "Nb_Reviews": 2,
          "Date": "2021-11-22T20:09:31.000Z",
          "Titre": "I haven\"t got PC Protect for the past 4…",
          "Contenu": "I haven\"t got PC Protect for the past 4 months. I think my subscription is in effect, I maybe wrong  or is already expired. i try to contact customer service with no luck."
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Hayden Browne",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T16:13:16.000Z",
          "Titre": "This is good",
          "Contenu": "This is good, but they make it hard to turn off renewal payments,and though they have your email I never get a message warning me,this is partly my fault. But I have memory issues,the other thing is if I had a keyboard come up when you're banking,as to protect your password. I tried other programs,only a few are better than this one, is is pretty good, the other programs are very expensive and russian made, also there is no number for me to ring in new zealand, to get direct help,the closest is Australia,other than those two issues I would otherwise give it a rating of 5 stars,as the price is very reasonable,and it very easy to use.Once again being in new zealand our dollar is low so say 60 american  dollars is about just over double."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "R W FORREST",
          "Nb_Reviews": 24,
          "Date": "2020-11-22T15:38:44.000Z",
          "Titre": "On start up it disconnects me from WIFI…",
          "Contenu": "On start up it disconnects me from WIFI ? PC PROTECT never contacts me and has failed to ass is in installing in my Ipad and phone . Failed to offer the key numbers ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Martinez",
          "Nb_Reviews": 3,
          "Date": "2020-04-20T21:12:48.000Z",
          "Titre": "Anticipate Score Going Up - Just Installed",
          "Contenu": "I'm new so I'm still figuring this out.  I'm sure the score will go up over time.  So far, it looks great but I am always cautious in my ratings...Idk."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jim Salter",
          "Nb_Reviews": 2,
          "Date": "2020-02-03T02:25:10.000Z",
          "Titre": "I just picked up my computer from…",
          "Contenu": "I just picked up my computer from repair shop, was told  my BIOS was corrupted, my PC protection was not giving me enough protection from virus's and malware ."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Vince Ford",
          "Nb_Reviews": 4,
          "Date": "2020-02-04T23:01:13.000Z",
          "Titre": "not iron clad protection that I thought I purchased",
          "Contenu": "Just had the Microsoft scam on my laptop alarms  and all frozen up computer,telling me to call a number ..yea right ,had to do a hard boot up to get back up."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "pierre coulombe",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T17:06:33.000Z",
          "Titre": "i just got gouged for my automatic…",
          "Contenu": "i just got gouged for my automatic renewal. my wife just got the same treatment from mcaffee. this price gouging will cost both our business."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Mick Turnbull",
          "Nb_Reviews": 1,
          "Date": "2021-04-06T02:24:13.000Z",
          "Titre": "It can take up to 6-8 times to get onto…",
          "Contenu": "It can take up to 6-8 times to get onto the VPN as my email comes back saying system error ? Sorry the message is Send Rec error ?"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Steven Grd",
          "Nb_Reviews": 1,
          "Date": "2022-02-16T06:01:27.000Z",
          "Titre": "Have to pay for extras",
          "Contenu": "Have to pay for extras, come on just include them or don't have them.  Lots of competition out there!"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Mrs Stella Parnell",
          "Nb_Reviews": 21,
          "Date": "2021-06-20T10:37:00.000Z",
          "Titre": "Still trying to work out how to get…",
          "Contenu": "Still trying to work out how to get passwords to store for me, some do, some don't. Taking a while to adjust."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Moseley",
          "Nb_Reviews": 1,
          "Date": "2021-05-27T01:18:00.000Z",
          "Titre": "I started using PC Protect about a…",
          "Contenu": "I started using PC Protect about a month/month and a half ago.  At first, FIVE STARS!!!  I set it up, I installed it on all my devices, I scanned, I checked, I did all the things a \"home admin\" that works for a computer software company is supposed to do.  I even went so far as to get the Identity Protection Plan and it helped me locate an ex wife that means harm and make sure that MY DATA was protected and that I was doing the necessary things to keep HER out of mine and my family's life.  Well, it came time to check up on the ID Protection.  Consistently now, I get and error message when connecting.  I e-mailed support.  I spend all day on the phone so I won't call.  I heard back only to provide what was asked for in the way of exact messages and screen shots and have heard NOTHING.  Absolutely NOTHING.  I'll give you the protection of the PC part of what your software does.  But I won't vouch for your ID Protection piece because you won't respond to my e-mail messages.  Let's just say I'm a bit disappointed and I will be seeking other protection when the time comes and that will be very soon."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Teresa",
          "Nb_Reviews": 4,
          "Date": "2020-12-24T20:32:44.000Z",
          "Titre": "did not receive an invoice to state…",
          "Contenu": "did not receive an invoice to state which PC Protect I received. would like to upgrade but can't seem to do so."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kirsten Broadhead",
          "Nb_Reviews": 2,
          "Date": "2021-07-25T07:35:29.000Z",
          "Titre": "I trust this app with all of my…",
          "Contenu": "I trust this app with all of my financial info. So far so good(fingers crossed).Thanks so much PcProtect!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Choisays",
          "Nb_Reviews": 6,
          "Date": "2020-08-04T15:03:10.000Z",
          "Titre": "malware scan come on when it is the…",
          "Contenu": "malware scan come on when it is the least convenient. Slows down or stops all my action....need options for timing!!!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Graeme",
          "Nb_Reviews": 2,
          "Date": "2021-03-11T10:27:03.000Z",
          "Titre": "would b 4 or 5 but i couldn't easily…",
          "Contenu": "would be 4 or 5 but i couldn't find how to check if my av definitions were up to date or how to update them"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "ken tyson 14yr customer",
          "Nb_Reviews": 2,
          "Date": "2021-12-04T09:06:23.000Z",
          "Titre": "new pc pay up front for pc protect,keep…",
          "Contenu": "new pc pay up front for pc protect,keep getting message popup saying pc proctect about to expire"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Angela Ji Zhu",
          "Nb_Reviews": 2,
          "Date": "2022-04-10T09:58:46.000Z",
          "Titre": "Thank you for your program",
          "Contenu": "Thank you for your program. Hopefully my PC will perform more reliable and easy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phuong Nghi",
          "Nb_Reviews": 2,
          "Date": "2021-05-16T02:30:00.000Z",
          "Titre": "The program keeps signing out on my…",
          "Contenu": "The program keeps signing out on my devices and asks to restart for fully install. Don't know why."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Desiare Duplechan",
          "Nb_Reviews": 2,
          "Date": "2021-01-04T17:01:11.000Z",
          "Titre": "It is simple to read and easy with a few concerns",
          "Contenu": "It keeps telling me to close Google Chrome and it is closed,  other than that it is a decent program"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J.B.",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T18:44:35.000Z",
          "Titre": "No tray icon to confirm ongoing VPN connection",
          "Contenu": "No tray icon showing ongoing VPN connection.  VPN has lost connection on several occasions."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Scott",
          "Nb_Reviews": 51,
          "Date": "2019-09-30T15:36:52.000Z",
          "Titre": "Always looking for money for some add on or another",
          "Contenu": "Took out PC Protect as a new antivirus but everytime I try to do something there is always a charge"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David A Pfeifer",
          "Nb_Reviews": 2,
          "Date": "2020-09-30T04:26:48.000Z",
          "Titre": "i have had other services you keep…",
          "Contenu": "i have had other services you keep asking for more $$$ will end as soon as it runs out"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Malcolm Jackson",
          "Nb_Reviews": 4,
          "Date": "2021-06-21T17:33:13.000Z",
          "Titre": "slow keep having to setup every time…",
          "Contenu": "slow keep having to setup every time turn on and go on internet.avg was easier"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Dj Harvey",
          "Nb_Reviews": 1,
          "Date": "2021-10-12T21:44:28.000Z",
          "Titre": "too early for me to write a review…",
          "Contenu": "too early for me to write a review without any experience with the product"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "diane stones",
          "Nb_Reviews": 14,
          "Date": "2022-02-15T13:34:25.000Z",
          "Titre": "I only put 3 stars as its all new at…",
          "Contenu": "I only put 3 stars as its all new at the moment, so far so good"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bee",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T18:43:27.000Z",
          "Titre": "Just downloaded and getting started",
          "Contenu": "Just downloaded and getting started. Too soon to give a real rating."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tucker",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T19:57:07.000Z",
          "Titre": "Not had this long enough to give a fair…",
          "Contenu": "Not had this long enough to give a fair evaluation."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Jason Douglas",
          "Nb_Reviews": 2,
          "Date": "2021-10-12T20:00:12.000Z",
          "Titre": "So far so good",
          "Contenu": "So far, so good. Just need to see how this all plays out......."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rocky Childress",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T21:22:17.000Z",
          "Titre": "i just paid for pcprotect 2hrs ago and…",
          "Contenu": "i just paid for pcprotect 2hrs ago and my password is not working"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joanne C",
          "Nb_Reviews": 2,
          "Date": "2020-05-22T01:05:28.000Z",
          "Titre": "No instructions or guidance for use",
          "Contenu": "No instructions or guidance for use!  I am flying blind here!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lloyd Zufelt",
          "Nb_Reviews": 1,
          "Date": "2021-04-24T23:05:31.000Z",
          "Titre": "Just got it installed",
          "Contenu": "Just got it installed. A little early for a review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marion Dutcher",
          "Nb_Reviews": 1,
          "Date": "2020-11-05T19:22:26.000Z",
          "Titre": "haven't used it so therefore only 3…",
          "Contenu": "haven't used it so therefore only 3 stars!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "User User",
          "Nb_Reviews": 2,
          "Date": "2020-04-28T14:08:49.000Z",
          "Titre": "just downloaded  have not had time to…",
          "Contenu": "just downloaded  have not had time to evaluate"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Raymond Rose",
          "Nb_Reviews": 2,
          "Date": "2020-01-29T20:28:22.000Z",
          "Titre": "installed and come  with safe hand and…",
          "Contenu": "installed and come  with safe hand and frozen"
        },
        {
          "Note": 3,
          "Lieu": "NZ",
          "Pseudo": "Mahesh Manthalkar",
          "Nb_Reviews": 1,
          "Date": "2021-04-01T23:06:38.000Z",
          "Titre": "Good One",
          "Contenu": "Money well spent and easy to download"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "George Townsend",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T05:34:46.000Z",
          "Titre": "just installed",
          "Contenu": "just installed. will do review later."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Rowena Robinson",
          "Nb_Reviews": 1,
          "Date": "2021-11-13T03:23:29.000Z",
          "Titre": "No comment",
          "Contenu": "No comment at this time"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jim Cavalier",
          "Nb_Reviews": 4,
          "Date": "2021-07-17T14:42:02.000Z",
          "Titre": "Very expensive   works  ok"
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "CHRIS KOKKINOS",
          "Nb_Reviews": 1,
          "Date": "2020-01-30T06:37:49.000Z",
          "Titre": "there is no greek language"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Grant Woodberry",
          "Nb_Reviews": 1,
          "Date": "2020-02-16T11:26:29.000Z",
          "Titre": "good experience so far?.'.",
          "Contenu": "good experience so far?."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Edward Harrington",
          "Nb_Reviews": 1,
          "Date": "2020-04-02T13:15:14.000Z",
          "Titre": "quite happy with things"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Philip Palinkas",
          "Nb_Reviews": 1,
          "Date": "2021-02-17T19:07:33.000Z",
          "Titre": "too soon to evaluate"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Joan Murray",
          "Nb_Reviews": 2,
          "Date": "2020-01-30T00:08:56.000Z",
          "Titre": "pc seems a lot slower"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Neil Underwood",
          "Nb_Reviews": 4,
          "Date": "2023-02-14T19:27:24.000Z",
          "Titre": "Free Adcopy",
          "Contenu": "My one star was originally for annoying me with a inconvenient popup asking \"rate your recent experience\"Aside from that I give PCProtect four stars for offering high value at a low price.It's unlikely anything can protect us from our own stupidity. ....Such as mistaking guidelines for suggestions. Definitely recommended as a budget conscious choice over the more expensive options.  I had not read the other one star reviews when I subscribed at $20 for a year.Had I known how frequently the billing department overcharged, I doubt I would have risked even what I did.  So far nothing bad to report. I'll update this to five stars if there are no issues a year from now."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Asif Sheikh",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T12:33:46.000Z",
          "Titre": "Good",
          "Contenu": "good and fantastic"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Parker",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T23:07:41.000Z",
          "Titre": "very good job cleaning my pc. well needed and appriecated",
          "Contenu": "v3ry good and efficient program. gets the job done"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Nestor",
          "Nb_Reviews": 3,
          "Date": "2021-12-14T23:35:47.000Z",
          "Titre": "I like what the product did in clearing up BUT . . .",
          "Contenu": "I like what the product did in clearing up my files.  However getting the download to work took several tries as the website focused on upselling rather than completing the download. If this works well over the next year I might consider the more expensive versions but don't try to sell me more when I haven't had the chance to try the first level."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Billy Bradshaw",
          "Nb_Reviews": 2,
          "Date": "2021-09-15T23:26:23.000Z",
          "Titre": "Good but could be heaps more useful",
          "Contenu": "I tend to have really good service. If I ever have a problem, the tech team is quick to respond however I've been found to pay more for extras like VPN and when I try to use it on public servers, it won't connect however it connects when I'm on my home internet. I'd like to see more work done with the VPN use."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Miss S.J.Elliott",
          "Nb_Reviews": 12,
          "Date": "2021-05-02T14:08:34.000Z",
          "Titre": "I'm very happy with the protection I…",
          "Contenu": "I'm very happy with the protection I get for what I pay, but almost every time I turn on, there is  'suggestion' for further protection requiring more money. I get why for people who use their computer a lot or for business, but for small users like me there should be a basic, comprehensive package without the constant pressure to add more.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "siri smith",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T10:37:44.000Z",
          "Titre": "pc-protect Antivirus Reviews",
          "Contenu": "Formerly, there was no shortage of free antivirus software providers. However, off late, most antivirus services are premium and require a subscription or one-time purchase. Antivirus is the go-to solution to fight malicious software and viruses. Since, finding the right antivirus can be daunting, especially because of the overwhelming number of options available in the market, here you can compare free antivirus reviews, to help you choose the best one.antivirus.lenoxtons20"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Power.",
          "Nb_Reviews": 1,
          "Date": "2021-09-05T13:27:40.000Z",
          "Titre": "Nice, But Improvement needed",
          "Contenu": "Nice, Useful antivirus software. But i dislike the constant pop-ups of buying premium for PC Protect. And the directions to the payment page. And if you could put some premium protections for free, would be really good. And increase premium trial time. Thanks alot"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joyce Macpherson",
          "Nb_Reviews": 1,
          "Date": "2021-01-14T02:26:31.000Z",
          "Titre": "Why I did not give you 5 stars",
          "Contenu": "Why can't I access my bank accounts and try and do research on various things now. I keep getting the web site search-land.com and your company deletes this. This problem just started on Jan 1, 2021 - I did not have this problem before i.e.2016, 2017, 2018, 2019 2020, why now? If this is a virus or malware, can you not get rid of it? or else tell me how I can get rid of it, outside of getting a new computer which I cannot afford.I am getting very frustrated that I cannot access my programs.  Please advise.Joyce MacPherson"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GLORIA JEAN",
          "Nb_Reviews": 4,
          "Date": "2019-09-18T04:32:44.000Z",
          "Titre": "2 issues",
          "Contenu": "2 issues: 1. Why doesn't the VPN feature start automatically? This feature is needed every time the internet is used- so why doesn't it load automatically? 2. duplicate photo function is an unwanted feature and it should be able to be disabled.  Many photos were deleted at initial set up which caused issues. Other than that, I like the program."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T17:23:18.000Z",
          "Titre": "Good",
          "Contenu": "It's really, good! It has protected my PC from lots of threats.I'm a bit disappointed for whole junk cleaning thing you've got to pay and all but yea it's good, when you aren't willing to pay."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Fox",
          "Nb_Reviews": 1,
          "Date": "2019-06-21T01:41:33.000Z",
          "Titre": ":) :)",
          "Contenu": "It took 2 days to get rid of the viruses in my PC. First day it kept shutting my Pc down before it would complete a scan tried 3 full scans and 3 short scans. Removed and reinstalled PC Protect as instructed. It took over 24 hrs for a short scan to remove 2 viruses. Going to run a full scan next."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "User User",
          "Nb_Reviews": 1,
          "Date": "2020-06-05T10:55:32.000Z",
          "Titre": "I feel secure when I SURF ON internet…",
          "Contenu": "I feel secure when I SURF ON internet thanks I have got PC protect. My Pc was plenty of spy programes that's consumes lot of energy from my PC but now the speed is much better. Tha's the reason why I think is a fantastic antivirusses \"PC Protect\""
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barb Wells",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T20:34:57.000Z",
          "Titre": "I highly recommend PC Protect",
          "Contenu": "I highly recommend PC Protect. The only reason I didn't give it 5 stars is because you have to pay for some of the things that I feel should already be included in your subscription. Besides, there's always room for improvement, no matter who or what you are."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Peter Kay",
          "Nb_Reviews": 12,
          "Date": "2019-10-29T16:44:51.000Z",
          "Titre": "In the past it has been excellent but…",
          "Contenu": "In the past it has been excellent but tried to move it to a new computerit would not let me do it. I have had to set up new contract but my old one was still to run till June 2020, when my husbands runs out I will cover him on my new one. I do trust PC Protect."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Paul Hood",
          "Nb_Reviews": 1,
          "Date": "2021-04-11T17:20:54.000Z",
          "Titre": "The duplicate file program could be…",
          "Contenu": "The duplicate file program could be more useful if it gave the option to delete the duplicates and just leave the original file....as it is i find it confusing and rather hesitant to go ahead with confidence and delete."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jayaratnam Santiago",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T21:49:12.000Z",
          "Titre": "It couldnot detect connected internet…",
          "Contenu": "It couldnot detect connected internet on my for two days, while other internet apps were running. This proves the inefficiency of the app. Anyway I paid for the app because adequate discount is offered. Will see."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr John Leech",
          "Nb_Reviews": 15,
          "Date": "2020-11-02T14:48:14.000Z",
          "Titre": "problems with installation resolved…",
          "Contenu": "problems with installation resolved after 1 hour with remote access , although remote access appeared to do the same as i did i.e uninstall PC programme and reinstall,however it was installed and is working"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Lehman",
          "Nb_Reviews": 2,
          "Date": "2021-12-15T04:41:32.000Z",
          "Titre": "This is the first time I have us the pc…",
          "Contenu": "This is the first time I have us the pc protect scene redown loading program.  I need some time to learn more about the protect before giving a rating of five starts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James D. Jensen",
          "Nb_Reviews": 2,
          "Date": "2020-02-14T19:45:04.000Z",
          "Titre": "Review",
          "Contenu": "While this protection program runs semi-slow, other programs tend to run much faster. I will hold my judgement for now, as I believe that right after I've installed the program is too soon to make comments."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Browning",
          "Nb_Reviews": 2,
          "Date": "2021-05-16T22:13:30.000Z",
          "Titre": "You people are on top of your game",
          "Contenu": "You people are on top of your game. I been with you 4 almost 2 years and I'm more and more impressed because of how you handle your BS NSS> Thank You 4 B N you! Kenneth Browning"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gordon",
          "Nb_Reviews": 3,
          "Date": "2021-03-06T12:08:05.000Z",
          "Titre": "When I try to purchase UK lottery…",
          "Contenu": "When I try to purchase UK lottery ticket via internet I set my VPN to UK.unfortunately I can not purchase ticket as the on line ticket office thinks I'm not in the UK.G Fowlds"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "R Cerezo",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T02:02:34.000Z",
          "Titre": "Its good",
          "Contenu": "Its alright for for my Protection, But I don't like that you have to pay the subscription for the program to project you from malaware."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Frank Ly Tran",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T12:56:39.000Z",
          "Titre": "Did not work at the start because it…",
          "Contenu": "Did not work at the start because it couldn't let me run real time protection at first because of some error until I bought Guardio afterwards."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Hannah Francis",
          "Nb_Reviews": 5,
          "Date": "2018-02-25T11:39:55.000Z",
          "Titre": "Perfect for students.",
          "Contenu": "My flat mate from uni has recommended this after my previous laptop breaking. installing it was fairly easy and he said it also protects me as our uni wifi is open for hackers to steal my banking info..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Littrell",
          "Nb_Reviews": 1,
          "Date": "2019-06-19T17:02:05.000Z",
          "Titre": "I find it hard to update when told…",
          "Contenu": "I find it hard to update when told outdated.   either can't get it to update or seems to mess system up and I have to spend time getting it back to normal. otherwise very pleased with service."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Fred Murphy",
          "Nb_Reviews": 9,
          "Date": "2020-01-25T14:28:15.000Z",
          "Titre": "Cleaning up \"duplicates\" is confusing",
          "Contenu": "Cleaning up \"duplicates\" is confusing. Are these files real \"duplicates\" or do they contain \"original\" files? I am not confident enough to delete them."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Yan",
          "Nb_Reviews": 5,
          "Date": "2020-07-04T14:44:43.000Z",
          "Titre": "so far so good ..",
          "Contenu": "so far so good ... only been using PC protect for a couple of months but they seem to be on the ball ..... very pleased !If they go on like this I could go for 5 starts ...."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jeffrey",
          "Nb_Reviews": 3,
          "Date": "2021-09-01T09:53:52.000Z",
          "Titre": "glad to have come back to PC Protect",
          "Contenu": "glad to have come back to PC Protect, they were very good at keeping an eye on my PC. I just could not afford them at that time, so went else where."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Adriel Carlo",
          "Nb_Reviews": 1,
          "Date": "2021-04-30T01:52:01.000Z",
          "Titre": "the send you notifications to upgrade…",
          "Contenu": "the send you notifications to upgrade to pro and it gets you killed when playing games but they tell me everything that is wrong and I really like them them"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Potnah",
          "Nb_Reviews": 2,
          "Date": "2021-04-30T21:41:21.000Z",
          "Titre": "The program is very powerful and on…",
          "Contenu": "The program is very powerful and on point!  I stopped short of 5 stars as I want 60 days or so the see how it works with my various programs and websites."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Josephine",
          "Nb_Reviews": 3,
          "Date": "2021-12-26T01:46:06.000Z",
          "Titre": "I am very pleased with the PC Protect…",
          "Contenu": "I am very pleased with the PC Protect programme as it is comprehensive, good value for money and very easy to use. Thank you. Josephine"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RENEE",
          "Nb_Reviews": 1,
          "Date": "2020-02-25T22:18:30.000Z",
          "Titre": "IVE JUST BOUGHT THIS PRODUCT AND AM…",
          "Contenu": "IVE JUST BOUGHT THIS PRODUCT AND AM RUNNING A SYSTEM SCAN NOW.  I GAVE IT FOUR STARS BECAUSE I THINK I WILL LIKE IT, BUT TOO EARLY, REALLY, FOR ME TO KNOW FOR SURE."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Winston Siebel",
          "Nb_Reviews": 1,
          "Date": "2021-03-29T07:09:51.000Z",
          "Titre": "Easy to install and looked to be able…",
          "Contenu": "Easy to install and looked to be able to do all protections I was looking for.PC Protect is replacing another ant virus I previously had installed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Thomas C Roginski",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T01:56:45.000Z",
          "Titre": "Good program but missing parts.",
          "Contenu": "From what i was told, i have no idea what is included and what is not in the program.i purchased. It implied all were included. I found a number not included."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "GLENN BOOKER",
          "Nb_Reviews": 1,
          "Date": "2019-06-21T07:56:08.000Z",
          "Titre": "having just purchased it and run it i…",
          "Contenu": "having just purchased it and run it i am not sure of its effects on everything...but i do know that while it's running i cant use caps on my keyboard."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Terrence O'leary",
          "Nb_Reviews": 2,
          "Date": "2021-06-20T05:59:33.000Z",
          "Titre": "had a problem with install and lost…",
          "Contenu": "pcprotect had a problem with install and lost connection to internet had to do a recovery  and in stall again not all installed yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra",
          "Nb_Reviews": 3,
          "Date": "2022-01-09T23:12:46.000Z",
          "Titre": "This is my first time using it  It is a…",
          "Contenu": "This is my first time using it  It is a little cumbersome to use but then again I am not tech savvy  so far so good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven  Cray",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T12:48:13.000Z",
          "Titre": "i have been trying to get vpn help on…",
          "Contenu": "i have been trying to get vpn help on my mobile with no help or contact from pc protrect. other then that the program is working great"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Chris Manwaring",
          "Nb_Reviews": 12,
          "Date": "2020-11-01T17:01:32.000Z",
          "Titre": "Got it working eventually",
          "Contenu": "Got it working eventually. Make sure you remove previous virus guard first. Can't see a way to scan my computer for viruses."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Walter_A",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T22:08:21.000Z",
          "Titre": "Finished first scan",
          "Contenu": "Finished first scan. Eay install, clean interface and doesn't seem to be a resource hog. Will update after some use."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ward  Cox",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T20:42:04.000Z",
          "Titre": "Good Performance in locating spyware…",
          "Contenu": "Good Performance in locating spyware ,etc but quick scan seem to take a long time, have not been able to speed up theis scan"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry Williams",
          "Nb_Reviews": 2,
          "Date": "2021-01-28T12:21:25.000Z",
          "Titre": "Excellent product-Duplicate File in Question",
          "Contenu": "Excellent product. I understand the duplicate file search it does but do not understand which duplicate to remove."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 2,
          "Date": "2019-07-11T18:18:41.000Z",
          "Titre": "The only reason it's 4 stars right now…",
          "Contenu": "The only reason it's 4 stars right now is that I just got it and am using it for the first time but so far so great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mesgana",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T00:43:40.000Z",
          "Titre": "Mesgana review",
          "Contenu": "it cleaned all of my trash but it made me pay twice I would give this a five star If it hadn't  made pay twice."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lynn B.",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T18:39:13.000Z",
          "Titre": "Love the simplicity of using this…",
          "Contenu": "Love the simplicity of using this anti-virus.  I also like the extras that help you stay on top of security."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LAP",
          "Nb_Reviews": 2,
          "Date": "2020-05-11T19:11:26.000Z",
          "Titre": "The identity theft disappeared",
          "Contenu": "The identity Protection under the fingerprint icon disappeared a few times. That was freaky. But it came back up."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. L. Roberson",
          "Nb_Reviews": 3,
          "Date": "2020-12-24T01:35:28.000Z",
          "Titre": "Nothing is ever as good as claimed",
          "Contenu": "Nothing is ever as good as claimed, too much hustling in trying to get customers to pay for more products."
        },
        {
          "Note": 4,
          "Lieu": "PR",
          "Pseudo": "Luis E. Colon",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T22:11:58.000Z",
          "Titre": "Thanks when I use the PCPROTEC for a…",
          "Contenu": "Thanks when I use the PCPROTEC for a while I will be able to make a better evaluation of the product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Reeser",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T20:52:09.000Z",
          "Titre": "Makes me feel like my computer is…exceptional",
          "Contenu": "Makes me feel like my computer is functioning at the greatest level possible and i feel a lot more secure."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "PETER BRIGGS",
          "Nb_Reviews": 6,
          "Date": "2020-02-08T12:30:53.000Z",
          "Titre": "same as all other Antivirus software…",
          "Contenu": "same as all other Antivirus software don't accept first price you will be offered a lower price."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Aspeneagle",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T21:37:01.000Z",
          "Titre": "Looks Very Good",
          "Contenu": "Looks Very Good. I Like The Soft. Good Price, with Good VPN. Good at cleaning cookies. Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Frank  McElveen",
          "Nb_Reviews": 2,
          "Date": "2020-06-16T01:45:19.000Z",
          "Titre": "So far PC Protect has done a good job…",
          "Contenu": "So far PC Protect has done a good job protecting my computers.I just renewed for another year."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Matthias Tovo Tasi",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T21:26:30.000Z",
          "Titre": "when we have problem please do ask…",
          "Contenu": "when we have problem please do ask question and update and review your PCPROTECTION Rating,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Larry Walker",
          "Nb_Reviews": 1,
          "Date": "2020-05-05T14:33:42.000Z",
          "Titre": "I just know that I have had no problems…",
          "Contenu": "I just know that I have had no problems on my computer since I signed up with PC Protect."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Kent",
          "Nb_Reviews": 8,
          "Date": "2021-03-02T12:08:04.000Z",
          "Titre": "4 stars",
          "Contenu": "Software great,  Rating them 4 stars because there customer service is not brilliant"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Werner",
          "Nb_Reviews": 5,
          "Date": "2021-01-13T21:55:34.000Z",
          "Titre": "Impressed so far",
          "Contenu": "Im still learning to understand your PC protection package. So far I'm impressed."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Wilks",
          "Nb_Reviews": 9,
          "Date": "2021-03-03T11:57:25.000Z",
          "Titre": "Just downloaded it today",
          "Contenu": "Just downloaded it today, 3rd March so need some more time for a proper evaluation"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alesia White",
          "Nb_Reviews": 7,
          "Date": "2019-07-27T18:59:59.000Z",
          "Titre": "Its pretty good",
          "Contenu": "Its pretty good, I wish it had a way to clean the entire lapto and it would be perfect."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Christophe Fraser",
          "Nb_Reviews": 1,
          "Date": "2020-02-12T11:30:19.000Z",
          "Titre": "The cookies are never completly…",
          "Contenu": "The cookies are never completly cleared. There used to be 1 remaining, recently 3."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Ira Ogatis",
          "Nb_Reviews": 1,
          "Date": "2020-07-14T22:26:52.000Z",
          "Titre": "Thumbs up.",
          "Contenu": "It is a good anti virus software, except it cannot detect and remove Santivirus."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Wilerson",
          "Nb_Reviews": 1,
          "Date": "2020-02-14T00:56:30.000Z",
          "Titre": "It works and not so much money a month…",
          "Contenu": "It works and not so much money a month which I Love Thank You for your Service!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kenneth Egan",
          "Nb_Reviews": 3,
          "Date": "2020-11-06T05:49:57.000Z",
          "Titre": "Clear",
          "Contenu": "Clear. Concise. Straight forward. - necessary for 'silver' operator."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Aurel Nathoo",
          "Nb_Reviews": 6,
          "Date": "2020-12-12T08:43:12.000Z",
          "Titre": "Thanks",
          "Contenu": "Thanks. Easy & defo not a program that slows yours others system files."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Robert Bowman",
          "Nb_Reviews": 8,
          "Date": "2020-06-05T22:01:37.000Z",
          "Titre": "Clear",
          "Contenu": "Clear. Concise. Straight forward. - necessary for 'silver' operator."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teresa Dill",
          "Nb_Reviews": 1,
          "Date": "2020-05-31T05:03:10.000Z",
          "Titre": "Just started with PCprotect",
          "Contenu": "Just started with PCprotect, seems to be working out great, so far pleased."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "V SHARMA",
          "Nb_Reviews": 2,
          "Date": "2021-08-05T19:22:54.000Z",
          "Titre": "Have always used Norton Antivirus but…",
          "Contenu": "Have always used Norton Antivirus but this is simple and effective"
        },
        {
          "Note": 4,
          "Lieu": "DK",
          "Pseudo": "Thomas Bardenfleth",
          "Nb_Reviews": 33,
          "Date": "2021-02-14T00:37:31.000Z",
          "Titre": "Good",
          "Contenu": "Seems to do, what it's supposed to and without slowing down my pc."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Douglas Clement",
          "Nb_Reviews": 13,
          "Date": "2021-10-29T10:33:49.000Z",
          "Titre": "intially works well but too many follow…",
          "Contenu": "intially works well but too many follow ups to increase cover!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Afam Ezekwem",
          "Nb_Reviews": 1,
          "Date": "2021-09-04T14:57:32.000Z",
          "Titre": "The system is now active and runs very smooth, sound.",
          "Contenu": "The system is now active, And it runs very smoothly and sound!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donald E.underwood",
          "Nb_Reviews": 1,
          "Date": "2021-04-21T14:54:15.000Z",
          "Titre": "i am just trying it the first time but…",
          "Contenu": "i am just trying it the first time but it looks good right now."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr J Perry",
          "Nb_Reviews": 15,
          "Date": "2020-03-26T19:42:35.000Z",
          "Titre": "I thought I was getting full protection…",
          "Contenu": "I thought I was getting full protection but does not include a VPN."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wiliam Smith",
          "Nb_Reviews": 2,
          "Date": "2021-04-04T13:34:31.000Z",
          "Titre": "great program but has to many add ons…",
          "Contenu": "great program but has to many add ons you have to pay more for"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T09:32:50.000Z",
          "Titre": "would be 5 stars if it didn't have in-app purchases"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "David J Myles",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T00:05:12.000Z",
          "Titre": "Have not had app long enough to form an…",
          "Contenu": "Have not had app long enough to form an oppinion or make a reveiw"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Brindley",
          "Nb_Reviews": 1,
          "Date": "2022-01-07T14:30:42.000Z",
          "Titre": "I just downloaded it",
          "Contenu": "I just downloaded it. I can not rate it right now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Veronica Monrose",
          "Nb_Reviews": 1,
          "Date": "2020-03-20T15:31:30.000Z",
          "Titre": "I  can rate excellent this has been a…",
          "Contenu": "I  can rate excellent this has been a so said so done thanks ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eugene Berry",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T19:47:10.000Z",
          "Titre": "yes it is very improvement",
          "Contenu": "yes it is very improvement. It is very powerfull away virus."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "User",
          "Nb_Reviews": 1,
          "Date": "2021-05-17T02:01:47.000Z",
          "Titre": "Have only just started to use.Looks…",
          "Contenu": "Have only just started to use.Looks like its a keeper."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwight Williams",
          "Nb_Reviews": 1,
          "Date": "2019-06-17T21:01:11.000Z",
          "Titre": "Had some issues at the start they were…",
          "Contenu": "Had some issues at the start they were quick to resolve them."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "john peterson",
          "Nb_Reviews": 29,
          "Date": "2021-04-21T14:45:30.000Z",
          "Titre": "taken me a long time to sort out this…",
          "Contenu": "taken me a long time to sort out this virus protection"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2021-12-11T22:04:47.000Z",
          "Titre": "really quick service and also convenient to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Teaneck User",
          "Nb_Reviews": 4,
          "Date": "2020-10-29T16:07:13.000Z",
          "Titre": "Good product",
          "Contenu": "Good product.  But constantly trying to sell upgrades."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Viswas Palur",
          "Nb_Reviews": 1,
          "Date": "2020-02-01T05:23:49.000Z",
          "Titre": "2020 review",
          "Contenu": "Don't have many problems with the program right now."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "CHARLES",
          "Nb_Reviews": 13,
          "Date": "2019-06-20T18:49:25.000Z",
          "Titre": "INTERFACE INTUITIVE SEMBLE ETRE UN TRES…",
          "Contenu": "INTERFACE INTUITIVE SEMBLE ETRE UN TRES BON ANTIVIRUS."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Colvin",
          "Nb_Reviews": 68,
          "Date": "2021-10-31T19:55:09.000Z",
          "Titre": "Seems ok at the moment no problems with…",
          "Contenu": "Seems ok at the moment no problems with it"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Fulvio Massimo Mariani",
          "Nb_Reviews": 2,
          "Date": "2021-05-23T22:36:51.000Z",
          "Titre": "nice antivirus",
          "Contenu": "nice antivirus, but a lot of upgrade requests."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Thompson",
          "Nb_Reviews": 1,
          "Date": "2021-02-19T16:58:01.000Z",
          "Titre": "Would give 5 star but VPN does not…",
          "Contenu": "Would give 5 star but VPN does not always work."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Gareth Jones",
          "Nb_Reviews": 3,
          "Date": "2021-12-25T22:38:30.000Z",
          "Titre": "PC Protect has given me peace of mind ,"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Morey",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T22:38:25.000Z",
          "Titre": "Quick Cleanup",
          "Contenu": "Quick CleanupThe Clean up was quick & easy"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "J w",
          "Nb_Reviews": 14,
          "Date": "2021-08-07T10:27:35.000Z",
          "Titre": "just downloaded it so cannot really say…",
          "Contenu": "just downloaded it so cannot really say ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 6,
          "Date": "2022-02-07T19:45:30.000Z",
          "Titre": "Decent and didn’t have any issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J",
          "Nb_Reviews": 6,
          "Date": "2019-07-03T15:08:59.000Z",
          "Titre": "It's decent",
          "Contenu": "It's decent, and its cheap. only 2.99$/month"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "C. Breton",
          "Nb_Reviews": 2,
          "Date": "2021-07-10T18:52:32.000Z",
          "Titre": "Efficace comme anti-virus. Par contre dipendieux annuellement.",
          "Contenu": "Efficace comme anti-virus. Dispendieux"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Helen Griffin",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T20:26:36.000Z",
          "Titre": "Very good",
          "Contenu": "Very good. I trust your progrm. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Shellystar",
          "Nb_Reviews": 6,
          "Date": "2021-07-28T09:34:29.000Z",
          "Titre": "good product does everything I need"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Delphine Miser",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T17:21:17.000Z",
          "Titre": "Just got it seems to be working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eileen",
          "Nb_Reviews": 4,
          "Date": "2020-03-07T01:47:17.000Z",
          "Titre": "Agent was helpful in answering…",
          "Contenu": "Agent was helpful in answering questions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Patrick Hill",
          "Nb_Reviews": 8,
          "Date": "2020-11-27T15:42:39.000Z",
          "Titre": "so far so good",
          "Contenu": "so far so good, clear and easy to use"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shirley S Nagle",
          "Nb_Reviews": 1,
          "Date": "2020-07-04T01:50:24.000Z",
          "Titre": "its worth it",
          "Contenu": "A great deal with great protection!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Reindle",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T18:06:25.000Z",
          "Titre": "THIS APP IS REALLY GOOD!!!",
          "Contenu": "THIS APP IS REALLY GOOD!!! The below information was before I started checking out the features!! There are so many things that I was unaware of!! I was using Microsoft Defender & this works better. I have had 2 ransomware infections that really scared me. The first one was very bad. It didn't allow me any access to my computer/files/restore point. I had to consult a computer guru for that one. I thought the computer was a goner. The second one allowed me access to my task manager. The app that was using the most power was Google. I was able to close that app in the task manager & that fixed it. This app seems to have more features. I am hoping that using a different browser and this app can do the trick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Philip Talerman",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T03:29:28.000Z",
          "Titre": "I have been with PC Protect for at…",
          "Contenu": "I have been with PC Protect for at least two years and found the service excellent and was able to protect 3 separate computers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T23:59:32.000Z",
          "Titre": "No annoying pop ups",
          "Contenu": "Price is right and lets you have more control than other avs,"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Peter Ekro",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T13:13:19.000Z",
          "Titre": "PC Protect routinely scans gets rid of…",
          "Contenu": "PC Protect routinely scans gets rid of all viruses and harmful data. It helps my computer to work perfectly, and I am delighted with this experience!"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Heather Routley",
          "Nb_Reviews": 4,
          "Date": "2023-07-19T03:52:53.000Z",
          "Titre": "I feel confident that PCProtect is doing a good job.",
          "Contenu": "I feel confident that PCProtect is looking after my online safety.  Have just started up an old laptop that hasn't been used in about 3 months and it was straight away scanned and cleaned up. I also like that it is unobtrusive, does what's needed and doesn't keep pestering for an upgrade as some other programmes do."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Chan Cheok",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T03:22:49.000Z",
          "Titre": "Great software",
          "Contenu": "Great software. However, it required internet access to be active."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PJJ",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T16:56:34.000Z",
          "Titre": "The VPN is not offered as an a la carte…",
          "Contenu": "The VPN is not offered as an a la carte option like otheranti virus software. I won't do any future reviews unless you screw up. Tphey are annoying and are a poor substitute for hiring C/S people in terms of providing.customer service. Notwithstanding, your product is excellent.N"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Doug Dares",
          "Nb_Reviews": 4,
          "Date": "2023-04-20T03:27:14.000Z",
          "Titre": "time to retire old files for goodI found old papers anda documents tht I…",
          "Contenu": "I found old papers and documents that I thought were gone and saving me space, but this program come up with files and documents that should have been deleted a long time ago. Very marvellous in the way it gets into the files and cleans them out, so space is not wasted. Trally like all the special functions this program has and helps my computer run a lot more smoother."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Georgia girl",
          "Nb_Reviews": 2,
          "Date": "2023-07-31T16:28:24.000Z",
          "Titre": "I was using another security provider…",
          "Contenu": "I was using another security provider and when I tried PCProtect - their system scanned my computer, cleaned it of over 1000 files and restored space. My computer runs much smoother and faster now."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Colin Mcdonnell",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:40:22.000Z",
          "Titre": "100% reliable and trustworthy",
          "Contenu": "100% reliable and trustworthy. perfect for what I need"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tahni Davis",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T10:03:46.000Z",
          "Titre": "reddit was right 10/10",
          "Contenu": "took a risk listening to someone off Reddit and oh wow was it worth it! what a great program and for such a decent price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Vernieri",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:15:46.000Z",
          "Titre": "Ease of the scan and easy to interpret"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bernardo Carlucci",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T21:50:13.000Z",
          "Titre": "its amazing how much it can do",
          "Contenu": "its amazing how much it can do! its helped me stay away from dangerous sights, cleaned up duplicate files and even gets rid of tracking coockies! and you can still use the computer while it scans!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellie Dimino",
          "Nb_Reviews": 3,
          "Date": "2023-05-09T14:32:08.000Z",
          "Titre": "I had to download and replace this a…HELP NEEDED.......HELP RECEIVED",
          "Contenu": "I had to download and replace PC Protect a few times in the recent weeks.  All due to a failing Hard Drive.   I had absolutely NO problems doing this.  I found PC Protect over the top, UNDERSTANDING, my situation.   I am very pleased with the Service I receive from PC Protect.  THANKS FOR BEING THERE."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jared Phillips",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T19:41:43.000Z",
          "Titre": "Highly Recommended",
          "Contenu": "I've been using the free version of PCProtect for a while and it has been very reliable so I upgraded and their system is super easy to navigate and clears everything you might possibly wanna clear with just a click of a few buttons. The added use of a VPN is also a major bonus. I highly recommend to anyone looking for a reliable source of computer security."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellie Dimino",
          "Nb_Reviews": 3,
          "Date": "2023-05-23T16:09:17.000Z",
          "Titre": "Running their company as it should be.",
          "Contenu": "What is this company  doing well?   JUST ABOUT EVERYTHING.   As I said,  earlier, my computer had technical problems for a while before it Crashed.  I lost PC Protect each time the machine blacked out.  I contacted PC Protect more than once and they guided me through  Downloading  the Program with no muss,  fuss or bother.  For ME, anyway.  No extra charges, no sarcastic  Customer Service nonsense... As of this day 5/23/23 I  had the need to discuss my Subscription for another year, coming.  All done with a Representative ON LINE, helpful  because  my hearing is not good.  The patience shown to me is worth a Gold Medal.  I am, as I told Mr. Reynolds, who assisted me, VERY GRATEFUL for the understanding shown to me several times over.  I  am so  glad I  found these folks.  I recommend  them to any and ALL who need  Virus Protectors.  I have had another a while back.  PC Protect is  number ONE in my book."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mladen Gogala",
          "Nb_Reviews": 4,
          "Date": "2023-06-03T03:10:30.000Z",
          "Titre": "Easy to use",
          "Contenu": "It's simple, not overly intrusive and works fine. I didn't have any problems setting the free version. I have later purchased a commercial version and it just does its job and protects me. I don't have to click anything, it just works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T19:01:39.000Z",
          "Titre": "Super Easy, Cheap, and Safe",
          "Contenu": "Its super easy to use and as someone who has really bad paranoia, this makes me feel much better when doing anything on my computer."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "PAUL E D BELL",
          "Nb_Reviews": 2,
          "Date": "2022-07-30T22:03:30.000Z",
          "Titre": "I have been using Avast since the…",
          "Contenu": "I have been using Avast since the 1990s, trying your software as it's the first time to try something different, PC Protect, rated above a few I knew of, so that's why I'm here, so far there has it's been fine without trouble, Cheer's Paul."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Doris",
          "Nb_Reviews": 9,
          "Date": "2022-10-11T16:03:57.000Z",
          "Titre": "Great protection",
          "Contenu": "So easy to manage. Press the button to scan and then decide what you want to do with the results.Doesn't interfere with anything and runs in the background when you are web browsing. Great protection"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 33,
          "Date": "2023-01-30T20:05:04.000Z",
          "Titre": "My protection had run out and the…",
          "Contenu": "My protection had run out and the billing team were very helpful in making sure everything was rectifiedFeel much happier that all is now protected again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard G.",
          "Nb_Reviews": 2,
          "Date": "2022-07-19T14:11:16.000Z",
          "Titre": "Excellent Product",
          "Contenu": "So far so good.  Easy to understand.  Videos are informative - to the point. Will need to evaluate further -System is functioning perfectly.  No glitches, easy to work with.  Excellent responsiveness.  Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Trunnell",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T15:15:16.000Z",
          "Titre": "anytime a site that  i log into has a virus",
          "Contenu": "anytime a site that  i log into has a bad reputation PcProtect will let me know right off the bat. also has blocked viruses that i have gotten quite handily ."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Madeleine Huven",
          "Nb_Reviews": 1,
          "Date": "2022-08-20T03:16:26.000Z",
          "Titre": "Smart Scan 7 Clean up",
          "Contenu": "The invitation to run a smart scan appeared on my screen and I said OK - go ahead.  Approximately 1.6 GB junk files were removed. As my computer had been running a bit slow in the last few days I hope that these junk files were the cause and that everything will run smoothly again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas J Worthington",
          "Nb_Reviews": 2,
          "Date": "2022-09-17T01:04:26.000Z",
          "Titre": "I am very new to computers",
          "Contenu": "I am very new to computers, I am a Cancer Patient trying to keep busy with my time. Thank you for all your excellent help, I am also Hearing impaired this was a blessing for me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Rogers",
          "Nb_Reviews": 3,
          "Date": "2023-04-15T00:02:30.000Z",
          "Titre": "I am giving it a 5 star rating based on…",
          "Contenu": "I am giving it a 5 star rating based on how easy it was to install.  I will have to come back later to give a better review of my experience with the software."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Clevenger",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T02:06:36.000Z",
          "Titre": "Beyond the best at this point and easy to use!",
          "Contenu": "I think from a subjective viewpoint at the juncture that PC Protect is a viable security software and I like it's features. I had another unmentionable security software ... Full of bloated false security BS!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bill",
          "Nb_Reviews": 5,
          "Date": "2022-12-13T05:34:40.000Z",
          "Titre": "Very happy with the level of…",
          "Contenu": "Very happy with the level of protection, this product seems to do all it says it will very effectively. I have never had an issue since I installed it - EXCELLENT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cynthia Radway",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T00:57:35.000Z",
          "Titre": "Using Trust Pilot is quite a lot…",
          "Contenu": "Using Trust Pilot is quite a lot easier, faster and much less complicated than trying to clean on my own! I have been very pleased with the results."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aurelio Esteves",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T14:44:10.000Z",
          "Titre": "Did not solve the problem, support was rude",
          "Contenu": "The problem was solved ONLY temporarily! After reboot, the problem came back again, and when contacting support, the guy was very rude, I became so frustrated that requested a cancelation, my program was cancelled but my refund, so far, has never been given back; they ignored my emails for a refund."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sue Upton",
          "Nb_Reviews": 6,
          "Date": "2023-03-18T16:18:05.000Z",
          "Titre": "So far, so good",
          "Contenu": "Only just downloaded this product, but so far, very impressed. Easy installation, clear dashboard and thorough scanning"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Meadows",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T08:52:30.000Z",
          "Titre": "easy to install and use"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Catherine Knowles",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T17:21:20.000Z",
          "Titre": "its a good app",
          "Contenu": "Its a very high quality app and i think its really good and it has helped me in bad situations so i would rate it 5 star, would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Freeman",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T22:04:09.000Z",
          "Titre": "I really appreciate the help because…",
          "Contenu": "I really appreciate the help because I'm not experienced with all this tech \"stuff.\" Thank you for helping me through this process."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sonya Kotila",
          "Nb_Reviews": 2,
          "Date": "2022-08-27T19:42:52.000Z",
          "Titre": "I've really liked the PCPROTECT…",
          "Contenu": "I've really liked the PCPROTECT protection for my laptops, I feel I have been getting my money's worth and I like the peace of mind that my electronics are protected!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen",
          "Nb_Reviews": 4,
          "Date": "2023-04-15T23:10:08.000Z",
          "Titre": "Good Job",
          "Contenu": "I have not had a virus since using PCProtect and that's going on 4 years.  User friendly and good customer support."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sheldon Young",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T20:18:31.000Z",
          "Titre": "A Really Terrific Program!",
          "Contenu": "I found PCProtect to be an incredibly smooth and seamless program to purchase and install...thanks so much! :-)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dalton Thompson",
          "Nb_Reviews": 7,
          "Date": "2023-01-04T19:59:16.000Z",
          "Titre": "PC Protect",
          "Contenu": "After almost a year of use PC Protect has kept my computer safe. I have no complaints, highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adriaan de Vries",
          "Nb_Reviews": 4,
          "Date": "2023-07-21T02:38:06.000Z",
          "Titre": "Easy to download",
          "Contenu": "Easy to download, simple instructions that are easy to follow,  product does exactly as promised"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Laurie Browell",
          "Nb_Reviews": 4,
          "Date": "2022-12-22T10:21:33.000Z",
          "Titre": "It is the only software that picked up…",
          "Contenu": "It is the only software that picked up 2 viruses that have been on my PC for some time and always was causing me havoc.Not any more thanks to PCProtect."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Leonard Fernandes",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T07:22:24.000Z",
          "Titre": "Everything was so quick and easy !"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Peter O'Reilly",
          "Nb_Reviews": 18,
          "Date": "2022-08-15T15:01:14.000Z",
          "Titre": "PCProtect has to be one of the most…",
          "Contenu": "PCProtect has to be one of the most effective PC tools for keeping your PC's Safe & MalWare free...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Porter",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T21:23:03.000Z",
          "Titre": "BEST",
          "Contenu": "I just downloaded pc protect, was easy to download no problems installing great price and fast scan"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cindy Givogue",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T20:41:05.000Z",
          "Titre": "Excellent software",
          "Contenu": "Excellent software. Removes potential viruses, cleans up temp files, and keeps the browser clean."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Brown",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T19:07:33.000Z",
          "Titre": "great protetion",
          "Contenu": "Just learning to use this program.  So far, so good."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Hudson",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T14:32:29.000Z",
          "Titre": "The download was fast and a good price…",
          "Contenu": "The download was fast and a good price and saved my computer from being a loss with all the virus that were trying to take over... Lets hope they are all gone so far so good!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Mahmoud",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T12:44:42.000Z",
          "Titre": "Thank you",
          "Contenu": "I am using the free trial, It's the best anti-virus I got It deleted # viruses I had Without knowing thank you."
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "Armend Kasa",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T10:15:32.000Z",
          "Titre": "So far I am satisfied",
          "Contenu": "So far I am satisfied. No false positives, not hyper panic paranoia or suspicious behavior. Low cost as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MN",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T19:36:14.000Z",
          "Titre": "One-Click",
          "Contenu": "So nice to be able to clear cookies, delete duplicate files, and junk with just one click!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michael Mihailovic",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T09:52:03.000Z",
          "Titre": "my first impressions",
          "Contenu": "i PURCHASED THIS SOFTWARE AFTER READING REPORTS ON OTHER PRODUCTS AND I WAS NOT DISAPPOINTED EASY TO USE FAST RESPONSE AND GENUINELY MET THE REPORTS I READ ABOUT I AM SURE I MADE A GOOD CHOICE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Perry Funnie",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T16:21:58.000Z",
          "Titre": "new scan ran and cleaned the pc fast",
          "Contenu": "Wasn't using my laptop on a regular basic, i purchased this PCPROTECT and boom it cleaned the heck out of the laptop"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria A Rivas-Marlen",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T22:05:19.000Z",
          "Titre": "Quick and easy also I didnt realize i…Great protection easy renewal",
          "Contenu": "Quick and easy also I didnt realize i hadnt renewed my protection and they did it in secondsThank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 3,
          "Date": "2023-02-19T12:41:34.000Z",
          "Titre": "I am very happy with ease of setup",
          "Contenu": "I am very happy with ease of setup and the functions that PCProtect brings to the table.  We need all of the protection that we can get anymore."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Georges Esber",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T23:45:39.000Z",
          "Titre": "Easy to deal with",
          "Contenu": "Easy to deal with, honest and have good quality product at a reasonable price.All works done in back ground, simple and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Allen Humphrey",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T04:38:47.000Z",
          "Titre": "Just begining",
          "Contenu": "The set was nice and easy, I have tried other makes of security, hoping this is going to be the best. Allen Humphrey"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Francis B.",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T07:26:29.000Z",
          "Titre": "It does exactly what I expect",
          "Contenu": "It does exactly what I expect.  With nothing to complain about, no reason not to rate 5 stars."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Linda Jennings",
          "Nb_Reviews": 16,
          "Date": "2023-10-31T01:11:02.000Z",
          "Titre": "Newly installed and already got rid of…",
          "Contenu": "Newly installed and already got rid of a lot of junk on my laptop"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T16:17:08.000Z",
          "Titre": "The ease of using the app",
          "Contenu": "The ease of using the app, for various checkups, gives you a sense of security."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Nader Soleimanzade",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T13:57:13.000Z",
          "Titre": "Everything is the good and this…",
          "Contenu": "Everything is the good and this pcprotect helped me to care my pc in the best manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enoch Locklear",
          "Nb_Reviews": 5,
          "Date": "2022-08-05T01:09:16.000Z",
          "Titre": "hmmm.",
          "Contenu": "This looks oddly identical to TotalAV. Thats all. Tell me if thats what most antiviruses look like."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Guang G Hong",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T09:18:06.000Z",
          "Titre": "I been using two years",
          "Contenu": "I been using two years, and it is good."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Asana Noochet",
          "Nb_Reviews": 1,
          "Date": "2022-07-04T07:23:50.000Z",
          "Titre": "Great Antivirus software easy to use",
          "Contenu": "Great Antivirus software easy to use, light not heavy tasks to my cpu and affordable"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Karen",
          "Nb_Reviews": 2,
          "Date": "2022-08-13T04:43:35.000Z",
          "Titre": "thank you for cleaning up my lap top as…",
          "Contenu": "thank you for cleaning up my lap top as i hadn't used it in such along time it seems to be running alot better now Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonard Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-01-29T23:06:32.000Z",
          "Titre": "Scanning and cleaning makes computing worth it",
          "Contenu": "gives peace of mind to remove issues on my computer that are harmful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "One Depressed Man",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T19:52:52.000Z",
          "Titre": "Its pretty dope",
          "Contenu": "I know no one is reading this but PCProtect is a kick-ass antivirus software, FOR FREE"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bev",
          "Nb_Reviews": 3,
          "Date": "2023-03-13T22:57:26.000Z",
          "Titre": "Software easy to use also excellent…",
          "Contenu": "Software easy to use also excellent cheap price offer to sign up!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jonine Angel Sulit",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T16:52:23.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Attached to my 2 laptops and It gives me peace of mind that it helps in protecting my devices from virus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen S. Glantz",
          "Nb_Reviews": 1,
          "Date": "2022-07-26T19:13:58.000Z",
          "Titre": "Needed to protect my computer i really…",
          "Contenu": "Needed to protect my computer i really don't know what I'm doing just down loaded 7/26/22"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Todd W",
          "Nb_Reviews": 6,
          "Date": "2023-05-08T05:54:59.000Z",
          "Titre": "Seems simple enough to use so far",
          "Contenu": "Seems simple enough to use so far, download was easy and seems to have protection I needed"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nean Miller",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T03:54:29.000Z",
          "Titre": "Scan review",
          "Contenu": "I received an alert notifying me that my C was infected with Malware so I ran your PCProtect scan, followed the advice given and allowed cleanup and removal of junk files and cookies."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Abdul Jalili",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T15:49:35.000Z",
          "Titre": "Great app for security",
          "Contenu": "Great app to secure systems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peggy Stafford",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T15:40:08.000Z",
          "Titre": "Satisfaction",
          "Contenu": "So far, I do not have any issues with the security service I have received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Terry Ryder",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T05:26:22.000Z",
          "Titre": "Accurate....Protection with a click...",
          "Contenu": "They take care of any problem that gets in your way. A quick fast scan and you're on the way. They root out evil fast.... Very Dependable.  A+++"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Makungo Omega",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T19:38:56.000Z",
          "Titre": "I am delighted to express my utmost…",
          "Contenu": "I am delighted to express my utmost satisfaction with your PC protect software. It has proven to be an exceptional tool in safeguarding my laptop from viruses and effectively blocking all malicious activities.Your software's comprehensive virus detection and removal capabilities have provided me with a worry-free computing experience. It consistently identifies and eliminates threats promptly, ensuring my system remains secure at all times.I am particularly impressed by its robust real-time protection, which actively monitors and blocks any suspicious activities, preventing potential harm to my laptop. Additionally, the software's user-friendly interface and seamless integration with my system have made it incredibly convenient to use.I applaud your team for developing such an outstanding product that goes above and beyond in securing my PC. I wholeheartedly recommend your software to anyone seeking reliable and efficient protection against viruses and malware.Thank you for providing me with peace of mind and a secure digital environment for my laptop."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert J Dibble",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T12:30:03.000Z",
          "Titre": "works great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joan Naugle",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T22:36:59.000Z",
          "Titre": "It has added a layer of protection I…",
          "Contenu": "It has added a layer of protection I did not have before and its not complicated"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Garry Bradley",
          "Nb_Reviews": 17,
          "Date": "2023-03-19T19:25:37.000Z",
          "Titre": "I feel at ease with PC Protect…",
          "Contenu": "I feel at ease with PC Protect safeguarding my  Computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David L Adler",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T00:50:08.000Z",
          "Titre": "It protects the computer as it should."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "christopher horne",
          "Nb_Reviews": 7,
          "Date": "2023-01-29T12:17:58.000Z",
          "Titre": "DOES THE FULL WORKS AT A GREAT PRICE…",
          "Contenu": "DOES THE FULL WORKS AT A GREAT PRICE AND EXCELLENT SUPPORT AND SERVICE"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T21:28:29.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use. works on multiple computers with one subscription!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Stephen",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T17:35:55.000Z",
          "Titre": "Malwares",
          "Contenu": "I've never been aware of any malwares in my PC. Thanks to PCprotect, I can feel that my PC feels much safer now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alfred Mercier",
          "Nb_Reviews": 4,
          "Date": "2023-08-02T22:58:00.000Z",
          "Titre": "Fast scan and ability to select smart…",
          "Contenu": "Fast scan and ability to select smart or system scan"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria F. Wertz",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T01:10:55.000Z",
          "Titre": "For $19 a year I am glad I found this…",
          "Contenu": "For $19 a year I am glad I found this through searching. The last company cheated me and said $29.99 and charged me $119. They did not kill all the virus they say they would."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A P",
          "Nb_Reviews": 3,
          "Date": "2022-10-14T22:04:13.000Z",
          "Titre": "Hands down the BEST ALL IN ONE…",
          "Contenu": "Hands down the BEST ALL IN ONE solution!! Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elaine Dimino",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T15:48:45.000Z",
          "Titre": "As a new Customer       Ellie",
          "Contenu": "Gave me some peace of mind.  This is new for me.    I hope this \"confidence\" isn't  made to change.   Glad I found PC Protect.    Thanks.."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "mr michael fenn",
          "Nb_Reviews": 23,
          "Date": "2022-09-05T13:56:31.000Z",
          "Titre": "just the job in keeping me safe from…",
          "Contenu": "just the job in keeping me safe from scammers and protected"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "REBECCA",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T03:37:40.000Z",
          "Titre": "so far I have had no issues with the…",
          "Contenu": "so far I have had no issues with the program or my computer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liangwei",
          "Nb_Reviews": 5,
          "Date": "2022-10-05T05:30:35.000Z",
          "Titre": "It's a powerful software to protect my…",
          "Contenu": "It's a powerful software to protect my PC running Windows 7."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Franck From SATX",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T15:53:24.000Z",
          "Titre": "By far the best antivirus",
          "Contenu": "By far the best antivirus I have bought. Worse every penny. Easy to use and works wonders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Norman Weber",
          "Nb_Reviews": 3,
          "Date": "2023-07-13T02:36:39.000Z",
          "Titre": "To date",
          "Contenu": "To date, just started, already satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reyannan Miller",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T16:03:10.000Z",
          "Titre": "The entire oprocess was so easy to understand and complete",
          "Contenu": "This protection software is pretty straight forward and easy to comprehend and use regardless of tech experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ray Shivley",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T17:43:49.000Z",
          "Titre": "Very easy to install and use",
          "Contenu": "Very easy to install and use.  I will monitor it closely."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "David Lawrence",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T01:07:58.000Z",
          "Titre": "started with pc protect today",
          "Contenu": "Just started with pc protect today all good.David."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darlene Blue-Walter",
          "Nb_Reviews": 1,
          "Date": "2022-09-07T00:19:40.000Z",
          "Titre": "great",
          "Contenu": "PCPROTECT is absolutely awesome, and is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T16:21:21.000Z",
          "Titre": "The support team was helpful and…",
          "Contenu": "The support team was helpful and responded quickly."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "ernest hughes",
          "Nb_Reviews": 6,
          "Date": "2022-08-27T19:07:20.000Z",
          "Titre": "I am very happy with the service I have…",
          "Contenu": "I am very happy with the service I have been given with P.C .Protect I find that they are a very good company."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Josy Natav",
          "Nb_Reviews": 2,
          "Date": "2023-03-25T17:12:46.000Z",
          "Titre": "The way the orogram protects my pc…",
          "Contenu": "The way the orogram protects my pc EFFECTIVELY"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dylan Bain",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T00:17:24.000Z",
          "Titre": "its removed all the malware off my pc…",
          "Contenu": "its removed all the malware off my pc for a very little price! amazing."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T15:15:51.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good, identifies lots the others dont"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheree Sykes",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T16:14:03.000Z",
          "Titre": "scan",
          "Contenu": "review of files, threats, etc. was very quick and effective"
        }
      ]
    }
  ]
}