{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "pdffiller.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "RS",
          "Pseudo": "Jelena G.",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T01:32:03.000Z",
          "Titre": "The trial is not completely free",
          "Contenu": "The trial is not completely free; do not trust them. They say they will issue a refund, but they charged me two days in a row (2 x USD1.75), although I used the service for less than 10 minutes (I needed an urgent update) and immediately cancelled my subscription. Now I am concerned about my card details. This seems like a misuse."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jonathan H",
          "Nb_Reviews": 7,
          "Date": "2023-12-19T06:58:37.000Z",
          "Titre": "scam doesnt tell you you need to pay…",
          "Contenu": "scam doesnt tell you you need to pay until you get to the end. don't waste your time"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "bezalel bezalel avrahamy",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T17:57:01.000Z",
          "Titre": "predatory website",
          "Contenu": "predatory website. should be illegal to do what they do.of course, they make it super easy to start editing your files and whatever, and then after you spent potentially hours working, and want to export the file, you gotta sign up for the free trial. and not only that, cancelling it is not easy. (which i am pretty sure is actually illegal in the US) they try to confuse you by saying \"Cancel free trial\" and \"Are you sure you want to cancel your free trial\". scum."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Daryl West-Hill",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T06:26:24.000Z",
          "Titre": "Require credit card details",
          "Contenu": "These apps that advertise themselves as free then at the very end require a credit card for a free trial are at best deceptive if not dishonest."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Hilda",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T00:48:35.000Z",
          "Titre": "Free trial?!",
          "Contenu": "Just finished filling out a discipline referral form template on their website. When I went to save it at a PDF, it wants me to get a \"30-day free trial\". No, I'm not paying for that stupid trial, I just want my document. I added their name onto my blacklist so I don't fall for their actions ever again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 8,
          "Date": "2023-11-03T20:08:33.000Z",
          "Titre": "2nd Time I've been conned into using their site",
          "Contenu": "Despite the displayed options,  SAVE, PRINT,  you can't do any of that till they have your credit card that they charge $101 to, which you don't learn about till you've completed your work!  So I emailed to 'cancel immediately'; got an email they had, learned later, that only cancels the renewal of the subscription.  The $101 is refunded only if you notice it on your charges, email and specifically request it. I've now put their name on my bulletin board to make sure I don't fall for their fibs again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Hutchinson",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T20:43:51.000Z",
          "Titre": "This company is anti-American",
          "Contenu": "I am complaining because I feel you are ripping off Veterans by making them sign up to print a Veteran's document. I expressed this concern many times . Not once did I get a response regarding this issue. Just what does your company do for Veterans other than forcing them to sign up for your services to print a military document? Not even any kind of \"thank you for your service\". You people should be ashamed. At one point I asked my comment to be sent to the owner of the company....again no response. I chatted with someone and in the end they said \"Is there anything else i can do for you today\"? I said how about a \"thank you for my service\". He replied \"thank you for using PDFfiller\". This company rips off Veterans and not once do they recognize Veterans for their service. This compny is anti-American,You won't find me using their services."
        },
        {
          "Note": 1,
          "Lieu": "AT",
          "Pseudo": "부부부부",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:24:42.000Z",
          "Titre": "Don't trust this website",
          "Contenu": "Don't trust this website. They advertise that they give you a 30 days free trial and that there are no hidden costs or fees. But this scam Website charged my account 2 days in."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michele Hennessy",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:33:01.000Z",
          "Titre": "Haven't used the service yet too soon…",
          "Contenu": "Haven't used the service yet too soon to say"
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Kris",
          "Nb_Reviews": 10,
          "Date": "2023-09-23T09:46:47.000Z",
          "Titre": "Visited their site and set up an…",
          "Contenu": "Visited their site and set up an account, got occupied before choosing a plan and i got four emails within a few hours from them.Its one thing to send out a reminder but trying to spam potential customers is just bad, making my decision not to choose them easy.They are also not clear about payment until after you have edited your document and want to export it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Younes El baroudi",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T13:11:34.000Z",
          "Titre": "I just wasted my time",
          "Contenu": "I just wasted my time. after you finish editing the PDF they transfer you to pay, and this is S H-I T, you should inform us before that we have to pay, and don't waste our time B A S T - A R D S"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Lukasz Rewerenda",
          "Nb_Reviews": 7,
          "Date": "2023-09-19T08:29:33.000Z",
          "Titre": "typical deceptive stuff",
          "Contenu": "typical deceptive stuff; they will have you edit your document, spend time, and only when it comes to exporting will they force you to provide a credit card and create an account. free? very deceptive. didn't want to find out how \"easy\" cancelling that free trial would have been."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter Cauldwell",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T16:36:53.000Z",
          "Titre": "PLEASE",
          "Contenu": "PLEASE, PLEASE, PLEASE AVAOID! It's a scam. I signed up after searching google for a way to convert PDF to Indesign. They have a whole page dedicated to explaining why they are the best at it. After signing up I was told by 'Support' that this isnt available and it's something they will offer in the future. COMPLETLEY MISLEADING AND FALSE ADVERTISING. A SCAM."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Hank Moody",
          "Nb_Reviews": 25,
          "Date": "2023-10-12T14:20:53.000Z",
          "Titre": "A very dishonest company",
          "Contenu": "A very deceitful and dishonest company. They advertise their self as a free PDF editing software, then allow you to waste your time, making your document only to then want to charge you as a subscription at the very last stage companies like this are disgustingIf there is a charge, just say that stop click baiting people to waste their time with false information**to answer their reply**It’s not “Free” it’s a free trail. Two very different things. I don’t want to sign up to a monthly plan to download a single document. And companies like you do that in the hope that the customer will forget about the subscription and be charged. It’s sneaky and underhandedEither make it free or don’t But stop the lies"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "O Merino",
          "Nb_Reviews": 2,
          "Date": "2023-01-12T22:39:16.000Z",
          "Titre": "Alert! Scam business",
          "Contenu": "Scam business. As other people have mentioned, these guys are charging 96 dollars for a service you have not requested. You sign up for a one off trial and next thing you know they are stealing from your PayPal account without your consent. Report them as soon as you find out and you may get a refund. They know very well what they are doing. Absolutely disgusting."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deborah Nichols Tall",
          "Nb_Reviews": 2,
          "Date": "2023-01-09T23:35:35.000Z",
          "Titre": "Scammy Business",
          "Contenu": "One star for refunding my $96 for a subscription I never intended to sign up for.Zero additional stars because this is a scam.  Someone needed my e-signature and I signed (a business initiated this) and inadvertently 'signed up for a subscription'.  Missed the 'trail period' end and got charged $96.  A 'trap' of a business.  Looking for the slow and inattentive."
        },
        {
          "Note": 1,
          "Lieu": "HU",
          "Pseudo": "Muhammad Salman",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T13:42:03.000Z",
          "Titre": "Wasted One hour by tricking me. Shame on you",
          "Contenu": "This is my first trust pilot review and I am going to start by giving a 0 to you. I updated a pdf file for one hour thinking it was free, and then in the end you ask me to pay for a free trial by tricking me in the end. Worst experience ever and time wasted. You should tell the cxt before that you cannot save an edited pdf without entering card number. Shame on you."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Minute University",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T12:53:16.000Z",
          "Titre": "It's a trap - you can't download unless you subscribe",
          "Contenu": "It's a trap - they don't allow downloading even 1 document unless you subscribe to a plan. This is totally fine, nothing comes for free - but they should somehow be more transparent and tell that upfront. You spend half an hour filling a document - only to find that you can't use it unless you give your credit card details and subscribe to their plan. But if you enjoy filling PDFs as a hobby, this is the site to go!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexandra Conway",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T06:00:31.000Z",
          "Titre": "CROOKS. FRAUDSTERS. THIEVES",
          "Contenu": "CROOKS, THIEVES, FRAUD!!!! THEY WILL CHARGE YOUR ACCOUNT SEVERAL CHARGES AND FEES AND PRETEND TO DELETE/CANCEL A SUBSCRIPTION BUT MAKE MULTIPLE CHARGES ON YOUR ACCOUNT. THEY DRAFTER OVER $100 OF FEES ON MY BANK CARD WITHOUT MY PERMISSION AND CHARGED OVER DRAFT FEES!!!! THIS PLACES IS A SCAM AND I WILL BE REPORTING THEM TO THE BBB AND MY MILITARY BASE LEGAL OFFICE!!! I NOW HAVE TO DISPUTE THESE CHARGES ON MY BANK CARD!!! COMPLETE FRAUD"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trent Rains",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T17:08:38.000Z",
          "Titre": "WILL SCAM YOU FOR YEARS",
          "Contenu": "I haven’t opened my pdffiller account since 2019, just to check my bank account in 2023 and see a $30 charge for no reason. I’m sure this has been happening under my nose for 4 years. I go to my subscription page only to see no subscription. There’s no card cancellation, there’s only manipulative marketing tactics such as “don’t remember my account” when logging in, the standard “3 users” instead of basic 1 options, etc etc. Businesses like this should be illegal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aleks",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T21:32:41.000Z",
          "Titre": "Just screenshot your data and get away from this scammy app",
          "Contenu": "Not free at all. They ask CC information at the end of the process. I wasted so much time and it is so annoying. In the end I took a screenshot of the document so I can replicate on another app (one that is actually free!) and closed this scammy app.Please read all the reviews of people that can't stop payment and get scammed."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Brad Jumeau",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T14:57:51.000Z",
          "Titre": "What a waste of time",
          "Contenu": "What a waste of time.  Let me download a form and fill it in with business info and then create an account which then wouldn't let me in to send.  In haste and to my own fault, I used a password that is luckily only used on worthless accounts.  But still,   now have to change all those passwords.  DO NOT USE THIS SITE!!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mrsbeaks",
          "Nb_Reviews": 10,
          "Date": "2023-08-09T17:32:33.000Z",
          "Titre": "Cancelled the subscription and they…",
          "Contenu": "Cancelled the subscription and they still tried to take money out - luckily my bank declined the payment and cancelled my card.  I received a new card yesterday and they have already tried to take payment again, which has again been declined !! How the heck did they manage to get my new card details before I've even used the card myself !"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Treena Hales",
          "Nb_Reviews": 3,
          "Date": "2023-05-17T17:24:56.000Z",
          "Titre": "IT works then they take your card details",
          "Contenu": "The system itself was actually fine and worked exactly as I needed. What I didn't know was that, in order to download the document, I needed to sign up to the free trial with automatic billing after so many days. My lower score is for that reason. If I'd known about the payment/free trial up front, I would have looked at further options. So although the tool itself is fine, I won't be signing up purely because they let you do everything for free and then make you add card details before accessing your document."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Dougherty",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T00:07:05.000Z",
          "Titre": "Absolute clickbait of an application",
          "Contenu": "Absolute clickbait of an application. They host PDF files that they don’t own. They make it easy to fill out the document. They don’t hit you with the paywall until after you spend an hour working on the document.My new life’s mission is to leave an accurate review on every platform I can find."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Edward Bai",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T20:52:19.000Z",
          "Titre": "Be super careful when you decide to…",
          "Contenu": "Be super careful when you decide to register the so called 30-day free trial. The web is promising a free trail and start charge you month-to-month after 30 days. However, they automatically charge you for WHOLE YEAR regardless of an immediate cancellation you try to request.  Talk to your bank as soon as possible to stop this payment otherwise they just charge you $ for NOTHING."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Brian",
          "Nb_Reviews": 4,
          "Date": "2023-04-20T18:22:44.000Z",
          "Titre": "Absolutely useless - Avoid at all cost - pdfFiller is crap!",
          "Contenu": "Absolutely useless. It is in no way user friendly. Terrible programming, totally unresponsive to what you ask it to do. Do not use this, it will drive you absolutely crazy, Avoid at all cost anything to do with pdfFiller, delete and reverse immediately once you see pdfFiller logo. It's crap!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jayden Volkova",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T18:26:51.000Z",
          "Titre": "Have credit card in hand",
          "Contenu": "Like most of the 1 star reviews here I came to say don't waste your time using this website if you don't want to put your credit card info in. Not one download is free without your payment info.Your site on google is *advertised* as free. \"PDFFiller Free | pdfFiller try for Free\", and while it's technically free, I do not care to remember to remove my payment info from the site later."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T09:05:53.000Z",
          "Titre": "It took me something like an hour to…",
          "Contenu": "It took me something like an hour to edit my document. In order to save it they wanted me to make an account and after that to give my credit card details. I wouldn’t do any of these steps if I knew what’s coming next. What a waste of time. Clowns"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "kim tavares",
          "Nb_Reviews": 5,
          "Date": "2023-03-23T03:28:39.000Z",
          "Titre": "Disgusting company",
          "Contenu": "Disgusting company, bad product which I found hard to use. I cancelled within the first month to which they sent a 75% discount not to cancel. Unfortunately they didnt send an email confirmation to confirm cancellation so billed me again a year later. They have so many complaints against them for this practice. Beware."
        },
        {
          "Note": 1,
          "Lieu": "ID",
          "Pseudo": "Leon Truzqy Zainun",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T07:17:12.000Z",
          "Titre": "so I edit a pdf file which require lot of form to fill.",
          "Contenu": "so I edit a pdf file which require lot of form to fill. after fill my pdf? turns out I have to signup. then? I have to pay. and I only need to use the app once. I mean... whatswith the flow? why don't tell the user to signup and pay first? instead we waste our time using the app first to know that we must sign up and pay? not every user want to sign up nor pay."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frank Sanchez",
          "Nb_Reviews": 28,
          "Date": "2023-05-23T03:44:56.000Z",
          "Titre": "VERY shady business. NOT free!",
          "Contenu": "Allowing you to spend LOT of time on editing a document and then turning around to say you need to pay in order to get access to the edited document. Their claim that there is a \"free\" trial is false as well, as we all know how \"free\" trial works. No matter how good you follow their cancellation rules, you ALWAYS get charged. Found a 100% site that let me edit PDF instead now, and never asked for any credit card info either. So, I will use this one for now. AVOID those \"free trial\" scam companies at all cost!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Connor Easterbrook",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T11:33:45.000Z",
          "Titre": "Filthy business practices.",
          "Contenu": "Filthy business practices.Allowing you to spend any amount of time on a document and then turning around to say you then need to pay in order to get access to the edited document.If you sign up for the trial and attempt to cancel before it ends, they have claimed in the past that you never cancelled and charged for a month anyway. Very shady business."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Tallulah",
          "Nb_Reviews": 9,
          "Date": "2023-11-26T18:45:57.000Z",
          "Titre": "Charges after displaying what appears…",
          "Contenu": "Charges after displaying what appears to be a free service. SCAM"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mary Vanderburgh",
          "Nb_Reviews": 2,
          "Date": "2023-04-02T17:37:20.000Z",
          "Titre": "Difficult to use, more difficult to cancel subscription",
          "Contenu": "Tried to use this for filling out some forms, couldn't figure it out, thought I'd cancelled subscription, this morning Paypal sent me a receipt for the payment. Tried again to cancel subscription, went back, nope. Not only is the software impossible to use, it's difficult to cancel \"free\" subscription"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "jaBoy sunnyC",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T10:55:40.000Z",
          "Titre": "Waste of my time",
          "Contenu": "Waste of my time. Maybe give a disclaimer that you need to start a free trial before being able to download your edited document. UI also poor"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Sree Pranav",
          "Nb_Reviews": 2,
          "Date": "2023-06-15T12:57:22.000Z",
          "Titre": "I recently tried to fill out an…",
          "Contenu": "I recently tried to fill out an application, and it ended up being a complete waste of my time. After spending an hour filling out the application, it asked me to pay for the service. If it's a paid version, why did you let me fill out the application in the first place? This experience left me feeling frustrated and disappointed. I wouldn't recommend to anyone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Steven Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T18:41:45.000Z",
          "Titre": "Need to pay",
          "Contenu": "Filled it in and then had to pay Hate companies like this. Don't make it clear. If trustpilot contacts me to dispute this review I'll go to the Competition and Markets Authority as trustpilot does that quite a bit."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer Wilson",
          "Nb_Reviews": 50,
          "Date": "2023-02-17T15:47:44.000Z",
          "Titre": "I don't like being conned",
          "Contenu": "I don't like being conned! Filled out what I thought was a genuine form for Royal Mail, only to find when I had filled it in that it was actually pdfFiller who wanted me to subscribe in order to print off the form.  This should have been stated right at the beginning but of course then they wouldn't be able to hook people that had spent their valuable time filing out the form.  I subsequently found the correct form on Royal Mail (without subscribing to anything)."
        },
        {
          "Note": 1,
          "Lieu": "GT",
          "Pseudo": "Edie Almirez",
          "Nb_Reviews": 5,
          "Date": "2023-05-18T01:01:52.000Z",
          "Titre": "Completely useless",
          "Contenu": "Completely useless, it looks like a quick solution for light editing your pdf file. It let's you start editing your pdf, and when you think you're finished, oh surprise! you can't do anything with your file unless you join a yearly plan (They give you a \"free trial\" of one day, and you have to give them your credit card details to apply to it) , and by this point, you already gave them your email because you signed in thinking this was enough. Moreso, they have you file in their servers, and who knows what they'll do with it. Avoid it at all costs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy",
          "Nb_Reviews": 6,
          "Date": "2023-01-02T20:59:35.000Z",
          "Titre": "This app is a SCAM!",
          "Contenu": "This app is a SCAM!! I wanted to try the FREE trial but had to submit my credit card number. I cancelled within 24 hours but was charged a FULL YEAR. I filed a case with PDFFiller but they would NOT refund me! Don't use this!! FREE trial is NOT free!!"
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Julia Kuznetsova",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T13:42:41.000Z",
          "Titre": "no warnings about paying",
          "Contenu": "no warnings about paying, after i filled the doc before saving the doc they wanted to charge it only in doс come on"
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "Rob Spruyt",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T15:25:47.000Z",
          "Titre": "claims we can edit freely, yet it's a lie",
          "Contenu": "claims we can edit freely, yet after using and editing my document, and before downloading it, asks to pay for subscribtion. STOP MISLEADING AND WASTING PEOPLE'S TIME! how this isn't false marketing and not illegal, i don't know."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "VIKAS WANI",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T18:09:24.000Z",
          "Titre": "third class experiwnce ..",
          "Contenu": "third class experiwnce ... even 1 star also not deserve..if you dont allow to download or print why allow to fill the form and wasting our time.I spent an hour or more filling a file and then when I wanted to download it, a payment wall came in! Out of desperation, I wanted to pay but it wouldn't let me pay via Paypal or anything besides a credit card. if that is not fishy and stupid, I don't know what is. Don't waste your time with this dishonest company."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Mahshid",
          "Nb_Reviews": 11,
          "Date": "2023-05-29T13:59:27.000Z",
          "Titre": "Horrible rip-off!",
          "Contenu": "Horrible rip-off!I spent an hour or more filling a file and then when I wanted to download it, a payment wall came in! Out of desperation, I wanted to pay but it wouldn't let me pay via Paypal or anything besides a credit card. if that is not fishy and stupid, I don't know what is. Don't waste your time with this dishonest company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Soheil Talebali",
          "Nb_Reviews": 3,
          "Date": "2023-06-18T22:38:51.000Z",
          "Titre": "SCAM!! AVOID!!!",
          "Contenu": "The online app is puposely decieving as if it is a free app, once you used it to fill up your documents then it asks you to pay to even download the files. They know very well what they're doing, do not fall for their scam."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Kaufman",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T18:35:42.000Z",
          "Titre": "pdfFiller hijacked the merchandise…",
          "Contenu": "pdfFiller hijacked the merchandise return process for Duluth Trading Company. I completed the return form, which had a genuine looking Duluth logo a shipping label. Then, after I completed the form, pdfFiller refused to print the form unless I signed up for a free trial and gave credit card info. I went back to the Duluth site and this time got the correct return process from Duluth. Extortion is the correct term for this kind of sales tactic."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ray Baxter",
          "Nb_Reviews": 16,
          "Date": "2022-12-05T13:19:24.000Z",
          "Titre": "These guys are crooks",
          "Contenu": "These guys are crooks. I wanted to fill in an Irish Revenue form which they said I could do for free, then after spending 20mins completing the form, it would not let me download or print it without subscribing with my bank card."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ray",
          "Nb_Reviews": 59,
          "Date": "2023-03-30T16:59:13.000Z",
          "Titre": "I signed up for a free trial with this company",
          "Contenu": "I signed up for a free trial with this company. Tried the software, was not satisfied, cancelled it the following day. Yet I find that they have taken $96 USD from my Paypal account 30/03/2023. Then Attempted to take another $96USD later on the same day !. $192USD.I expect a full refund, although as I am in the UK they do not pick up the phone. I must say, nice scam. DO NOT USE THIS COMPANY. I chose Adobe Acrobat Professional DC instead. A question to ANY personnel at PDFfiller. When will I get my money bac ??????"
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Päivi Immonen",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T09:13:37.000Z",
          "Titre": "SCAM",
          "Contenu": "SCAM. I opted for the free trial to get my already modified pdf out, and so far they've charged my credit card twice! Even though I cancelled my free trial and subscription immediately after downloading my pdf."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Reungu Ju",
          "Nb_Reviews": 6,
          "Date": "2023-12-03T02:21:09.000Z",
          "Titre": "garbage",
          "Contenu": "pure dogsht.Why not tell me in the first place it's not free, but after I have done tons of editing?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maureen Kahl",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T01:50:15.000Z",
          "Titre": "This is a joke!!!!",
          "Contenu": "This is a joke!!!!!  I had to keep trying to get into MY file.  I cannot print it.  Ludicrous and I was asked to give my credit card to print.  If that CC number is stolen by YOU, I will report this to the government."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Helen Davidov",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T23:59:30.000Z",
          "Titre": "It is cheating",
          "Contenu": "It is cheating, to allow me to fill in information, then do not allow to print and at the end asked for payment. What a bad, bad business you are running. Got my personal information than asking for credit card number. Wow."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Keith Wridgway",
          "Nb_Reviews": 10,
          "Date": "2023-01-30T20:53:59.000Z",
          "Titre": "I don’t have an account with pdfFiller…",
          "Contenu": "I don’t have an account with pdfFiller yet they send me emails on a daily basis, the unsubscribe button doesn’t work, when I reply to the emails asking them to stop sending them I get bombarded with more emails asking for my account details which I don’t have.They have my email address I can’t imagine why they can’t simply take it off their mailing list"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Chris Smith",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T06:12:27.000Z",
          "Titre": "Check your Credit Card statement",
          "Contenu": "Check your Credit Card statement. Signed up for the free trial (which requires entering CC details) only to find 2 separate debits on my card. So, not quite free then..."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Louise Pike",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T08:39:53.000Z",
          "Titre": "Not free!!! PRETENDING TO BE A LEGIT COMPANY…",
          "Contenu": "PRETENDING TO BE A LEGIT COMPANY OFFERING A SEEMINGLY “FREE SERVICE” THIEVES!!! INDICATED THERE IS NO CHARGE FOR A ONE TIME USE AND I AM CHARGED FOR A SINGLE DOCUMENT : $3.26. YOU CROOKS!!!OLDEST TRICK IN THE BOOK IS TO HIDE YOUR STEALTHY, CROOKED BUSINESS PRACTICE THAT IT IS AN AUTH HOLD.WHY ARE YOU NOT DECLARING IT SO THAT IT IS OBVIOUS??? WHY????WHY CAN’T YOU BE TRANSPARENT FOR A MEASLY SUM OF MONEY YOU STEAL FROM OUR ACCOUNTS?? IS THAT HOW SLOW YOUR BUSINESS IS???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Danny Mac",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T05:16:57.000Z",
          "Titre": "Its not free even though that's what they say, don't waste your time",
          "Contenu": "PdfFiller shows up in every search containing free and pdf together and just pdf, ITS NOT FREE. So I used it to edit a document that I needed for court, spending quite a few hours on filling out this PDF form I. To be fair it works great, its easy to use, and has helpful assisting features. Then I went to download the form I just spend hours filling out and that's when SURPRISE ITS NO LONGER FREE. (*there is a free trial you can use but you still have to enter payment information). Didn't say anything about holding my work hostage until I signed up to pay for their product they advertise as completely free. I tested out some other pdf editors and they all do they same thing. Look for a program you can buy rather than pay monthly to edit PDF files which is an incredibly stupid idea to begin with. I am done with my rant, long story short they are frauds and shouldn't expect that they can mislead customers into using their product under false pretenses then think they deserve your hard earned money."
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "LUHONO MAXWEL BUTEMBU",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T08:02:01.000Z",
          "Titre": "This is a very useless app.Preaching…",
          "Contenu": "This is a very useless app.Preaching water but drinking wine.After wasting my 2hours doing a project work,the work is subsumed in multiple modules such that i cant even trace it.Please align your pages with some clarity.Very useless scam"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Neil Clynch",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:24:45.000Z",
          "Titre": "Same as most of the other 1 star…",
          "Contenu": "Same as most of the other 1 star reviews.  Wasted time using this app to fill out a PDF form only to find out that I would need to enter credit card details in order to access it."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Maro",
          "Nb_Reviews": 19,
          "Date": "2022-12-06T14:06:33.000Z",
          "Titre": "They let you modify your PDF and only…",
          "Contenu": "They let you modify your PDF and only when you finish your work you find out that you need to subscribe to save your work. You realize then that you wasted your time. Stay away from websites like this one."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "RazzahHD",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T05:07:25.000Z",
          "Titre": "Wasted hours filling out forms",
          "Contenu": "Wasted hours filling out forms, when I tried to export my documents it asked for money. If you're going to charge for a service you need to tell people before they begin. Every other pdf filler I've ever used is free."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynn Ochoa",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T19:40:56.000Z",
          "Titre": "You pay ANNUALLY, not MONTHLY, BEWARE",
          "Contenu": "I had initially signed up for the $8/per-month subscription under the impression that it was a MONTHLY subscription because that was what was advertised. Instead, I come to find out that I was charged $96, which is the annual cost. I only needed to use the website for one thing, and was charged a whole year's worth! There was no response from their support service. I wouldn't have minded paying just one month, but a whole year? If I'm being charged for a whole year for something, just tell me that, instead of putting it in the fine print. I want a refund for at least $88, because that would cover at least a month (for the one thing I needed), but I can't even get in contact with anyone from the company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ted Tibbetts",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T18:25:21.000Z",
          "Titre": "Another BS site that promises \"FREE\" in…",
          "Contenu": "Another BS site that promises \"FREE\" in their headline only to waste 20 minutes of time trying to fill out a PDF then be forced to enter credit card info for a free trial."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bonnie Sibanda",
          "Nb_Reviews": 17,
          "Date": "2023-07-11T02:16:00.000Z",
          "Titre": "This is a real scamm stay away",
          "Contenu": "This is a real scam please stay away from this , I signed  up for  a free 1 month trial and after that i would pay $20.00 monthly but in 5 days they have been withdrawn $200.00 @ $20.00 per day , I have written to Support team for a refund yesterday after i discovered this but no answer yet so please stay away from this scam Company"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Aaron Sonson",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T20:40:06.000Z",
          "Titre": "Not made clear had to pay until I had…",
          "Contenu": "Not made clear had to pay until I had completely filled in form which took twenty minutes. Following this the website would not take my payment - tried 2 diff cards"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Irshad Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T10:54:39.000Z",
          "Titre": "They are blackmailing the customers",
          "Contenu": "They are blackmailing the customers. First they put in their data, then they are compelled to register their Bank Information.They should have told the customer regarding compulsory registration."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Matteo Catrini",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T23:28:01.000Z",
          "Titre": "No actual free trial",
          "Contenu": "No actual free trial. 1 star for wasting my time. Misleading."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "benison",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T06:38:45.000Z",
          "Titre": "Absolute garbage",
          "Contenu": "Absolute garbage, asks to pay for service after editing everything. It never mentions before that you need to start a free trial to download the damn thing."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tony Te Rae Pau",
          "Nb_Reviews": 4,
          "Date": "2023-06-18T04:51:39.000Z",
          "Titre": "Way overpriced",
          "Contenu": "Why overpriced, I used it twice and had $105UAD deducted from my PayPal account.The company set it up as automated monthly deduction I was shocked"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dr. Marijke Blij",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T18:27:11.000Z",
          "Titre": "Fake Advertising",
          "Contenu": "PdfFiller Announces that you can convert pdf into word for free in seconds, and then gets your email address, and then tries to sell you the paid product."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ry Taylor",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T23:53:21.000Z",
          "Titre": "It isn't clear that you have to pay.",
          "Contenu": "It isn't clear that you have to pay for the service. You do all the work, and then when you go to save and export your document you're hit with a paywall.Wouldn't recommend"
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Tanmay “Attila” Pradhan",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T23:57:35.000Z",
          "Titre": "Paywall when you are finished…",
          "Contenu": "Paywall just when you are finished editing and about to download. Minimum 20$ charge...Disgusting scam ! They let you waste hours of your time to pull this dirty trick"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "none of your business",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T20:47:50.000Z",
          "Titre": "I never signed up for this service yet…",
          "Contenu": "I never signed up for this service yet it showed up on my PayPal account.   Never ordered this and don;'t know what it is yet they will not credit my account.  Now I'm stuck with a bill for $129.00 for something I did not order.   Major A-----Hos-----   Rip off artists.  Don't work with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Samp",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T17:08:54.000Z",
          "Titre": "I don't think it is letting me get a 30…",
          "Contenu": "I don't think it is letting me get a 30 day free trial, you are holding my document hostage to make me join and pay you money!!  You did not tell me at the start of this i had to pay to fill out this form.   Super f---n stupid"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Alansan Julio Sutanto",
          "Nb_Reviews": 2,
          "Date": "2023-04-19T21:37:16.000Z",
          "Titre": "This is not the \"Free PDF editor\" you thought they were",
          "Contenu": "This is not the \"Free PDF editor\" you thought it would be (for comparison, like ilovepdf where they literally don't ask you to create account or enter credit card details).This company, however, they will allow you to upload and edit your documents at first, but then when you try to download your files, they complicate things by asking you to create account and enter credit card details for initial subscription plan (AND they charged me £0.68 for credit card confirmation!).If you read their replies here on 1-star ratings, they would of course insist that they are \"free\", as in you can always immediately cancel the subscription plan. But I want to share a warning that this company is using this trick (they would say this is business strategy tho) by complicating their potential users, AND again, I must emphasise, they literally charged me for credit card confirmation, which was not informed at first. Shame on you."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Delo",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T13:46:40.000Z",
          "Titre": "This site is all B.S",
          "Contenu": "This site is all B.S, they really operate using trickery, I got 180.00 yearly subscription I didn't want and no way for a refund. the site said it was a free trail and the service was sub par. please stay a way this is a WARNING."
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Edmundas Petraitis",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T14:39:12.000Z",
          "Titre": "Time waster",
          "Contenu": "AD  - Free Online PDF Editor App - Simple and powerfulReality - filling the form for 30 minutes and then they asked the money."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jade Green",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T21:10:52.000Z",
          "Titre": "Lousy company",
          "Contenu": "Lousy company. They don't bother to remind you that your subscription is due for renewal. I have lost unnecessary money because of this."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James",
          "Nb_Reviews": 3,
          "Date": "2023-08-03T14:50:19.000Z",
          "Titre": "Waste of time",
          "Contenu": "Filled out form, tried to download then told I needed to create an account. Created an account, then told I need to enter card details.Waste of time."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Matthew White",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T12:36:56.000Z",
          "Titre": "Total scam in terms of 'free' trials",
          "Contenu": "Total scam in terms of 'free' trials. And you can't save any of the work you do until you register your payment details. Of course they only tell you this AFTER you have completed the form(s)"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "autumnwind",
          "Nb_Reviews": 3,
          "Date": "2022-11-21T00:35:09.000Z",
          "Titre": "Deceptive",
          "Contenu": "Deceptive. You think you can use it for just one document, but you still have to create an account with all payment details and even more important you have to delete it again. Tedious, time-consuming and therefore useless."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Ravindra Albela",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T17:29:14.000Z",
          "Titre": "Don't use this software",
          "Contenu": "Don't use this software, time waster. after putting my effort while downloading asking to pay and register."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Disappointed",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T00:43:16.000Z",
          "Titre": "I did not want to purchase this at all",
          "Contenu": "I did not want to purchase this at all!  However, $145 came out of my card so I decided oh well might as well use it.  I can't even get into the site! I ask to have my password reset but have not received an email!Shady, don't waste your time!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ryan Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T16:24:17.000Z",
          "Titre": "Annoying company",
          "Contenu": "Mega annoying, you change your PDF completely then it asks for money when you want to download it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luke Gane",
          "Nb_Reviews": 7,
          "Date": "2023-01-28T23:18:58.000Z",
          "Titre": "The company is deceitful and make it…",
          "Contenu": "The company is deceitful and make it nearly impossible to cancel your trial. I do not recommend. The tools are not helpful. The price is way too much."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Randy raeno",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T09:21:50.000Z",
          "Titre": "It took me 60 minutes for me to fill my…",
          "Contenu": "It took me 60 minutes for me to fill my forms and these crappers suddenly beg for money at the end, cheap bastarlks"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Erik Verwaaijen",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T17:21:46.000Z",
          "Titre": "They pretend to be free. But they are not.",
          "Contenu": "They pretend to be free. But they are not.Only after I had filled in a form did they tell me that I had subscribe if I wanted to save it.Very misleading.And a lot of the 5star reviews look fake to me."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Entertainment world",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:01:08.000Z",
          "Titre": "best and spesific software."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tyson",
          "Nb_Reviews": 2,
          "Date": "2023-03-23T10:21:14.000Z",
          "Titre": "I’ve dealt with them for one afternoon…",
          "Contenu": "I’ve dealt with them for one afternoon I tried to use this service to download a form necessary for work only to be told I have to pay after filling out the forms I needed, please state that you have to pay for this service before allowing people yo waste their time"
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "wajahat ali",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T11:33:56.000Z",
          "Titre": "excellent sevirxw",
          "Contenu": "There services are worst successfully waste my 1 hour"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MIke",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T18:47:37.000Z",
          "Titre": "Are you kidding me",
          "Contenu": "Are you kidding me?  Someone sends me a W9 and in order to print it or download it I have to give you my credit card.  What a bunch of bologna.  And a pain in the neck.  Get real, PDFiller, you're wasting my time."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "sham saqlain",
          "Nb_Reviews": 10,
          "Date": "2023-08-08T19:47:18.000Z",
          "Titre": "charged me money when it was free trial!",
          "Contenu": "Received a document from someone to fill. It was not clear how to downloaded or send. I have clicked 30 days free trial. but they have charged me money ?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Andrei Socaci",
          "Nb_Reviews": 2,
          "Date": "2022-11-27T14:31:18.000Z",
          "Titre": "Only used once and needed to pay for…",
          "Contenu": "Only used once and needed to pay for the hole year subscription. Not very great service."
        },
        {
          "Note": 1,
          "Lieu": "FI",
          "Pseudo": "Daniel Montero Hernández",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T17:26:32.000Z",
          "Titre": "It's a complete waste of time",
          "Contenu": "It's a complete waste of time. Predatory business practices."
        },
        {
          "Note": 1,
          "Lieu": "SE",
          "Pseudo": "Robin",
          "Nb_Reviews": 12,
          "Date": "2023-11-15T19:01:01.000Z",
          "Titre": "big scam",
          "Contenu": "big scam, they make you fill all and then when you are ready they want you to pay. its a total scam"
        },
        {
          "Note": 1,
          "Lieu": "RO",
          "Pseudo": "Mihai",
          "Nb_Reviews": 4,
          "Date": "2023-06-23T09:20:57.000Z",
          "Titre": "It's a scam",
          "Contenu": "It's a scam. You waste time editing a PDF, and when you want to download it, they ask you to register. Nothing wrong here, but after that, they ask you to pay to download the PDF. Avoid them at all costs! They just want to collect mails so that they can spam you in the future."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Chrystel Talosig",
          "Nb_Reviews": 3,
          "Date": "2023-02-24T00:50:55.000Z",
          "Titre": "its a scam",
          "Contenu": "its a scam. dont get fooled by this websiteReply: they advertise as free to use but asks you for payment upon signing up"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "Shane McMahon",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T15:13:40.000Z",
          "Titre": "I trialed the free version for 30 days",
          "Contenu": "I trialed the free version for 30 days. Then I cancelled - got an email to confirm I cancelled and they still charged. Do not trust them to cancel."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T18:47:10.000Z",
          "Titre": "Wasted 20 minutes amending PDF only for…",
          "Contenu": "Wasted 20 minutes amending PDF only for it to have a paywall on export"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Julie Parker",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T05:29:59.000Z",
          "Titre": "Cheater don't use them"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:26:06.000Z",
          "Titre": "You interrupted my workflow with this…",
          "Contenu": "You interrupted my workflow with this popup! Shame on ya!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Rebekah Lyon",
          "Nb_Reviews": 38,
          "Date": "2023-06-09T10:27:55.000Z",
          "Titre": "Support is good but shouldnt need them for this",
          "Contenu": "Apparently, i had a trial back in 2022, no memory of this, but I'm sure I did, so when I came to 'sign up' to access the document I had spent time on I was billed for a year. immediately reached out to support to complain and they said I'd be refunded, sadly as it was a credit card charge it will be at least a week before I know if this is true, so I have to keep checking to keep an eye on my £77. honestly, a ridiculously high charge when I came to the site for a single document,"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Marc",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T17:59:21.000Z",
          "Titre": "\"Free trial\" is not really free when credit card information is required",
          "Contenu": "The software looked interesting and intuitive but I will not be able to find out if the saved document would be delivered with the proper quality i.e. no compression of images such as logos because pdfFiller requires users to create an account and provide credit card information before being able to download the finished document. \"Free trial\" is not really free when you have to give credit card information and go back in to cancel your subscription. Whatever rationale companies provide for requiring such information is doubtful at best. I would argue that the real freeloaders are those companies who hope users will forget to cancel their subscription. A recent survey (May 2022) from C+R Research found that 42% of consumers forgot they are still paying for a subscription they no longer use. It is more likely to be the main reason behind that practice rather than to prevent service abuse as there are other ways to authenticate someone without a credit card number. pdfFiller gets two stars for subscribing to this doubtful practice.Edit: To be clear, it is not immediately obvious that you must elect to take the \"free\" trial which is a small tab amongst many others. The landing page would let you edit your pdf document before any notice about the free trial would appear. You might only realize that you must subscribe to a \"free\" trial once you spent quite a few minutes editing your document and tried to download it."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Tha",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T20:15:44.000Z",
          "Titre": "Scam/unethical behavior/clickbait",
          "Contenu": "Scam/unethical behavior/clickbait. Forces you to create an account to provide a service, and ONLY AFTER specifies that a paid subscription is needed for the service that was offered \"for free\"."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Kanal Patel",
          "Nb_Reviews": 2,
          "Date": "2023-11-02T02:23:51.000Z",
          "Titre": "Expensive",
          "Contenu": "$20/month subscription does not seem worth it for a personal user."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "MAYURKUMAR PANDYA",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T20:52:16.000Z",
          "Titre": "DATE FORMAT IS DD-MM-YYYY",
          "Contenu": "DATE FORMAT IS DD-MM-YYYY. THERE SHOULD BE CHOICE OF DATE FORMAT OR IT MUST ALLOW US TO WRITE DATE AS PER OUR CHOICE."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "siva",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:10:03.000Z",
          "Titre": "goodbghbbhhbhh"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Christopher Brencher",
          "Nb_Reviews": 4,
          "Date": "2023-04-29T19:50:40.000Z",
          "Titre": "Not all easy to use",
          "Contenu": "Not all easy to use. Please don't ask if  I contacted the chat helpline. I don't expect having to resort to that to use basic fill and edit tools.Chris Brencher"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T01:09:02.000Z",
          "Titre": "Expensive for wanting to fill out…",
          "Contenu": "Expensive for wanting to fill out forms. would rather buy a printer for cheaper."
        },
        {
          "Note": 2,
          "Lieu": "KE",
          "Pseudo": "Linda Mwalawa",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T09:38:08.000Z",
          "Titre": "The company should specify all charges…",
          "Contenu": "The company should specify all charges applicable including an initial fee charged prior to ending the free trial period"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Anthony Nordberg",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T12:45:32.000Z",
          "Titre": "I find it hard to search for new…",
          "Contenu": "I find it hard to search for new documents."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "MUHAMMAD FAROOQ",
          "Nb_Reviews": 2,
          "Date": "2023-11-16T01:01:35.000Z",
          "Titre": "TOO MUCH EXPENSIVE"
        },
        {
          "Note": 2,
          "Lieu": "MY",
          "Pseudo": "SF",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T10:00:18.000Z",
          "Titre": "except chinese characters are quite…",
          "Contenu": "except chinese characters are quite limited"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T16:06:36.000Z",
          "Titre": "Promotional material",
          "Contenu": "a little tedious but got it done"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mark Hebblewhite",
          "Nb_Reviews": 7,
          "Date": "2021-09-01T10:37:12.000Z",
          "Titre": "Okay but 33% more expensive than Acrobat!",
          "Contenu": "The tool does pretty much what it says it does, which is good; however, what I don't like is that they promote it as a free tool when looking for it, then you go through playing with it and once you want to download the file - you have to subscribe, the pay for a monthly subscription. Basic Subscription is $20pm, which is actually $5 more than Adobe Acrobat itself and you can do a lot more with Adobe Acrobat for the $14.99pm they offer it as. To get the same features on pdfFiller you have to pay $40pm."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Dhruba Ray",
          "Nb_Reviews": 1,
          "Date": "2020-11-06T16:40:06.000Z",
          "Titre": "i am not impress with pdfiller is…",
          "Contenu": "i am not impress with pdfiller is horrible 1st editing pdfs or other files its just not flexible enough for me converting and move file  in pdf i just wanted to replace delete or edit my ID with the SIN number on that files u dont even have flexibility to move files to another sheet 1 to sheet two u are going get horrible rating from me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 2,
          "Date": "2021-10-21T12:53:45.000Z",
          "Titre": "Frustrating...wouldn't use long term.",
          "Contenu": "It was very difficult to navigate. I was very frustrated in the beginning. Finally, I was able to accomplish what I needed to, but I certainly wouldn't use it long-term."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kiril Ivanov",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T11:10:53.000Z",
          "Titre": "Adobe is cheaper",
          "Contenu": "Easy to navigate, but advertised as free, once you spend time changing your pdf asking you for money. If you want to make  business don't say it's free.  And that subscription..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "lr_snow",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T21:28:46.000Z",
          "Titre": "Okay experience somewhat confusing",
          "Contenu": "Okay experience somewhat confusing, It seems to be a guessing game within some parts"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Central Stores Vijaya Hospital",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T11:47:58.000Z",
          "Titre": "fast",
          "Contenu": "will update later"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Lakshminarasimha Reddy",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T13:43:44.000Z",
          "Titre": "i am not able to download"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "m lamorie",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:23:22.000Z",
          "Titre": "couldn't download documents from",
          "Contenu": "couldn't download documents from LASC"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Harpreet Gill",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T20:59:31.000Z",
          "Titre": "it is lack of features"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adi Ringer",
          "Nb_Reviews": 1,
          "Date": "2020-01-24T00:25:13.000Z",
          "Titre": "Not very user friendly, but it works",
          "Contenu": "It works, but it's not intuitive. I find it very difficult to find where to click to take actions like printing, duplicating, etc. It's complicated."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Vu",
          "Nb_Reviews": 3,
          "Date": "2020-08-24T20:39:37.000Z",
          "Titre": "Excellent and Great, But Doesn't Have Something That Every Student Needs...",
          "Contenu": "PDFfiller is an excellent tool and overall. It has many features and is exactly what people would think it of; A PDF Editor. It even has many extra features!However, there is one feature that should be there especially during at this time. It is missing an Education Plan that should be free for all that applies for this plan. Students should be able to have this feature available to them to create or edit Homework. All they have to do is sign in using their school account. Why am I saying this? Because I'm a student that needs a PDF Editor really badly for my Homework. And I bet that's even more people out there that need this as well.If they add that feature in PDF Editor, I'll make this rating from 2 stars to 5 stars.Overall, PDF Filler is great and has fantastic features, but lacks the feature that I mentioned above. AND THAT'S A NEED not a want.By the way, I just started using PDF Filler about 4 days ago so I might not know that there IS an edu feature."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Unhappy client",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T21:39:49.000Z",
          "Titre": "no relevant documents found",
          "Contenu": "no relevant documents found, search was not user friendly. Faster and more efficient to type from scratch."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "M AL",
          "Nb_Reviews": 1,
          "Date": "2020-01-07T22:41:29.000Z",
          "Titre": "DIFFICULT TO USE AND JUST  USE IN…",
          "Contenu": "DIFFICULT TO USE AND JUST  USE IN ONLINE WHY I CAN DOWN LOAD IN MY LAPTOP THAT CAN OPEN ANY TIME"
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Ryan James",
          "Nb_Reviews": 5,
          "Date": "2022-03-18T19:14:24.000Z",
          "Titre": "I experienced a few bugs when editing…",
          "Contenu": "I experienced a few bugs when editing made the process longer than expected."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Lange",
          "Nb_Reviews": 1,
          "Date": "2020-01-30T15:49:54.000Z",
          "Titre": "Found it difficult to navigate",
          "Contenu": "Found it difficult to navigate. Never did figure out how to convert to a word document."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dilia Gomez-Queiro",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T03:55:13.000Z",
          "Titre": "im still trying to understand how it…",
          "Contenu": "im still trying to understand how it works its not very user friendly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jane Dziedzic",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T15:53:25.000Z",
          "Titre": "I cannot get my page to print",
          "Contenu": "I cannot get my page to print. Your app is not easy to follow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sandra Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T19:22:21.000Z",
          "Titre": "Not very easy to use!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Beverly Miner",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T20:54:41.000Z",
          "Titre": "Frustrated site!",
          "Contenu": "Kara who helped me was tops, but I was not happy with your site."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "PaulMW",
          "Nb_Reviews": 9,
          "Date": "2021-09-10T20:41:51.000Z",
          "Titre": "\"Buyer Beware\" company... \"30-Day Free Trial\" is actually a \"29-Day Free Trial\"",
          "Contenu": "Folks, this is a \"Buyer Beware\" company.... \"30-Day Free Trial\" is actually a \"29-Day Free Trial\" (\"tricky\" business practice) and I don't do business with companies that pull these kind of tricks.  They charged my credit card on the 30th day, early in the morning at 1AM.  I signed up for the \"free trial\" on August 11th.  August 31st would have been \"20 days\" and September 10th would have been \"30 days.\"  Instead, I saw that they had charged my card on September 10th (the last day of my \"free trial\").Had they not pulled this \"fast one\" (i.e., had they charged my card on the 31st day, instead of on the 30th day of the \"free trial\")... I may have considered keeping them for the year, because they do provide a decent product.  However, once they pulled this \"fast one\" on me, I decided not to continue the subscription.Now, the question is... will I actually get my refund (credit to my card)?  Let's see what \"nut roll\" they put me through for that.  I did receive a confirmation email of the refund, so that's good, but need to go back to confirm in \"5 to 7 days.\"Advice to PDFFiller corporation... don't advertise \"Free 30-day Trial\" when you end up charging the customer on the 30th day.  That's really what pissed me off and had me cancel my subscription.  It's a poor business practice and makes your corporation look tricky and unprofessional."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charles Goldbach",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T03:58:24.000Z",
          "Titre": "Costs too much"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "maria williams",
          "Nb_Reviews": 1,
          "Date": "2021-03-17T17:53:09.000Z",
          "Titre": "yall did a good job helping me out with…",
          "Contenu": "yall did a good job helping me out with thisthank yall so much"
        },
        {
          "Note": 2,
          "Lieu": "IQ",
          "Pseudo": "lahiru disala",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T23:41:37.000Z",
          "Titre": "okjhsjcsajcajcnas"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Maddy",
          "Nb_Reviews": 3,
          "Date": "2019-02-13T20:37:13.000Z",
          "Titre": "Cant send a 1 page document",
          "Contenu": "Cant send a 1 page document. Always sends the whole file."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Straley",
          "Nb_Reviews": 1,
          "Date": "2019-02-09T01:12:04.000Z",
          "Titre": "Very hard to work with without losing…",
          "Contenu": "Very hard to work with without losing input and moving on"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Grant",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T05:07:49.000Z",
          "Titre": "it's complicated and a lot of stress."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Creason",
          "Nb_Reviews": 1,
          "Date": "2020-09-17T12:23:42.000Z",
          "Titre": "I just dont have the need for this…",
          "Contenu": "I just dont have the need for this right now"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomasenia Edwards",
          "Nb_Reviews": 1,
          "Date": "2021-08-16T22:18:56.000Z",
          "Titre": "It is very confusing to use this site"
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "May Cameron",
          "Nb_Reviews": 2,
          "Date": "2020-09-23T13:07:24.000Z",
          "Titre": "User friendly and cost",
          "Contenu": "It is not very user friendly and pricey"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Natalie Gary",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T07:11:05.000Z",
          "Titre": "Huhhj",
          "Contenu": "I get zhjthjvft join the game for"
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Robert Lando",
          "Nb_Reviews": 1,
          "Date": "2021-01-07T16:40:59.000Z",
          "Titre": "Captured images are not very clear"
        },
        {
          "Note": 2,
          "Lieu": "NG",
          "Pseudo": "donna stutmann",
          "Nb_Reviews": 1,
          "Date": "2021-12-07T13:38:53.000Z",
          "Titre": "good",
          "Contenu": "fdsshgjkhcgkjhcljhkjtrudu"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "THOMAS APONTE",
          "Nb_Reviews": 1,
          "Date": "2019-05-29T03:48:38.000Z",
          "Titre": "95OKKKKKKKK",
          "Contenu": "IT WAS OK HAD   ISSSSSSSUUEEESSS"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Dapper",
          "Nb_Reviews": 1,
          "Date": "2020-07-31T23:35:57.000Z",
          "Titre": "If only it was free..."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michele Lang",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T18:25:41.000Z",
          "Titre": "nice",
          "Contenu": "nice xxxxxxxxxxxxxx"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jose Velilla",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T23:30:18.000Z",
          "Titre": "Great.",
          "Contenu": "Great.excellent"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "robbielynn65",
          "Nb_Reviews": 1,
          "Date": "2020-05-26T09:45:55.000Z",
          "Titre": "I’d go he l no in order for the day you that I don’t ya",
          "Contenu": "I’d go he l no invor"
        },
        {
          "Note": 2,
          "Lieu": "BT",
          "Pseudo": "karma sonam",
          "Nb_Reviews": 1,
          "Date": "2019-05-27T07:00:33.000Z",
          "Titre": "not worth the money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T20:47:27.000Z",
          "Titre": "pohj bvnncggc v"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "scott baker",
          "Nb_Reviews": 1,
          "Date": "2021-05-20T00:18:07.000Z",
          "Titre": "excellent app"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matthew Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-11-03T02:41:08.000Z",
          "Titre": "all good",
          "Contenu": "Great program."
        },
        {
          "Note": 2,
          "Lieu": "PH",
          "Pseudo": "Shella",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T21:32:35.000Z",
          "Titre": "Helpful",
          "Contenu": "Helpful. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danielle De Armond",
          "Nb_Reviews": 1,
          "Date": "2019-07-22T04:36:57.000Z",
          "Titre": "Good",
          "Contenu": "Good works well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "L hayes",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T04:34:03.000Z",
          "Titre": "The features are great, the details are shady.",
          "Contenu": "The editor and sign features are great. It is not free to use without putting in your credit card information for a free trial if you actually want to download the file. When you press delete for one character in a textbox, it deletes the entire text box, so backspace key only when editing typos."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Courtney",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:43:46.000Z",
          "Titre": "Stop changing the size of the font…",
          "Contenu": "Stop changing the size of the font everytime you need to edit a line. It makes the document look very unprofessional"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VASHRAM GOLANI",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T04:16:33.000Z",
          "Titre": "BCZ it is simple and fast with…",
          "Contenu": "BCZ it is simple and fast with affordable charges"
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Nikita Borshchov",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T11:38:29.000Z",
          "Titre": "Fonts",
          "Contenu": "Everything is good, but, when I change text of the document provided to me, your app change font to its defaults.As a programmer I understand the reasons and motivation of this, but it would be killer-feature if your app will leave the font so new text will match it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charlotte Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T17:26:26.000Z",
          "Titre": "First",
          "Contenu": "First, Adolbe memership should also include this service. Secondly, once edited, I am not clear on how to save the document and then send it to others to complete without a request for the receivers to create an account and view the document on this site. Please advise."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Belle Konrad",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T16:27:17.000Z",
          "Titre": "It's good but wish there was a basic free option",
          "Contenu": "Quick, easy to use. Can write text, sign, and edit PDFs on your computer. It's nice to use but don't like paying for a service I barely need. They are good because they offer a free trial but this service should be free"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail Stout",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T16:29:11.000Z",
          "Titre": "Seems to work okay",
          "Contenu": "Seems to work okay but sad that I had to sign up for a trial before I could actually save the document. Editing is a little clunky but does get the job done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nieves Treasurecoast",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T23:53:24.000Z",
          "Titre": "There are great customization options…",
          "Contenu": "There are great customization options but there were some issues with realignment of existing text that needs to be edited.  When selecting a line of text it defaults to a vertical position and there's no way to simply resize and drag into where it's supposed to go, between other lines of text. This caused me to rewrite an entire document."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christina Uhlman",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T15:45:56.000Z",
          "Titre": "Still learning.",
          "Contenu": "I'm just working on learning how everything works. I've barely had the opportunity to test it out so until I get a little further into the trial I won't have much more feedback."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Delk",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T17:52:29.000Z",
          "Titre": "pretty good for the basic I may upgrade later.",
          "Contenu": "I like all the pre-fillable boxes and that they are customable. try to figure out how to size the schedule was a little hard to figure and there may be and easier way that I haven't found yet.."
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "Dentist Hamzallah",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T19:02:55.000Z",
          "Titre": "good",
          "Contenu": "that was good experience for me its amazing sit for work"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tonja Davis",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T16:41:59.000Z",
          "Titre": "I'm satisfied with THIS experience",
          "Contenu": "I'm satisfied with THIS experience. I was able to turn my pdf resources into a virtual resource that my students can complete online. However, I still have not been able to successfully obtain signatures from my Board of Directors which is the reason I decided to pay for this resource."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "W Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T07:32:03.000Z",
          "Titre": "Good and effective software",
          "Contenu": "Good and effective software, just a wee bit expensive for my needs which are very infrequent.   Highly recommend for someone who has major use"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Mme TALLY Aude",
          "Nb_Reviews": 2,
          "Date": "2023-01-28T21:35:57.000Z",
          "Titre": "1st trial is not free",
          "Contenu": "It's kind of tricky to find out that you have to pay in order to download a document you had spent time on. I did suscribe because I didn't want to feel like I'd wasted my time. This is a pretty agressive marketing move you play on costumers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LoiuAnne Cochran",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T22:44:26.000Z",
          "Titre": "I purchased this app today so I need…",
          "Contenu": "I purchased this app today so I need more time using to give it a higher score but so far I am very impressed with the program."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Shymaa taha",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T23:23:21.000Z",
          "Titre": "i like the fast response of the support…",
          "Contenu": "i like the fast response of the support teami dislike the word file editting is missing a lot of  editting details"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Leigh-anne",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T08:48:56.000Z",
          "Titre": "Document editing",
          "Contenu": "I like the way you can edit documents reasonably easily. However it is hard to delete ticks and circles once you have added then to a document."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "moncef khouchane",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T10:12:36.000Z",
          "Titre": "Spacing",
          "Contenu": "I tried changing some numbers but the spacing and editing space were not very efficient."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ardella Gillis",
          "Nb_Reviews": 2,
          "Date": "2023-03-17T22:26:41.000Z",
          "Titre": "I'm satisfied with the service thus…",
          "Contenu": "I'm satisfied with the service thus far...just don't like having to keep upgrading just to print my documents."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Silvie",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T05:07:38.000Z",
          "Titre": "When I tried to access some forms a few…",
          "Contenu": "When I tried to access some forms a few days ago, the site told me it was temporarily not available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "tina getz",
          "Nb_Reviews": 5,
          "Date": "2023-08-28T23:11:19.000Z",
          "Titre": "im good just sometimes dont understand…",
          "Contenu": "im good just sometimes dont understand if im filling everything out im suppose to"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vevian Brotherton",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T14:42:37.000Z",
          "Titre": "filing the form with to many obstacles…",
          "Contenu": "filing the form with to many obstacles to send it out to the party with no information to process the document to the party involve"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "chandan",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T03:25:09.000Z",
          "Titre": "good",
          "Contenu": "good, but it is asking for feedback before even trying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "umer ishtiaq",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T22:12:43.000Z",
          "Titre": "doesn't match the exact format",
          "Contenu": "doesn't match the exact format, for example if one word is bolded and different color in a sentence and rest of sentence isn't, it will do the same format as rest of the sentence."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jefferson Davis",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T22:27:26.000Z",
          "Titre": "User management is not very…",
          "Contenu": "User management is not very enterprise-friendly.  Had a HORRID time transferring account ownership to another user.  Not well thought out."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "JANNA",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T10:23:19.000Z",
          "Titre": "No refund yet",
          "Contenu": "I was told the test charge (2USD) for the FREE TRIAL would be reimbursed today (Nov 17, 2022) since it was charged Nov 14th. Until now, no refund was processed."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "HAZIM ALSADI",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T12:14:31.000Z",
          "Titre": "....",
          "Contenu": "............"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maïsha",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T16:32:31.000Z",
          "Titre": "Mostly great",
          "Contenu": "Would appreciate being able to edit bullet points and match the font of the document, but super helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda Bradley",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T13:14:52.000Z",
          "Titre": "because of being informed of section to…",
          "Contenu": "because of being informed of section to enter included made information easier to file out. Quicker process."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donald Green",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T20:27:27.000Z",
          "Titre": "Meh ...",
          "Contenu": "Processes to load documents and to save by name are too complicated."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Jeniffer Fajardo",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:50:27.000Z",
          "Titre": "easy to use like convertion of…",
          "Contenu": "easy to use like convertion of documents from different application."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nathan Fatiga",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T23:41:44.000Z",
          "Titre": "I would like an option to auto fill…",
          "Contenu": "I would like an option to auto fill colored spaces as text boxes"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T22:51:49.000Z",
          "Titre": "Suckered in",
          "Contenu": "I was just looking to fill out a long form online saw the form was free and was the one I wanted . After several hours completing the form ,I went to print out then had to sign up min $10 per month . I only wanted one off but no ...then you need credit details  and excess amount of money in account ect ect  I'm really annoyed spent so much time on this Give me one off option ..."
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "VSS Linh kiện",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T06:28:58.000Z",
          "Titre": "free trial but i have hapy when app…",
          "Contenu": "free trial but i have hapy when app convert pdf to word whit 8$, why ?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela Silmon",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T16:33:10.000Z",
          "Titre": "N/AA",
          "Contenu": "I'm just starting, haven't had any experiences yet"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Leuenhagen",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T19:22:12.000Z",
          "Titre": "A little tricky to navigate text boxes"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "tomball2",
          "Nb_Reviews": 17,
          "Date": "2022-10-13T11:58:29.000Z",
          "Titre": "After paying for years, I've wasted an hour unable to login",
          "Contenu": "I've been paying each year for several years - just wasted an hour failing to login - getting repeated \"Not recognised - click the confirmation email\" - \"That email has expired\" - and repeat 20 timesSupport replied but were unable to helpUseful but expensive when it works"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aisha Muhammad",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T00:23:22.000Z",
          "Titre": "Take your time",
          "Contenu": "It easy to navigate through system"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Melissa Evans",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T18:16:24.000Z",
          "Titre": "Pretty Easy to use",
          "Contenu": "This provided me with a way to complete forms for my school in a clean professional manner."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Adedolapo Olutuyo",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T11:48:48.000Z",
          "Titre": "Easy to use",
          "Contenu": "The web based application is very easy to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Agustin Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:41:18.000Z",
          "Titre": "Need to improve"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Iris Mitchell",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T18:43:59.000Z",
          "Titre": "Optimum service contract",
          "Contenu": "We just need to file and print documents."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "nonsikelelo khumalo",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T08:39:41.000Z",
          "Titre": "ey am still tryin to figure out"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Nick H",
          "Nb_Reviews": 16,
          "Date": "2022-10-28T14:55:19.000Z",
          "Titre": "Not perfect but cheaper than the real…",
          "Contenu": "Not perfect but cheaper than the real Adobe and I have never used that so not sure if the functionality is the same to be honest."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan Bixby",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T20:38:48.000Z",
          "Titre": "Your wording greatly confuses me",
          "Contenu": "Your wording greatly confuses me.  I lost one document that I filled in prior to paying my yearly fee and free 30 days.  I spent hours looking for the completed medication form.  And now that I paid my fee I don't know what it does for me.  I still can't locate saved work.  Anytime I save my work I can never locate it again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rebecca Ellis",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T00:46:54.000Z",
          "Titre": "Not professional!",
          "Contenu": "I can't print my documents?"
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T09:27:22.000Z",
          "Titre": "I am new to this tool so far it is…",
          "Contenu": "I am new to this tool so far it is good, will be update my review on the upcoming days using pdfFiller. Thanks!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marvin Moore",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T18:12:30.000Z",
          "Titre": "THIS PLAN IS NOT CLEAR.",
          "Contenu": "did not get enough information."
        },
        {
          "Note": 3,
          "Lieu": "UY",
          "Pseudo": "Raul Montero",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T01:27:36.000Z",
          "Titre": "Is good",
          "Contenu": "Is good, but no very easy to use."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael F.",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T04:19:07.000Z",
          "Titre": "Liked the product but....",
          "Contenu": "Liked the product because it had a number of documents built in. I had trouble getting the completed documents to properly download. Formatting was an issue so could not be used for legal purposes. Had to use a competitive software to complete the work."
        },
        {
          "Note": 3,
          "Lieu": "OM",
          "Pseudo": "Huda Al Kharusi",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T19:28:42.000Z",
          "Titre": "useful",
          "Contenu": "long process of saving"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Kirkeby",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T23:09:35.000Z",
          "Titre": "It would be nice to be able to copy and…",
          "Contenu": "It would be nice to be able to copy and paste into a PDF document.  Copy text on a web site, for instance, and paste into PDF doc."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Simone Toya",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T19:36:10.000Z",
          "Titre": "No Comment",
          "Contenu": "No comment. I do not wish to write a review"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tawiah Sanders",
          "Nb_Reviews": 1,
          "Date": "2021-11-23T22:05:48.000Z",
          "Titre": "I had to call in for assistance to…",
          "Contenu": "I had to call in for assistance to learn how to maneuver the document and access the tools need to successfully fill it in.  It took a lot of my time and I had to eventually get the person assisting me to share screens with me and have access to remote control.  In the end, all worked out well.  I believe it will be smooth sailing from this day forward."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John B.",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T01:28:17.000Z",
          "Titre": "IT WOULD BE BETTER IF THE USER WERE…",
          "Contenu": "IT WOULD BE BETTER IF THE USER WERE ABLE TO CONTINUE WRITING FROM ONE LINE TO THE NEXT LINE. IT IS FRUSTRATING TO HAVE TO DO WRITING LINE BY LINE. IT IS  INEFFICIENT TO HAVE TO RE-ENTER DATA BECAUSE YOU NEED TO ADD MORE CHARACTERS TO ONE LINE. IT WOULD BE BETTER TO HAVE THE INPUT WRAP AROUND AUTOMATICALLY FROM ONE LINE TO THE NEXT LINE."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Truman Coggins",
          "Nb_Reviews": 2,
          "Date": "2022-05-25T17:55:24.000Z",
          "Titre": "The form/certificate I received was not…",
          "Contenu": "The form/certificate I received was not current.  I received a form with a 2010 copyright.  Currently, the form has a 2017 copyright(May 25,2022 _  The document I received was Condominium Resale Certificate (Form 27) -- Rev. 7/10)"
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Ikwam Asyraf SXKELS",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T15:01:22.000Z",
          "Titre": "The support team of pdfFiller and the system.",
          "Contenu": "The support team of pdfFiller is very good. They attend to explain until the questions is answered. And of course it is about the auto renewal issue. But, the system about the auto renewal cahrged without any priority email due to the (near to end free trial) should be improved. Maybe the pdfFiller assigned team can take this to help them to resolve this issue. And sure, the clients will more happy with the system and will take this organization to the top."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kye White",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T20:15:30.000Z",
          "Titre": "It helped me with my fillable PDF"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "NOELIE YAOGO",
          "Nb_Reviews": 1,
          "Date": "2022-02-09T03:03:44.000Z",
          "Titre": "It's a beginning with this attractive…",
          "Contenu": "It's a beginning with this attractive free acces offer. And I have troubles with notification signs. I need more explanation about how to use my account for all purposes. What about the choice of english or french languages or else?"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Ijaz Muhammad",
          "Nb_Reviews": 1,
          "Date": "2023-02-01T13:11:21.000Z",
          "Titre": "nothing",
          "Contenu": "Its quite difficult and time consuming"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Humberto Foyaca Sibat",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T16:42:34.000Z",
          "Titre": "Sorry",
          "Contenu": "Sorry, I have been having difficulties to get access to this program because it is reachable in my computer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "andrea nicole",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T21:22:25.000Z",
          "Titre": "Quick Solution",
          "Contenu": "Works well for what I needed. The advanced options are a bit difficult. Need some training to make more user friendly."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Chelsea Scott",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T17:49:04.000Z",
          "Titre": "ok to use",
          "Contenu": "It's not Adobe PDF writer but it is teh next best thing."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Paulo Ribeiro",
          "Nb_Reviews": 1,
          "Date": "2022-02-19T22:44:11.000Z",
          "Titre": "I can't choose the size and color of…",
          "Contenu": "I can't choose the size and color of the text per line. The highlight only shows after I save it not during edition.I couldn't dele images on the pdf, so for so good but IT COULD BE A LOT BETTER"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angela J Sacca",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T20:23:05.000Z",
          "Titre": "Still Learning program",
          "Contenu": "Still learning."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Fischer",
          "Nb_Reviews": 3,
          "Date": "2022-01-19T15:53:40.000Z",
          "Titre": "A little cumbersome, but my needs were complicated.",
          "Contenu": "A little cumbersome, but mostly the activity I was trying to do was too complicated for me - a home sale - and I needed a title company anyway, so I let the title company handle the documents."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Unathi Hoza",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T23:09:35.000Z",
          "Titre": "This app helped me to combine",
          "Contenu": "This app helped me to combine my documents for an important document."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Connie",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T20:53:53.000Z",
          "Titre": "GUARDIANSHIP FORMS ARE GREAT",
          "Contenu": "i DON'T LIKE THE PRINTING SYSTEM, IT COULD BE A LITTLE MORE SIMPLIFIED."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "henry Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T00:41:34.000Z",
          "Titre": "the edit pen button dose not work well"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gloria Hinkle",
          "Nb_Reviews": 1,
          "Date": "2021-12-04T16:44:21.000Z",
          "Titre": "I did not want to have to open a site…",
          "Contenu": "I did not want to have to open a site wherein I have to pay for the form.  I just wanted to save it to my own system and edit and print.  I will be cancelling as soon as I can."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T16:15:16.000Z",
          "Titre": "its ok",
          "Contenu": "its ok. wont be needing it for a long time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ayman mallouk",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T21:06:19.000Z",
          "Titre": "its too expensive"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Lisa Kittel",
          "Nb_Reviews": 1,
          "Date": "2021-09-21T20:51:40.000Z",
          "Titre": "Its a nice tool but I couldnt find an…",
          "Contenu": "Its a nice tool but I couldnt find an option where I could cut the document so that one wouldnt see the shadows from the borders of the book or sometimes markers that  I used"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T12:05:36.000Z",
          "Titre": "all in all a good service",
          "Contenu": "all in all a good service the only reason I haven't given it a higher score is because of the pricing, for standard/basic pack its a bit steep but overall gets the job done"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet White",
          "Nb_Reviews": 1,
          "Date": "2022-10-29T15:39:14.000Z",
          "Titre": "Down loads for Medicare",
          "Contenu": "It gives you good instructions. I like the desktop view"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "Norman Tan",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T10:14:24.000Z",
          "Titre": "good",
          "Contenu": "vey useful tools"
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "MONTREE SRISA-NGA",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T17:33:10.000Z",
          "Titre": "good",
          "Contenu": "let try with hope good result"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Roaa",
          "Nb_Reviews": 1,
          "Date": "2021-11-16T11:17:43.000Z",
          "Titre": "im trying to find out where i can bring…",
          "Contenu": "im trying t find out where i can bring up a pdf file and actually fill it out on my laptop...hopefully i can grt th basics jon how to do that very shortly"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "ladeehilton",
          "Nb_Reviews": 1,
          "Date": "2022-01-06T22:10:44.000Z",
          "Titre": "It is very confusing to use and it take…",
          "Contenu": "It is very confusing to use and it take a very long time to create a perfect document but it does get the job done. Overall I am satisfied with it."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Muhammad Hafiz",
          "Nb_Reviews": 1,
          "Date": "2022-09-11T11:26:17.000Z",
          "Titre": "good game",
          "Contenu": "asdwrwrew rsfsfspsdkfsdkfosdkfosdkfodskfoakofkasdofkdsaofodskfodaskfoaskdfoksdfoasdkfsdaf"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JiaTeia McDaniel",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T03:53:54.000Z",
          "Titre": "I wish it kept the same exact fonts and…",
          "Contenu": "I wish it kept the same exact fonts and didn't shift the lines or make white boxes around the edits. Otherwise it would be 5 stars"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Craig Dawson",
          "Nb_Reviews": 1,
          "Date": "2022-04-09T00:00:45.000Z",
          "Titre": "Good comms",
          "Contenu": "Since contacting admin they have refunded the cancellation fee, appreciate that.Their communication is prompt."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ben Tejada",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T19:36:02.000Z",
          "Titre": "User friendly",
          "Contenu": "User friendly, but did not have certain editing features that would be expected when editing images"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donnie Gaines",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T05:55:30.000Z",
          "Titre": "The way the forms are set up to print."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Veronica Venter",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T12:21:27.000Z",
          "Titre": "Good",
          "Contenu": "Good, easy to use. Tough on saving the document to laptop but figured it out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dana S.",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T21:04:50.000Z",
          "Titre": "Not Easy",
          "Contenu": "It would be easier to be able to have different font types and other features.  Not as easy as I expected it to be"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "gogreen",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T07:18:40.000Z",
          "Titre": "Ita good program very useful if you…",
          "Contenu": "Ita good program very useful if you need to use it a lot but not worth it for just a few uses"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "McNick",
          "Nb_Reviews": 2,
          "Date": "2022-04-08T21:16:53.000Z",
          "Titre": "Cumbersome",
          "Contenu": "Cumbersome . . . have acrobat professional . . . works better. Will be cancelling my membership."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carolyn Lyon",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T01:06:02.000Z",
          "Titre": "It was ok",
          "Contenu": "It was ok, worked thur the mailing issue."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "blaise makanda",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T03:13:26.000Z",
          "Titre": "BBMAK",
          "Contenu": "I DID LIKE IT. KEEP UP A GOOD WORK."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Paula Zumbehl",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T15:48:25.000Z",
          "Titre": "New at this and didn't think it was…",
          "Contenu": "New at this and didn't think it was that user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Battle",
          "Nb_Reviews": 3,
          "Date": "2022-09-21T18:45:26.000Z",
          "Titre": "Too early to tell",
          "Contenu": "Too early to tell - experience limited to one document."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kishore Reddy",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T02:54:29.000Z",
          "Titre": "the color of pdf loaded is different…",
          "Contenu": "the color of pdf loaded is different from orginal doc"
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Pavel Sindlar",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T09:20:58.000Z",
          "Titre": "Satisfied but expensive if you just…",
          "Contenu": "Satisfied but expensive if you just need to edit one or two documents once in a while."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2022-03-22T19:56:13.000Z",
          "Titre": "The template form is clunky and hard to…",
          "Contenu": "The template form is clunky and hard to get field sizes to match.  Otherwise, so far, fine."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wilma Battle",
          "Nb_Reviews": 2,
          "Date": "2022-07-28T23:15:37.000Z",
          "Titre": "You should have access to a one time…",
          "Contenu": "You should have access to a one time fee if this is not used frequently,"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lakesha Lewis",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T02:07:09.000Z",
          "Titre": "I did not like how it says 30 days free…",
          "Contenu": "I did not like how it says 30 days free but still charged my card. That is a little deceptive for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ricki Mongold",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T16:35:07.000Z",
          "Titre": "I believe this pdfiller to be…",
          "Contenu": "I believe this pdfiller to be exclusive. Thanks for such an exclusive piece of software. Thumbs Up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "hannahwill",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T17:06:53.000Z",
          "Titre": "Kind of easy to use",
          "Contenu": "Kind of easy to use, but there is a lot going on and it can be overwhelming."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amy Hodgkin",
          "Nb_Reviews": 1,
          "Date": "2021-08-02T19:34:33.000Z",
          "Titre": "pdfFiller Review",
          "Contenu": "For the most part, I like the app, but I still struggle with converting pdf into Excel documents."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Akande John",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T15:59:50.000Z",
          "Titre": "Great and efficient",
          "Contenu": "Great work. But still have issue uploading the pdf doc to the kindle textbook creator."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MaKenzie Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:52:36.000Z",
          "Titre": "I think this website is great",
          "Contenu": "I think this website is great. The only thing is when I go to save it and then re open. Sometimes the words are scrambled but it didn't look like that before I  saved it. I  don't know if it's my laptop or the site. But overall it's great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Beardown",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T00:23:12.000Z",
          "Titre": "When I chatted with support",
          "Contenu": "When I chatted with support, I had had two different people who took the files I had been trying to merge unsuccessfully and merge them for me!!!   Similarly when I had trouble with blank pages and missing pages in a merged document I found out it was because I was using Edge as my browser instead of Chrome.   It would have been best if that had been in the program itself, but support really came through to help me out."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Mithilesh Pandey",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T11:35:05.000Z",
          "Titre": "It was a little slow at the beginning…",
          "Contenu": "It was a little slow at the beginning until all information required was visible to agent - perhaps of the template for reply used. After that it was very quickly resolved. Thank you for todays agent.It was a little slow at the beginning until all information required was visible to agent - perhaps of the template for reply used. After that it was very quickly resolved. Thank you for todays agent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tanner",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T20:40:40.000Z",
          "Titre": "Great LINK TO FILL feature!",
          "Contenu": "PDF Filler's Link to Fill makes sharing and finishing documents easy, boosting teamwork and getting things done faster."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daoshan Sun",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:59:26.000Z",
          "Titre": "you have old versions of the form"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sulmi Perez",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:26:37.000Z",
          "Titre": "I was able to create forms for our…",
          "Contenu": "I was able to create forms for our school enrollment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michele Hays-Morton",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:43:12.000Z",
          "Titre": "I've been really happy with how easy it…",
          "Contenu": "I've been really happy with how easy it is to find certain forms, then fill them in and print them, but I wasn't able to find a few forms I needed and had to look for them elsewhere. I'd be ecstatic if all the forms I needed were all in one place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Myra",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T04:41:41.000Z",
          "Titre": "duplicate pages",
          "Contenu": "I like being able to duplicate pages, that was super helpful. It was easy to add the text boxes where I needed them. The only trouble is in downloading the document to my regular google drive. Wish that was more straight forward."
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Fadjar DJOHAN",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T14:00:04.000Z",
          "Titre": "very difficult to operate",
          "Contenu": "Make it simpler to use for computer iliterate like me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bilgemeister",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T22:22:04.000Z",
          "Titre": "several clunky features",
          "Contenu": "There are several clunky features I did not like.  (1) My first issue was that when editing text, the font would change from Times New Roman to Arial within the edit box.  The user had to \"tell\" the computer to switch back to Times New Roman.(2) Another issue I spotted is that if I want to italicize ONE word on a line of text, the entire line will become italicized.  This was cured by deleting the italicized word, then creating a separate text box with the italicized word in it.  The italic text box was dropped into the line of text with the plain text around it.(3) When editing text, the size of text will drop down a size or two.  The writer must \"bump\" up the text size with the upward arrow to get it to match the text in the original document.Otherwise, I like using PDFfiller.  Of course, PDF editing is not as simple as ordinary word editing.   Or perhaps PDF editing gets easier after continual practice."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Minj",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:51:08.000Z",
          "Titre": "It is great to edit files but have had…",
          "Contenu": "It is great to edit files but have had some difficulties to save files in the location I wanted in my device."
        },
        {
          "Note": 4,
          "Lieu": "GY",
          "Pseudo": "Jarrel",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:47:32.000Z",
          "Titre": "Great stuff",
          "Contenu": "Great product, it really helps to edit and fill out PDFs, but the paywall."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-07-16T07:10:25.000Z",
          "Titre": "First review",
          "Contenu": "It works better than most others I've tried.It is sometimes a bit difficult to navigate as I dont use it too often. I dii have an issue with support, but they did finally undertand my query and they fixed it up, with a very good explanation."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Haminat Adebisi",
          "Nb_Reviews": 3,
          "Date": "2023-06-11T19:26:43.000Z",
          "Titre": "PDFiller is awesome",
          "Contenu": "Being able to edit a PDF online is great, and having to give a whopping 30-day free trial is awesome. However, I think some things should be incorporated, like been able to move the typed words easily rather than having to cut and paste."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J SalciDo G",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T06:43:13.000Z",
          "Titre": "It was not that dufficult figuring out…",
          "Contenu": "It was not that dufficult figuring out how and what edit tools to use. It's layout is simple and on point,  It does not take a brainologist to utilize.NICE,  I can \"DIG\" it......"
        },
        {
          "Note": 4,
          "Lieu": "MP",
          "Pseudo": "C.T, Jr.",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T08:26:24.000Z",
          "Titre": "Worthy",
          "Contenu": "Once I was able to avail to the 30-day trial, all the features available makes this such a good and worthy investment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EW",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T05:36:50.000Z",
          "Titre": "Program didn't make it clear that…",
          "Contenu": "Program didn't make it clear that modified PDFs were limited to 5 on the free trial basic version"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Fiona",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T07:43:05.000Z",
          "Titre": "So far, so good",
          "Contenu": "So far, so good. pdfFiller seems quite intuitive although I think navigating the site isn't as easy as I thought it would be."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "works great",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T17:41:55.000Z",
          "Titre": "Working great for filling out forms",
          "Contenu": "Working great for filling out forms, on my phone or PC saving and printing. However, trouble signing in when opening file from email and works more smoothly if signed in before opening."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SHARON BLUE",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T00:36:06.000Z",
          "Titre": "The form was fairly easy to alter and…",
          "Contenu": "The form was fairly easy to alter and print. However, I did have a lot of difficulty inserting text into the box below the name of my company. I was not able to make the font different sizes for highlighted text which was even on different lines. I did not make the form the way I would have preferred but I am overall satisfied."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Lutz",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T04:18:32.000Z",
          "Titre": "The application itself is amazing..",
          "Contenu": "The application itself is amazing... everything works great... awesome features... easy to use... convenient... BUT... as with all of these services... they threaten you with a ridiculous amount ($96 for the basic annual subscription) if you forget to cancel your membership... and if I pay $96 I want lifetime access to something... or I'm not doing it, period.  That's insane.  It costs them next to nothing to maintain this website... it's just advertising.  Oh, and they come up as a free online editor but then you gotta sign up for the trial and everything else... the hassle never ends.  If this place let everyone use it for free they could make a killing on all the advertising they could sell... and everyone would get a free editor... anyway, I digress... enjoy the app!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ryan Grant",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T15:23:16.000Z",
          "Titre": "Quick and easy to use",
          "Contenu": "Easy to import, make changes and export for printing/sending onwards of pdfs"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriela Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T21:26:04.000Z",
          "Titre": "Its easy to follow",
          "Contenu": "Its easy to follow, but I sometimes the text does not match lines in some forms where each number must go in different boxes."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Felix E. Martinez",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T13:54:03.000Z",
          "Titre": "PDF Filler highlight feature.",
          "Contenu": "I really like the highlight feature which is not offered on most PDF editor software's or online services."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T11:23:36.000Z",
          "Titre": "The site was a little bit slow",
          "Contenu": "The site was a little bit slow, but it had tons of useful features, and I found the user interface much more intuitive than Adobe reader. I'd recommend it to anyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "OhDamn_it",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T06:48:17.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use. Has mostly all needed features. Free trial offer is great."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Althahunter Mamao",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T20:52:56.000Z",
          "Titre": "good",
          "Contenu": "Easy to use and user friendly"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Silvia Zublasing",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T11:27:21.000Z",
          "Titre": "Very friendly and effecrtive costumer service",
          "Contenu": "I was unfortunately billed for the yearly subscription although i had already canceled the free trial. Costumer service was very friendly and fixed the problem immediately, I got my money back the same day!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Paul Milynn",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T07:10:58.000Z",
          "Titre": "would be better if info put in on first…",
          "Contenu": "would be better if info put in on first sheet populated the other sheets"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Patricia Boyette",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T06:44:22.000Z",
          "Titre": "IAM SERIOUSLEY LOVING IT ON MY PC MUCH…",
          "Contenu": "IAM SERIOUSLEY LOVING IT ON MY PC MUCH HARDER ON MY PHONE BUT I CAN SEEMLESSLEY MOVE FROM WORKING ON MY PHONE TO MY PC WITH NO ISSUES AND THAT IS LIKE GOLD TO ME!!!!!!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bryant Troutman",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T19:42:43.000Z",
          "Titre": "Good service",
          "Contenu": "This ia great service, but you shouldn't allow people to fill out entire PDFs just to push them into creating an account and starting a free trial. Be upfront."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sherri Palmer",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T23:27:52.000Z",
          "Titre": "Support team makes it right",
          "Contenu": "The support team was very very helpful in ensuring that my concerns were taken care of quickly and with kindness."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriel Shearin",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:54:00.000Z",
          "Titre": "I am new to anything like this",
          "Contenu": "I am new to anything like this, so really I just enjoy the help. and its a lot cheaper than adobe"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Mylena",
          "Nb_Reviews": 4,
          "Date": "2023-11-08T14:18:11.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service! I had a problem with my subscription, contacted their customer support, and within 10 minutes they responded and solved my problem!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edwin Mckinney",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T06:27:24.000Z",
          "Titre": "This was an awesome experience",
          "Contenu": "This was an awesome experience. Everything is perfect with any questions needed their articles to help you."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Thabang Seleoane",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T09:19:06.000Z",
          "Titre": "The PDF editor is fantastic",
          "Contenu": "The PDF editor is fantastic, however, when you want to edit a line, it takes too long, before it gives you access to it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddy",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T02:34:11.000Z",
          "Titre": "this app has allowed me to fill in…",
          "Contenu": "this app has allowed me to fill in documents and get them to my lawyer even while 5000 miles away while traveling for work"
        },
        {
          "Note": 4,
          "Lieu": "JM",
          "Pseudo": "Javon Walford",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T05:45:26.000Z",
          "Titre": "very easy to edit",
          "Contenu": "very easy to edit. Also I wish it had feature to make text Bold and in same font as original document. but other than that was great"
        },
        {
          "Note": 4,
          "Lieu": "BD",
          "Pseudo": "nasrin akter",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T07:00:31.000Z",
          "Titre": "Overall",
          "Contenu": "Overall, just a great site. Very user friendly and has several documents that can be utilized. Highly recommend PDFFiller to all."
        },
        {
          "Note": 4,
          "Lieu": "ZW",
          "Pseudo": "Daniel Winyard",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T15:11:42.000Z",
          "Titre": "So far so good",
          "Contenu": "I think the app is very good, well worth the price. Some features would be really good to have on the offline app. Only had it one day but other than that the editing tools are perfect for my business needs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeanvil Despeines",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T20:07:09.000Z",
          "Titre": "It's great",
          "Contenu": "It's great, but the E-signature is not user friendly."
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Tú Bình",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T06:43:55.000Z",
          "Titre": "It is so so",
          "Contenu": "It is so so, i have no idea"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Ravi Kumar COMPUTER SCIENCE",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:47:17.000Z",
          "Titre": "good",
          "Contenu": "Very easy to use"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "abuayyub",
          "Nb_Reviews": 3,
          "Date": "2023-11-01T22:33:04.000Z",
          "Titre": "Seems very good dis all that i needed",
          "Contenu": "I had some important changes i needed to make to a document. this tool helped me achieve that."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "CMJ SCRAP METAL AND RECYCLE SE",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:07:10.000Z",
          "Titre": "GOOOOOD WORK ESILY EDIT DDOCUMEWNT"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Hansen",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T05:36:14.000Z",
          "Titre": "Helpful to my practice",
          "Contenu": "It worked and I could find many of the documents that I needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paul Fucile",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T22:27:00.000Z",
          "Titre": "Perfect!",
          "Contenu": "pdffiller is so simple and easy to use. There's no guess work. Upload, edit, save, and download. Perfect!"
        },
        {
          "Note": 4,
          "Lieu": "LK",
          "Pseudo": "Gayan Anuruddha",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:43:47.000Z",
          "Titre": "easy",
          "Contenu": "it is a great experience for me  I recommended others"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "nunya",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T01:22:07.000Z",
          "Titre": "decent ui",
          "Contenu": "decent ui, would recommend"
        },
        {
          "Note": 4,
          "Lieu": "UG",
          "Pseudo": "Abuni Joseph",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:55:13.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent, great and nice without any problem"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "JEREMIAH THOMPSON GONA",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:18:51.000Z",
          "Titre": "Easy to use the tools."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthai Freeman",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T02:41:12.000Z",
          "Titre": "PDFiller works",
          "Contenu": "I needed a new document, and I was easy to turn it in because, it was a fillable form."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "neill randle",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T23:43:06.000Z",
          "Titre": "being able to fill out",
          "Contenu": "being able to fill out, edit and sign electronically have helped me immeasureably"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brent Kemp",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T00:12:29.000Z",
          "Titre": "Being able to e-sign my documents."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ALEC GUNN",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T01:47:26.000Z",
          "Titre": "PDF Filler has helped me create…",
          "Contenu": "PDF Filler has helped me create templates for my business and has really made the process easier."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "Sayedmansoor Sadat",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T02:01:28.000Z",
          "Titre": "it's easy and simple to manage your…",
          "Contenu": "it's easy and simple to manage your documents over all I recommend the app to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "STEPHEN FANKHAUSER",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T00:48:35.000Z",
          "Titre": "EASE OF USE",
          "Contenu": "NOT GENERALLY VERY GOOD WITH THESE SOFTWARES, BUT QUICKLY ADAPTING."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A.R.",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T19:03:24.000Z",
          "Titre": "Great but Pricey",
          "Contenu": "Great tool and I do have the paid version but the cost is a bit much. Not sure I would renew membership. That will be based on your personal needs."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "mohini shabnam",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T08:00:09.000Z",
          "Titre": "Useful soft",
          "Contenu": "Useful soft. Easy to use. too expensive for me,otherwise i would keep the subscription."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hulanda Prince",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T19:19:58.000Z",
          "Titre": "I'm still learning the website",
          "Contenu": "I'm still learning the website, I haven't used all that it offers yet. But I am satisfied so far"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gwyndolyn Luke",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T19:48:33.000Z",
          "Titre": "great",
          "Contenu": "This service is great! Im able to do all my office duties with this service."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Jan Wagner",
          "Nb_Reviews": 6,
          "Date": "2023-08-30T18:35:42.000Z",
          "Titre": "Even for abit of a digi-bite like me",
          "Contenu": "Even for abit of a digi-bite like me, it is easy to work with after some practice"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Nandha",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T10:29:57.000Z",
          "Titre": "Good we really happy to use this…",
          "Contenu": "Good we really happy to use this pdffiller.com"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Ahmed Khalil",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T20:44:22.000Z",
          "Titre": "very good experience",
          "Contenu": "very good experience and useful"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Saeed Qadri",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T17:16:31.000Z",
          "Titre": "VERY USEFULL"
        },
        {
          "Note": 4,
          "Lieu": "VN",
          "Pseudo": "Zing",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T07:35:05.000Z",
          "Titre": "UI is not beautiful",
          "Contenu": "UI is not beautiful, the content is condensed. However, it is easy to use and overall is good."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mrs Louise Percival",
          "Nb_Reviews": 8,
          "Date": "2023-10-27T18:46:11.000Z",
          "Titre": "Remarkable intelligent software",
          "Contenu": "Remarkable intelligent software, grabs pdf and does a great job of making it editable"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Lutfi Arif",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T15:19:05.000Z",
          "Titre": "good aplication for convert pdf and for…",
          "Contenu": "good aplication for convert pdf and for study working task"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "PRAVESH BHATT",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T17:53:29.000Z",
          "Titre": "great platform",
          "Contenu": "nice editing platform with quick response time"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "delbosquemafer",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T20:38:33.000Z",
          "Titre": "I wish there was a better/easier way to…",
          "Contenu": "I wish there was a better/easier way to skip between blanks to fill, but it's still the best tool out there!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stavros P",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T16:12:37.000Z",
          "Titre": "It's a great product",
          "Contenu": "It's a great product, but I wish it had more tools like a pencil tool."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rwattt",
          "Nb_Reviews": 3,
          "Date": "2023-07-23T21:45:57.000Z",
          "Titre": "I'll Let you know later as I fill out…",
          "Contenu": "I'll Let you know later as I fill out additional documents"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "KM",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T19:39:13.000Z",
          "Titre": "Easy To use",
          "Contenu": "Request you provide and view font and size selections"
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Vakiss Bogning",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:18:48.000Z",
          "Titre": "satisfation",
          "Contenu": "I'm very satisfied for now."
        },
        {
          "Note": 4,
          "Lieu": "EC",
          "Pseudo": "Mateo Coronel",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T05:10:08.000Z",
          "Titre": "Great",
          "Contenu": "I like it since I was allowed to move different parapraghs so it was useful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ERON CARTER",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T00:09:40.000Z",
          "Titre": "Simple and straight to the point",
          "Contenu": "My experience was good because it was simple to work with and straight to the point"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "lex",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T09:40:07.000Z",
          "Titre": "clean and easy to use sofftware",
          "Contenu": "So easy to install and use without reading up on the manual or guide."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "L Hobbs",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T07:39:29.000Z",
          "Titre": "I have only used the program twice thus…",
          "Contenu": "I have only used the program twice thus far.   I have not encountered any annoying glitches yet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tevolutionregmail.com",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T01:55:16.000Z",
          "Titre": "I was able to move quickly once I…",
          "Contenu": "I was able to move quickly once I realized what the software is capable of!"
        },
        {
          "Note": 4,
          "Lieu": "TN",
          "Pseudo": "Abdelhamid ghanmi",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T15:19:30.000Z",
          "Titre": "Useful content",
          "Contenu": "I would like to thank PDFILLER as I found their product to be very useful for my needs."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "rootthala",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:15:30.000Z",
          "Titre": "nice to use this portal for learns"
        },
        {
          "Note": 4,
          "Lieu": "ID",
          "Pseudo": "Hari Yanti",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T10:44:36.000Z",
          "Titre": "VERY GOOD APP"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan Mendoza",
          "Nb_Reviews": 3,
          "Date": "2023-05-05T02:24:50.000Z",
          "Titre": "Good .pdf software.",
          "Contenu": "A little quirky at first but once you get rolling it really helps in the day to day.  They have many forms stored so there is no need to upload your own.  Great .pdf software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melissa Owens-Freeman",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T22:51:43.000Z",
          "Titre": "Easy and convenient as I need access to…",
          "Contenu": "Easy and convenient as I need access to these needs."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Scott Acker",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T01:55:16.000Z",
          "Titre": "Pay per use",
          "Contenu": "Good tool, but would benefit from pay per use model"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jayanth Kandalam",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T07:08:53.000Z",
          "Titre": "Works well and seamlessly",
          "Contenu": "Works well and seamlessly. Ease of use and ablity to save and share docs is a positive."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ran Kono",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T14:45:46.000Z",
          "Titre": "Would be great if there was pop up info…",
          "Contenu": "Would be great if there was pop up info that explains functions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matias Heinrich",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T01:45:06.000Z",
          "Titre": "I was able to take photos of documents…",
          "Contenu": "I was able to take photos of documents and convert to pdf."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Mike Vaughn",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T07:55:25.000Z",
          "Titre": "Editor could be better",
          "Contenu": "Editor could be better, but overall experience is good and easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TAJUDEEN LIADI",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T18:49:23.000Z",
          "Titre": "The availability of the forms and…",
          "Contenu": "The availability of the forms and clarity"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ronald Bohlman",
          "Nb_Reviews": 4,
          "Date": "2023-07-18T23:05:10.000Z",
          "Titre": "Take your time. It's an important document.",
          "Contenu": "I took all the time needed. I did my research and produced the document I wanted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MC",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T08:54:50.000Z",
          "Titre": "Easy to fill out applications and sign."
        },
        {
          "Note": 4,
          "Lieu": "KW",
          "Pseudo": "denny paul",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T04:50:36.000Z",
          "Titre": "useful verry good"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Karola Jun C. Tumacas",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T04:06:15.000Z",
          "Titre": "excellent and amazing app",
          "Contenu": "excellent and amazing app, I can convert every documents I need"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jacqueline Armstrong",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T14:51:36.000Z",
          "Titre": "review",
          "Contenu": "so far what ive learned its pretty handy and helps out with my projects alot."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Dr Ehos",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T06:28:32.000Z",
          "Titre": "Good concept",
          "Contenu": "Good concept. Just charges can be considered so the service can be available for all."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lori Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T16:54:35.000Z",
          "Titre": "Easy to use",
          "Contenu": "This program is easy to use.  It gives you so many more abilities."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "SUJIT MANDAL",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T08:09:16.000Z",
          "Titre": "very help full im so happy for better …",
          "Contenu": "very help full im so happy for better  working"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Gurjeet Singh",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T20:29:09.000Z",
          "Titre": "The easy to use and user friendly…",
          "Contenu": "The easy to use and user friendly application."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natasha",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T14:20:47.000Z",
          "Titre": "Kara was great with answering my…",
          "Contenu": "Kara was great with answering my question and went above and beyond and took my document into her own hands and helped me with it instead of me trying to figure things out. I really appreciated that!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tamiya",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T17:02:12.000Z",
          "Titre": "Ms Kara on pdfFiller Support Team was VERY Informative, a good reader, listener  and VERY patient with me.  :)",
          "Contenu": "Ms Kara on pdfFiller Support Team was very knowledgeable and informative... I feel like I am being heard and is getting my money worth because she provide me with good information and guided in the right direction to get what I need in order to process my clients applications efficiently.  The world need more workers like her.  Thank again Ms Kara for your time and patients."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Yetim Metzger",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:35:07.000Z",
          "Titre": "Really fast friendly.",
          "Contenu": "Was really fast friendly.If i really had to point something out, it'd be that one message was in english and not the original langue we texted but I did not mind at all!Was a great experience, thanks you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lawrence McCarter",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:15:49.000Z",
          "Titre": "Experienced user back for more",
          "Contenu": "I've used pdfFiller in the past and it has always fulfilled the needs I've had of allowing me to fill in documents just as if I had been sitting at a typewriter (I know I'm dating myself by saying that). The ability to do so and add signatures, save documents to a cloud folder, print the documents when needed, or even have the documents notarized or submitted to the IRS is a major time-saver! I trust that the team behind this product will continue to find ways to save people like me time without costing great sums of money. Do that and I may be able to continue to find room in my tight budget for you!"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Zephyr Khambatta",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T07:45:10.000Z",
          "Titre": "I'm not sure why Adobe Acrobat Pro…",
          "Contenu": "I'm not sure why Adobe Acrobat Pro isn't this easy to use. Adobe Acrobat Pro feels like it was created in a silo by people who don't do editing on a daily basis. Also, it doesn't install, on one of the latest Macbooks on the planet. Thank god for PDFEscape and PDFFiller. Thank you god."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seekh Tax & More",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T17:24:31.000Z",
          "Titre": "User Friendly",
          "Contenu": "Super easy to  use. I needed to send a document to a customer for them to sign. I didn't need to take time for them to come to the office and they could continue with their busy day with only a 1 minute interruption."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Gleckler",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:29:38.000Z",
          "Titre": "Easy to utilize",
          "Contenu": "Fill in was easy to access and utilize and update or make corrections."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Michael Maher",
          "Nb_Reviews": 9,
          "Date": "2023-12-07T09:51:18.000Z",
          "Titre": "Great product and full refund when cancelled before trial ended",
          "Contenu": "I took out the trial and paid 2 x €1.25 installments.I used the product which was the best I found especially given you can edit PDFs with it.I cancelled after a few hours and both payments were refunded as promised.I would have been happy to pay a single use fee for this service but the subscription is too much for my once off use case"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Sicard",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T02:01:23.000Z",
          "Titre": "It is actually free helfpful without ads",
          "Contenu": "It is actually free and I don't have to put in a card before, and there are no ads it feels illegal with all the other sites doing only 10% of what this one does and asks you to sign up for months"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Koran",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T02:28:57.000Z",
          "Titre": "A lifesaver for filling and printing…",
          "Contenu": "A lifesaver for filling in and printing passport applications. Simple stuff, perhaps, but not for us novices!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "MOHAMMAD MUZAMMIL",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:58:58.000Z",
          "Titre": "This app is very much useful for word document editing…",
          "Contenu": "This app is very much useful for word document editors and it is very easy to edit the document with is website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Scagliarini",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T08:57:45.000Z",
          "Titre": "Help me get a deliverable done in time",
          "Contenu": "I've only used it for 30 minutes or maybe an hour but it has helped me merge a bunch of PDFs that I was having issues with and needed t get dne iin time for a contract delivery."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T21:48:59.000Z",
          "Titre": "Free for 30day trail",
          "Contenu": "This great experience because was able to use pdffiller free for 30 period"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mark Oliver",
          "Nb_Reviews": 11,
          "Date": "2023-12-13T13:13:42.000Z",
          "Titre": "easy to use and solves the problem of…",
          "Contenu": "easy to use and solves the problem of trying to sign a document online"
        },
        {
          "Note": 5,
          "Lieu": "BS",
          "Pseudo": "Ludell Gre",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T14:30:38.000Z",
          "Titre": "Kara was very knowledgable of every aspect of the site in order to assist with my issues.",
          "Contenu": "The fact that Kara the tech was so experienced in order to assist me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill Beardown",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T20:30:28.000Z",
          "Titre": "Kara was spectacular",
          "Contenu": "Kara was spectacular!   I was having trouble merging 35  small PDFs into a single larger document.  She walked me through all the steps, and I told her what I had done and where I had run into problems.  When she could not find a solution for me that way, she offered to merge all the documents for me!!!  I have been working on this family project for the last 12 months and this was the final step before I could get the finished document out to everyone.   Now I can do that and put this phase of the project behind me!  I salute you Kara!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raegann",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T20:29:16.000Z",
          "Titre": "I have NO ablity for photoshop",
          "Contenu": "I have NO ablity for photoshop, etc.  But this software is easy to use and I can easily edit the few things I need to do.  Highly recommend it for those who aren't to tech savy."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "ZIMBINI",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T05:26:43.000Z",
          "Titre": "I liked the flexibility to edit and make changes in my document.",
          "Contenu": "Its rare to get something like this, especially for a pdf format. for me it made things easier as I was working  on a pdf document and I wanted to make a few changes on it without converting to a word document."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Carly",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T23:21:46.000Z",
          "Titre": "Excellent program",
          "Contenu": "Very easy to use and works like a charm. Excellent experience and would recommend in an instant."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "CL",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:01:13.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use. quick upload and processing times"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sew Chang",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T07:06:17.000Z",
          "Titre": "I seek clarification about the 30 days free trial.",
          "Contenu": "I seek clarification about the 30 days free trial of using the services. The reply was prompt, direct helpful and highly satisfactory."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curious Vic",
          "Nb_Reviews": 2,
          "Date": "2023-11-22T07:56:23.000Z",
          "Titre": "I may a few times a year need to use…",
          "Contenu": "I may a few times a year need to use editing or signature for pdf document. I was able to use edit to blackout simply by using quick guide under \"Blackout'. Very simple and easy to adjust for use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Cordova",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T02:48:01.000Z",
          "Titre": "pdfFiller is user friendly",
          "Contenu": "Very useful software to use to update or edit PDF documents.  Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Aidan Brennan",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:37:57.000Z",
          "Titre": "making the tedious task of filling out…",
          "Contenu": "making the tedious task of filling out forms a thing of the past.excellent"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dara Orvin",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T15:53:41.000Z",
          "Titre": "PDF Filler makes my job EASIER!",
          "Contenu": "PDF Filler makes my work so much easier. I am a teacher and I need to change PDF files all the time to meet my students needs. So, before I would print out the original and have to white out what I needed gone and make a copy. Now, I can just upload to PDF Filler, change what I need changed, save a copy of the changed PDF and have it ready to go. I love PDF Filler. Thanks for making my job easier!"
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "stephen solomon",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T12:13:48.000Z",
          "Titre": "good",
          "Contenu": "Too expensive for me"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Marcus Vuorinen",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T08:09:14.000Z",
          "Titre": "It works for what its for and has some…",
          "Contenu": "It works for what its for and has some nice features like saved signatures. If you're commonly using this its probably worth getting."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonardo Gomez",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:16:52.000Z",
          "Titre": "All its great",
          "Contenu": "All its great! (The interface) all really usefull."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Reid",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T18:48:09.000Z",
          "Titre": "Document not importing correctly",
          "Contenu": "Support worked with me to correct problem"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "bamplayo",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T20:06:12.000Z",
          "Titre": "Its benefit and conveniency",
          "Contenu": "It is beneficial especially when filling out pdf files"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eliza Wang",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T22:32:03.000Z",
          "Titre": "Support agent Kara is highly professional, knowledgeable and effective help.",
          "Contenu": "Support agent Kara is highly knowledgeable and helpful."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Piesca Kusumaningtyas",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T09:46:16.000Z",
          "Titre": "Very good app",
          "Contenu": "Very good app, helpful for the job"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Mahar Ameen",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:42:54.000Z",
          "Titre": "I get a good experience working on it…",
          "Contenu": "I get a good experience working on it easy to edit or write what you want."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonardo Alvarez",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:04:40.000Z",
          "Titre": "good",
          "Contenu": "good, with 10 characters"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "ameet singh",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:58:29.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome, clear and very patient with customers"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "librost",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T17:22:08.000Z",
          "Titre": "WONDERFUL AND USEFUL",
          "Contenu": "WONDERFUL AND USEFUL EXPERIENCE. MY WORK IS BETTER SINCE I´D DISCOVERED THIS PAGE."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Mohammed Ubed",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T20:47:53.000Z",
          "Titre": "very usefull its a amazing editor can…",
          "Contenu": "very usefull its a amazing editor can help u lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JT",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T01:22:56.000Z",
          "Titre": "I can create and print pdf files pdf editor",
          "Contenu": "I can create and print pdf files on this editor, which makes it easier for me to do my job. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "vijaykumar pendota",
          "Nb_Reviews": 2,
          "Date": "2023-11-28T13:59:39.000Z",
          "Titre": "Its a very good application where we…",
          "Contenu": "Its a very good application where we can easily edit our PDF files."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sarwar Jamal",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T22:28:06.000Z",
          "Titre": "I AM VERY HAPPY WITH THIS WONDERFUL…",
          "Contenu": "I AM VERY HAPPY WITH THIS WONDERFUL FEATURE OF FILLING OUT THE FORM SO EASY AND FASTER."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kenneth Duncan",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T19:46:01.000Z",
          "Titre": "It has made editing my work mistakes a…",
          "Contenu": "It has made editing my work mistakes a lot simpler."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "harshan K",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:51:02.000Z",
          "Titre": "Good for pdf edits",
          "Contenu": "used it for edit important PDFs"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Innocentia Sibiya",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T11:22:29.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome. Loved it. Brilliant."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Jiten Grover",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T09:29:31.000Z",
          "Titre": "No learning curve",
          "Contenu": "No learning curve. Super intuitive and easy to use"
        },
        {
          "Note": 5,
          "Lieu": "PG",
          "Pseudo": "Dipak Das",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:11:01.000Z",
          "Titre": "I am independent consultant",
          "Contenu": "I am independent consultant, i tried for the first time lets"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ernesto",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:35:38.000Z",
          "Titre": "Kara was able to give me the reason why…",
          "Contenu": "Kara was able to give me the reason why I wasn't able to complete my task and find a solution within 10 min."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "MA",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T02:36:58.000Z",
          "Titre": "Exclent",
          "Contenu": "It was great experience to use pdfFiller. I have definitely suggested to use it!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B S",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T21:48:41.000Z",
          "Titre": "It was exactly what I needed to fill…",
          "Contenu": "It was exactly what I needed to fill out my forms, including Word documents. I have no complaints."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany Thomas",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T17:05:25.000Z",
          "Titre": "Did exactly what I needed it to do and…",
          "Contenu": "Did exactly what I needed it to do and I am satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathleen",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T03:44:49.000Z",
          "Titre": "Very easy to edit and use!",
          "Contenu": "I needed a online digital form for my massage business. This did the trick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gianskys",
          "Nb_Reviews": 7,
          "Date": "2023-11-20T01:10:35.000Z",
          "Titre": "Its save me a little time on the road",
          "Contenu": "Its save me a little time on the road. I was traveling and it will help me keep a safe copy of things too. Most gracious for the options to port to different formats. Well Thought out product..Thank You."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Tajaye Blake",
          "Nb_Reviews": 3,
          "Date": "2023-12-18T06:53:39.000Z",
          "Titre": "Great tool highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sinan",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T15:39:21.000Z",
          "Titre": "Creating Fillable PDFs",
          "Contenu": "Easy and intuitive way to convert a PDF into a fillable PDF. I did mine in like 10 minutes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donald Froman",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T21:18:37.000Z",
          "Titre": "Printing Forms",
          "Contenu": "it allowed me to print my filled form without any problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Fortune",
          "Nb_Reviews": 13,
          "Date": "2023-11-18T12:45:40.000Z",
          "Titre": "Excellent company excellent service",
          "Contenu": "Although when testing the service it did not meet my requirements a month later an annual Bill showed up on one of my payment accounts. This just happened minutes ago and I was up working on a project so I immediately responded. Surprisingly somebody answered the phone at the company. I was able to refer them to my account they could see where I had stopped the service immediately upon testing it because it didn't fit all of my requirements this all happened last month however as a young lady told me the cancellation process takes several steps and somewhere during that process the cancellation was not 100% completed. However she sees where I never utilized the service I did cancel it she immediately moved into action return the payment that was incorrectly processed and was super helpful and super friendly. The Reps name was Sally I am super impressed with not only her but PDF filler because of the fact that they honored my displeasure and something like I said through the process fell through the cracks however I was able to contact them they were able to easily see what was happening with my account and rectify my complaint. I want to vote the company a plus plus because nowadays service is not even a thing anymore it seems rarely can you find a company that stands behind their product and they do so by providing support Saturday morning at 5:00 a.m. LOL so yeah I was super pleased with the service although they did not provide what I was looking for the company still will always be on my good list in terms of consideration in case in the future they do provide the needs that I have. A+ Plus"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jiquana Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:28:11.000Z",
          "Titre": "Easy to use",
          "Contenu": "Convenient to find all important files"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mona Narcisse",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:09:25.000Z",
          "Titre": "Save Time and Money",
          "Contenu": "No need to look any further, just google the form number and voila! You can fill it out, download it, email it in a few minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Ternosky",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T02:30:10.000Z",
          "Titre": "Ease of Use",
          "Contenu": "Simple to manipulate with w/o directions or training,V. nice product for professional results.With compliments, Champansky"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Stephen Smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T13:06:23.000Z",
          "Titre": "Intuitive to use",
          "Contenu": "Intuitive to use, a real no-brainer. Nice interface"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Farhad Ahmad",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:45:00.000Z",
          "Titre": "Its rare to get something like this",
          "Contenu": "Its rare to get something like this, especially for a pdf format."
        },
        {
          "Note": 5,
          "Lieu": "SV",
          "Pseudo": "Megan Santos",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T23:43:56.000Z",
          "Titre": "it is easy to use and friendly user"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Erwann Pagnoux",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:29:34.000Z",
          "Titre": "Application work very well",
          "Contenu": "Application work very well, really useful and helpful"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Sujatha Murali",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:00:28.000Z",
          "Titre": "10PAVITHRA10",
          "Contenu": "VERY EXCELLENT PDF ARRANGE THE TRAIL"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Prudhvi Varma",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T20:55:01.000Z",
          "Titre": "Excellent tool for editing pdfs",
          "Contenu": "Excellent tool for editing pdfs. Standard templates are also very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAMES OMeara",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:00:28.000Z",
          "Titre": "easy tofill out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BaDonna Jarvis",
          "Nb_Reviews": 5,
          "Date": "2023-12-22T00:04:24.000Z",
          "Titre": "Easy",
          "Contenu": "Easy, convenient and accessible"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Katina Tara",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T05:57:51.000Z",
          "Titre": "it helps my documents"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Traciann VanEvery",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T05:53:28.000Z",
          "Titre": "Excellent app for editting PDFs",
          "Contenu": "Easy to use PDF editor"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "nare Mathekga",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:20:22.000Z",
          "Titre": "USER FRIENDLY BY ALL MEANS"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rob Ferguson",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T22:52:07.000Z",
          "Titre": "Easy to use and results great"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Kingsley Izundu",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T08:39:36.000Z",
          "Titre": "Easy to use and editing was seamless"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "seragam putih",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T08:06:29.000Z",
          "Titre": "Nice apps and easy to modify and work…",
          "Contenu": "Nice apps and easy to modify and work on pdf.Thank you pdfFiller"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Lerato Seema",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T12:48:18.000Z",
          "Titre": "The features are excellent",
          "Contenu": "The features are excellent and there is a smooth transition. no glitches."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Mccurry",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T08:06:27.000Z",
          "Titre": "EASY NEEDED IT EMAILED AND NO…",
          "Contenu": "EASY NEEDED IT EMAILED AND NO DOWNLOADED. KIND OF HARD TO FIGURE OUT"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "NEIL MARTIS",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T15:21:35.000Z",
          "Titre": "product review",
          "Contenu": "The simplicity of the product and ease of use is simply elegant"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tamim Isazadah",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T13:26:58.000Z",
          "Titre": "great platform"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Souren",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T21:54:01.000Z",
          "Titre": "they have it all",
          "Contenu": "it saved me alot of time and money and having to go to court and waste all day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel Leon",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T09:12:55.000Z",
          "Titre": "I just contacted their customer…",
          "Contenu": "I just contacted their customer service, it is hard to get company's customer service to be useful these days, Earl not only assisted me very quickly but also resolved my issue with understanding and efficiency, not only I recommend the service to you reader but also will definitely consider coming back at some point, please don't change, thanks!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Christine O'Neill",
          "Nb_Reviews": 5,
          "Date": "2023-11-18T06:19:45.000Z",
          "Titre": "So easy to use",
          "Contenu": "So easy to use!  Thank you for a stress-free, customer-friendly experience!"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "andreadomingo",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:46:29.000Z",
          "Titre": "IM SO HAPPY EASY TO USED AND FAST EDIT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer CW",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T16:38:29.000Z",
          "Titre": "very good program",
          "Contenu": "I have no issues with the pdf writer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "carolyn valdez",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:48:27.000Z",
          "Titre": "It working so far."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Váli Erika",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T12:27:03.000Z",
          "Titre": "Very helpful",
          "Contenu": "Very helpful, professional team. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T05:47:02.000Z",
          "Titre": "Life saver",
          "Contenu": "Very useful in a moment of desperation to find a PDF unavailable anywhere"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Audric Cossa",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T05:21:28.000Z",
          "Titre": "It is very useful and easy to work…",
          "Contenu": "It is very useful and easy to work with. Also has plenty of tools available."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Eartha Cole",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:46:19.000Z",
          "Titre": "Versatility",
          "Contenu": "All in one stop for editing pdf documents."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dr Nathaniel",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T22:22:30.000Z",
          "Titre": "GOOD",
          "Contenu": "GOOD WORK FILLER"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Eric TETTEGAH",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T18:39:21.000Z",
          "Titre": "Very great tools"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Setyowati Putranto",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:59:19.000Z",
          "Titre": "easy to use",
          "Contenu": "easy to use , good result"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "JITESH SETHI",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T07:09:34.000Z",
          "Titre": "very good experience",
          "Contenu": "very good experience but very expansive"
        },
        {
          "Note": 5,
          "Lieu": "PR",
          "Pseudo": "Orlando Ortíz Vélez",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:41:56.000Z",
          "Titre": "Very good",
          "Contenu": "Very good!  A very useful tool"
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Ashen SG",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T06:13:31.000Z",
          "Titre": "great app",
          "Contenu": "great app. Really like how it works. Thank you so much. Much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Stefano Lorusso",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:24:42.000Z",
          "Titre": "good",
          "Contenu": "efficente e veloce"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Loveleesh Loveleesh",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T02:15:11.000Z",
          "Titre": "super easy to edit and save any file…",
          "Contenu": "super easy to edit and save any file and very helpful"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Johanna Muller",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T11:39:47.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use.  Wonderful app.  Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rich Corcoran",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:07:53.000Z",
          "Titre": "Ease of navigating thru the forms"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Anurag Gautam",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T16:08:06.000Z",
          "Titre": "pdf filler",
          "Contenu": "this is good working for students."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "chouhan abhishek",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:07:41.000Z",
          "Titre": "good",
          "Contenu": "good. please allow me download now"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Prudence Mathebe",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T09:16:24.000Z",
          "Titre": "It really helped me and made things…",
          "Contenu": "It really helped me and made things easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Bartlett",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T22:58:00.000Z",
          "Titre": "So easy and affordable",
          "Contenu": "So easy and affordable!  I love this site!"
        }
      ]
    }
  ]
}