{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "petcube.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GT",
          "Pseudo": "Lester Emmanuel  De Leon Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:23:42.000Z",
          "Titre": "Package stolen.",
          "Contenu": "Package stolen.2nd Package it wasnt deliver"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jan",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T17:28:29.000Z",
          "Titre": "I returned the products as  you…",
          "Contenu": "I returned the products as  you requested in the original packaging, and insured it. You asked me to drop my dispute with American Express and then you would credit me back. I dropped the case with American Express and you charged me again for the same product, that I returned.Jan Williams"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Honest Reviews",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T17:45:19.000Z",
          "Titre": "ZERO STARS",
          "Contenu": "ZERO STARS. This company uses misleading advertising for its \"emergency fund\". Be very well-informed before signing up. Know fluently what Petcubes definition of a \"life-threatening emergency\" vs. \"critical\".  VERY IMPORTANT INFO YOU NEED TO KNOW: your pet is NOT covered unless they are \"at risk of death in 4 hours\" This was directly from their mouths..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sheila Quirk",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T23:50:30.000Z",
          "Titre": "Do not buy this product",
          "Contenu": "Do not buy this product! It cost me buying another phone. It would not accept my password which is correct..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "K. Smith",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T02:08:49.000Z",
          "Titre": "Liars. My dog had an emergency and I never was able to talk to a vet.",
          "Contenu": "My dog was having trouble breathing so I used the “I’ve got an emergency” and let them know his symptoms (trouble breathing, wheezing, whining, trembling, excessive drooling). I waited. And waited. Finally, I just had to take him in to the urgent care. Over an hour and I never heard back from PetCube. He has aspiration pneumonia and they recommend he stays at an overnight for oxygen but I can’t afford it. This was supposed to be my emergency fund but PetCube really screwed me over. Complete and utter liars. What am I supposed to do? Am I going to lose my dog?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacob Cook",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T01:45:30.000Z",
          "Titre": "Randomly stopped working all together…",
          "Contenu": "Randomly stopped working all together even the unused one"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T11:23:59.000Z",
          "Titre": "Poor quality camera",
          "Contenu": "Poor quality camera. Constantly needs resetting, worked maybe 50% of the time when out. Reset camera each time before going out and still not reliable. Have thrown it out and chose the Eufy indoor camera instead - amazing and so much better"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Consumer",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T10:18:31.000Z",
          "Titre": "It’s a disposable item",
          "Contenu": "I purchased a PetCube late February 2021. The item worked until an email was sent at the beginning of this year advising the products software had a glitch and the camera needed to be removed and reinstalled. Well that stopped the night vision on the camera working and nothing will have it fixed. While PetCube attempted to fix the problem their resolution of its out of warranty and therefore my problem was most unsatisfactory. So you outlay funds to purchase the item, pay for an annual subscription and in the end you have nothing. Clearly a disposable item. There are far superior products on the market. My advice is do not purchase this product. It is a disposable item with a limited lifespan."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "McRae",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T07:42:00.000Z",
          "Titre": "Get ready to PAY return shipping!",
          "Contenu": "I sure hope you LOVE it because if you don’t your wallet will be lighter regardless. Get ready to pay all the shipping costs, and assume any liability for loss in transit."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "Nataliia Vasylenko",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T14:12:05.000Z",
          "Titre": "27 on September the order was shipped…",
          "Contenu": "27 on September the order was shipped to delivery service and since then no updates , status in transit. I sent an email to your support several times and the reply is that they are chasing logistic. On October 27th it will be already a month since I made an order. It’s already critical for me and i have a feeling that there is some slowness in communication between support and logistic which is not my deal, I’m as a customer would like to have some solution proposed not just saying that we’re chasing. It’s on company to sort out the issues with delivery service, it should not impact customers so much"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Meghan",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T01:24:00.000Z",
          "Titre": "Emergency fund",
          "Contenu": "This review is specifically for Petcube's emergency fund. I have not purchased any of their other products. I had purchased their emergency fund after pawp went downhill. $30/month for $3000 in the case of an emergency is not a bad deal, however this company sets their clientele up for failure. You must get approval from their vets prior to your visit to an emergency room in order for them to pay, which is pretty standard. However, they only allow you to text chat with the vet and send pictures/videos. There is no video chat feature. There is no phone chat option. You know, the options that would allow you to save time when facing an EMERGENCY. Oh, also, if your video clip is too large, their interface won't be able to send it to the vet. Their advice? Just take another video but make sure it's under 30 seconds. Or, while you're facing this potentially life-threatening crisis, just take the time to crop your video (assuming you know how), and then try re-sending to see if that works. Really stellar customer care here. And when I complained about this interface and it's backwards configuration in the face of an emergency? Whoops! Sorry, they can't reimburse me because I didn't get approval before heading to the emergency room. But they will \"take note on my suggestion regarding a video chat feature.\" Real quality care, right there."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ian",
          "Nb_Reviews": 4,
          "Date": "2022-11-03T10:22:50.000Z",
          "Titre": "RUBBISH",
          "Contenu": "I bought the petcube a week ago and wished I'd gone elsewhere.Video is not clear, my phone is forever saying lost signal, and you cannot get a decent portrait view.It's Rubish"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Disappointed customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T21:21:56.000Z",
          "Titre": "One device per camera? Really?",
          "Contenu": "Why is it so hard (or impossible) for two people with the same pet in the same home to use the same camera? When partner connects his phone to camera, it boots mine off. We are in the same petcube \"family\" but he still can't see anything from the camera? This is incredibly stupid.Also, you might want to check the ads for your store. There is an ad for \"Petcube Care Up to 90 day video history + pet and human alerts $3.99/month\" and when I click on it, the 90 day video history is clearly with the $9.99/month? I think I'm on the $5.99/month plan but I have no easy way to check if it booted me off of this when it disconnected me from the camera.Also, camera doesn't seem to catch most pet movement during the night, very disappointing. Can't wait for a better product to come out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ana",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T12:08:38.000Z",
          "Titre": "(( ZERO )) stars!",
          "Contenu": "If I could leave (( ZERO )) stars I would. Fist the set up is complicated. You have to scan a QR code from your phone using the camera. You have to just sit there and move your phone around until it reads it or keep restarting the whole process. Second- The subscription plans are very confusing. You have different options. BEWARE of the “promotion” for the Pet Care bundle. You will have to pay $5.99 each month for a YEAR. If you wish to keep the camera. Another thing that is confusing is that if you have multiple cameras you either have to pay 5.99 for each camera subscription or the premium 14.99 each month for various cameras. Third- Costumer service is awful. Sure they respond quickly, but only to tell you to wait, and wait, and wait, and you get my point. They initially told me 24-48 hrs. We’re going on almost 2 weeks and I still can’t use my camera. As far as the cameras go, they are okay. If you try to use the speaker to talk to your pet it is an extremely loud, and static noise that only scares my pets. It’s also blurry. All in all, just save your money and look for something different. I (( DO NOT )) recommend Petcube. Awful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joanna Ruiz",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T22:11:16.000Z",
          "Titre": "This is a scam",
          "Contenu": "This is a scam. Never got the Petcube or a email confirmation and had to report it to my bank to get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SE",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T19:26:56.000Z",
          "Titre": "Doesn't connect",
          "Contenu": "I have not been able to make this thing work.  I tried the \"live chat\" and got nowhere.  Now I have this things sitting on my counter, useless."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jenn S.",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T17:22:37.000Z",
          "Titre": "Support team have nothing of use to offer in terms of product problem solutions..",
          "Contenu": "The support team was extremely unhelpful, only offering suggestions that are already listed on the support page one has to go to before even being able to contact the support team and extremely obvious suggestions that were absolutely no help, and one ridiculously far fetched solution that who knows if would have even worked. So much unhelpful in fact I had to turn to the retailer to get the help I needed to resolve my issue, and once the retailer was able successfully help me, the support team then ignored my request to send me feedback forms and ending my completely unhelpful conversation with them until they were certain that the retailer had indeed been able to successfully fix my problem, as if they had anything to do with that. It was a massive waste of my time and energy and I regret having contacted them. I suppose now I at least know better that they have nothing of use to offer if/when another problem with my products ever arises. The products themselves are fine, not great, but for the price that's perfectly fine, of course except for the one that didn't work upon arrival hence the attempt, and failure, to utilize the support team."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "James Fuller",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T09:24:10.000Z",
          "Titre": "i am disgusted by the cooperation from…",
          "Contenu": "i am disgusted by the cooperation from this company. The standards are extremely poor. Even a homeless man would find it bad.my pet cam worked for 5 mins before dying and the charging wire you provided did not fit in the charging hole. The treats you gave me to put into the machine were rotten. Were you trying to kill my dog-Barry Finkle bottom!how dare you sell products that don't even work and then not reply to my emails.this is poor service and should be fixed."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Elisha",
          "Nb_Reviews": 3,
          "Date": "2022-03-19T06:12:52.000Z",
          "Titre": "Had to go through set up 4 times to get…",
          "Contenu": "Had to go through set up 4 times to get it working, sound doesn’t work either. Unable to get help as my first chat was disconnected & 2nd they are closed with no option to gave them contact me. Shockingly bad service & non functional product"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ross Johns",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T15:14:41.000Z",
          "Titre": "Started off ok….But keeps getting worse!",
          "Contenu": "We got the Petcube play back in 2017 and was initially happy with it….then as time goes on the laser doesn’t really seem that bright anymore and rarely goes where you point to. The sound quality has always been awful and it’s hard to hear anything during live playback. And now we seem to have lost the ability to watch any recordings unless we subscribe to a plan! I’m sorry Petcube, but that’s not going to happen for a well below average product…"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Alanna Francis",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T13:41:19.000Z",
          "Titre": "Petcube stopped working",
          "Contenu": "Petcube stopped working last Sunday. The app crashes continually. Staff began helping by replying on messenger asking questions about my issue. Once I finished explaining the issue they stopped responding! 4 messages and 2 emails later still no response. Useless camera and the worst customer service. Don't bother wasting your money!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "louis bourgeois",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T16:04:03.000Z",
          "Titre": "I have been trying to reach out to…",
          "Contenu": "I have been trying to reach out to petcube, with no response.to return my petcube bites. love the product but my yorkie it terrified of it. i cant keep doing this to her. Several email with no response yet. hope i hear from them soon. Nor is there a 800 number to call."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nat Montella",
          "Nb_Reviews": 3,
          "Date": "2021-12-24T23:56:07.000Z",
          "Titre": "Waste of money",
          "Contenu": "Away for 3 days. Petcube set up, but has been showing offline for 8 hours. My Ring doorbell and Blink CCTV aree operating fine and they're both WiFi based, so I have no idea what the problem is. It is very distressing not being able to see my cat. Waste of money."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T09:16:21.000Z",
          "Titre": "So spectacularly CRAP!!!!",
          "Contenu": "So spectacularly CRAP!!!!! Connects when we are home and it’s going off mobile data but glitches and disconnects as soon as we leave which basically defeats the entire point. What a horrible experience trying to keep reconnecting and not being able to check in on our old dog home alone - DO NOT BUY!Paid $70 from JB hifi, should’ve got the cheap Kmart one instead!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Delgado",
          "Nb_Reviews": 1,
          "Date": "2021-01-31T17:44:41.000Z",
          "Titre": "Doesn’t work. Going nowhere fast",
          "Contenu": "Spent hours troubleshooting and days waiting to hear back from customer support. Basically, your voice does not come through to the camera speaker unless your mobile device is connected to WiFi. When on 4g cell data, it just ignores your microphone. I imagine it will be weeks before I even get the chance to get their customer support on the same page, and even then I doubt they have a solution other than to claim I have poor cell service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nothemomma",
          "Nb_Reviews": 2,
          "Date": "2021-08-16T16:24:20.000Z",
          "Titre": "terrible",
          "Contenu": "I wish  I had checked this site before buying my pet cam. It only worked a few months then stopped connecting. The only way to contact them is email and they never reply. Of course when I need it most is when It stops working and nobody has helped me. Absolute waste of money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rainbow",
          "Nb_Reviews": 4,
          "Date": "2020-03-26T00:29:56.000Z",
          "Titre": "No customer support",
          "Contenu": "Find another product. I spent a fortune on three machines.  I got a new modem and now they won’t reset. In the past I have had phone help from  Petcube in setting things up or troubleshooting. Now I suppose everything’s gone to China and they don’t speak English because I cannot get any help. I count on my three pet cubes and now none of them work.so unhappy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "carbrat13",
          "Nb_Reviews": 3,
          "Date": "2022-01-04T00:30:24.000Z",
          "Titre": "I read the reviews and it says if you…",
          "Contenu": "I read the reviews and it says if you have a certain amount of internet it will work I tried it I have unlimited internet and the fastest and it still does not work so I can’t use the product I purchased I’m sure it’s good but unable to use"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-03-07T01:35:56.000Z",
          "Titre": "Broke after warranty ran out",
          "Contenu": "Our pet cube stopped working right after the 1 year warranty ran out. We contacted pet cube who only offered a 30% of the $100 annual subscription they force you to pay to use the unit it to it’s full capacity. We contacted JB HI FI and their hands were tied as pet cube has marked the product unable to be repaired.We are currently following up with the ACCC."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ben Smith",
          "Nb_Reviews": 1,
          "Date": "2020-07-06T00:57:29.000Z",
          "Titre": "Goes offline in the middle of the day…",
          "Contenu": "Goes offline in the middle of the day wayyy to often.Won’t come back online until I get home and physically turn it off and on again.Have had to replace it twice because it’s built cheaply and just stops working.Also for the price you can get cheaper more reliable ones at your local hardware store.Obviously would not recommend."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sonya Mears",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T01:30:13.000Z",
          "Titre": "DO NOT BUY THIS PRODUCT!!!!",
          "Contenu": "DO NOT BUY THIS PRODUCT!!!!This petcube product is a complete waste of time and money, do not bother. As with other reviews, there support team have also tried cancelling my query for help on a number of occasions without even fixing the problem. I am extremely frustrated that this product and company has wasted so much of my time. I have had nothing but problems with it trying to connect it to a Apple iPhone without any success. There support team are very unhelpful and are extremely slow to reply. I will be returning the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stefani Fontana",
          "Nb_Reviews": 1,
          "Date": "2021-12-18T07:05:19.000Z",
          "Titre": "No phone number available to call……",
          "Contenu": "No phone number available to call then… I’ve reached out multiple times by email and no one has gotten back to me. My petcube syopped working months ago and now I have a $200 piece if trash since there’s literally no way to contact them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Chung",
          "Nb_Reviews": 2,
          "Date": "2019-12-26T06:22:27.000Z",
          "Titre": "BOUGHT THIS FOR A CHIRSTMAS VACATION…",
          "Contenu": "BOUGHT THIS FOR A CHIRSTMAS VACATION OUT OF MY HOUSE AND IS STOPPED WORKING 2 HOURS AFTER THE FIRST SETUP.CUWTOMER SUPPORT ALSO DOESNT ANSWER, THERES NO PHONE NUMBER, IVE NEVER, EVER, BEEN SO STRESSED WITH SOMETHING LIKE THIS.SO FRUSTRATING BECAUSE I SPEND 200$ ON THIS AND IT DOESNT EVEN WORK FOR MORE THAN ONE DAY????"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Kellie Monea",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T09:30:14.000Z",
          "Titre": "DO NOT BUY THIS PRODUCT.",
          "Contenu": "DO NOT BUY THIS PRODUCT.I've had nothing but trouble since I brought the Petcude. It keeps dropping out and the sounds quality is crap. The customer service is useless and when  I finally got to someone after a number of attempt they asked to provide the receipt copy and receipt in order to get a replacement. I am yet to here a reply after giving them 24hrs to stop stuffing me around with wanting more info when the receipt is pretty much sufficient.So I'm going to ensure that people DO  NOT BUY THIS PRODUCT AT ALL. SPEND THE MONEY AND BUY A BETTER QUALITY AND BRAND, RATHER THAN THIS CRAP."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alisa",
          "Nb_Reviews": 2,
          "Date": "2018-07-16T22:59:25.000Z",
          "Titre": "Petcube",
          "Contenu": "I bought the Petcube based on a friend's experience with it. It sounded like a good idea to check on my pet. I could not get it to connect & had trouble understanding the tech person at Petcube. Not being very tech savvy, I asked my son-in-law to help me. As it turns out, I do not have enough Internet capability to use the Petcube."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bobby Montgomery",
          "Nb_Reviews": 1,
          "Date": "2017-12-29T04:09:03.000Z",
          "Titre": "my PetCube PetBites machine quit …",
          "Contenu": "my PetCube PetBites machine quit working on day 1.  Customer service sounds helpful but so far no help,  I like the idea of the pet cube machine but it needs to work.  If they get the machine up and running I will change my review.  But so far we are very disappointed and are going to send the machine back for a refund if the issue is not resolved."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Disappointed User",
          "Nb_Reviews": 1,
          "Date": "2019-02-23T02:01:37.000Z",
          "Titre": "I WAS truly amazed and impressed with…",
          "Contenu": "I WAS truly amazed and impressed with how well the petcube worked for the first 6 days. I was using it to keep on eye on a sick pet. By day 7 when my free trial was up is started \"malfunctioning \" and is now totally unreliable. Over 6 hours have gone by several times and no motion videos will record. 90% of the time it is \"offline\" or just won't show live feed. (Yes I have unplugged it multiple times and reset my internet) The petcube seems to be a PAY TO USE PRODUCT"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mrs yvonne neuman",
          "Nb_Reviews": 54,
          "Date": "2019-02-20T12:42:08.000Z",
          "Titre": "Only lasted a year before having to throw out",
          "Contenu": "I purchased mine in June 2016. it worked great for a year then had so many problems I gave up using it for a year and tried it again but it was of no use. Petcube offered a no warranty replacement for $60. No way was I going to buy another if it only lasts a year. Better off buying a camera that watches over babies!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Naz",
          "Nb_Reviews": 2,
          "Date": "2019-11-24T15:04:32.000Z",
          "Titre": "Camera freezes and the app is rubbish",
          "Contenu": "Camera is still freezing on me. Although support is friendly, they are not always available and it can take a long time for them to get back to you. If you need a camera to make sure your pet is safe then this is not the one to buy - don’t waste your time and money!BUYER BEWARE"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer  Troia",
          "Nb_Reviews": 2,
          "Date": "2017-12-16T23:59:25.000Z",
          "Titre": "Wait time for live chat was ridiculous...",
          "Contenu": "Wait time for live chat was ridiculous. I waited over 5 minutes for a response. The customer service rep wasn’t helpful. I needed to contact customer service multiple times. Mind you, I haven’t even received my order as of yet and it’s over a wk. Hoping the product is better than the customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-10T16:03:50.000Z",
          "Titre": "I received this email for my review and …",
          "Contenu": "I received this email for my review and I haven't even got my product yet because they messed it up. I contacted them about my order placed a week ago, and they were supposed to get back within 234 hours... still waiting! I would move along to another product if i could! They are not good!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leah",
          "Nb_Reviews": 2,
          "Date": "2018-01-03T14:11:51.000Z",
          "Titre": "I gave the Petcube to my boyfriend for …",
          "Contenu": "I gave the Petcube to my boyfriend for Christmas for his new puppy.  It lasted one day.  It stopped dispensing treats.  He tried messaging PetCube with no answer and so I did on the 29th of December and I have yet to receive a replay.  Great concept poor product quality and customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2019-03-12T18:34:52.000Z",
          "Titre": "I placed an order & received an email…",
          "Contenu": "I placed an order & received an email that they received the order.  I have never received anything from them since.  I have never received the dog food I ordered and when I sent an email inquiring, nobody ever got back to me.Would never order from this place again."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "parnia baresni",
          "Nb_Reviews": 1,
          "Date": "2021-02-05T04:16:26.000Z",
          "Titre": "I have paid 800 dollars for 2 pet cubes…",
          "Contenu": "I have paid 800 dollars for 2 pet cubes 1 year ago and could not use them once .. I can’t use them if I’m out of the house but I can access them when I’m close to the cameras ... I’m soooo unhappy and would never recommend these rubishes"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Shannen",
          "Nb_Reviews": 1,
          "Date": "2021-05-14T09:40:56.000Z",
          "Titre": "Absolute worst customer service",
          "Contenu": "Absolute worst customer service. I bought a pet cube which didn’t work once I left the house so I returned it to the store. I contacted pet cube to cancel my subscription and they advised that they will provide a free camera (since I’m in Australia I just need to email my receipt and they would refund via paypal) which sounded great- with the promise of an update to fix the initial problem. It’s been 2 months, and no refund. I provided all documents and when I ask for an update they just keep telling me to wait and it’s with their superior. They coerced me into buying another camera that doesn’t work nearly as well as others. Stay away from these guys"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emily Rose",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T03:47:56.000Z",
          "Titre": "Stopped working after three months",
          "Contenu": "Great for motion detection AND SOUND notifications, works well at night time too. The quality isn't great when you zoom in but it's worth it for the price.UPDATE: The PetCube cam was great for three months, with two cams, and paying for the month to month subscription. After 3 months, I upgraded to the 12 month subscription for $119.51 and it logged me out of the app, I tried to log back in with my credentials but I kept getting \"incorrect password\" I pressed forgot my password on PetCube app multiple times, never received an email. I put an inquiry in on their website, and I also emailed them. No response. I can no longer use my PetCube cams and I will be returning them. Disappointed because the first 3 months were great. What a scam."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Cam",
          "Nb_Reviews": 1,
          "Date": "2019-04-05T12:19:01.000Z",
          "Titre": "Absolutely rubbish",
          "Contenu": "Absolutely rubbishVideo is jumpy sound is distorted and scratchy . Connection takes up to 2 minutes. Cuts out regularly. I have the fastest possible broadband speed in my country, and it still doesn’t work properly. Customer support is lousy.DONT BUY"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2017-11-29T03:21:18.000Z",
          "Titre": "A complete disaster",
          "Contenu": "A complete disaster. We bought a Petcube Play earlier this year. Although it set up easily, we lost the ability to contact it from both of our phones and tablets within a few days.We emailed and spoke with staff (very professional). They determined we should return it for a replacement. We did so - and received a second device. The same results followed.We returned the second device for a refund (less the cost of postage).Other than the excellent staff, we have nothing positive to say about Petcube Play.We've purchased a different company's device and have had complete success with it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan",
          "Nb_Reviews": 3,
          "Date": "2017-12-26T20:56:57.000Z",
          "Titre": "Did not receive complete order.",
          "Contenu": "Purchased a Petcube Play + Mount in Carbon Black before the holidays intending to give as a gift. Received the mount only with my shipment and it took an hour to get a hold of anyone at Petcube. When I did they told me that they weren't sure what was happening but had sent a request for information out to their sales team and would get back with me. A day after Christmas I have been sent an additional shipping label with no explanation from the company. Beyond upset with the lack of communication and not even sure how half of an order gets shipped out from a facility right before Christmas no less."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-15T01:49:55.000Z",
          "Titre": "Does not work",
          "Contenu": "Had it for just under 2 weeks, and it hasn’t worked for a week now. Customer service keeps asking me the same questions, as if I don’t know how to connect it. I did it the first time, now they act like I forgot or something. Waste of my money"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Oshita",
          "Nb_Reviews": 1,
          "Date": "2019-10-19T20:38:32.000Z",
          "Titre": "Don't buy this product",
          "Contenu": "I got a petcube about 1.5 years ago, it stop working. I emailed, called I can not seem to get any support.  There are many products like this on the market, don't waste your time on petcube they do not support there  product."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-01-01T15:32:12.000Z",
          "Titre": "Petcube Bites",
          "Contenu": "The food falls irregularly and sometimes he does not give out any treat. In addition, all the crumbs of food are sent to the ground. The image of the camera distorts reality with its exaggerated wide angle. I do not recommend Petcube Bites"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kimberly",
          "Nb_Reviews": 2,
          "Date": "2019-12-23T18:14:40.000Z",
          "Titre": "I need a replacement power cord and…",
          "Contenu": "I need a replacement power cord and have been trying to contact petcube support to no availability  so frustrating and disappointing...The charge on these petcubes and you can not get HUMAN VOICE SUPPORT IS RIDICULOUS!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Garcia",
          "Nb_Reviews": 1,
          "Date": "2017-11-29T23:33:50.000Z",
          "Titre": "Constantly having issues with this …",
          "Contenu": "Constantly having issues with this product and service. At first, the night vision stopped working on the pet camera so I was without this feature for a few weeks before they fixed it. Now they have changed the setting that I use for the petcube care. It had three modes for the video recording; one is off, one is always on to movement, and one is on but does not give notifications. They got rid of the third setting which is what I liked most because my phone wasn't constantly going off, but it was still recording for me to go back and look at when I get a chance. I am glad i had not signed up for the extended petcube care service because it would be a rip off."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-01-16T04:12:02.000Z",
          "Titre": "Petcube Never Delivered, No Support",
          "Contenu": "It’s currently four days after the supposed delivery date and the product has not arrived. Contacted “24/7” chat support two days ago and received no response. Contacted e-mail support earlier today and have yet to hear back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deanna Sapp",
          "Nb_Reviews": 1,
          "Date": "2018-01-12T07:13:39.000Z",
          "Titre": "Unhappy & still waiting",
          "Contenu": "I have only given 1 star because I have had my Petcube since Christmas & have not been able to use yet. I’ve had a problem connecting it & have made numerous calls to remedy this. I am still waiting to hear from them!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darlene Huston",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T23:21:40.000Z",
          "Titre": "Poor response from this company",
          "Contenu": "I received my Petcube and could not get it to sync with the app on my phone. I emailed the company to which I received no response.  That was money wasted on a product I can’t use!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamee Jenkins",
          "Nb_Reviews": 1,
          "Date": "2020-03-25T19:56:56.000Z",
          "Titre": "Elijah sucks for customer support",
          "Contenu": "Most of the things work (as long as you dont mind 8 hours a night while you are sleeping to not work) Honestly its been an ok product.  I been trying for well over a week for some sort of response for customer service.  -- a week ago I had a big earthquake in my city. Right after  my pet cube stopped working.  The company refuses to contact me. The \"\"\"\"\"\"\"\"\"\" customer support\"\"\"\"\"\"\"\"\"\" Elijah.. is freegun stupid.  If you are gunna make AI do your bidding , let's not make it stupid ok ??  If you are gunna treat your well paying customers like crap , just come out and say it. Stop wasting our time and money"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "j Cornish",
          "Nb_Reviews": 2,
          "Date": "2021-01-19T08:11:26.000Z",
          "Titre": "It doesn’t work - don’t buy …",
          "Contenu": "It doesn’t work when we are away from home. Both my wife and I can’t see any video. I contacted support and they got back once but have not attempted to fix the issue.Will take it backDon’t buy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Neiraliz Zambrano",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T22:58:17.000Z",
          "Titre": "I placed the order by mistake and i'm…",
          "Contenu": "I placed the order by mistake and i'm trying to get the money back, but they never reach out back to me due to the fact that the only way to reach CS is by email. which is the worst. i need my refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Evelyn A",
          "Nb_Reviews": 1,
          "Date": "2019-12-12T16:50:55.000Z",
          "Titre": "I received a Petcube as a gift over a…",
          "Contenu": "I received a Petcube as a gift over a month ago.  I have not been able to set up my camera.  I contacted customer service by email since you can not actually speak to anyone by phone.  Customer support has been beyond horrible.  I have gotten several email responses each time with a different solution to try and set up my device.  I was even offered a replacement unit since they believe the device might be defective.  Asked for my mailing  information which I send back immediately.  Till this day I have no new device, after several days I received another email asking me for pictures of what the camera does when I try to set it up. Customer support is by far the WORST I have ever encountered.  Beyond DISSAPOINTED with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-01-14T21:33:45.000Z",
          "Titre": "Wish I could return it",
          "Contenu": "The company seems well organized and helpful, but the product was very disappointing. The features of the app and the product were limited in such a way that it altogether failed to meet my expectations and needs. Specifically, I was looking for something that would allow me to view my pet in real time whenever I accessed the platform. Instead, the petcube only provided snapshots of activity, which in my opinion, serves no purpose at all if not augmented by real time viewing. Perhaps I am missing something, but this feature was absent from what I could tell. I also did not feel comfortable with the privacy options on the app. It was very unclear if I was setting my options to the level of privacy I wanted. The app just wasn’t very user friendly or clear."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Thomasson",
          "Nb_Reviews": 1,
          "Date": "2018-05-03T16:02:06.000Z",
          "Titre": "The customer service team sucks petcube…",
          "Contenu": "The customer service team sucks petcube  sent me a broken petcube play now I'm responsible for shipping it back to get a refund why should have to pay for a broken product they shipped??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ANNA SZ",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T12:51:13.000Z",
          "Titre": "Turns off all the time",
          "Contenu": "Turns off all the time. Turn on sound really loud and some of my cats hate it. It was fun for a few minutes then it was only a huge disappointment."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kerry Prevett",
          "Nb_Reviews": 1,
          "Date": "2021-12-01T15:10:37.000Z",
          "Titre": "I still haven’t recieved package though…",
          "Contenu": "I still haven’t recieved package though they say it was delivered and signed for . I work from home and no one signed for a package at my home Kerry"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cindy Mirque",
          "Nb_Reviews": 1,
          "Date": "2018-01-12T15:49:53.000Z",
          "Titre": "I ordered the Petcube and the Petcube …",
          "Contenu": "I ordered the Petcube and the Petcube play mount. The Petcube came, but the play mount never did. I have sent numerous messages to the company about this and have received no response."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2017-12-20T11:58:36.000Z",
          "Titre": "Disappointed ordered on December 3rd …",
          "Contenu": "Disappointed ordered on December 3rd and order has still not shipped...  waiting a little longer before I terminate credit card sale with my credit card company!!!  Feeling scammed..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Sophie Wassell",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T07:38:07.000Z",
          "Titre": "Terrible product and service",
          "Contenu": "Terrible product and awful customer service - camera was faulty from day one yet they refused to replace it. The live feed and sound would not work, the only way we could use it was via the short recordings which they charge extra for. I would receive emails a week after submitting a help request - saying my ticket had been closed, when I hadn’t even had a response from them, this happened many many times and drove me nuts. After months of this they offered me money off a SECOND Pet cube camera - why on earth would I buy another one!!! Recently we upgraded our internet and have been unable to reconnect the darned thing. Yet again I’ve heard nothing back from them regarding this latest issue so its going in the bin as it’s now completely useless. Don’t waste your money on any pet cube products - they don’t want to know if it’s faulty and will ignore you till you give up. $200 down the drain"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jamie Bronstein",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T00:29:29.000Z",
          "Titre": "Worked for maybe a month and then got…",
          "Contenu": "Worked for maybe a month and then got glitchy.  Not worth the money for something that randomly goes offline the minute I leave the house."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Heidi JOhnson",
          "Nb_Reviews": 1,
          "Date": "2021-10-14T14:56:35.000Z",
          "Titre": "I have never received my cube",
          "Contenu": "I have never received my cube.  I ordered and it cleared my bank on October 2.  I have not received any emails regarding my order"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "hayley",
          "Nb_Reviews": 2,
          "Date": "2021-08-02T20:34:16.000Z",
          "Titre": "terrible customer service",
          "Contenu": "communication is terrible and getting replacement parts in australia is not possible as a consumer (australia is obviously in another universe and petcube are not aware we received mail here)if you do not purchase from their set stores they will not honour a warranty. i got mine from a store not on their list and they refused to help me and i wasn't even making a warranty claim even thou it was under warranty. frustrating responses like have a nice day was one response i received while trying to get the replacement part. plus took 4 attempts to get a response and finally they responded on a fb messenger 2 months after my first enquiry. having a receipt and being under warranty means nothing. best to avoid petcube! after 3 months of trying to get a part, the store was able to source one for me but did take 3 weeks! sadly petcube are not about waste reduction as they replace products rather than parts! thank goodness the store i got mine from has sense and just got the replacement part! its 2021.. stop being part of the fast waste issue!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Savage",
          "Nb_Reviews": 1,
          "Date": "2018-07-02T21:41:27.000Z",
          "Titre": "Never completes firmware update",
          "Contenu": "Never completes firmware update.  Called to support with no luck.  Been trying to get it going for 2 weeks.  Basically a brick at this point."
        },
        {
          "Note": 1,
          "Lieu": "UA",
          "Pseudo": "vg",
          "Nb_Reviews": 1,
          "Date": "2017-12-18T13:24:41.000Z",
          "Titre": "Bad experience",
          "Contenu": "Payment was made  December 8th, and on December 18th I'm still not get any info regarding delivery!!! 10 days not received any updates."
        },
        {
          "Note": 1,
          "Lieu": "QA",
          "Pseudo": "Shelly",
          "Nb_Reviews": 1,
          "Date": "2018-01-04T09:25:35.000Z",
          "Titre": "They canceled my order",
          "Contenu": "After I received an email that Petcube order had shipped I didn’t think there were any problems with my order. I am currently deployed overseas and I do not always have a reliable connection to the internet so I missed an email from Petcube trying to verify my shipping information again.  So, because I couldn’t reply to their email in a quick turn around my Petcube order was canceled without my concent. My money was refunded, but doesn’t not help fix any of my disappointment. I notified customer service to see if there was anything that could be done about my order and their reply was just a statement about what back about what happened and I have not received any reply back to my follow email. I was very excited about this, but the experience over all has been a little unsettling.  I’m not sure if i have enough trust in this company again to try and make another purchase while I am deployed if this could happen again or if I even want to at this point. Not very supportive of the troops."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "JRobideaux",
          "Nb_Reviews": 1,
          "Date": "2018-10-17T04:08:35.000Z",
          "Titre": "The Petcube Play sucks",
          "Contenu": "The Petcube Play sucks. None of the promised functionality worked properly, save for the camera itself. I returned it the same day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2017-12-21T05:01:40.000Z",
          "Titre": "Package not delivered by date and still …",
          "Contenu": "Package not delivered by date and still not delivered. Days keep getting pushed back. Would have ordered elsewhere had I known this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-26T17:59:15.000Z",
          "Titre": "The support team did their best to help …",
          "Contenu": "The support team did their best to help me with the information available to them, although at one point they just plainly stopped responding to my questions.  I am extremely disappointed with the entire transaction experience.  The item was not delivered at the promised date.  I sent 2 Emails that went unanswered.  When I called customer service, it went straight to voicemail or a busy signal.  I finally got through the online customer service via chat and was told that the item was never in stock to begin with at the time I purchased it.  I should not have been able to purchase it if it were not available.  Also, I was never notified of any potential delays to the order throughout the time I waited for delivery.  I'm also very convinced that it would not have been shipped if I never reached customer service.   Meanwhile, the price has dropped significantly (50% down) since my purchase, and yet I still had not received the item.  So in the end, I paid a premium for a product that did not arrive on time, and I was very surprised to learn how the operations was handled."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Marija T",
          "Nb_Reviews": 1,
          "Date": "2019-08-14T02:10:29.000Z",
          "Titre": "Absolutely rubbish - DON'T WASTE YOUR MONEY",
          "Contenu": "Absolutely rubbish. I bought this a week ago from Petbarn in Australia. At first it was working okay. The live stream quality was really bad, like watching something with dial up internet, nothing but slow motion pixels moving across my screen which constantly had blurry colours interferring. Our internet connection is fantastic and we have never had an issue in the past, as we stream netflix daily. The 4 and 5 second clips were recorded with great quality but it would record EVERYTHING even when there was absolutely no sound or movement. Do you know how annoying it is having to individually delete 4 second clips that are recorded ALL DAY? I decided to upgrade to the optimal package which cost me $48USD as it promised to give me 30 second clips. Well well, much to my surprise it is STILL recording 4 and 5 second clips, no 30 second clips in sight. And to top it off, today, I haven't been able to log in all day as it keeps saying 'timeout' or 'data synchronization fail'.I am angry I wasted $200AUD to buy this stupid device, and then a further $48USD to 'upgrade' to what appears to be the worst product I've ever bought. Do yourself a favour and buy a baby monitor and stay well away from this crap product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aiden Zamarripa",
          "Nb_Reviews": 1,
          "Date": "2021-03-09T14:19:19.000Z",
          "Titre": "it sucks when im in campus it dosent…",
          "Contenu": "it sucks when im in campus it dosent let me talk when im out of school i rate this a one"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emma",
          "Nb_Reviews": 1,
          "Date": "2017-11-28T23:54:31.000Z",
          "Titre": "can't get it to connect to my internet",
          "Contenu": "can't get it to connect to my internet, even got help and still could not get it to work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-18T02:08:00.000Z",
          "Titre": "Sent me a super weird email asking me …",
          "Contenu": "Sent me a super weird email asking me what I ordered (???) and then cancelled my order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mi",
          "Nb_Reviews": 4,
          "Date": "2017-11-22T05:02:47.000Z",
          "Titre": "Never got one",
          "Contenu": "Never got one, I would like to though. Don't know why I got this email."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "LeiLarni-rose Brindle",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T07:30:07.000Z",
          "Titre": "Absolute rubbish",
          "Contenu": "Absolute rubbish. Has not once connected.Do not waste your money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "ClareC",
          "Nb_Reviews": 3,
          "Date": "2018-03-31T14:50:47.000Z",
          "Titre": "Poor product,  worse customer service",
          "Contenu": "NEW: Fewer than 5 minutes after the review below went live, I received an email from PayPal to say Petcube has refunded my money.  Interesting... But my rating still stands. If it does indeed take 5 to 10 days to process refunds, why was I not told that? Whatever,  now I can block all the emails from Petcube. ******I bought a Petcube Play to make sure my puppy is OK when I'm away from home.  But even when sitting in the room with the camera, the picture quality was poor and much too laggy to  really see what's going on. Attempting to view using a nearby cafe's Wi-Fi was impossible - the app disconnected after less than a minute and then refused to connect again. From reading other reviews, it seems this is an issue with Android phones,  so why is it marketed as being suitable for Android users? It certainly is not! But there's more...  I contacted Petcube on March 9 through its live chat to request a refund. Following the advisor's instructions,  I posted the device back to Petcube the same day.  As I used Royal Mail Track & Trace, I  know it was received by Petcube in the Netherlands on March 13. Yet all I received from the company were nonsensical emails, almost daily,  saying they hadn't heard from me and were going to 'solve the ticket'. Even replying to said emails didn't stop them coming. On March 21, I tried live chat again, was told my case would be passed to a senior supervisor. Nothing. On March 23, I used a feedback form - they really love those!!!  - to complain and on the 26th was contacted by a 'Senior Customer Support Engineer',  who asked for the tracking number.  I supplied it the same day and was then told I would receive my refund by the end of the week.     NEW: As of 3pm today there was no sign of a refund but it miraculously appeared almost immediately after I posted this review. And don't get me started on the constant emails trying to get me to sign up to their subscription package..."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Dion Damon",
          "Nb_Reviews": 1,
          "Date": "2021-02-07T01:15:52.000Z",
          "Titre": "Product doesn't work",
          "Contenu": "Product doesn't work, stay away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Teasister",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T19:43:25.000Z",
          "Titre": "Customer Support Lines All Disconnected, No e-mail response, wish I could give zero stars.",
          "Contenu": "Prior to purchase, mid-November, I reached out to customer support via e-mail as well as a couple of phone numbers found online to ask some questions.  I received an auto reply to my e-mail stating they would try to answer my inquiry within 24 hours, and both phone numbers were disconnected.  Never received an e-mail response and it's now mid January. I sent 2 other e-mails after November, to no avail.   I did end up purchasing the unit on Amazon, just to see if it was a good option, knowing it could be returned.  My concern is if/when an issue arises, there is literally no support available.  I am curious as to some of these reviews implying they were able to reach a customer service rep...even if they weren't happy with the rep, because I got a recording that the numbers were disconnected.  The irony one day is I tried the first number online that popped up under their customer service number, and it was one of their competitors (!!) so I decided to give their product a try, too.  The customer support for Petchatz is over and above, though the unit is much different than the petcube Playcube 2...much larger, more expensive, but has some very, very cool features:  Two way audio AND video, a treat dispenser that can be activated via their app, and though not good for a cat, but if you have a dog, there is an optional 'pet call' button a dog can be trained to press and call you~!  How cool is that.  So at the moment, though petcube is functioning fine on day 4, I have no way of contacting the company for support. Ever.  The Petchatz rep spent over a half hour on the phone with me the first time I called (trying to reach Petcube Play 2 support) and since then I have contacted them 3 times with other questions, etc. and always reached a person or a voicemail which was returned within minutes.  I was even given the rep's cell phone the day I set it up to contact her anytime that night if the unit went offline...who does that?  So do your research, I am going to leave it up to my daughter, but extremely disappointed in the PetCubePlay2 customer service which is literally non-existent, and overly impressed with Petchatz at how they truly show they value each and every customer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-21T22:00:43.000Z",
          "Titre": "Customer service doesn’t respond."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Dayna",
          "Nb_Reviews": 1,
          "Date": "2018-02-22T18:13:29.000Z",
          "Titre": "Customer service is horrible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Charlie Brown",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T19:50:16.000Z",
          "Titre": "Good Camera, Horrible support",
          "Contenu": "I received the Pet Cube as a Fathers Day gift. Great little camera, just what I was looking for to keep an eye on my fur babies while I was out of the house. The camera worked great for about 2.5/3 months, and then lost connection with my WIFI and would not reconnect no matter what i tried. I contacted Tech support and they determined the WIFI module was bad, and the tech offered to replace it. A few hours later i received an email stating they needed a receipt, i replied back letting them know it was a gift and I did not have a receipt, just as I had advised the tech this during the troubleshooting process. So now i have a camera that is only good as a paper weight, because they will not replace the camera under warranty like the tech said they would. This is why i rated it 2 STARS  UPDATE: A week after posting this review i was contacted by customer support (management, I believe) an was offered a replacement camera. Today I received my camera.It is a real shame i could not get support until i was forced to place a negative review just to get support.I want to change the star rating but for the fact the extent i had to go through to get this resolved i will move it up to 3 Stars. As my Title say Good Camera, Horrible support."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Annie",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T04:19:28.000Z",
          "Titre": "Would not recommend",
          "Contenu": "Would not recommend. Picture quality is ok, but the camera is unreliable. At least once a week the camera goes offline and I have to be home to reconnect it, if I am at work or on holiday I can't reconnect until I get home. For this reason I wouldn't recommend as it defeats the purpose of having a camera."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Otto Schmidt",
          "Nb_Reviews": 1,
          "Date": "2022-06-01T18:47:51.000Z",
          "Titre": "It is a bad app doesn't work right and…",
          "Contenu": "It is a bad app doesn't work right and have too pay for it.No Thanks....."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Naz",
          "Nb_Reviews": 2,
          "Date": "2019-11-21T10:59:26.000Z",
          "Titre": "- camera constantly freezes do not buy this",
          "Contenu": "- camera constantly freezes despite me having very good internet connection (even Petcube support said my internet test speed was very good.- support is sometimes online and other times the support is non existent - not fit for use, I can’t watch my pets for more than 2 seconds (not exaggerating) without it freezing.- Also the sound it makes is deafening have to switch it off 100% of the time.- I will be returning this as it’s absolutely useless."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Colin Shepherd",
          "Nb_Reviews": 2,
          "Date": "2020-01-03T03:49:53.000Z",
          "Titre": "Do your research before buying this product",
          "Contenu": "While my partner is the main user and claims there is no issues, i continue to not be able to connect to the app. I constantly have to force close and re-open in order to connect. Sometimes it will continue to disconnect me several times.Video and sound quality is poor - and on top of that you need to pay a subscription fee to save clips and get notifications! If i knew all of this, we would have just purchased a furbo! Not very happy with the product at all."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "HANNAH",
          "Nb_Reviews": 4,
          "Date": "2018-09-20T02:26:12.000Z",
          "Titre": "Poor Expeirence Turned Good",
          "Contenu": "After a rough start with my PetCube, Anna reached out to me and took great care of me. I was pleasantly surprised by how helpful and gracious she was towards me. She really took good care of me and turned the situation around by being so understanding and accommodating. This is the kind of service that will keep a customer coming back for more! Thank you!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 1,
          "Date": "2018-01-06T09:14:35.000Z",
          "Titre": "This product needs improvement.",
          "Contenu": "This product needs improvement, it’s poor quality. When you’re trying to check up on your pet, you can hear your self talk, which is annoying and the image is not clear. When it dispenses treats it makes a mess and dispenses multiple treats instead of just one. Would I recommend this product, probably not."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer Gage",
          "Nb_Reviews": 1,
          "Date": "2018-01-10T18:55:17.000Z",
          "Titre": "I am very disappointed in this product",
          "Contenu": "I am very disappointed in this product. First when I'm at work and want to check in with my pets, it makes a \"ding\" sounds which sounds like a doorbell. That makes my dogs go crazy. So I have to keep the app open showing the video so the sound doesn't make them bark. The sound has problems with clarity. Often me talking is all garbled and unintelligible. If I'm not near a network like work, it disconnects and/or can't find a network. There are just too many problems with this product which I am returning."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ScottW",
          "Nb_Reviews": 2,
          "Date": "2020-08-29T04:40:12.000Z",
          "Titre": "Petcube firmware update impossible with chat support",
          "Contenu": "My Petcube was working OK, but recently I updated my wifi and it just would not connect.  The Petcube wifi set up is very complicated compared to the other 12 devices I have here at the house.  By far the most counter intuitive.  I chatted with support a couple times, and got it to work at one point last week, but since it kept dropping from the wifi and then would not connect at all.  I chatted again and spent way too much time trying to update the firmware.  It would NOT work.  In the garbage it goes, and I would NOT recommend this product to anyone ever, nor by another one, like they tried to get me to do."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tao Nguyen",
          "Nb_Reviews": 1,
          "Date": "2017-12-24T23:12:33.000Z",
          "Titre": "Just bought the petbite 2 days and …",
          "Contenu": "Just bought the petbite 2 days and already mechanical issue. Called Petcube, they help to run some tests, but no result. Now awaiting customer service to respond after sending performance email to customer support. Hopefully, it will get fixed. Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christina",
          "Nb_Reviews": 1,
          "Date": "2018-08-24T09:49:59.000Z",
          "Titre": "Disappointing.",
          "Contenu": "I would love to give this a better rating, but just can’t. Every time I go into the app the camera is ‘busy’ and ‘something went wrong with the connection’ so I have to quit the app & re-enter and then I can connect. I was charged $10 for the membership even though I got the subscription cancellation notification email. Customer service was very kind and resolved the issue within 2 days. Motion detected at times there is no motion. Video will only run for 10 seconds even though motion is still occurring. Times when motion is happening, no video recorded. Overall, a bit disappointing. Love the night vision option: but manything was free and did day monitoring just as well."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 5,
          "Date": "2017-12-23T05:39:06.000Z",
          "Titre": "I have nothing to review",
          "Contenu": "I haven’t even received my items. Ordered Dec. 15 with proclaimed delivery by Priority Day mail on Dec. 20. It’s now Dec. 22, still no cameras. I am leaving for the holidays. Thanks - useless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kimberly Cantu",
          "Nb_Reviews": 4,
          "Date": "2018-05-02T20:16:03.000Z",
          "Titre": "I was excited to purchase this to see…",
          "Contenu": "I was excited to purchase this to see my 3 dogs and be able to administer treats throughout the day but for what this cost, the camera quality is poor in my opinion so I am returning."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Carly",
          "Nb_Reviews": 1,
          "Date": "2018-01-11T04:55:05.000Z",
          "Titre": "Customer service has been terrible",
          "Contenu": "Customer service has been terrible.  I have been trying to contact them since the end of November and only respond to half of my emails!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bobby Richardson",
          "Nb_Reviews": 1,
          "Date": "2017-12-26T17:23:45.000Z",
          "Titre": "I ordered my wife's Christmas present …",
          "Contenu": "I ordered my wife's Christmas present on December 8th and received an email the next day stating that my order would arrive by December 13th. On December 15th I called the support line and was told that my item had shipped. On December 17th I called and asked for the tracking number. I received an email on December 18th that showed a tracking label had been created that afternoon. On December 21st I called the support number again and was finally told that my order had been delayed because the particular color of camera I ordered was out of stock. While everyone on the phone and via email were very friendly, I felt like nobody really knew what was going on. I understand the enormous volume of orders during the Christmas season and I appreciate the difficulty of getting all of those orders filled and out in a timely manner. I would simply suggest a more transparent system when a back-order is inevitable. In the end, the product will arrive a couple of days after Christmas and I'm sure my wife will love it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-29T22:34:46.000Z",
          "Titre": "Received last week",
          "Contenu": "Received last week, worked for about 12 hours and hasn't worked since,  waiting on email from tech support"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2018-01-03T17:32:10.000Z",
          "Titre": "Petcube Play",
          "Contenu": "I purchased an original Petcube and was super excited when there was an auto laser feature introduced. It worked great at first, then a later update caused the laser to respond very infrequently. The video quality also was not great, which was a major decision in purchasing the new one. The video quality of my new Petcube Play is great. However, the laser feature almost never goes off. I know that it responds to a lot motion, however, I have been dancing in front of the camera, close and far away, and it just doesn’t go off. If I wanted a regular webcam, I could’ve bought one, cheaper. I really wish there was an option to turn on the laser automatically at intervals of every half hour or fifteen minutes. Right now, there is no rhyme or reason to the auto laser, and I feel like this is more software related because it happened to both my old Petcube and my new Petcube Play.I would love to update the firmware to potentially increase the quality of the device, however, in order to do so, you need to call the company to initiate a firmware update. Just why?Another frustration I’ve had is that there are advertisements within the app. Full screen ads that you have to close, which show up intermittently. If I paid for the hardware, I shouldn’t be getting ads in the app. I have it set in iTunes and App Store to disable in app purchase notifications, but they still appear regardless."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2019-05-25T16:07:33.000Z",
          "Titre": "Complete lack of CS",
          "Contenu": "Had this about a month so far. Immediately noticed it didnt come with the bag of treats it was supposed to. No big deal. I had some on hand and I fire off an email. It was late on a Friday so I didnt expect to hear back before Monday. Stuff gets forgotten in packaging, it happens.  I signed up for the Petcare and was getting push notifications non stop. Check the account and notice it is constantly uploading videos even when no one (including the dog) were home. Watch one of the +60 video recorded past midnight and notice some sort of electrical interference the mic was picking up. So I fire off another email and turn off noise recording and push notifications (negating the entire reason I signed up for the $30 petcare). Sent the second email Saturday, day after first email, and again expect to hear something by Monday. Fast forward a week and still havent hear back from my emails. Ok, I'll call them. Sat on hold for 5 minutes and got the option for them to call back once someone is available. I opt for that. Now, 10 days later, still no call back. Still no return email. Still no items that were supposed to be in the box. Still no resolution on electrical noise. If customer service sucked but it worked as advertised, I'm good. If it didnt work but customer service was trying to fix it, I'm good. But right now, it can do part of what is advertised and I get ghosted by CS. Unfortunately I bought this as a gift or I would have returned it by now."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Diva",
          "Nb_Reviews": 1,
          "Date": "2020-01-04T03:08:12.000Z",
          "Titre": "Terrible customer support",
          "Contenu": "I bought a Petcube last year, and it worked fairly well.  Video quality wasn't great and the laser dot lagged a bit, but I chalked it up to having a bad internet connection.  Then before a long overseas vacation in August I bought another and set up a second camera, thinking that the petcube care package I had already subscribed with would cover both.  Wrong! I had to pay a subscription for each camera.  Kind of frustrating but too late to return it days before the trip, so I signed up for a month with the intention of downgrading later.  When got home, I unplugged one of the cameras and cancelled the subscription on that camera.  In December, I noticed that I was still getting charged for both subscriptions even though the subscription page in my app said I would be charged 0.00/month on the second camera.I have written several emails to the address on the Petcube website, with zero response.I tried setting up the second camera again, thinking that if I was paying for it I might as well use it, but in the intervening time we'd upgraded our internet and both cameras were no longer connecting. I kept getting errors when trying to enter new network details.  I contacted customer support for help with this issue but didn't receive a response until after I had left on my Christmas vacation a couple of days later.When I returned yesterday, I decided to cancel the subscription and simply unplug both cameras.  Today though, I was charged for a subscription (only one though, luckily!) and when I logged in to the app I was still somehow subscribed even though I got an acknowledgement email when I cancelled the day before.  I have now cancelled AGAIN.  We'll see if it sticks this time.This company is dodgy as hell and their customer support is terrible. Two stars because when the product works it's actually ok. My worst complaint is the push notifications that the camera had 'detected a human' when there should not be anyone around, and that I can't set up the app and connect on my husband's camera.  I wish I could get a refund but I won't hold my breath.  If you are considering going to a pet cam, please consider a different company unless you have some money you don't mind throwing away."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T05:44:00.000Z",
          "Titre": "Great concept, mediocre experience",
          "Contenu": "I have two cameras with Petcube and have only had to contact support once to change my email address. Petcube support was helpful in assisting me through the process of updating my email, however the process itself was a pain and required resetting of hardware and awaiting feedback from the support team (which was answered always within a day, but that's still a couple of days to resolve this issue). Overall they have a great support team, just let down by a lack lustre account infrastructure and a hardware model clearly built to require subscriptions for useful features whilst still missing the mark.Would I recommend these cameras? Depends on how techie you are. If you want a standalone straight forward solution, it'll do. If you want to integrate with your existing smart home environment, hard pass."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tyler Biehl",
          "Nb_Reviews": 1,
          "Date": "2022-04-29T17:41:11.000Z",
          "Titre": "The Petcube is good, but the necessary app is not",
          "Contenu": "The Petcube, as a camera does what it needs to do well, the app however is pretty bad. It continues to redirect you to the browser which is full of pop up deals and is difficult to navigate when you need to take action on an app notification (new firmware).The setup process for the camera (via the app) is intuitive but it can fail and not provide a clear answer why to which you need to power cycle and disconnect/reconnect.If the app was more clear and easier to use, i would raise the stars to 4 or 5"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dave B",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T10:41:50.000Z",
          "Titre": "Great camera, treat dispensing and software let it down",
          "Contenu": "I have a petcube bites, which I've had for about 3.5 years now. The actual camera captures a wide field of view, works extremely well in the dark, and the motion detection is quite responsive.The treat dispensing is poor, as sometimes the treat gets stuck, it makes a noise that can scare a dog, and the precision of the dispenser leaves a lot to be desired. Anyone crating their dog might get 1/3 of the treats into the cage.The biggest drawback to the product is the software. I have set this up in four different locations, and not once has the process been simple. It often involves multiple device resets and deleting the camera from my profile and re-adding. I have contacted petcube's tech support for help connecting on two of these occasions, including the most recent set-up. During this recent set-up, tech support had to delete the camera on their end before I could connect, even though I had removed the camera on my end. In addition, when I view my dog with the camera and disconnect, the camera in the app almost always shows as offline, and I have to go into camera settings to trigger it to show online again--not a dealbreaker but annoying. I found I would often lose connection after watching for a minute or so, and then wanting to go back and reconnect to watch again would require the short, but inconvenient workaround. Finally, the updates seem to come on suddenly with no warning and even on a strong internet connection can take a very long time to apply, all the while you cannot use the camera. If you are away, you only find out the camera is updating when you go to check on your pet and the camera is unavailable.All in all, I would recommend the camera, but would advise to check and see if they've improved the treat dispenser in the new iteration, if treat dispensing is a strong consideration for you. If treat dispensing is not important, I'd probably recommend a different version than the bites, assuming the camera functionality is the same across the models. The software experience has been bad for me, but tech support is good and responsive, so if you budget for a frustrating hour setting up the device, for the most part, you'll be smooth sailing afterwards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2022-06-02T19:54:53.000Z",
          "Titre": "It's a good deal, needs some improvements.",
          "Contenu": "I ordered the Petcube Lite subscription deal where you get the camera for free but agree to a 1 year subscription. I had been using a Canary camera with a treat and train on my dog until I saw Petcube and Furbo advertisements. I really wanted the ability to dispense treats remotely and the Treat and Train only gives you the option to dispense treats at set time periods. I got the camera really fast and signed up for the subscription. PROS:1. Camera picture is really clear and has night mode. Less blurry than my Canary and more responsive. Almost too responsive.2. Shipping was really fast3. The camera is super easy to set up and connect to Wifi. 4. Easy to move the camera around the house or to alternate locations2. The subscription deal is a great way to try out the camera at a budget price. CONS:1. The camera lens is on the bottom of the unit so unless it's placed on the edge of the the table, you see a lot of table in the shot. You can't flip it over or put it on it's side due to the treat dispenser. 2. The treat dispenser doesn't dispense consistently. I would say it get stuck and fails about 25% of the time. I bought the treats that were recommended for the device by Petcube and it still isn't consistent.3. If you crate your dog, the treat dispenser will be fairly useless. I tried positioning it in many different ways around the crate but the dispensing isn't consistent and often the treat would miss the crate or fly past it.  I fixed this issue by putting a tube over the dispensing hole with molding puddy and it worked great to direct the treat into the crate. The camera has to be right up on the crate though but I can usually see most of the crate. 4. The app is a little confusing and some things don't work. For instance, you are supposed to have an ability to time some dispensing but it doesn't seem to be happening. I also tried to invite users (my partner and some dog sitters) from the app and they never got the invite. So I had to just email them separately and ask them to download the app.5. The Wifi connection isn't awesome. It's in the same room as my router and I have fiber so the speed shouldn't be the issue and all my other Wifi devices work fine. I find it goes offline easily- though i can usually get it to connect at some point. I will admit, I had this same issue with my Canary camera so not sure if that technology is still not great or if cameras are just incompatible with my router..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richie Miller",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T20:17:00.000Z",
          "Titre": "Bad / Faulty Camera",
          "Contenu": "*RATING HAS BEEN UPDATED FROM 1 TO 3 STARS* Petcube sent me a new camera following my negative review. Don't anticipate the same issue to happen again with new device. Original: Received a camera that has had intermittent connectivity issues from the beginning. Repeat lengthy instructions to “fix” the issue would fix it for a while until the unit finally stopped connecting altogether. When I explained this they again blamed my WiFi connection which is fine for all other wireless devices and cameras in my house. Weren’t interested in sending me a replacement so I finally just threw it in the trash and bought a competitor brand camera which has worked great from day one in the exact same spot."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elaine Tsai",
          "Nb_Reviews": 1,
          "Date": "2018-03-30T04:01:42.000Z",
          "Titre": "Product was easy to set up",
          "Contenu": "Product was easy to set up. Unfortunately the video has been glitchy. Much more than expected since the product is pretty expensive. The actual product is very nice feeling and looking; however, what you get for the price for the video quality doesn't match. We wanted to love the product and give it 5 stars but the quality of the video and how glitchy it is makes it hard to do so."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T22:24:54.000Z",
          "Titre": "Petcube Play",
          "Contenu": "Setup took forever despite having everything on and entered correctly and customer support didn't answer my only option was to leave a voicemail. Once up and running the app crashed 4 times in a row. The camera is great the picture is awesome and I love that I have the ability to talk to the dogs because one jumps the gate. Hopefully the app gets updated soon to fix the issues."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-30T03:00:22.000Z",
          "Titre": "The product gets 5 stars but the …",
          "Contenu": "The product gets 5 stars but the shipping confirmation and tracking services were horrible. I ordered next day delivery on the 21st so the package would arrive on the 26th (day after Christmas). Got a notification that the package shipped on the 29th but that’s when it arrived at my brothers house. Guess it’s a Merry New Year then.\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Che",
          "Nb_Reviews": 2,
          "Date": "2018-06-14T19:49:18.000Z",
          "Titre": "Easy Set-up",
          "Contenu": "We just received this camera and the biggest pro for this item is the set up. The set up does not take long at all. Plug in the cube, download the app and connect! The camera has a fish eye lense that provides a wide area of view. The quality of the video is not as sharp as other cameras such as the Nest but good enough to view your fur baby. The camera is compact which provides ease of storage when you don’t need it. You can also leave it out and it isn’t an eye sore. Based on further use of the camera, the video connection takes a long time and the sound is poor quality."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eads Johnson",
          "Nb_Reviews": 1,
          "Date": "2018-03-18T20:49:48.000Z",
          "Titre": "We bought a petcube bites and while the…",
          "Contenu": "We bought a petcube bites and while the camera is great the Android app is prone to crashing and very slow.  IPhones or pads work better.  The feeding feature and the motion sensor are amazingly useful if you have a younger pet (Or pets)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Martin",
          "Nb_Reviews": 1,
          "Date": "2018-11-06T17:33:47.000Z",
          "Titre": "I think it is strange there is no Power…",
          "Contenu": "I think it is strange there is no Power Button. A button would be preferred to just unplugging the device in order to take it offline.  Also, the sound quality could be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caitlin",
          "Nb_Reviews": 1,
          "Date": "2018-03-23T12:54:13.000Z",
          "Titre": "It's okay",
          "Contenu": "Honestly, it's okay. When it works as it should - it's great. But it rarely seems to do that. I'm supposed to get notifications when my pet moves and I'd say that works probably 50% of the time. It bothers me that I can't shut off the laser completely. When I log in to the app, I can shut it off, but if I go out and come back in the laser will default to being on again. When I set the camera to \"sleep\" when I get home, it will still record motion (aka me walking around my apartment). This totally weirds me out so I've started to just unplug it when I'm home. Fortunately, it's quick to get back online upon plugging it back in. With all that being said, the video is clear and I'm able to easily save any clips that I want to keep. I just feel that for what I paid, it should work more consistently."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "viaxo",
          "Nb_Reviews": 1,
          "Date": "2018-07-24T00:14:10.000Z",
          "Titre": "Overall review",
          "Contenu": "The social aspect should not be primary but secondary. Camera and camera options should be primary part of UX Design. You should also have controls for the Family camera share to maintain boundaries. I added family members without realizing they had full access and this ended up violating my privacy. You should have an alert when someone is actively trying to view your camera to allow or deny their access. The laser should sleep when inactive for over 30 seconds. The lights on the cube should also inactivate when not in use to not blind the cat. The laser should motion sensor the cats face so when it goes at random it doesn't go in the cats eyes. The turn on noise that clicks should be something more fun like a meow or woof instead of a chime. My cat responds to it. The two-way talk feature sounds robotic. Can't wait for them to enhance and update the cube then I'll come back and buy!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Karle",
          "Nb_Reviews": 1,
          "Date": "2017-11-21T22:21:54.000Z",
          "Titre": "I love love loved my Petcube",
          "Contenu": "I love love loved my Petcube, and bought another one, but the app seems to have stopped working. If they can fix that, I'd highly recommend"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2018-03-28T11:49:22.000Z",
          "Titre": "Nice but the echo sucks.",
          "Contenu": "I do like the Petcube; however, I do experience the echo effect when trying to speak to my pet. If that issue was fixed, I would rate higher."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "May Maya",
          "Nb_Reviews": 2,
          "Date": "2020-01-10T19:51:56.000Z",
          "Titre": "SO-SO CUSTOMER SUPPORT",
          "Contenu": "UPDATE: Customer service has been very responsive via email. My cameras is now back online but I still have problems with it. It doesn't capture all of the movement and it shuts off on it's own (while I think it's recording). It's still ridiculous troubleshooting via email instructions. The reps are very polite though. If it weren't for them (Marina and Chad), I would have rated \"Bad\". My camera stopped working and customer service is only available by email which takes at least 36 hours to get a response. When Chad responded to my first email, I replied immediately and of course no response back, yet and it's been almost 24 hours again. I begged for someone to call me while I'm at home to troubleshoot but of course no call or response. If they do respond today via email, it will be a waste of time bcus I don't carry my camera to work! The audio also sucks too, the static sound scares my pets.  The camera I purchased on amazon for $35 is much, much better."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PersephoneEve",
          "Nb_Reviews": 1,
          "Date": "2017-12-20T20:36:52.000Z",
          "Titre": "Poor sound quality....",
          "Contenu": "Poor sound quality, okay ish camera quality, but overall a good product. Gets the job done and was worth the cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cece",
          "Nb_Reviews": 1,
          "Date": "2017-12-24T13:26:32.000Z",
          "Titre": "App is easy to use and haven't had any …",
          "Contenu": "App is easy to use and haven't had any major issues. Wifi connection is decent at best though...."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Regina Nepsha",
          "Nb_Reviews": 2,
          "Date": "2018-03-01T19:00:37.000Z",
          "Titre": "PROS & CONS",
          "Contenu": "PROS: • I love the idea behind this. It's hilarious to be able to see what my cats are up to when I'm away. The video works in low light, so when lights off in my apartment, I can still see my cats.• A lot of video is captured and stored, I can scroll through and view when I want. Being able to turn Notifications on or off gives me control.• The start up manual was designed well and set up was easy. The app walked you through the process. Was using it within minutes of opening the box. • Customer service is very friendly and helpful.CONS: • I live in a small apartment, so this is bigger than I'd like. It has a long cord, but finding the perfect position near an outlet that also fits on a shelf is a challenge. In a bigger apartment this probably wouldn't be an issue. Manual suggests placing at least 3 feet above floor, but to be honest, that seems too high. Half the time my cats are off camera because they are low to the floor. • Start up manual doesn't include info on how to load the treats. The lid to the dispenser is hard to remove, so I started to doubt that was where you load them. Thankfully, you only have to remove the lid once in a while as treats need replacing. • Not ideal when treats are small. The dispenser shoots out 6 or 7 at a time. They kind of get sprayed out across the floor. My kitten loves chasing treats, so he seemed to like it. Initially, he was skittish because the dispenser is kind of loud. My older cat can't be bothered. I think it confuses her. Uneaten treats have been stepped on and make a mess.• Having to have wifi on all the is another issue. My apple Wifi gets hot so I don't leave it on when I'm away which defeats the purpose of having the Pet Camera. I didn't do enough research before I bought it as to how it works. My bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Regina Nepsha",
          "Nb_Reviews": 2,
          "Date": "2018-03-01T18:58:45.000Z",
          "Titre": "PROS & CONS",
          "Contenu": "PROS: • I love the idea behind this. It's hilarious to be able to see what my cats are up to when I'm away. The video works in low light, so when lights off in my apartment, I can still see my cats.• A lot of video is captured and stored, I can scroll through and view when I want. Being able to turn Notifications on or off gives me control.• The start up manual was designed well and set up was easy. The app walked you through the process. Was using it within minutes of opening the box. • Customer service is very friendly and helpful.CONS: • I live in a small apartment, so this is bigger than I'd like. It has a long cord, but finding the perfect position near an outlet that also fits on a shelf is a challenge. In a bigger apartment this probably wouldn't be an issue. Manual suggests placing at least 3 feet above floor, but to be honest, that seems too high. Half the time my cats are off camera because they are low to the floor. • Start up manual doesn't include info on how to load the treats. The lid to the dispenser is hard to remove, so I started to doubt that was where you load them. Thankfully, you only have to remove the lid once in a while as treats need replacing. • Not ideal when treats are small. The dispenser shoots out 6 or 7 at a time. They kind of get sprayed out across the floor. My kitten loves chasing treats, so he seemed to like it. Initially, he was skittish because the dispenser is kind of loud. My older cat can't be bothered. I think it confuses her. Uneaten treats have been stepped on and make a mess.• Having to have wifi on all the is another issue. My apple Wifi gets hot so I don't leave it on when I'm away which defeats the purpose of having the Pet Camera. I didn't do enough research before I bought it as to how it works. My bad."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gail",
          "Nb_Reviews": 4,
          "Date": "2017-12-26T21:36:01.000Z",
          "Titre": "Customer Service.....",
          "Contenu": "Customer Service...... what service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Gallagher",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T03:44:57.000Z",
          "Titre": "Fun tool for interacting with your pet."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T13:30:40.000Z",
          "Titre": "The camera is helping us watch our…",
          "Contenu": "The camera is helping us watch our rescue dog w/separation anxiety and be sure he's behaving.  Be sure you have good internet service.  We live in a rural area and are lucky to have 6 or 7 gigs.  There is delay on the camera.  We are not sure if this is camera or our internet and that is the reason for 4 stars.  Also, the camera placement depends on where router is.  Petcub is helping us and I do not regret buying it.  I got great customer service to my questions before buying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katlyn Moody",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T21:32:13.000Z",
          "Titre": "Weak motion detection",
          "Contenu": "I wish the motion detection was more sensitive when recording pets movement. When I’m trying to figure out which of my cats is doing something wrong the camera misses it. It records humans just fine but is not sensitive enough for my cats"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carl Alessi",
          "Nb_Reviews": 1,
          "Date": "2023-06-16T17:21:45.000Z",
          "Titre": "The camera functions well and is…",
          "Contenu": "The camera functions well and is affordable. The only reason I gave 4 out of 5 stars is that the motion detection feature, which in years past used to be free, now requires a subscription to use."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Fiona Campbell",
          "Nb_Reviews": 2,
          "Date": "2022-09-13T22:56:20.000Z",
          "Titre": "Brilliant service",
          "Contenu": "Had an issue with my Petcube cam connecting to the Internet. It worked at first, then was offline. If not for that it would be 5 stars, as the reply to my query was almost immediate, which is practically unheard of with most things. The advice was perfect and worked. Very pleased with my new toy  and will be trying not to get distracted at work by what my little boys are up to."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Joanna Hobman",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T09:19:07.000Z",
          "Titre": "Peace of mind",
          "Contenu": "I’ve really appreciated having the Petcube so I can keep an eye on my pets and the house while I’m out. I had an issue with my account at one point and the people at Petcube were able to get me sorted within a couple of hours, which was great."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Yuki",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T18:36:12.000Z",
          "Titre": "I love how fast I received the petcube",
          "Contenu": "I love how fast I received the petcube! Its a great camera and its super fun to throw the treats when I'm away. But I didn't receive a receipt for the subscription, or any indication/confirmation that it went through."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sydney Scholz",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T19:47:37.000Z",
          "Titre": "Awesome customer service",
          "Contenu": "Awesome customer service! My camera has problems hooking up to my wifi, they helped as much as they could, nothing worked but they were so friendly and understanding, they sent me a replacement camera."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "NE",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T17:33:36.000Z",
          "Titre": "Quick response to my question!",
          "Contenu": "I was very pleased at how quickly my inquiry was responded to.  I replied to the email and received a response within a few minutes. I was successful in resolving the issue I was having. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tony Jackson",
          "Nb_Reviews": 2,
          "Date": "2022-04-11T21:48:47.000Z",
          "Titre": "peace of mind",
          "Contenu": "Gives so much peace of mind being able to see the dog when away and knowing that the treats and our voices keep the dog calm.  Very easy to set up and a high quality camera make the cube well worth the money"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "James Ducker",
          "Nb_Reviews": 2,
          "Date": "2022-04-07T14:08:57.000Z",
          "Titre": "Great Team with fast Response!!",
          "Contenu": "Great product...at first I was having issues with it but it seems as though they were mistakes that I was making and thanks to the amazing team at Petcube (who were super fast in getting back to me). The issue was solved in a matter of days!"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Julianne Cobham",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T23:32:15.000Z",
          "Titre": "I was impressed with the promptness in…",
          "Contenu": "I was impressed with the promptness in getting back to me about my query and the follow up from there. I am very pleased with the Petcube and have some friends who are now impressed also and are buying one to help with their dog issues.Great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MK",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T14:37:47.000Z",
          "Titre": "Good, simple monitoring",
          "Contenu": "I ordered the product from Amazon. Ordering and delivery were fine. I got this product because it was described as wireless. I was expecting it to come with battery or USB charging but the wireless was in reference to it connecting via wi-fi. This was disappointing bc i have a very mouthy puppy and was looking for something that did not have to be plugged in. The initial set up was very easy and straight forward. I had some issues with keeping the camera connected, but it was a simple fix. If you have a converter router that has 2.4 and 5g and the network names are the same, you just have to change one of them. The FAQ answer made it seem more complicated than that but once i figured that out I had no issues. The picture quality is good for a $40 camera. It is serving its purpose as a quick solution for my needs. Customer service was very responsive and willing to help. They checked in several times to make sure my issue was resolved. I recommend it for a simple monitoring device. I would just be mindful if you are using to monitor a puppy or dog that is a chewer or interested in wires. I am still trying to find the best placement for my camera, going to try to mount it."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kt London",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T22:35:55.000Z",
          "Titre": "It took several goes to get my Petcube…",
          "Contenu": "It took several goes to get my Petcube working again. I appreciated The continuity of the service that finally got it resolved"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Heather",
          "Nb_Reviews": 19,
          "Date": "2023-01-23T06:35:36.000Z",
          "Titre": "Assistance and Care from staff",
          "Contenu": "The follow up I received from the staff.  It was tricky for a novice but with all the help I received, it now works fine and the picture is great.  I can rest easy that my pet is fine within the wide radius of the lens."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "José",
          "Nb_Reviews": 3,
          "Date": "2022-10-18T04:56:21.000Z",
          "Titre": "It works, customer service is swift",
          "Contenu": "Camera had a bug the first time I used it, had to contact customer service and they fixed it fast. Thankful for that. Has been working good ever since."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T09:55:30.000Z",
          "Titre": "The support team is very friendly and…",
          "Contenu": "The support team is very friendly and Simply amazing service, and I recommended the products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashley Williams",
          "Nb_Reviews": 1,
          "Date": "2022-04-17T17:02:21.000Z",
          "Titre": "Representative was able to help me with…",
          "Contenu": "Representative was able to help me with my problem, and continued to check on me to make sure the problem was resolved"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Rafael Labrador",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T21:36:57.000Z",
          "Titre": "Would be 5Stars with howling alerts",
          "Contenu": "I love this cam. I dont give 5 stars because it doesnt have howling alerts yet."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Roger",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T22:01:15.000Z",
          "Titre": "Quick response from team and issue…",
          "Contenu": "Quick response from team and issue resolved"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JMK",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T06:43:27.000Z",
          "Titre": "Your cameras went offline and you did…",
          "Contenu": "Your cameras went offline and you did not notify your customer. I spent time troubleshooting what I believed was an issue on my end. This is an area where you should improve and be proactive.Customer service response and promise to make improvements in the areas of concern was admirable. The team appeared to take a genuine interest in customer satisfaction.  Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rain",
          "Nb_Reviews": 1,
          "Date": "2021-11-26T00:50:19.000Z",
          "Titre": "Amazing, affordable pet camera!",
          "Contenu": "I'm really loving my Petcube camera so far! I was looking for something to check up on my new rescue that wasn't as expensive as those interactive treat cameras, and this one was a great pick! The app is really nice, the camera (and night camera) quality is great, and the audio was just as I expected it to be. The microphone/speaker isn't perfect recording quality, but it really doesn't need to be - and I think it's super reasonable for this price. I love the photo and recording function too!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "AletaC",
          "Nb_Reviews": 1,
          "Date": "2021-10-24T01:14:57.000Z",
          "Titre": "Love the petcube but..",
          "Contenu": "Love the petcube, love how sleek it is. The only thing is that as this is an animal product, I would recommend making the cord more animal/teeth proof. It lasted maybe 48 hours until my kitten chewed it up, and I had to buy a new one with a cord protector on it. Otherwise, it’s great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charles Lacasse",
          "Nb_Reviews": 1,
          "Date": "2018-04-19T19:55:45.000Z",
          "Titre": "Great product; little bit too big",
          "Contenu": "The camera is high quality and I love seeing what my dog is up to while I’m at work. It’s also fun flinging her a couple treats every now and then. I’ve had no issues using the app—overall I’m very pleased other than the overall size of the unit. It’s a bit bulkier than I had anticipated and I’m afraid my dog will knock it down one day when she’s upset for not receiving a treat."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PetCube Play customer",
          "Nb_Reviews": 1,
          "Date": "2018-03-15T00:05:49.000Z",
          "Titre": "Initial customer service was bumpy",
          "Contenu": "Initial customer service was bumpy, but the second representative to jump in was very helpful, polite, etc.  (My initial device wouldn't connect and had to be sent back.) The device itself may not have been worth the investment for me, as it is difficult to hold my cat's attention.  However, it functions very well and I can easily picture it entertaining my parent's 1 year old puppies endlessly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arielrissa",
          "Nb_Reviews": 1,
          "Date": "2018-06-14T21:03:31.000Z",
          "Titre": "Excellent opening experience",
          "Contenu": "Packaging was neat and eco friendly. Instructions were extremely easy to follow. Device pairing did not work the first time I tried because I was too far away from the WiFi modem. The camera, treat launcher, and sound all work great! After I mounted it on the wall, however, it will launch two or three treats at a time. I’m sure this can be fixed with larger treats."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Haley Schmidt",
          "Nb_Reviews": 1,
          "Date": "2018-02-12T21:58:15.000Z",
          "Titre": "Petcube Bites Pet Camera",
          "Contenu": "I bought the Petcube Bites Pet Camera from Petcube through Amazon. It allows me to monitor my puppy throughout the day while I'm at work. My favorite aspect is that it sends me notifications when it senses movement. When she gets bored and starts moving around the room, I can toss her treats - a nice surprise for her when she is home alone during the day. It also feels like a little security system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lacey H",
          "Nb_Reviews": 1,
          "Date": "2018-04-04T02:14:57.000Z",
          "Titre": "Good once set up alternative utilized",
          "Contenu": "The set up process did not connect immediately for me but I was able to find an alternative process on PetCube’s website. The app appears easy to navigate and the unit itself is well built and sturdy. Depending on the height the unit is placed and the treats used, I think the treat fling could get some good distance! I chose the all black unit and it’s very sleek looking."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2017-12-17T16:53:39.000Z",
          "Titre": "Great! Minor kinks though.",
          "Contenu": "I love being able to watch my dog while I'm away all day at work. Being able to talk through the camera is AWESOME! However, there have been a few times where I try to log in to see what he's doing and the camera will be \"busy\" or tell me I am \"next in line\" and have to wait a minute or so for the camera to turn on. That is my only disappointment with it so far."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tori",
          "Nb_Reviews": 1,
          "Date": "2018-04-02T23:27:28.000Z",
          "Titre": "Great for working dog parents!",
          "Contenu": "I have a 5 month old puppy at home and work full time. The Petcube allows me to check in on my dog throughout the day and make sure she is doing okay. The treats are a great idea to reinforce good behavior. However, the cube tends to malfunction at times and spit out more than one or no treats. Despite this I would highly recommend this for anyone who is away from their dog for long periods of time and misses their puppy like I do!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "anicoleb1991",
          "Nb_Reviews": 2,
          "Date": "2018-04-17T00:14:49.000Z",
          "Titre": "Checkin on the Pooch",
          "Contenu": "It’s great! I’m moving into an apartment from living with my lifelong roommates (aka parents) so I got this before we move in to train her on it. It’s so much fun! And I love checking in on her and giving her treats. The camera quality is not always the best, due to connection and cell service, but it works for what you need it for even when it’s not the best."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2017-11-22T16:24:24.000Z",
          "Titre": "really cool, could improve camera angle",
          "Contenu": "It is a really cool invention to play with your pets when you're not home. But I think there are 2 important features that should be improved: camera angle should reach at least 250º.  And the laser/voice commands should respond instantaneously. It logs and it's kind of annoying. Everything else is perfect. The packaging is adorable, and the cube design is flawless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2018-01-21T21:51:19.000Z",
          "Titre": "so much fun!",
          "Contenu": "The app does everything it is supposed to. I wish it was an option to just watch other people play on the camera after you get kicked off instead of the call ending. It happens a lot with particular pets when I'm playing then my turn is over but I still want to watch the pets play with the next person in line, but the call is ended. I'm making a lot of friends in this app, and it's so nice to see so many happy animals."
        },
        {
          "Note": 4,
          "Lieu": "UY",
          "Pseudo": "Donald Young",
          "Nb_Reviews": 1,
          "Date": "2018-10-19T13:51:52.000Z",
          "Titre": "Love my petcube device",
          "Contenu": "I love my petcube device, however I had to buy a new one as the first I purchased it broke down and the return and replacement method has not been succesful. I had to buy a second one and still have to ship the deffective one.The petcube company SHOULD replace those deffective petcubes with no need of the client sending the old one."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shannon Soafer",
          "Nb_Reviews": 1,
          "Date": "2018-08-14T22:04:35.000Z",
          "Titre": "Great but treat number varied",
          "Contenu": "The Petcube Bites came in a nice package and treats for my dog were included. Instructions for set-up were easy to follow. The only reason why I did not give it 5 stars is because I could not choose the amount of treats dispensed when I pressed the treats button on my phone. Sometimes it would send 2 treats and other times it was 5 treats with one press of the button. Otherwise I was very impressed with this product and the image quality of the video and microphone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LolMac",
          "Nb_Reviews": 1,
          "Date": "2018-05-07T14:18:22.000Z",
          "Titre": "When mom's away, watch the doggie play",
          "Contenu": "After a few issues getting set-up, which the customer service team helped with very quickly, the Petcube has been a welcome and entertaining addition to our home. I situated it too low initially, so my dog just barked at it all day after she realized it housed treats. I moved it and this made a big difference. Saving and sharing videos is not important to me, but I like being able to peek in on her during the day and send her a treat or two. It's pretty funny."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Inga L.",
          "Nb_Reviews": 1,
          "Date": "2018-03-16T18:39:04.000Z",
          "Titre": "Great tool for busy pawrents",
          "Contenu": "We all love to have our pets close, but unfortunately it's not always possible. Petcube Play and its app is an awesome tool to help you check on your beloved pet during the day. It's easy to set up, the app is user friendly and it gives you some options to share your pet's interaction with the camera. You can either check live or check the interaction history, which is very nice. The laser might be better suited for cats, but it is still a lovely product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annie L",
          "Nb_Reviews": 2,
          "Date": "2018-02-22T02:13:52.000Z",
          "Titre": "Great purchase!",
          "Contenu": "Based on my previous review, Mariana from Head of Customer Support reached out to me and assisted with my shipment and kept me updated with tracking information. She also followed up several times by email and gave me a 3 months subscription to Petcube cloud's service. Aside from customer service, the Petcube is great for keeping an eye on my kitties while I'm at work. I can play with them anytime I want if they're awake. Definitely a great purchase!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Marielle",
          "Nb_Reviews": 1,
          "Date": "2017-11-23T04:24:09.000Z",
          "Titre": "Very good product...",
          "Contenu": "I like how easy it was to set up and use with the android app. The laser works pretty well for me when calibrated. I wish the speaker and microphone were of higher quality. The echo from the microphone gets annoying. I look forward to seeing improvements and innovations in future iterations of the Petcube Play and other Petcube products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ashle Garman",
          "Nb_Reviews": 1,
          "Date": "2018-03-30T00:09:14.000Z",
          "Titre": "Pretty cool",
          "Contenu": "Pretty cool!  Camera quality is better than I anticipated. So far the sound isn’t the greatest when I’m trying to talk to my pets be a use there are noises that confuse them, but they are working to fix that for me when customer service spoke to me.  When I’m just watching my dogs go about their normal sleep schedule!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anj",
          "Nb_Reviews": 1,
          "Date": "2018-05-04T06:41:48.000Z",
          "Titre": "Great when it works",
          "Contenu": "Good company that does its best to support the customer. Unfortunately I've had a lot of problems with my devices breaking, but customer service will help you replace it if it's within one year of purchase. I just wish the product itself could last longer because it is something I really enjoy using."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VL",
          "Nb_Reviews": 1,
          "Date": "2018-07-25T01:54:24.000Z",
          "Titre": "Awesome pet camera!",
          "Contenu": "I love having the Petcube and being able to watch my animals.  I also like that you can play with a lazer with them and talk to them.  I had some technically difficulties when I was trying to setup my Petcube, but support was awesome at helping me! I highly recommend this to watch your furry friends!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Julie S.",
          "Nb_Reviews": 1,
          "Date": "2018-06-14T20:04:27.000Z",
          "Titre": "Pretty cool",
          "Contenu": "After the initial disappointment of my Petcube arriving a day later than Amazon promised it, I really like it!  It gives me peace of mind being able to check in on my fur babies throughout the day.  I'm still figuring out how to use it effectively and have learned that my boys are incredibly boring when I'm away. The wide angle camera allows me to see a large area and I can even zoom in.  I think the laser would be enjoyed more by cat owners.  Too bad the camera doesn't have a treat dispenser...that would be awesome"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-01-02T23:46:57.000Z",
          "Titre": "Perfect to keep an eye on little troublemakers!",
          "Contenu": "I love having the ability to keep an eye on my pup when I'm not home. I've had a little trouble with getting the laser to work consistently, and have to reset it every once in a while to get it working again. That said, everything else works like a dream and the night vision is AWESOME!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randall",
          "Nb_Reviews": 1,
          "Date": "2017-11-21T23:19:27.000Z",
          "Titre": "Great two-way camera, tossing a treat needs tweaking",
          "Contenu": "Great two-way camera, treat delivery system needs tweaking.  I wanted to use the camera as a way of counter-conditioning my dogs barking reaction to the doorbell, but unfortunately the delay is too slow.  The implications for training other behaviors would also be great if this could be tweaked."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2018-03-02T16:19:13.000Z",
          "Titre": "Petcube Bites is a win!",
          "Contenu": "This is a fun addition to my living room. My fat cat comes running when she hears the unit start working. I like that it has night vision so I can see what’s happening no matter the time. It alerts to sounds and motion if you want. Lots of extras in the app that I’m getting used to as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Zide",
          "Nb_Reviews": 1,
          "Date": "2018-04-15T16:13:34.000Z",
          "Titre": "Overall this is a good product",
          "Contenu": "Overall this is a good product! The wide lens is great to enable you to see the entire room. In a completely dark house, the night vision still enables you to see very well. The camera quality is pretty good and the zoom function works to allow you to really see your pet. The laser can be very slow to respond and doesn't always go where you tell it to. The motion activation recording can be activated by changes in light inside the house, not just your pet, but overall that just means you have more recordings. I would buy this product again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2017-11-22T13:55:08.000Z",
          "Titre": "This device has allowed us to monitor …",
          "Contenu": "This device has allowed us to monitor our new puppy quite well! He has been escaping from his crate. The camera caputed how and when he escaped, so we were able to figure the problem out. As we transition him to being home with no crate, again, we feel more confident, keeping an eye on him. The only downfall is that once you unplug the camera you loose the free 4 hours of video stored. Sometimes we wanted to review the video after we discovered something missing and couldn't if it was already unplugged. Other than that, it as been great!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christa",
          "Nb_Reviews": 2,
          "Date": "2018-05-10T01:39:23.000Z",
          "Titre": "The Petcube is great!",
          "Contenu": "The Petcube is great! I love being able to check up on my dogs while I’m away. The treat shooter is great to give the dogs treats while I’m gone and they love it! It doesn’t always shoot out the same amount of treats each time, but it can shoot them at a very decent distance!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 1,
          "Date": "2018-03-25T05:09:09.000Z",
          "Titre": "Worth It",
          "Contenu": "I love having the ability to check in on my dog throughout the day to see what she's up to.  Being able to see her little ears perk up when I call her name brightens my day.   I had some issues setting up my wifi with the Petcube Bites, but it was worth the effort!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela Klyber",
          "Nb_Reviews": 1,
          "Date": "2022-05-26T16:05:49.000Z",
          "Titre": "Just can't figure out how to get the…",
          "Contenu": "Just can't figure out how to get the sound to work?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Meghan Moeller",
          "Nb_Reviews": 1,
          "Date": "2018-04-22T04:40:02.000Z",
          "Titre": "Easy setup and clear camera",
          "Contenu": "I just started a new job, and wanted a way to check on my pup and ease him back into long days at home alone. The Petcube is great! The video quality is amazing, and the lens gives a wide clear view of the room. The setup was super easy, it connected to my wifi with no problems. It did have to update the software, but it was quick and easy. I love that it sends notifications to your iphone when your pet is in the room. My pup quickly picked up where the treats were coming from, and enjoys that he gets bonus treats when I'm not home! Also I have super cute photos of his face!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Munan",
          "Nb_Reviews": 1,
          "Date": "2018-04-13T13:31:11.000Z",
          "Titre": "Great purchase",
          "Contenu": "I really really like the Petcube. It’s so sleek and pretty. It allows me to see my dog and what she’s doing during the day when I’m at work. Sometimes the video has a little delay probably because of the internet connection but it doesn’t bother me too much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris Zollna",
          "Nb_Reviews": 1,
          "Date": "2018-05-07T02:19:07.000Z",
          "Titre": "The camera is really great and so is…",
          "Contenu": "The camera is really great and so is the motion sensor. Another great feature about the camera is the night vision. I love the fact that I can check on my animals and my house when I am away from home. The packaging is beautiful and the set up is fast and easy. The PetCube even comes with a bag of treats to get you started. I took off one star because I have been having problems with audio feature that allows you to talk to your pets. For me that is the least important feature. I would recommend this product to my friends and family. You can't beat the price and its fun to fling treats at your pets."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd McDaniel",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T13:56:48.000Z",
          "Titre": "Problem solved",
          "Contenu": "Problem solvedI was experiencing connection issues, tried several troubleshooting ideas could not connect and they are sending me a new one. I hope it work, I love my pet cube."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kayla Knudsen",
          "Nb_Reviews": 1,
          "Date": "2018-06-26T00:13:42.000Z",
          "Titre": "A Great Way to Check in on Your Animals From Anywhere! (Usually)",
          "Contenu": "I have had a new Petcube Play for about a month now and I love it! I use it in our spare bedroom to watch our foster animals and see how they transition to their new environment . It is an awesome way to watch them during the day while we are gone as well as capture footage and photos of them running and playing to post on their adoption profiles.The one negative I have experienced with our Petcube is that many times it disconnects or appears offline so I cannot access the camera. It is on the same level as the router, so it was my hope we wouldn't have connectivity issues, but it does happen occasionally. If that was fixed, it would be perfect!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Casandra",
          "Nb_Reviews": 3,
          "Date": "2018-03-25T08:38:49.000Z",
          "Titre": "Worth it but maybe not for as inexpensive it is",
          "Contenu": "Quality of the cameras is really good. The laser works really good. The treat dispenser works well. The only problem I have is the microphone option. On either end, it sounds horrible. And there’s no option to adjust the volume."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2017-11-22T01:39:14.000Z",
          "Titre": "Overall - Cool!!",
          "Contenu": "There is a ton of feedback on the microphone when I try and talk with my pet. I love the camera, it is clear as day and the night vision is so cool! The only thing that would make it better is a smoke detector. Love my Petcube!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ksincla3",
          "Nb_Reviews": 1,
          "Date": "2018-06-08T02:48:23.000Z",
          "Titre": "Great camera/speaker, laser to be desired",
          "Contenu": "I love being able to talk to my pets at home. The only negative I have is that no matter how many times I recalibrate the laser, it doesn’t track well on the app, removing a decent part of the functionality of the Petcube"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valerie Robertson",
          "Nb_Reviews": 3,
          "Date": "2018-03-10T20:30:48.000Z",
          "Titre": "Great video feed, wish I got the Petcube Bites.",
          "Contenu": "Great video feed, clear, the interactive audio is a feature I’m really enjoying, though my dog gets scared and runs away any time I talk to him on it, so I wish I got the Petcube bites version that drops little treats.  It has a laser toy which would be awesome if you have cats, I only have dogs...  It’s really sensitive to motion, the moving shadows from the trees outside the window in the room set it off, so does the ceiling fan if it’s in the frame.  The set up was time consuming bc the reset button wasn’t easy to actually depress, and it wasn’t connecting to my WiFi quickly enough during my initial set up. But, once it finally did, it’s been smooth operation ever since."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carla Zeller",
          "Nb_Reviews": 1,
          "Date": "2018-04-14T21:53:36.000Z",
          "Titre": "I really enjoy the Petcube",
          "Contenu": "I really enjoy the Petcube! It is the most fun when my dogs aren’t paying attention but they love it and I love the videos I get of them with their noses in the treat hole. I can’t wait for our doggy friends to come over"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betsy Parker",
          "Nb_Reviews": 1,
          "Date": "2018-03-14T19:38:03.000Z",
          "Titre": "PetCube left me smiling all day!",
          "Contenu": "I have had the best time with this product! There is something wonderful about being able to see my pets throughout the day when I'm not at home. I smiled the whole first day. We all seem amused by the flying treats! My only complaints (if they can even be called that) is that there is an echo when I try to talk to the fur babies; This could be user error. I also wish that I was able to scan the room and not just focus on one area or corner. Last, the treat hole seems to get very dirty from all of the crumbs, which has started to spill onto the floor directly below the unit. They're licked up eventually, so not a huge deal. Overall, I'm really enjoying having this part of our lives."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PetCube User",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T17:40:55.000Z",
          "Titre": "It would be great to have the option to…",
          "Contenu": "It would be great to have the option to select multiple video files to delete at once rather than having to do it individually.  Otherwise so far so good!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Terri K.",
          "Nb_Reviews": 1,
          "Date": "2018-03-27T01:47:42.000Z",
          "Titre": "Very nice product and easy to use!",
          "Contenu": "Easy to set up. Packaged very well. I have had the Petcube only a few days and already have had a lot of fun with it.  We got our four-legged family member for my granddaughter, who spends time at our house two weekends a month. Now, my granddaughter has also downloaded the app and is able to see and talk to her \"pup\" when she is not at the house. She loves that she can interact with her dog now on a daily basis. I think it is going to take a little more time for our dog to get used to the treat dispenser. It is a little on the loud side and he is afraid of it. Our dog is also unsure when he hears our voices but does not see us. Overall, I am very happy with the Petcube. Love the additional interaction it has provided us."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ian H",
          "Nb_Reviews": 1,
          "Date": "2018-02-19T23:53:10.000Z",
          "Titre": "Great for seeing what pets do when you're not around!",
          "Contenu": "The PetCube Bites is a great gadget and was very easy to set-up and get working. The app was easy to install and use although I would recommend reading the entire online manual as some options were not obvious at first. The camera and overall construction seem to be of excellent quality and yes it does let you remotely toss snack to your pet which is really clever!What I really like is the ability to see what our cats do when no one is watching them- we put the PetCube in the kitchen by their food the first night and were amazed how many times the cats came downstairs to eat- cool! I will say that I think this device is probably even better for dog owners based on the interactive features and the treat size (too many small treats dispensed at once)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Connie",
          "Nb_Reviews": 2,
          "Date": "2017-12-24T02:11:02.000Z",
          "Titre": "Good Service",
          "Contenu": "Although it took me two phone calls, with different customer service reps, and different directions to follow, my petcube was fixed.  Thank you. I would definitely recommend Pet Cube."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ana Sav",
          "Nb_Reviews": 1,
          "Date": "2018-04-30T20:10:14.000Z",
          "Titre": "Good gadget to monitor your pet/home with bonus treat dispenser",
          "Contenu": "Got the Petcube Bites in silver.. looks slick and packaged nicely.  It was easy to install.. just the usual troubleshooting (rebooting to get the wifi to work).  The camera is great as it gives you a clear view of the entire room.  You have to get used to the app to turn on the mic if you want to be heard by your pet.. it's not automatic.  My dog liked the treat dispenser and a nice feature is you can choose how many and how often a treat is dispensed.  I also like the sharing feature so our family can all install the Petcube app on our smartphone and see our dog in real time, communicate with him and give him treats!  My sons are in college so it's nice that they can see him anytime.  I just installed the Petcube so I still have to study the other features but overall, it serves its purpose."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ruth",
          "Nb_Reviews": 6,
          "Date": "2017-12-27T00:03:52.000Z",
          "Titre": "Must have for pet parents!",
          "Contenu": "Support is excellent. Sales is excellent. Product is great!! Some software issues with catching daily activities but still a worthwhile product. I think I now have 6 cubes!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna",
          "Nb_Reviews": 1,
          "Date": "2018-08-03T20:17:04.000Z",
          "Titre": "Would Recommend",
          "Contenu": "I am giving this camera 4/5 stars.I got this camera to keep an eye on my cocker spaniel while I wasn't at home. I received the package very quickly and got it set up very easily as well. The image quality is surprisingly good. I am planning to purchase another one for the bedroom (this one is in the living room). I am reading on other reviews the set up to connect multiple cameras is fairly simple and easy, as well.The laser feature is very fun and I have not had any major issues with it yet. It is a little laggy, but it's not a big deal for me. My little guy has a lot of fun with it! The two way audio is also very fun. Rooney was a little bit freaked out by it at first, but he's picked up on it being my voice and will listen through the device when I tell him off the couch!!Would definitely recommend this product to anyone."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "xbox_widow",
          "Nb_Reviews": 11,
          "Date": "2018-02-28T18:37:23.000Z",
          "Titre": "Slight hiccup well dealt with",
          "Contenu": "I had to contact the customer service team via the ‘chat’ option & they were very quick to solve my missing delivery.Ordering was easy & i’m now very happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Spooky",
          "Nb_Reviews": 1,
          "Date": "2017-11-21T22:37:07.000Z",
          "Titre": "Great camera",
          "Contenu": "I really like to be able to watch my cat when I am at work.Downside:Night vision camera not always kicks inTreat not always come outOverall great tool"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lexi Ives",
          "Nb_Reviews": 2,
          "Date": "2018-05-09T14:16:29.000Z",
          "Titre": "This is an awesome product! My kitten loves it",
          "Contenu": "This is an awesome product! I love being able to check in on my kitten while I'm gone at work during the day, especially given the fact that when my roommate is gone he is by himself. As soon as he hears the noise the camera makes when it drops treats to be launched, he comes running. One issue I've had is that because his kitten treats are so small, the Petcube typically shoots out 7 or 8 treats at once, while I would prefer less at a time so I would feel better about giving them to him several times throughout the day. I doubt this would happen with dog treats since they tend to be a little bigger. I also have had some minor connectivity issues, but this may be primarily related to my WiFi connection rather than the Petcube itself. Overall, I really like it and have enjoyed playing with my cat while I'm away from home. I would definitely recommend it to friends with pets, especially dog owners."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John  H.",
          "Nb_Reviews": 4,
          "Date": "2022-03-19T15:17:44.000Z",
          "Titre": "easy  set up",
          "Contenu": "easy  set up. the only issue I've had is that it only shoots the treats out about foot from the Petcube."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jian Hu",
          "Nb_Reviews": 1,
          "Date": "2018-06-18T21:05:31.000Z",
          "Titre": "Giving this product a solid 4 stars",
          "Contenu": "Giving this product a solid 4 stars! Setup was easy, camera is great, but the app is super clunky. Fix that and I would give this a 5."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dianne Colón",
          "Nb_Reviews": 1,
          "Date": "2018-02-23T19:34:35.000Z",
          "Titre": "Really Liked this Product",
          "Contenu": "you.The quality of video is very good and the night vision works well; although we do leave a light on when we leave him at night. What I do suggest is that you do have to have a good Internet connection for this to work well. The Petcube Play, laser cam has a red laser light integrated in it that my dog loves to play with when we are at home. Personally, I would never turn it on when I’m away. Also, the voice feature works well, you can hear the dog and they can hear you like you are in the room with them, but we won’t ever use it (unless it is necessary) because we think it might make him edgy to hear us and not see us.The only thing I don’t like, is that there is no Off and On button, at least I have not found it. Also, that it doesn’t come with a stand to place on the floor or to the edge of a table was a negative for us. Other than that, it is very user friendly and we have already recommended it to other pet parents (you can also use it as a normal “spy” camera, not only for pets *wink wink* lol)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2018-02-19T20:01:33.000Z",
          "Titre": "Pretty great product!",
          "Contenu": "I've really loved the petcube bites so far but have experienced a few regular hiccups.  The image is usually pretty clear (love the \"at night\" mode!) and I'm able to talk through the device which has been helpful for managing my pet's behavior.  I love being able to \"share\" the camera with friends and family who want to see my dog and the noise and sound alerts have been great. The treat dispenser has been reliable up until this last week- it hasn't been dispensing and I haven't quite been able to figure out the problem.  My biggest concern with the camera is that it frequently tells me \"busy\" and that I need to wait 90 seconds when no one is using the camera except me.  I've tried a few different things (waiting for it to load, quitting the program, etc.) but this problem still seems to randomly persist at least 3 times per day.  I would still recommend Petcube Bites to anyone looking to monitor their pet but you may experience some technical difficulties along the way."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lwyn",
          "Nb_Reviews": 2,
          "Date": "2018-05-18T17:45:04.000Z",
          "Titre": "this thing is great thanks it should…",
          "Contenu": "this thing is great thanks it should come with a mount automatically. I bought the mount and it now it is perfect!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 2,
          "Date": "2017-12-26T14:42:52.000Z",
          "Titre": "Petcube is fun to use and watch the …",
          "Contenu": "Petcube is fun to use and watch the pets. It is a bit cliche may be the internet connection. But I still love it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "melissa durand",
          "Nb_Reviews": 1,
          "Date": "2018-01-24T15:25:07.000Z",
          "Titre": "Love that I can check in on my kitties …",
          "Contenu": "Love that I can check in on my kitties when I'm away.  I wish the laser function was smoother - very jumpy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Olive",
          "Nb_Reviews": 2,
          "Date": "2021-10-28T06:34:09.000Z",
          "Titre": "Love the product",
          "Contenu": "Love the product. Nice option to check on your pet. Customer service is rather slow though.("
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kimberly Potvin",
          "Nb_Reviews": 1,
          "Date": "2018-04-29T03:53:11.000Z",
          "Titre": "Petcube: So far so good!",
          "Contenu": "I ordered my Petcube a few weeks ago, and so far, am truly pleased with my purchase. The cube itself is small, compact and easy to place on a lower level shelf or the floor. I put mine on the bottom tier of a bookshelf and have a great view of the entire living room. The Petcube has a long power cord which is super helpful for those who have older apartments where outlets can be a bit scarce. In addition, the device was relatively easy to set up and log into, so I was up and running in no time.Since hooking up the Petcube, I have taken time throughout my day to check in on my cats. It is fairly entertaining to see what they are up to, but in addition, it is nice to know that they are safe and nothing bad has gone down while I am at work.My only point of concern with the purchase is that there is no ability to turn the Petcube on or off. Ideally, the app would have a \"at home\" feature which would turn off the video feed but that is not the case. So, if you are worried about personal privacy, the only way to turn off the cube is to physically unplug the device. Other than that hassle, the Petcube has been a great addition to my kitty care routine!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rodney",
          "Nb_Reviews": 4,
          "Date": "2018-10-04T15:19:04.000Z",
          "Titre": "Extremely good!",
          "Contenu": "Petcube has been an excellent purchase! A lot of fun you can have when spending time with your pet."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Mr Hardy",
          "Nb_Reviews": 2,
          "Date": "2018-03-20T11:13:19.000Z",
          "Titre": "Great fun for crazy cat parents!",
          "Contenu": "We have a very naughty, clever Bengal who loves nothing more than treats and I've always wanted to know what he gets up to when we aren't here (other than terrorising his brother, that's obvious because of the clumps of fur around the house)This device comes in a really cool box, super easy instructions and set up. I would 100% recommend this product only if you can attach it to a wall (screws and a easy measuring guide provided) because after the first treats came flying out our cat tried to eat the pet cube, attack the pet cube and then sat there and tried to get his paw up in the hole to knock out treats so needless to say it was on its back in 30 seconds post treat giving.The camera on it is great fun, good quality, a really wide angle and starts recording when it senses the cats. The app and pet cube paired easily, the flashing lights indicate different things so is easy to know when it's recording. You can only pair one device but share with family and they can then view the camera too and feed treats if they fancy. I personally liked this but might be worth briefing them not to over feed! Some reviews have mentioned you can’t turn it off but if you don’t want anyone to view it just in plug it or don’t allow them access to the camera!My cat is so intrigued by it. He goes nuts when he hears our voice through the speaker, its loud enough that he can hear it from other rooms. He will sit and stare at it for hours hoping more treats will fly out (the distance you can get on the treats is hilarious!) The price seems a little expensive but for piece of mind that your pets are ok and the fact it can basically double as a security camera as it has night mode, makes it worth the money!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Palmer",
          "Nb_Reviews": 1,
          "Date": "2018-05-21T19:57:16.000Z",
          "Titre": "It’s nice to check in on kids and…",
          "Contenu": "It’s nice to check in on kids and doubles as security"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "jami-dawn Jesso",
          "Nb_Reviews": 2,
          "Date": "2021-10-21T14:03:02.000Z",
          "Titre": "Simplicity!",
          "Contenu": "Super fast shipping, easy set up, easy app!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jonette miller",
          "Nb_Reviews": 2,
          "Date": "2019-04-11T03:27:47.000Z",
          "Titre": "No regrets",
          "Contenu": "Inconsistent but I'm happy I got it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan K",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T20:54:47.000Z",
          "Titre": "Great little camera",
          "Contenu": "I purchased the cube to watch & talk to my pets while I'm away from the home.I have noticed the cats have been wanting to spend more time in the room where I have the cube."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lindsay",
          "Nb_Reviews": 6,
          "Date": "2023-12-01T13:09:59.000Z",
          "Titre": "Great camera, excellent customer service",
          "Contenu": "This is a great little camera for watching my cats. With two way audio I can talk to and hear my pets when out and keep an eye on what they are doing! Compared to many other products, this camera was very affordable, and the monthly service premium is under a fiver per month. It is optional, but I have found the customer service very good indeed on the rare occasion I’ve had technical issues. Very prompt replies and they will keep working the problem until solved. I would highly recommend PetCube and its service. 5*"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Judith",
          "Nb_Reviews": 12,
          "Date": "2023-12-12T00:40:48.000Z",
          "Titre": "Very prompt response",
          "Contenu": "Very prompt response & problem fixed immediately - we love Petcube"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ryan Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T08:26:26.000Z",
          "Titre": "Good technical support",
          "Contenu": "My wife's phone was having problems connecting to the Petcube. Technical support went back and forth a few times to help us identify the issue and solve the problem. Very happy with the support and friendliness of the team"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Oksana",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:47:50.000Z",
          "Titre": "An amazing product and outstanding…",
          "Contenu": "An amazing product and outstanding customer service! The camera design is very stylish. The quality of the video is very good. At first, I was upset thinking that only one device could be connected to the camera, and I wrote a review about it. To my surprise, Petcube support responded within an hour with a step-by-step instruction on how to address my issue. Now that the issue has been fixed, I am very happy with this great product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda C.",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T23:36:12.000Z",
          "Titre": "I love Petcube",
          "Contenu": "I love Petcube, I've used one of their products for years. The device itself works great, I always rely on it when I'm traveling to check in on my pet. And their customer service representatives are knowledgeable, quick, and helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Beasley",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T02:04:43.000Z",
          "Titre": "Petcube is amazing",
          "Contenu": "Petcube is amazing! It gives me ease of mind being able to check on my animals when I can't be home with them. Due to my health I have been in the hospital a lot recently, so being able to turn on the camera and see and talk to them has really helped."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Teri",
          "Nb_Reviews": 5,
          "Date": "2023-10-12T08:10:14.000Z",
          "Titre": "GREAT CAMERA AND TREATS IS SO FUN!",
          "Contenu": "We love our PetCube and have so much fun with our Berniedoodle popping out the treats. He loves it, the camera is clear and seeing our pup while we are away from the house is a huge plus!!! Talking to him is just the best! We would highly recommend it for all pet owners out there! You won't be disappointed."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tylah Parnis",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T10:28:20.000Z",
          "Titre": "Excellent help and speedy responses!",
          "Contenu": "Any questions and queries are answers super efficiently and with great help! I was having issues with my app to see my fur babies and they very speedily helped me and sorted the issue very quickly!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Joanne",
          "Nb_Reviews": 7,
          "Date": "2023-04-13T18:06:56.000Z",
          "Titre": "Very easy to set up and very clear…",
          "Contenu": "Very easy to set up and very clear video. I can keep an eye on my mischievous puppy and catch her before the bad act occures, like counter scavaging, or chasing the cats. Big puppies can cause mayhem. Best to nip it in the bud. These cameras help enormously. I just wish I could connect them to my home security camera system."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny",
          "Nb_Reviews": 2,
          "Date": "2023-02-06T08:18:36.000Z",
          "Titre": "An excellent product. Gives me peace of mind when I leave my dog home.",
          "Contenu": "I have been using the Petcube Play for several years with good resolution and clarity and ease of operation. The viewing angle is wide so I can see a lot of the room. A couple of weeks ago, however,  I had difficulty connecting despite several tries. I contacted your customer service and they patiently walked me through several scenarios until we were able to solve the problem. They were easy to reach and spent all the time I needed without trying to rush me. I was very impressed. To me, customer service is a very important part of any product."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Miss Corina Kar",
          "Nb_Reviews": 4,
          "Date": "2023-04-10T10:19:34.000Z",
          "Titre": "The petcube is a great product",
          "Contenu": "The petcube is a great product, easy to set up, easy to connect to new wifi. The image is clear and no more to pay if you don't want extras. Customer service was quick to respond and follow up although itcwas an issue with my WiFi not the cube! Have recommended to friend's and family especially as on offer now £39 this easter."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Annette Lehmann",
          "Nb_Reviews": 7,
          "Date": "2022-11-14T08:37:20.000Z",
          "Titre": "Fantastic customer service!",
          "Contenu": "Fantastic customer service!Very helpful with the support the company (Petcube) gave me. My issue was resolved pretty quickly and my Petcube is running beautifully and my babies can now hear me. Thank you so much to all the people that dealt with me. Yes most definitely will be looking into getting another one for my house that will feed my babies too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele B.",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T07:07:59.000Z",
          "Titre": "Excellent Customer Service…",
          "Contenu": "I had problems with a \"trusted certificate\" system error when trying to log on to the app in order to set up the device. I contacted Customer Support through the website with no response, so I emailed them directly.  We had several back and forth emails in an attempt to determine the problem and then how to correct the issue. We finally got it to work! I'm so excited to set up the camera/ treat dispenser! I can't say how pleased and grateful I am for the help of the Support team.  It took a few of them to find the right solution.  Their persistence and professionalism were top notch."
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Oona Pohjalainen",
          "Nb_Reviews": 3,
          "Date": "2023-02-06T17:29:29.000Z",
          "Titre": "Perfect camera for easy pet monitoring",
          "Contenu": "Camera was really easy to set up and the video quality has been good - not lagging. Customer service is exceptional and super quick to help with any technical issues!Only minus would be that the camera is not chordless and only way to turn the camera off is by unplugging it. Also, wish that you wouldn’t have to subscribe to monthly payments if you want the camera to download videos or save recordings when it detects movement or noise. Regardless of this, the camera for me was a big update from my previous pet monitor."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jenna Smith",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T23:45:06.000Z",
          "Titre": "Amazing support!",
          "Contenu": "The customer service/support for this company is amazing. I was having a number of connectivity issues with my Pet Cam, and needed to connect with them each day for roughly three days. Each time I connected with someone in very quickly, they were patient, kind and very knowledgeable, and got my issue resolved. I even lost connection with them during one of the interactions and they emailed me to follow up with next steps/instructions. Really great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Padilla",
          "Nb_Reviews": 1,
          "Date": "2022-04-23T04:03:34.394Z",
          "Titre": "Awesome company!",
          "Contenu": "I got my petcube and was super excited. It works great! Can keep an eye on my pup and toss him treats! Had a problem with android phone not working with microphone over mobile data but they are on top of fixing it already and added to investigation list company went above and beyond and helped refund my money so I can purchase the better unit in the meantime. Excellent customer service! Thankyou again guys!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kate",
          "Nb_Reviews": 5,
          "Date": "2022-08-01T02:15:37.000Z",
          "Titre": "Excellent Customer Service",
          "Contenu": "I contacted Petcube on a Saturday morning (Australia) and I had a response within the hour. After a few more back and forth emails they fixed my issue immediately. Would not hesitate to contact them again. They were friendly, courteous and very helpful in explaining. Thank you so much. I can now enjoy watching and hearing my 2 dachshunds whilst Im out.🌟"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Arielle Chopyk",
          "Nb_Reviews": 1,
          "Date": "2022-12-16T17:59:23.000Z",
          "Titre": "Best Pet Camera Purchase I Made",
          "Contenu": "I love using my PetCube to check on my little guy when I'm not around. The image quality is great, even during the night. I also appreciate that I can save videos when he does something adorable. I recently upgraded my plan and got the Petcube Bites. I can't wait to set it up and use it. I will be recommending petcube to anyone looking for a reliable and good quality pet camera!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kay Lee",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T12:34:44.000Z",
          "Titre": "Lucky and I are able to communicat…",
          "Contenu": "Lucky and I are able to communicate every minute of the day. This system allows me to watch him eat, play, and rest, I don’t have to worry about him, I’m able to concentrate on my work. I have ordered twice and both times the shipping has been fast and efficient. The app and cameras work great and are easy to set up. I’m very happy with my purchases and have recommended this extra “peace of mind” to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sindy M",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T00:57:57.000Z",
          "Titre": "Pet cube source of joy",
          "Contenu": "We absolutely love our Pet cube so much!  During the pandemic our fur babies got used to having us all the time and so did we. We missed and worried for them when we got back out but pet cube has provided such a relief when we can not only see them but even interact with them. This little device has become a source of joy for them as well as for us. Plus! The company itself is awesome! They have integrity and their customer service is real, not just an automated prescripted representative. I've Highly recommended them to all our friends with pets and also to you."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Clara Tan",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T04:52:39.000Z",
          "Titre": "I have used Petcube since kickstarting…",
          "Contenu": "I have used Petcube since kickstarting it and have loved the products themselves. The customer service team just makes the whole experience the best. Any time I have any issues or misunderstanding on how best to use the product, they are quick to respond with solutions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabby M",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T14:51:31.000Z",
          "Titre": "The PetCube team is super attentive and…",
          "Contenu": "The PetCube team is super attentive and responsive. I did a chat with representative through the app, it had disconnected a couple times. Even though the chat disconnected the staff member still contacted me via email and checked back with me which is how I was able to get the best help and customer experience from them. They helped me everyday, every step of the way all via email. Giving perfect prompt instructions on how to fix my problem."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Jana Badurova",
          "Nb_Reviews": 2,
          "Date": "2022-12-24T22:26:42.000Z",
          "Titre": "I have 2 different petcubes",
          "Contenu": "I have 2 different petcubes - i enjoy both of them.One video stopped working and I've contacted the petcube team and they responded unbelievably quickly (especially now, during the festive season!). Offered a range of solutions, but luckily the problem resolved by itself.Considering getting a 3rd one :)It's actually quite a good security camera too given it has motion & sound detection."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Liz",
          "Nb_Reviews": 7,
          "Date": "2022-04-18T14:11:56.000Z",
          "Titre": "Petcube customer service excellent.",
          "Contenu": "Had an issue with a new faulty Petcube. Camera contacted customer service who were outstanding, they were prompt at replying and looking to see if they could pinpoint the issue and although they were not able to solve the problem which was a faulty camera. (The problem was solved by the supplier replacing the camera.) They were then quick and prompt to move my subscription to a new camera even though it was on Easter Sunday."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Charles Malo",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T08:02:09.000Z",
          "Titre": "Had  a problem with network not connecting to pet cube play",
          "Contenu": "Had  a problem with network not connecting after a house move. Support team (shout-out to Maria) gave me a consize and to-the-point checklist to test and had my problem fully resolved within 2 hours of my inquiry request."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Giancola",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T15:12:58.000Z",
          "Titre": "Top notch score for customer service",
          "Contenu": "Top notch score for customer service. Very quick to reply and they initiated follow up when they were missing a response from me."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Miss Ruth-ann Hubbucks",
          "Nb_Reviews": 2,
          "Date": "2022-09-08T13:54:03.000Z",
          "Titre": "Good product, great support",
          "Contenu": "So far the product seems good, we had a few issued with the connection when out of the house but the support team have been almost immediately available to help and have resolved the issues really well. Im honestly gobsmacked to get such good support on a £50 gadget!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dog lover",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T00:06:35.000Z",
          "Titre": "Very worth it!",
          "Contenu": "I love my pet cube! It arrived quickly, had minimal packaging that was primarily recyclable, was extremely easy to set-up and it works exactly as advertised, every time. Consistent and reliable. I love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Dowd",
          "Nb_Reviews": 1,
          "Date": "2022-04-19T17:08:16.262Z",
          "Titre": "Petcube replaced my faulty camera",
          "Contenu": "Petcube replaced my faulty camera. I appreciate they made the situation right. There were several back and forth emails first in which I was asked the same questions multiple times. However, the response to my intial email to support was super fast."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Daven Moldrich",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T08:50:51.000Z",
          "Titre": "Our camera went offline",
          "Contenu": "Our camera went offline and despite trying a number of different things, I contacted Jay via the on line service. He managed me via a number of questions and then advised on a more detailed approach to my problem. As a result, the issue was rectified and our pet camera is now back on line. Great service guys!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Paola Rickard",
          "Nb_Reviews": 3,
          "Date": "2023-03-30T02:29:38.000Z",
          "Titre": "There was an issue with the audio…",
          "Contenu": "There was an issue with the audio feature when the camera was accessed remotely. However, the Petcube team addressed and rectified the matter very promptly and efficiently. The Petcube now works perfectly."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Elise",
          "Nb_Reviews": 1,
          "Date": "2022-05-16T10:16:06.000Z",
          "Titre": "Great customer service",
          "Contenu": "I've had the Petcube Play for 5 years now and it still works well and I'm very happy with it. I've been in touch with the customer service a few times over the years and they always reply fast and continue to give new suggestions to try until the problem is solved so I'm very satisfied"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Marijke",
          "Nb_Reviews": 3,
          "Date": "2023-02-07T19:46:41.000Z",
          "Titre": "I had issues with keeping the settings in the app for Petcube camera",
          "Contenu": "If you have issues with your device you can easily contact the Customer Care departement. They will contact you rapidly and are very helpful. A firmware update was placed on my Petcube camera and now the app reminds the settings as how I want them to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MAK",
          "Nb_Reviews": 3,
          "Date": "2022-10-25T19:54:38.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use! I can look in on my babies anytime of day and watch video of the previous nights antics! It also doubles as passive surveillance because it is motion activated and stores activity for three days. Oh and it is a two way radio too! I can communicate with the household and I can hear what they say back (or meow back)!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tia carter",
          "Nb_Reviews": 4,
          "Date": "2022-10-09T21:35:33.000Z",
          "Titre": "This is the best thing I have bought!!!",
          "Contenu": "This is the best thing I have bought in a long long time, absolutely love being able to see my fur babies when I am at work, I bought the petcube bites, love that I can talk to my cats through the camera and give them treats. I have got my family to download the app so they can also see my animals, I would definitely recommend this camera."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Maxwell",
          "Nb_Reviews": 1,
          "Date": "2022-05-22T02:38:58.000Z",
          "Titre": "Great customer service!",
          "Contenu": "Petcube has stepped up their responsiveness to another level. I thought I had broken my Petcube when I cleaned it and got moisture into the camera. But they were able to help me reset the device and it's working like new. They were very responsive and helpful throughout!"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "Petcube user",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T15:12:21.000Z",
          "Titre": "Responsive customer service",
          "Contenu": "Petcube’s customer service was very responsive. They were able to resolve the issues I experienced (free 4 hour video recordings disappearance) within a span of 8 hours (due to time differences)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patti",
          "Nb_Reviews": 5,
          "Date": "2022-09-27T16:11:54.000Z",
          "Titre": "I contacted Petcube about adding…",
          "Contenu": "I contacted Petcube about adding another camera to my plan. I did a live chat and interacted with Adrian. He was very professional, knowledgeable and kind. He answered all my questions and made sure my system was working properly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ross Schlecht",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T19:42:51.000Z",
          "Titre": "Great company and quality product",
          "Contenu": "Great company and quality product. Needed a replacement for the petcam when the first one didn't work and customer service promptly sent me a new one which ended up working great."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Art M I",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T07:01:20.000Z",
          "Titre": "Simplicity at its best",
          "Contenu": "Simplicity at its best. Easy to setup and configure. Pet camera and security camera in one. Excellent value for money. Tech support is very prompt and helpful.I highly recommend this camera to anyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany Senger",
          "Nb_Reviews": 1,
          "Date": "2022-06-10T03:56:23.000Z",
          "Titre": "Excellent customer support!",
          "Contenu": "My dogs are afraid of the alert sound on the PetCube when we connect! They would hide or growl. When I finally asked, Mark S understood exactly what I meant and walked me through turning it off. Excellent customer service! I've had my PetCube for probably 5 years and thrilled with using chat support for the first time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia Palamar",
          "Nb_Reviews": 3,
          "Date": "2022-08-15T18:30:11.000Z",
          "Titre": "Thanks you, Maria!",
          "Contenu": "I want to thank Maria from customer service for her tremendous help. And I’m changing my original rating of 1 star ⭐️ to 5 ⭐️ ⭐️ ⭐️ ⭐️ ⭐️!  We had a litttrouble connecting but once we did, she took care of my problems very quickly. In fact PetCube replaced two of my three cameras. They are up and running!  Thank you Maria and PetCube!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam Glandt",
          "Nb_Reviews": 1,
          "Date": "2022-04-18T19:34:51.000Z",
          "Titre": "I wanted to shout out to Adrian B for…",
          "Contenu": "I wanted to shout out to Adrian B for an incredible customer service experience. I had a very complicated situation trying to confirm that I canceled my account and was requesting a refund for months of not using my Petcube.   Adrian spent about 45 minutes looking up every possible way to confirm my account was canceled and that I would be refunded for my subscription that was not used. I am pretty sure that most would have given up after the first 15-20 minutes of a frustrating situation. I am extremely grateful for Adrian’s kindness and patience!Also my petcube helped me find my lost cat and I am very happy for that and feel it is a very useful device."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Welsh",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T15:48:01.000Z",
          "Titre": "Pet Cube\"s PetCam has meet all our…",
          "Contenu": "Pet Cube\"s PetCam has meet all our needs. We feel so much more relieved when leaving the house that our pet is safe and we can check in regularly. The features are easy to use and provide excellent video/audio results."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Rowley",
          "Nb_Reviews": 3,
          "Date": "2023-02-10T16:41:45.000Z",
          "Titre": "We have the Petcube Cam",
          "Contenu": "We have the Petcube Cam.  Works well for remote viewing of a room and pet.  Reported an improvement to the device settings that was quickly implemented in a firmware update.  Good product and service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Reynolds",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T05:28:53.000Z",
          "Titre": "I love my Pet Cube Camera",
          "Contenu": "I love my Pet Cube Camera. I actually use it to monitor my Dad, who has some Dementia.  I can’t be with him all the time, so I keep mine in his kitchen, so I can make sure he is eating and taking his daily pills. It has been a great help. Picture is clear, and so is the sound. Customer Service was quick to respond and very helpful when I couldn’t figure out how to download the videos. My friend uses this to watch her animals when she has to work long days, and when I saw how well hers worked, I thought I would try it for this. I definitely recommend this product!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lorrelle M",
          "Nb_Reviews": 1,
          "Date": "2023-01-23T12:26:34.000Z",
          "Titre": "Fantastic service",
          "Contenu": "Fantastic service! The Petcube team got my camera working again so I’ll be able to see what my cat does all day tomorrow. Excellent, prompt and friendly service. I can’t recommend Petcube and the team highly enough, thank you 😊"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Katie McAllister",
          "Nb_Reviews": 2,
          "Date": "2022-04-27T16:53:16.065Z",
          "Titre": "I really enjoyed using my Petcube",
          "Contenu": "I really enjoyed using my Petcube. I did have to stop using it but only because I got a roommate and a camera was no longer wanted. Customer care was amazing, extremely quick and took care of my needs with zero hassle. I will happily return when I don’t have a roommate anymore."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "NATALIE ALLISON",
          "Nb_Reviews": 9,
          "Date": "2022-06-27T03:57:19.000Z",
          "Titre": "Petcube support",
          "Contenu": "I had a different pet camera before and it never seemed to work. I am pretty impressed so far with this one and the screen view and quality is awesome.I had a problem setting it up, but it was just me being a little incompetent and the support was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beneria",
          "Nb_Reviews": 3,
          "Date": "2022-05-05T15:58:51.000Z",
          "Titre": "Best Customer Service To Date!",
          "Contenu": "I totally wasted their time but Adrian B was so sweet and patient with me! One of my cameras was appearing offline but during the course of troubleshooting it came back on! I'm totally going to request Adrian B anytime I have an issue, that was one of the best customer service experiences ever!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Ana Carolina Castro",
          "Nb_Reviews": 6,
          "Date": "2022-08-21T11:25:19.000Z",
          "Titre": "Great camera.",
          "Contenu": "So I have the first kickstarted model, and it has been a few years and it still works very well. The laser pointer is a little hard to manuver but it does it's work. The night vision is perfect. And seeing the recordings is very fun.I recently had an issue and customer support was amazing.I totally recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tiffany Wright",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T15:35:46.000Z",
          "Titre": "Love our Petcube but kept saying it was \"off-line\"",
          "Contenu": "We love our Petcube and all of a sudden it kept saying it was \"off-line\" so we weren't able to check on our puppy. ☹️ I contacted support and James was super nice and helped me get it back on-line by deleting it off the app and did the start up again and now it works perfect!! Thanks for your help!! Love being able to check on my baby boy when we're not home."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Terri-Lynn Machen Stewart",
          "Nb_Reviews": 3,
          "Date": "2023-08-10T18:54:05.000Z",
          "Titre": "Petcube awesome I have many devices to…",
          "Contenu": "Petcube awesome I have many devices to keep eyes on my Critters crew love the notification and treat throwing everything about devices and services are awesome way better than any other ones out there well worth it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raina Lao",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T04:33:28.000Z",
          "Titre": "Great Chat Service!",
          "Contenu": "The chat service had very fast replies and the agents were very helpful. Also, what was added to the experience, was if the chat service disconnected they would email you to make sure if further help was needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TreatsnSnacks",
          "Nb_Reviews": 1,
          "Date": "2022-05-21T22:25:13.000Z",
          "Titre": "Excellent support!",
          "Contenu": "I contacted support about 2 concerns i had with my petcube. At first i thought it was a tech issue because i knew i had paid, but they very quickly saw that my petcube on my app was in sleep mode. I really appreciated that they were able to figure out the problem so quickly! They were also able to help me figure out billing and managing of both my petcubes, and cleared up a lot of confusion for me. I really appreciated the quick answers, and everything was very clear and easy for me to understand. Thank you so much Alnie! :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Theresa houle",
          "Nb_Reviews": 2,
          "Date": "2022-08-13T17:55:49.000Z",
          "Titre": "I have been using Petcube for 8 months…",
          "Contenu": "I have been using Petcube for 8 months now and I really enjoy going out and still be able to check on my fur baby’s. But I came to an issue with my cam and contacted the company asap and had some pointer on how to try and fix the issue but at the end my cam was not working anymore. So the company was nice enough with the proof of my purchase that they sent me a new cam so I can continue to enjoying watching my baby’s while being away. This is the best product I ever got and will be highly recommending my family and friends that.has pet to purchase one of these pet cam. Thank you so much to the company for all you have done to help with my issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "lizzie tripp",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T04:29:23.000Z",
          "Titre": "My Petcube wouldn’t connect",
          "Contenu": "My Petcube wouldn’t connect, it had a constant yellow light. I emailed support and got almost immediate assistance. After answering some questions, they troubleshooted my camera and it’s working very well. Great experience with the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicolena Barbieri",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T18:13:41.000Z",
          "Titre": "The cube is really nice",
          "Contenu": "The cube is really nice. The size fits anywhere, the picture is clear.My only problem is that is not very loud. While testing it out, I could barley hear my daughter calling the cat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tracy Chamblee",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T18:23:48.000Z",
          "Titre": "Customer Service and response to email…",
          "Contenu": "Customer Service and response to email and issues was very prompt and effective. I am very happy that my problem was so quickly resolved, enabling me to use my petcube camera and app again. Thank you petcube team!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erica H",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T16:28:52.000Z",
          "Titre": "I love how I can check in on my pets…",
          "Contenu": "I love how I can check in on my pets with these cameras. They were a little hard to set up originally but relatively easy to use. I wish they did not have the wires but they are so helpful."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Danielle Anthony",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T03:16:24.000Z",
          "Titre": "I was unable to view my camera on my…",
          "Contenu": "I was unable to view my camera on my iPhone after an update and the staff at Petcube were very helpful in trouble shooting the problem. A few emails later and they were able to get me back online. Excellent customer service."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Karen R",
          "Nb_Reviews": 5,
          "Date": "2022-12-12T09:22:30.000Z",
          "Titre": "Love my Petcube as I can watch my dogs when I’m out",
          "Contenu": "Very happy with my Petcube camera which I bought from JB HiFi. I had a challenge with an echo when using the two way voice which the support team were very helpful in resolving (it was user error). Highly recommend this product."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andrea CP",
          "Nb_Reviews": 1,
          "Date": "2022-05-20T16:28:06.000Z",
          "Titre": "Excellent customer support !",
          "Contenu": "Excellent customer support !I encountered a few little problems with my pet cubes and they guided me through it step by step and answered quickly to all of my questions, always with care and respect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill McCafferty",
          "Nb_Reviews": 2,
          "Date": "2022-09-12T15:15:56.000Z",
          "Titre": "Love our Petcube to check on our Fur…",
          "Contenu": "Love our Petcube to check on our Fur baby when we're gone. We hadn't used it in a while so had unplugged it. When I went to use it again I couldn't get in online. I emailed customer support and they got back to me immediately and we emailed back and forth a few times until we figured out the issue. They were great to work with, I highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ian Lamb",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T00:09:44.000Z",
          "Titre": "Petcube go the Extra Mile  The people at petcube have been…",
          "Contenu": "The people at petcube have been outstanding in their efforts to ensure my issue was resolved. They were able to make an adjustment at their end to rectify the anomaly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katelyn Ackerman",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T03:08:39.000Z",
          "Titre": "Quick, easy fix, wonderful support assistance!",
          "Contenu": "I have been neglecting to try to fix our Petcube because I assumed it would be a huge struggle, but with the help of the support Yulia, I had it up and running in less than ten minutes!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Louise",
          "Nb_Reviews": 3,
          "Date": "2023-05-28T03:45:04.000Z",
          "Titre": "Love my Petcube",
          "Contenu": "Love my Petcube. When I had a recent tech question the team were super responsive and helpful and followed up to ensure all was fine. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roseanna Toth",
          "Nb_Reviews": 2,
          "Date": "2022-06-07T16:04:47.000Z",
          "Titre": "pet cube play",
          "Contenu": "Love our pet cube play, it's always nice to be able to check in on our fur kids when we are away and be able to give them some* activity as well.  Customer service was nice, prompt and helpful too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Barker",
          "Nb_Reviews": 1,
          "Date": "2022-04-30T01:24:15.000Z",
          "Titre": "This is my third pet cube",
          "Contenu": "This is my third pet cube. The company fully refunded my second that stopped working and I got two more. Always helpful if something doesn't work and will get you a resolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miek",
          "Nb_Reviews": 5,
          "Date": "2022-06-21T05:44:13.000Z",
          "Titre": "Very nice product gives 110%",
          "Contenu": "This is a really nice product. I have two different models and they work great. Customer service is 110% for even the oldest unit. (especially Alnie) I would buy another my cats LOVE it and my dogs are BUSTED! Now I know which one \"did the crime\" so I can ensure the right one does the time. (just kidding). Thanks folks, good stuff"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marla Rae Savage Fruhling",
          "Nb_Reviews": 1,
          "Date": "2022-04-28T19:31:17.039Z",
          "Titre": "Quick service.",
          "Contenu": "Yenny was very knowledgeable and helpful. I know my fair share of tech, but was stumped when I couldn't get the camera working. Yenny helped me to get it back online and gave me a solution to prevent it from happening again in the future. Super helpful and quick service. I love petcube! Thanks guys!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lynn",
          "Nb_Reviews": 5,
          "Date": "2023-03-03T11:52:26.000Z",
          "Titre": "fixed it!!",
          "Contenu": "Well what can I say, I needed help as my pet cam stopped working I did the usual things load/ unload app, turn off turn on camera and nothing. So I sent a HELP ME  e mail!! With in minutes my problem was fixed couldn't believe it. HAPPY DAYS, and I don't like technology, but I got through it.  Amen....."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sharon",
          "Nb_Reviews": 6,
          "Date": "2022-10-19T16:12:05.000Z",
          "Titre": "Very helpful when my petcube wasn't…",
          "Contenu": "Very helpful when my petcube wasn't working as it should emailed me instructions on what to do so now working fine with the help off petcube Happy with the camera"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rob Crickmore",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T01:09:53.000Z",
          "Titre": "Works great",
          "Contenu": "Works great. My dogs are genuinely interested in it and I like that I can hang it on a wall. One feature request would be to have a sound effects button to play nosies for our dogs. You can talk and hear them but I would love to see a sound button or even play a recorded command with the owners voice."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "James Farnhill",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T18:28:35.000Z",
          "Titre": "Great tech and service",
          "Contenu": "The Petcube tech is great (I have 4 cameras to monitor my 2 dogs throughout my apartment), and the support are very helpful.  I was having problems receiving notifications via the app, the team were great in helping me troubleshoot and get everything working correctly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy P",
          "Nb_Reviews": 4,
          "Date": "2022-05-14T01:28:00.000Z",
          "Titre": "Technical Difficulties….",
          "Contenu": "We were experiencing an issue with being able to speak and listen simultaneously. I sent a email, the staff immediately replied and within 3 or 4 emails the problem was resolved. Thank you for the great customer service and for being on it!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosa",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T06:49:20.000Z",
          "Titre": "The person who helped me did a…",
          "Contenu": "The person who helped me did a fantastic job and was very understanding. They reacted quickly to my problem and came up with a resolution in minutes. Very proud to be apart of the Petcube family! P.S. Petcube if you’re reading this, give Mark a raise!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T00:05:30.000Z",
          "Titre": "I needed to cancel our monitoring…",
          "Contenu": "I needed to cancel our monitoring account because we no longer had a petcube. Our acct was cancelled and we were credited for 5 months!!  Wow!!!  Great experience!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ale",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T22:32:40.000Z",
          "Titre": "Yenny was so patient and knowledgable!",
          "Contenu": "Yenny was so patient and knowledgable! She walked me through different troubleshoot methods until we found the solution! Love this company and my Petcube Bites <3"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jima Tofu",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T03:11:31.000Z",
          "Titre": "Great product!",
          "Contenu": "User friendly, easy set up and I would like to shout out to their support group which are fantastic and very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Linda Grant",
          "Nb_Reviews": 11,
          "Date": "2023-02-20T12:17:13.000Z",
          "Titre": "Excellent product",
          "Contenu": "Excellent product. Had a wee issue with the app, emailed customer services and it was rectified in less than 30 minutes. Superb service."
        },
        {
          "Note": 5,
          "Lieu": "DK",
          "Pseudo": "Andries Nel",
          "Nb_Reviews": 4,
          "Date": "2022-10-31T13:08:07.000Z",
          "Titre": "Great customer service.",
          "Contenu": "I am extremely impressed by the prompt assistance received after I had an audio issue. It was resolved very quickly and professionally. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon N",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T19:17:28.000Z",
          "Titre": "Phenomenal Customer Support Ethos",
          "Contenu": "Adrian was very helpful in providing me the resolution I was seeking without having me me jump through hoops. This speaks to the great customer-centric approach PetCube practices and it’s very much appreciated"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Mykhailo Stefaniuk",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T13:19:25.000Z",
          "Titre": "Best balance price /quality",
          "Contenu": "Best balance price /quality! No experience with any bugs or mistakes. Life hack - you can even check your baby)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Y. Litke",
          "Nb_Reviews": 1,
          "Date": "2022-09-19T02:11:10.000Z",
          "Titre": "Incredible!",
          "Contenu": "Pet cube is an incredible way to make sure your pets are safe and comfortable. I love talking to them when I’m at work and I love the notifications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 2,
          "Date": "2022-09-19T02:53:21.000Z",
          "Titre": "Such great customer service",
          "Contenu": "Such great customer service! I chatted with an online rep Jay about an issue I was having, and they were quick and efficient at addressing my concerns!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ally Burnham",
          "Nb_Reviews": 2,
          "Date": "2022-08-04T00:10:17.000Z",
          "Titre": "Petcube customer service were great",
          "Contenu": "Petcube customer service were great. We had a faulty product, but they were quick to understand the situation and help us rectify it. Very easy to communicate with."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Helen “Henny” van Loon",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T15:43:43.000Z",
          "Titre": "Small problem - Big response - No more problem",
          "Contenu": "I had a small issue I could not seem to fix. I sent a 'Contact us' email with my problem and I had a response within 15 minutes with easy to follow steps. No more problem. The best service response time..ever! Petcube Camera is a great little device. I look forward to watching my fur-baby from work."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T05:27:14.000Z",
          "Titre": "I originally had a lot of trouble…",
          "Contenu": "I originally had a lot of trouble setting up my Pet Cube.However with several emails, the team at PetCube have been able to resolve my issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tara Rose Donberg",
          "Nb_Reviews": 2,
          "Date": "2022-04-29T16:14:09.000Z",
          "Titre": "Easy To Use and Effective Product, Plus Incredible Customer Service",
          "Contenu": "I have 3 Petcubes. They are incredibly easy to sync up to a phone and install in a matter of minutes. They work amazingly well. I love being able to check in on my fur babies wherever I am. Their customer care is ABOVE AND BEYOND! I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Pierre Combis",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T09:10:19.000Z",
          "Titre": "Great after sales service",
          "Contenu": "I had an issue with the sound and the quickness of the answer and the resolution of the issue was unbelievable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jennifer B.",
          "Nb_Reviews": 3,
          "Date": "2022-10-10T15:46:13.000Z",
          "Titre": "Excellent customer service from Adrian",
          "Contenu": "Having not used my Petcube for a couple of years, I was struggling to get it working again, so emailed Petcube Customer Care and they responded quickly, giving me detailed instructions on what to do, and as a result it's now working fine.  I highly recommend their super-prompt customer service - special shout out to Adrian for helping me."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Amanda Lee",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T07:09:24.000Z",
          "Titre": "Mark helped with my queries and issue…",
          "Contenu": "Mark helped with my queries and issue efficiently. Was very quick to process as well, thank you for the efficient service"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Soheyla Tofighi",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T08:09:01.000Z",
          "Titre": "Petcube bites 2 - good choice",
          "Contenu": "For Petcube bites 2The product works very good and the subscription can be canceled anytime. The support is really helpful and very uncomplicated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dinora Adame",
          "Nb_Reviews": 1,
          "Date": "2022-08-17T19:18:58.000Z",
          "Titre": "Forgot password never got email with directions",
          "Contenu": "Representative helped me log back into my account after forgetting password ! They kindly sent me a link and in minutes I was back into my account !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa Shook",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T04:19:02.000Z",
          "Titre": "Fabulous follow through…great customer service!!!",
          "Contenu": "This company has the best customer service that I have experienced in years. Prompt, helpful, experienced and great follow through. I wish all companies used their process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeane",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T16:12:03.000Z",
          "Titre": "Peace of Mind",
          "Contenu": "Pet cube has made me feel at ease when I have to be away from home. I able to keep an eye on my kitties. It was extremely helpful when my one kittys was ill. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aggie Liu",
          "Nb_Reviews": 2,
          "Date": "2022-09-12T12:11:27.000Z",
          "Titre": "I know Petcube from spendwithukraine",
          "Contenu": "I know Petcube from spendwithukraine. The cam works very well even in the dark. Treats box fit different size treats. I will definitely recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-14T00:53:07.000Z",
          "Titre": "Give them a chance!",
          "Contenu": "At first, no answer to my issue. They emailed back next day. Not only canceled subscription, but reimbursed me right away! I don't have a need for the petcube right now. Still have it & will probably use in the future!"
        }
      ]
    }
  ]
}