{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "pingo.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Khadija",
          "Nb_Reviews": 1,
          "Date": "2021-12-08T04:38:57.000Z",
          "Titre": "They keep reducing the minutes on the…",
          "Contenu": "They keep reducing the minutes on the call. For a $10.00 card, one can now talk for only 21 minutes.  It used to be way more than that to where I call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "abc",
          "Nb_Reviews": 1,
          "Date": "2009-07-22T16:27:51.000Z",
          "Titre": "Horrendously Bad Service",
          "Contenu": "I have been a Pingo customer since January 2009, and for seven months I've suffered their bad services. Extremely rare were the moments when a call through their 'softphone' (internet phone) went through without major problems - and even when they did, the sound quality was always bad (on both ends). On most days, calling through Pingo was a chore, dialing the number dozens of times over 10-20 minutes until the call finally went through. And don't expect any help from their customer service, whether you contact them via phone or e-mail."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chaithra",
          "Nb_Reviews": 1,
          "Date": "2011-06-26T03:04:33.000Z",
          "Titre": "No stars for them",
          "Contenu": "I bought a pingo calling card to call India. The calls always go to a wrong number or it says invalid number. There was no problem at all when I was calling the same numbers using Airtel calling card, but unfortunately they discontinued the service. To top it, an auto-top has been done by pingo even though I did not select auto-top when I created the pingo account. Can someone please give me their customer call number (phone number, not the email-id). I want my money back."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Andrew",
          "Nb_Reviews": 3,
          "Date": "2009-04-06T15:21:42.000Z",
          "Titre": "Horrid customer support, non-existent service",
          "Contenu": "I signed up a pingo account thinking it might be useful since i was travelling but I was flat WRONG. Dumbest idea ever. I couldn't get the toll-free number listed on their website for Japan to work at all despite calling via mobile or from landlines. Their customer support was no help either, just regurgitating information already on the website on me. What's more, my account is now stuck in a 'review' state and I can't even cancel it! You're better off giving your money to a charity!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fette Fette",
          "Nb_Reviews": 1,
          "Date": "2011-02-15T15:30:33.000Z",
          "Titre": "I wish there was something LESS than one Star, They deserve MINUS 5 Stars",
          "Contenu": "I have been having worse connection ever using there service. I had bad connection on each call I made and I keep getting disconnected after talking for a minute or two or three and asked to enter phone number again and again. It's pretty annoying, frustrating and on top of that I'm paying for that. It's ludicrous,  absurdity, incongruity to pay for horrible service like theres. I should receive full refund and a letter of apology. I just discovered a $.98 charge for monthly maint. ! I was never told that I'll be charged \"MONTHLY FEES\"! They are THUGS."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amber Byard",
          "Nb_Reviews": 2,
          "Date": "2013-08-29T19:22:02.000Z",
          "Titre": "BEWARE of pingo --they ripped me off total SCAM",
          "Contenu": "I am a very disappointed customer of Pingo calling cards.  One day I couldn't make calls--no message, no prior warning--just dialed the number and it didn't work.  I tried to call customer service but couldn't get through to that either because their system was \"undergoing maintenance\".  Their internet site wasn't working either.  This was a huge inconvenience to me.  When I finally, the next day got through to someone who barely spoke English,  and explained how upset I was about what had happened, they offered me no compensation.  I said well, you've lost a customer then.  I am a pissed off customer.  Please don't give these people your business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Petri",
          "Nb_Reviews": 1,
          "Date": "2010-05-31T14:10:11.000Z",
          "Titre": "Could not even get account activated!",
          "Contenu": "I found this site only after signing up with Pingo - if I had read these before, I would have never signed up. \r Unfortunately my experience is exactly as per most of the people below. I signed up, got asked for verification info over email, replied immediately with the information requested. After that, I have not heard anything back and am not able to use the service! I have therefore asked them to cancel my account and to refund me - let's see how that goes..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "savvas",
          "Nb_Reviews": 1,
          "Date": "2010-06-11T08:23:36.000Z",
          "Titre": "DO NOT USE this company",
          "Contenu": "This company is a joke! Enter your credit card information, but you will NOT be able to use the calling any time soon or more likely NOT AT ALL.\rI am still waiting to use mine & have given up altogether. \rNow I have to spend a bunch of time filing complaints to get back my own money. I will NEVER use this company & neither should you.\r I know the reply from Pingo about this will be that since they do not have contact information associated with my account, they cannot address concerns online, but who would post their email & phone # here??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SJS",
          "Nb_Reviews": 1,
          "Date": "2009-07-04T09:01:00.000Z",
          "Titre": "Pingo is the Worst calling card",
          "Contenu": "worst calling card you can ever come accross\rif you are in emergency to call someone forget Pingo as they will try to verify your account and when you send all the details they disable your account..and the best part..Money is deducted instantaneously from your bank\r My sincere advise is Please Stay Away"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karen Cristina Yupanqui Carlos",
          "Nb_Reviews": 1,
          "Date": "2012-02-10T06:13:48.000Z",
          "Titre": "I haven't received my confirmation email from Pingo",
          "Contenu": "This is the second time that I buy a calling card for Pingo. The first time I waited for years and they never answered my confirmation( or whatever )mail to verify my account. So, yesterday I decided to give a new opportunity to this company but It has been more than 24 hours and I am still waiting for the verification mail ( I can't remember that name)... Please!!! verify my account 801 636 3772 I need to call my family.. it is an emergency!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nancy",
          "Nb_Reviews": 1,
          "Date": "2012-01-17T04:26:53.000Z",
          "Titre": "Worst experience ever!",
          "Contenu": "I needed to call another country on an urgent matter, so I found this online and thought it'd be easy and a great idea. I was so WRONG!. Things written on the website contains much of a huge miscommunication. I also called to verify that I will NOT get charged additional from my provider, and the speaker confirmed that everything I'm doing is correct, and when the bill comes around, NOTHING is CORRECT!. I called customer service, and that SUCKED. They change the wordings so that the CUSTOMER is WRONG. I was not trying to any additional benefits. I just wanted my call to be credit towards the credit that I bought. ERR."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sejal",
          "Nb_Reviews": 1,
          "Date": "2010-08-22T03:26:05.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "This is the worst calling card company i have every tried to use.  I opened an account, tried to access it, was unable to because my account was under review.  I contacted customer service and was told that once my account was \"approved\" i would receive an email.  I never received an email, got charged $20 because i supposedly signed up for automatic recharge when i was not even able to access my account.  \rStay away from this company....."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Pandi",
          "Nb_Reviews": 1,
          "Date": "2009-08-27T16:53:11.000Z",
          "Titre": "CUSTOMER SERVICE IS PATHETIC",
          "Contenu": "Pingo's customer service is so pathetic and irresponsible. I had recharged my pingo account recently for $20 but my account did NOT get recharged. I had contacted Pingo customer service regarding this. The customer service Agent said my payment shows pending so he will have billing department to look at it. But NO response from Pingo even after 5 days. I had sent couple of follow up emails but No response/reply.\r Finally, I went ahead and disputed the transaction. The same day evening, I tired logging into Pingo but I was getting Invalid Account message. Looks like they removed my account. This is NOT AT ALL ACCEPTABLE\r My Kind advise, DO NOT GO FOR PINGO since you have other good calling card providers in the market."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "f pier",
          "Nb_Reviews": 1,
          "Date": "2010-04-27T04:01:31.000Z",
          "Titre": "No Response D. O. A.",
          "Contenu": "I was never able to establish service with PINGO. After two days of emails and phone calls I was told my account was cancelled. That was news to me because my account was never active! The only email I ever received from either \"customer service\" or \"verification\" was in response to my demand to cancel my service. Their response: \"your service has already been cancelled.\" Stay away from this joke of a company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2010-02-05T06:35:21.000Z",
          "Titre": "stay away",
          "Contenu": "I opened my account in Feb 03 and paid $5, they sent me an verification email and I replied with all the needed info, got nothing back since then. And now i just find out someone disabled my account and i it says 'invalid account' every time i log in. Called customer service multiple times and no one answers. This is great! Everyone stays away!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ex-pingo user",
          "Nb_Reviews": 1,
          "Date": "2013-06-18T02:26:12.000Z",
          "Titre": "Bad service",
          "Contenu": "I have been a Pingo customer for at least 5 years, suddenly I was not able to make calls, called customer support since there is nothing online to help you, the customer rep says \"ticket has been filed and to try making a call again in 30 minutes, it should be fixed\"\rSo I waited 40 minutes, tried the call again and of course it didn't work...so I called customer support again, now he tells me he's escalating the issue and to try the call again in 2 hours.   I tell the guy that I can see the pattern here, next time he's going to tell me to try in 4 hours so I decided to cancel my account instead and I needed a refund.   He proceeds to tell me that refunds take 35 days...stay away, unreliable service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Enoc",
          "Nb_Reviews": 1,
          "Date": "2010-11-21T14:33:09.000Z",
          "Titre": "PINGO is an unethical company, trying to pass as ethical",
          "Contenu": "Customer service is not bad....it is simply non existent! I think this is probably a website service being managed by 2-3 people. Connection is many times very difficult and on others the system does not recognize your account.\r Additionally, they have fallen they to the \"Greed Factor\". When I staarted, there was no \"Maintenance fee\". Now the charge an monthly outrageous fee which erases any savings they offer. There is of course NO justification for this fee....they just want to have your money. My $5.00 deposited was depleted to $0.00 however I didn't make not one call. PINGO is an understaffed, unethical company which should be avoided at all costs. The good news is that there is a great number of other ethical companies, with low cost international calling services"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Colin",
          "Nb_Reviews": 1,
          "Date": "2013-08-06T02:04:58.000Z",
          "Titre": "SLOW POOR correspondence",
          "Contenu": "Signed all up paid 20 bucks by credit card, did everything they wanted waited, phoned them, waited, still nothing finally phoned them again and was told the account was cancelled. THEY didn't call or email me It just wouldn't work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian Matt",
          "Nb_Reviews": 1,
          "Date": "2010-01-20T23:54:13.000Z",
          "Titre": "Worst calling card service EVER.",
          "Contenu": "Don't EVER go with this company, Pingo.com. It takes DAYS for a simple 20-dollar credit to be processed, so NOTHING is instant here.\r Additionally, customer service is, of course, out-sourced to India so you can bet on shoddy customer service and language barrier Heaven if anyone even answers the phone.\r I am EXCITED to end a dispute with Pingo.com, as I have 20 dollars floating in non-appended/unapproved purgatory ever since Monday - calling them only awarded me that MAYBE my credit would be approved on FRIDAY of the same week. FIVE DAYS TO APPROVE A MEASLY 20 DOLLAR CREDIT?? I asked for a refund and that will take 5-10 business days to process now.\r There is NO notification anywhere on the website that warns the user of extensively long approval waiting periods and call quality SUCKS.\r DO NOT GO PINGO EVER!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2011-08-31T18:53:11.000Z",
          "Titre": "Poor Customer Service and Lies",
          "Contenu": "I have used Pingo for at least a year to make calls to Australia.  All of a sudden the calls were not completed, for a number of reasons, ranging from insufficient funds (when funds were available) to reason 7 (whatever that is) to just a standard message that the call could not be completed.  I have called them every night for the past 5 nights, since it started, and each time they answer is the same - the problem will be escalated but the problem still has not been fixed.  Last night around 8:00 I called and asked to speak to a supervisor and was advised that no supervisors work at night.  Today when I called during the dayI was advised that only one supervisor was working and that two worked the 4 to midnight shift.  I'm fed up with their run around, lies and poor customer service.  I'm cancelling the account today."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Price",
          "Nb_Reviews": 2,
          "Date": "2013-05-16T00:57:51.000Z",
          "Titre": "I can't get softphone to work",
          "Contenu": "Three phone calls and an email later, I have a \"loading\" softphone. Problem is that is ALL it does...never succeeds.\r I was told by Pingo rep that It would work if I disabled my firewall. I have done this on two different computers with two different OS and virus protection....guess what ? still \"LOADING\"  \rOh Well..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Marcus",
          "Nb_Reviews": 1,
          "Date": "2009-12-19T18:02:53.000Z",
          "Titre": "What a Joke",
          "Contenu": "Worst card ever I spent a hundred or so dollars with the company at first the card worked ok but now for past 2 weeks I call and my girl does not hear one word.  I complain and no credit for the garbage service.  If you are here looking for a card I would say try nobelcom.com my experience with them is that the rates they advertise do not include tax but the clarity of calls is unmatched.  Good luck stay away from pingo like it;s the plague.\rMark Marcus \rMelrose Park Il"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Felix Peters",
          "Nb_Reviews": 1,
          "Date": "2011-12-05T22:54:50.000Z",
          "Titre": "Calling Card Company from Hell",
          "Contenu": "This is the worst calling card company to do business with........everytime I do a recharge my account gets suspended.......customer service sucks......claims my credit billing info needs to be the same as the one on file.......how many times do I have to email you that its the same.....no tel# for 'account verification'.......what business model is this?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "N Mathes",
          "Nb_Reviews": 1,
          "Date": "2009-12-28T23:49:06.000Z",
          "Titre": "Product Has Become Unusable",
          "Contenu": "I've had Pingo for a long time (few years) and really never had any problems.  Until today.  I have been trying for over 5 hours to make a call.  It was total static and no phone ringing on the other end.  Finally, I did get a ring but there was still so much static it didn't matter.\r I called Customer Service twice, but no solution.\r 12/29/2009 Update - I have just emailed Pingo to request a refund of my balance and close my acct as I am still unable to complete a call from FL to CA."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 3,
          "Date": "2010-01-30T20:29:08.000Z",
          "Titre": "My readers had a bad time",
          "Contenu": "I run a voip blog and I posted about their onebuck offer. My readers trust me and few of them registered for Pingo's services. It so appears that none of them could get their accounts activated. Moreover, one guy was charged $5 even though the coupon code onebuck was supposed to get them $4 off that is they should have been charged just $1. \rUpdate: Pingo replied to this complaint and I am glad my users got their respective accounts back. However, when I contacted the user mitulchaudhari@yahoo.com I was told he was charged $5 and not $1 as the coupon code onebuck should have worked. Also, no referral bonus for me? I could care less about my bonus as long as my reader gets his $4 back."
        },
        {
          "Note": 1,
          "Lieu": "LK",
          "Pseudo": "Johan Smith",
          "Nb_Reviews": 1,
          "Date": "2010-01-17T01:48:59.000Z",
          "Titre": "Bunch of Thieves-Stay AWAY!!",
          "Contenu": "i signed up for pingo onebuck promotion on 13th January 2010.I send my details to pingo verification number but my account is still not activated.When i try to login i get the message invalid account."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "C.A. Cooper",
          "Nb_Reviews": 2,
          "Date": "2009-10-22T19:19:54.000Z",
          "Titre": "SCAM",
          "Contenu": "Pingo Complaint\r On Oct 21, 2009, I signed up for Pingo service under the ad banner of\rStart Calling for Free Now!\rTake 2 minutes to Sign Up \r$5 bonus* on $10 sign up\r$10 bonus* on $20 sign up\r They got my personal info, including my credit card number along with an order for $20.00 calling card.\r I have not been able to use this service, and the company has refused to honor this offer advertised on their website.\r Tomorrow I will make the journey to a branch of my bank here in Brazil to dispute any charges from this company.  As far as I can see, this is nothing but a hoax and a ripoff of credit card numbers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Fatima",
          "Nb_Reviews": 1,
          "Date": "2014-04-24T17:36:35.000Z",
          "Titre": "Pingo is worthless now, don't waist your money",
          "Contenu": "I am so piss i been with this company more than 8 years, they used to be good but now they are the worst calling card company. Everything was fine before when you call customer service for your credit back they will tell you to wait for 30mn and put back but now they cut your minute and they will tell you to wait 24 to 48h then i call them the day 5 still no minute. when i call them they have the gut to tell me that wherever department didn't approved my $10 credit. your system cute my minute and you saw that my $10 was take away from me and still don't want to give me back my credit. when i buy credit i buy $50, $30 i spend a lot of money which pingo but i guess they don't need me anymore."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rafael Mendoza",
          "Nb_Reviews": 2,
          "Date": "2009-01-23T16:27:49.000Z",
          "Titre": "CUSTOMER SERVICE SUCKS!!!",
          "Contenu": "I don’t know about the quality of the calls yet, but the Customer Service of Pingo SUCKS!!!I’ve been calling to their phone line for more than 12 hours and it either lets you waiting or hangs up on you. I enrolled in the service on a Thursday night and the next day, by 11:00 am tha account had not been activated. I finally talked to a representative and she told me the activation takes from 24 to 48 hours. Unfortunately, thay don’t tell you that on their web page so you get stuck waiting for them. I am cancelling the service immediately, if a company can not effectively take care of its customers, it does not deserve my money. BEWARE OF PINGO CUSTOMER SERVICE!!!!!\r Also, I just found out that this company is not accredited with the BBB (Better Business Bureau). Despite this, the BBB rated it F (Fail) due to the number of complaints and the lack of response of the company to resolve them. AGAIN, BEWARE OF THIS COMPANY PRACTICES"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2009-03-13T22:06:32.000Z",
          "Titre": "Stay away from Pingo",
          "Contenu": "Three days after signing up my account still doesn't work yet my credit card has been charged.  I have emailed them 11 times and called four.  No response, customer service can't help - yadda, yadda, yadda.  If you want a phone card company that works, try someone else."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clark S",
          "Nb_Reviews": 1,
          "Date": "2011-07-29T17:28:46.000Z",
          "Titre": "Poor Performance",
          "Contenu": "I have used Pingo for at least 2 years - when I saw a slick ads on DC metro buses. It's been a very frustrating experience for my wife and I. We call Thailand regularly. I would say, conservatively, 90% of the time the call does not go through. After we dial the number, we get extended silence and then busy signals, busy signals, wierd ringing sounds, silence and clicks. This morning, in fact, I tried 10 times, but was unable to get through. The helpdesk, who have thick Spanish accents, tells us to wait a half and hour. I wait, still the same. I call back, they say wait a half hour. I tell them that is what you said before, let's get their technical people on the phone, they say they can't do that. This has been going on for two years. I am now searching for alternate international calling options."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "ddddd",
          "Nb_Reviews": 1,
          "Date": "2012-01-31T23:44:02.000Z",
          "Titre": "AVOID!!",
          "Contenu": "I just signed up with this company 3 hours ago.  For the past two hours I've been trying to make a single damn call.  NO WAY!  First of all, there is NO ACCESS CODE from Turkey!  Thanks for telling me this before you took my money PINGO!  Second, their soft phone is totally useless, it either says the number is invalid, or else it \"connects\" without any sound from the other end, even though the audio test works perfectly.  DONT WASTE YOUR TIME WITH THIS COMPANY!  In frustration Ive sent three emails to the company now, and havent heard back once.  Of course a company rep will respond to this email just like all the other ones, with some lame excuse/explanation.  ENOUGH LIES!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Samrat Ray Chaudhuri",
          "Nb_Reviews": 3,
          "Date": "2010-04-09T16:40:21.000Z",
          "Titre": "Call Quality reminds me of ip phones of early 2000s!!!",
          "Contenu": "I have used IP phone services like Ringomax, SkySipTel, DreamVoiz & Ring Asia. On a connection of 512k. They are as good as land connections. This one is the most horrible i have ever encountered. Sometimes the soft phone doesn't even register. The call quality reminds me of those cards i used in the late 90s and early 2000s. Even that experience was on a dial-up connection.They would have been better on a broadband. \rThey say its the 'Last card i would ever need', i think its 'The first time is the last time'!! This company claims that it has a 95% retention rate..I think its a whole bunch of lies. This is the worst IP phone service i have ever used."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Lloyd",
          "Nb_Reviews": 3,
          "Date": "2012-09-02T23:04:59.000Z",
          "Titre": "Very unimpressed",
          "Contenu": "I rang Pingo to set up an account, and assumed everything was OK. I had to send an email to verify my account, but never heard back from them. When I tried to use the service, it informed me that my account had been disabled. They would not respond to emails, and when eventually I got through to them on the phone, customer services were not able to help - they said I must email their verification team. As they do not respond to emails, there is no way I can make contact with them. I am left wondering what sort of a company that are now holding my contact details. \r Bizarrely, I still keep getting promotional emails from imploring me to come back to Pingo, and even telling me that my account has been credited with £10, which I can't use. Are they going to take that from my account bank account - I hope not?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Petrovich",
          "Nb_Reviews": 1,
          "Date": "2009-09-30T17:38:40.000Z",
          "Titre": "Rebuttal",
          "Contenu": "I posted my review here and must compliment Pingo. They do a much better job replying to complaints on this site then they do to complaints sent to them by paying customers. \rTo rebut your claims, I have tried the service from St. Petersburg, Kazan, and Samara...as well as other cities not listed by you on this site. You DO NOT MENTION THIS ON YOUR SITE WHERE YOU SELLL YOUR SERVICE TO THE PUBLIC and this is lot right. Stick a note up there that states \"limited to certain cities or areas\". I don't know what the problem is and I am fairly uninterested after months of waiting. Is it so difficult to correct the problem or stop trying to sell a service to the public that does not exist? Really, Pingo is not a bad company and I have had great luck calling from the U.S. but I must agree that the term customer service does not exist in this company and this causes me to question the ethics of a company that behaves in this manner."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Xiankun Zhang",
          "Nb_Reviews": 1,
          "Date": "2011-09-09T16:36:33.000Z",
          "Titre": "Poor customer service",
          "Contenu": "I opened my account few days ago and have paid $5, they sent me an verification email and I replied with all the needed info, got nothing back since then. And now every time i try to log in my pingo it says \"invalid account\". Sent tens of email but no one reply till now. Can anybody resolve my problem? My account #3614312930."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dancergirl",
          "Nb_Reviews": 1,
          "Date": "2011-12-15T02:29:57.000Z",
          "Titre": "WORST CUSTOMER SERVICE",
          "Contenu": "They charged me for $20 when I only purchased $5 and then refused to refund the difference and told me it was my fault when I emailed them. Called them and they said they \"put in a request\" for the refund and the money would be refunded to my card in 3-5 business days. 2 weeks later and nothing so I emailed to close my account like it says to do in their terms and conditions and they told me I had to call and they couldn't close it unless I did. And of course they don't make it easy to actually get connected to a customer service rep; the only way to get through is to select the option that your calls aren't be placed properly or something. No options for anything related to account issues. In fact the automated message even says for everything else (other than issues actually making calls) to use their website or email them! Its so screwed up! And when I called to close my account they only \"put in another request\", so who knows when/if it will actually be closed and I'll finally get my money back."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Nishant Shekhar",
          "Nb_Reviews": 2,
          "Date": "2009-10-20T05:21:34.000Z",
          "Titre": "SCAM FOR SURE",
          "Contenu": "It been well over 15days since I signed up for calling card service & my $20 which has been charged to my credit card has not been applied to my account yet. More over I've been just given $5 as sign-up bonus instead of $10. I've mailed the customer support several times but no reply. I'm going to take strict actions against this as its of no use. People please be aware & stay away for it. They will just rip your card off & you'll get nothing. Its my second review here. This thing is a useless crap. For the customer service that replies here. Please refund my money back to my credit card. I need my money back or I'm going to file a case against this company. FOr your information last four digits of my ac no is 8008.\r Please refund my money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "k",
          "Nb_Reviews": 1,
          "Date": "2012-02-25T18:37:31.000Z",
          "Titre": "FALSE ADVERTISEMENT",
          "Contenu": "I SIGNED IN TO THEIR SERVICE THURSDAY FEB 23,2012  AND CHARGED MY CARD $20 IN ORDER TO GET A $10 AS A FREE BONUS... WHEN I CALLED THEM TO ASK WHERE IS THE $10, THEY TOLD ME I WILL GET IT IN 10 DAYS.. THIS IS NOT WRITTEN CLEARLY ON THEIR WEBSITE.. I ASKED THEM TO CLOSE MY ACCOUNT COMPLETELY THE SAME DAY I OPENED IT.. THEY SAID THE REFUND IS NOT IMMEDIATE, IT TAKES SEVERAL DAYS.. WHY?  I TAKES A SECONDE TO TAKE MY MONEY BUT FEW DAYS TO REFUND IT...I AM MAKING SURE YOU HAVE A VERY POOR RATING ON THE INTERNET SO THAT YOU THINK TWICE BEFORE TREATING CUSTOMERS LIKE THAT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A B",
          "Nb_Reviews": 5,
          "Date": "2018-10-01T22:08:57.000Z",
          "Titre": "Unrealiable service. Rude customer representatives",
          "Contenu": "I am a customer of Pingo probably around 5 years now. Initially, the service was realtively more realiable, with few problems here and there. Last 2 years, the service became incerasingly very unrealiable. Last couple of years, there were multiple service outages for long time segments that I couldn't put any phone calls up to a half day. When I was able to make a call, the quality was very poor, that the conversations became very difficult. I use to email them about the problems, They were apologizing and offering some credits, and following few more days of acceptable level of service. Then, everything was sliding back to poor service. After I gave a negative review for their cell app, things got even worse. When I contacted them again about the poor service, the representative (Brian Hawkins), without listening the problems, directly asked me if I am willing to change my review about their App, When I refused it, he said 'If you are not happy about the service, maybe this company is not for you\" .I couldn't put it better myself.  I agree with him hundred percent. I think this company is not for me or other people who are looking for a realible service and decent phone connections."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2011-07-18T22:55:55.000Z",
          "Titre": "Horrible Service with no product to even use",
          "Contenu": "I tried to set up an account recently and thank god i did not give them my credit card number but used PayPal instead.  I have been trying to contact their customer service for over a month with not one reply  i have provided all the pertinent account info they should need and still not one email, call or any other contact.   I tried to call the 800 number they said they couldn't help me because the account was not activated and their department is unable to help with anything other than call quality issues. they aren't even able to look up account info.\rWhen I set up my account on a Friday I was able to log into it Saturday and Sunday but could not use it due to it needing verification once Monday came around it said the account did not exist. This was over a month ago and my account is still not active and I have not even had a response from a single Pingo representative. I have sent emails to contact@pingo.com, pingoverification@pingo.com, customerservice@pingo.com. \rNot one person or even automated reply stating they received my request or concern.  This company is a committing Fraud by taking money and not delivering anything at all."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Miao",
          "Nb_Reviews": 1,
          "Date": "2012-02-01T03:09:44.000Z",
          "Titre": "bad Service",
          "Contenu": "i have purchased the 20 dollars international phone card, couldn't use it\rfrom the beginning, the next day i could't even access the account, it keeps saying that invalid account number , please help with the issue, my account number is : 2014232752   First name:   Wenqiang Last name: Miao, i have sent the customer service email , but so far no reply, please solve the issue for me ASAP!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Ahmad",
          "Nb_Reviews": 1,
          "Date": "2010-11-16T21:30:51.000Z",
          "Titre": "WORST Company EVER, i wanted to put ZERO star,",
          "Contenu": "This is a company or a joke. They don't have a customer service or anything so you can talk to. \\i am trying to log in to my account and it says wrong pin, and when i click on forgot pin, then tell me that I am not registered with them. And when i want to register, they say your account is already registered. JUST DON'T WASTE YOUR TIME ON PINGO. THEY MIGHT BE A BUNCH CYBER ROBERS JUST TO STEAL PEOPLE'S MONEY."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 1,
          "Date": "2011-06-28T05:45:11.000Z",
          "Titre": "No star absolutely, I wanna put minus",
          "Contenu": "That's really funny that $30 is charged and shown on my online account, but it is ZERO balance when I attempt to make a call. I sent 4 emails in a week, and there's no response from this company. Keep away from this company! If you are fine with Pingo, that's b/c you are getting close to danger."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kitty",
          "Nb_Reviews": 1,
          "Date": "2012-03-22T02:44:18.000Z",
          "Titre": "Complete waste of time...and money",
          "Contenu": "This company is a borderline a scam and joke. Please avoid by any means. \r I signed up for $10 to give this company a try. There is no confirmation emails with promised PIN code EVER! I emailed customer service TWICE and got zero reply. I called them three times and the rep said he found my account was closed but he can't see why. ... What?! At the same time, they have charged $10 to my card. The reds said whoever closed my card is in another department and he can't reach them. It will take a few days to refund the $10 back to me. \r So they charged your card and closed your account without providing any reason, confirmation, or notice.  NEVER heard of such a ridiculous thing. Wow!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arabia",
          "Nb_Reviews": 1,
          "Date": "2009-08-17T06:45:07.000Z",
          "Titre": "Pingo sucks!",
          "Contenu": "I have been a loyal Pingo customer since October 2008. I spend anywhere from $50 to $100 per month!!!! But their service is ZERO! As of August, everytime I charge my account, they only credit my account $5 and say I'm in verification proces and anfter 3-4 days they would put the rest of the money on my account. And this has been going on at least 5 times! And the stupidest part is every time, i receive an email saying that i have been approved and my account will never undergo the review process,  but it never fails. When I called in, I was told that instead of recharging for $10 each time, I should recharge for $25...OMG!!! Since when does a company dictate how much you can purchase? If they were smart, they would reealize the frequency at which I recharge and just strive to keep such a cash cow!\rI am done with them! Beware of PINGO!! The rates are not worth the headaches!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "newst",
          "Nb_Reviews": 1,
          "Date": "2008-12-20T18:15:01.000Z",
          "Titre": "Don't Believe Their Claims",
          "Contenu": "The webiste claims they have no fees. It's a lie. They take out one dollar every month from your account. I put some money in so I would have it when I traveled. Like sands through the hourglass, my money is disappearing into their pockets without me making any calls.\r If they lie so brazenly about this, what will they do later? They cannot be trusted"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chong Wang",
          "Nb_Reviews": 1,
          "Date": "2011-06-21T17:41:38.000Z",
          "Titre": "They charge you Monthly Account Maintenance Fee",
          "Contenu": "Nobody tell you that $.98 will charged every month.\r I always call to China by other calling card. Thay never charge me Monthly Account Maintenance Fee."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Sundara Moorthy",
          "Nb_Reviews": 1,
          "Date": "2013-08-24T10:30:33.000Z",
          "Titre": "Not at all satisfied",
          "Contenu": "I created an account but it is still not activated even after a day  time.\rAlso there is no response from the customer support team. I have mailed a couple of times.\r poor service\r Sundara moorthy mm"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2015-06-13T19:35:36.000Z",
          "Titre": "The company will steal your money, avoid Pingo!!####",
          "Contenu": "Pingo is the worst phone card company. I was trying to reach my family but couldn't hear anything. The call didn't go through at all. Pingo charged me $5 and refuse to give my money back. Avoid pinho, use google phone, they more reliable."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Not a Real Name but a real customer",
          "Nb_Reviews": 1,
          "Date": "2015-09-30T22:25:18.000Z",
          "Titre": "They used to be good",
          "Contenu": "Service has gone downhill. They now automatically bump you from free account status to charging you the highest level of fees."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Νίκοιαυς Κοορμαηη",
          "Nb_Reviews": 2,
          "Date": "2012-09-06T11:29:34.000Z",
          "Titre": "not satisfied",
          "Contenu": "I payed $US 5,00 + tax and they did not send any account info or whatever. when i try to login it says my account is invalid. im really starting to hate the US! S§%t like that doesn't happen in Europe.. filthy greedy system"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cassiano",
          "Nb_Reviews": 1,
          "Date": "2011-03-21T19:42:31.000Z",
          "Titre": "stay away....was never a pleasant experience",
          "Contenu": "Found them online and read the first 3 reviews on google...open an account that was under review for hours and then decided to call. Slow response on Cu. Service, granted, not the only ones with problems.\r On the meantime decided to look more into the reviews. Fourth one brought me here and I realized I was in for problems. I wish I read these reviews first.\rThey actually activated my account when asked about it and charged my cc. Because of the delay, I learned of the monthly fee and other problems and asked about it. Then asked to cancel the account. They hung up on me.\r Called back and since I always ask them to repeat their names and write it down, got the same guy. He told me I hung up on him, even though I called back and waited more than 5 minutes to speak with someone.\rPromised a credit within 3-5 days....I'll wait and will update post."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Rusee",
          "Nb_Reviews": 1,
          "Date": "2011-07-31T15:38:38.000Z",
          "Titre": "Money Taken, Can't Make Calls, False Advertising, No Customer Service Response Ever!",
          "Contenu": "1. After I signed up it took them almost a month and only after about 100 emails from me for them to approve and activate my account.\r 2. I signed up through a reference link from my boy specifically so that he could benefit and we could both call our parents for their anniversary but after my account was (finally) activated and I emailed Pingo (yet again) to inquire about my brother getting credited I never got not even one single response!\r 3. I just added money to my account to make a call. but each time I try to make a call I am given a message which says (every) number that I try to call is invalid. Oh? Really? Please tell me how that is so Pingo. And since their track record concerning customer service is disgusting I am not feeling too confident that the situation will be resolved or that I will get my money back and it is a highly inconvenient and frustrating situation.\r 4. When I inquired about the publicised promotion on their website (which I had taken great pains to follow the procedure stated in order to qualifiy for it) and be credited a certain amount-I never got a response. And I must say the promotional ad is till there on their site!\r From now on I will discourage and successfully convince any person I know who is even thinking about signing up for Pingo and will find another company to use.\r Pingo, honestly, you suck. \rThe high number of horrible reviews says it all. \rGood riddance."
        },
        {
          "Note": 1,
          "Lieu": "IR",
          "Pseudo": "Oltean Ioan Catalin",
          "Nb_Reviews": 1,
          "Date": "2010-10-26T05:36:44.000Z",
          "Titre": "Pingo overcharged my credit card with $1 - $2, but I can't access my account",
          "Contenu": "The most worst company on planet earth. Don't deal with them !!! They don't respond to emails. They charged my credit card, but no service. Be carefully, they have hidden taxes. They overcharged my credit card with $1 - $2. 100% I want my money back!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan smith",
          "Nb_Reviews": 1,
          "Date": "2010-08-26T18:16:00.000Z",
          "Titre": "Over five E-mails!",
          "Contenu": "I have E-mailed this company everyday this week and have E-mailed every department i could find contact info. for. I called Ibasis and apparently they don't work in their office because every extension I tried went straight to voicemail. I \"opened\" my account on Sunday they said i would be able to make calls on Monday. I responded to the verification E-mail and everything. Monday came and went with no service so I sent a couple of E-mails. After the second E-mail my account was disabled! I Have sent 5 E-mails and called multiple times as of right now the only response i have gotten was to refer my complaint to another department. This is such a pain. The biggest problem I have is that my fiancee is in Peru and I spent all my money for this weeks call with Pingo. So now i haven't been able to talk to her all week. The worst part of all is i can look and see where I've been charged on my bank statement. They say it's fraud prevention but it seems like I was the one who was defrauded. All I want is to receive the service I have paid for is that too much to ask? What's the problem with this company it's like they don't really exist!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "avi",
          "Nb_Reviews": 1,
          "Date": "2010-05-30T10:41:33.000Z",
          "Titre": "STAY AWAY BY ALL MEANS!!!",
          "Contenu": "WOW!!! I am mesmerized how this company is still in business. I had used pingo for a while until i was disgusted out of my minds and was forced to switch to another company (localphone). what a huge difference. the calls went through every single time, and it was crystal clear. and the rate was less than half of what I was paying for this crap (calling to bangladesh costs only 3.15 cents, and india only 1.5 cents). anyhow, pingo kept sending me promotional offers (literally begging for my money) to sign up for 5 dollars and i will get 5 dollars free. thinking pingo might have improved, i opted to sign up for it. BIG MISTAKE. I never had any calls go through to bangladesh. Even the landlines didnt work. If i got paid for all the time i wasted to get through, i would be a rich man today. anyways, pingo is a horrible company. I can not describe in words how bad this experience is. Please, here is my request to everyone: NO ONE...NOBODY DO ANY BUSINESS WITH PINGO EVER AGAIN.\r It is funny how the customer support people rebut all the posts as if they are listening to the complaints. hey customer support, if u r really doing ur job, why did everyone rate this company 1 star??? why do they keep rating it 1 star. obviously u haven't done squat to change anything. Here is a suggestion, fire these customer care liars and hire some engineers. or just return everyone his or her money and declare bankruptcy because honestly, companies like these should not be allowed to practice business and rob money from people. and PLEASE dont send out BS promotions to people when ur phone lines dont even work. \r I hope i was able to convince everyone how painfull pingo experience truly is."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Nilesh",
          "Nb_Reviews": 29,
          "Date": "2011-08-03T15:19:41.000Z",
          "Titre": "Do not use Pingo... its ridiculous",
          "Contenu": "Service is poor. The thing I do not understand is what are they charging 98 cents maintenance fee for?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Abir Mukherjee",
          "Nb_Reviews": 1,
          "Date": "2019-12-23T02:00:21.000Z",
          "Titre": "Pingo is not accessible from the UK",
          "Contenu": "Some time ago, I would have given a 5 star rating. I have been a customer since 2004, and I have many friends and family now signed up with Pingo because they found me happy with the great service.For a month or so now, I am not being able to use Pingo. I have money in my account, so does others in my family. We are all getting nowhere with Pingo. None of the numbers they have provided work these days. We called up to explain the issue and we were sent a form letter detailing how to use Pingo, which anybody using this service would already know. Then I emailed with the following:---------------------------------\" I am getting three responses:When I dial 08000015814 I get\"This number is not in service\" or\"We are experiencing high call volumes, please call later\"And when I call 01223655507 I get\"your authentification has failed\" even before I have keyed in my 10 digits. The errors I am getting are new, and hence my concern. I am not being able to use this service at all. Would you please let me know what to do? is ther any other access number that you have for calling from the UK?--------------------------------I haven't heard back from Pingo yet!So I am not sure I can trust Pingo anymoreUPDATE:This is an update in response to the response provided by PINGO.COM to my my first review posted on Dec1, 2019. Doesn’t matter which account I use, I get the same Pingo Experience, not the 95% positive as this provider purports their service to be. Still can’t make any call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "William Bill Trevena",
          "Nb_Reviews": 1,
          "Date": "2011-09-22T19:51:47.000Z",
          "Titre": "Very poor quality service to say the least.",
          "Contenu": "Quick to take your hard earned money!  Then you get there don't give a rats ass! about our customers service. I have tryed four times to get them to take care of my on line account. Every time they tell me the same thing. It will be 3 to 5 days and we will take care of your needs.  How can you call that a company we can trust. When all you have done is tell me a lie for a mounth now.  I have lost your TRUST for ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MBioGy",
          "Nb_Reviews": 1,
          "Date": "2009-10-17T20:19:37.000Z",
          "Titre": "Terrible Customer Service",
          "Contenu": "First off, let me state that I am a certified ISO 9000, CQA Auditor and have been performing quality audits of companies for well over 10 years.  This is the worst service I have ever encountered.\r We received an e-mail that stated that for the month of September we would receive a $5 credit for every $10 we spent to recharge our account.  We paid the money but the credit never came.  When  I called customer service to make an inquiry I came across a very rude agent who had to ask me multiple times to repeat my information (language barrier).  He then told me that it was my word against theirs and that they were not required to apply the credit unless we could send them a copy of the e-mail.\r I asked him if the e-mail was sent to all customers.  He said yes.  I then asked why we had to provide to them an e-mail that was sent to everyone?  I asked if he could see the transaction of the re-charge.  He said yes.  I then said, \"if the transaction occurred in the time period listed on the promotion, why was the promotion not automatically applied?  He said it is suppose to automatically apply but that our account may not have been eligible.\r Scratching my head I decided to bite, \"ok, why is it not eligible?\"  He said, I dont know, you will have to send us the e-mail to be sure. \r Does that make any sense at all?  I then asked to speak to a supervisor.  He told me that a supervisor was not available but he was the lead.  He then began to berate me and speak over me.  I told him I was the customer and he needed to listen to what I had to say and address my concerns, not speak down to me as if I were a criminal.  Understanding I was getting nowhere I decided to hang up and try another agent.  Interestingly enough, each of five times I called back I got the same agent answering the phone.  There was a delay each time while I was on hold but the probability of getting the same agent each time should not be this high for a company with more than 2 agents.\r My advice, stay away from this company.  They are skimming"
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Nikki",
          "Nb_Reviews": 3,
          "Date": "2017-11-22T12:24:07.000Z",
          "Titre": "Service under maintennace 22 hours from …",
          "Contenu": "Service under maintennace 22 hours from 24.Not recomend"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "ANN KRANE",
          "Nb_Reviews": 1,
          "Date": "2022-08-13T23:20:25.000Z",
          "Titre": "I have just renewed my subscription…",
          "Contenu": "I have just renewed my subscription with automatic top. I would have expected, but did not receive, a reminder that my credit card renewal date was imminent. Therefore, my previous subscription expired without my knowledge."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mishri Someshwar",
          "Nb_Reviews": 1,
          "Date": "2010-11-07T18:47:18.000Z",
          "Titre": "Has put my account under review for days.. and now i can't speak with my family!",
          "Contenu": "Pingo has always had some dicey service-- calls getting cut off, echoing on occasion, etc but I put up with it.\r Then they put my account under \"review\" and won't let me recharge. The result? I can't call my family because I'm out of currency.  Ridiculous"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "kate",
          "Nb_Reviews": 1,
          "Date": "2010-05-14T11:02:25.000Z",
          "Titre": "No connection to UK",
          "Contenu": "I have been using Pingo for a couple of years and happy with the service until this week. \r I live in Australia and am attempting to call numbers in the UK that I have called many times before and for 2 days have been unable to get through. I receive message \"Invalid number. Error 5\".\rI was successful in calling the USA this week, so am confused about what the problem is.\r I've sent an message to Pingo via their web site and no reply (somehow not surprised about that). So now I am stuck. This is unsatisfactory service and I'd like a resolution from Pingo so I can stay in contact with my family. Trying here in case it somehow gets me a solution!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2011-02-22T21:07:55.000Z",
          "Titre": "don't know what's going on",
          "Contenu": "Me and my friend created accounts with them yesterday. I made the payment through paypal (i am a verified paypal user for more than 10 years) and my friend used credit card. But until now, it says 'Sign-up Under Review'. Yesterday I tried calling their customer support, and the guy hung up on me. Don't know what is going on, and what to expect.. :/ \r I will update my review in a couple of days.. and within that time, if I get to use their service, I will write my review on that as well."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Kristy B",
          "Nb_Reviews": 1,
          "Date": "2009-10-17T03:10:28.000Z",
          "Titre": "Toll-Free Access Numbers Suddenly Don't Work",
          "Contenu": "I've had a PINGO account for a few years now. All of a sudden the toll-free access numbers for the US and UK aren't working. I've had to pay double for calls and at this point am just trying to use up my balance so I never have to use the account again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luigi M",
          "Nb_Reviews": 6,
          "Date": "2019-02-07T02:06:53.000Z",
          "Titre": "Only as a last option!!",
          "Contenu": "For the most part, very poor for what you get. I've been a looonnnnggg time customer only because I haven't made the shift to a cell phone.  Very poor customer service and the phone product can be quite annoying sometimes, too."
        },
        {
          "Note": 2,
          "Lieu": "BH",
          "Pseudo": "prasad",
          "Nb_Reviews": 1,
          "Date": "2010-01-25T04:31:30.000Z",
          "Titre": "my  service is not activated",
          "Contenu": "i signed up on 23/01/2010. i want to use this service to call from bahrain to india.there is no acess number from bahrain. i took $5. what is the benefit for me. still my account is under review even though i sent verification details."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Susanne McLaughlin",
          "Nb_Reviews": 4,
          "Date": "2010-06-19T00:50:48.000Z",
          "Titre": "Poor Quality",
          "Contenu": "Well i am glad i am not the only one that had problems. I can' hardly call my Familie in Germany the conection is so bad and most of the time i have no ring tone or in the mittle of the confersation it hangs up on me. you are right customer service is bad . not much help . i have $ 15 left and then i am done."
        },
        {
          "Note": 2,
          "Lieu": "AR",
          "Pseudo": "S.A",
          "Nb_Reviews": 1,
          "Date": "2019-07-07T21:46:57.000Z",
          "Titre": "Scam Scam Scam!",
          "Contenu": "I have been using them since 2009. Recently I had to recharge for 100 usd  with a credit card with a NY billing address. They charged me 8.8 usd taxes citing tax laws of NY. This  extra charge of 8.8 usd was never reflected when paying on their system. They are extreme scam  artists..once you agree to pay a certain recharge amount - they never declare the taxes or extra fees on the system. You must write them a separate email requesting them to approve the payment and suddenly - hey presto..They approve the card/the recharge amount but with taxes of 8.8 %.How do we know they have a brick and mortar shop in NY or they have employees based in USA..basis which online purchases can be taxed. Further, I read in NY tax website only if purchases are over 110 usd, online taxes are applicable, which was not the case in my case.when questioned further, they claim..go talk to state of NY - not to us.when questioned, for which states or countries, they do not charge tax..they say - do not try to beat the system..your card will get rejected. what a joke!!what a a great way to collect money ( in name of taxes) on a failing business model in modern times of WhatsApp, fb messenger, telegram, Viber etc.Be careful guys."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrea Heatley",
          "Nb_Reviews": 3,
          "Date": "2012-12-01T20:40:17.000Z",
          "Titre": "My account doesn't work, and they won't refund me!",
          "Contenu": "Hello,\r I have had a Pingo account since 2010, and until this year everything was fine.  I traveled abroad in April to visit my family, and most of the time I was unable to use the account to call my husband back in the USA.  I sent several emails to Pingo, and each time the message was the same - wait two hours and try again.  I came back to the USA and had no problems with the account until the end of October.  Whenever I tried to use the account, I received a message that said \"we are unable to complete your call at this time\".  I have called Pingo at least five times to get this resolved, and sent numerous emails.  Their response is always the same - wait two hours and try again.  I finally had enough over the Thanksgiving weekend, called Customer Service, and told them to cancel the account because I was unable to use it.  I had $15 remaining on the account, and asked if this would be refunded to my account.  The woman told me yes, since I couldn't use the account.  When I contacted them (by email) yesterday to find out where my money was, I was told that it would not be refunded.  I am so upset about this, and would like to know what I should do next.  I do have contact information for IBasis, the company that owns Pingo, but I don't know if there is any point in writing to them.  I am very disappointed in Pingo, and will never recommend them to anyone.\r Thanks,\r Andrea Heatley\rWashington, DC"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Moses Z. Timta",
          "Nb_Reviews": 1,
          "Date": "2021-11-12T12:04:30.000Z",
          "Titre": "No longer recognizing customer loyalty…",
          "Contenu": "No longer recognizing customer loyalty and or promoting any. Too bad"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T15:06:36.000Z",
          "Titre": "1 out of 5 calls issue with hearing",
          "Contenu": "At least 1 out of 5 calls I use Pingo for I end up issues with not being able to hear what person said after first few minutes and Pingo instead just repeats what they said previously over and over again . That’s when I have to hang up and call again or just use another service"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Marcin",
          "Nb_Reviews": 2,
          "Date": "2014-11-25T19:27:46.000Z",
          "Titre": "The monthly fee negates the rates.",
          "Contenu": "There's a convenience with using this service I suppose, but because of a monthly fee, you need to take that into consideration when calculating the rate.\rThere's other phone services or phone cards out there that offer the same or in some instance better rates, without any fees.\r Also, their website has issues. I can't edit my own profile.\r Customer service were excellent at trying to remedy the situation. It seemed like they really go out of their way to do what's right, make customers happy, and do what it takes to fix problems that may arise."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sumanth",
          "Nb_Reviews": 4,
          "Date": "2023-07-25T05:35:04.000Z",
          "Titre": "Navigation is hard within the app",
          "Contenu": "Navigation is hard within the app. The numbers don't work even when they are preloaded. It needs a revamp and a better contact menu."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Ulla Rasmussen",
          "Nb_Reviews": 1,
          "Date": "2009-11-06T21:22:12.000Z",
          "Titre": "Full refund was received after complaint on present site (thus the 3 stars)",
          "Contenu": "A full refund was credited my account 3 days after Pingo responded to my complaint here on this site (see below). This is fair, therefore the 3 stars. Although I was disappointed I couldn't get the phone card to work, and that I had to go public to get a response."
        },
        {
          "Note": 3,
          "Lieu": "TT",
          "Pseudo": "Zamina",
          "Nb_Reviews": 4,
          "Date": "2023-07-31T03:11:45.000Z",
          "Titre": "This last time l used pingo",
          "Contenu": "This last time l used pingo, they cut me off twice and said call ended.  I had to dial all my #'s again.  Never had a problem before so l don't know what was really going on."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Anand Srinivasan",
          "Nb_Reviews": 1,
          "Date": "2014-01-17T05:48:00.000Z",
          "Titre": "Regretting my decision",
          "Contenu": "I purchased this card because I needed to make quite a few calls to potential clients in a foreign country. Thankfully, I signed for their $5 package and not the $20 one (which promised $10 extra). One thing, the price that they prominently advertise is for the Softphone and not the toll free number - on toll free it is as expensive as calling through my carrier. I didn't realize it the first time I called. \r There are several problems with Pingo:\r 1. The softphone is extremely bad - half the people I called couldn't even hear me. So I tested it out by calling my own number - I heard loud creaking noises and my own voice was drowned in all the noise. I understand why my clients couldn't hear me. \r 2. You would expect that the toll-free number - for the price they charge - would be better. But no - when you call the number, you are asked to enter your ID and Pin. But half the time the system does not even realize that I have entered the code and keeps repeating its line to enter the ID. \r It's a complete waste of money. I have a few cents left in Pingo. But I would rather call my other clients with another system rather than ruin my relationship by using this one. \r Anyway on the plus side - their customer support is good. No complaints with that.\r UPDATE:\r I got a call from Brian Hawkins who is the Internet marketing manager at Pingo. While I could not attend the call, he further followed with me up over email to understand the issues faced by me. Their customer support has been awesome and Pingo has decided to refund the $5 back to me. Appreciate the company's customer experience. I have hence decided to upgrade the rating to 3 stars to reflect the update."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abigail Osei-Asamoah",
          "Nb_Reviews": 1,
          "Date": "2013-02-17T17:41:54.000Z",
          "Titre": "Used to be good but now the waste time saying 'They are reviewing your account with Manual recharges\"",
          "Contenu": "I have used Pingo since 2008 and have been using the same credit card for recharge and i recharge my account manually. They do offer great call quality and service regarding phonecalls internationally especially to my home country from the US. However beginning this year anytime i recharge my account,it always says my account is under review and i either have to call and harass customer service before my recharge goes through; a total waste of time given that there is a big time difference between my call destination and US ,so sometimes,by the time the whole mess is resolved,it would be so late i can't make my call. I do not know why they started doing this but when i call customer service they tell me something silly that i recharge my account too often ,which i thought it would be good business for them or i don't know if this is their way for pushing me to sign up for Autorefill which i wont sign up for. Either way i am truly displeased with the service and the hassle i have to go through to make one phone call because i can't keep calling or e-mailing their customer service each time i recharge! Maybe they do not want my business and want me to look for another phone card!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Wade Lambert",
          "Nb_Reviews": 1,
          "Date": "2013-03-01T05:26:18.000Z",
          "Titre": "Pingo cancelled account of very satisfied customer for no reason, UPDATE: restored after this review",
          "Contenu": "Opened an account 1/29/13 for my daughter to be able to call home. Great price, great call quality, smiles all around. $10 bonus credit was applied to the account as advertised, more smiles! 2/21/13 my daughter calls me using a borrowed phone card to tell me Pingo stopped working. I went to visit her on the 23rd and we tried together and it was like I had no account. Checked my email and they's sent an email saying they were sorry I'd canceled. I never cancelled, the credit card is fine, and nothing anywhere to let me know why. C.S. rep I talked to was not helpful, saying I had to email pingoverification for help. Four emails and zero replies, and my daughter still can't call home. They tried calling my daughter at the location she is staying, but she is not allowed calls from non-family members and has nothing whatsoever to do with opening or paying for the account. They've never even tried to call the number associated with my account (my mobile number.) From very satisfied to completely dismissed, worst customer service I've ever received! ASFAIK no refund of remaining balance either...\rUPDATE: forgot to mention I referred another customer who also opened an account!\r UPDATE 2/28/13: Pingo finally called me at the number associated with my account after reading my review here, thank you TrustPilot! After explaining the situation the account was restored in full, smiles again. My daughter called me using Pingo today and was very happy it was working again. I did tell the rep that if they cancel an account because they're suspicious the credit card number may have been stolen (apparent reason they cancelled) they should try to let the customer know there's a problem instead of sending an email saying \"sorry you cancelled.\" The phone service itself is excellent, but my student workers could give them a lesson in etiquette for customer service. The gentlemen I spoke with this morning was very polite, and my problem was resolved to my satisfaction, but he was unable to explain the failure to notify me the reason for cancellation, nor the lack of replies to my emails. Bumping from 1 to 3 stars, will bump again assuming no further problems. Suggestions: communicate directly when there's any hint of a problem with a customers card, (calling the number making the calls may not connect you to the account holder) allow reps on your toll-free number access to escalate to someone who can actually help, and lastly, a courtesy bonus credit to my account would have been appreciated after your communication issues basically cut-off communication for my daughter. I can be a very loyal customer, given the right circumstances..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "V SRINIVASAN",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T01:08:26.000Z",
          "Titre": "Call quality is variable."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Andrea",
          "Nb_Reviews": 5,
          "Date": "2023-07-19T19:06:25.000Z",
          "Titre": "Access numbers not working properly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Funmi Adewodu",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T12:43:56.000Z",
          "Titre": "It was easy to add tiny accounts",
          "Contenu": "It was easy to add tiny accounts. Thank you for making it easy to call my family back home. Keep up the good work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jayakumar Jeyaraj",
          "Nb_Reviews": 3,
          "Date": "2014-04-23T20:30:47.000Z",
          "Titre": "Smart! Fast!! Professional!!!",
          "Contenu": "I have been using Reliance calling card for more than 3 years and wanted to try few other products in market as Reliance was getting costlier as days goes by. After a breif ground work, I was interested in setting up an account with PINGO. The Account setup was so simple and no complex. it took not more than 3 minutes to Create, Verify, Authenticate and Approve. Above all, The customer service I received from PINGO was really really awesome. The turnaround time was not more than 20 minutes to address my query. This is really an amazing experience. I am delighted with PINGO's Customer service and response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "brando b",
          "Nb_Reviews": 1,
          "Date": "2012-02-12T20:07:59.000Z",
          "Titre": "wow",
          "Contenu": "hi, pingo is the best calling card ever.\rgreat rates , great customer service, i've been using pingo for more thatn two years, yeah sometimes a problem comes up here and there but over all, it is a great service, you go pingo."
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Sara",
          "Nb_Reviews": 1,
          "Date": "2012-03-23T20:19:42.000Z",
          "Titre": "Wonderful until now...",
          "Contenu": "I have had no issues while using Pingo for the past few years and neither have my parents. I suppose that it may be some technical issue on their end but the past I have successfully been able to make calls from Israel to the United States using the correct access code but it has not worked since I yesterday. I am able to access my account when I enter my account number and pin code, and am then able to dial the phone number in the US that I am trying to reach. The phone then rings but when someone answers on the other end, it cuts off and offers to let me make another call- apparently they can hear me but before they even finish saying \"hello\" we are cut off.\r  I am incredibly frustrated, and have even tried multiple ways, making sure that I enter the country code, city code, telephone number and then the pound key. I also tried with only the country code, city code and phone number, as well as only with the phone number and in each instance, the same problem occurred. Please let me know what I can do to resolve this as soon as is possible. My account number is 5188945451"
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Tom Bötsch",
          "Nb_Reviews": 1,
          "Date": "2013-07-25T19:37:37.000Z",
          "Titre": "after some original problems verifying my account, i was contacted by phone & my acct was enabled, the service works & i give it a thumbs up",
          "Contenu": "originally i had some issues getting verified & customer service did not respond, but after posting on trustpilot i was contacted directly by phone by a friendly representative & my account was enabled plus an extra 5$ for the trouble. I used the service right away & must say, it works well, thank you pingo, you have just earned a repeat customer!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROMESH WIJESURIYA",
          "Nb_Reviews": 3,
          "Date": "2023-03-18T18:01:20.000Z",
          "Titre": "ease of use",
          "Contenu": "ease of use, to call, cost for international call is really good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ROMESH WIJESURIYA",
          "Nb_Reviews": 3,
          "Date": "2022-12-04T02:49:01.000Z",
          "Titre": "easy to recharge",
          "Contenu": "easy to recharge , and call quality is pretty decent used for overseas calls to sri lanka , price also is good"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kwa",
          "Nb_Reviews": 1,
          "Date": "2021-12-27T10:46:15.000Z",
          "Titre": "Good service but a little bit expensive…",
          "Contenu": "Good service but a little bit expensive to the country that I call to."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TSC",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T03:54:54.000Z",
          "Titre": "It is a good value but call quality is…",
          "Contenu": "It is a good value but call quality is lacking some times"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "wayne lazarus",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T18:45:51.000Z",
          "Titre": "good service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "avi vardi",
          "Nb_Reviews": 2,
          "Date": "2021-11-25T13:38:12.000Z",
          "Titre": "Service works pretty well",
          "Contenu": "Service works pretty well, most of the time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wayne lazarus",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T03:21:35.000Z",
          "Titre": "o,k service",
          "Contenu": "o,k. service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elma Kenefsky",
          "Nb_Reviews": 6,
          "Date": "2023-09-13T20:53:26.000Z",
          "Titre": "I have been using Pingo for 5 years and…",
          "Contenu": "I have been using Pingo for 5 years and it has been a huge help in keeping in touch with my family and friends.  I use it at least once a week and the lines are always so clear, never had a problem with the quality of the line."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gopendra",
          "Nb_Reviews": 3,
          "Date": "2021-11-19T11:27:17.000Z",
          "Titre": "Call quality",
          "Contenu": "Except for occasional drop calls, service pretty consistently good. All my calls are India calls, it could be cheaper. Special offers are not as inviting as they used to be, noticeably. Dollar amounts for reloading should be any amount, not $50 and above. This minor disappointment . Overall, I’m pleased"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RK",
          "Nb_Reviews": 1,
          "Date": "2018-04-12T18:06:00.000Z",
          "Titre": "I start using Pingo 10 years ago",
          "Contenu": "I start using Pingo 10 years ago, my line of work takes me all around the globe and  I always keep several calling options available, I use prepaid phone cards, Magic-jack, VoIP and Wifi.  One service provider that never fail me is Pingo, Best in service, voice quality, access numbers and price.   .  Loyal customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric S.",
          "Nb_Reviews": 2,
          "Date": "2011-07-23T11:04:02.000Z",
          "Titre": "New client: Calling from my cellphone in the US to Cellphone in Paris France",
          "Contenu": "My girlfriend is in Paris, France for a month and after spending almost $400 with AT&T I started investigating alternatives. I tried \"Pennytalk\" a complete joke and Skype which is fine if your near your PC. I am calling cellphone to cellphone both AT&T US (CA) cellphone numbers. The first phone call went through without a hitch and subsequent phone calls were better then my providers! I read the bad reviews and can't understand what the problem is? This is a first rate stand up company that I will recommend to all my friends!\r Eric S, Palo Alto, California"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "P Rosson",
          "Nb_Reviews": 1,
          "Date": "2019-02-12T20:54:24.000Z",
          "Titre": "Pingo Lingo Tango Congo ... Pingo!",
          "Contenu": "Dear Pingo Fans, I have been Pingo fan/user for a long time. Pingo product is consistently extraordinary, and its service, persistently excellent! I am a consumerist who is a huge fan of conscientious companies that offer quality products, and service. In other words, value and virtue. And Pingo offers both. If Pingo was a person, and often companies reflect the owners, or founders, and its team members, and I confidently say that Pingo is dependable, reliable, and honest. So, connect with Pingo and enjoy the exchange of talks. Instead of Love Always, recommend Pingo Always, Quinn R. A Proud Pingo Fan from San Antonio, TX"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phylis",
          "Nb_Reviews": 1,
          "Date": "2015-08-24T14:32:25.991Z",
          "Titre": "Access Number Malfunction",
          "Contenu": "I have been using pingo for a very long time and have never had problems with it. For some reason I've been trying to make an international call today and can't get past the access number. Normally I get the automated pingo welcome message but this time it's just ringing with no connection to my account at all.\r UPDATE:-\rI am re-writing this review since within minutes the system has been restored. That was very fast and very effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margaret Levine",
          "Nb_Reviews": 3,
          "Date": "2014-05-20T18:57:22.000Z",
          "Titre": "Pingo helps me stay connected with my friend in Egypt!",
          "Contenu": "I've been using Pingo for a few years now with no glitches until recently when suddenly I couldn't reach my friend's cell phone. I contacted them and Brian from the company emailed me right away and told me that the team was working on it. They continued to check things out and in the course of the next few weeks, my connection with my friend's cell phone was re-established. Consistent connection and clear billing procedures make Pingo a good choice for your overseas calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vijay Shah",
          "Nb_Reviews": 1,
          "Date": "2019-10-08T12:52:50.000Z",
          "Titre": "Stay away from this website to buy…sorry by mistake wrong website",
          "Contenu": "Stay away from this website to buy anything. I bought an item 3-4 days ago and so far I have not received any communication about when the item will be shipped. I did get email that order was received. I sent multiple emails about inquiring the status or when it will be shipped, but absolutely no response. I cannot recommend anyone to buy anything from this website.Update: my sincere apologies to pinto.com. I thought I had typed pingodepot.com. Please disregard my comments about pingo.com."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Harriet Silverman",
          "Nb_Reviews": 1,
          "Date": "2017-01-19T16:05:31.000Z",
          "Titre": "I highly recommend Pingo!",
          "Contenu": "Pingo is fabulous!  During the Christmas holidays we going to be out-of-state and I wasn’t sure if Pingo could be used from something other than my landline at home.  So at 8 am on 12/24/16, I sent off an email to Pingo customer support to find out.  Imagine my surprise when I rec’d a response within just a few hours, saying “Thank you for contacting Pingo. You can use a cell phone or a landline to place your phone calls. All you need is to set up an account and dial an access number.”  Fabulous customer service!  And yes, we made our call to Greece on Christmas morning with no problems at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erick",
          "Nb_Reviews": 1,
          "Date": "2018-10-12T21:10:36.000Z",
          "Titre": "Best international calling service !!",
          "Contenu": "I’ve been a Pingo customer for a long time. Have never received rude customer service from any of his representatives. Recently i had a problem with my account i called and everyone that i came in contact with while resolving the problem was very professional and courteous. Specially Brian he went above and beyond to make sure my problem was resolved. If I could give them 10 starts I would without hesitation! Pingo is the best calling service there is!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Mekenye",
          "Nb_Reviews": 1,
          "Date": "2021-11-30T19:21:56.000Z",
          "Titre": "I like whenever I load my minutes I…",
          "Contenu": "I like whenever I load my minutes I don’t have to kegive my entire information and it is quick.It is really easy to make international calls without dropping.I really don’t have any complains and Iam thankful that you are always there to lead minutes whenever ILoad."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ic",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T14:01:35.000Z",
          "Titre": "I've been a customer since 2015",
          "Contenu": "I've been a customer since 2015. I'm amazed at the level of attention Pingo has provided me. I sent an email reporting an issue to my destination. I got a quick response and personable attention. Jay did an awesome job explaining the steps that were taken to escalate my situation, he also followed up by calling me and sending an email with all the details. Small things like these makeup a great experience. For me finding a company with great customer service is a must. I don't care how \"great\" their service may be or how \"big\" the company is, if I feel that their customer service skills are not top notch I change companies in a heartbeat. This is the first time I reach out for help since I have Pingo and I'm glad to say that I'm not disappointed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Williams Lisenby",
          "Nb_Reviews": 1,
          "Date": "2014-09-05T17:13:37.000Z",
          "Titre": "PINGO is Great - why are reviews not reflecting this?",
          "Contenu": "I've been using PINGO for years and have NEVER had a problem.  The rates are great, the features they offer make using PINGO a sinch!  I just recently decided to download the PINGO EZ Dial software on my Iphone and now have the convenience of using my PINGO account on my cell phone and call France all the time for cheap.  If you're not using PINGO - you should honestly just give it a try...  I personally have not regretted doing so and I love the cheap rates!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Pauline",
          "Nb_Reviews": 2,
          "Date": "2023-02-27T21:02:17.000Z",
          "Titre": "Just Installed this App best peace of…",
          "Contenu": "Just Installed this App best peace of mind I have ever had I highly recommend this for parents who have concerns about there children’s whereabouts"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan Rocklin",
          "Nb_Reviews": 2,
          "Date": "2022-05-08T08:39:35.000Z",
          "Titre": "I am very, very happy 😊 with Pingo.",
          "Contenu": "I am very, very fond of Pingo. I have never had a bad connection over all these many.years I've used them, and I've ALWAYS had clear connections to my family in Europe and the volume of the distant party is perfect. My cost per minute is extremely reasonable. Pingo only takes money from my credit card when I make it happen."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hiran Alles",
          "Nb_Reviews": 1,
          "Date": "2013-11-18T19:42:32.000Z",
          "Titre": "Let's enjoy the reliability and calls provided to the world.",
          "Contenu": "I Love Pingo a lot, 100% Call Reliability and Quality, Keep up the Great Work. Improve the reliability and call quality. Other than that everything is perfect, make your rates cheapest and show a comparison like vs the leading competitiors. including Vonage. I make calls to Sri Lanka and the quality is outstanding. I would definitely recommend Pingo to anyone who likes to make International Phone Calls. Pingo is our trusted International Calling Card."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gloria Thomas",
          "Nb_Reviews": 1,
          "Date": "2017-03-30T03:19:13.000Z",
          "Titre": "PINGO is the best long distance …",
          "Contenu": "PINGO is the best long distance service. We only occasionally use long distance and didn't want to pay the high prices for Verizon or other companies to provide monthly long distance on our landline. PINGO is perfect for us - great customer service, low price calling and quick, responsive customer service when we've had a question. HIghest recommendation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Cummings",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T04:14:33.000Z",
          "Titre": "Easy to use - Good rates",
          "Contenu": "Easy to use from my cell phone which is main number for Pingo so don't have to input code. East=y to recharge as low as $5 at a time. No expiration unless no activity for 180 days. Good rates usually about 2 to 3 cents/minute."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tina Williams Lisenby",
          "Nb_Reviews": 1,
          "Date": "2013-05-09T19:28:03.000Z",
          "Titre": "Why so many complaints on this site about PINGO -  confused by what I am reading!",
          "Contenu": "I'm totally baffled by the complaints I'm reading about PINGO on this website!!  I have had wonderful service and the calling rates are incredible.  The system is super easy to use, quality of call is good and the website is user friendly.  I'm not one to leave reviews on-line but felt it necessary since there was such negative feedback that does not convey over to my personal experience.  I've used other internet calling card services but switched over to PINGO (because the rates were better) and haven't regretted doing so one bit.  I highly recommend setting up an account to take advantage of good the great rates they offer.  I'm a happy customer and just took advantage of a Mother's Day Sale they just offered which will amount to even more cost savings for me when I call my family overseas."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Farzana Mukadam",
          "Nb_Reviews": 1,
          "Date": "2015-09-09T17:39:22.817Z",
          "Titre": "Best Phone Cards...PINGO",
          "Contenu": "Friends I have been using Pingo service for nearly 7 years and been very satisfied, the deals are superb and cash savings too.\rI would any day recommend PINGO to my friends and family for effcient, quick and economical phone service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lorna Emond",
          "Nb_Reviews": 1,
          "Date": "2012-12-21T20:19:41.000Z",
          "Titre": "Saved me a lot of money in long distance phone calls",
          "Contenu": "I don't understand all the bad reviews.  I've had Pingo for years and found it to be very reliable and dependable.  If one is in an area that one can use a local access number, it's half the cost.  As far as I'm concerned, it is not a fraud company.  I even get emails from them offering 'specials' of 15%-25% which I take advantage of.  I prefer to spend pennies for minutes than a large sum at the end of the month with AT&T.  Most of the time, I use their toll free number, enter my account number, password, dial the 1 and 10 digit phone number of the person I'm calling and then press pound.  Call goes right through.  When I'm calling from home, my account and password are already recognized so I just dial the number I want."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chandra",
          "Nb_Reviews": 1,
          "Date": "2011-02-16T02:59:19.000Z",
          "Titre": "The best calling solution ever!",
          "Contenu": "I rarely write reviews, and part of the reason I am writing one for Pingo is that I am absolutely surprised by the bad reviews here. It just does not make sense to me. So, anyways, here is my Pingo story:\rI am in US since 2004 with close ties to India. Between 2004 and 2006, I must have tried at least 20 different calling cards and services for my calling needs to India. In 2006, I needed to call a European country where my fiancee moved at that time. Since my calling service from Reliance did not provide calling to countries other than India, I googled for calling cards and that's how I was introduced to Pingo. Long distance relations are difficult and I must say that cheap, and more importantly, absolutely reliable and convenient calling via Pingo did play a role in our relation. We got married and now are both in US and in the past 4 years we have used Pingo for all our international calling needs and we are absolutely satisfied by it. Thanks Pingo!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pilar Fadul",
          "Nb_Reviews": 1,
          "Date": "2017-01-16T16:04:27.000Z",
          "Titre": "Best customer service ever!!",
          "Contenu": "We encountered some issues with the calling, i emailed them and rcvd a response within the hour with a resolution.representative Brian Hawkins gave me a white glove service and we would highly recommend Pingo for your calling needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 3,
          "Date": "2014-08-08T22:33:11.000Z",
          "Titre": "Been using Pingo for many years with no problems.  It is GREAT",
          "Contenu": "I have had Pingo for at least 7 years and have been very happy with the service. Calling from States to Europe and Europe to the States is has been a great service.  Recently, I thought I had some calls made using my number and contacted them through email.  They did not email me but called me (with in 20mins) to make sure there was not a problem, there wasn't a problem. My Bad.  I would recommend this service with out hesitation to anybody who calls long distance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elma Kenefsky",
          "Nb_Reviews": 6,
          "Date": "2022-12-07T22:30:20.000Z",
          "Titre": "I was having problems because I moved…",
          "Contenu": "I was having problems because I moved and had no land line.  I have to use my cell phone for everything even my calls to the United Kingdom.  I got a call from a customer service lady who was so helpful and now I can call my family abroad on my mobile phone.  Well done Pingo !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2016-01-13T16:50:53.299Z",
          "Titre": "Wonderful Pingo marketing team",
          "Contenu": "They are very efficient, and thinking of their customer's needs, they have proved what a wonderful team they are. I am so happy to choose Pingo, I will keep doing business with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonina",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T23:09:21.000Z",
          "Titre": "Reliable",
          "Contenu": "I have been using PINGO for more than 10 years now. so far it is the most reliable experience for long distances calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Youngkrantz",
          "Nb_Reviews": 3,
          "Date": "2022-03-18T13:37:29.000Z",
          "Titre": "I have used Pingo for many years",
          "Contenu": "I have used Pingo for many years.  The calls are very good and inexpensive.  I would highly recommend using it.  I use a lot for calls to other countries because it is very inexpensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2022-08-29T19:22:15.000Z",
          "Titre": "Pingo is the Best",
          "Contenu": "I have used Pingo for over 12 years now and it has worked VERY well for me. I have relatives and friends who live outside the US that I can talk to for long times at low cost and great clarity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carmen Kerstens",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T22:36:45.000Z",
          "Titre": "This is by far the best international…",
          "Contenu": "This is by far the best international calling service that I have ever used.  So easy to call and so much time for your money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bianca",
          "Nb_Reviews": 1,
          "Date": "2011-01-24T17:20:26.000Z",
          "Titre": "So convenient",
          "Contenu": "I've been living in the US for 8 years now and used to try different phone cards, but Pingo is the best. Very convenient and reliable. I love how I can manage my account online. Pingo is easy to use, and the rates are great too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Lewis",
          "Nb_Reviews": 1,
          "Date": "2013-01-03T17:45:57.000Z",
          "Titre": "Pingo is reliable, DOES Respond to problems and my faith in this company is renewed.",
          "Contenu": "Pingo has worked well for us for a few months on three separante phone accounts and we have been really pleased with their calling system, ez-dial software and especially their rates and website.  BUT recently, a charge showed up from them on our bank account which we \"absolutely did not make\".  This charge was not credited to our Pingo account, it simply was charged to us and disappeared into their system. No problem, \"Pingo is great\", we thought.\r Well,  we made three calls to them to correct this and no relief, they denied it.   So, I wrote a scathing review here and made a chargeback at the bank.  Then, because my review appeared here where they monitor, upper management called me and helped me analyze the problem.  Guess what?  It was our fault!  Our son's account had the wrong card attached to it and the charge came from my wife's card and showed up in another. \rAnyway, it was OUR FAULT, like many (can't say if all) of these Pingo complaints here seem to be. \rThanks Pingo team for fixing this.  I much prefer to admit we screwed up and renew my confidence in the best long distance provider we've ever had"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elma Kenefsky",
          "Nb_Reviews": 6,
          "Date": "2023-05-17T20:00:56.000Z",
          "Titre": "Fast and dependable …",
          "Contenu": "I got through to my family in the north of England so fast.  The line was very clear and since we talk for over 30 minutes it had the same clarity when we said goodbye. I have been with Pingo for a number of years now and find it so dependable.  Love it !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sam Nkana",
          "Nb_Reviews": 5,
          "Date": "2013-11-25T18:44:52.000Z",
          "Titre": "The best, most reliable, and most economical method to reach out to families and friends!",
          "Contenu": "I have finally found the most reliable, user-friendly, cost-effective phone card company, and the name is Pingo. After spending more than 20 years using different phone cards to make local and international phone calls, the real phone card company finally stood up, and remains standing. I no longer cut my conversations short, and the desire to call my relatives has been at the peak. I even spoke to my mom in Nigeria today, and she said \"I knew I was going to hear from you within a few days.\" There was a time I went without calling for months. I love the promotions that come every so often.\rToday, I sent an email enquiring about a special promotion. Instead of an email response, I received a phone call from Brian Hawkins. That was a clincher for me. Brian explained so much to me, followed with an email to make sure I understood everything he stated over the phone. This is it for me and my family, PINGO, and no other. Are you looking for a company that offers the best system to connect with your loved ones and friends? There's none other than PINGO. Very rare do people find great company in today's world, but when you do, shout it out. Brian, than you for the wonderful work you did today, and Pingo, thank you for having a reliable company that gives customers peace of mind>"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chester",
          "Nb_Reviews": 6,
          "Date": "2023-10-02T21:44:45.000Z",
          "Titre": "This is a great service for calling…",
          "Contenu": "This is a great service for calling long distances! It is a quality service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B Vila",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T07:01:10.000Z",
          "Titre": "Great for international calling!",
          "Contenu": "Great rates, user-friendly website, excellent call quality, and reliable service.  What's not to like?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elma Kenefsky",
          "Nb_Reviews": 6,
          "Date": "2022-03-08T21:35:52.000Z",
          "Titre": "Keeping in touch with family!",
          "Contenu": "I still have loved ones in England and Scotland and it's wonderful that I can talk to them weekly.  No problems with line, always as clear as a local call.  I love Pingo!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Chandler",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T17:07:25.000Z",
          "Titre": "Apart from the odd occasion when our…",
          "Contenu": "Apart from the odd occasion when our designated numbers still request our pin # the service is second to none"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mohsin",
          "Nb_Reviews": 3,
          "Date": "2022-02-16T12:15:34.000Z",
          "Titre": "I am completely satisfied using Pingo…",
          "Contenu": "I am completely satisfied using Pingo for all my international calls since many years. Never experienced any problems with it. Just Perfect!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sophia",
          "Nb_Reviews": 15,
          "Date": "2023-10-01T05:51:11.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, it is vey easy to buy minutes and not expensive,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "miguel crespillo",
          "Nb_Reviews": 1,
          "Date": "2018-12-16T23:37:48.000Z",
          "Titre": "Excellent service in international…",
          "Contenu": "Excellent service in international phone calls.I have been using Pingo service since 2013 and based on my experience I would recommend it with no doubts to my friends and relatives to use this awesome service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daisy Guevara",
          "Nb_Reviews": 3,
          "Date": "2019-03-06T15:42:10.000Z",
          "Titre": "Good customer service and fast solution",
          "Contenu": "I have been using Pingo for I don't know how many years and always with wonderful service. I had a problem a few days ago, but it was fixed promptly. Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Sterling",
          "Nb_Reviews": 3,
          "Date": "2021-11-24T21:36:27.000Z",
          "Titre": "Been a customer for a long time",
          "Contenu": "Been a customer for a long time. Obviously, very satisfied.Prices and ease of use are big selling point for me."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "david abban",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T23:45:15.000Z",
          "Titre": "great service",
          "Contenu": "been using Pingo services for over 15years and that length of usage speaks for itself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C.B.J",
          "Nb_Reviews": 2,
          "Date": "2021-11-15T14:18:04.000Z",
          "Titre": "Great service & very reliable!",
          "Contenu": "The service is very reliable. We're so glad that it solves our communication issues with the carribbean with reasonable rates."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sophia",
          "Nb_Reviews": 15,
          "Date": "2023-06-29T22:55:10.000Z",
          "Titre": "My experience with Pingo",
          "Contenu": "Very good service, efficient, good price.I would certainly recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "raymond pardoyl",
          "Nb_Reviews": 2,
          "Date": "2021-12-23T16:58:43.000Z",
          "Titre": "First rate & easy procedure to follow",
          "Contenu": "First rate & easy procedure to follow. Every procedure works perfectly.Plus excellent rates Definitely 5 star."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "russel thomas",
          "Nb_Reviews": 3,
          "Date": "2023-02-23T03:17:06.000Z",
          "Titre": "always time to talk",
          "Contenu": "No worry about running out of talking time.I have been using PINGO over 20 years. Illinois to ACCRA , GHANA."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharon Edwards",
          "Nb_Reviews": 3,
          "Date": "2022-08-18T18:08:52.000Z",
          "Titre": "Love using Pingo to keep in touch with…",
          "Contenu": "Love using Pingo to keep in touch with my family in the UK from the USA!Pricing is the best for long distance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A.Dogan",
          "Nb_Reviews": 2,
          "Date": "2023-08-10T23:38:52.000Z",
          "Titre": "very good service..",
          "Contenu": "very good service... so far I have not get any trouble with calling even long distance. Thnx"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wai Chuay Lum",
          "Nb_Reviews": 3,
          "Date": "2023-03-19T03:34:26.000Z",
          "Titre": "Excellent International Call Service",
          "Contenu": "Easy to top up, no nonsense online international call service. Would recommend to someone."
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Zamina",
          "Nb_Reviews": 4,
          "Date": "2023-01-02T02:40:03.000Z",
          "Titre": "Calls are clear and no interference",
          "Contenu": "Calls are clear and no interference.  Wish it was cheaper per minute."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ling he",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T18:03:37.000Z",
          "Titre": "Love Pingo 🥰",
          "Contenu": "Always reliable service on connections, good price too. I love Pingo 🥰"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pauline",
          "Nb_Reviews": 2,
          "Date": "2023-08-11T18:26:30.000Z",
          "Titre": "Excellent service with professional…",
          "Contenu": "Excellent service with professional staff always ready to assist to meet our needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elma Kenefsky",
          "Nb_Reviews": 6,
          "Date": "2021-12-04T21:46:18.000Z",
          "Titre": "I have never had a problem with Pingo",
          "Contenu": "I have never had a problem with Pingo.  I love that I can pick up the phone and can talk to my brother in Scotland within a minute or so.  Love it!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Published Author",
          "Nb_Reviews": 2,
          "Date": "2021-11-13T19:13:34.000Z",
          "Titre": "I use Pingo for many years and fully…",
          "Contenu": "I use Pingo for many years and fully satisfied with my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Fitzpatrick",
          "Nb_Reviews": 3,
          "Date": "2021-12-09T22:14:33.000Z",
          "Titre": "Easy to use Use to reach friends all…",
          "Contenu": "Easy to use Use to reach friends all over world who are not tech savvy. Connection super fast and great sound"
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "MIGUEL",
          "Nb_Reviews": 3,
          "Date": "2023-10-17T14:33:03.000Z",
          "Titre": "Excellent app",
          "Contenu": "Excellent app. Good service and most important the best domestic and international calling prices."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sophia",
          "Nb_Reviews": 15,
          "Date": "2022-09-04T17:02:04.000Z",
          "Titre": "Excellent service; good",
          "Contenu": "Excellent service; good value for money; easy to reload"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "george edukala",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T01:56:20.000Z",
          "Titre": "Good service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary Balloqui",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T01:08:46.000Z",
          "Titre": "simple to use and saves me money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela Brown",
          "Nb_Reviews": 2,
          "Date": "2022-12-04T19:01:38.000Z",
          "Titre": "Clear connection",
          "Contenu": "Clear connection that doesn't drop to Cameroon, cell to cell."
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Jan Khor",
          "Nb_Reviews": 1,
          "Date": "2012-04-26T03:02:21.000Z",
          "Titre": "Love it!",
          "Contenu": "I love their softphone, speed dial and PINless features. Very cheap rates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A B",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T12:19:34.000Z",
          "Titre": "Great app",
          "Contenu": "Easy to use and it synchronizes with the contacts on the phone"
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Roslein",
          "Nb_Reviews": 6,
          "Date": "2021-11-20T16:34:30.000Z",
          "Titre": "Good pick for international call",
          "Contenu": "I like the stable connection with reasonable price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Gordon",
          "Nb_Reviews": 3,
          "Date": "2022-06-27T21:08:53.000Z",
          "Titre": "Easy to use - good connections",
          "Contenu": "Easy to use - good connection. Reasonable rates"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yebio Woldemariam",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T04:52:01.000Z",
          "Titre": "have no problem using Pingo",
          "Contenu": "have no problem using Pingo, none!Thank You"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wai Chuay Lum",
          "Nb_Reviews": 3,
          "Date": "2022-03-17T00:18:24.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to use, reliable and money saving for international long distance calls."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Seyed Hashemi",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T15:41:51.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent , I am happy with PingoSo easy to make a call .."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sophia",
          "Nb_Reviews": 15,
          "Date": "2022-03-25T21:19:19.000Z",
          "Titre": "Very good service",
          "Contenu": "Very good service, reliable. Very easy to easy to add money"
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "MIGUEL",
          "Nb_Reviews": 3,
          "Date": "2022-03-27T13:09:35.000Z",
          "Titre": "EXCELLENT SERVICE FOR U.S",
          "Contenu": "EXCELLENT SERVICE FOR U.S. TO CENTRAL AMERICA AND INTERNATIONAL CALLING THE BEST!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Swiss Guy",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T16:20:30.000Z",
          "Titre": "Excellent & Reliable Service",
          "Contenu": "For years, Pingo has provided reliable service on international calls."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sophia",
          "Nb_Reviews": 15,
          "Date": "2022-12-15T22:00:32.000Z",
          "Titre": "Very good service",
          "Contenu": "Very easy to use, reliable, good price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C.B.J",
          "Nb_Reviews": 2,
          "Date": "2022-03-08T16:05:18.000Z",
          "Titre": "Always been able to count on their…",
          "Contenu": "Always been able to count on their service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fenicia Ordonez",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T19:16:59.000Z",
          "Titre": "The ease of the addition of phone…",
          "Contenu": "The ease of the addition of phone minutes."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Sophia",
          "Nb_Reviews": 15,
          "Date": "2021-11-12T19:45:24.000Z",
          "Titre": "It works well",
          "Contenu": "It works well. It's very easy to add money.Very good service overall"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wai Chuay Lum",
          "Nb_Reviews": 3,
          "Date": "2022-08-02T20:57:04.000Z",
          "Titre": "Not Bad",
          "Contenu": "Reliable and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shyam Mansukhani",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T16:11:11.000Z",
          "Titre": "Very good",
          "Contenu": "I am satisfied with Pingo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A.Dogan",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T00:28:27.000Z",
          "Titre": "I am very satisfied...."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "colin",
          "Nb_Reviews": 9,
          "Date": "2023-10-26T18:04:50.000Z",
          "Titre": "Simple and straightforward service",
          "Contenu": "Simple and straightforward service. Competitive rates."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:38:54.000Z",
          "Titre": "Great service",
          "Contenu": "Very clear connection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Johnson",
          "Nb_Reviews": 2,
          "Date": "2021-12-07T14:27:07.000Z",
          "Titre": "They are the best",
          "Contenu": "They are the best .  never a problem they are so good ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ratana prangthong",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T17:23:19.000Z",
          "Titre": "It's been great using Pingo for many…",
          "Contenu": "It's been great using Pingo for many years now."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "george edukala",
          "Nb_Reviews": 3,
          "Date": "2023-07-08T15:39:18.000Z",
          "Titre": "Very good advice"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EWA IWANSKA",
          "Nb_Reviews": 1,
          "Date": "2022-03-19T01:45:15.000Z",
          "Titre": "Never have a problem with connecting",
          "Contenu": "Never have a problem with connecting, good audibility without interruption."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HOSAKERE ANANTH",
          "Nb_Reviews": 1,
          "Date": "2021-11-28T15:32:27.000Z",
          "Titre": "Works well for India calls!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tribhuban Choudhary",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T15:00:04.000Z",
          "Titre": "It's efficient and less expensive"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramesh Wadhwani",
          "Nb_Reviews": 2,
          "Date": "2022-06-10T22:18:42.000Z",
          "Titre": "most easiet international dialing…",
          "Contenu": "most easiet international dialing system on the go"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Raymond  Carlson",
          "Nb_Reviews": 1,
          "Date": "2022-01-09T04:18:44.000Z",
          "Titre": "You make my life easier 🤙"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 2,
          "Date": "2022-07-03T19:17:09.000Z",
          "Titre": "Great service all the time."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Roslein",
          "Nb_Reviews": 6,
          "Date": "2023-11-03T01:45:18.000Z",
          "Titre": "Good service",
          "Contenu": "Easy to handle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Johnson",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T22:45:54.000Z",
          "Titre": "they do a great job"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Margarete Moore",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T20:54:33.000Z",
          "Titre": "The rates are great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Natarajan Raman",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:51:55.000Z",
          "Titre": "Quick resolution."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 4,
          "Date": "2022-06-09T19:04:21.000Z",
          "Titre": "Great all the time"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ramesh Wadhwani",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T18:57:32.000Z",
          "Titre": "Convenience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sunday Ntiejumokwu",
          "Nb_Reviews": 1,
          "Date": "2022-08-04T00:17:17.000Z",
          "Titre": "Very reliable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Edionwe",
          "Nb_Reviews": 1,
          "Date": "2022-06-20T05:37:03.000Z",
          "Titre": "Satisfactory"
        }
      ]
    }
  ]
}