{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "plainlylegal.com",
      "Review": [
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Valerie",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T17:34:12.000Z",
          "Titre": "I would like some examples for some of…",
          "Contenu": "I would like some examples for some of the answers when using the generator. It is a very user friendly device. I will use it and recommend it to others"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diana A.",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T20:12:29.000Z",
          "Titre": "It's an upgrade for sure.",
          "Contenu": "It's good a good UI and a nice selection of agreements to choose from. Definitely an enhancement to regular templates!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:08:32.000Z",
          "Titre": "The site was very easy to use and had…",
          "Contenu": "The site was very easy to use and had all of the documents I was looking for!  Well worth the cost of the subscription"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T20:54:05.000Z",
          "Titre": "Amazing product",
          "Contenu": "Amazing product! Saved me so much time and has everything you need! Highly recommend Plainly Legal"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T18:40:40.000Z",
          "Titre": "Peace of mind",
          "Contenu": "As a new business owner, one of the worries in the back of my mind are the legal issues. Plainly Legal takes that worry away! By using the generator, I can produce agreements as needed on my own with confidence. The agreements are simple to use, and the legaleze isn't a hindrance. Using the agreements, helps both me as the business owner, and the other party be sure that our legal needs are covered. Can't recommend highly enough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 2,
          "Date": "2023-10-26T05:53:12.000Z",
          "Titre": "What a variety of legal forms!",
          "Contenu": "Plainly Legal has a big variety of ready to customize legal forms for many different situations within your business! The customization is super easy and quick. They are constantly adding new forms, making Plainly Legal a must have for your business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duc Le",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T23:04:00.000Z",
          "Titre": "PlainlyLegal is great for new entrepreneurs",
          "Contenu": "The quality of support is excellent. I get immediate replies to my queries within 24 hours. I love the auto fill templates for the most commonly used contracts for new small businesses. I trust Bobby cause his contracts are clear, concise, and the dude is from Harvard Law school. Cmon. The problems solved is my need for high quality contracts that are cost effective for my business to prevent me losing a lot more in a poor outcome business relationship."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T23:07:50.000Z",
          "Titre": "A MUST have for online business owners!",
          "Contenu": "LOVE Plainly Legal! As soon as I had access I was able to quickly create legal documents to protect my business! Super easy to use with flexibility yet created by a Harvard lawyer! Best thing is they aren't generic agreements that you find on the internet and retype yourself! These are specifically geared toward online business owners AND all you need to do is answer some basic questions and it's like magic. Agreements are created! You can even adjust them if needed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Winn",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T00:44:35.000Z",
          "Titre": "I am typically uncomfortable with legal…",
          "Contenu": "I am typically uncomfortable with legal templates - to the extent that I avoid dealing with them. Bobby makes it clear and easy. It's a low-stress experience! Actually, I feel curious and capable when it comes to his forms, especially his new system of generating legal documents. Something I never imagined I would feel or say! I trust him and anything he puts out. He's real, approachable, and emanates integrity."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Marci",
          "Nb_Reviews": 2,
          "Date": "2023-09-23T00:36:33.000Z",
          "Titre": "Useful even if you live/work overseas",
          "Contenu": "I've been using and recommending Bobby Klinck's templates to my clients for several years, but the new Legal Doc Generator is easier to use. I like how, in the process of generating the doc, you can read why each section is important, and the explanations are understandable. After the doc is generated, I can download it either as a PDF or copy the text. Being able to copy and paste is crucial for me because my business is in Japan, and I always need to adjust a few lines. Having these docs as a foundation saves me so much time!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T05:18:43.000Z",
          "Titre": "A must-have tool for small business owners",
          "Contenu": "Bobby and the team at Plainly Legal have thought of everything and then some to help small business owners smoothly and easily navigate the oftentimes daunting legal side of things. This tool is a must have for new and between business owners, not only because of the ease with which to get questions answered and documents generated for an affordable price, but also because Bobby and the team really truly do have your interests at heart. This is one of the few companies I have worked with that have crystal clear values. You’re not just getting legal help, but also honesty, integrity, transparency, and a sense of fun. They managed to make legal stuff fun!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie Lynn",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T22:25:30.000Z",
          "Titre": "Plainly Legal gives me peace of mind!",
          "Contenu": "Plainly Legal gives me peace of mind in my business and takes one of the biggest, scariest tasks on my to-do list and wipes it out.The amazing thing is that as simple as the legal stuff has become it’s not a one-size-fits-all, cookie-cutter experience. I get high-quality, trusted legal help in my business that’s tailored for my business and what I do. I loved Bobby Klinck’s template library and have used his contracts for years and now Plainly Legal is a serious upgrade for me and my business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Honey",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T07:33:52.000Z",
          "Titre": "Plainly Legal is a Game Changer",
          "Contenu": "I've been part of the test group for Plainly Legal. The digital legal generator is going to be a game changer. You can have a legal document generated in minutes and have peace of mind that your business is protected. It's easy to use and the feedback options are like no other. They also have quick response times. Thank you for making my business plainly legal!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Suzan",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T11:31:17.000Z",
          "Titre": "I can trust that my business is protected",
          "Contenu": "The system is so easy to use, but more than that... the focus and intention to make sure it works well and continuously improve it helps me trust that my business and I will be legally protected. I especially appreciate the way I can edit agreements to fit my needs. That flexibility is essential for my business."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Scott Baldwin",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:40:40.000Z",
          "Titre": "International customers can also use Plainly Legal.",
          "Contenu": "Bobby Klinck and team have innovated the legal steps for online business owners like no other. Plainly Legal is proving to be a fast response service and I trust them because of their focus on legal issues for online business owners. While I do not provide legal services myself, it's good to know what I need for my own business is available with an intuitive, feature-rich set of online legal templates that users with a minimum amount of technical aptitude can handle. Being outside of the United States, I may need to run certain document drafts past my own lawyer from time-to-time, but that will be the exception more than the rule. Most of the conversions for Canadian law will be more about re-naming comparable U.S. legal departments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa Greaves Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:22:40.000Z",
          "Titre": "Convenient way to create all kinds of biz contracts!",
          "Contenu": "I have been part of the beta program, and am impressed with Bobby and his team's dedication to ironing out any kinks and getting it working as optimally as possible before rolling it out. Stellar job. This platform is a super helpful way to create contracts in a jiffy! Definitely and highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JEN LIDDY",
          "Nb_Reviews": 3,
          "Date": "2023-09-11T15:54:48.000Z",
          "Titre": "The Plainly Legal team thought of…",
          "Contenu": "The Plainly Legal team thought of everything......so you don't have to. The software is fast & intuitive, and the team is highly engaged, answering questions with clear responses. I HIGHLY recommend using Plainly Legal for your business!~Jen Liddy, Content & Copy Strategist"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T19:02:41.000Z",
          "Titre": "A must-have resource",
          "Contenu": "I couldn’t imagine an easier way to manage the legal aspects of my business. I’m sure I’ll still need a lawyer occasionally, but Plainly Legal is saving me tens of thousands of dollars in the meantime and allowing me to protect my business at a level I couldn’t afford any other way. It’s an absolute must-have if you’re running an online business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Williams",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T22:46:51.000Z",
          "Titre": "I'm THRILLED that I found Plainly Legal",
          "Contenu": "I am in the very early stages of starting my business. I have heard some of the horror stories of people who haven't protected themselves with legal documents, agreements, etc., and I thought protecting myself was out of reach. Until I found Plainly Legal. Not only did Plainly Legal make it SIMPLE for me to create documents and agreements with their library of templates, but it also gave me templates to use to protect areas of my business that I had not even considered. I mean, I had never thought of having my podcast guests sign a podcast waiver, or to ask for an agreement for clients who offer testimonials.I feel much more comfortable that I am legally protected in my new business. Just like car insurance, I hope I never NEED legal protection, but I'm glad I have it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patty Block",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:57:27.000Z",
          "Titre": "Save time, hassle, and money!",
          "Contenu": "Plainly Legal is a great system for developing legal agreements, without the hassle and expense of hiring a lawyer. Bobby Klinck, a Harvard lawyer, is the brains behind the platform, so I trust the outcomes. Plainly Legal has been a game-changer for my business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T01:59:47.000Z",
          "Titre": "Hoping you don't get sued is not a legal strategy",
          "Contenu": "I have used Bobby Klinck's legal templates for over a year, so when the Plainly Legal software was offered to me as a tester, I was in. First, Bobby and his team are top-notch and I knew from past experience that this was going to be something awesome. I have not been disappointed. The Legal Document Generator makes creating legal documents that you MUST have as an online business owner so easy, customizable, and time-saving. And I didn't have to spend hundreds of dollars hiring a lawyer when I learned I needed another legal document that I didn't have. For years, I was doing it the wrong way, praying that something wouldn't go wrong. Now, I know I'm protecting myself and my business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Carolyn Trasko, PhD, LCSW",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:22:48.000Z",
          "Titre": "Plainly Legal is my #1 \"go-to\" resource",
          "Contenu": "Plainly Legal is my #1 \"go-to\" resource to help me customize and create the contracts and agreements that I need to run my small business. Legal stuff can be truly overwhelming to me, but the Plainly Legal process makes it easy and as stress-free as possible!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerry",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T19:27:33.000Z",
          "Titre": "An Awesome and Inspiring Journey...",
          "Contenu": "Bobby and his team have been nothing short of outstanding! From the very first kick-off session through every call we have had thus far has been professional, informative, helpful, supportive, insightful, humbling, exciting, hopeful, positive, punctual, and the list goes on! It's clear that Bobby and his team are very passionate about what they are creating."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Christine Bagnall",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T02:30:14.000Z",
          "Titre": "Legal stuff that doesn’t suck!",
          "Contenu": "Bobby makes legal stuff suck so much less! Plainly legal is amazing, streamlined, customisable,and easy to use to make sure my business is covered. Would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T23:50:18.000Z",
          "Titre": "I’ve used Bobby Klinck’s templates for…",
          "Contenu": "I’ve used Bobby Klinck’s templates for three years. They are excellent. Plainly Legal makes them even better with the easy to use customization and complex legal terms defined at the click of a button."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Ames",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:10:03.000Z",
          "Titre": "I'd give SIX stars (if I could) for Bobby Klinck's Plainly Legal",
          "Contenu": "Because online businesses need ongoing legal protection, Plainly Legal is THE software platform to provide that without waiting days or weeks for an attorney's attention or paying huge legal fees. As a long-time user of Bobby Klinck's legal template library, I know that the legal know-how baked into this platform is trustworthy. As a busy online business owner, I greatly appreciate the ability to, for example, whip up a legal agreement very quickly and get it out into the world to protect my programs, my customers, and me. The whole package is extremely well thought-out and expertly designed and delivered. And the support from Bobby's small but very mighty team is always timely and friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T23:53:52.000Z",
          "Titre": "Plainly Legal is awesome!!",
          "Contenu": "Plainly Legal is a great way to create legal forms for an online business. I can have a customized form created quickly! The forms are thorough and detailed. There are a wide variety of forms to select from. They are receptive to feedback, refreshing in today’s world. Try it and you will be pleased!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda Meller",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T00:40:15.000Z",
          "Titre": "Great legal templates for coaches like me!",
          "Contenu": "Plainly Legal has a great library of legal templates that I use every day in my business as an online coach. I recommend it to fellow coaches all the time. Bobby and team have a wealth of knowledge for this kind of stuff, so I don't have to do Google searches and keep my fingers crossed on what I find. It's an investment I've made that is well worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Winston Faircloth",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:06:22.000Z",
          "Titre": "Finally - legal help for coaches & consultants",
          "Contenu": "Intimidated by legal jargon, contracts and those exorbitant fees — just to make sure your business has agreements in place to protect yourself? Finally, there is a solution. PlainlyLegal combines proven legal templates, with intuitive self-service options and the most customer friendly team in the business to help small businesses navigate the kinds of legal agreements and protections needed to protect your coaching and consulting practice.  I have been looking for this kind of legal service for years and now it is finally here. Affordable Intuitive. Amazing.  So glad I have this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheryl Kennedy Coe",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T19:32:39.000Z",
          "Titre": "Smart Service, Great Team!",
          "Contenu": "This is a smart service that is always adding more value, based on feedback from it's community. I could not be more grateful for the whole team. Perfect for entrepreneurs with expertise to share."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TD",
          "Nb_Reviews": 2,
          "Date": "2023-09-20T20:03:29.000Z",
          "Titre": "Grateful for Plainly Legal",
          "Contenu": "Grateful for Plainly Legal!  As someone who has my business as a side gig (for now), I have very limited time to do anything related to my business.  Plainly Legal takes so much of the legal \"work\" off my plate and puts everything in an easy to use, easy to edit format.  I'm so grateful to have this tool as I grow my business!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Tugender",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T03:20:21.000Z",
          "Titre": "PlainlyLegal is so simple to use and quick!",
          "Contenu": "PlainlyLegal is so simple to use and so quick! It is the fastest legal document generator I've ever used and is helping me propel my team forward confidently and with record speed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T22:25:55.000Z",
          "Titre": "A one stop solution",
          "Contenu": "It is great having at any time a legal paper just at your fingertips—no need to schedule an appointment with a lawyer, which saves time and money. Building an online business, it's impressive what all to consider on the legal side. It is amazing to have information on what's needed and customizable legal agreements in one program. And when getting a new client, creating a new offer or program, even a new business, need a new agreement for a contractor, affiliate, testimonial, you name it, I like that I just have to log in Plainly Legal to get all I need."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashlene",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T00:59:41.000Z",
          "Titre": "Plainly Legal makes it so easy to…",
          "Contenu": "Plainly Legal makes it so easy to generate legal docs. Now I can create new products, courses or services and quickly, easily and confidently generate the legal agreement for them"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "murcia27",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T20:47:41.000Z",
          "Titre": "It is so important to have legal…",
          "Contenu": "It is so important to have legal documentation that you could either add to your website for your business. I do fitness coaching online and this service has truly help me feel more secure doing business online."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Liz Hanson",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T19:29:12.000Z",
          "Titre": "No-Brainer Investment",
          "Contenu": "Plainly Legal was so user-friendly and made it easy and affordable to create legal contracts. I'm already counting the thousands I'll be saving with future contracts. A seriously no-brainer investment for any small business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T21:08:48.000Z",
          "Titre": "PlainlyLegal gives Legal a Good Name",
          "Contenu": "What PlainlyLegal has done is make the life of an online business owner so much easier when it comes to legal documentation. Highly recommended - no questions asked!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DENISE",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T23:59:17.000Z",
          "Titre": "I don't love legal but I love Plainly Legal…",
          "Contenu": "Plainly Legal provides great support, insight, and intelligent simplification of the necessary legal documentation for online businesses. Their weekly emails help provide education and humor that has raised my legal awareness.The founder, Bobby Klink, has first-hand experience and knowledge of safely and successfully running an online business. From Bobby to his staff, the scary parts of legal and legalese are tamed while allowing business owners to personalize legal documents to meet their business' needs and preferences."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donna Schwartz",
          "Nb_Reviews": 2,
          "Date": "2023-09-12T19:15:33.000Z",
          "Titre": "Plainly Legal is so simple to use",
          "Contenu": "Plainly Legal is so simple to use and all types of contracts are represented.Because I can have the flexibility to adjust each contract, I think this is very helpful for entrepreneurs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley B",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T21:23:46.000Z",
          "Titre": "Legal Stuff? Really? YES, and it's easy!",
          "Contenu": "A beta program for legal software?. Legal? Really? Any normal person might cringe at the thought, but I jumped at the chance when Bobby Klinck opened the beta doors of Plainly Legal. This software grew from his template library, which is a rock-solid product presented in an easy-to-understand manner. Bobby brings great credentials to the table but leaves pretension behind—there’s always a sense of fun surrounding him even as he underpromises and over-delivers. I dived into the beta testing and every feature I’ve worked with so far works as described and promises to be invaluable to me as a new business owner. His templates keep my website safe, and there’s a legal audit feature coming which will help me discover what I’m doing wrong and tell me exactly what I need to do to fix it. You can’t beat that! Bobby continues to develop contracts that allow me to move past the scary legal stuff and know that I’m covered to do what I love to do. Bobby and his team are always there to offer a friendly helping hand—I’ve even had email responses after business hours (but please—let them have their well-deserved time off). To be transparent, my questions were all due to my own ignorance, not any issues with the software. Everything I’ve experienced so far during beta testing supports my faith in Plainly Legal and what it can offer entrepreneurs in all niches.This is a 5-star company operated by 5-star people offering 5-star information!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kathy Clair-Hayes",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T23:21:07.000Z",
          "Titre": "This program is so easy to use",
          "Contenu": "This program is so easy to use!  You just need to plug in your relevant information and you are good to go.  Great information and support!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Celia V",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T02:55:00.000Z",
          "Titre": "Plainly Legal is a game-changer",
          "Contenu": "I enjoyed getting prompt responses from Bobbi Jo about any questions I had.  The team has been super responsive and very detail orientated with the experience and usability of Plainly Legal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deb Coman, Host SocialTrust",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T20:51:56.000Z",
          "Titre": "Legal Resources You Can Trust!",
          "Contenu": "As the host of the #SocialTrust Twitter chat, my content strategy and copywriting business is built on building trust, so I can only invest in legal resources and support from someone I fully trust to protect my business and my interests. That's why I'm a long-time member of Bobby Klinck's programs, including Plainly Legal, which is shaping up to be a truly extraordinary, comprehensive legal resource."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cathy",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T16:29:58.000Z",
          "Titre": "Easy and Accurate",
          "Contenu": "Plainly legal is easy to use and is the best way for business owners to create all the legal documents they need to run their online business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T00:53:33.000Z",
          "Titre": "The best for online business legal support!",
          "Contenu": "I love how they lead with transparency and are truly looking out for small, online businesses!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-10-14T00:41:25.000Z",
          "Titre": "Outstanding product",
          "Contenu": "Outstanding product from a highly committed team. Bravo and keep up the great work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sara S.",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T21:46:53.000Z",
          "Titre": "Worth Every Penny",
          "Contenu": "Plainly Legal makes complicated legal concepts needed for online business easy to understand, and provides easy to use templates for things an online business absolutely must have."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "customerDeDe J",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T01:03:33.000Z",
          "Titre": "Plainly legal is very easy to use",
          "Contenu": "Plainly legal is very easy to use. I love the variety it provides for so many documents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gene",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T18:41:18.000Z",
          "Titre": "You Won't Be Sorry; Here's Why",
          "Contenu": "I rarely write reviews for anything, but Plainly Legal is so important to my business I felt moved to tell others.Deep down, everybody knows that being in business carries legal risks.  But that's all we know.  We don't have a sense of what those risks are, exactly; or the ramifications of anything in the legal world.  (Except that we don't want to be sued!)  We don't even know what we don't know.  It nags at the back of our minds.But ignoring the spectre and hoping it will go away, or \"it'll never happen to me,\" is no kind of strategy.Big companies have whole legal departments.  Medium-sized businesses have a lawyer (or a firm) on retainer.  But *every* business, whether you're one person in a pick-up truck or a Fortune 500 corporation, needs legal support.  Here are some scenarios:- If you have clients or customers, don't you need contracts, agreements, terms of service?  A refund policy?  Or do you just hope you'll never have a dispute?- If you have employees or subcontractors, don't you need employment agreements, subcontract scope-of-work, confidentiality, and non-disclosure agreements?  Or is every employee going to be a match made in heaven?- If you have an online presence, like a website, don't you need a solid privacy policy, terms of use, and disclaimer?  Or do you just hope that privacy laws have bigger fish to fry and you'll go unnoticed?Those are just a few common things to think about. However, business owners aren't lawyers and we don't know what we don't know.  What aren't we thinking about?  What's not even on our radar?But lawyers are expensive.  They notoriously charge you just to pick up the phone and say hello.  So we decide to gamble.  \"Since we can't afford legal help,\" we think, \"maybe just hope we don't need it.\"  Bad strategy, but it feels like there's no choice.  Roll the dice.Plainly Legal solves a LOT of these problems.First, what it's not:  It's not a lawyer.  You can't pick up the phone and get a live person to give you legal advice.  It's also not a law firm.  You can't pick up the phone and have them react to a lawsuit on your behalf.  Those kinds of things, you'll still need representation.But Plainly Legal CAN help you keep things from ever getting to that point.  And that's the missing piece.  That's the need in the market that Plainly Legal saw; and they address it elegantly for service-businesses that're somewhere between Zero- and Full-Legal-Department.Plainly Legal is the brainchild of a Harvard-trained lawyer with credentials as long as your arm.  He's top-notch.  I know, like, and trust him with my complex business.  I feel like I'm in good hands.- Plainly Legal does a great job with contracts, agreements, releases, NDAs, privacy policies, disclaimers, terms of use, and just about anything else I've run into.  And they're adding more all the time.- Plainly Legal does a great job with guidance and knowledge in plain English to fill-in the gaps so you don't feel like there's so much you don't know.  There are explanations and analysis galore to help guide you through the Heart of Darkness that is the legal jungle.- Plainly Legal does a great job of helping you analyze the current legal stance of your business and then bolster the areas where your legal strategy might be weak or unaddressed.Being able to make full eye-contact with those three major areas, there's a level of comfort and peace-of-mind that comes over you.  It's as if you had the power of a law firm giving you sound guidance, but without the worry of hemorrhaging cash every time you pick up the phone.I can't praise Plainly Legal enough.  If you're operating a service business (not so much for retail or physical products), Plainly Legal is likely going to help you immeasurably.  If you're anything like me and my company, you'll be glad you have Plainly Legal on your side."
        }
      ]
    }
  ]
}