{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "pollfish.com",
      "Review": [
        {
          "Note": 1,
          "Pseudo": "anderson",
          "Nb_Reviews": 8,
          "Date": "2023-12-06T04:19:25.000Z",
          "Titre": "It's the worst of all",
          "Contenu": "It's the worst of allIt's the worst of all, you never pay, you complete the surveys and they always take you out with ridiculous excuses. It's just a waste of time. I've used it on several sites like dutchcorp, firefaucet, coinpayu, etc., I never received it, I never paid it, I just collected your data. When you go to do research and find pool fish, run away because you won't receive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JV",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T11:06:30.000Z",
          "Titre": "The data quality for my surveys is very low quality.",
          "Contenu": "The data quality for my surveys is very low, with many fake responses, and people just clicking on things, I wasted about $700."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Christian Ø.",
          "Nb_Reviews": 3,
          "Date": "2022-09-29T16:38:36.000Z",
          "Titre": "Survey filled out by bots",
          "Contenu": "We did a survey with Pollfish, and it seems most likely, that the answers were filled out by bots, and it is most definitely NOT by the target demographic.The open-ended answers are so ridiculous that it's actually laughable. Everything from toddler-level English to (and I'm not kidding) references to porn stars.Do NOT waste your time and money with this sham of a company. You will not be able to trust the results anyway. What a joke."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Suhail",
          "Nb_Reviews": 1,
          "Date": "2020-07-12T10:59:57.000Z",
          "Titre": "As of now my app users have completed 5…",
          "Contenu": "As of now my app users have completed 5 surveys but ecpm is showing when i contacted your team, they said its because of demographic surveys. so i have disabled demographic option and i have to see how it performs. I would again review it in future based on results. Another thing is your team responds super fast. I really liked that."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Frustrated User",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T21:04:09.000Z",
          "Titre": "I do not plan on using or recommending pollfish in the future.",
          "Contenu": "I reached out to customer service because my survey was taking more than a month to receive results, they weren't helpful. THREE months later I get my results and let them know I am unhappy with how long it took and they tell me I had to fix something in the survey and that would have given me a more accurate wait time. Very bad initial customer service. I do not plan on using or recommending pollfish in the future. My survey was geared towards the Latino population, it being a huge market in the US I would expect better and faster results. Over three months of waiting is not ideal in a fast moving world."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rahul",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T20:37:56.000Z",
          "Titre": "Pollfish is a scam | Their platform generates responses, not actual human being",
          "Contenu": "I am a researcher. I saw so many inconsistencies in the Survey results. I feel like their platform is a huge scam. Why do I feel very strongly that their platform is a scam? Just after my Survey went live, within 30 minutes, I got 45 of the total 100 responses I purchased. When I exported the responses in CSV(and read the responses, which didn't make sense at all), I saw that most of the responses were dated for tomorrow in the timestamp.   It's a waste of time and effort. I am totally disappointed by their product. I feel like it's a huge scam."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T17:52:57.000Z",
          "Titre": "I am forwarding a formal complaint I…",
          "Contenu": "I wont be using the service again. I made a formal complaint to Pollfish and no response to it so far from Customer Services, nor from any one at the company.  I got conflicting answers from CS Pollfish, Mike Kissen and Stephanie Johnson from Prodege. I requested a refund from Customer Services, they replied two weeks ago saying that they would process it.However, the week after I started to get constant and repetitive emails from Mrs Johnson telling me that they could upgrade my account to an elite plan for an additional 6K. I declined her offer various times, and told her about the refund being already processed. She told me that that was not possible because refunds can only be made in an 8-month window period. No evidence on this, the contract does not say so!! She said that the legal department had told her so, but she couldn't refer me to anyone from the legal department. Nor could she give documentation on this. In fact, I found no documentation on this on the Pollfish webpage. All lies!Since she was constantly bombarding me with emails, I asked her to stop and refer me to another representative.  Afterwards, she referred me to Mike Kissen, who unlike Mrs. Johnson said to me that my credits had expired. Hence Pollfish was doing me a favour, as apparently credits expire after some time. Again, conflicting information and lies.I asked Mr. Kissen for open documentation on all these clauses. He referred me to the terms of services (Researcher). But again I couldn't find any of the points that both Mr. Kissen and Mrs Johnson were talking about. Although I asked them to refer me to the specific clauses for keeping my money on hold, they didn't reply to my emails, which is quite surprising considering that I had been bombarded by emails from Mrs. Johnson to upgrade to an elite plan the day before. Nor did I get any response from any of the Pollfish representatives (Cs), nor from Customer Services.This is quite uncomfortable and unconventional in a respected polling company like I would like think that Pollfish is. I was very happy working with Pollfish in the past. However this was unacceptable.  I brought this issue to the Pollfish management and made a formal complaint, and no reply so far. My takeaway - the customer service from Pollfish and Prodege are willing to lie and give conflicting information just for the sake of keeping clients. No ethics nor principles are followed. DO NOT USE THIS COMPANY if you care about TRANSPARENCY and ETHICS."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tanuja",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T07:15:18.000Z",
          "Titre": "Spurious Responses at Best",
          "Contenu": "Ran a survey with screener question for a particular occupation and in the free form response received answers such as \"I don't know because I am not really x occupation\" and \"I use data scraping\". Calls into question the veracity of data and survey respondents."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-02T14:21:46.000Z",
          "Titre": "My user completed 1 survey but i didn't…",
          "Contenu": "My user completed 1 survey but i didn't get any revenue they said me they can solve it but they are solving my problem and not adding money to my revenue dashboard"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-24T16:42:20.000Z",
          "Titre": "It seemed the respondents' answers were…",
          "Contenu": "It seemed the respondents' answers were mostly fake/filled out to finish the survey and not give quality feedback"
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Aggeliki Kosmidou",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T11:00:25.000Z",
          "Titre": "Very low quality sample",
          "Contenu": "Very low quality sample. We even got a response time 1min 15sec for a 47 question questionnaire."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wade",
          "Nb_Reviews": 2,
          "Date": "2020-09-04T19:26:45.000Z",
          "Titre": "Total ripoff",
          "Contenu": "Total ripoff. You take surveys get points and they disappear the next day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren Watkins",
          "Nb_Reviews": 2,
          "Date": "2019-08-05T20:21:50.000Z",
          "Titre": "Pollfish is overly simplistic to the…",
          "Contenu": "Pollfish is overly simplistic to the point they cannot launch anything complex beyond basics. We integrated our survey via Survey Monkey - which went fine through Centiment (who I highly recommend, but we were trying out a cheaper option) - and it was declined within an hour. They said we had too many disqualifying questions in Survey Monkey, while we had no such questions. They couldn't troubleshoot it, and then held on to our money for a week without a proper refund. You get what you pay for with these guys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "esther madamidola",
          "Nb_Reviews": 2,
          "Date": "2019-05-17T16:36:28.000Z",
          "Titre": "Bad business practice",
          "Contenu": "I do their surveys through verydice.They hardly ever give promised rolls.I have completed a lot of their surveys without rewards.and no explanation. Unlike the other surveys available,there is no one to complain to except verydice customer service and they have no control over them.Time wasters."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "N.B",
          "Nb_Reviews": 17,
          "Date": "2017-07-18T12:22:20.000Z",
          "Titre": "Another disappointing survey company",
          "Contenu": "Another disappointing survey company, targeting professional survey takers rather than the general population to complete the surveys created on behalf of the companies who engage their services."
        },
        {
          "Note": 1,
          "Lieu": "MY",
          "Pseudo": "Zeina Issa",
          "Nb_Reviews": 1,
          "Date": "2022-03-29T05:39:00.000Z",
          "Titre": "Very Bad Customer Service"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Matthias",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T10:14:34.000Z",
          "Titre": "Variance in response rates & quality based on region",
          "Contenu": "Took a month to get 250 responses on my survey - the data kept getting cleaned whenever I thought it was close to finishing and would get reset. The responses we did get were also not useful, although this may have more to do with the limited local knowledge of the topic we were exploring (fantasy sports in Saudi Arabia). In general, was not satisfied with the service on this one occasion but have found them helpful in other markets (like the UAE)."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-22T12:48:55.000Z",
          "Titre": "Respondents felt fake",
          "Contenu": "The building of the survey was glitchy, but the chat folks were quick to resolve. The bigger problem is that the survey results were clearly people paid to respond. My survey only had 2 short open ended answers of 17 questions, and people were clearly randomly answering words not relevant to the question. I ran the same campaign on Facebook and spent less per response and got more honest respondents."
        },
        {
          "Note": 2,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T11:01:38.000Z",
          "Titre": "Quick results but users need to check…",
          "Contenu": "Quick results but users need to check several times what they expect. One of the reviewers told me to remove one of the questions that I would like to ask but later on they told me they cannot provide this information due to confidentiality. Misleading has enabled one customer but just for one time. I will not recommend this tool."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Emilie",
          "Nb_Reviews": 16,
          "Date": "2021-10-03T10:06:28.000Z",
          "Titre": "Not actually enough respondents on the…",
          "Contenu": "Not actually enough respondents on the platform as you claim.Charged me for 400 responses and said estimated completion time is 5 days. It's been weeks and there are still less than 200 responses."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kerrin McLaughlin",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T21:14:34.000Z",
          "Titre": "Data is mostly bad quality participants…",
          "Contenu": "Data is mostly bad quality participants but they have good customer support and will rerun the bad survey participants. I suggest you run at least one open ended question to catch people with non sensical answers."
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-10-02T02:42:41.000Z",
          "Titre": "Quality of respondents really need to…",
          "Contenu": "Quality of respondents really need to be improved significantly. Too many \"fakes\". Though I need to say the team is very very supportive! Customer agents, account managers are all awesome."
        },
        {
          "Note": 2,
          "Lieu": "LU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-30T12:26:28.000Z",
          "Titre": "Low quality",
          "Contenu": "+speed+support-quality of the sampleMany respondents only replied with one word or said something like “thank you for 10points”. I don’t know how they are awarded for responding but apparently they only do a minimum of effort to get “points”."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-24T14:52:39.000Z",
          "Titre": "Poor responses",
          "Contenu": "Overall, some of the responses were poor (e.g., people listing their job is “madonna”, or giving answers not related to the question)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Nick Gryga",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T21:10:27.000Z",
          "Titre": "Majority of the data was poor quality",
          "Contenu": "Majority of the data was poor quality. You could tell people were just answering questions randomly."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "RealCustomer",
          "Nb_Reviews": 1,
          "Date": "2020-12-04T14:35:01.000Z",
          "Titre": "The overall experience was great but....",
          "Contenu": "The overall experience was great, wouldn’t say the data I received was super helpful, but I think it was specific to my application."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Maria Victoria",
          "Nb_Reviews": 2,
          "Date": "2019-10-03T21:38:06.000Z",
          "Titre": "I don't believe they secure true…",
          "Contenu": "I don't believe they secure true candidates. My data seemed to all have been filled out by bots. I told them about my experience, and their answer was that I shouldn't have open-ended questions. By open-ended they mean anything that's not multiple choice. My question required a simple number as an answer and I had very canned Yes, No, Maybe answers. It made me not trust the validity of all other answers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Brond",
          "Nb_Reviews": 2,
          "Date": "2023-10-14T00:08:23.000Z",
          "Titre": "Easy to use but graphics presentation is poor",
          "Contenu": "Easy to use and help is very responsive. The graphic representations of the data are terrible and cannot be manipulated - rendering them useless for presentation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T08:03:04.000Z",
          "Titre": "Your poll didn’t finish in the time…",
          "Contenu": "Your poll didn’t finish in the time given. When I asked customer service why the said b/c I had open -ended questions. They couldn’t even give me a reliable number of which answer were solid and still a bunch came back as indecipherable. Overal I was disappointed."
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Mark Riffs",
          "Nb_Reviews": 6,
          "Date": "2021-05-04T11:43:20.000Z",
          "Titre": "Average",
          "Contenu": "Usually Pollfish works as it should be, but I wouldn´t trust them completely.  Sometimes after 100% decent answers are given, Pollfish declines your payment by reporting the site you came from that your answers were \"gibberish.\"This has happened to me more than once as well..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Trevor Justice",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T21:16:05.000Z",
          "Titre": "If you don't have a big list of customers to survey...",
          "Contenu": "For a new business that doesn't already have a big list of customers/followers/subscribers to survey, Pollfish is AWESOME. Not only can you survey people in your demographic. You can also ask \"screening questions\" to disqualify people who aren't in your psychographic, or aren't potential prospects for what you offer. And you can ask up to 15 questions at no extra cost.My one complaint is that some of my surveys have \"failed\" because of a low incidence rate. This can happen when you have 2 or 3 screening questions. The thing is, we pay an extra fee for each screening question. Since we are paying more, it seems to me that we are compensating Pollfish for that lower incidence rate. When a survey fails, we remove one of the screening questions, making the revised survey cost less. But any difference we are owed back (because we paid more for more screening questions) stays in our account as a credit for the future. It is not issued as a refund."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Anon.",
          "Nb_Reviews": 3,
          "Date": "2020-08-12T15:25:04.000Z",
          "Titre": "Some bad apples",
          "Contenu": "I had a few bad responses that made me doubt the credibility of the panel.Some answers were provided continuously in a copy-pasted manner or others were evidently bad. Made me feel somewhat cheated.Otherwise, I had some great answers, really valuable feedback."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "XW",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T21:16:28.000Z",
          "Titre": "Not bad",
          "Contenu": "I used Pollfish to collect data for a pilot test. To be honest, it's academic research needing some time to complete. A group of participants answered the questions randomly. The samples I bought could not service my research well. I suggest that marketing research with less than 10 questions could use Pollfish. It can finish the survey task in a very short time, and be convenient to collect the demographic information of the samples."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Daniel Forero",
          "Nb_Reviews": 1,
          "Date": "2020-10-12T17:37:25.000Z",
          "Titre": "* I had to discard about 20 responses…",
          "Contenu": "* I had to discard about 20 responses because people answered, \"pay me\" and took my survey as an opportunity to complain about Pollfish.* When I defined my sample it appeared to me that it would take 2 days to do the field but it actually took more than a week."
        },
        {
          "Note": 3,
          "Lieu": "VN",
          "Pseudo": "XXXXXXX",
          "Nb_Reviews": 1,
          "Date": "2021-10-06T16:13:09.000Z",
          "Titre": "very fast but the quality is not really…",
          "Contenu": "very fast but the quality is not really good, 5-10% of the responses gave just the same answer to every question so I had to delete them. But the customer support must be the best one I've ever experienced."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T14:20:39.000Z",
          "Titre": "Poor Quality",
          "Contenu": "Half the open ended answers were \"I don't know\" - these are not quality answers. If this is a paid survey the people who are answering should put in a little more effort into their answers."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "HNC",
          "Nb_Reviews": 12,
          "Date": "2023-03-09T00:46:47.000Z",
          "Titre": "Could be very opowerful with the right adjustments",
          "Contenu": "Liked: Helped me get statistical evidence on what is more appealing to the audience for my website. I showed multiple visual website drafts and different examples of content and the Pollfish community gave me stats to help me choose which website appearance to choose and also what content to put on it.Disliked:Can't load multiple videos for a question. I had to compile all the different videos in one video file, and I noticed a trend towards the audience choosing the first video as a favourite, even if I reverse the order. I feel like a lot of them see the first exhibit at the start of the video, then answer that it's their favourite, so they can make money faster, rather than viewing them all and giving a real opinion.I believe a lot of people are using their phone to use the app. And this is a problem when you need to upload a high-resolution image that needs to be in a desktop aspect ratio. Pollfish should also find a way to filter out all the people when answering as quickly as they can, to make money as quickly as they can. One way is to, encourage people creating the survey, to create answers that aren't relevant to the questions or thing to assess, to filter out the people that want to rush through it."
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T13:56:00.000Z",
          "Titre": "My opinion",
          "Contenu": "Hi! My survey has recently finished and I am really satisfied with Pollfish service. Customer service is very quick on its answer and also efficient. As well, I am impressed about Pollfish data quality system, it is something necessary to obtain representative information. However, every company always has something to improve. In my particular case, my survey took longer to achieve the quantity of responses that you had expected. Evenmore, I believe that is one of the most important part of a survey process to try it on a reduce part of your sample for knowing if you are doing the correct questions to achieve your goal, maybe this is a service you could also add for pollsters would get more accurate on what they are looking for and would be more satisfied with Pollfish. It would be really useful.I hope my review could help you.Best regards."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joseph Donnelly",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T21:08:16.000Z",
          "Titre": "Love the idea of pollfish - but too buggy.",
          "Contenu": "Love the idea of pollfish, but too many bugs/ glitches to work out. Currently, the cost (in time and headeache) outweighs the benefit:1. Export: the SPSS export will not work with Q Research (and still was pretty funky looking in a colleague's SPSS)2. Export: even the CSV file is odd. On the Individuals tab, for example, there are series of question/ answer choices in a merged cell in row 1 compared to s separate column for each like you would expect3. Export: even more basic, some cells in the CSV export are not usable. The cells would not add, etc. - something very odd about the formatting. 4. Image uploads. The tool would constantly get buggy with image uploads and either crash altogether, images would not update, etc.Combining all these issues, when trying to run a series of many surveys quickly and repetitively, Pollfish was just too much of a time suck and (sad, but true, literally just wasted lots of our time). We took our repeatable surveys for this ongoing project back to our main stream survey tool and a full service sample provider, for only a modest cost increase. We were sad it didn't work out, we really liked the idea of Pollfish, and we love the logo :-)"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Drimad Sadi",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T20:20:41.000Z",
          "Titre": "Yes for Qualitative; No for Quantitative.",
          "Contenu": "I don’t think that the platform is ready for all types of surveys. I’ve posted two surveys looking for help with my research questions (open-ended). They refunded me the first time ( things didn’t work as expected) and asked me to be more specific in targeting my audience; I did that; I worked with them on before they approved, still didn’t get what I was looking for. Ended up looking for a different way to collect answers. They have great customer service. A bottom line, and In my humble opinion based on my experience, if you have a general survey with questions about everyday matters with direct answers, then yes, if you are looking in a specific subject that requires participants to type responses and discuss, I prefer that you find a different platform. P.S; they will ask you to add more filters to your survey to target the audience; that will cost you more still, you will NOT get what you are looking for."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NYCZIP",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T16:55:20.000Z",
          "Titre": "Easy to navigate but response integrity monitoring should be improved",
          "Contenu": "We've been using Qualtrics and Gallup for some time now, but they are both quite expensive.  So, I gave Pollfish a try toward my academic research. Although Pollfish does not offer as many features as does Qualtrics, the navigation is intuitive and survey deployment was super smooth and fast.  We got the survey data collection with 150 participants completed within an hour!!!  Looking at the results, though, I do feel that there is room for improvement in Pollfish's response integrity monitoring algorithms.  We would had to exclude about 8% of the cases because the participants were clearly responding in a random manner (we check for internal consistency to identify these cases)--which is fine because this was just a pilot study...but that wouldn't have worked for us, had this been the actual study.  This has not happened to us with Qualtrics or Gallup, so we are a little disappointed."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-18T22:44:47.000Z",
          "Titre": "Difficult to program questionnaire",
          "Contenu": "Difficult to program questionnaire, especially with conditional jumps.  Frankly if there was  something else I'd use it"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-28T13:16:17.000Z",
          "Titre": "Average Rating",
          "Contenu": "I know this is beyond your control, but some the respondents to my survey are questionable.  Overall, I had a very good experience."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T08:57:37.000Z",
          "Titre": "Average to positive experience",
          "Contenu": "Does not deliver on time to complete the survey expectations, but easy to use."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "client",
          "Nb_Reviews": 3,
          "Date": "2020-09-30T23:13:09.000Z",
          "Titre": "Survey tool needs development and…",
          "Contenu": "Survey tool needs development and company needs to work more on their service"
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "client",
          "Nb_Reviews": 3,
          "Date": "2019-09-11T20:37:57.000Z",
          "Titre": "Good for data collection .. but ...",
          "Contenu": "We have collected a few surveys with pollfish. The main issue we have faced is the many rushed responses that we recieved. That means that the repondents were filling the surveys just for the sake of filling it. Choosing the same answer for all questions is an example. I recommend the website as they have a good team and user reach. However, there should be a solution to ensure the reliability of the responses that are provided for the customers."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kevan Oswald",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T20:04:28.000Z",
          "Titre": "Cheap and fast but....",
          "Contenu": "Cheap, Fast, and Simple.  However, as a researcher I end up tossing out a lot of bad responses on my third-party surveys (speeders, straight liners, responses to open ended questions that are nothing but random key strokes, etc.)  When you use it for third-party surveys, as I do most of the time, Pollfish can't credit you for these.  I understand why, but still, quality responses from their panel is one of the things they claim in their advertising.  Cheap and fast maybe, but not quality.  You can't be all three."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Katy B",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T03:55:01.000Z",
          "Titre": "Not all replies were real"
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-27T09:41:52.000Z",
          "Titre": "Efficient but expensive."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Pratap Gadgil",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T14:22:20.000Z",
          "Titre": "Quick, easy to use and launch your surveys",
          "Contenu": "Awesome product to quickly create and launch your survey across of wide audience.While the product is relatively economical, its price can still be optimised for countries like India, considering the extreme currency exchange."
        },
        {
          "Note": 4,
          "Lieu": "HU",
          "Pseudo": "Szabolcs Gál",
          "Nb_Reviews": 12,
          "Date": "2023-06-15T23:36:52.000Z",
          "Titre": "poifish experiences!  It rarely provides possible surveys…",
          "Contenu": "It rarely provides possible surveys based on the filled-in data.  Maybe there are few survey opportunities in Hungary?! Thank you in advance for your kind reply."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Amine",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T00:58:38.000Z",
          "Titre": "provides results very fast",
          "Contenu": "provides results very fast, and results are consistent. However ensure to enter the correct audience, the platform always selects the United States as default, which cost me one survey. Apart from that, great customer support, the agents answered all my questions and were awesome. I recommend!"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "Artur",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T21:20:09.000Z",
          "Titre": "Something good something bad",
          "Contenu": "That was nice.However I was promised to finish poll in 1 day, in fact 4 weeks.Customer service is good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Spencer White",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T23:50:33.000Z",
          "Titre": "Great service just one thing",
          "Contenu": "Very fast, efficient, and user-friendly which I appreciated. Prices were pretty rational too. Only complaint is that I definitely had some responses from people/robots that were copy and pasting words from a book or something in the text boxes and randomly pressing stuff. I don't think that was the company though, the others were pretty genuine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Epen",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T16:25:28.000Z",
          "Titre": "Overall, a solid platform",
          "Contenu": "Pros: The platform is so easy to use, your customer support is above and beyond, and I the results view makes it easy to look at data cuts in the tool. Additionally it seems that lately the data validation has gotten a lot better. Cons: There's no way to enter a customized survey intro without using a description question which counts towards your overall cost, and the more surveys we've run the slower the responses come back, making it an unreliable tool for us to use with clients because we can't accurately predict response times."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Angela",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T02:00:17.000Z",
          "Titre": "We'll be back",
          "Contenu": "The platform was really easy to use and build our own questionnaire to deliver the insights we were after.  We quickly found our respondents with a good strong sample size. Super easy, great insights, and affordable.  We will be doing it again next year."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Daniel Hall",
          "Nb_Reviews": 1,
          "Date": "2020-03-19T13:32:40.000Z",
          "Titre": "Good tools and great customer success…",
          "Contenu": "Good tools and great customer success team. I feel the actual survey tools need to be expanded a bit, for example, the type of questions that are allowed to be used (i.e. numeric open response, matrix, etc.) and the question logic. I am sure these are in development but they are a little bit limiting at the moment."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Savpals",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T12:04:42.000Z",
          "Titre": "Survey is very convenient for my…",
          "Contenu": "Survey is very convenient for my choices of samplesResults are almost ready to start making analysis Flexibility of questionnaire is very good but needs a little modification to be more  effective in terms of user experience"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Han Phay",
          "Nb_Reviews": 1,
          "Date": "2020-10-19T11:04:27.000Z",
          "Titre": "Simple and easy to use, although quite pricey.",
          "Contenu": "Good experience with Pollfish although it is relatively pricey. Estimated timeline for completion of my sample size was accurate, although there was a slight issue on the last respondent in the system. Reached out via Chat to the help team, and issue was resolved very fast.Recommended for those that need to carry out quantity type surveys on products or concepts. I had personally used it to validate some of my concerns about features in my tech startup."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike Young",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T18:00:11.000Z",
          "Titre": "Simple set-up, great results!",
          "Contenu": "The survey was super-simple to set up, and the results data was easy to navigate.  I particularly liked the include/exclude filtering options and ability to simply click on a value to isolate those specific results.One recommendation I have for the product would be to offer additional audience demographic criteria -- specifically geared toward the financial services industry (e.g., levels of investable assets, number of service providers used, work with an advisor (y/n))"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kasra",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T08:58:58.000Z",
          "Titre": "Having the feedback from people worldwide",
          "Contenu": "Having the feedback from people all around the world was a great experience."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "Yap",
          "Nb_Reviews": 1,
          "Date": "2021-10-03T08:07:49.000Z",
          "Titre": "Mia Connor",
          "Contenu": "Mia Connor, I am very grateful for your way of handling my issues. In this process, I did learn something, the term \"straighlining\", and I looked up on it. I have to confess, I may have said something purely subjective or out of my own ignorant. And I am very glad that I persisted until now, instead of gave up and resolved to my own unfortunate, with a resentful experience, and swore to myself I never wanted to use Pollfish anymore. I even went to look for Greece's consumer protection government website to search for possible help. Now, here we are, reaching a mutual understanding, and I got what I was expecting. Mia, thanks. You are great. I will remember you for good. Appreciated. Have a wonderful weekends, and a well being of 2021. Take care."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-10T22:06:29.000Z",
          "Titre": "Looks like there are some automated…",
          "Contenu": "Looks like there are some automated responses just from the jibberish we get on the long answer questions. Its either that or people are not taking them seriously, we will try and limit long answers unfortunately in the future."
        },
        {
          "Note": 4,
          "Lieu": "TW",
          "Pseudo": "Resume Genius",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T10:39:14.000Z",
          "Titre": "Easy to use, provides a lot of data",
          "Contenu": "The Pollfish interface is easy to use. I like all the choices for question types. Suggestions for improving the site would be that they are too strict in eliminating available demographic data when you have a screening question. For example, I had a question specifying whether the individual was responsible for hiring at their company and this automatically caused \"Organization Role\" to be removed. But I would have liked to have that information about whether it was a HR professional, CEO, or department head that was doing the hiring. I do appreciate that Pollfish gives you the lots of demographic data and their pricing is relatively easy to follow. Pollfish makes it easy to segment, visualize, and download data. I did notice Pollfish raised their prices even over a couple months. It would be great to keep pricing low as affordability is one of the main reasons we choose Pollfish. Overall, Pollfish is an excellent platform for conducting surveys."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2021-10-02T03:45:38.000Z",
          "Titre": "Very easy and straightforward to use",
          "Contenu": "Very easy and straightforward to use. Easy to preview the questions, lots of options, and the demographic information provided is very good. However, the income data they provided wasn’t so useful for the country I was surveying (the Philippines) - next time will make a question with my own income brackets."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "GTAtimbit",
          "Nb_Reviews": 2,
          "Date": "2021-10-08T22:07:07.000Z",
          "Titre": "A little pricey",
          "Contenu": "A little pricey. Great platform for doing surveys and researching  audiences.Since screening questions are THE MOST useful, you will have to pay $50 + to get better results. This is  expensive."
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "nuran tugce esener",
          "Nb_Reviews": 10,
          "Date": "2023-03-09T07:48:38.000Z",
          "Titre": "a breeze to use",
          "Contenu": "Pollfish was a breeze to use! As someone who have not conducted a research on my own I was not sure if I could get the best value out of it. But I was pleasantly surprised. I’ve reached the right audience and was able to get great insights in less than two days."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Parul Kumari",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T08:35:15.000Z",
          "Titre": "This is a really nice app to earn money…",
          "Contenu": "This is a really nice app to earn money by giving answers to simple survey's questions. But it disqualifies you from some surveys but still works good"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Kirsty Armstrong",
          "Nb_Reviews": 3,
          "Date": "2020-10-01T14:28:53.000Z",
          "Titre": "great but shame about extra costs.",
          "Contenu": "its good but a tad expensive. i think the option should be to pay more or wait longer for specific demographics, it was a shame it asks for 50 euro more. in terms of data though it was great. very easy to navigate the results and lovely graphs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Customer BDM",
          "Nb_Reviews": 2,
          "Date": "2021-10-11T13:54:40.000Z",
          "Titre": "Great research resource!",
          "Contenu": "I think the platform is terrific as an intermediary research resource, meaning it allows for affordable (and fast!) access to research panels and quick aggregate insights when needed, without all the hefty analysis work.  However, if you're looking for that, and as we're finding out with our company as we grow, we would actually love more analysis features and improvements such as statistical significance embedded in the user interface, similar to those from competitors.  You also have to be somewhat astute with DIY research software, especially with applied logic and setup, but if you are, it's a great tool to use.  It's been a wonderful experience for our company (small/mid-size) and has allowed us to enhance our findings and support strategies with actionable data.  Definitely would recommend!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Joshua McKenty",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T22:42:26.000Z",
          "Titre": "More visibility into how long the…",
          "Contenu": "More visibility into how long the review will take would be good. Pricing estimates were a bit confusing but I figured it out. The Questionairre builder is powerful, but the interface was a bit confusing (especially the prepopulated answers location)."
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Start-Up Founder",
          "Nb_Reviews": 1,
          "Date": "2020-04-11T15:09:24.000Z",
          "Titre": "It was a good experience",
          "Contenu": "It was a good experience. Easy set up of the questionnaire and fast return rate. Would have liked to have the excel data as well though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cathryn",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T21:13:51.000Z",
          "Titre": "Love pollfish",
          "Contenu": "Love pollfish. Great service. Could improve by having better data renderings available for download."
        },
        {
          "Note": 4,
          "Lieu": "CY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-29T09:08:46.000Z",
          "Titre": "Good support",
          "Contenu": "very responsivewould like to have more support on the setting up of survey"
        },
        {
          "Note": 4,
          "Lieu": "CH",
          "Pseudo": "Marcel Roland Sieber",
          "Nb_Reviews": 1,
          "Date": "2021-10-02T11:55:46.000Z",
          "Titre": "I had a great experience",
          "Contenu": "I had a great experience; the campaign was reasonable to establish, and the platform handling was very intuitive. In addition, the support was excellent, personal, and very responsive."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-16T15:56:11.000Z",
          "Titre": "I wanted reviews from UK",
          "Contenu": "I wanted reviews from UK, US & Germany but only got US."
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "Mohammed Omar",
          "Nb_Reviews": 1,
          "Date": "2019-09-12T07:17:31.000Z",
          "Titre": "Legitimate Service",
          "Contenu": "1. Support people are helpful.2. You will get responses. 3. 3rd Party responses quality are indeed not guaranteed.  I would say that they deliver on their promise."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Kentaro Takakuwa",
          "Nb_Reviews": 2,
          "Date": "2019-10-10T22:11:16.000Z",
          "Titre": "One of the best",
          "Contenu": "I only request Japanese pannel improvement.Polifish is one of the best survey platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T19:54:21.000Z",
          "Titre": "Great software & a fantastic experience!",
          "Contenu": "The software had all the features I needed, and plenty that I didn't if we want to do something more in-depth in the future.Also their review process caught an issue with our survey and saved us some money which is fantastic. They truly care about their customer experience."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Anthony McDonnell",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T17:59:19.000Z",
          "Titre": "Excellent help and service.",
          "Contenu": "Excellent help and service.. Low price."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Abia Samuel",
          "Nb_Reviews": 3,
          "Date": "2023-10-24T19:29:47.000Z",
          "Titre": "Great affortable Survey tool",
          "Contenu": "I have been been so frustrated lately on how to coonect to IT professionals around the world to send questionnaire to them while waiting their feedback.  LinkedIn failed me and because it's hard to get connected with people and request them to answer a survey. That's the biggest challenge to connect to 100 people that would take months. With pollfish, I could get my survey administered and get responses same day from 100 participants.  Their prices are also much affordable for students and researchers."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Brett",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T17:07:00.000Z",
          "Titre": "Great platform",
          "Contenu": "Great platform, I've used it many times & will keep on using it! The results are fast, and the reporting interface is amazing, its alway easy to use & find the data you need."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Jorij Abraham",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T06:52:12.000Z",
          "Titre": "The platform is beyond excellence",
          "Contenu": "The platform is excellent to create surveys but their customer service is beyond excellence... they are online in the chat 24 hours per day, answering all (complex) questions, really fast in a very pleasant way. Strongly recommended for both quick as well as very complex surveys on a global scale!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess Vice",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T01:24:51.000Z",
          "Titre": "Great UXR and market research tool",
          "Contenu": "I love Pollfish. Their survey building tool is a little more intuitive than others I've used. The audience targeting and the filtering on completed surveys is really nuanced. I especially love their customer support - chat is speedy and responsive, and obviously real humans. And email is effective too. They are working on some updates, and always share transparently how they're improving the tool. Any time I've made a feature request, I feel like it's heard and valued. Compared to other tools, the pricing is terrific."
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Ondřej Majer",
          "Nb_Reviews": 18,
          "Date": "2021-06-04T18:48:18.000Z",
          "Titre": "Pollfish is an amazing partner for…",
          "Contenu": "Pollfish is an amazing partner for reward sites/apps! One from best. Great support, everything cool. But please, add cryptocurrencies or some different payment method. Paypal is not good for smaller players, also not supported in every country. More and more reward sites and apps paying their users in crypto and this can really help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Latha Ganti",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T05:34:59.000Z",
          "Titre": "Excellent research tool, superior customer service",
          "Contenu": "I am a clinical researcher and use Pollfish frequently to get baseline data. I love Pollfish because the data return is fast, clean, and ready to use. Sometimes the data we want is not obtainable which means the survey \"fails\". This is where Pollfish customer service shines. They will immediately provide a credit, and can sometimes suggest ways to improve the survey as well. They respond to their emails promptly, even early/late on the day. I am a Pollfish fan!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T04:12:27.000Z",
          "Titre": "The software was fairly easy to use and…",
          "Contenu": "The software was fairly easy to use and then if we did have questions the online support service was effective. I'd definitely use this service again the next time I need a poll completed. Our clients were thrilled with the idea, the price, and the results."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "DRiiBE Marketing",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T18:12:30.000Z",
          "Titre": "Excellent service and price",
          "Contenu": "We have conducted two surveys on this platform. The construction of the survey is excellent, it's possible to select the questions of each type and add photos or videos to each question. The pricing is clear and transparent from the beginning. The results come quickly and can be downloaded in different formats and with different filters. What we like most is the ability to filter the results and analyze them separately for each segment. We highly recommend this platform."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Ross Nelson",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T04:10:51.000Z",
          "Titre": "Glad to Give This A Spin.",
          "Contenu": "Glad to Give This A Spin.I'm happy with the results I got from this platform. It is helpful and useful. I will check out using it again more in the future."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Blue",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T05:51:38.000Z",
          "Titre": "Pollfish is easy, fast, and took care of everything in auto",
          "Contenu": "I needed to conduct a survey but I had very limited time. Instead of looking for suitable test subjects among friends, family or social media, I came across Pollfish and gave it a try. I was amazed at how easy it was to create the survey questions and how fast I got the full results a day later! As I was looking at the survey data realtime, I was able to start writing the paper and results even before the poll was completed, then I just edited some data once the poll was completed. I will definitely recommend Pollfish for your survey needs, and I will continue to use it in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawn B",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T21:12:02.000Z",
          "Titre": "Confident in paying hundreds or thousands to this company",
          "Contenu": "I was able to simply create a survey that targeted the exact audience I wanted.  This allowed me to create a product/market match and will allow me to be prosperous as I know exactly what my audience needs and wants.  I gave 5 stars as Pollfish also goes above and beyond to give feedback before publishing.  Several times this has enhanced the quality of my survey.  They also have in-depth knowledge blog articles to increase my understanding and allow me to improve myself as a user of the platform.  I feel completely confident in paying them hundreds or even thousands of dollars to complete a survey for me."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Luba Kudin",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T09:31:31.000Z",
          "Titre": "Well organized process!",
          "Contenu": "Before the start of our survey, we had several controversial questions. The Pollfish team promptly answered all questions and offered solutions for each issue. Our doubts were resolved in a few hours. The survey itself was also conducted within the agreed time frame. The results are very convenient to use, both during the survey and after it is completed. We are very pleased with this cooperation and are ready to recommend Pollfish as a company with a professional support system!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caro Giordano",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T18:36:18.000Z",
          "Titre": "I conducted surveys in three languages",
          "Contenu": "I conducted surveys in three languages. Turnaround time was extremely quick and sample was good quality. In one survey, I accidentally selected the wrong question type (numeric open text instead of open text) and didn't realize the mistake until I reviewed the results. Pollfish offered to re-conduct the survey at no cost since their reviewed missed it too. The make-up survey was turned around same day. I am very happy with the good service from Pollfish!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T21:14:14.000Z",
          "Titre": "So freakin' fast and detailed!!",
          "Contenu": "Each time I use this service I am blown away by the speed with which the responses come in and with the detail which most of them include. You can tell that the respondents take this very seriously. They must really enjoy doing it. It's actually kind of exciting to watch the responses come in, in real time proving the information you seek. This service is incredibly useful, because at least in my case, every time I run a poll, what I expected was not the outcome of the masses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candice",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T23:47:11.000Z",
          "Titre": "Using the Pollfish platform is easy and fun!",
          "Contenu": "Using the Pollfish platform is easy and fun! As a novice survey writer, I found it intuitive and found the features really useful. I also found it very valuable that Pollfish experts review your survey before it's sent out, to ensure that you get the most value and meaningful results. I will definitely be using the platform again for my next survey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby Koons",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T16:23:16.000Z",
          "Titre": "My experience was great",
          "Contenu": "My experience was great! I was very impressed by the demographics breakdown of the survey respondents. I did not expect i would be able to see things like education level and income. If I would have known that before the survey I would have perhaps ran multiple surveys to segment the respondents. They also make it easy for you to see the results. The visual graphs are great to absorb who your customers are. Also Pollfish has a great spread of clients so you get results from a range of demographics."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Christine Gerzon",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T02:07:43.000Z",
          "Titre": "Quick results",
          "Contenu": "I honestly thought the results would take days, and I was starting to get worried because I was using Pollfish for a quarterly goal and I was trying to make it before the deadline. However, I received the results in literally just a few hours!It was my first time setting up a poll, but it was easy enough for beginners."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T15:35:28.000Z",
          "Titre": "The platform is easy to use",
          "Contenu": "The platform is so easy to use - and the support available from the chat really helped improve my survey and get the best results"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Digital Doctor",
          "Nb_Reviews": 2,
          "Date": "2023-03-05T23:47:54.000Z",
          "Titre": "Pollfish is a fantastic hidden gem for…",
          "Contenu": "Pollfish is a fantastic hidden gem for consumer research. Quick surveys that get you detailed responses in 24 hours, plus you don't have to waste any questions on standard demographics. I use this all the time to conduct research AND tell everyone I can about it."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Tanvir Ahmed",
          "Nb_Reviews": 11,
          "Date": "2023-03-01T23:30:18.000Z",
          "Titre": "Great tool for SMEs and every marketeer",
          "Contenu": "I have been working as a marketer for more than 20 years. We always have the need for data and Pollfish Market Research has platform has changed the way we work by addressing two major challenges - 1. Cost of research 2. Speed I don't think I will ever use any traditional research agency again! :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T22:02:27.000Z",
          "Titre": "Easy and fast",
          "Contenu": "Easy and fast My only suggestion, would be making it easier to move questions in survey around, with the links, remaining intact, or having undo function in case you didn’t like something, but then your previous answer is missing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Malecki",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T16:34:43.000Z",
          "Titre": "Supportive of your Surveys Success",
          "Contenu": "As someone’s who’s not very knowledgeable about how to properly conduct a survey, I was very pleased with Pollfish. I had just drafted what I thought was a simple survey that would go fine. Pollfish then looked over it and told me all the biases I could have and provided suggestion on how to rephrase it. This was exceptional service. Outside of this, the platform really does provide a variety of ways to to customize and configure your survey in all different kinds of ways, a very rich toolset for conducting surveys.The only downside I remember was how long it too to complete the survey. I remember it taking longer than expected, but that was ok in my mind."
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Xy Ho",
          "Nb_Reviews": 2,
          "Date": "2021-10-09T07:08:25.000Z",
          "Titre": "Didn't quite believe it would work at…",
          "Contenu": "Didn't quite believe it would work at first. But I'm a convert now. I was quoted by other companies thousands of dollars to conduct a simple consumer survey for a Masters Degree Thesis.. But Pollfish helped me achieve the required results with just a fraction of the cost, and the results were out in a matter of hours. Saved me the hassle of having to disturb my fríends to help with the questionnaires."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer310",
          "Nb_Reviews": 1,
          "Date": "2020-08-07T15:55:13.000Z",
          "Titre": "Very happy with this service.",
          "Contenu": "Got to jump right into creating my survey, loved the different options you can create on the site. No time out on the site, can add pictures, generate different types of questions. So easy and user friendly. I love seeing the statistics as they are coming through live. Will definitely use them for all surveying needs."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Lefteris Rousoudis",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T10:23:56.000Z",
          "Titre": "I used this platform for a niche market…",
          "Contenu": "I used this platform for a niche market audience, I needed to be sure that only specific people would answer the survey.The platform is very easy to use, it has flexibility and a lot of settings to create a solid survey. The quality of responses is very good but you need to be careful on screening questions when searching for a niche audience.I used double-check questions so that I could compare the results to audience facts already known and it was perfect. The statistical significance and the support from the team at Pollfish is fantastic."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Stefan Schaus",
          "Nb_Reviews": 7,
          "Date": "2020-12-16T06:14:52.000Z",
          "Titre": "Great for quick feedback",
          "Contenu": "This is a great tool to receive feedback easily and quickly.I use it for feedback about icons, user interfaces and things related to software development / usability / ui design. Sometimes I can feel that it is more designed for larger campaigns than this, but it is still a good way for me to find out if people understand the meaning of an icon or like it within just a few hours.And I really have to thank their support team. They are just excellent! Friendly, helpful and incredibly fast."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "RJ Dilla",
          "Nb_Reviews": 1,
          "Date": "2020-11-22T01:46:22.000Z",
          "Titre": "Excellent service from Pollfish team.",
          "Contenu": "The team in Pollfish were really fast and recommended ways to improve the questions we had in the survey. For improvement, I think it will be good for the team to always remember that there are cultural and language nuances for each market/country. Other than that they are really fast even with the Live chat feature which I completely love. Normally, online chat is put for the sake it is there but for Pollfish it is actually working!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "B Peters",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T10:27:04.000Z",
          "Titre": "Really enjoyed being able to…",
          "Contenu": "Great Platform. Really enjoyed being able to commission, design and run our own research programme with Pollfish. The platform is fairly intuitive and easy to use and the help desk / chat really was helpful.   Whilst I don't have cause to research often I would use Pollfish out of preference."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Will Lowrey",
          "Nb_Reviews": 3,
          "Date": "2023-03-02T01:13:57.000Z",
          "Titre": "User-friendly, affordable, and useful",
          "Contenu": "Pollfish was really simple to use for a non-statistician and offered a wide range of options for audiences and style of question. The price was also very affordable. I was able to craft and launch a survey in a short period of time that provided valuable data."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "John",
          "Nb_Reviews": 5,
          "Date": "2020-05-23T13:07:47.000Z",
          "Titre": "I recommend Pollfish to everyone!",
          "Contenu": "I recommend Pollfish to everyone!I used Pollfish for my start-up WhatWeWant to gain consumer insights. The live chat featured was excellent as I needed some guidance (they even work on bank holidays). We got the results really quickly and the ways you can analyse the data is also really good. Bravo paidia great job!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Erick Mbala",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T14:35:49.000Z",
          "Titre": "I think Pollfish is a great solution…",
          "Contenu": "I think Pollfish is a great solution for making survey, I've used it once and it is my go to survey platform now. Very easy to start off and with the AI assistant that helps you get started with a survey is great. I will definitely recommend to other user."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ian",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T17:56:02.000Z",
          "Titre": "Great platform for quick surveys",
          "Contenu": "Super responsive customer services and great pricing! Really made it easy for us to get a quick pulse check on our target audience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Saveraa",
          "Nb_Reviews": 3,
          "Date": "2020-12-02T23:50:17.000Z",
          "Titre": "Your support was fantastic",
          "Contenu": "Your support was fantastic. I think I asked 3 separate questions on separate days and each time the person helping me was knowledgeable and could help quickly.Survey results are also nicely presented. I would definitely use you again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jeremy Philip Galen",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T12:17:54.000Z",
          "Titre": "I love this product",
          "Contenu": "I love this product. I feel like it gives me enterprise grade market survey tech at a consumer price. Highly recommend. I love how responsive the customer support team is. And it’s great to see the major investment they make in improving the software and user experience."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Alexandre",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T13:20:30.000Z",
          "Titre": "Intuitive system and great customer service",
          "Contenu": "Intuitive system and great customer service!The system is fairly easy to use and the service provided by the team is great.Results are consistent."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "CF",
          "Nb_Reviews": 2,
          "Date": "2023-03-04T05:12:30.000Z",
          "Titre": "I'm loving Pollfish's AI-generated questions",
          "Contenu": "I'm loving Pollfish's AI-generated questions - not only are they accurate and time saving, but it even came up with better survey queries than I could have thought of! With a quick poll of 250 respondents in just one working day, targeting my niche market was a breeze. The customer service team is super responsive too for those more complex enquiries about the tool and criteria. All in all this experience has been way easier (and cheaper) than any other 'big players' out there – shoutout to @pollfish 🙌"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruno L.",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T18:49:40.000Z",
          "Titre": "Responses that you can trust. Intuitive interface. Outstanding support",
          "Contenu": "The most important point to make is that I trust the responses of my survey. My target audience was very specific and I could tell that the responses were legitimately coming subjects in my target audience.I also like the ease with which I could elaborate the survey questions and the many options available (one choice, multiple choice, free text, etc.) In addition, the final results were presented in a very concise manner.One last point to make is that their support team responded immediately on the chat and, unlike other chat experiences with bots, there is an actual human being on the other end with useful answers!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Sara Mateos-Aparicio",
          "Nb_Reviews": 1,
          "Date": "2020-11-23T17:48:10.000Z",
          "Titre": "The Customer Service is simply GREAT",
          "Contenu": "I think the platform is easy to use, intuitive, and furthermore, if I have any questions, the Live Chat is always a great help. In general, Pollfish customer service is one of the best I know. All the people from Pollfish I've worked with are efficient, fast, and offer great solutions and help. A massive thanks to all of you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "abhipsha ray",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T12:15:40.000Z",
          "Titre": "they targeted the right audience and…",
          "Contenu": "they targeted the right audience and the service was extremely prompt. As a researcher on deadlines, it can be difficult to collect good data sets and Polish makes that task very easy."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Chloe Smith",
          "Nb_Reviews": 2,
          "Date": "2020-09-09T19:54:21.000Z",
          "Titre": "Pollfish is one of the best services…",
          "Contenu": "Pollfish is one of the best services I've used for market research and concept validation (4 survey's completed so far). It's simple, results come back extremely quickly and the data presentation is clear and well segmented. The customisation capabilities of surveys are brilliant and the customer service is top notch. Thank you Pollfish."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eran Livneh",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T21:45:20.000Z",
          "Titre": "Great solution for quick market…",
          "Contenu": "Great solution for quick market insights! Super user friendly tool, responses were delivered in a timely manner, and the support team is always available to help out. Will definitely use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Skylar",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T21:52:22.000Z",
          "Titre": "Original data, fast results",
          "Contenu": "I've used this platform at my last three jobs, and I love how easy it is to build a survey and dissect the results. It's my go-to platform for generating original, interesting data quickly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Arif",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T19:48:56.000Z",
          "Titre": "Super responsive and helpful support",
          "Contenu": "I've had to contact the support team several times while putting together a survey to get their advice. I've never waited more than 60 seconds before somebody is able to help, and they've always offered me elegant solutions (if the survey tool had the functionality I was hoping for). Really appreciate the team!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T23:13:12.000Z",
          "Titre": "Superior to competition",
          "Contenu": "I had used survey monkey years ago, so I first went there when trying to start a business. I found them to be very expensive and limited so I shopped around and found polish to be much more reasonably priced than the competition. Yet for those would-be entrepreneurs, it can still be prohibitive with all the problem/solution/market surveys one must give. For instance, I am trying to figure out where to get the meager funds to do a follow-up survey now.  I find that your user interface and features are superior, whereas the competition seems to want to charge more for features that should likely be basic for any professional survey.  I like being able to share results easily with mentors and partners and the breadth of statistical information provided. I would recommend it for those looking to conduct real research and leave the competition for those doing family votes and what not."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Martin",
          "Nb_Reviews": 1,
          "Date": "2020-07-31T20:32:02.000Z",
          "Titre": "Pollfish got it done",
          "Contenu": "I was unable to get survey responses directly for a business survey.  i found Pollfish, and after the easy set up, I was able to easily get the responses i needed which has been very valuable for my business.  even more, the team and pollfish helped me when i needed it and made it a seamless process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-29T19:48:40.000Z",
          "Titre": "Pollfish is an excellent online survey…",
          "Contenu": "Pollfish is an excellent online survey platform. I have found the quality of responses very good, as well as the speed in which I can get surveys done. The customer service is also excellent. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Emma H",
          "Nb_Reviews": 11,
          "Date": "2020-07-15T08:16:22.000Z",
          "Titre": "Sinple, effective, affordable",
          "Contenu": "I haven't used Pollfish for a while but coming back to it reminded me how great it is. The audience selections have improved since I last used it and the whole process is so simple. I had my survey launched in under 30 minutes and well within budget which is perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WS",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T23:29:24.000Z",
          "Titre": "Excellent insights, easy to use",
          "Contenu": "Excellent insights, easy to use. Pollfish's audience data and survey flexibility were a perfect match for my needs. I've used surveymonkey as well and prefer pollfish. The question logic tools are more straight forward, the image-based question capability is easier, and the audience data was meaningfully less expensive."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mugunthan",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T22:28:33.000Z",
          "Titre": "Love the ease of use",
          "Contenu": "The platform was extremely simple to use and also targeting the specific user base was simple and straightforward. It would have taken me weeks to get the results that pollfish did over a day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russell Mays",
          "Nb_Reviews": 1,
          "Date": "2021-10-30T18:15:14.000Z",
          "Titre": "Why can't my website access Pollfish",
          "Contenu": "Why can't my website access Pollfish? Every time I apply for access to Pollfish, an email reminds me that my website design is not suitable for Pollfish platform. What should I do"
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T16:34:12.000Z",
          "Titre": "I'm a first time customer",
          "Contenu": "I'm a first time customer, very happy I trust Pollfish to handle in a very great way my survey. They really care about customer service and are supportive when it comes to any inquiries. Congrats!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Ron",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T21:18:20.000Z",
          "Titre": "No more place for guesswor",
          "Contenu": "Love the service, quick, easy, and convenient. No more place for guesswork - we run a survey and get the audience's voice. The only issue is the price, which is not so affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Roemerman",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T21:19:23.000Z",
          "Titre": "I've used other polling services",
          "Contenu": "I've used other polling services, after using Pollfish, we did a formal benchmarking effort comparing many alternatives. Within the service offerings of Pollfish, they are a clear winner. We only wish they offered other services, like allowing us to poll our own respondent list."
        },
        {
          "Note": 5,
          "Lieu": "MK",
          "Pseudo": "Ana Gibson",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T18:15:31.000Z",
          "Titre": "Great platform!",
          "Contenu": "Easy, fast to use platform, very user-friendly interface and you get the results very quickly! Customer support is top notch, I highly recommend Pollfish!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claudia Bremser",
          "Nb_Reviews": 2,
          "Date": "2021-10-02T00:54:13.000Z",
          "Titre": "Ease to use UI to determine…",
          "Contenu": "Fairly ease to use UI to determine your audience and target. Costs to survey an audience are pretty much in line with other systems. The quality of the audience for my vertical was pretty good. We used the service a few times."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tawny Fajardo",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T01:01:44.000Z",
          "Titre": "Quality Surveys",
          "Contenu": "Pollfish's ability to create excellent market research is a superpower I haven't seen any company do before! I'm so happy this company is able to make market research even easier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley R",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T14:53:23.000Z",
          "Titre": "Helpful & Easy to Use!",
          "Contenu": "The customer service chat was incredibly responsive and helpful to get me started as this was my first time using Pollfish. I thought the system was easy to use and I appreciate the timing/cost function at the top of the screen. Great first experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew S.",
          "Nb_Reviews": 1,
          "Date": "2020-09-25T21:45:21.000Z",
          "Titre": "Pollfish interface is intuitive, and support team is great!",
          "Contenu": "The Pollfish platform is very intuitive to use, and allows for a lot of flexibility when it comes to viewing results. The support team (Demi, Vicky, and Jim) provided a lot of great support and attention, which means a lot! Highly recommend Pollfish to anyone looking for quantitative survey results!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Will Donovan",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T03:56:06.000Z",
          "Titre": "A fast and easy tool to use and get…",
          "Contenu": "A fast and easy tool to use and get your questions out there very fast. Great for getting data to support or test innovation or start up ideas quickly . What I love the most is the quick feedback and tips in the tool to produce the best survey straight away."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Ana Germain",
          "Nb_Reviews": 3,
          "Date": "2023-02-24T13:05:35.000Z",
          "Titre": "My favorite survey platform",
          "Contenu": "My favorite survey platform, very easy to use. I can save my projects in folders that help my organization, I can make budget and audience estimations very easily and rapidly to respond my clients demands on time. Excellent presentation of statistics and results."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Team Jobsta",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T08:04:31.000Z",
          "Titre": "Great service",
          "Contenu": "We conducted a survey with Pollfish and got a result within one day. It was impressive. We also appreciate the customer service as we’ve got a useful advice regarding our survey. Thanks, well done"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Rahul Soni",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T20:05:34.000Z",
          "Titre": "Amazing Platform if you need speedy…",
          "Contenu": "Amazing Platform if you need speedy research and accuracy. I have done many research report in a day which is truely amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer BDM",
          "Nb_Reviews": 2,
          "Date": "2020-05-19T12:52:46.000Z",
          "Titre": "Pollfish is Great!  Highly Recommend",
          "Contenu": "Our company has been using Pollfish now for about two years and the experience and support have been growing exponentially during that time.  They continue to improve the overall product, adding features and benefits, and assisting with research needs.  I'm very impressed with this resource and enjoy access to quick, reliable data."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sam",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T03:24:25.000Z",
          "Titre": "Happy Repeat Customer",
          "Contenu": "I've used Pollfish a few times to better understand my target market. I'm always impressed by the speed and quality of the responses."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Oli Johnson",
          "Nb_Reviews": 4,
          "Date": "2023-03-01T09:23:26.000Z",
          "Titre": "The customer service I received was…",
          "Contenu": "The customer service I received was fantastic. Brilliant guidance that helped get high-quality results. I was really pleased with the outcome and highly recommend using them."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Saskia Stähle-Thamm",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T15:17:14.000Z",
          "Titre": "Surveys with Pollfish are fast and easy…",
          "Contenu": "Surveys with Pollfish are fast and easy while delivering the information we need to understand our target groups. Simply a great tool that I have recommended many times."
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Juan",
          "Nb_Reviews": 5,
          "Date": "2023-03-22T23:30:42.000Z",
          "Titre": "Insight Discovery Sped Up",
          "Contenu": "Pollfish is my go-to tool to unlock and discover insights from different types of audiences really quickly. The ease with which the results are presented, their presence in countries where it's difficult to find information such as Central America and the Caribbean, has allowed me to understand consumers and successfully conduct concept tests."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-03-09T17:58:20.000Z",
          "Titre": "So far I\"ve really enjoyed my…",
          "Contenu": "So far I\"ve really enjoyed my experience using Pollfish. The UI is easy to use and has great \"suggestions\" as I was designing, and the online chat service was super helpful too"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Bjellquist-Ledger",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T23:17:53.000Z",
          "Titre": "Thank you Zoi!",
          "Contenu": "Zoi of Pollfish has been exceptional in helping me from learning about the product, to purchasing the polls, to understanding what I am purchasing, to interpreting and making the most of my data. I have probably asked a lot of questions and caused a lot of contact cost but I truly appreciate the support as well as the product in getting me started; thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Veryser",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T22:58:58.000Z",
          "Titre": "Pollfish is the complete survey package.",
          "Contenu": "When it comes to surveys, Pollfish is the complete market research package.1) Finding a niche and targeted audience for a survey is incredibly easy (and FAST) using their paid panel tools. Pollfish handles the recruiting and ensures we always have access to an unbiased pool of results.I can't overstate how powerful this is. Exclusively surveying active customers with Mailchimp (or another low-cost tool) can result in biased answers. The Pollfish audience ensures we get quality results from our market research efforts.2) The survey editing and response view UI/UX is exceptionally intuitive. It offers functionality that other tools hide behind steep paywalls.3) Pollfish reviews all of our surveys before distributing them to respondents. Having a second set of eyes on the questions and survey structure is comforting. They've caught mistakes and made good recommendations. 4) The prices for recruiting/distributing the survey are fair and typically within the budget of our clients.5) It's easy for everyone on my team to collaborate on a survey."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Vladimir",
          "Nb_Reviews": 1,
          "Date": "2020-12-29T16:51:20.000Z",
          "Titre": "Very good!",
          "Contenu": "I was a bit worried if the results will be delivered in the promised timeframe as I was in a hurry. However, it came even faster than expected.  Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "David Porvan",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T11:20:28.000Z",
          "Titre": "Satisfied",
          "Contenu": "Their service gave us precious results with lots of details. They really helped us make our business decisions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hannah A",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T16:53:15.000Z",
          "Titre": "Phenomenal",
          "Contenu": "PhenomenalHaving used many survey creation alternatives, including high-touch professional services firms, I can say after one experience with Pollfish that it's the best experience I've had. Easy to create, easy to analyze, extremely fast turnaround. Used the web app version."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Kenji Maeda",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T06:38:39.000Z",
          "Titre": "Very easy to use U/I",
          "Contenu": "Very easy to use U/I, friendly chat operator, speed of service, excellent Excel output.  I will use it again definitely."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-03-03T10:52:43.000Z",
          "Titre": "Amazing tool for a quick survey",
          "Contenu": "Amazing tool for a quick survey. Pollfish is the best tool in the market if you need to get a huge number of survey responses fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T22:25:06.000Z",
          "Titre": "Unparalleled customer service",
          "Contenu": "Unparalleled customer serviceExcellent experience - I had issues with survey design (screening question flexibility wasn't quite where I needed it to be), and the customer service team worked tirelessly with me when the survey failed to refund the money and relaunch the survey.  I was SO grateful for the customer service team, and have recommended your platform to friends who work in market research, and even a friend who is a professor of PhD students who conduct a great deal of research.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Isabel Ludick",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T09:20:58.000Z",
          "Titre": "10/10 Would Recommend",
          "Contenu": "Pollfish is very user-friendly and quick! Results within one day are amazing. Great features and layouts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T04:32:55.000Z",
          "Titre": "Intuitive interface and display logic puts Pollfish ahead of competitors!",
          "Contenu": "This was incredibly easy and I love the ability to do display logic. I use survata as well and the experience so far has been much better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Md. Shaharier Alam",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T22:58:53.000Z",
          "Titre": "Wonderful Experience",
          "Contenu": "I had a fantastic experience with Pollfish. They provided me with timely and accurate data, which significantly reduced my workload and helped me collect data for my thesis. I was particularly impressed with their excellent customer support, as they promptly responded to any issues I encountered. Overall, I highly recommend Pollfish for its exceptional service and support."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Execulytics Consulting",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T11:47:06.000Z",
          "Titre": "Perfect for my research",
          "Contenu": "The data I required was collected quickly and expertly. It was perfect for my research. The online chat service was quick and extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Olga Sukhopar",
          "Nb_Reviews": 3,
          "Date": "2021-10-02T17:58:10.000Z",
          "Titre": "I loved the service but as I student I…",
          "Contenu": "I loved the service but as I student I wish they would offer the plan which can be cheaper for the student research projects."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Brenton Richards",
          "Nb_Reviews": 2,
          "Date": "2020-12-19T22:21:02.000Z",
          "Titre": "The interface is easy to use",
          "Contenu": "The interface is easy to use. Getting responses was both timely and affordable.  I have every intention bromide this in the future"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ming Ming",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T21:51:43.000Z",
          "Titre": "Pollfish for Academic Research…",
          "Contenu": "I used Pollfish for my academic research. The program was simple to use and navigate. Various targeting options enabled me to connect with my intended study audience. The customer support staff was extremely helpful and responded almost immediately. Overall, Pollfish is a fantastic tool for anyone looking to perform academic research or market research."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Hari Jeevakumar",
          "Nb_Reviews": 4,
          "Date": "2020-10-20T13:09:49.000Z",
          "Titre": "Amazing survey/polling service",
          "Contenu": "Amazing survey/polling service. It went above & beyond my expectations. From the survey builder to the targeting options and from the flexible pricing to the exported PDF...10/10!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pat M",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T00:34:33.000Z",
          "Titre": "I found the platform super-easy to use…",
          "Contenu": "I found the platform super-easy to use and we received feedback on our new name and logo from our target audience within a few days."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Jo",
          "Nb_Reviews": 1,
          "Date": "2021-10-09T08:21:00.000Z",
          "Titre": "Some results are clearly automated…",
          "Contenu": "Some results are clearly automated responses - but they mostly got removed automatically by Pollfish.Very responsive, helpful and friendly support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T15:46:45.000Z",
          "Titre": "Great!",
          "Contenu": "Helped resolve technical difficulties I had and provided me with full refund for a study that didn't launch the way I wanted to."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Diana Ramírez Zúñiga",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T16:27:51.000Z",
          "Titre": "Effective and efficient delivery of…",
          "Contenu": "Effective and efficient delivery of data. It is easy to understand the data with the dashboards and graphics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J S",
          "Nb_Reviews": 1,
          "Date": "2021-10-01T20:53:41.000Z",
          "Titre": "Helpful, easy to use platform!",
          "Contenu": "Very helpful platform with lots of easy to use features and analytics functions! Fair pricing as well"
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Dragana",
          "Nb_Reviews": 2,
          "Date": "2022-05-13T22:04:12.000Z",
          "Titre": "Trustful and Great Platform",
          "Contenu": "This is one trustful, great platform, which you'll use for all the great things you need. Easy to Sign Up, easy to understand all, and use. Join them and explore so many offers and needs."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Daniël Hoekstra",
          "Nb_Reviews": 1,
          "Date": "2023-03-04T15:23:58.000Z",
          "Titre": "Great service and very cost-effective",
          "Contenu": "Great service and very cost-effective. Very helpful with the survey design. Can highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Miroslav Rehor",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T12:08:35.000Z",
          "Titre": "Great experience compared to…",
          "Contenu": "Great experience compared to competition. Clear pricing. I could send my survey right away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Allred",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T19:50:28.000Z",
          "Titre": "Best way to get quick feedback",
          "Contenu": "I have liked the UX a lot and the results get back to you so fast. It has been a great addition to our process for customer feedback."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2020-09-03T16:07:21.000Z",
          "Titre": "I needed a 25 question survey answered",
          "Contenu": "I needed a 25 question survey answered, and was able to get 500 completed surveys in 8 hours with Pollfish. The presentation of the results is very impressive and the demographics information Pollfish provided is invaluable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lilli B",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T00:15:40.000Z",
          "Titre": "I had a great experience",
          "Contenu": "I had a great experience.  I was quickly able to create my survey and get useful data."
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "Katerina Papagiannaki",
          "Nb_Reviews": 1,
          "Date": "2020-09-29T15:17:52.000Z",
          "Titre": "Great experience",
          "Contenu": "Very helpful, fast staff, with incredible inter-communication, they solve every question. Perfect on all levels. Easy to use, fast results, coverage of every requirement"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2020-04-03T07:39:40.000Z",
          "Titre": "It s fast and a good investment to make…",
          "Contenu": "It s fast and a good investment to make startups who want to validate their assumptions! HIGHLY RECOMMEND"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Walter Voskamp",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T10:25:56.000Z",
          "Titre": "Easy to use, reliable and extensive market research",
          "Contenu": "Really easy to use, reliable and extensive market research tool. Quick results, many options for analysis. Very useful for professionals in market research."
        }
      ]
    }
  ]
}