{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "porkbun.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Gökhan Ç.",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T09:39:35.000Z",
          "Titre": "I tried to renew my domain with…",
          "Contenu": "I tried to renew my domain with different card, on checkout page it gave error on card number I checked like 50 times it turns out it does not accept Turkish character's on names(?) it was also gave error on card number not name. After renewed I clicked contact us it redirected me to the team members page. I just don't understand what is going on with their website."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Harfi Achraf Ouassim",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T14:38:18.000Z",
          "Titre": "Disappointment...!",
          "Contenu": "The email template of when you send a mail is messy and i tryed to contact the support too many times but they don't reply.. moreover the email dashboard lacks too many options, I'M HAVING A HARD TIME SETTING UP A PROFILE PICTURE FOR MY BUSINESS EMAIL.. that's disappointing i got to change email hotsitng despite having paid 24€....."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "fkpork",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T06:30:29.000Z",
          "Titre": "Handshake domain scam",
          "Contenu": "Previously, it is good. Since it support Handshake domain, it is a scam website. People come to buy domains not blockchain ideas. No refund.Yes, disgusting porkbun.Just maybe don't buy them? --I need refund, you refuse.It's really not that difficult. There are many warnings about buying Handshake domain names and how there are no refunds, there is nothing scammy or \"disgusting\" about it.-- Many warning??? No, you design to cheat, that is your bad.What's disgusting is leaving a one star review due to your own inability to pay attention to clear warnings while checking out.--I am able to understand what domain means in common sense. You sell blockchain nonsense at no cost to cheat your customers."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mm",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:21:32.000Z",
          "Titre": "claims apple pay is available but it isn't",
          "Contenu": "says apple pay is available, but it was not possible to pay that way; tried multiple devices, no blockers, etc; only possible to use Link or credit card"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eva Ordo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:27:16.000Z",
          "Titre": "Hire better employees",
          "Contenu": "Hire better employees. I am taking all of my business elsewhere because your mail service deleted emails and your employees (Philip) don't want to do their jobs to recover the emails. They are making me repeat myself while blaming other carriers which I don't use as they've been told repeatedly. I told him I want a refund for the URLs I paid for before they were set to expire but he blew that off and just sent me a link to move my URLs elsewhere. So much for your self proclaimed great customer care. >:-(UPDATE:18 days after reporting the problem and 7 days after their response to my negative Trust review, ABSOLUTELY NO ONE from the Admin Team ever contacted me after repeated requests and NOTHING was done to find the emails that disappeared from the email service I was paying for Porkbun to provide! A customer should not be asked 4 different times by 4 different employees that are not in the admin team, the same questions over and over, just to be blown off at the end. I stated that I'd be taking my business elsewhere if the missing email issue wasn't resolved. Instead of resolving it, Philip the head support manager sent me a link to transfer my business elsewhere. I will be reporting this to the BBB as well as the Attorney General Consumer Affairs as this is a paid service I paid for and your employees don't want to do the tedious work of recouping the emails that disappeared.UPDATE: Spoke with India and told her my issue and that I needed to talk to someone above Philip the Support Manager as my complaint was about him. She called me back a few minutes later after she reached out to other members in her group and said they weren't going to be able to do anything about the emails their company lost AND that I could NOT speak to anyone above Philip to complain about his poor customer service.She also stated that they would NOT refund my money for 4 of my domain names that I was going to transfer from their service WHICH were paid for a week ago, and haven't expired before needing to be renewed. I have almost $200 of domain URLs and email service I was paying yearly for which they are losing because of the poor service.TOTALLY FALSE ADVERTISEMENT ABOUT MIND BLOWING CUSTOMER SERVICE! I'm reporting this company to the BBB and the Attorney General's Consumer Affairs department."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Dora",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T19:40:17.000Z",
          "Titre": "honestly i hated it i payed for a…",
          "Contenu": "honestly i hated it i payed for a domain my money was withdrawn from my credit card but i didn't get the domain i contacted costumer support and it took 5 hours to get a response overall a really bad experience"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "utkarsh aggarwal",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T12:04:16.000Z",
          "Titre": "I tried hosting several times but it's not working",
          "Contenu": "I tried hosting several times but still your platform says it's hosted and doesn't show the content in domain name when searched on Google..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nolan",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T17:44:52.000Z",
          "Titre": "sold my information, inudated with spam calls",
          "Contenu": "sold my information, inudated with spam callsi registered a domain from MLH for just a quick hackathon, a casual project. within 24 hrs i was flooded with emails to my inbox, phone calls to my cell, and general spam of people selling me their product. domain and registration was nice but i can't deal with a company that sells my information like that"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Himanshu Jain",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T00:17:07.000Z",
          "Titre": "Fraud with domain service",
          "Contenu": "They locked domain due to DEVICE NOT RECONISED. my domain expired on 28-09-2023, I was started contacting him to renew and unlock my account from 22 october, still they sold my domain to other customer, my account unlocked on 31st, now I don't have domain name. I asked to give my domain back, they denied. don't choose Porkbun for your domain. I filed case with ICANN, Case Id - 01263890Let's see what will be happend in future."
        },
        {
          "Note": 1,
          "Lieu": "KH",
          "Pseudo": "BossHok",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T13:42:12.000Z",
          "Titre": "I always using this device to login",
          "Contenu": "I always using this device to login, but after windows update yesterday, porkbun not recognize my device.It ask one time code, but the code never arrive at my email."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Daniel Punton",
          "Nb_Reviews": 9,
          "Date": "2023-11-01T06:00:57.000Z",
          "Titre": "Porkbun turn autorenew back on when you turn it off.",
          "Contenu": "I didn't want to renew my domain at porkbun so went several times to check autorenew was off and each time they had turned it back on. I got an email saying they tried to charge (leading to a dishonor charge) but failed and went on the site where autorenew was set OFF. But they still somehow charged me and I'm down the renewal charge for a site I dont want and turned autorecharge off multiple times. Just corrupt scum."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Undisclosed",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T15:29:50.000Z",
          "Titre": "I didn't like the support no-reply when…",
          "Contenu": "I didn't like the support no-reply when I asked for something. I don't recommend it"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nour Elba",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:29:16.000Z",
          "Titre": "My order \"failed\" yet my card got…",
          "Contenu": "My order \"failed\" yet my card got charged the full 100 dollars. Support is nowhere to be found"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "H Bruggeman",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T15:26:43.000Z",
          "Titre": "Domain removed from your Account during Expired Auction",
          "Contenu": "Cheap and Affordable pricing. Best overall but issue comes in when your domain expired and sent out to auction. Other platform like namesilo / Dynadot your domains are still in your account and can still renew, even if your domain did net sell, you can still renew. But if your domain did not sell via auction, you no longer own the domain."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Avoid Porkbun",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T05:18:22.000Z",
          "Titre": "Customer support offers no solution",
          "Contenu": "Customer support offers no solutionIf you like joke registrar's they are perfect for you.  If want a professional service they are not.  The last two times I had a problem with porkbun.com's service I received no help from their customer support as they refused to help or offer a way around the problem.  This isn't good enough so I will move to a more grown-up registrar.UPDATE - Porkbun never followed up with me despite requesting through Trustpilot further details (which I happily provided)."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Miklos Van Halen",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T02:36:12.000Z",
          "Titre": "Why is it suddenly so expensive?",
          "Contenu": "Why is it suddenly so expensive?Edit:  I mean specific new(er) domain extensions across the board are *significantly* more expensive than others.  \"Basic economics\" is a pretty silly cop-out non answer.  It doesn't cost any more to store that row in a database, and there isn't any more competition for every single .io or .ai domain across the board compared to their .com counterparts.  It really feels like price gauging - whether it's by Porkbun or the layer below...Aren't YOU the registry??"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T20:17:52.000Z",
          "Titre": "Want to buy a domain? So you’re a suspicious person.",
          "Contenu": "Strange guys. I wanted to register a domain, and they immediately ask for a photo of my id (passport, driver’s license or something else). Have you ever seen this? I guess I haven’t even bought a domain yet, and I feel like I broke something and I have to justify it, prove something.Spit and went to another registrar. I’ve never seen such strange procedures for buying a domain. Absurd."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Maksim",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T17:40:48.000Z",
          "Titre": "Porkbun wants too much.",
          "Contenu": "I wanted to transfer several domains from another registrar. I chose porkbun based on reviews and price. When registering, they demanded to confirm the identity with a photo. It's so stupid that I'm not even too lazy to leave a review about it.--Response to response:You try to console yourself by thinking that this review is written by one person. At the same time, you complain to trustpilot about bad and truthful reviews, and apparently you write positive ones to yourself. If you go to other popular sites like reddit or just Google, it's obvious that many people don't like you there. So piece reviews here from several people are a drop in the bucket. I'm sure there are a lot more such reviews, you're just trying to delete them.I will be extremely surprised if this review is not deleted. Simply because you are trying to play against the generally accepted norms of morality. However, the result of your actions is dust in the eyes of potential consumers. Anyone who sees your requirement to submit documents to register a domain will simply go to another registrar."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Lee",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T22:48:31.000Z",
          "Titre": "Made me pay 3 times because of account settings.",
          "Contenu": "When paying for a domain name extension, the process failed after authorizing my card, because of my Porkbun account settings. Now it seems they made me pay 3 times (instead of once). If account settings are a problem, these of course should be checked before charging someone's card. Must now apply for a refund, but very busy, so I am not at all happy with this."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Zain",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T18:40:18.000Z",
          "Titre": "No payment support for india",
          "Contenu": "No payment support for india. Local payment gateway /methods must be added otherwise we have to migrate. I couldn't buy another domain due to payment Barriers.I don't have credit card. Please add razorpay or payU or upi option immediately. I want to buy new products urgently.I had to get credit card on rent. I don't own one. Will there be any Indian payment gateway available soon."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Zeeshan Rehman",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T07:25:30.000Z",
          "Titre": "I lost reserved many domains but porkbun…",
          "Contenu": "I had reserved many domains but porkbun did not accept payment through my mastercard.  Even billing support was unable to resolve the issue and in the meantime, one of the domains in my shoppingcart,  FastForward.ai was taken by somebody else.Adding that card on porkbun was showing same error soI had to setup PayPal with the same MasterCard and pay for remaining."
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Grigorii Guskov",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T17:45:02.000Z",
          "Titre": "They cheat that they cannot return the…",
          "Contenu": "They cheat that they cannot return the USDT sent through Polygon. Although it is written in the manual that the system itself cannot, namely, the seller has such an opportunity!See the coinbase help page - Coinbase Commerce->RefundsI am sure that it is impossible to deal with such deceivers, they can deceive further, already in everything else. I no longer have any trust, I hope the rest of the clients will read this and find out who they are dealing with."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "SF",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T15:38:47.000Z",
          "Titre": "I want to point multiple domains to the same host",
          "Contenu": "1) Web hosts can not be attached to more than one domain2) Domains can not be sorted by price or renewal price3) The wish list is hard to find4) The filter by label in the domain manager has got worse5) I have different contact details for different domains. However this is hard to managed. Sometimes you allocate the wrong domain with the wrong details, even though I entered everything correctly.Please contact me if these points -esp 1 if they are not correct. I am also happy to elaborate if they are not clear."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "ojq start",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T10:04:49.000Z",
          "Titre": "Be careful!",
          "Contenu": "I don't know why my account has been banned, and all the domain names I purchased have been recycled. Be careful!"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Jonathan Holden",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T05:02:14.000Z",
          "Titre": "Porkbun really need to work on their…",
          "Contenu": "Porkbun really need to work on their communications. I moved to them because Google Domains sold to Squarespace. But then they didn't renew my domain and it took a week for me of back and forth emails to get access again. Now I've just bought another domain and I'm getting emails from abuse@portkbun asking me to verify myself again, even though I only just had to do that. None of their emails show any sign of empathy or have really clear instructions on what I need to do. And then I get responses on here with the same \"we haven't done anything wrong\" attitude, \"it's all you\". Well, no it's not. I've got loads of domains with Google, and I've never had these kinds of issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "earl adkins",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T07:23:33.000Z",
          "Titre": "my name is not earl adkins earl adkins…",
          "Contenu": "my name is not earl adkins earl adkins (type twice)I transfer a lot of domain names over to you and nothing happen you sent me an email saying you had a discount until 30 September, I purchase nothing happen"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kathie",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T02:34:16.000Z",
          "Titre": "It seemed that everything went wrong",
          "Contenu": "It seemed that everything went wrong. I kept going in circles and it wasn't at all clear what was keeping things from working. I had to work on this three different days and my husband who usually breezes through online forms was as puzzled as I was."
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Arg Mao",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T16:47:32.000Z",
          "Titre": "This site is an infinite SH**IT",
          "Contenu": "This site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**ITThis site is an infinite SH**IT"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "David Alfaro",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T04:54:44.000Z",
          "Titre": "I just renewed and my domain no longer loads!!! because???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard D. Bunker",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T01:55:56.000Z",
          "Titre": "Completely dissatisfied now. after being happy at first for years",
          "Contenu": "I've been a client of porkbun for years. Registered over 100 domains with them and referred all my clients to buy domains there. But recently they suspended one of my domains for suspected phishing. I communicated with them that my site is legitimate in every way but they still kept it suspended. Needless to say I will be moving my domains elsewhere and taking my business elsewhere. I own a web design company so they'll lose all my business and I won't be referring anyone or any clients to them any longer. dan at bestwebdesignlasvegas.com>>>Response: I have a partnership with kohls that allows me to sell their product. And offer customers of kohls to use their rewards, kohls card etc. Kohls is aware of the site and if they had a problem they would let me know. Your suspension is not acceptable. I will be transferring my domain and will continue my partnership with kohls elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T09:45:37.000Z",
          "Titre": "I'd go for namecheap",
          "Contenu": "All domain purchases automatically sign you up to domain-email free trial without asking. There is also no option to uncheck this. Only way to unsubscribe is contact customer care. No option to out out even after purchase. Pretty surprised."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "OM",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T11:02:04.000Z",
          "Titre": "Major issue while trying to pay for the domains we have",
          "Contenu": "Major issue while trying to provide payment details.No way to get support over the phone.support email suggestins did not help.I'm still looking for how to pay for my existing domains and Pokbun is miles from helping me pay them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "AnnaMarie McCorvie",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T03:14:09.000Z",
          "Titre": "Over the top",
          "Contenu": "That was one of the strangest, most buggy, and most overly secure account creation and purchase processes I have ever been through. Shouldn’t it only take a couple minutes to purchase a domain? Instead I had to verify my account multiple times, switching between the website and my email, before I could finally check out!"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "🎲🎲🎲",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T00:33:55.000Z",
          "Titre": "got suspended account instead of just…",
          "Contenu": "got suspended account instead of just deleting my domain idk XD yeah seems like you don't know what phishing is, scam website? yeah, phishing? no"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Luigi Solar",
          "Nb_Reviews": 3,
          "Date": "2023-05-09T11:46:25.000Z",
          "Titre": "Porkbun is ignoring scam / fraudulent complaints",
          "Contenu": "Porkbun is not taking scam / fraudulent websites in serios... in fact, they don't care.. they simply ignore complaints. I have reported the website dach-solarstore and they barely respond saying they don't have enough evidence, that the website is fraudulent... I have sent them a lot of evidence but they keep ignoring the complaint...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alan Rees",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T08:54:06.000Z",
          "Titre": "Don't need Porkbun. Can't do what I need.",
          "Contenu": "I have too many email addresses.I'm not sure I need Porkbun for my Gmail address.I wanted gmail to forward email to xxx((my business domain email)However, I was verbally told I could not use my personal domain emailBecause it is linked to a business Porkbun account.I was to xxx, because Porbun does not allow it!I will have to explore alternate vendors and use Gmail for my personal emails, even though I renewed, so that I could start getting my personal domain email.Rats!  45 minutes and my renewal fee wasted!"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Jayaram Iyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T05:07:03.000Z",
          "Titre": "Payment process has to improve big…",
          "Contenu": "Payment process has to improve big time. The card saved could not be used to pay. Don't know why.Another card used, payment debited by bank but you rejected it saying the card is attached to another account. So what?One can't keep finding virgin cards to link to your account.Suggestion: in India due to RBI regulation you will find it difficult to use stored creidt cards. Therefore your policy of one credit card per account is useless. Do not store or link credit cards to one account. Allow to pay through any card or process. In India, any credit card has a two factor authentication (e.g. OTP to phone). So one can't use anyone else's card and comit fraud."
        },
        {
          "Note": 1,
          "Lieu": "TH",
          "Pseudo": "Shayne Micchia",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T06:08:27.000Z",
          "Titre": "Very Poor Support.",
          "Contenu": "Very disappointed. As you can see from emails past few days I had a major URGENT issue I needed help with and support was useless. Didnt read my email carefully and so didnt understand the issue, took 3 TIMES to make them understand .. really terrible. I move to you from GoDaddy for this reason (poor support) and now am considering looking for a new registrar."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T09:48:59.000Z",
          "Titre": "I called Porkbun for assistance with an…",
          "Contenu": "I called Porkbun for assistance with an issue using my purchased domain with WordPress.  My web guy has been unable to access my account.  I need someone to contact me immediately for a US telephone.  Thank yo for your assistance in this matter."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jack Hammond",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T02:57:54.000Z",
          "Titre": "I’m irritated because I’ve searched my…",
          "Contenu": "I’m irritated because I’ve searched my emails, and I can’t find any notifications regarding my service needing to be renewed. Along with that when I renewed the service I had to get a whole new platform to redesign the entire website.  I didn’t have any other options, what’s more is I didn’t know any of this was going to take place until after I paid the nine dollar renewal fee for the domain name which is of course nonrefundable. I’ve tried calling and I get voicemail.  if I had to do it over I wouldn’t use pork bun  Especially at $12 a month for WordPress which I don’t want because weebly only cost six and didn’t gave the option to use it"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "emmy",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T21:36:12.000Z",
          "Titre": "Better look for a other domain rental service... like namecheap",
          "Contenu": "Porkbun is (better was) my favorite domain renting service. Lately porkbun decided to make some Tribble because of nothing.... and now I can't renew/buy a other domain because they want a id card verification with a platform we're is literally a data breach online."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stan Michaels",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T21:34:51.000Z",
          "Titre": "Poor support",
          "Contenu": "Poor support, impossible to reach anyone. Constant issues with emails with no resolution. I needed a .nyc domain but will never get it through porkbun"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "To",
          "Nb_Reviews": 5,
          "Date": "2023-09-30T00:13:52.000Z",
          "Titre": "Do you want to register? Prepare your passport!",
          "Contenu": "At work, I have long used the services of porkbun, no less than the services of other registrars. But now I needed to register a domain for myself. I wanted to create a personal account. But when creating an account, they require me to provide photos of documents, confirm contact details, and so on. This is the first time I have seen such stupid restrictions for registration (including domain registration) with a registrar.Of course, I'm not going to provide photos of my documents just because they wanted to.I use the services of more than a dozen registrars, but porkbun is the first of the registrars where I saw such stupidity. I am very disappointed, even though it was previously my favorite registrar. Apparently now, in order to avoid risks, I will be forced to transfer from them all the domains that we registered for clients."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "International Student",
          "Nb_Reviews": 4,
          "Date": "2023-07-03T09:09:36.000Z",
          "Titre": "Renewed email, deletes all prior emails!",
          "Contenu": "Porkbun has greatly disappointed me in the most significant manner. Following an email renewal this weekend, all of my emails have vanished, and there is no trace of them on the server. Unexpectedly, everything has been wiped clean, despite it being a routine renewal. The response I received was, \"There is nothing on the server for your email.\" This is crucial information regarding the technique to achieve crispy bacon, and now it's all gone. I am experiencing a complete breakdown, and I have firmly decided to never utilize this service again."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Alessandro Reviewer",
          "Nb_Reviews": 20,
          "Date": "2023-03-03T01:36:53.000Z",
          "Titre": "Two domains suspended with no good reason",
          "Contenu": "There's something weird going on with Porkbun. It used to be a great service, but lately they've been suspending my domains improperly. On the first domain, they claimed \"crypto phishing\" (there is none), suspended for a few hours, then reactivated. In the second domain, they claimed \"phishing\" and a 48 hour notice, I contacted them and they replied: \"Hello, I have unsuspended the domain [...].\" However, the domain was suspended even with this message! I emphasize that I am against phishing and illegal things, and if that happened, it's not my fault, and I don't have a hosting account on Porkbun to upload files or codes, just the domains. In addition, I have verified my ID on Veriff.com (by request)."
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "VZ",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T13:59:51.000Z",
          "Titre": "Bad payment system",
          "Contenu": "Cumbersome payment system that rejected all of my cards (that work perfectly fine on all other websites). It is not a nice experience to have to scramble to find alternative payment methods with a domain renewal deadline approaching."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicolas Ayala",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T02:27:00.000Z",
          "Titre": "well here i am",
          "Contenu": "well here i am, i paid my money to create a domain and now i simply cant check my email. and of course theirs nobody to talk to.. it went from an exciting moment in my business's startup to an extremely frustrating moment. very unhappy with the difficulty to check my own email that i just paid for - next time im going to stay with google"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Association Pour La Bientraita",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T21:42:41.000Z",
          "Titre": "Took me 1h15 to pay a simple renewal",
          "Contenu": "Took me 1h15 to pay a simple renewalWe were renewing our own domain, had to pay, tried with a different card, had to verify my phone number, my own phone number was not recognized, I verified it, it was not recognized again, I was then blocked to verify my second card, finally managed to miraculously bypass the block, my second card was used by another account so I could not pay, I then tried to fund my old & unused account to pay, had to log in to other accounts, fund the account, and finally get back to Porkbun and pay with my old cardFortunately I had access to the old card. I wonder what will happend next year if it expires ? Will we be blocked out of our own domains ?Why is it so difficult to pay ? We have a legit Non profit to manage. Please stop blocking people for no reason. No other website ever blocked us like yours."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joey Rodriguez",
          "Nb_Reviews": 3,
          "Date": "2023-06-14T22:15:29.000Z",
          "Titre": "I cannot get into my account I try to…",
          "Contenu": "I cannot get into my account I try to reset password and it doesn’t work I’m totally disappointed. Other competitors websites are much more user friendly"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Rob Ireland",
          "Nb_Reviews": 7,
          "Date": "2023-07-24T06:28:49.000Z",
          "Titre": "This company allows scammers",
          "Contenu": "This company allow scammers to purchase, run and abuse their services. I have contacted them, gave them the evidence and yet they refuse to put a stop to these people. Obviously, business with crooks is business as usual.As you can see by their reply, little interest in the harm selling their products do to others. I have reported them to ICANN and I suggest anyone who is scammed by people using their domain names, sold, registered and maintained by these people, that you sue them for the damages.A very hard bar you say, well how much effort do you expect the general public to go to before it is obvious it is a scam. If you see thousands of the same item in facebook that all have the same image and all go back to websites of all the same design on lots of URL's. Then its about time the registars did something, your taking their money and helping them rob from others.And yet here you are, poor response with zero concern. I'm sure one day you will be forced to vet people before dishing out domains to scammers.Since my last update, I have discovered a huge network of crime being delivered by porkbun's services. I have made them aware of this and I am also contacting their local law enforcement. However, they need to also take action. Washing your hands of responsibility is not good enough."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Ellis Lieberman",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T00:18:10.000Z",
          "Titre": "I have now been charged twice",
          "Contenu": "I have now been charged twice. Once with a $30 dollar charge and once for a 48.65 transaction.685563\t2023-03-30 01:28:47\tOrder Id: 3826019\t-48.65685561\t2023-03-30 01:26:19\tAuto Renew: 3825967\t-30.00I had turned OFF auto-renew.I transferred crypto to my porkbun account to handle the five year for web hosting which you said that was not part of the 2027 domain expiration.Nowhere in the detail screen did it show a 2023 expiration of anything, but I (possibly foolishly) accepted your explanation and sought a 5 year static hosting extension. BUT NOW I see this.Registry Expire Date: 2032-04-04T02:35:36ZNOTHING I did --- if you were telling the truth before should have resulted in this. AND I didn't authorize \"685561,\" the $30. expenditure.There is a reply from the vendor below and the back and forth are not done, but my initial rely to that is now contained here:Threatening to delete the domain to fix your scam is unacceptable. It borders on coercion and the illegal. At this point, I want you to adjust the domain expiration date with the static hosting date without my giving you any more money."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Abdul Rehman",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T13:54:20.000Z",
          "Titre": "Dear solve my issue i want to connect…",
          "Contenu": "Dear solve my issue i want to connect domain with hosting but it doesn't proceed. Domain panel ha some issues."
        },
        {
          "Note": 1,
          "Lieu": "MN",
          "Pseudo": "Orgil",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T10:05:39.000Z",
          "Titre": "Worst domain registrar ever used",
          "Contenu": "First time i`m experiencing this kinda trouble with domain registrar.After seeing their promotion for .app & .dev domain i decided to register and use .dev domain.Yes, domain was free for 1st year, and WHOIS privacy is free. Looks tempting, so registered account on porkbun, searched and found unregistered .dev domain. but i can not add that domain to cart. Contacted support and waited 24 hours for reply.They said they blocked certain words and, asking me explain why i want register domain with CSGO.i replied about my facebook page and trying to expand, and waited for another 24 for unlock that domain.Finally i am able to add chosen domain to card, then another issue came up. I am unable to check out.I already verified my email, phone number and credit card, so i contacted Support again. Same as before they replied after 24hours, they want me to verify my identification with Veriff.com. So i did! After verification i sent message to support and waited another 24 hours for reply.Finally i can click checkout button.Guess what? i still can not pay with my already verified credit card, can not add my bank details ( because my account must be older than 36500days to link bank ?) even can pay with crypto because i`m not VERIFIED. actually i just did verification, and waited for days to reply.Just give up porkbun. and purchased that domain from another registrar but with 1 cent additional price"
        },
        {
          "Note": 1,
          "Lieu": "JP",
          "Pseudo": "Kirafishy",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T01:57:57.000Z",
          "Titre": "i can't get free .gay domain with my…",
          "Contenu": "i can't get free .gay domain with my credit cardI have purchased this .gay domain by buying with a 1$ domain using the same credit card"
        },
        {
          "Note": 1,
          "Lieu": "CM",
          "Pseudo": "Lori J Khan Lori J Khan",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T10:32:17.000Z",
          "Titre": "Slow customer service",
          "Contenu": "I have written 2 different complaints to you but you have not responded to any, that is too bad for a customer service, i wish you check my worries and sort it out soonest"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Francisco Perez Mazon",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T14:00:23.000Z",
          "Titre": "I paid a plan that was supposed to last…",
          "Contenu": "I paid a plan that was supposed to last 1 year. After a few month, I had to pay again for the domain and then I am asked to pay 27€ for \"the free\" email address that the domain comes with. I really feel tricked and cheated by Porkbun.I will lose now my email and I will not renew the domain after the year is finnish cause I will never work with you anymore."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T02:56:15.000Z",
          "Titre": "Porkbun is a terrible company",
          "Contenu": "Porkbun is a terrible company. Has went downhill. Extremely unprofessional customer service. Save your valuble time and money and stay away."
        },
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Kyriakos Topsoglou",
          "Nb_Reviews": 5,
          "Date": "2023-02-27T20:11:30.000Z",
          "Titre": "Because you taking all my domains who…",
          "Contenu": "Because you taking all my domains who expired for sale and I can't register again anymore. I'm loosing all of them. You didn't give any chance to your customers to take them back !!!27.02.2023 ---> I know very well how the industry works because I'm from 1989 in this industry registering over 300 domain names. So I know very well how the industry works in the past and how they industry works today. In the past when a domain expired the provider release the domain, so it was able to register this domain again. Now when a domain expire, you sell it to someone else because the only thing that matter for you is to make profits of the loses domains. This is how the industry works today and this is how to makes business today. Nobody care about the founder of the domain... because today everything is business and profits like they said your loss is my win, \"Your death is my Life\". So I have the right for my own opinion for the beautiful world of business of domain name industry and how works today. Have a nice day !!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nathan Racchi",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T08:46:05.000Z",
          "Titre": "domain name would not transfer so i wasted my money trying to purhcase a sub domain and domain"
        },
        {
          "Note": 1,
          "Lieu": "KH",
          "Pseudo": "NoMorePorkBunny",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T21:44:41.000Z",
          "Titre": "Instead of helping asking stupid questions ...",
          "Contenu": "Instead of giving me support and answering my question they made me go through a humiliating governement verification process.Answer to your useless question:Smarten up your verification process and don't force your customer to strip naked before some third party company."
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Snapfit org",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:52:57.000Z",
          "Titre": "not good at all :("
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T06:48:00.000Z",
          "Titre": "Renewal price was way too expensive",
          "Contenu": "Renewal price was way too expensive. I renewal price was not obviouse at time of sign up or first renewal year"
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Francisco",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T13:05:09.000Z",
          "Titre": "I am OK with being asked for a review",
          "Contenu": "I am OK with being asked for a review, not so much being pushy asking for review, less when repeatably being asked again after giving one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lord Featherston",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T17:24:45.000Z",
          "Titre": "Do not want emails from \"Trustpilot\".",
          "Contenu": "Did not appreciate getting emails from Trustpilot.I am happy to review your service.  But I do not appreciate getting Trustpilot junk in my inbox."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Kate Gray",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T05:10:36.000Z",
          "Titre": "Spammed me asking for a review",
          "Contenu": "Spammed me asking for a review.  Anyone who does this gets the lowest possible rating."
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "liqr karthk",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T09:33:20.000Z",
          "Titre": "very bad response and service",
          "Contenu": "very bad response and service , after paying our renewal charges ,receipt also got it , its almost 2 months still not released our website"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrew Hickman",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T23:16:24.000Z",
          "Titre": "Very poor domain purchasing experience",
          "Contenu": "There was a visual glitch and I was never displayed a proper confirmation screen after purchasing a multi-thousand $ domain. I still have not received the domain yet as Porkbun has not successfully retrieved the correct authcode from the original registry."
        },
        {
          "Note": 1,
          "Lieu": "PK",
          "Pseudo": "Ghulam Mustafa",
          "Nb_Reviews": 4,
          "Date": "2023-08-25T10:41:03.000Z",
          "Titre": "UNABLE TO UTLIZE VALID COUPON",
          "Contenu": "I have a coupon \"DOTPROFREE2\" but it fails at checkout with undefined error."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Dakota Walsh",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T05:27:11.000Z",
          "Titre": "I don't like being sent spam emails",
          "Contenu": "I don't like being sent spam emails. If there's not an urgent issue with my domains leave me alone and I'll be happy."
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "Othy",
          "Nb_Reviews": 3,
          "Date": "2023-09-03T16:03:49.000Z",
          "Titre": "Very bad experience",
          "Contenu": "Very bad experience, the support 0% helpful, better try other platforms they are cheaper and easy to use and communicate I will never back again :)"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Joel John Varghese",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T08:06:54.000Z",
          "Titre": "Too confusing and improper…",
          "Contenu": "Too confusing and improper documentation. Follow standards and make DNS configuration easier for newbies. Make better tutorials on YouTube."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "given chychy",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T21:54:03.000Z",
          "Titre": "terrible",
          "Contenu": "terrible, email doesnt work, takes 24hr-1week to even get a connect to servers"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Akash Chotoe",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T14:23:24.000Z",
          "Titre": "You guys suspended my domein for no…",
          "Contenu": "You guys suspended my domein for no reason"
        },
        {
          "Note": 1,
          "Lieu": "SK",
          "Pseudo": "Donald",
          "Nb_Reviews": 5,
          "Date": "2023-06-07T13:58:10.000Z",
          "Titre": "Slow and expensive",
          "Contenu": "Slow. The user experience is the worst for domain control. Too expensive"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronnie Alcorn",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T04:17:27.000Z",
          "Titre": "I don't like you promoting a sexual…",
          "Contenu": "I don't like you promoting a sexual desire of people, it's sad."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Aditya Rajput",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T12:25:57.000Z",
          "Titre": "disappointing",
          "Contenu": "Bad UI and dark pattern of forcing me to auto renew"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "menorcarob",
          "Nb_Reviews": 8,
          "Date": "2023-07-19T17:09:19.000Z",
          "Titre": "Renewal prices shown on different…",
          "Contenu": "Renewal prices shown on different domains extensions are not true, I was seriously over charged, I am looking to move all my domains to another registrar, complained about the problem and got nowhere, they don't look after the client, the renewal price was changed from the original one, I complained via email and someone called me told me price had increased, should have told me that before taking my money, amature con people"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Muzne",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T15:23:10.000Z",
          "Titre": "Very very poor customer care for a such…",
          "Contenu": "Very very poor customer care for a such a usa based company"
        },
        {
          "Note": 1,
          "Lieu": "KH",
          "Pseudo": "nguyen tan duoc nguyen tan duo",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T14:33:28.000Z",
          "Titre": "Unsatisfied with the service",
          "Contenu": "gratuitous account lockout will not recommend this service to anyone and end this partnership soon"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Annoyed User",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T04:06:05.000Z",
          "Titre": "Don't ask for reviews",
          "Contenu": "When you beg for reviews, you get one star."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Raquepau",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T21:27:45.000Z",
          "Titre": "Auto Renewal of Domains",
          "Contenu": "I just had to renew some of my domains that I had on autorenew. Why didn't they auto renew?"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Sonu Kumar sikhhagoti.com",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T18:36:48.000Z",
          "Titre": "Bad Registrar For ever Please Ignore it."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Mike",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T01:03:42.000Z",
          "Titre": "Terrible customer service",
          "Contenu": "Worst experience ever. We are hosting 50+ domains with porkbun for several years and they suspended our account without even getting in touch with us first. Terrible and not customer friendly at all."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "Osfal Atal",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T01:39:14.000Z",
          "Titre": "Bad Service",
          "Contenu": "I Have Constant Payment Errors There are ridiculous security systems in order not to give a domain, although I do phone verification and mail verification, it gives an error when purchasing, I do not recommend this site"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arthur",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T22:40:18.000Z",
          "Titre": "Porkbun",
          "Contenu": "I purchased a domain name through Porkbun in the *.dev top-level domain, which requires HTTPS. Porkbun provides no documentation on enabling HTTPS, and while I received certificate files from Porkbun, the files had weird names, making it hard to discern what they should correspond to. Comparing the files to third-party documentation on HTTPS was impossible, since I couldn't figure out what Porkbun's files contained. When I emailed Porkbun about it, they declined to provide any clarification whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "SHUDDHODHAN SURWADE",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T11:09:15.000Z",
          "Titre": "very very bad…",
          "Contenu": "very very bad 👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎very bad"
        },
        {
          "Note": 1,
          "Lieu": "VN",
          "Pseudo": "Hai Pham Quang",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:59:54.000Z",
          "Titre": "I did not receive information about…",
          "Contenu": "I did not receive information about expiring my domain, then got redirected to porkbun."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Irina Pronina",
          "Nb_Reviews": 5,
          "Date": "2022-07-16T09:49:13.000Z",
          "Titre": "Terrible support!",
          "Contenu": "The registrar allows the placement of sites with child pornography. Does not respond to RELIABLE evidence. Dragging out the grievance process for a week and still doing nothing. Although their official website says that posting such content is prohibited."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "rpm digital",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T04:04:43.000Z",
          "Titre": "high risk.",
          "Contenu": "My last review was positive - but the fact that every single porkbun domain we own has gone down and has been down for hours isn't acceptable, buying domains with this business is a huge risk especially if you have invested in marketing campaigns that are live when an issue like this arises. They've had issues before but it's literally every couple months there's a critical issue."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "songofthefirefly",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T15:59:53.000Z",
          "Titre": "No Discount or gifts",
          "Contenu": "Worst provider"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Rosa",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T04:58:37.000Z",
          "Titre": "I am generally happy with the service but",
          "Contenu": "I am generally happy with the service. They offer competitive prices for domain names and I am a loyal customer. However, recently I tried to migrate my WordPress website from another hosting company to Porkbun and my experience was terrible.They only support a third-party plugin to migrate and that third-party plugin requires you to purchase a premium plan if your file is big. That was my case. Why do I have to pay for the third-party plugin to migrate to Porkbun? It doesn't make sense... Also, the support staff was rather irritated than supportive. I decided to stay with my current hosting company which is more customer centerd and has support available 24/7. If you want just a simple domain name provider, it does the job but if you face problems the support is email only and worse than the others."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Barr",
          "Nb_Reviews": 2,
          "Date": "2020-07-02T02:04:04.000Z",
          "Titre": "I signed up with porkbun.com and…deeply regretted the decisions in less than two days.",
          "Contenu": "I signed up with porkbun.com and transferred my five domains to their site because of their low pricing. Well, I got what I paid for. The next three days I received seven solicitation & spam phone calls and six spam emails about my newly transferred domains from companies that porkbun had promptly sold my personal information. Reprehensible. Low prices, despicable business. AVOID AT ALL COSTS."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Fernando Martinez",
          "Nb_Reviews": 5,
          "Date": "2020-12-27T11:58:56.000Z",
          "Titre": "Fake company no support, Unreliable, Scammy, Fraud",
          "Contenu": "Fake company no support No phone number, No reply on chat from 2 days,No reply on email,UnreliableI had a domain with these idio.ts, I cant login t my account, my job is on stake and these idio.ts dont even care to reply, been trying to reach them from 2-3 days, someone nreeds to shut down these Mf's"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Austin Hawkins",
          "Nb_Reviews": 1,
          "Date": "2020-01-03T20:48:36.000Z",
          "Titre": "Porkbun is holding my domain hostage",
          "Contenu": "Very bad and evil company. I registered a domain with them a week ago. After a few days they suddenly decided my domain is against ICANN regulations (which they did NOT specify) and now they are holding my domain hostage and won't let me transfer it, even though I have the right to transfer my domain to any other registrar.NEVER do any business with Porkbun if you care about your domain!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gursharanjit Singh",
          "Nb_Reviews": 1,
          "Date": "2021-02-03T00:50:44.000Z",
          "Titre": "Stole my $1100 worth domain",
          "Contenu": "So I transferred my domain (Worth $1100 in marketplace) Everything went well next day I received and email that my account has been suspended and they deleted my domain but in reality when i checked the WHOIS domain was showing on their name and it was for sale for $1100 on their website in few minutesI contacted support they didn't help, stopped replying.i asked to transfer my domain back to original registrar which they denied. So never trust these thieves.if you search their address in Google maps its a UPS store"
        },
        {
          "Note": 1,
          "Lieu": "BB",
          "Pseudo": "Alex",
          "Nb_Reviews": 11,
          "Date": "2020-09-06T08:31:56.000Z",
          "Titre": "Very bad service",
          "Contenu": "Sorry, it looks like that PayPal account is being used by another account. If you keep trying you will be blocked. To prevent fraud and abuse we only allow a PayPal account to be used by a single Porkbun account. This cannot be bypassed. If you have any questions, please contact support. (001) (3VBR59CVH99WA)"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Colnect",
          "Nb_Reviews": 3,
          "Date": "2021-01-22T02:44:47.000Z",
          "Titre": "Warning! DNS issues",
          "Contenu": "All seemed fine and dandy till their DNS servers started failing and from some locations our DNS doesn't get resolved so many users are unable to access our website. It's been hours since we emailed support and heard nothing :(UPDATE: a reply here came faster than PorkBun's support which doesn't mean good things about PorkBun's support. There's still no official publication on the DDOS attack, how long it lasted, how they'll prevent it and so on. If you're gonna use them as a registrar, consider having alternative nameservers"
        },
        {
          "Note": 1,
          "Lieu": "RU",
          "Pseudo": "Levent Günay",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T13:52:55.000Z",
          "Titre": "Absolutely not recommended if you are a…",
          "Contenu": "Absolutely not recommended if you are a professional designer or a person / company that opens an account with your clients and you work as a freelancer!I mistakenly tried to use the card to which my personal account was linked to my customer and they returned half of the money withdrawn from my account! If you are going to allow to use a card once, then you have to withdraw the money after the check. It is a very obvious fraud tactic to take the money first and then say sorry that this card cannot be used and returning 50% as a refund."
        },
        {
          "Note": 1,
          "Lieu": "GH",
          "Pseudo": "Prince Nelson Joseph",
          "Nb_Reviews": 2,
          "Date": "2020-02-18T09:54:55.000Z",
          "Titre": "Bomb guys auction my domains without high price",
          "Contenu": "Bomb guys ...i bought a domain from them back 2 yrs ago ..www.ghanbeat .com and www.royalblissrestaurant .com ..I was having some little financial challenges ..when the domain get expire ..it went it grace period i was asked to pay $120 and extra $9 domain fee... after which it was auctioned and sold out by them ..i was later able to repurchase my domain royalblissrestaurant .com after and a year and my blog ghanabeat .com ..is still auction by Porkbun for 2yrs now... Wicked domain registry everStay away from them"
        },
        {
          "Note": 1,
          "Lieu": "HK",
          "Pseudo": "sam",
          "Nb_Reviews": 1,
          "Date": "2021-07-11T12:10:29.000Z",
          "Titre": "within 10hours they steal my idea",
          "Contenu": "just request more details 10 hours ago on buying .sbs domain,I think porkbun support steal my idea on my domaining idea, the domain silver.sbs ,your support team seems buying it and sell it on sedo before I request more detail on trademark questions , it happens on same day (within 10hours they steal my idea)!the guy registe silver.sbs  live in Liechtenstein.Domain Name: SILVER.SBSRegistry Domain ID: D242133797-CNICRegistrar WHOIS Server: whois.porkbun.comRegistrar URL: porkbun.comUpdated Date: 2021-07-10T11:56:09.0ZCreation Date: 2021-07-10T11:42:37.0ZRegistry Expiry Date: 2022-07-10T23:59:59.0Z"
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Hector Burbano",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:20:43.000Z",
          "Titre": "I cant to use my domine",
          "Contenu": "I cant to use my domine, support contacme , i need your help for download My domine"
        },
        {
          "Note": 2,
          "Lieu": "AM",
          "Pseudo": "Alice",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T17:47:25.000Z",
          "Titre": "Buying the domain worked",
          "Contenu": "Buying the domain worked, but they first had a problem with my main email address (so I had to use a fallback gmail one), then with phone number verification. Resolving the latter involved a fairly long chat with support and a call, because sms didn't go through. There was also no prompt to verify phone number before attempting to buy a domain, and the transaction got locked as a result, with me wondering why it was locked."
        },
        {
          "Note": 2,
          "Lieu": "CL",
          "Pseudo": "Pablo",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:15:53.000Z",
          "Titre": "Apple Pay / Stripe didn't work for all…",
          "Contenu": "Apple Pay / Stripe didn't work for all my domains and I had to try again"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Emberlynn Bland",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T02:22:22.000Z",
          "Titre": "Github connect is still in beta, not perfect",
          "Contenu": "Github connect would've been a a cool feature, I couldn't get it to load files deeper in in folders from my private repository. Support was friendly, but I realized I could get what I wanted out of the hosting experience just by using Github itself rather than what Porkbun advertised from its plans."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DC",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T17:27:22.000Z",
          "Titre": "Porkbun is good if you don't need support",
          "Contenu": "Porkbun's support team take up to 24 hours to respond to an initial chat request or email, which is fine and fairly standard...but when I reply to their email, it takes another 24 hours to get a reply back, and another 24 hours for the next reply, making the process stretch out over several days. Telephone calls go to voicemail. I guess I'm getting what I pay for. Lower prices=slower customer service.Edit: I am a US based customer. Customer support is only replying once per day regardless of how fast I get back to them. Difference in time zones is not the issue."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T00:29:35.000Z",
          "Titre": "limit email and service after you pay",
          "Contenu": "after using their service, the setup was easy, but after I started to use it they complained that their email service was extremally limited. They can't even handle 250 emails a day. Originally I posted 400. They informed me it’s actually 250. Very hard for even a small business with 2 sales people to send less than that. Unless they really don’t have business needs for email. So unless you just want to spend the money for nothing, that is what you really get when you start to use it."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Kakashi",
          "Nb_Reviews": 4,
          "Date": "2023-11-03T18:30:35.000Z",
          "Titre": "Not so Seamless",
          "Contenu": "Good user experience while registering the domain. Very bad experience once you get in. DNS Outrages, Nameserver problems.. can't get your site up and running. Random Errors."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "heyam moh",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T20:15:50.000Z",
          "Titre": "Im your customer for a long time and…",
          "Contenu": "Im your customer for a long time and never give me a discount code 😔"
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "Gunho Kim",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T11:47:50.000Z",
          "Titre": "Registrar in Korea can re-register for 40 days. You shouldn't operate like this because the registration price is cheap.",
          "Contenu": "When the customer domain is in an expired state, the re-registration period of the icann registration rule shall be 30 days.However, this act of conducting an auction on another site 25 days after expiration is an illegal act that violates the rights of customers.It is not a legitimate business practice of Registrar.What rights do you use to violate the rights of the client..I just don't understand.Registrar in Korea can re-register for 40 days.You shouldn't operate like this because the registration price is cheap."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Aubrey",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T08:26:45.000Z",
          "Titre": "I have been waiting over a week to…",
          "Contenu": "I have been waiting over a week to change DNS even thought the website says 30th s - 48hrs. . Have had to resubmit a couple times hoping for a different outcome but still no confrontation email received"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Once-very-happy customer",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T01:04:50.000Z",
          "Titre": "Porkbun is basically terrific, but..",
          "Contenu": "Porkbun is basically terrific. Nice interface, secure. Super-competetive pricing. Works well. Unfortunately, they have recently added a feature which is very distasteful - automatic enrollment in auto-pay on domain registrations. You simply cannot complete a payment without enrolling in auto-pay. Yes, they say (in the fine print) that they provide a method to later opt-out of auto-pay, but this has things exactly backwards. It should not require a customer to opt-out of automatic payment without having first consciously opted-in.I understand the benefits of auto-pay for vendors, but it should still remain as an opt-in option, not an \"opt-out (if you even knew we opted you in) deal\"Now, I'm going to have to re-evaluate my choice of registrars. The shine on my otherwise five-stars opinion has faded..A better option on their part would have been to offer a positive incentive for folks to enroll in auto-pay. They have numerous incentive deals already. They should just put a positive incentive on auto-pay, too"
        },
        {
          "Note": 2,
          "Lieu": "RU",
          "Pseudo": "zsaz",
          "Nb_Reviews": 3,
          "Date": "2023-07-07T20:36:39.000Z",
          "Titre": "I wasn't able to buy a domain with my…",
          "Contenu": "I wasn't able to buy a domain with my debit card.I tried to buy a domain using my debit card, which was charged successfully, but then I got a message that I was trying to commit fraud. Then I tried to buy using PayPal and everything went okay."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "hannes",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T18:18:55.000Z",
          "Titre": "Best prices I could find anywhery, but",
          "Contenu": "Best prices I could find anywhere (bought a domain for 35bucks for 10years)But their website was slow af while doing so, took me ~5min for every step and account creation didn't work many times"
        },
        {
          "Note": 2,
          "Lieu": "NG",
          "Pseudo": "Abiodun Balogun",
          "Nb_Reviews": 3,
          "Date": "2023-07-29T10:50:38.000Z",
          "Titre": "porkbun never ever give discounts or…",
          "Contenu": "porkbun never ever give discounts or coupons ! very bad ! and no affiliate or reseller service no good hosting either"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ron Loffland",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T02:12:47.000Z",
          "Titre": "Fees keep inching up",
          "Contenu": "Fees keep inching up. Will be looking for a cheaper domain provider. Also says we get a free email forwarder, but that hasn't worked."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "liam paul",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T02:27:50.000Z",
          "Titre": "i mean i got what i wanted eventually",
          "Contenu": "i mean i got what i wanted eventually, but it took like 5 tries and a whole day before i was allowed to pay"
        },
        {
          "Note": 2,
          "Lieu": "CL",
          "Pseudo": "Rafael",
          "Nb_Reviews": 1,
          "Date": "2023-06-17T00:43:54.000Z",
          "Titre": "I have two failed attempt",
          "Contenu": "I have two failed attempt, but after fixing the credit card issue I was blocked for buying any domain"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "RF",
          "Nb_Reviews": 3,
          "Date": "2023-04-16T18:35:47.000Z",
          "Titre": "I don't have two factor set up (as far…",
          "Contenu": "I don't have two factor set up (as far as I recall) and there was not a lead-through to set it up, it kept taking me back to the same login screen.  annoying."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Anipier",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T18:04:53.000Z",
          "Titre": "Bad UX",
          "Contenu": "Point 1 You send an email for me to pay. From my phone, i click from the email, access login screen. (This keeps me in Gmail) I enter my credentialsYou send a code to my email. I'm stuck, I cannot go in my emails because I'm already in them. There should be a phone method too. Point 2When I get my phone verified and logged in. I go in the email where you ask me to pay. I click on the link, you do not redirect me to the place where I can update my card to pay. I have to look for it. (And it was hard to find)"
        },
        {
          "Note": 2,
          "Lieu": "VN",
          "Pseudo": "Toan Ho",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T13:24:39.000Z",
          "Titre": "it charged me twice",
          "Contenu": "it charged me twice. please help me to double check my transaction for buying this domain."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Nico Pendleton",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T01:19:03.000Z",
          "Titre": "deadnamed me (otherwise good but emails…",
          "Contenu": "deadnamed me (otherwise good but emails continue to deadname me despite me changing my details)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Geo",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T03:46:20.000Z",
          "Titre": "the checkout process was unbearably…",
          "Contenu": "the checkout process was unbearably slow and took 20+ min just waiting for pages to load."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Debbie Evans",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T09:26:11.000Z",
          "Titre": "We had a visa debit card and it…",
          "Contenu": "We had a visa debit card and it wouldn't let us proceed. thx."
        },
        {
          "Note": 2,
          "Lieu": "VE",
          "Pseudo": "Luis Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T14:42:55.000Z",
          "Titre": "It a little bit",
          "Contenu": "It a little bit, complicated it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rejoe OZ",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T21:13:09.000Z",
          "Titre": "PayPal did not work",
          "Contenu": "PayPal did not work. I have tried several different browsers and still it lorded only texts."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve Farthing",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:43:57.000Z",
          "Titre": "You locked me out and delayed sending a…",
          "Contenu": "You locked me out and delayed sending a code"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CBK",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T21:01:30.000Z",
          "Titre": "Your prices were good but there are…",
          "Contenu": "Your prices were good but there are significant usability issues with domain renewal"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chante",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T19:47:53.000Z",
          "Titre": "Can't log into my site admin council…",
          "Contenu": "Can't log into my site admin council (403 error) consistently (was able to once) & the Porkbun branding is much more intrusive than expected."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Kirubaharan R",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T03:35:04.000Z",
          "Titre": "Purchase itself is issues support team…",
          "Contenu": "Purchase itself is issues support team had fixed it"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "waldo",
          "Nb_Reviews": 2,
          "Date": "2023-02-19T17:25:45.000Z",
          "Titre": "Paypal took a suprising long time to…",
          "Contenu": "Paypal took a suprising long time to load and complete the transaction."
        },
        {
          "Note": 2,
          "Lieu": "MA",
          "Pseudo": "amine bakhtaoui",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T23:27:54.000Z",
          "Titre": "decrease the commission",
          "Contenu": "decrease the commissionadvise sellerscreate new selling techniquemake domain management more easier"
        },
        {
          "Note": 2,
          "Lieu": "KR",
          "Pseudo": "Gunho Kim",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T12:25:17.000Z",
          "Titre": "I insist, \"You must not force the auction during the autoRenewPeriod of the expired domain without my consent.\"",
          "Contenu": "During the 30-day autoRenewPeriod after the customer's domain expired. you must not The act of auctioning the customer's domain to your partner registrar(your partner is dynadot.com) from the 25th of autoRenewPeriod without asking the customer's permission.You are making illegal profits by forcing the auction without asking the customer's permission.I'm not aware of the fact that the icann announced, \"The domain registrar can do this kind of auction.\"\"The domain registrar can conduct an auction without the customer's consent during the customer's autoRenewPeriod to generate additional profits.\" If such an icann regulation exists, please let me know immediately.I can't find such an auction rule in the icann.So \"you are doing illegal activities that are against the regulations of icann about registration and re-extension.\" Please let me know immediately if this is wrong.I think , \"Domain Registrar shall not force the auction (your partner is dynadot.com) during the autoRenewPeriod without customer consent in any case.\"I think, \"This is an infringement of customer rights and an illegal business activity.\" \"You shouldn't make a profit this way.\"Because you are forcing the auction through your partner company from the 25th of autoRenewPeriod without my consent.Now, you are continuing the auction by force through your partner company without asking my permission. Is denying this fact?I insist, \"You must not force the auction during the autoRenewPeriod of the expired domain without my consent.\"I have the right to refuse to proceed with your illegal auction during the automatic renewal period (30 days) of the expired domain.\"However, my right to refuse has been seriously violated. For this reason, I am suffering serious mental damage.You are causing me serious mental damage. Please be aware of this fact.This kind of illegal activity is not done in Korea. It also strictly complies with the automatic renewal period of 30 to 40 days. be not engaged in any infringement of rights.You said, \"The registration fee is a little cheaper. \" It is not a responsible registrar if it violates the customer's domain ownership rights in this wrong auction method.The responsible registrar shall not infringe on the rights of the customer by illegal auction activities during the automatic renewal period of the expired domain.------------------------------------------------------------Reply from Porkbun :2 hours agoJust renew your domains on time. We give customer 30 days past expiration to renew their domains. Sending domains to auction is industry standard and something you agree to when agreeing to our TOS. You also already made the same review, so this is redundant.------------------------------------------------------------My Add Reply :What domain industry standard are you talking about?\"In the registration and re-extension of the icann domain,When the customer's domain expires, the registrar has the right to force auctions during the auto-renewal period (30 days).\"I could not find any icann regulations stating the above description.I'm afraid your tos is not a domain industry standard.Tell me if there's a basis.It is right to delete or modify these deceptive TOS regulations that infringe on the rights of customers.To be honest, you should be ashamed.Your TOS are against fair commercial morality and are not the appearance of a responsible registrar.Compulsory auction without the customer's consent is an illegal act that violates the customer's rights. Immediately, you must stop.Do not create such deceptive TOS rules that infringe on the rights of customers. This is a violent act by the registrar."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Chriper Serv",
          "Nb_Reviews": 3,
          "Date": "2022-10-24T17:55:02.000Z",
          "Titre": "Our Wordpress based site got hacked",
          "Contenu": "Our Wordpress based site got hacked, ( It can happen to anyone) and Porkbun suspended the  domain, without even informing us, or giving us the time to fix it. Thats abuse of their power. They could have informed us directly, and we could have fixed that in few minutes, Because of the suspension our site was down for 7 days. that's a perfect example of abuse of power and pathetic service."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Tommaso",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T15:48:14.000Z",
          "Titre": "I can't put the domain on the…",
          "Contenu": "I can't put the domain on the marketplace, because it rejected the paypal account."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Fuad Efendi",
          "Nb_Reviews": 8,
          "Date": "2023-01-10T18:39:18.000Z",
          "Titre": "No taxes ;) indeed service provided outside of Canada.",
          "Contenu": "Excellent. Quick and easy. However, a little scammy!!!A little scary regarding my Email being pwned or whatever, which is indeed scam too. Yes, I used childish password on websites I don't trust, it leaked, but I am more secure than taking bait from 1Password.Other than that, time will show how reliable this vendor is. So far, vendor forces me to write review even before I had a chance to use their services.UPDATE:RE: \"public information regarding email addresses and passwords that have been exposed via data breaches. This information comes from the public information regarding email addresses and passwords that have been exposed via data breaches. This information comes from the haveibeenpwned.com services. This has nothing to do with 1Password. services. This has nothing to do with 1Password.\"- Porkbun blatantly advertises `haveibeenpwned.com` which pushes me to use `1Password`. I am not in a position to lock all my passwords using single password, and I don't expect blatant Ads on a paid-for service provider (Pockburn).If you want to research security breaches - do it responsibly, you can use third-parties (haveibeenpwned.com) but you should take full responsibility (instead of referring us to third party).I wish your business growth and prosperity and I hope my feedback is somehow a little bit valuable ;)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lisa Glanzer",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T02:34:13.000Z",
          "Titre": "Terrible support.",
          "Contenu": "Shortly after purchase, the domain stopped allowing any kind of changes (dns, nameserver, anything at all).  I reached out to support and was told there was nothing they could do, that my new, none production domain was no longer usable on their dns, nor on cloudflares.  When I attempted to find out why I was told they couldn't provide any reason why.  I pushed and pushed and was told they would look into it on Monday, (it was the weekend).  Monday comes and goes with no response for 15 days.  Finally I sent 1 final email and was prepared to dispute the domain purchase with my bank.  They responded to the email and said they would check, less than 12 hours later the issue was completely resolved, with no explanation as to what happened.  Next email was for a review of my experience, so here we are."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Manoj Nayak",
          "Nb_Reviews": 2,
          "Date": "2023-07-02T09:48:10.000Z",
          "Titre": "It says I am not eligible for the free…",
          "Contenu": "It says I am not eligible for the free domain"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T06:12:34.000Z",
          "Titre": "Transfer-in fees are insanely high."
        },
        {
          "Note": 2,
          "Lieu": "TR",
          "Pseudo": "Tekami Vido",
          "Nb_Reviews": 14,
          "Date": "2022-04-20T16:19:14.330Z",
          "Titre": "No more good bacause suddenly ask ID…",
          "Contenu": "No more good bacause suddenly ask ID and denied to buy domain. And i pay using paypal no need ID verification because they can ask paypal. Why i use paypal for safe ecommerceing. Addition ask my ID they can verify email and phone. Why ask ID i dont give my ID for this poor domain reseller."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "JB",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T23:15:46.000Z",
          "Titre": "It is to expensive and the site is…",
          "Contenu": "It is to expensive and the site is quite slow."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 22,
          "Date": "2020-06-28T22:20:04.000Z",
          "Titre": "Not as good as I thought",
          "Contenu": "Lowest prices I've seen from any other registrar, great features & great UI, it's unbeatable! No more looking for offers on other sites you always get the lowest price here!Update:I think they increased their prices as I am seeing better prices at other registrars, their support takes too long now & they ignored my feedback request & when they responded once it was in a smirky attitude."
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Emil",
          "Nb_Reviews": 6,
          "Date": "2019-03-12T12:55:26.000Z",
          "Titre": "Closed my affiliate account without any notice",
          "Contenu": "I did register as a Porkbun affiliate. After some time I logged in to check out how I was doing. My affiliate account status just said \"Closed\".No email, nothing about this.I mailed them to ask them why and if it were possible to open it again so I can send them customers but I haven't received an answer.Everything did seem so straight forward and easy, and I liked them in the beginning. This changed my view..."
        },
        {
          "Note": 2,
          "Lieu": "BD",
          "Pseudo": "Rangershost Tech",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T06:09:28.000Z",
          "Titre": "No live chat",
          "Contenu": "No live chat. Emails are responded 2 to 3 hours later."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Zhan Xiao",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T13:58:14.000Z",
          "Titre": "Not a good enough user experience",
          "Contenu": "porkbun any place is great. But I have given them some advice to support the use of WeChat Pay and Alipay to give Chinese customers a better experience. They didn't give me any reply, it seems they don't like to listen to their customers."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Blair Urquhart",
          "Nb_Reviews": 15,
          "Date": "2020-06-20T19:00:26.000Z",
          "Titre": "Prices cheap but everything else is…",
          "Contenu": "Prices cheap but everything else is terrible hereI have used all the other business you can domains of such as namesilo,namecheap they all did not give me all these weird password problems. I have in just  few days of using it since it will not give me a password I can remember which to me a fault of there not my mine.For whatever none of my internet browser password saving features work here have tried on Chrome and Firefox both would not work.There verify codes to change password very poorly for example today tried over 4 years time still can't use my domain so will probably not buy anymore domains of them since the service is overall terrible!"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Etienne Juneau",
          "Nb_Reviews": 14,
          "Date": "2019-07-16T00:19:36.000Z",
          "Titre": "Great prices, terrible support",
          "Contenu": "Great prices, terrible support. Had a few issues with domain forwarding. 1-liner email replies; chat agents end conversation abruptly. Works for basic needs, but if you need support or more advanced features, I'd look elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Klimko",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T05:58:36.000Z",
          "Titre": "I am satisfied with the purchase I made…",
          "Contenu": "I am satisfied with the purchase I made of my domain name however I gave two stars because it is nearly impossible to login to the website from my PC. Every time I attempt it I keep getting errors. I think there is an issue with the login of the website other than that the product is fine."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Adam Racovalis",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T00:30:21.000Z",
          "Titre": "My domain is $50 AUD too much",
          "Contenu": "Why is my domain $60 AUD per year now? It was so cheap when I bought it, domains in Australia are like $7 a year. Im changing providers."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-12-01T09:34:27.000Z",
          "Titre": "Very mixed experiance from me",
          "Contenu": "Very mixed experience from me. They are a good provider offering domains at a competitive price. However the way they handle abuse complaints is not good (At least it wasn't in the past but I am unsure of current business practises). While I am not sure if it is still in practice, Porkbun would suspend your domain without contacting you first if they receive an automated Google safe search warning regarding the domain. This happened to me in the past where google detected a false positive and Porkbun suspended the domain. It was clearly a false positive since I didn't modify the website whatsoever and submitted it back to google and it was approved as being clean with nothing wrong; this took maybe a few hours to 1 day for google to verify. Porkbun left the domain suspended for days and wasn't very informative at the time because it was the weekend and abuse department was only monday to friday. This I found to just be a terrible business practise, i understand the need to remove abuse but the steps in place at the time of it happening to me need to be changed as it seems like there was no human intervention or double check and my domain was disabled just because of an automated google warning. This isn't the first time this has happened either, you can lookup Porkbun domain suspended / suspension topics on forums such as LowEndTalk, Reddit, etc..."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Yosu Cadilla Andres",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T22:11:33.000Z",
          "Titre": "Guy on the chat was useless."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Isaenko Volodymyr",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T09:37:01.000Z",
          "Titre": "Very bad crypto operating."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "FootyBoy",
          "Nb_Reviews": 4,
          "Date": "2022-05-02T13:06:26.000Z",
          "Titre": "Email Catch-All forwarding not provided, big hassle",
          "Contenu": "I'm a veteran domain owner now for over 20 years. I know how to manage domains.After reading glowing reviews, Porkbun had me sold, I was just about to transfer all my domains to Porkbun, but when I happen to discover that catch-all email forwarding was not provided I stopped. Catch-all forwarding is a very important facility that most email users would find useful and many power users will eventually require.Porkbun's excuse is that is stresses their servers, so I was reluctant to believe that. I've had no problem with previous registrars, and I've managed to stop spam after it arises. It's a lot of hassle setting up email address and preventing spam without a catch-all forwarding facility.Porkbun's solution is to disable that altogether, for the benefit of their own servers, which makes me think they don't have very good infrastructure, or are on the cheap with low grade AWS hosting. Really, their reason for not offering catch-all's is lame and i transferred my domains elswhere.One thing I am upset about is that Porkbun never makes it clear on their promotionals or signup pages that catch-all is not provided, I had to find out from Reddit forums. Gotta love reddit."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ahmad Ansori",
          "Nb_Reviews": 3,
          "Date": "2019-06-28T03:56:42.000Z",
          "Titre": "porkbun now cant add balance using…",
          "Contenu": "porkbun now cant add balance using paypal, so sadi dont have btc, and im reselling domain using porkbun :'("
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Alvaro Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T22:27:26.000Z",
          "Titre": "It is not very user friendly"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lexxi Wells",
          "Nb_Reviews": 3,
          "Date": "2019-07-26T20:22:49.000Z",
          "Titre": "Hosting so slow, my web dev won't touch it!",
          "Contenu": "I'm actually shocked to see the 5 star reviews. I was thrilled to try out an affordable alternative to some of the 'big names' but it's left a bad taste in my mouth.Prior to signing up for hosting - I chatted in to get information because their own site was so slow it kept kicking me out and 504'ing. I was assured it was because of how quickly they're growing, and it doesn't impact their hosting at all. Super. Load. Of. Crap. My site's not even done yet, has less than 4 products on it, css is minified, everything is compressed and it is still taking 5 seconds before the FIRST ping! I work on sites daily (SEO) and I have never experienced such a slow site. (Hello, 1997?) I sent it to my web dev and he won't even touch it until I switch hosting providers, because he says there's nothing he can do until I get new hosting (it's not worth it to try, apparently, it's that bad.)When I emailed in today, I was told that the 'hosting isn't for everyone' and is a 'one size fits all.' Uhh. That would have been nice to mention before I bought my 4 domains through PorkBun, especially when I specifically asked. Cannot recommend. And I'm locked into their hosting for 2 months apparently. So I guess I can launch my new site (with the products i've worked tirelessly on for 8 months) in 2 more months... after I switch hosting. Ludacris.1 star because it forces you to leave at least 1. +1 additional star for a cute mascot."
        },
        {
          "Note": 2,
          "Lieu": "RO",
          "Pseudo": "Marcel",
          "Nb_Reviews": 2,
          "Date": "2022-01-19T07:24:40.000Z",
          "Titre": "Backend password storing is broken! Unacceptable!",
          "Contenu": "I wasn't able to create an account on the website. Tested on two devices. Website returned 403 Forbidden. Emailed support, they responded very quickly, told me it could be related to my VPN and that I should tell them my IP address so they can \"investigate further\". After I disclosed my IP address they ghosted me! I send them another email the next day but they didn't answer again. Very unprofessional!I managed to successfully create an account after three days from another computer at home. I think I got the reason why it wasn't working in the first place: It was because of the password which contained Extended ASCII characters! At least give the user a message that they should pick a password without them instead of just throwing \"403 Forbidden\" on a blank page!But it doesn't end here. After I purchased my domain for two years I logged out for a while and then tried to log back in. Password didn't work! My intuition tells me it's because it starts with a single quotation mark (it was generated randomly by the password manager). Not even regular ASCII is handled properly in the backend! I did manage to change my password and it went ok from there on, but it took me 3 days of tinkering just to register an account. You shouldn't need to pick a simpler (and thus more crackable) password just to please a dysfunctional form backend.Other bad things: The website is mess. The \"Contact Us\" link in the footer is just a blank javascript. That's just laughable (in a sad way).Good things: Although they ditched me after a short correspondence, the initial response was pretty quick. Sadly, this and the competitive pricing are pretty much the only good things about Porkbun. It does have a lot of potential but I'm going to rate it for what it is and not for what it could be.Honestly the review should've been one star but I'm trying as hard as I can to be objective."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T04:53:13.000Z",
          "Titre": "Too expensive"
        },
        {
          "Note": 2,
          "Lieu": "TH",
          "Pseudo": "..",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T10:58:22.000Z",
          "Titre": "SSss",
          "Contenu": "When hdjdmznBagbxbenwnz"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "E. Robbyns",
          "Nb_Reviews": 6,
          "Date": "2020-01-25T20:34:45.000Z",
          "Titre": "Changed prices on me"
        },
        {
          "Note": 2,
          "Lieu": "AM",
          "Pseudo": "Dr Grigorian Ph.D",
          "Nb_Reviews": 2,
          "Date": "2021-12-01T17:42:26.000Z",
          "Titre": "PorkBun Eddie  ⭐️ ⭐️",
          "Contenu": "It’s very sad for me to write this review about Eddie but it needs to be known. We love porkbun, however, Eddie didn’t understand.See below Hi. re sos.goldYouwhen going to www. sos.goldEddie joined the chatEddieHelloYouIt says 404 (006)pixie proxy, no wildcard URL forwarding configured. Can you tell me how to fix this, please?EddieIt looks like you setup a URL forwarder and have a previous wildcard record set, however the Wildcard option is setup for the current forward you have setupEddieYou'll want to resetup the forwarder and select the \" Use wildcard URL forwarding\" as wellYouSo, it loads when you go to sos.gold but when you go to www. sos.gold it fails? Please can you fix it? ThanksEddieAs I said, you'll need to recreate the URL forwarder and make sure \"Use wildcard URL forwarding\" is checked if you want it to work for any subdomains.YouAs I said, I’ve done it before. But is still not working. Can you fix it for me, please?EddieUnfortunately it's not created correctly, you need to create it again but making sure that. checkbox is checked so that it will work on any subdomainsYouPlease kindly create it for me. Thanks.YouIf I do that, the images don’t load.EddieThe images don't load?YouYes if I do as you say, it doesn’t load images. That’s why please kindly assist and try to fix it. ThanksEddieWhat images are you referring to? I'm not understanding.YouWebsite imagesEddieThe URL forwarder shouldn't have any impact on your website's images, you'll just want to recreate the URL forwarder and make sure that box is checked so that any subdomains will forward on as well as the root domainYouPlease see myYoumy above replies, you’ll see that I’ve done that but the website images don’t load in that case. Kindly fix the issues for me. Thank you.EddieAgain, the forwarder doesn't have any control over what is loaded at the destination URL. The issue is you do not have Wildcard forwarding enabled for the forwarder you setup, you just need to recreate it and then it will load correctly for WWW so long as you check the \"Use wildcard URL forwarding\" option as I have said aboveYouAgain, I’ve done that before and it impacts on the images not being displayed.EddieUnfortunately you will need to do it againEddieIf you setup the URL forwarder again, making sure the \"use wildcard\" option is checked, it will probably forward for your www subdomain and any other subdomainsYouUnfortunately, I have already said, I’ve done that and it doesn’t load the images.EddieI'm not seeing that you've recreated the forward, please try recreating the forward as I have instructedYouPlease read my historical replies above ⏏️Eddie ended the chatReview edit:Thank you for your reply.We find part of your reply as a weak excuse.The employee with highest reviews should be monitored more. Also, it’s not just about us, make sure at all times Eddie is performing to highest standards.Thank you."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lynne",
          "Nb_Reviews": 3,
          "Date": "2023-12-15T21:42:50.000Z",
          "Titre": "I renewed 2 domain names...",
          "Contenu": "I renewed 2 domain names, one .com, one .org. Both were transferred on the same day and now renewed at the same time. Not only did you charge more for the .org but it also expires before the .com.End result, they no longer have the same renewal dates. You were doing so well so, what do you guys have against .org?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grant",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T05:00:01.000Z",
          "Titre": "new CC and when I was sent to \"Stripe\", it didn't recognize it",
          "Contenu": "First, you would not let me update my zip code on my credit card.  It was off by one digit, the last one.  How did that happen?  Did you guys truncate it?  I don't know if it worked when I first purchased, but I think it did.Then I entered a whole new CC and when I was sent to \"Stripe\", it didn't recognize it at all, so I had to re-type everything again.  Previously with the wrong zip code, Stripe at least had that number automatically, so it sometimes works.  We'll see if it auto renews correctly next year.The rest of the website seemed to work and it was fast."
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "JF",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T18:08:10.000Z",
          "Titre": "Good but they increase prices without notice",
          "Contenu": "I like the interface and all, but the renew price just keeps increasing without any previous notice! It's now almost 25% more expensive than when I first registered the domain."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Egg Nog",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T18:57:14.000Z",
          "Titre": "I wanted to use a catchall mailbox for…",
          "Contenu": "I wanted to use a catchall mailbox for my email addresses, and some unaddressed posts seemed to indicate that routing email through a Porkbun-registered domain would somehow limit the catchall functionality. If I've misunderstood this, please address it on your site. I only registered domains for which email isn't a possibility. I would register more if this issue was made clear. Otherwise, I found the site easy to navigate."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T20:32:56.000Z",
          "Titre": "Too much junk mail and phishing scam…",
          "Contenu": "Too much junk mail and phishing scam emails. Porkbun needs to do a better job of protecting its clients from suspicious emails."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Numbat",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T07:35:18.000Z",
          "Titre": "PayPal watch out.",
          "Contenu": "I was paying with PayPal and a page came up with a 'Review and Continue' button. I thought there was another page before I confirmed payment but the payment went through on that click."
        },
        {
          "Note": 3,
          "Lieu": "MA",
          "Pseudo": "aze-eddine jamal",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T08:27:53.000Z",
          "Titre": "Your platform is a beautiful platform",
          "Contenu": "Your platform is a beautiful platform. The only problem I found is the payment problem. My bank card is often rejected despite the availability of money, which makes me buy from other platforms."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Walter",
          "Nb_Reviews": 3,
          "Date": "2023-11-01T00:28:21.000Z",
          "Titre": "Paying for the new domain was/is a bad…",
          "Contenu": "Paying for the new domain was/is a bad experience.  The form kept telling me that my phone number is invalid, which it isn't.  Then I received an email thanking me for my order.  Now it looks like my card was charged twice.  I  hope I'm not going to have an issue having the 2nd charge credited to my card."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Beautiful Bike",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T06:59:27.000Z",
          "Titre": "Payment bounced back, customer service helped out.",
          "Contenu": "The first three times I tried to pay for my domain the payment bounced back. I had to contact Porkbun customer assistance, which solved the problem quickly, which is great - but the system should work smoothly, hence the 3 stars. I hope this gets fixed soon."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Anthony Dulong",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T18:17:17.000Z",
          "Titre": "You replaced my public_html root…",
          "Contenu": "You replaced my public_html root directory and I lost all of my files"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nick",
          "Nb_Reviews": 3,
          "Date": "2023-10-11T06:54:35.000Z",
          "Titre": "I was forced to try a new registrar…",
          "Contenu": "I was forced to try new domain registrars since Google Domains tossed its customers in the trash, as they usually do. Like most other companies in the registrar space, unfortunately Pork Bun is just meh. I am sure the networking stuff behind the scenes works great...I hope, but coming from Google, this UI/UX is just a sad disappointment and downgrade.  - Streamlined domain search, Google Domains was much better at giving suggestions and presenting the myriad of domain results to the user. Pork Bun feels unintuitive and endless scrolling of the same results. - \"Refresh the page\" in 2023 should not be a thing. The UI should refresh the page when it knows transactions and updates are complete. -  The user's list of purchased domains looks like a clone of 90s Hosting control panels. - The DNS management loads in a modal and has horrible UX. This might seem like nitpicking, but this is what made Google Domains so attractive, they did one thing and did it extremely well. I hope one of these days somebody comes along and just does domain management for software engineers the right way."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Colby Russell",
          "Nb_Reviews": 1,
          "Date": "2023-10-22T20:00:16.000Z",
          "Titre": "Wouldn't accept my card",
          "Contenu": "Wouldn't accept my card.  I had to log in to privacy.com, generate a single-use card, and then use it to pay at checkout.  The same thing happened earlier this week.  It's annoying.It's also a little heartstopping noting that the payment screen is not hosted on porkbun.com..."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Michael Newton",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T04:12:07.000Z",
          "Titre": "Payment was easy but prices are misleading",
          "Contenu": "Payment was easy but prices are deceptive & misleading. It's not until you reach checkout that you realise prices are in USD & not in AUD. I checked settings & there is no way to update your currency preferences."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ron Loffland",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T03:41:22.000Z",
          "Titre": "Need more automated help in pointing…",
          "Contenu": "Need more automated help in pointing domains from others hosts to pork in so I can actually use the domain."
        },
        {
          "Note": 3,
          "Lieu": "BG",
          "Pseudo": "AJ",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T16:30:53.000Z",
          "Titre": "lower hosting prices and extend SSL duration",
          "Contenu": "Site is well organized, domain prices are ok, free SSL is nice but 3 month expiry period is a bummer and hosting prices are EXPENSIVE. Hence and average rating..."
        },
        {
          "Note": 3,
          "Lieu": "LB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-02-16T15:37:23.000Z",
          "Titre": "Lovely with some culprits",
          "Contenu": "I appreciate the communication and client-oriented behavior you showcase; the tone of the emails, the content, and the offers provided by Porkbun are impeccable.The user interface and experience, however, aren't the most optimal; and the fact that there are much fewer Porkbun resources than for other providers is bothersome for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan Lombardo Dan Lombardo",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T22:20:02.000Z",
          "Titre": "I made the mistake of using my real…",
          "Contenu": "I made the mistake of using my real phone number when buying a new domain. Although I changed to 555-1212 first thing in the morning, I got 29 calls and 8 texts the first day from people asking me to use their marketing or website services. It’s 3 days later and I’m still getting 15 calls and 5 messages per day."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Engino",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T03:35:51.000Z",
          "Titre": "Good prices but the platform is buggy…",
          "Contenu": "Good prices but the platform is buggy as hell. I repeatedly bring up the same issue over and over again but they never fix it and new ones keep popping up. I wouldn't recommend keeping any valuable names here as I am skeptical of their ability to secure their platform."
        },
        {
          "Note": 3,
          "Lieu": "UA",
          "Pseudo": "Alexandr Novoselov",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T15:40:11.000Z",
          "Titre": "I'm not big fan since my domain…",
          "Contenu": "I'm not big fan since my domain expenses doubled because of \"premium\" status. 5 years it was regular and now for some reason not. Next year I'll consider if I really need to renew."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sevan Aight",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T00:01:08.000Z",
          "Titre": "Payment system forces you to use Pay…",
          "Contenu": "Payment system forces you to use Pay Pal.   Way too much time spent on \"security\" hiccups to purchase or renew a domain.  Other than that Porkbun has been a spectacular service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David W McGuire David W McGuir",
          "Nb_Reviews": 2,
          "Date": "2023-01-17T05:12:08.000Z",
          "Titre": "Price was not as displayed",
          "Contenu": "When I went to make a purchase the price came back higher- it said that the discount was no longer available. When I went back in again later the lower price was still listed. When I clicked again to purchase it said lower price no longer available. Somewhat of a bait and switch."
        },
        {
          "Note": 3,
          "Lieu": "TH",
          "Pseudo": "Evgenii Bos",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T09:19:51.000Z",
          "Titre": "cant setup ns servers before domain…",
          "Contenu": "cant setup ns servers before domain transfer complete, interface is too ugly"
        },
        {
          "Note": 3,
          "Lieu": "HK",
          "Pseudo": "Bill Sim",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T03:31:03.000Z",
          "Titre": "Cheap service costed me more",
          "Contenu": "Low price was the biggest reason that attracted me to Porkbun, and admittedly they does provide the lowest domains list price and normal services are good enough.However, the disappointing part was that when .ONE domain announced to double price, Porkbun failed to take it serious. The reminder was sent only once and one week before the price doubling from a promotional email address with distracting emojies in title. Not surprisingly, this important email was automatically classified as promo by email filter and hence missed.Had Porkbun took the reminder more serious, I would of course choose to renew 10 years with old price. But now I have to spend more money every year to renew my .ONE domain subject to the doubled price."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Peter",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T11:10:32.000Z",
          "Titre": "Great company.",
          "Contenu": "Payment process not straight forward. My payment was rejected several times for no apparent reason. Other than being over cautious perhaps.Or maybe that's just a sign of the times.Wouldn't stop me using or recommending pork bun to anyone wanting to register their web site."
        },
        {
          "Note": 3,
          "Lieu": "AT",
          "Pseudo": "Akshay",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T06:45:42.000Z",
          "Titre": "Great Pricing & quick support, but transactions may get incorrectly blocked",
          "Contenu": "The pricing at Porkbun is super transparent and very affordable - depending on the TLD, they may have the cheapest pricing across all registrars. The whole UI is excellent and management options are very easy to find and change.However, I had to try making my purchase five times before it went through. I contacted support about this and they responded within 7 (originally said 36 hours because I cannot maffs) hours. They said that \"It looks like the IP address you are connecting from has a fraud reputation associated with it. Can you try connecting to us from a different network?\".I've had this IP from my ISP for less than a year now and I have no idea who had it before me. The \"solution\" they suggested does nothing to improve user experience and obviously doesn't deter fraud. The fifth time, I completed the purchase over Mobile Data via my work SIM."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Abdulaziz Al-Ben Hamad Abdulaz",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T20:00:22.000Z",
          "Titre": "OVER 24 HRS TO COMPLETE THE PURCHASE",
          "Contenu": "I tried to use a pre-paid VISA card to pay, but it was rejected multiple times. The Customer Care team instructed me to complete verification steps in order to validate the payment. I did it all. I even submitted my ID card and waited more than 6 hours afterwards. Once again, the payment did not go through. I had to use another card to complete the purchase. Why is that bothering me? 1. Using a not pre-paid card compromises protection; 2. Having to wait over 24 hours to simply pay. Don't get me wrong! I appreciate you caring for customers' financial security and applying procedures against fraud, but should be working more efficiently. Otherwise, it is going to backfire."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Walter Mayne",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T07:47:29.000Z",
          "Titre": "Only offering discounts to new…",
          "Contenu": "Only offering discounts to new customers. Every purchase is new business. This prompts customers to look elsewhere"
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "lifehacks.xyz",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T08:52:29.000Z",
          "Titre": "Can't pay by YouTrip",
          "Contenu": "Not sure why my YouTrip mastercard was rejected twice, with the error code 001 (something about payment method not accepted). I get the best exchange rates and no extra fees on this card, so it was a bit of a bummer to have to pay via another card."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "A Eders",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T18:45:02.000Z",
          "Titre": "Customer service reply to my tech query…",
          "Contenu": "Customer service reply to my tech query on (chatbox) took hours to received."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ash",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T18:16:01.000Z",
          "Titre": "Ok hosting can do better",
          "Contenu": "Great hosting can do better. When I first joined Porkbun, they offered the cheapest prices. But things have taken a turn, other providers now can offer way more cheaper prices. While yes, Porkbun still offers I'd say some of if not the best first year prices, things have changed. Companies have better after first year pricing. But I must say for the price, the quality of the domain management is some of the best. However, I'm kind of disappointed that they do not offer live chat, if they do I can never seem to find them online. E-Mail is fast. But other registrars even cheap ones offer live chat. I like the Cloudflare DNS thing they do in domain management. DNS records are smooth sailing too. Nameservers change fast too. So I'd say price, and support is where Porkbun can do better.Edit feel its annoying and dumb that they just auto renew your mail plans with no option to turn off auto renewal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Nivi",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T06:01:24.000Z",
          "Titre": "There is a delay of 30 mins in…",
          "Contenu": "Pros: Good thing is porkbun is economical and affordable. Easy set up of new domain and forwarding domain from other domain registrar to porkbun. Easy set up of host email and forward email Cons: There is a delay of 30 mins in receiving emails from other accounts to host email/forwarding gmail and delay of 2-5 mins sending email outbound from gmail. I reached out to the help desk and they said there is some issue with mail server from couple of days and it should get resolved soon but still i see lag in receiving emails and sending as wellAlso the website purchased via porkbun is very basic and in black n white but i expected a better version of website in basic plan."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Hernan Trajtemberg",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T11:24:02.000Z",
          "Titre": "new domain purchase",
          "Contenu": "I liked the renewal price which is less then most competitors.It could be nice to have links for usefull tools or tips (not only how to add or forward email, what's the best practices and such) for freelancer or new businesses"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frank Allen",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T15:38:01.000Z",
          "Titre": "EASY to get the domain started and…",
          "Contenu": "EASY to get the domain started and navigation is ok. BUT trying to get Wordpress going is a pure pain. WP is supposed to be \"easy\". It has been a clown circle for us trying to figure this out. ANY move seems to require signing in and or having to load/download Something. Sigh."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T18:25:15.000Z",
          "Titre": "Notify Account Needs Verified",
          "Contenu": "I was half way through the process of checking out when I was informed that my account was not verified, so I had to go back and do that. Notify people that their account needs verified before starting the checkout process."
        },
        {
          "Note": 3,
          "Lieu": "SG",
          "Pseudo": "AK",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T11:46:30.000Z",
          "Titre": "Cheap fees, confusing experience",
          "Contenu": "On one hand, the fees were clearly explained, and the renewals were much less than other domain registrars. On the other hand, the account creation process was a bit confusing, and I couldn't use my credit card (I use DBS in Singapore)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Klapman",
          "Nb_Reviews": 1,
          "Date": "2023-04-16T05:12:44.000Z",
          "Titre": "UI needs a lot of work for first time users",
          "Contenu": "scare tactic for email being on a compromised list is not indicative of a security issue by the user but from hacked corporations.sign on as a new user was difficult with confusing messages when verification was being accomplished from separate devices.very difficult to determine if domain owner privacy is turned on or notthe time delay to purchase was longer than expected to the point that it appeared the system was hung. setting expectations would help here"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brent Cordner",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T16:26:49.000Z",
          "Titre": "What did I pay for?",
          "Contenu": "After I completed my order, I did not get a page that stated the order was placed or that the domain name I requested was mine. I had to check my email for that. And the email does not contain the web address I reserved. So at the moment, I have confirmation that I placed an order and paid for something but no indication as to what that is."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T19:43:21.000Z",
          "Titre": "prices have gotten more expensive and…",
          "Contenu": "prices have gotten more expensive and letting the domain go to auction where it’ll likely get parked for $500+ is too much cost to give up the domain name for a year or two"
        },
        {
          "Note": 3,
          "Lieu": "JP",
          "Pseudo": "SMC",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T07:36:33.000Z",
          "Titre": "I do not uses their services, just their suffix",
          "Contenu": "To be honest in a world where it is the end of the universe if you are not a 5 star everyone has missed the point. 3 stars should mean meets expectations and acceptable but now it seems to mean 2nd level of disappointment. Not for me. I ONLY use Porkbun for selling me the .ski suffix to a URL. I do not use them for hosting or any other service. I simply buy the name from them online. I think the suffix price is crudely expensive, but that is the case for almost everyone. So did they provide my expectations 100%  But I am not sure how they could acheive a 1 star or a 5 star when I had no service involvement with them at all."
        },
        {
          "Note": 3,
          "Lieu": "GE",
          "Pseudo": "Oleksii R",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T21:16:06.000Z",
          "Titre": "Difficulties with payment",
          "Contenu": "Stripe did not accept the Georgian TBС bank card for payment. I had to create an account on Coinbase and pay with cryptocurrency. Add the exact amount to be paid, not just an offer to refill the account."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": ".cloud and .work owner",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T17:03:54.000Z",
          "Titre": "They fake whois info on their whois server for .cloud and .work renewals.",
          "Contenu": "They fake whois info on their whois server for certain domain renewals. .cloud and .work TLD renewals.They take the renewal money but do not propagate the whois info outside their own whois server.In the case of the .cloud domain the domain registry confirmed they had not renewed.They now say that they wait for the end of the renewal period outside the expiry date to actually to the renewal and they say this is the practice of every registrar.Edit: FYI What they call the \"Autorenew period\" is outside the Expiry of the domain. So there is about a month when other global Whois servers show your domain as expired. The only Whois server that will show it in date is their one. That is what I mean by faking the renewal.No matter how much I insist they process the renewal they refuse. The only option is to get a transfer code and transfer the domain to keep it safe.And then they give a refund because the transfer is for that year and not for the next year. Because it was not actually renewed.And there is no option to manually renew it on their website in this \"Autorenewal Period\" because the website pretends it has already been renewed. Hence me calling it a fake renewal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda P.",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T06:01:04.000Z",
          "Titre": "Not as convenient as it should be.",
          "Contenu": "I've been such a fan of porkbun that I decided to transfer my last remaining domains over. The process was not smooth. First my credit card was charged but the transfers remained in my cart. I had to contact support, then re-paste the auth codes in the bulk transfer form from scratch FIVE TIMES. I inquired about paying with ACH (bank account) to get a lower price for each domain. Again, have to contact support. I wait for them to verify my bank account, which takes 2 days. Then, instead of just having a button for ACH at checkout, I have to buy credits in advance and wait for them to be made available, which took five days. In the meantime, I wanted to register a new domain. I could add it to my cart, but I had to wait until the credits were available before I could pay. I could not charge my credit card unless I canceled the ACH-only setting, which requires that I ... yeah ... contact support. It was Sunday evening, so had to wait another day. They do respond quickly during business hours, but I tend to do things outside business hours. So, very inconvenient. I wish things were more automatic. Sadly, they are raising prices again, but it's apparently industry-wide. The prices are still much better than my last registrar."
        },
        {
          "Note": 3,
          "Lieu": "LB",
          "Pseudo": "Chris",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T08:28:04.000Z",
          "Titre": "Great support, not-so-great timeline",
          "Contenu": "Kudos for the quality of support, patience, and professionalism of support agents.It did take around 1 week for me to resolve my issue, mainly because of the time difference between mine and PorkBun's operating hours.The UI's counterintuitiveness in some aspects and non-round-the-clock customer support IMO increased the ticket's longevity from a potential couple of hours to a week."
        },
        {
          "Note": 3,
          "Lieu": "AG",
          "Pseudo": "Janet Bento",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T03:20:48.000Z",
          "Titre": "sometimes I find it very hard to sign…",
          "Contenu": "sometimes I find it very hard to sign into my account even though I have two-factor verification.  However, when I do manage to sign in immediately everything else goes smoothly."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "DD",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T13:16:22.000Z",
          "Titre": "The search for domains is very annoying…",
          "Contenu": "The search for domains is very annoying as there is no filter for not available or to expensive domains.Imidiatly after changing my email I got a spam newsletter I never signet up for."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "mbr",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T10:42:39.000Z",
          "Titre": "Having to have a User name sucks",
          "Contenu": "User name sucks. I feel that's so 2000. It really screwed my password manager flow up. Otherwise, good selection of domains at a decent price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "an otherwise satisfied user",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T02:23:18.000Z",
          "Titre": "Unwieldy interface",
          "Contenu": "The interface for setting up the actual domain with DNS records, etc. is very cluttered and hard to navigate."
        },
        {
          "Note": 3,
          "Lieu": "LV",
          "Pseudo": "Buying from EU",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T15:44:23.000Z",
          "Titre": "I like the vibe of the company, not so much the purchase process",
          "Contenu": "I like the vibe of the company, made me feel I could trust them but the purchasing process put that to the test. Maybe it was just bad luck or geographical luck, but I hope it'd improve"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Angel Ruiz",
          "Nb_Reviews": 2,
          "Date": "2023-03-11T10:24:00.000Z",
          "Titre": "There is no tutorial on how to setup…",
          "Contenu": "There is no tutorial on how to setup Dynamic DNS with PFsense with Porkbun. I also had issues setting up DNSSEC with Cloudflares public key."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Kim",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T20:23:22.000Z",
          "Titre": "Better than GoDaddy...",
          "Contenu": "It's fine. Still have a technical issue that hasn't been resolved for over a year now since I transferred over the domain to Porkbun. Thankfully a workaround exists."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Navharsh Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T20:14:10.000Z",
          "Titre": "Needs Indian payment option of UPI",
          "Contenu": "I had multiple issues with indian cards and had to pay extra through paypal due to high conversion charges along with markup charges on card, If only you had upi payments in place the whole thingh would have been done in seconds."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alexander Sheikh",
          "Nb_Reviews": 4,
          "Date": "2023-11-01T11:45:42.000Z",
          "Titre": "Email forwarding did not work",
          "Contenu": "The options offered with the domain did not work as advertised."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "okei",
          "Nb_Reviews": 2,
          "Date": "2023-08-18T14:25:30.000Z",
          "Titre": "buggy payment. use paypal.",
          "Contenu": "buggy paymentnone of my indian credit or debit cards workedhad to paypal to get it to work. which could be because of the VPN i was running."
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "Abdulfattah Abdulsamad Abdulfa",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T03:43:43.000Z",
          "Titre": "That is ok but difficult in management…",
          "Contenu": "That is ok but difficult in management of damain . i just want to change a server .i find itvwith difficult . also no chat online ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Orion Leon",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:32:43.000Z",
          "Titre": "better user interface",
          "Contenu": "I would like a better user interface"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Skylar Saunders",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T02:48:33.000Z",
          "Titre": "I'm really excited to have this website…",
          "Contenu": "I'm really excited to have this website but the advertisement I clicked on said one year free on it. I don't see where in my order I got any discount."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Dina Rahmany Zilberstein",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T15:22:20.000Z",
          "Titre": "You were very kind to me when my credit…",
          "Contenu": "You were very kind to me when my credit card hacked, but it was difficult to find where can I find alternative methods to pay"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Akhilesh Chitte",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T20:33:59.000Z",
          "Titre": "The fee you are charging for the domain…",
          "Contenu": "The fee you are charging for the domain name I didn’t like, porkbun used to be a reasonable registrar but no you started charging more price"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Domainers",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T08:34:03.000Z",
          "Titre": "Used to have amaaaazing prices",
          "Contenu": "Used to have amaaaazing prices. Seems to be quite the opposite now. Brain-bending new prices. Triggers a bit of sadness, really way overboard.  It was very sweet for first few years."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Amin Pakseresht",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T22:43:04.000Z",
          "Titre": "Your checkout is confusing",
          "Contenu": "Your checkout is confusing, I already have a credit card in file but I was asked to enter the card info at the checkout. Not a big deal but can be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "robert fisch",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T02:53:12.000Z",
          "Titre": "Had trouble with checkout process",
          "Contenu": "Had trouble with checkout process. Took two hours and several tries."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LMP",
          "Nb_Reviews": 2,
          "Date": "2023-09-07T21:55:53.000Z",
          "Titre": "Had to input CC info three times!!!",
          "Contenu": "In order to secure the laytonpayne.pro domain, I needed to enter my credit card info THREE TIMES!!!!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-05-08T09:39:54.000Z",
          "Titre": "Offers cheap price for domains. Stay away if you want to set up custom email hosting.",
          "Contenu": "I purchased a domain from them due to the cheap price. UI isn't as polished as other domain providers out there but it was manageable and functional.When I was setting up Zoho mail on my domain, I found a bug where it doesn't save MX records when the host is set to \"@\". Their documentation claims that it should support it, but actually throws an error when you add MX records with an \"@\" host. I expected the MX record to be added as \"@.mydomain.com\", but instead only shows \"mydomain.com\". After 2 hours, I couldn't set up my Zoho mail properly so I looked for alternatives.I thought that this \"bug\" was a ploy to get me to purchase their email hosting service... so I bought it for $24 AUD / year (they only do bulk billing). I set up their email hosting as specified in their documentation... and everything worked except for the automated acknowledgement email I send whenever my support inbox receives an email.When an email is sent to my support inbox, the automated response only comes in if the webmail UI is opened. When the automated email is sent to the customer, it goes to the spam folder instead of their inbox. I sent an email to Porkbun's customer support to talk about this. They said that my email hosting is set up correctly in my domain. I gave information about where the issue is but they never got back to me. It's been 2 weeks!TLDR; If you're purchasing a domain and you don't need to support email hosting in the future, use Porkbun. If not, don't use this service due to inaccurate documentation and buggy email hosting."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Flor",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T21:41:02.000Z",
          "Titre": "Site would become unavailable",
          "Contenu": "Site would become unavailable, SSL cert error, error when adding DNS records that are totally normal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Art Malkov",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T01:37:59.000Z",
          "Titre": "Charged my cards twice but didn't go…",
          "Contenu": "Charged my cards twice but didn't go through. Had to pay with PayPal to complete transaction."
        },
        {
          "Note": 3,
          "Lieu": "DZ",
          "Pseudo": "Jhon",
          "Nb_Reviews": 1,
          "Date": "2023-07-08T01:12:58.000Z",
          "Titre": "I'm not happy with the recommendations…",
          "Contenu": "I'm not happy with the recommendations of LGBT domains in my email and my dashboard. I didn't sign up for that."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "paul",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T18:43:45.000Z",
          "Titre": "Some weird errors at first when trying…",
          "Contenu": "Some weird errors at first when trying to checkout with a debit card"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Eli Bukin Eli Bukin",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T14:17:03.000Z",
          "Titre": "at first the domain was not expensive",
          "Contenu": "at first the domain was not expensive, but the renewals are more expensive than the initial purchase."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "sylvester s",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T08:22:36.000Z",
          "Titre": "better customer support scope is huge.",
          "Contenu": "better customer support scope is huge.customer helpful design is better than industry average. will do greater with incremental honesty which too is better than industry average"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Tanmay Adithya Marni",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T22:33:13.000Z",
          "Titre": "I disliked the fact that i had to give…",
          "Contenu": "I disliked the fact that i had to give my home address and everything instead of just an email and password"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Anjela",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T03:37:31.000Z",
          "Titre": "Almost Great",
          "Contenu": "Great, except for the almost enforcement of LINK. Dont want it..Thankyou"
        },
        {
          "Note": 3,
          "Lieu": "PL",
          "Pseudo": "Alek Chmura",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T09:38:06.000Z",
          "Titre": "Good job porks!",
          "Contenu": "Overall experience is fine except that it’s a bit difficult to find a place where i can renew my subscription so i would suggest you to improve a little UI and UX to keep it up to date and more intuitive for users."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "abhey",
          "Nb_Reviews": 2,
          "Date": "2023-05-01T07:12:34.000Z",
          "Titre": "Buying domain is smooth and seamless",
          "Contenu": "Buying domain is smooth and seamless. But there support sucks late response."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Blasini Mark Blasini",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T15:24:11.000Z",
          "Titre": "I was not able to use my debit card to…",
          "Contenu": "I was not able to use my debit card to make the purchase, which I find inconvenient."
        },
        {
          "Note": 3,
          "Lieu": "HN",
          "Pseudo": "Juan Espinoza",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T01:13:48.000Z",
          "Titre": "The credit card form wouldn't accept mine while PayPal does",
          "Contenu": "I love the service, but it's so hard to pay for it.The credit card form wouldn't accept my card. I had to use Pay Pal, which then used that very card just fine.You should check that form. And why is there a Zip Code, not everyone is in the US"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Apoorv Nema",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T07:38:23.000Z",
          "Titre": "Very few payment options available",
          "Contenu": "Very few payment options available for Indian users and after many support mails I am able to purchase the domain from the credit card that I intended to use also the support time is little inconvenient as it is opposite of working hours of Indian Users."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jamie H",
          "Nb_Reviews": 10,
          "Date": "2022-12-14T18:04:47.000Z",
          "Titre": "I've been a Porkbun customer for 3…",
          "Contenu": "I've been a Porkbun customer for 3 years. In that time I've spent just under $17,000 on domain registrations for clients. Last week I had a request to submit ID - no problem and it was done using their automated system within 24 hours. Yesterday I had a mail to say they hadn't heard back and the account was at risk of suspension. Again, I've no problem with that and immediately mailed back to say it had in fact been completed.Today I've gone to register more domains for my clients and received a message to say the account was now suspended. No investigation or mails to me to say it hadn't actually been received - just a straight suspension of the profile. To treat a client who has put through so much business this way is beyond belief. I'm hoping that this piece of feedback may speed up a response to the 2 mails that I'm yet to hear back on...Edit updated to 3 stars - I love the simplicity of the site and prices but this experience leaves a bitter taste. I resolved the issue myself by contacting livechat who undid the suspension but throughout the conversation offered no apology."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mathieu Gagnon",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T00:40:23.000Z",
          "Titre": "I think charging 10% to convert BTC…",
          "Contenu": "I think charging 10% to convert BTC into $ is ridiculous. You should only accept BTC, USDC has custodial risks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff G.",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T01:19:16.000Z",
          "Titre": "Not bad but could be better",
          "Contenu": "Overall the UI is pretty good and easy to use. The main login page takes forever to load on my Windows 7 laptop, which only happens on bloated pages or pages running tons of unnecessary javascript. This problem isn't noticable on my newer computer but I often have to use porkbun from the old one.Aside from that the only other slight annoyance is the small input box for TXT records in DNS. My SPF strings are a few lines long and it is hard to edit them by scrolling around on a single line."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "John Faulk",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T15:17:47.000Z",
          "Titre": "It was fine",
          "Contenu": "It was fine. But not spectacular. And I am not sure my coupon was used in the final pricing of my purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Desiree Seay",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T21:14:44.000Z",
          "Titre": "I'm still trying to figure out how to…",
          "Contenu": "I'm still trying to figure out how to use the site."
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "David Battistella",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T11:48:06.000Z",
          "Titre": "support knowledge base hard to find",
          "Contenu": "It was hard to find support knowledge base from the main page."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "BLAK",
          "Nb_Reviews": 12,
          "Date": "2023-02-17T00:49:15.000Z",
          "Titre": "It started very good BUT",
          "Contenu": "It started very good with amazing prices but now eventually increased by many others in the market."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "Gunho Kim",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T13:30:19.000Z",
          "Titre": "Cheap Price and chat service about problems",
          "Contenu": "Good :  Price and chat service about problemsBad : 1,  you have not premium customer service  (price discount rates  for high level customer )2, you don't support domain's traffic stats (forwarding, parking) by visitors"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Serhat Şevki Dinçer",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T14:20:35.000Z",
          "Titre": "1 year .io renewal for $41.68 with BTC",
          "Contenu": "1 year .io renewal for $41.68 with BTC, was $31.20 with card last year.Crypto payment process was quick and smooth."
        },
        {
          "Note": 3,
          "Lieu": "EG",
          "Pseudo": "Seif ElDin Ashraf",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:03:35.000Z",
          "Titre": "I need improvement for registration",
          "Contenu": "I need improvement for registration, it is so complex."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "WouldAPaidActorHaveThisName",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T13:29:10.000Z",
          "Titre": "Trying to add a custom domain to my…",
          "Contenu": "Trying to add a custom domain to my firebase hosted website, had some issues trying to set up the DNS Records, the problem ended up being the pre-set DNS Records from Porkbun prohibited me to add the custom DNS Record required from Firebase, which was annoying and makes me question the usefulness of those pre-set settings."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Niladri Chakraborty",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T13:28:36.000Z",
          "Titre": "Don't get any discount on domain…",
          "Contenu": "Don't get any discount on domain renewal."
        },
        {
          "Note": 3,
          "Lieu": "MY",
          "Pseudo": "Melvyn",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T05:57:12.000Z",
          "Titre": "Double Authentification Protection",
          "Contenu": "Double authentication protection nevertheless is a great idea, but the process and instructions is confusing and frustrating especially for the non technology savvy users like me, need to be simplified to gain overall support."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "RODRIGO B LAURINDO RODRIGO B L",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T20:40:02.000Z",
          "Titre": "dns propagation is too slow"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Chris O",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T20:19:26.000Z",
          "Titre": "Easy enough to use",
          "Contenu": "Easy enough to use, prices ok but can usually find cheaper if you shop around."
        },
        {
          "Note": 3,
          "Lieu": "DO",
          "Pseudo": "Jose Francis",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T00:24:10.000Z",
          "Titre": "i cannot verify my phone number"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pam Schweisthal",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T16:52:54.000Z",
          "Titre": "The billing is very confusing."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Thangarasu S",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T09:09:21.000Z",
          "Titre": "I cannot do payment via Gpay."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Brian Ryan",
          "Nb_Reviews": 2,
          "Date": "2022-04-16T10:20:12.000Z",
          "Titre": "It started off rather nice, hope we can continue.",
          "Contenu": "It started off rather nice, but then I experience hack and PTSD from being phished. I just could not create the same especially when sudden instances of my site not working out! Now I feel like I'm banned and I do not know... I even bought merchandise. Yellow describes my heart! #brianryan"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "honeymustard",
          "Nb_Reviews": 11,
          "Date": "2022-03-15T03:13:18.000Z",
          "Titre": "Use to be a HUGE fan, now confused and disappointed",
          "Contenu": "A few years ago, I was so happy to discover porkbun.Now I am very confused with technical and billing issues.I was certain I updated several names to manual renew.I keep a notepad of names to renew or delete.There was domain priced at 34.95 a year that I never used. I knew I had week left before I need to delete it. Porkbun renewed and charged me for the domain 8 days early.I'm on a tight budget as a student and this ruined my weekend.Even GoDaddy doesn't renew 8 days early!Update, I appreciate that Porkbun DID refund me. I just ask that they include their renewal terms in an FAQ."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Paul Finlay",
          "Nb_Reviews": 11,
          "Date": "2021-06-16T22:01:42.000Z",
          "Titre": "I lost a lot of customers with Porkbun",
          "Contenu": "Website down. Many users on Twitter are reaching out to say that their sites are down but there is no response from the company. I understand it might be the middle of the night where they are based but unfortunately, the internet is 24/7 and I can't sit here with my website down damaging my business."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maxwell Maxwell",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T00:59:43.000Z",
          "Titre": "Excessive expenses",
          "Contenu": "The products are getting expensive and unfordable"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JILLIE GETTY",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T07:59:33.000Z",
          "Titre": "I could only add 2 domains to the cart."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ryan Campbell",
          "Nb_Reviews": 1,
          "Date": "2021-09-03T23:07:34.000Z",
          "Titre": "The services this company offers don't…",
          "Contenu": "The services this company offers don't work and they blame Microsoft and your ISP. I have wasted several hours going round and round with all three companies trying to figure out why all my emails go to spam and why outlook for android mobile won't connect. They are low budget and a waste of time. If you want your email to actually work use a different company.Update: Porkbun made some changes and now it seems that my emails are no longer going directly into spam folders. They said that I could install an older version of outlook for mobile to workaround the mobile outlook issue but I am opting to use samsungs mobile email platform and it is working fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Orion Leon",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T03:28:27.000Z",
          "Titre": "My experience from Google Domains to Porkbun",
          "Contenu": "Before using porkbun, I was using google domains, and now I don't want to use squarespace, so I looked around reddit, and decided on porkbun. I have been using porkbun for 2 months now.I love the simplicity of porkbun, but I feel that something that could be changed is the user interface. Right now it looks like this (partial screenshot to hide personal info): imgur[DOT]com[SLASH]a[SLASH]sK0iY97, but I would like it to be more like this, as I came from google domains with a very good management console (pic from google): imgur[DOT]com[SLASH]a[SLASH]19rjEQi.I understand that you may be busy, but could this be considered for a future update?Note: Trustpilot doesn't allow links, so I had to use placeholders"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annie Allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:01:01.000Z",
          "Titre": "Needed help but got it done.",
          "Contenu": "Honestly, I received a great deal of help from my webmaster navigating the site.  But all the fields were relatively easy for a novice. This site could use more explicit instructions on how to register a domain name. I found it a bit difficult to identify which field to insert my hosting site identification."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Mohamed Goukh",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:16:15.000Z",
          "Titre": "User experience is very secure but you…",
          "Contenu": "User experience is very secure but you have a very complex steps For user to manage account you should make it add user with email not a pork bun account because this steps very complex"
        },
        {
          "Note": 4,
          "Lieu": "SG",
          "Pseudo": "Fraser McLean",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T05:40:06.000Z",
          "Titre": "There were some issues with the ID…",
          "Contenu": "There were some issues with the ID verification service, but once those were sorted, it was smooth sailing."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Zoriel Sto Domingo",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T14:06:26.000Z",
          "Titre": "Easy platform & Great Pricing",
          "Contenu": "Easy platform to use. Competitive pricing. Absolute gem for domain investors and web developers. Congrats from Belfast SEO Agency."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marisa",
          "Nb_Reviews": 2,
          "Date": "2023-12-04T22:04:17.000Z",
          "Titre": "Porkbun has my vote",
          "Contenu": "Great experience thus far! My initial domain wasn't available so had to get creative, but finally found one that stuck. Prices were perfect and setup process has been seamless."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "Martin Schneider",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T17:08:07.000Z",
          "Titre": "Good overall",
          "Contenu": "Everything perfect, only my disposable credit card was declined, so I had to use normal card."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Mark Edrian",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T08:58:21.000Z",
          "Titre": "Lowest price so far",
          "Contenu": "Porkbun has the lowest price.Only issue was their cellphone number verification does not send any SMS on my number in Philippines. I've talked to support but they have totally different timezone so we can't talk continuously because their response time was my sleeping time."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Wade Sagor",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T04:05:40.000Z",
          "Titre": "Always good prices and quick service",
          "Contenu": "Always good prices and quick service. Web interface sometimes takes a little while to load which can be annoying when trying to check settings quickly but this is rare and nowhere near dealbreaking. Overall highly recommended."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Jonas",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T02:31:50.000Z",
          "Titre": "Customer support is really nice",
          "Contenu": "Customer support is really nice. Webmail is very cheap as well, although it needs support for HTML, its there but its not working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karl Notturno",
          "Nb_Reviews": 1,
          "Date": "2023-11-03T12:22:56.000Z",
          "Titre": "Extraordinarily Functional",
          "Contenu": "Not particularly amazing aesthetics, but amazing utility. The attention to detail for user experience is great, but I wish that the actual look of the website were slightly more polished, but perhaps that's asking for too much from the couple of devs who maintain the site. Oh, also, can we pay extra for a catch all email?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "User",
          "Nb_Reviews": 2,
          "Date": "2023-11-01T01:17:54.000Z",
          "Titre": "I like PorkBun",
          "Contenu": "I like PorkBun - I have almost all my domains there. Unfortunately can’t have my unstoppable domains there or my .ca They have a relatively modern website which functions very well. I barely need to even go in and use it because of years between renewal.I would however like to see an iOS and Android app so I could one click renew with Face ID and Apple Pay, and have a nice way to monitor the domains. Ability to update settings with a quick click after face if authentication would be nice."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "CHRISTOPHER SILVERTHORNE",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T06:52:22.000Z",
          "Titre": "Would have been 5 stars",
          "Contenu": "Would have been 5 stars, but I didn't get any apple sauce, gravy, stuffing and crackling skin. That's how we like our pork buns in the UK."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ethan Khou",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T19:42:30.000Z",
          "Titre": "Simple no frills domain purchasing but…",
          "Contenu": "Simple no frills domain purchasing but the only issue I had is there were multiple times where I wanted to buy another domain after I had originally purchased one, and I would get an error message when I tried to add the domain to my cart."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Thomas Meyer",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:38:51.000Z",
          "Titre": "Good Clowns from Porkbun, Greetings and solicitations!   I would have liked to pay for the 1st Year and 2nd year off the start, and would like to know the calendar day for the next payment, and expire",
          "Contenu": "Good Clowns from Porkbun, Greetings and solicitations!   I would have liked to pay for the 1st Year and 2nd year off the start, and would like to know the calendar day for the next payment, and expiration.Continued success in all your endeavors!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Pierce",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T02:22:36.000Z",
          "Titre": "Every product and customer service has…",
          "Contenu": "Every product and customer service has room for improvement.  I asked what I thought was a very straight forward and simple question and got two totally different responses."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Errol Mabunda",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T19:07:46.000Z",
          "Titre": "great experience and great deals",
          "Contenu": "the user experience in the site is quite well, everything is easy to navigate and there's also a lot of great deals"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard O",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T03:35:24.000Z",
          "Titre": "Clear & Simple",
          "Contenu": "Simple process. Clear descriptions. 4 stars because the checkout process claims to accept Apple Pay, but it was not there."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Isaac",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T02:59:25.000Z",
          "Titre": "You probably will have a better experience than I did",
          "Contenu": "I was tagged as fraudulent for no reason, contacted support and it did take hours to get through in their service hours, but they did eventually get it all done in about 5 hours, less than the 24 hours they promise! After that was sorted out, the checkout process went just fine and managing the domain was easy."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "anon",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T17:40:54.000Z",
          "Titre": "The domain was at the correct price…",
          "Contenu": "The domain was at the correct price (unlike the competition who sell domains at cheap and then rake in money during renewals). However, I didn't like that I had to do the KYC and wasn't sure what they're going to do with my data once the process is finished. Hence 4 stars"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "iRolf",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T17:14:01.000Z",
          "Titre": "Better, Cheaper, More Efficient, funkier",
          "Contenu": "checked many registrars as was forced to transfer domains from GoogleDomains discontinuing & moving domains by default to SquareSpace, which is more expensive. PorkBun turned out to be the cheapest, funkiest (in UI/humour/service), more efficient less cumbersome service, better than i.e. GoogleDomains / Godaddy / NameCheap / CloudFlare / SquareSpace etc.the only tip for improvement: even more zen UI, less steps to transfer domains, thank you"
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Alright Dave",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T20:26:38.000Z",
          "Titre": "all good",
          "Contenu": "All good, just would've been nice to automatically carry over the DNS records from godaddy when transferring to porkbun, had to enter them all in manually again. Otherwise great as always, love porkbun !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T14:10:14.000Z",
          "Titre": "I love the ai feature of domains",
          "Contenu": "I love the ai feature of domains. I always rate 4 out of 5. So this is really a 5 out of 5 but no one is perfect. We can strive for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allen Tucker",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T01:52:44.000Z",
          "Titre": "Had temporary error for 10 min when…",
          "Contenu": "Had temporary error for 10 min when trying to register my 1st domain"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jonathan Van Voorhees",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T18:12:40.000Z",
          "Titre": "Less expensive than GoDaddy",
          "Contenu": "Less expensive than GoDaddy and these folks aren’t as pushy. I left GoDaddy because they kept trying to sell me things that I already knew how to do. I was a UNIX Admin responsible for web development and web/email/DNS server configuration and maintenance. Getting bombarded with emails trying to sell me stuff is just irritating. These folks aren’t as bad as the last."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Lukas",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T14:59:48.000Z",
          "Titre": "No gimmicks, no upsells, no distractions.",
          "Contenu": "I chose Porkbun for its simplicity. And that's what I got. Like the title says, there was nothing sketchy going on; no hidden fees, no special pricing that changes after checkout, no upsells and no pressure.Only thing I wasn't sure about was the currency. I logged in from Canada  so it would be nice to know whether the prices were USD or CAD.Other than that, I'll be buying more domains from Porkbun."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kurt Gopaulsingh",
          "Nb_Reviews": 2,
          "Date": "2023-09-25T20:21:42.000Z",
          "Titre": "Signing up and registering a domain was…",
          "Contenu": "Signing up and registering a domain was simple, but I did encounter (yet another) false flag during payment where my email, or IP was falsely flagged as fraudulent. Paying with PayPal saved the day, so I hope things to run smoothly here on out."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "ravi",
          "Nb_Reviews": 2,
          "Date": "2023-08-22T11:32:44.000Z",
          "Titre": "All fine but the premium renewal has no…",
          "Contenu": "All fine but the premium renewal has no justification for domains that were registered at regular prices. Also pleading that it’s registry, is not maintainable since we deal through you i.e. the registrar. May please look into and present before the concerned registry.ravi bhandariHumble SubmissionThe moot question is that how a domain registered as non-premium at regular-prices, suddenly charged at premium prices just because its being renewed for years. Going by this logic every domain can be termed as premium, is just astonishing !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Rushing John Rushing",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T19:42:46.000Z",
          "Titre": "The outcome and cost were as…",
          "Contenu": "The outcome and cost were as represented.  Cannot ask for more."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T11:17:38.000Z",
          "Titre": "better pricing and checkout."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Pierre-Elliott Bécue",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T21:01:48.000Z",
          "Titre": "Pricing is good",
          "Contenu": "Pricing is good. Servies are good. Not able to provide fr domains."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lynley King",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T06:18:53.000Z",
          "Titre": "Easy fun",
          "Contenu": "Was pretty straight forward to set up considering I am a boomer and not as knowledgeable in such things. I think it is a great service and good fun. I look forward to using it over the next 12 months and beyond. Love the range of domain names, excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Grandpa Franks Workshop",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T21:54:15.000Z",
          "Titre": "Fairly easy for newbies",
          "Contenu": "In my 60s and never tried to get a domain name. Researched reviews on You Tube and found this one. Price and security features are good. Fairly easy to navigate site- they seemed to make sure you information is safe as possible from hackers."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "micheal",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T09:13:59.000Z",
          "Titre": "It was easy and simple",
          "Contenu": "It was easy and simple. No hidden fees."
        },
        {
          "Note": 4,
          "Lieu": "GE",
          "Pseudo": "DAVIT ANDZAVELIDZE DAVIT ANDZA",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:26:47.000Z",
          "Titre": "I use it more then one year",
          "Contenu": "I use it more then one year. It's price and services are awesome. Last time I try to deploy site witch contain .webp images format but it's not supported and I have to change images to svg"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ANDRIS STANGA",
          "Nb_Reviews": 10,
          "Date": "2023-08-30T07:00:32.000Z",
          "Titre": "Buying a Domain Name with Confidence",
          "Contenu": "The necessary steps for creating an account give a strong impression of safety and security when using this site. However, I think some of the included benefits of purchasing a domain name could be explained clearly with these benefits being available to to read in a help popup at each stage. But that's me being fussy..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve in Ohio",
          "Nb_Reviews": 2,
          "Date": "2023-08-31T19:29:03.000Z",
          "Titre": "Good Support but room for improvement",
          "Contenu": "I didn’t have to wait long for assistance when I called in to renew my domain name. I did spend quite a bit of time in advance on the website, but was unable to complete this task myself primarily, because there was no easily discernible option or icon that indicated renewal Searching help didn’t do me any good at all. But I did accomplish the renewal and have submitted a transfer request for a different domain. I’m hoping for the best."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Tony F",
          "Nb_Reviews": 7,
          "Date": "2023-07-19T05:33:18.000Z",
          "Titre": "My domain and hosting work well",
          "Contenu": "My domain and hosting work well, at a good price, but I've knocked off a star because I find navigating Porkbun to action stuff confusing. Payment was confusing to setup. Yhe automatic email I  received gave me a link and instructions that didn't match what was at the link. Support requests have all provided much more useful information."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Quinn Harper",
          "Nb_Reviews": 2,
          "Date": "2023-09-26T17:56:13.000Z",
          "Titre": "Converting currency from USD would've been welcome",
          "Contenu": "Converting the currency from USD anywhere on the website / during the payment process would have been very welcome - I only knew it wasn't in AUD when more money than expected came out of my bank account. Other than that, a great experience"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Andy P.",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T17:43:06.000Z",
          "Titre": "Very innovative registrar.",
          "Contenu": "Very innovative registrar.Great website that is easy to use.Prices are close to the cheapest available for many domains.Continued improvements are needed to some UI elements on the site and prices could be a TINY BIT cheaper to make them stand out as the most affordable.All said though, I HIGHLY recommend their services!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daphne Marina",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T11:23:51.000Z",
          "Titre": "Your system is pretty easy",
          "Contenu": "Your system is pretty easy. I was perturbed when \".co\" was available until I was ready to check out AND I don't understand why you got rid of Affiliates. I tell people about the business often. Why not reward your biggest fans? The piggies are great on your \"Awesomeness\" page. cool ideas."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "antek wlodkowski",
          "Nb_Reviews": 8,
          "Date": "2023-11-18T20:11:41.000Z",
          "Titre": "Everything is good except for getting…",
          "Contenu": "Everything is good except for getting free domains: prepaid cards don't work"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Manoj Kumar",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T06:50:46.000Z",
          "Titre": "Very good experience",
          "Contenu": "This site is awesome for price and security and good experience 😁😁 thanks 👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christien Cazarez",
          "Nb_Reviews": 3,
          "Date": "2023-07-30T22:59:17.000Z",
          "Titre": "Great customer support and great…",
          "Contenu": "Great customer support and great services! We have a bunch of domains with them. However, 4-stars due to a non-existent affiliate program. We create hundreds of websites each month and it would be great if we could refer our clients to them."
        },
        {
          "Note": 4,
          "Lieu": "MA",
          "Pseudo": "Bakr Mouline",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T01:54:50.000Z",
          "Titre": "Awesome product. Just needs more polishing",
          "Contenu": "Pricing is really awesome and it doesn't lock any features behind a paywall unlike other registrars. Customer support is super helpfull and they are completely transparent about what they include in the package and what they don't. The only thing that could get better is the ui/ux of the domain management interface. Other then that it's fantastic. I recommand heavily"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 3,
          "Date": "2023-08-15T02:10:56.000Z",
          "Titre": "User Friendly",
          "Contenu": "Porkbun is a terrific service.  On most days I would rate them 5 stars, but today when paying the annual renewal fees on my domain, I had a moment's difficulty figuring out how to do so.  I wound up returning to the email prompt I received and linking to the correct page on the Porkbun website that way.But in general the service is fantastic, and I cannot imagine leaving it."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Benji",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T08:10:44.000Z",
          "Titre": "They're my favourite place for domains",
          "Contenu": "They're my favourite place for domains. I've never had anywhere else as clear, transparent and honest in this space. Their experience gets out of your way and lets you get on with things. Much better than the cometition."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Justin Decker",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T00:39:20.000Z",
          "Titre": "Affordable decent domain set-up site",
          "Contenu": "Porkbun did a good job of easily getting my domain selected and purchased. The difficult part was connecting it to my website hosting and email set-up but I was able to figure it out with not too much trouble. If there were a pop-up for these general basic steps for beginners, that would have been nice. Overall though it has done the job so far (been a few days)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "npg",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T16:54:12.000Z",
          "Titre": "Excellent Service",
          "Contenu": "They’re really cheap, their support is really good, they’re feature rich, and they’re powerful. Only complaint is that their recommendation for DDNS software (ddclient) is no longer maintained, though that’s not their fault."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "TRB",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T06:02:37.000Z",
          "Titre": "Routine name renewal - EDITED",
          "Contenu": "I only renewed a domain name to get this review prompt.EDIT:  My first sentence came out wrong :(   What I meant was... I routinely renewed a domain name and that renewal process caused a review prompt to appear :)I've always been happy with Porkbun but I took off 1 star only because I think dot CO could be a bit cheaper."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T04:36:01.000Z",
          "Titre": "All the guidance is superb ✨",
          "Contenu": "All the guidance is superb ✨. Really helped me in finding my domain as I'm buying it for the first time..."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Moksh Bhardwaj",
          "Nb_Reviews": 2,
          "Date": "2023-10-02T17:01:02.000Z",
          "Titre": "4 Star Because UPI Not Supported",
          "Contenu": "I would have given the 5 Star rating if they have provided the UPI Payment method for the Indian Audience. As most the citizens in India have Rupay Debit Card and it doesn't support International transactions. I faced a lot of trouble in arranging a International Supported Debit Card then required a PayPal account for completing this purpose. All this time taking experience would have be too simple and short if they would have provided the simple payment gateways for the Indian Audience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Cox",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T06:26:02.000Z",
          "Titre": "Infrequent customer",
          "Contenu": "Have yet to try the hosting, but appreciate the WHOIS privacy by default. DNS record setting took half an hour of trial and error - the host I connected to did not have DNS fields as clearly labeled as Porkbun has."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Sascha Kimmel",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T06:24:30.000Z",
          "Titre": "Very smooth experience",
          "Contenu": "Very smooth experience, cheap prices, my default provider for more special domains. Would be great however if I could setup custom nameservers before ordering as I have to waste a few minutes to wait until the setup has been completed to then directly change the default nameservers to my custom nameservers forcing another WHOIS update."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "heyngra",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T17:04:35.000Z",
          "Titre": "Domain",
          "Contenu": "Buying the domain was really easy and clean.However, I'm not giving 5 stars, because honestly, the DNS managment panel looks kinda weird and it's hard to find anything in it. But likely, all I had to do, was to migrate dns' to cloudflare, so it wasn't a lot."
        },
        {
          "Note": 4,
          "Lieu": "PL",
          "Pseudo": "Petr Glaser",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T01:37:58.000Z",
          "Titre": "Great process except translation of…",
          "Contenu": "Great process except translation of Czech Republic states. There is \"Jihocesky kraj\", but \"South Moravia\". In truth we have Jihocesky kraj and also Jihomoravsky kraj."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hector Melendez",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T23:07:43.000Z",
          "Titre": "I did some homework on You Tube and…",
          "Contenu": "I did some homework on You Tube and trusted his evaluation of porkbun. Although the TB video is not new the navigation was easy to follow. I still need to learn if I can add my own website or email, or this is something I need to add or pay you for the service. I recommend adding a short video explaining the choices to help others like me that are audio/visual learners. Thank you."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Baxter:)",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T22:55:25.000Z",
          "Titre": "Really easy to use website even though…",
          "Contenu": "Really easy to use website even though I have little to no prior knowledge of how these things work.  Perfect for anyone from novice onwards."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "Jeff Hendrickson",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T12:06:11.000Z",
          "Titre": "I do like the extra security but I don't trust",
          "Contenu": "I do like the extra security but I don't trust how porkbun handles fake abuse claims as they can be very destructive for your business even if they were fake.Overall easy to setup and get it working correctly."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Trisha Sadhukhan",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T21:17:19.000Z",
          "Titre": "Every thing was a smooth process…",
          "Contenu": "Every thing was a smooth process including adding  item to cart and creating account etc... But in the billing process ... The experience is not that good. It took a long time to proceed."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "jose Enrique estremadoyro Fort",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T01:12:43.000Z",
          "Titre": "I would give five but",
          "Contenu": "I would give five but, it's a pain to deal with changing advanced dns with long @ names, My screen frozes and I have to reload and recopy what I was doing"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Robert",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:47:34.000Z",
          "Titre": "I only come for the pig jokes",
          "Contenu": "I only come for the pig jokes, not disappointed"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Marcel",
          "Nb_Reviews": 14,
          "Date": "2023-06-07T15:21:12.000Z",
          "Titre": "Prices are great, services ok. But payment options NOT ok",
          "Contenu": "Prices are great. Services are ok. What's not good they don't accept all creditcards (options). Regular creditcards no problem, but not all my prepaid cc I could use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Graville",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T22:01:40.000Z",
          "Titre": "I love local and i hope y'all have a…",
          "Contenu": "I love local and i hope y'all have a wonderful thanksgiving"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T13:10:53.000Z",
          "Titre": "So far I'm quite impressed with the…",
          "Contenu": "So far I'm quite impressed with the service and pricing. I experienced random errors while transferring my domain, but retrying the operation resolved this. I also take significant issue with the requirement to enter a phone number, though - it's 2023. This shouldn't be a required thing in the modern world."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Litson",
          "Nb_Reviews": 2,
          "Date": "2023-07-13T00:07:17.000Z",
          "Titre": "Porkbun is my goto for domain…",
          "Contenu": "Porkbun is my goto for domain registration. I have a lot of ideas for domain names, but of course cannot register them all. I like the fact that they allow me to save the names for later so I can think about weather I really need that domain or not.I dropped one star because there was one time I tried to register a domain name and the system would not allow me to. When I contacted support I was told that there system flagged the name because the name contained a word that could be used for scamming people. The word was \"loyalty\"! Of course, it was not my intention to scam anyone. I was creating a rewards program website. In my opinion companies should not be censoring people. Other than that; I will continue to use Porkbun's service as long as they remain a great company to do business with."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Alan Wong",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T11:15:14.000Z",
          "Titre": "overall quick and easy process.",
          "Contenu": "overall quick and easy process.i have to make payment twice to go through"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Ryogo",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T20:13:57.000Z",
          "Titre": "Very fast service and real people…",
          "Contenu": "Very fast service and real people behind the help desk.SSL certificate was created really fast but I had an issue with paying with multiple bank card so I had to pay by PayPal."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Aakash Martand",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T07:45:30.000Z",
          "Titre": "Good experience",
          "Contenu": "I've been using Porkbun for the last 6 years and the experience was pretty good. Domain purchase, DNS settings, mail setup, etc. are pretty straightforward and seamless."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "David Allan",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T23:30:30.000Z",
          "Titre": "Fast and easy to purchase a domain name",
          "Contenu": "First time user and site builder. Purchasing a domain name was easy and hassle free. Thanks Porkbun!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "sam",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T16:42:09.000Z",
          "Titre": "Porkbun is great, but has some UX improvements that would make me spend more :)",
          "Contenu": "So far I have really liked porkbun, its has come with a lot of high praise from people I trust. However there are areas I really want to improve. Namely around discovery.I am part of the google domains diaspora, and on their platform discovery was fantastic. The better your discovery gets the more domains I will buy :)One thing that would be nice is when searching if you had a big list of ~100-200 of the top selling domains as suggestions for the query.Currently it feels like I have to wade through so many crappy ones. Every search I make starts with .boston. I am not from boston, dont live in boston, never want to. I am never ever ever going to buy a .boston domain.It would also be nicer if the visual queues for what is available and what isn't were made clearer and easier to browse. Its feels like that information should be directly next to the domain name so that when the reader browses their eyes don't have to scan as much."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ReyJ.",
          "Nb_Reviews": 8,
          "Date": "2023-08-27T22:56:43.000Z",
          "Titre": "I trust this website but it's poorly designed...",
          "Contenu": "I trust this website & I have domains with them. I only use companies that offer free whois. They do. My only complaint, though, I wish they had a simpler or better designed website that was just super intuitive. I went to my account to see if I had any domains left. It had been a while since I worked on anything so I didn't know. I had a really hard time telling if I was even in my account. It was just weird. In fact it looked like I was signed out. I should not have to wonder. I really don't like the way their site functions. It also got hung up with a spinning pig tail but that could be a browser issue."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Erick Otieno",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T19:21:15.000Z",
          "Titre": "The 4 star is for your good price in…",
          "Contenu": "The 4 star is for your good price in the market. But as it is am only about 5 days old and as such haven't half experienced your services enough to give a good opinion. As such,another day another time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Hopkins",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T16:17:38.000Z",
          "Titre": "Fair Price and Good Buying Experience",
          "Contenu": "purchase experience was great, but not for the faint of heart if you're then trying to create your own mail domain"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Arun Bhatia",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T09:50:26.000Z",
          "Titre": "COMPANY NAME NEW FOR US",
          "Contenu": "COMPANY NAME NEW FOR US, BUT WE SETISFIED WITH YOUR WORK"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "...",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T13:06:27.000Z",
          "Titre": "Easy and affordable, UI a bit lacking.",
          "Contenu": "Really easy to set up and affordable.However the UI to manage a domain is a bit lacking and confusing (a different page to manage it would be preferable to a panel popping in my opinion, and a more visible button \"Manage\"), but still a great experience with your services so far !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T19:57:54.000Z",
          "Titre": "The UI is a bit confusing",
          "Contenu": "The UI is a bit confusing. I recommend running a couple of rounds of Usability Testing"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sidaqvir Singh Lotay",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T05:58:15.000Z",
          "Titre": "Web accessibility and overall prompts",
          "Contenu": "The website accessibility for screen reader could be slightly improved, as well as correct some weird doubled email and site text repetition when purchasing and browsing. Great registrar though!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Sheppard",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T18:10:28.000Z",
          "Titre": "The payment process wasn't entirely…",
          "Contenu": "The payment process wasn't entirely clear.  The website was asking for payment information when I opened my account, before ordering.  I went back and used Paypal after placing the order."
        },
        {
          "Note": 4,
          "Lieu": "JP",
          "Pseudo": "Kai Soratora",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T02:04:36.000Z",
          "Titre": "stop asking me for a review.",
          "Contenu": "service was fine. nothing of note to say. stop asking me for a review."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Olivier Ngeleka",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T18:03:44.000Z",
          "Titre": "My experience was very easy and…",
          "Contenu": "My experience was very easy and thinking of transfering my other domain to Porkbun. Thank you Guys."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Ro",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T14:08:05.000Z",
          "Titre": "Great product",
          "Contenu": "Great service, domains are ready quickly after purchase, overall great experience i do think UX could be better"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Peter Blouin",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T17:42:54.000Z",
          "Titre": "Quick and Easy",
          "Contenu": "I was notified when my domain needed to renew and it was easy to do. No problem doing it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vincent Fulco",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T04:38:57.000Z",
          "Titre": "Pretty good experience",
          "Contenu": "Pretty good experience.  Not their fault, but Stripe's process for showing hcaptcha on google chrome's latest with all blockers off is broken.  Had to switch to FFOX."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "SG",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T13:37:53.000Z",
          "Titre": "Nice and Simple",
          "Contenu": "Well doing business with your Team"
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Eugenio Schiano",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T12:45:04.000Z",
          "Titre": "Clear communication and good prices",
          "Contenu": "Everything was clear and the prices are affordable. I also like how the website is communicated, like the tone/humor for example."
        },
        {
          "Note": 4,
          "Lieu": "BG",
          "Pseudo": "Danny Apostolov",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T14:24:38.000Z",
          "Titre": "Love your service! Do sth about the email hosting and warn people not to use it because there's no effective spam filter!",
          "Contenu": "Everything's great except for the lack of an effective spam filter for your hosted email service combined with the misleading description, which made me think that such filter is in fact present. What happened was that I bought 3 mailboxes and then discovered that they were unusable because of the tremendous amounts of spam, and that what you call spam filters are actually manual filters that I need to set up for each sender I need to block, which is total BS."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "shelton louis",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T00:03:53.000Z",
          "Titre": "It was fast",
          "Contenu": "It was fast I had a smooth checkout experience.The only problem is that I could not get to the payment fast enough. The wrong info was used. I had to write the card information myself"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clark",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T07:19:06.000Z",
          "Titre": "way more TLDs but hard to navigate",
          "Contenu": "UI kinda sucks. Really hard to navigate through the site, but offers way more TLDs compared to other domain providers"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Long Mai",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T00:39:20.000Z",
          "Titre": "Had a little bit trouble purchasing the…",
          "Contenu": "Had a little bit trouble purchasing the domain because  I live in Australia. Customer support as very helpful tho."
        },
        {
          "Note": 4,
          "Lieu": "TR",
          "Pseudo": "İsmail Arılık",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T13:08:09.000Z",
          "Titre": "It was very easy",
          "Contenu": "It was very easy, thank you. I just disliked annoying notification which directs me here."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Joe",
          "Nb_Reviews": 2,
          "Date": "2023-09-10T05:32:15.000Z",
          "Titre": "Great",
          "Contenu": "Great, except I couldn't checkout. I was getting a 500 error, and could only checkout via an incognito window."
        },
        {
          "Note": 4,
          "Lieu": "IE",
          "Pseudo": "Raman Singh",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T02:34:09.000Z",
          "Titre": "The price & service are both nearly the best, but others can offer better one or the other aspect.",
          "Contenu": "The service is one of the best & so are the prices but not necessarily the best as others can & do offer better prices."
        },
        {
          "Note": 4,
          "Lieu": "UG",
          "Pseudo": "Godwin Semwezi",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:05:48.000Z",
          "Titre": "I found it really easy to signup with…",
          "Contenu": "I found it really easy to signup with porkbun and register a domain. Great job guys!"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Ausome Web",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T14:08:30.000Z",
          "Titre": "I cant register new account for my…",
          "Contenu": "I cant register new account for my domain"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Allan Shore",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T19:44:21.000Z",
          "Titre": "Register process took me all over the…",
          "Contenu": "Register process took me all over the place.  Shows charges but changed to correct amount but confusing. Now I’ll see how to link this domain to my website"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Gamble",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T04:56:22.000Z",
          "Titre": "awesome, needs a fix though",
          "Contenu": "awesome, but my style sheets get cached, and don't update when I change them, so I have to often rename and reupload them. Plz fix this, luv you guys."
        },
        {
          "Note": 4,
          "Lieu": "BZ",
          "Pseudo": "Dwain Wagner",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T12:13:13.000Z",
          "Titre": "Great way to subscribe for your domain…",
          "Contenu": "Great way to subscribe for your domain name. Buying and setup was easy. Highly recommend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Vu",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T18:23:52.000Z",
          "Titre": "Good service, high renewal cost though",
          "Contenu": "Good service, easy to use, however, giving only 4/5 stars because renewal rate is high."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Melvin M",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T04:44:18.000Z",
          "Titre": "Reasonable price for domain hosting",
          "Contenu": "Reasonable price for domain hosting. Glad that I found you :)"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Andrew E.",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T05:58:01.000Z",
          "Titre": "despite payment checkout failing I stuck with porkbun",
          "Contenu": "payments kept failing but porkbun had been such a great domain registrar that I stuck with it and figured out an alternative payment method. I don’t know who was to blame (Amex, Stripe, Porkbun) but Porkbun has been so great and has built such a solid reputation with me, I was willing to figure it out. Speaks volumes about how great they are every other time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Kugler",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:46:21.000Z",
          "Titre": "HAPPYLAND",
          "Contenu": "It reminds of being on a farm. There are open green pastures full of happy little animals that always aim to please. The bees don’t sting and the honey flows. The sky blue river runeth through it and there is always a pink little raft to help you across. It’s usually sunny, and when it does rain, there is always a rainbow, and sometimes even, a cute little caterpillar on your nose."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Q. McDaniel",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T01:37:59.000Z",
          "Titre": "I love porkbun!",
          "Contenu": "I love porkbun! I love porkbun's simplicity. I've never had a single issue with them. They're fast and reliable. I definitely recommend their services to anyone looking to buy domains or host a site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Toni",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T17:09:34.000Z",
          "Titre": "I recommend Porkbun to anyone",
          "Contenu": "I appreciate Porkbun's transparency in pricing as well as their responsive support.When I first purchases a domain here, I think they had an instant chat/phone call. Now it's more of a send a message and we'll contact you back, but they do respond quicker than other hosting/domain companies I've dealt with and it's keeping their prices low. I've watched them grow and they have NOT done as some others have, stripping the service offering and and then nickel-and-diming you for every little feature. Just purchased 26 new domains 5-6 am today, easy peasy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Fogassy",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T16:58:26.000Z",
          "Titre": "Pork + Bun = Win",
          "Contenu": "Good prices. Easy to manage DNS including exporting to another service for DNS management. No sales pressure to buy things I don't want. I like bacon.I've used a number of registrars and porkbun is my go-to, even if I manage my DNS elsewhere. There's nothing wrong with their DNS management. I just like centralized management. Domain purchasing and administration is fast, easy, and I like bacon. Did I already say that?"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Dave N",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:21:18.000Z",
          "Titre": "Happy customer, excellent all round domain registrar",
          "Contenu": "- Free WHOIS privacy- Stable and fast DNS service- Security conscious - they encourage 2FA and for those who do not, they still use an emailed code to verify.- Free email forwarding- Low renewal prices where possible- Regular updates in their newsletter try to save me money"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Verre",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:08:26.000Z",
          "Titre": "Porkbun Love",
          "Contenu": "Have used numerous companies to purchase and manage domains since the birth of the Web, but have stuck with Porkbun almost as long as they’ve been around. Good deals, good service, and much cuter than the other guys ❤️"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T23:13:40.000Z",
          "Titre": "Excellent Registrar Services",
          "Contenu": "Porkbun has always been easy to use, supportive, and accessible. In the few times I’ve had to interact with their customer support, it has always been efficient and timely. I’ve only used their registrar services, so I can’t speak to any of their hosting services. That said, I imagine they maintain the same level of support across the board."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Strategic Marketing Consultant",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T18:25:28.000Z",
          "Titre": "I'm so glad I was introduced to Porkbun…",
          "Contenu": "I'm so glad I was introduced to Porkbun several years ago as they are the BEST domain registrar in the business.  Great prices, great selection, great customer service.  What's not to love about these guys?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter K",
          "Nb_Reviews": 2,
          "Date": "2023-12-21T02:15:27.000Z",
          "Titre": "Finally moved away from GoDaddy",
          "Contenu": "Finally moved away from GoDaddy.  No regrets.  Better pricing, no penalties for slightly lapsed renewals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WINIMA LLC",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T00:20:26.000Z",
          "Titre": "Great Support",
          "Contenu": "The website was very easy to use and set up. Domain forwarding, who.is privacy, free SSL certificate and the other freebies are amazing! Porkbun support team also helped us to redo our order after our initial order ran into issues. We appreciate their help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark D. Tolo",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T15:45:01.000Z",
          "Titre": "I like the simplicity and absense of…",
          "Contenu": "I like the simplicity and absense of marketing info yet still being able to find a diversity of products. I ran an ISP (1995) when domains were free and filling out the form for the internic was the process for registering domains and blocks of ip addresses were also free. When domain order started coming in with many name requests things got out of control pretty quick. That was just a service we offered, and no charge, it seemed a little absurd the amount of requests. I can imagine my old team when I see you guys if we had stuck with it. You run a clean, performance gui and I have never experienced an error. Prices are reasonable and often the best. The personal edge says a lot. I appreciate your team and will continue to pass the word."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kit Karson",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T16:29:54.000Z",
          "Titre": "Friendly, responsive, quirky, affordable",
          "Contenu": "I have been purchasing domains from porkbun for at least five years. They make it easy to search for domains, often have promotional pricing, but don't use it to hide future costs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jack",
          "Nb_Reviews": 15,
          "Date": "2023-12-14T21:58:40.000Z",
          "Titre": "Seamless Experience! The best domain site.",
          "Contenu": "What a joy finding PorkBun. Just renewed my domains and wow, there was no 10x price markup for renewing. Such a transparent company with amazing support. You offer an amazing, AFFORDABLE, seamless service destroying all rivals. This is how the web should be making it accessible to everyone. Love PorkBun. Recommend to everyone."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Borobudur",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T02:49:11.000Z",
          "Titre": "Reasonable price, clean dashboard",
          "Contenu": "Idk why when I reactive SSL, Porkbun requires to set up default NS for my domain. Is it the same for other registrars?Another disadvantage is Porkbun doesn't support refund within 3 days after purchased domain like Namesilo.Anyway, 5 stars for the clean, convenient dashboard and the reasonable price for the good service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T11:51:17.000Z",
          "Titre": "Easiest domain registrar experience, EVER!",
          "Contenu": "Easy to navigate and search for domains, clear and simple domain management, no-nonsense products and services... all make domain buying and managing fun and stress-free!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Enrico",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T10:50:17.000Z",
          "Titre": "So far so good!",
          "Contenu": "The setup process whas straight to the point and I liked that. Love to see presets for common services too, as well as blog posts with instructions for many other cases. Even with little experience on the jubject, you can easily achieve what you're looking for."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Siobhán",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:28:00.000Z",
          "Titre": "Fantastic registrar",
          "Contenu": "Been with Porkbun since late 2020, and never had any issues! Transferring my domains was a breeze and I love the UI and experience (and free WHOIS privacy is always a plus!) - while I can't speak on the hosting side of things, domain-wise, I would recommend Porkbun without a shadow of a doubt!"
        },
        {
          "Note": 5,
          "Lieu": "XK",
          "Pseudo": "xyzdigital",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T14:55:39.000Z",
          "Titre": "A true, mindblowing experience!",
          "Contenu": "Porkbun has been nothing more than awesome. Their domain management solution is simple, straight to the point and without fancy/shiny navigations that just messes up your work."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "anton jbp",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:24:56.000Z",
          "Titre": "Truly good experience buy domain in here",
          "Contenu": "How easy it was to search domain. How clean the UI. The experience I felt was truly buyer and customer. Without some middle man who keep trying increase the price by selling nessecarry thing separately for higher place (SSL, whoismyprivacy)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael McShane",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T02:45:31.000Z",
          "Titre": "Porkbun rocks!",
          "Contenu": "I’ve used godaddyand Namecheap for a few years but I’ve just used Porkbun and loved the user experience. Support is awesome and transfers work great. I had custome name servers on my Namecheap domain and discovered that the transfer process migrated my NS settings automatically. I also had a 5$ credit in my account that I had forgotten about and ended up getting a transfer for 4$. Thanks Porkbun! Ps. Would love to design a tshirt extolling the virtues of Porkbun!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "theDude",
          "Nb_Reviews": 8,
          "Date": "2023-12-18T23:34:28.000Z",
          "Titre": "Best ever",
          "Contenu": "I have more than one domain set with Porkbun, Prices are unbeatable and service is tiptop. Not to mention the ease of use on the dashboard."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaLa Artica",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:39:52.000Z",
          "Titre": "Honestly, This is how everyone should do business.",
          "Contenu": "Honestly, it's easy to use, but also hilarious. The prices are great. The service works. This is how everyone should do business."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "bax",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:38:40.000Z",
          "Titre": "fun and easy!",
          "Contenu": "easy-to-use and nicely-designed website with very funny illustrated newsletters. For domain registration, lots of features are included for free. Price is competitive too."
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Berke",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T10:44:06.000Z",
          "Titre": "Everything is stupidly simple, you'll love it",
          "Contenu": "Stupidly easy, fast, and simple. I love these people from now on and will continue to support them in whatever way I can... I'm just glad struggling with domain providers and their bad support days are over. It's sad to see not a lot of people know about Porkbun."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EG",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:01:30.000Z",
          "Titre": "Super simple and low prices",
          "Contenu": "Needed low cost, high privacy hosting. This came highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Ainslie",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T23:35:44.000Z",
          "Titre": "Honest Price Comparisons, Fair Prices",
          "Contenu": "This is my first time ordering from Porkbun and I'm glad to say they live up to their awesome reputation. Not only were their price comparisons accurate, the amount I paid for illumi.sh was a perfectly reasonable, middle of the road price (*cough* GoDaddy). The checkout experience was quick and simple, no hassle, and they don't publish an RSS feed of searched domains (*cough* Namecheap) so I know when I'm just browsing my name won't get sniped.<3 Porkbun"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Vasyl H",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T21:12:09.000Z",
          "Titre": "Always good and fair prices",
          "Contenu": "Always has good prices on a vast selection of TLDs, been a customer for more than 5 years and never had any problems, many things that other providers make you pay for (for example change owner info, reactivate expired domain, etc...) are for free here"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Nastya Grifon",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:27:18.000Z",
          "Titre": "Definitely recommend",
          "Contenu": "I've been using Porkbun as my domain registrar for over a year, and it's been a smooth experience. No issues at all. Their service is reliable, and I'm happy with it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "oldtowneast",
          "Nb_Reviews": 2,
          "Date": "2023-12-20T02:24:20.000Z",
          "Titre": "Considering I've only purchased two…",
          "Contenu": "Considering I've only purchased two domains in the last twenty years, and then half over a dozen in the last year thru Porkbun, one could say that their service brings with it great joy and ease of use, and that hurdle of \"should I buy a domain\" is no longer there with the streamlined process Porkbun provides to the world."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debra Shieber",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T23:27:24.000Z",
          "Titre": "Customer Service",
          "Contenu": "Customer Service (Ambia) is first rate and very helpful with everything you’ll need. Will highly recommend to all my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Hagler",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:15:45.000Z",
          "Titre": "Porkbun has been great!",
          "Contenu": "Porkbun has been great! The web site is easy to navigate, quick, and offers comprehensive service for everything one could want for a domain registrar -- without a lot of extra fluff!  I have contacted Porkbun support a few times and the people working support area always quick to reply, knowledgable and courteous."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Angry Russian",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T13:21:46.000Z",
          "Titre": "Thank you so much for being Porkbun.",
          "Contenu": "Thank you so much for being Porkbun.Best prices, best UX, best customer service. As victims of the Russian regime, we deeply appreciate your decision to integrate crypto and became some kind of fort to us"
        },
        {
          "Note": 5,
          "Lieu": "HK",
          "Pseudo": "P Yau",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:26:37.000Z",
          "Titre": "A Nice and Cheaper Alternative to replace Major Competitors",
          "Contenu": "The domain renewal process is smooth and the DNS is fast to propagate. Have been using it for two years for two domain names."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manny O",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T17:50:27.000Z",
          "Titre": "This is one of the best domain if not…",
          "Contenu": "This is one of the best domain if not the best domain registrar I have ever used in my life I love pork bun"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Stefano Esposito",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:07:54.000Z",
          "Titre": "Exceptional Domain Service Experience with Porkbun.com",
          "Contenu": "Porkbun.com has been a game-changer for my domain management needs. The user interface is incredibly intuitive, making navigation and domain setup quick and hassle-free.Their customer service is a standout, offering prompt and knowledgeable support, a rarity in the digital domain space. The pricing structure is transparent and competitive, providing great value without hidden costs.The range of available TLDs is impressive, fitting well with my diverse project needs. Porkbun.com strikes the perfect balance between efficiency, affordability, and customer care. Highly recommended for anyone in need of straightforward and reliable domain services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Kritikos",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T06:55:57.000Z",
          "Titre": "Awesome Porkbun",
          "Contenu": "Awesome PorkbunIt was easy to purchase and no hidden fees was even better.  I was impressed on the site layout, easy to navigate and the dropdowns make it easy for management."
        },
        {
          "Note": 5,
          "Lieu": "JP",
          "Pseudo": "Porkbun User",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T10:51:58.000Z",
          "Titre": "Technically friendly, honest about registrar policy",
          "Contenu": "Porkbun technical support appears technically literate, they can use both average & technical vocabulary as needed: experienced users can directly talk about technical issues & receive technical questions, which is a plus.Porkbun also has a blog containing an article that defines exactly how they decide to expire a domain, what the redemption fees are, and which criterias are used to define a domain name as premium.This blog article cans be found in some related pages of the main Porkbun website.User accounts can be secured with appropriate methods such as Google Authenticator's.The Porkbun dashboard is lightweight & directly displays important details of a domain name, however one risky point is the mobile version of the dashboard.I think Porkbun cans work this out, it's when you use the mobile version then click on the \"eye icon\" to view the WHOIS privacy status.On mobile if you click it, it directly switches the WHOIS Privacy setting, so it could accidentally switch it to \"Public\" by mistake.By default it's enabled, so as long as you don't misclick it on mobile there's no problem for WHOIS Privacy.Porkbun also appears more lighthearted than competitors.It's like comparing EA Games with an indie game development company.There's also no 'big corp.' feeling when using the Porkbun website, which is confirmed by their to-the-point website navigation (no cluttered menus, easy-to-browse account settings).I don't say that they provide a better service than other registrars because unlike food, DNS registration is always the same service.However Porkbun clearly appears more lighthearted, to the point, and honest about their registrar policies.If you're going to pay a fee, they'll tell you in advance. You will also easily be able know how much you'll pay and how to avoid having to pay a fee.On a more technical note, Porkbun supports DNSSEC, CAA records and the ALIAS record too.ALIAS isn't really a DNS record type, but rather a \"reverse-proxy\" for another DNS record - cans be any record type."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nick Accad",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T19:32:04.000Z",
          "Titre": "Took about 2 minutes",
          "Contenu": "Took about 2 minutes, without even taking my CC out, no issues, no problems. I don’t think you can make this better."
        },
        {
          "Note": 5,
          "Lieu": "KE",
          "Pseudo": "Joseph Macharia",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:33:05.000Z",
          "Titre": "its great",
          "Contenu": "I recently had the pleasure of using the Porkbun site to purchase a domain name for my new business, and I have to say, I was thoroughly impressed with the experience. The site was incredibly easy to navigate and the purchase process was seamless.One thing that really stood out to me was the pricing. Porkbun offered very competitive prices, and I was able to get a great deal on my domain name. Additionally, they offer free WHOIS privacy, which is a huge plus.Another thing that I appreciated was the customer support. I had a few questions about the process, and their customer support team was quick to respond and incredibly helpful. They made the whole experience stress-free and enjoyable.Overall, I highly recommend Porkbun for anyone in need of a domain name. Their site is user-friendly, pricing is competitive, and their customer support is top-notch."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T22:40:56.000Z",
          "Titre": "Porkbun's a good one",
          "Contenu": "Domain registrars have a reputation for being scammy, for trying to upsell you into things you don't need, and for shooting endangered elephants. Porkbun is none of that. And their prices are cheap. And the admin panel is easy. And their security is tight. What more could you want?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan Valiente",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T21:02:14.000Z",
          "Titre": "Seamless experience and accepts crypto",
          "Contenu": "Seamless experience and accepts crypto. I also didn't have to retype my information when I missed inputing something into the forum haha.  I think I am going to like this company."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Ruben",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T12:43:22.000Z",
          "Titre": "Would recommend",
          "Contenu": "Setting everything up was quick and easy. Pricing is fair (lowest I could find) and their privacy options are nice"
        },
        {
          "Note": 5,
          "Lieu": "KR",
          "Pseudo": "jesse",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T08:11:33.000Z",
          "Titre": "There are many crooks in this industry",
          "Contenu": "There are many crooks in this industry, but Porkbun is very straight forward. I like it."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "SUDHARSHAN S",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T13:32:25.000Z",
          "Titre": "Superb",
          "Contenu": "Fast payment gateway, hassle free, lesser cost"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alli Kat",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T18:07:52.000Z",
          "Titre": "Talking to a person is awesome",
          "Contenu": "So glad I am able to talk to someone and that is able to take care of the issues fast.  Hope you never change that. Adding an online chat is fine for a quick fix. Having both is ideal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Speciale",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T01:52:02.000Z",
          "Titre": "Wonderful Site! Intuitive, and Easy to Use!",
          "Contenu": "Great website!  Great content!  Intuitive; easy to find info!  And I love your team’s sense of humor!  Clearly well thought out and programmed!  Awesome work, ladies and gents!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Artreice Westmoreland",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T06:23:39.000Z",
          "Titre": "I am glad I choose to go with Porkburn",
          "Contenu": "Porkburn is a great alternative for all the major domain services especially if you do not want to spend an arm and leg on domains or multiple domains."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Luky",
          "Nb_Reviews": 4,
          "Date": "2023-12-20T21:12:25.000Z",
          "Titre": "awesome service",
          "Contenu": "awesome service, cheap when compared to other registrars, i dont think ill regret transferring"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert McMillen",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T15:05:37.000Z",
          "Titre": "Top notch registrar",
          "Contenu": "Fair pricing. Great customer service and support. The dashboard is easy to use. Plus, best of all, they don’t push needless upsells on you or try to trick you into things you don’t need. Definitely one of the best registrars around."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter M",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T20:46:41.000Z",
          "Titre": "Affordable Price and Easy to Use",
          "Contenu": "Just getting started but so far it's been easy to use, offered an affordable price, and have received good communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fox",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T01:46:16.000Z",
          "Titre": "Easy web gui",
          "Contenu": "Was a simple order but the automated system was easy to work through"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Vargas",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:12:21.000Z",
          "Titre": "The site is well designed and…",
          "Contenu": "The site is well designed and informative making finding the right domain name easy."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "AJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T07:29:54.000Z",
          "Titre": "Great user experience",
          "Contenu": "Great user experience. The rates are very good (best imo) compared to other domain registrars. The user interface and overall site is also great."
        },
        {
          "Note": 5,
          "Lieu": "LK",
          "Pseudo": "Umal",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T18:23:11.000Z",
          "Titre": "I loved how easy it was to manage my…",
          "Contenu": "I loved how easy it was to manage my domain through their dashboard. Plus, knowing my site was safe and secure with them gave me peace of mind. If you need a domain, I highly recommend porkbun. They're awesome!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Davenport",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:48:37.000Z",
          "Titre": "You rock",
          "Contenu": "You rock, and are an important part of my new story telling business. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Jure",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T21:14:17.000Z",
          "Titre": "Good services",
          "Contenu": "I have been buying here for my business for 5 year now and when I have needed help they support me very well, without any problems, super fast customer support service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T01:13:47.000Z",
          "Titre": "The website is super easy",
          "Contenu": "The website is super easy. I appreciate that you kept nagging me to renew. The prices are awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel West",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T23:59:29.000Z",
          "Titre": "Great & Easy to Use!",
          "Contenu": "This interaction was great & easy to use! Looking forward to a lovely relationship."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jane",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T03:14:01.000Z",
          "Titre": "it was easy to navigate the billing…",
          "Contenu": "it was easy to navigate the billing page, change preferences and work with a new credit card"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "J-F Bouchard",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T05:00:05.000Z",
          "Titre": "the best icann DNS provider I know of +…",
          "Contenu": "the best icann DNS provider I know of + handshake HNS supported. EmerDNS missing but can be proxied through HNS so no biggy. 5-stars"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B A",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T12:16:18.000Z",
          "Titre": "The order process was easy and the…",
          "Contenu": "The order process was easy and the website was simple to navigate."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "FORAT BAHRANI",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T17:19:39.000Z",
          "Titre": "Simple and Affordable",
          "Contenu": "Porkbun is Simple and Affordable Domain, Email And Hosting Provider, exactly what I want."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Diana K.",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:13:54.000Z",
          "Titre": "Help from Support",
          "Contenu": "I had an issue with the payment for the domain and the support team guided me through the process of fixing the issue."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Terry",
          "Nb_Reviews": 6,
          "Date": "2023-12-15T00:24:46.000Z",
          "Titre": "Great registering so many domain name…",
          "Contenu": "Great registering so many domain name in great value. And no scamming"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark H",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T04:46:47.000Z",
          "Titre": "Easy to use website and great customer…",
          "Contenu": "Easy to use website and great customer service"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Elani Dekker",
          "Nb_Reviews": 2,
          "Date": "2023-12-14T09:51:35.000Z",
          "Titre": "Effortless.",
          "Contenu": "Effortless. Once I bought my domain name, I never have to think about it again. Thanks Porkbun!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Archie Williams",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:59:31.000Z",
          "Titre": "Great support and quick service",
          "Contenu": "Great support and quick service, really cheap domain names and generally works well."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Huan Le",
          "Nb_Reviews": 4,
          "Date": "2023-12-21T07:57:08.000Z",
          "Titre": "Fast transaction, stable price"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Vinay Kant Pandey",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T15:22:41.000Z",
          "Titre": "They are simply the best and truly care…",
          "Contenu": "They are simply the best and truly care for their customers.I will surely recommend them to everybody.Their services are best and unmatchable."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Ayesh Fernando",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T16:33:16.000Z",
          "Titre": "got what i came for",
          "Contenu": "was looking for a cheap domain for a personal project"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Sutton",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T00:22:44.000Z",
          "Titre": "Always a great experience",
          "Contenu": "Easy to use and great pricing. Going to move all my domains to Porkbun!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Tang",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:06:34.000Z",
          "Titre": "Affordable place to grab a .com address…",
          "Contenu": "Affordable place to grab a .com address quickly and low renew fees.Also porkbuns are yum."
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "Hai Quang Pham",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T06:03:37.000Z",
          "Titre": "Good Service",
          "Contenu": "Good Service, fast processing and responding, everything is fine."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Getchel",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T03:39:48.000Z",
          "Titre": "Porkbun is my go to registrar"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "Jakub",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T23:23:05.000Z",
          "Titre": "I ran into trouble and received quality…",
          "Contenu": "I ran into trouble and received quality support from Porkbun's Team."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darrell Walker",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:27:12.000Z",
          "Titre": "Smooth and simple with a great user…",
          "Contenu": "Smooth and simple with a great user interface!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "yo mama",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T06:57:07.000Z",
          "Titre": "Absolutely love porkbun",
          "Contenu": "Very cheap domains, and incredible hosting. Recommended Porkbun to all my friends trying to buy domains as well"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Michael Alaggia",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T13:16:02.000Z",
          "Titre": "Been using Porkbun for a number of…",
          "Contenu": "Been using Porkbun for a number of years now. Good competitive pricing for domains as well as good domain management."
        },
        {
          "Note": 5,
          "Lieu": "RS",
          "Pseudo": "Ivan M",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T12:45:17.000Z",
          "Titre": "Everything cool",
          "Contenu": "Everything cool. Smooth, fast, performance focused. No bs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mhardi",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T20:41:50.000Z",
          "Titre": "Great value easy to use",
          "Contenu": "Great value.  Very easy to use interface.  An odd - but memorable - name."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stevie",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:13:19.000Z",
          "Titre": "The experience was very easy",
          "Contenu": "The experience was very easy, I did research on reddit before registering as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Maloskey",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T20:39:04.000Z",
          "Titre": "Love Porkbun",
          "Contenu": "Simple, easy, friendly, and cost-effective"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T22:14:27.000Z",
          "Titre": "All-round the Best",
          "Contenu": "It was fast and no bloat on the website. Good rates. Had a horrible experience with GoDaddy before this."
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Rangel Katsarski",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T15:56:13.000Z",
          "Titre": "Simple,fast and friendly",
          "Contenu": "Simple, fast and friendly service.Recommended"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sergio",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T23:43:06.000Z",
          "Titre": "just transferred all my domains here",
          "Contenu": "good web design, easy to navigate and with the right prices and services"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Jack White",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T05:16:35.000Z",
          "Titre": "The Best",
          "Contenu": "This is the best site to register my domains, I have been with porkbun for years and I never plan to change it. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "Kietezo",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:23:22.000Z",
          "Titre": "service ware good and secured"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "la",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T03:45:25.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Great site easy to navigate and quick to purchase."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "le goat",
          "Nb_Reviews": 2,
          "Date": "2023-12-19T18:21:08.000Z",
          "Titre": "Cheap domains",
          "Contenu": "Cheap domains, no issue. Thanks a lot for your work!"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "iBo",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T10:15:15.000Z",
          "Titre": "Everything seems fine",
          "Contenu": "Everything seems fine. It's easy to use, has a simple design, and gets me to the point without any errors, etc. I hope you continue the good work so i can use Porkbun forever. :)"
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "dwi kristianto",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T17:44:01.000Z",
          "Titre": "pibitek.biz is alive within minutes",
          "Contenu": "my site, pibitek.biz is alive within minutes after i paid the domain.simple site, simple feature and no ads at all. keep the good job."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Nicolas",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T00:05:01.000Z",
          "Titre": "A lot cheaper than vercel and i love…",
          "Contenu": "A lot cheaper than vercel and i love the pig anime character 10/10"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "VR Uazengisa VR Uazengisa",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:41:25.000Z",
          "Titre": "Miss",
          "Contenu": "Easy to renew my account every year."
        },
        {
          "Note": 5,
          "Lieu": "ID",
          "Pseudo": "Ade Iskandar",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:27:27.000Z",
          "Titre": "Cheap",
          "Contenu": "Cheap domain"
        },
        {
          "Note": 5,
          "Lieu": "FI",
          "Pseudo": "Sergey",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T21:19:33.000Z",
          "Titre": "Very good tool",
          "Contenu": "Very good tool. Easy to register and manage domain"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lukas",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T10:29:38.000Z",
          "Titre": "Easy to buy the right domain",
          "Contenu": "Easy to buy the right domain, and customer service was very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "VN",
          "Pseudo": "PHAM",
          "Nb_Reviews": 4,
          "Date": "2023-12-10T06:05:36.000Z",
          "Titre": "Good service",
          "Contenu": "Good service, easy friendly interface, good price, easy pay, easy transferring"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Hassan Javaid",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T06:51:08.000Z",
          "Titre": "Simple to use, no catch",
          "Contenu": "Simple, easy to use. No dark patterns. No attempts to take advantage of the user."
        },
        {
          "Note": 5,
          "Lieu": "RU",
          "Pseudo": "Arthur Vasilev",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:22:50.000Z",
          "Titre": "Very pleasant",
          "Contenu": "Very pleasant, effective. KISS principle. So, it’s enjoyable."
        }
      ]
    }
  ]
}