{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "powerdiary.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "CS",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T15:47:42.000Z",
          "Titre": "Do not recommend - poor ethos when issues arise",
          "Contenu": "Although initially I thought the design was great, and that they were good at helping me as a customer become familiar with the platform. I feel powerdiary is more about getting customers to rely on the familiarity of the platform. In my opinion, a company will always show its quality when  issues arise and they will address these with ease. However, this was not my experience with PowerDiary as they failed to express appreciation for me as a customer and lacked empathy (quite happy to let me go elsewhere rather than compensate). I now have been left with the opinion that money is more important than satisfied long term customers. As a business I lost clients (income). Powerdiary lack the initiative in resolving my complaint losing A LOT of MONEY due to repetitive technical issues when paid ads are running and clients are trying to book on a system that is experiencing problems their end. I am now looking for another provider which they know is difficult for UK users, I feel a little trapped with a company I don't want to be with.In response to your reply: I did contact you by email and explaining all this. I really don't like leaving reviews as I hope you would offer resolution. Your response felt cold, and there was no compliment for our loss. I then expressed I was looking for another company due the issues this keeps causing. You response to this was I was welcome to go elsewhere if I wasn't happy. This reply is not what I consider valuing your long term customer."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Gawie",
          "Nb_Reviews": 5,
          "Date": "2023-03-16T17:12:22.000Z",
          "Titre": "The call center was not able to resolve…",
          "Contenu": "The call center was not able to resolve my issue. What I really disliked about the incident is that they never once came back to me regarding progress, I had to chase the issue. After 10 days they seemed to be uncertain about the issue. Now after 13 days I am still no closer to a solution with no feedback. It seems that they hope I will go away. My assumption is that the team is not senior enough in customer care and they seem reluctant or unable to escalate the matter. The issue raised is fundamental to the trustworthiness of the system. I have now established, after my own investigation that the system generated reports do not include all transactions. This place significant uncertainty on the accuracy of reporting."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Springvale Wellbeing",
          "Nb_Reviews": 2,
          "Date": "2023-01-20T15:57:09.000Z",
          "Titre": "Buggy and lacking in client confidentiality features within a practice",
          "Contenu": "I've only been using the system for a couple of weeks but seem to find a bug at least once a day. I moved from WriteUpp because our practice is expanding and we're taking on placement students. Turns out that you can let a student see their diary, but if you want them to be able to write notes for their clients, you need to give them access to your full client database! Nuts! Customer Support not very helpful acknowledging the problem.Update 20/1/23 in response to Power Diary's reply. To clarify, the confidentiality issue relates to seeing any of a person's details. I wish for other practitioners and students in the practice to only see names of those clients they have been assigned to. However, I am told by Customer Support, that in order to write notes for their clients they need to have access to the 'People' menu. If they have access to the people menu then they can see the name, address, date of birth, phone number and email address of *every single client in the practice*, thus breaching the client's confidentiality."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "PsychZone",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T21:14:10.000Z",
          "Titre": "Support has declined",
          "Contenu": "I dont like not having phone support.  I’m not happy that my claims are not processing - again.  And, lately I don't feel like I'm getting value for money.  Im thinking about trying a different program."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Bradley Banks",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T08:21:12.000Z",
          "Titre": "Staff",
          "Contenu": "Needs to be easier to have a chat with a staff member on hand. Also i would like to chat to someone about my business and your software."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Eraj",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T12:24:14.000Z",
          "Titre": "Simple",
          "Contenu": "Simple, easy, approachable - limited features, only one expensive online payment integration of STRIPE and old design"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "AJohnson",
          "Nb_Reviews": 1,
          "Date": "2021-02-01T04:57:07.000Z",
          "Titre": "Good but new features would be helpful",
          "Contenu": "Powerdiary is good but there are features that are lacking and/or without consultation got removed (e.g. printing correspondence). the \"voting\" system is good in theory to identify new features, but it would be more helpful if they perhaps did a survey a couple times a year as people aren't contacting Powerdiary to \"vote\". For example, NDIS is a major change in the architecture of allied health Australia, but there is no simple method of tracking service agreements."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T05:36:42.000Z",
          "Titre": "Power Diary ticks most boxes but...",
          "Contenu": "Power Diary ticks most boxes especially for those that do not particularly like to get too invested in technology. It is simple to use and simple to setup.The two major criticisms I have is that there is no mobile friendly app (come on guys its 2020) and I cannot setup reoccurring payments/I need to manually process payments. Other than that it is extremely intuitive and easy to use."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Alex Latouche",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T10:30:51.000Z",
          "Titre": "Overall a very good product...a couple of steps away from Excellence",
          "Contenu": "Overall a very very good product, simple and easy user interface. No nasty surprises when it comes to billing, and generally intuitive all round. The option to now book in calls to customer support is great (previously was online only which wasn't my preference), and the only reason it doesn't have 5 stars is because it lacks some basic features in notes section (e.g. formatting), and it needs more customisability when it comes to session packs/third-party funding tracking (which I have found easier in other software programs I have used in the past).Nov 2020 Update: - Been a buggy few weeks so have updated my rating. Seems to slow at least a few times a week for a few hours. Not sure if too many users, but they need to fix this as this is very annoying!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KL",
          "Nb_Reviews": 7,
          "Date": "2022-06-01T17:59:08.000Z",
          "Titre": "I tried out this site because I want to…",
          "Contenu": "I tried out this site because I want to be able to accept intake forms on a hipaa compliant platform or at least with great security, but although I'm fairly tech savvy I found the creation process cumbersome and confusing. So I'm still looking for a good site to do this that is cost effective."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "mustapha riaz",
          "Nb_Reviews": 10,
          "Date": "2020-10-12T09:46:38.000Z",
          "Titre": "Rubbish software",
          "Contenu": "Rubbish softwareIncredibly frustrating to use. Creating emails and forms to send to clients is incredibly difficult and not intuitive at all. So many sub categories forms/templates/notes none of which can be interchanged ect.Honestly save the frustration and use a decent software."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "of Jane",
          "Nb_Reviews": 4,
          "Date": "2022-07-06T13:53:49.000Z",
          "Titre": "On the remedial massage notes I write…",
          "Contenu": "On the remedial massage notes I write you have abbreviations but no glossary to what they stand for/explanation of terms etc should I be unfamiliar with that particular one.  Also when I create a client and then having done so I go to write a record i.e. notes, when I start writing the clients name it does not pop up. Instead I have to write it all up again.  In my profession as remedial massage therapist I need a selection of forms 1. relaxation massage and the legal, necessary client information questions 2. Deep Tissue Massage with the legal, necessary client information questions and 3. Remedial Massage again with and legal, necessary client information questions and so forth.  On the create client form it only gives the choice of internet and referral for how the client heard about the company.  There needs to be other and a space for it to be written,  Please add recreation to the form as this also can impact on treatment.Thanks"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "JFP",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T23:21:50.000Z",
          "Titre": "Its a great system however a few…",
          "Contenu": "Its a great system however a few downsides - I have been trying to create a few template for patients/clients to fill in and it does not give me the ability to upload my own form - the ones you can create through PD is quite limited."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Megan  Bray",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T04:15:49.000Z",
          "Titre": "Great platform",
          "Contenu": "PowerDiary is a comprehensive Practice Management Systems that ticks all of the boxes for a busy healthcare practice. However, we've recently had regular technological issues which negatively affected the overall efficiency of our practice. PowerDiary's communication regarding resolution of these issues has been unsatisfactory."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Carina Rudman",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T09:34:23.000Z",
          "Titre": "Power Diary is easy to use and soft on…",
          "Contenu": "Power Diary is easy to use and soft on the eye."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Judith Griffiths",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T00:25:05.000Z",
          "Titre": "Power Diary has everything in one place.",
          "Contenu": "Power Diary is easy to use, the additional features make it a worthwhile purchase. Power Diary has everything in the one place to make running a practice easy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Grubb",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:46:15.000Z",
          "Titre": "Very dependable service for our…Counselors",
          "Contenu": "Very dependable service for our Counselors to utilize.  The Webinars provided are informative and relate well to the usage of the system.  Plus, we get to hear those Aussie accents!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sheryl",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T03:12:54.000Z",
          "Titre": "\"support\" acts quickly when alerted to…",
          "Contenu": "\"support\" acts quickly when alerted to an issue, we experienced this again a few times last week. And the tech crew continues to add features."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rebecca Taylor-Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T05:02:54.000Z",
          "Titre": "Power diary is an excellent platform",
          "Contenu": "Power diary is an excellent platform. It's easy to navigate and customise and the customer service has always been excellent.I would absolutely give 5 stars, but for me, the drawback is not having access to electronic prescribing. If you don't need this, then it's 5 stars for sure."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T08:32:21.000Z",
          "Titre": "Comprehensive and reasonably easy to use",
          "Contenu": "PowerDiary is comprehensive and seems to be able to do almost everything I need for a client management product.  They also have online support although can take a day for a response.  They also imported all my client data for me from my previous client management product which made things very easy for me."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T02:30:16.000Z",
          "Titre": "Power Diary is so simple to use",
          "Contenu": "Power Diary is so simple to use. Once the templates are setup, it streamlines and automates a lot of the work so I don't have to spend countless hours on admin work. The help files are succinct and easy to understand."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Emma Ring",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:09:43.000Z",
          "Titre": "Great system",
          "Contenu": "PowerDiary is a great system for running a private practice. Its functions are streamlined, easy to use and intuitive. The support team is helpful and engaging if things go wrong."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Be Well Psychology Solutions",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T05:13:07.000Z",
          "Titre": "Excellent platform to navigate once…",
          "Contenu": "Excellent platform to navigate once there's been practice of using various options. Lot's of template optins to help with notes and ability to customise which is great. I need to engage in some tutorials so I can learn how to use more features as I'm aware there's scope to streamline more administrative tasks. Appreciate the integration with Medicare which is the function I use most for processing payments of this nature. Also find the SMS function helpful when sending out reminders with responses updating as received."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Monica  C",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:16:54.000Z",
          "Titre": "Power diary has taken a weight of my shoulders!",
          "Contenu": "Power diary has made bookings for my counselling business really easy and streamlined. It’s empowered my clients to be able to book when they want and change their sessions around according to the busy lives they lead, access receipts and forms have been really easy for them to fill out. As a therapist, it has made my life a lot easier - invoices are easily created and sent out, telehealth sessions are easy to coordinate through the platform, mass communication is easy, and as a program I’ve found it to be highly intuitive. Most importantly I have had access to help whenever I’ve needed it. The assistants have been super helpful. There are occasional glitches - but that is to be expected - they are usually resolved fairly promptly."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Cassandra  Gavel",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T01:27:25.000Z",
          "Titre": "It’s a really great system",
          "Contenu": "It’s a really great system that anticipates most clinicians needs!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Jan S",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T12:09:25.000Z",
          "Titre": "Love power diary for appointment diary…",
          "Contenu": "Love power diary for appointment diary and invoicing. However I gave up on the Telehealth function because many clients couldn’t connect as always had to update."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Leila",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T01:18:30.000Z",
          "Titre": "Easy to navigate",
          "Contenu": "Easy to navigate. Lots of helpful features, such as tags for organising files. Helpful for tax time, to generate financial reports."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Leanne Wallwork",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T05:18:29.000Z",
          "Titre": "I love this software",
          "Contenu": "I love this software. The only 2 niggle s is that it doesn’t have an app, or I am unable to intergrate my Apple Icalender with my online power diary, therefore feel I’m chasing my tail a bit. I am sure this is due to the fact it makes the online experience unsafe to store personal info, in which case that is a better option ."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Taylor",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T11:20:04.000Z",
          "Titre": "Definitely recommend",
          "Contenu": "Organization is helpful, invoicing is awesome, super easy. Love the online forms and automatic import to file - one less thing I have to do! I love how files and info is stored and how my calendar looks. Only real constructive feedback I have is to please bring in bold and underlined text in notes and the ability to do dot points! Other than that it’s brilliant"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kimberley Chapple",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T11:52:10.000Z",
          "Titre": "I love Power Diary and how easy it is to use!",
          "Contenu": "I love Power Diary and how easy it is to use. There's plenty of helpful tools that make admin less painful and less time consuming. The tutorials are really helpful too, as are the search engines when you need to ask a question. One improvement would be a Power Diary app. Overall, a great experience and would definitely recommend it."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Natasha",
          "Nb_Reviews": 1,
          "Date": "2022-06-08T09:28:38.000Z",
          "Titre": "I use PD regularly to record case…",
          "Contenu": "I use PD regularly to record case notes, upload client files and email treatment plans. I find it very intuitive and user friendly. Sometimes I am confused why I can see a communication history on one client's profile, but not another profile. e.g. the actual tab is not available to click on. This feature is useful when available as I can see my email history with clients, or if reception has also been in touch so we are all on the same page."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Sarah Nathan",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T03:35:57.000Z",
          "Titre": "Using Power Diary as  Sole Trader",
          "Contenu": "Power Diary works really well and is reliable. I found it challenging initially to get my head around how to set up some features but that may be a user issue! Now that I have been using it for several months, I am finding it pretty straightforward and efficient to use. I'm a sole trader so having things that streamline my work is essential. A couple of features I would like are the sending of receipts once you have ticked that an invoice is paid, and I would like to have templates use a contact name autofill rather than the client name, as I work with children. One thing that I think power diary does well is provide step by step instructions for how to do anything in the platform... a simple search usually gives me the steps I need. I'm very happy with Powerdiary and intend to keep using it for the long term."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Renata Andrade",
          "Nb_Reviews": 1,
          "Date": "2022-04-12T10:57:07.000Z",
          "Titre": "It’s easy and you can run your practice smoothly from one place.",
          "Contenu": "Power Diary is really easy to manage, has everything I need to run my international practice smoothly. I’m not a tech savvy person and PD is super friendly. I highly recommend it to therapists and coaches who would like to get organised and have a one stop shop for their practices."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Joanne Van Der Haar",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T21:42:42.000Z",
          "Titre": "Love the product",
          "Contenu": "Love the product, just wish the sms service was a little more affordable as it would save me time as I send sms out myself rather than incur the costs which I realise isnt totally a PD issue. The system itself is user friendly, easy to navigate. Not the cheapest on the market but I really like using it"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "The Salvation Army HEALTHLINK",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T23:47:50.000Z",
          "Titre": "Power Diary is a good program",
          "Contenu": "Power Diary is a good program, however still place for a few improvements, like the divider line between the days in the diary to be more strongly seen. ( requested multiple times).It would be good if we could contact the service by phone, many time is just via email and wait, when the help is needed at that moment."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Martha Saripalli",
          "Nb_Reviews": 3,
          "Date": "2020-12-20T21:11:44.000Z",
          "Titre": "Power Diary is user friendly and…",
          "Contenu": "Power Diary is user friendly and economical. It makes our lives easier to search patients, update the insurance companies and maintaining the treatment records. We are really grateful for the Power diary. I personally feel that its best diary management I have ever seen. It  sends out the reminder to our patients and alerts us of patients status. I definitely recommend this every Practice"
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "NZ-based Clinical Psychologist",
          "Nb_Reviews": 1,
          "Date": "2020-12-23T02:58:47.000Z",
          "Titre": "So much faster for invoices!!",
          "Contenu": "I've been really happy with PowerDiary - it's super easy to send quick invoices out regularly, and I love the bulk payment function which I have only just discovered.  Would love to figure out how to send bulk invoices too - I imagine it has so much more to offer than I have managed to figure out myself, but it's definitely far easier than creating invoices the way I used to. I would recommend it to any sole trader!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Nancy Batenburg",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T21:31:55.000Z",
          "Titre": "Great potential to make Power Diary ours",
          "Contenu": "The more we use it, the more we see it's potential. We're new users but the tech support has been fabulous and any queries have been answered promptly. Our staff like it as they can check in from anywhere to see late cancellations but can also load reports wherever they prefer to work. We're still tweaking it to individualise it for ourselves - and while it is a strong platform as is, we've enjoyed making it work for us. Before we started using it, I asked about their policies about sharing information to third parties and their protection of our client's privacy. I was very happy with their response and how openly they shared their policies and protection measures about privacy and confidentiality. Well done Power Diary."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Allymac Massage Therapy",
          "Nb_Reviews": 1,
          "Date": "2020-11-13T09:36:39.000Z",
          "Titre": "I have been using Power Diary now for…",
          "Contenu": "I have been using Power Diary now for about 5 years and it saves me a lot og time and fuss. There is still one or two things that I would like to change or improve. I just haven't got around to contacting the company yet. That is one aspect I do like is that they have good customer service and if you have a change idea then they listen to you and consider whether or not it could be incorporated into the program for everyone's benefit."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Van Nguyen",
          "Nb_Reviews": 3,
          "Date": "2021-05-24T10:08:03.000Z",
          "Titre": "Intuitive and full of fantastic…",
          "Contenu": "Intuitive and full of fantastic features. To get the 5th star, I would want to see- private health fund direct claims- direct card payments (with a reasonable transaction fee that can be put forth to client)- direct debit payment options- an App"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "barbara albano",
          "Nb_Reviews": 1,
          "Date": "2020-12-21T15:29:33.000Z",
          "Titre": "I like power diary",
          "Contenu": "I like power diary, I use it for Psychiatrist Office, and power diary is very direct on the way to do the notes, and commuincations, it is also good for billing. I did notice though that my patients have a hard time reading the statements when I send them to them. I usually get calls asking what they owe because they are reading what was charged and thinking that is what is owed. but other then that it is really easy to navigate around the power diary system."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Life in Balance Psychology",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T07:58:17.000Z",
          "Titre": "We have found Power Diary exceptional…",
          "Contenu": "We have found Power Diary exceptional in looking after us in our Psychology business. They have looked after us when not understanding some technical things with prompt calling back and setting up could not be easy with them patiently running through things with us."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Denise Setton Podiatry",
          "Nb_Reviews": 2,
          "Date": "2020-05-27T21:28:44.000Z",
          "Titre": "Solo Practitioner dragged into the 21st century",
          "Contenu": "After having this system for a couple of years, I can say as a solo private practitioner it has revolutionized my practice.The automatic reminders have been well received by patients.I can access my appointments anywhere, and check details of patients on the go. My billing system is now up to date and I can easily send bills and statements out. It definitely has saved me time and helped me manage my work without staff. I use it for my patient notes and this is great too.I have had good support from the team and am very happy with my choice of Power Diary"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Justin Lee",
          "Nb_Reviews": 2,
          "Date": "2020-12-15T23:18:15.000Z",
          "Titre": "Great Management Software",
          "Contenu": "User-friendly, easy billing and client list management. Integrates well with a lot of other add-on softwares. Still room for a little improvement with mobile versions as it can be a bit fiddly. Lag + downtown experienced time to time.In terms of User accessibility options, as the business owner, the accessibility functions needs to be broken down to finer options. An instant messaging feature across users would also be very good. SMS feature can get very expensive. Would be nice to see Powerdiary and other client management systems implement free text messaging. Apart from these hopeful improvements, overall experience with Powerdiary has been seamless."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Valda",
          "Nb_Reviews": 2,
          "Date": "2021-05-18T01:44:21.000Z",
          "Titre": "We are a small charity and have been…",
          "Contenu": "We are a small charity and have been using Power Diary for almost a year now.We have found it to be a fabulous solution for our business. The email / text reminders have cut our workload significantly and ensured that our clients get timely reminders. The ability to send an attendance certificate to the client with only a few keystrokes is also a timesaver.There are a few enhancements that I would like to see made over time, but nothing that stops me working far more efficiently than was possible prior to adopting Power Diary.I would recommend Power Diary to any small company looking for an online calendar / scheduling system that is easy to learn and easy to use."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "My Appletree",
          "Nb_Reviews": 1,
          "Date": "2020-11-12T01:41:42.000Z",
          "Titre": "Power Diary has many great features",
          "Contenu": "Power Diary has many great features. The support, both online and in talking to a real person are also great. Sometimes there can be glitches but PowerDiary takes feedback quickly and makes improvements."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Stephanie Lindsay",
          "Nb_Reviews": 2,
          "Date": "2020-11-13T22:18:27.000Z",
          "Titre": "Power Diary is new to our practise",
          "Contenu": "Power Diary is new to our practise. The features I love are the SMS functionality (although a bit expensive).PD is very easy to use however as this productive is relative new to our practise there are things I have not had time to work out yet and I would love use eg the Client Portal & the Sessions Packs.The Waitlist is great however to have the functionality to sort and print this list would be helpful when we have 50 plus clients on it.Not sure I am a fan of having to export to Xero manually  however I do see some benefits in this. I have given a 4 star rating as I am happy with this product so far. If you had a customer service number that would also be a bonus instead of sending emails."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Robyn Maddern",
          "Nb_Reviews": 2,
          "Date": "2020-09-28T10:26:08.000Z",
          "Titre": "I got to know power diary slowly as I…",
          "Contenu": "I got to know power diary slowly as I am a sole practitioner with the luxury of a little time.  I ran double records until I was comfortable I knew what power diary was doing.  It's a very functional program and so much so it creates high expectations on the part of users, which perhaps is unrealistic from a programming point of view.  Having gone through the evolution of a research software package over 25 years, I see power diary as having a great platform for adapting into the future as the needs of health practitioners change.  Looking forward to the journey."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "David Rankine",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T10:33:29.000Z",
          "Titre": "Really good system",
          "Contenu": "Really good system which I am pleased we introduced into our practice. We do however find it hard to work out when support will be on live chat in the UK and some eCommerce functionality like Discount/Coupon Codes isn't available which we feel should be from a system like this, which in our option would give them 5 stars if it was available."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "leah haar",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T23:24:30.000Z",
          "Titre": "It's a great all in 1 system and ticket…",
          "Contenu": "It's a great all in 1 system and ticket the bixes I needed for my private practice."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "PE Reception",
          "Nb_Reviews": 1,
          "Date": "2020-12-15T22:17:34.000Z",
          "Titre": "I find Power Diary easy to use and find…",
          "Contenu": "I find Power Diary easy to use and find support from the company great. PD  are always expanding and listening to their customers and adding features regularly. As we use the program more we find features that help our business."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Julie Cheney",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T22:58:25.000Z",
          "Titre": "Effective and useful",
          "Contenu": "Effective and useful scheduling and record keeping mechanism for my business. I don't use it's full capacity because my business operates slightly differently. But it's still the only platform I've found that does  it all for me."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Tanya",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T00:05:10.000Z",
          "Titre": "Power Diary has been a life changer for…",
          "Contenu": "Power Diary has been a life changer for me as a psychologist doing my own admin, reception, etc! The automatic SMS reminders asking for confirmation of appointments has cut down admin time.  The ability to enter different locations is very helpful, being able to enter 'school', 'home visit', 'park', 'Zoom', etc. I really like the rostering component and the ability to override easily if necessary.  Activity reports are great. The different service types are of course useful too.  I am yet to use the communication templates but I imagine they will be just as good.  I haven't used the invoicing tool yet, just a matter of time.  Looks easy enough.  Couple of minor negatives: not being able to send a reminder morning of appointment date, and not being able to change times for reminders for interstate clients during daylight saving.  Otherwise, an excellent product.  Highly recommend it."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Michael Street",
          "Nb_Reviews": 3,
          "Date": "2020-12-15T21:34:27.000Z",
          "Titre": "I changed to Power Diary as I had…",
          "Contenu": "I changed to Power Diary as I had become dissatisfied with the major diary that I had been using for many years.Power diary is easy to use and does everything i want.The layout and clickthroughs are really handy and most of all, the Help Desk is helpful!"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Elicia Clarke",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T00:32:38.000Z",
          "Titre": "I love the online forms and the easy…",
          "Contenu": "I love the online forms and the easy layout. When setting up new clients remotely it has been so easy to send them the online consent forms etc. There’s no printing or scanning required for the client which I love."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Admin ER",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T02:02:23.000Z",
          "Titre": "very helpful website for business",
          "Contenu": "very helpful website for business! Auto-messages are useful and convenient; clear and simple menu list, has capacity to store numerous of clients information, downloading and uploading speeds can't be any better. Yet, the platform still have more space for renovation, such as excluding fee for sending message, or set up a tool of reminder for user to contact clients at a particular time when needed"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Catherine Healy",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T00:16:53.000Z",
          "Titre": "Great for small businesses",
          "Contenu": "Powerdiary has been great for my business.  I work as a sole practitioner and I find the system useful for booking appointments, sending reminders, storing case notes, invoicing and keeping my administration automated.  I have worked with a Powerdiary partner to help me learn how to get the best out of the system and I follow the social media pages to hear of others' experiences and tips."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Huw Jones",
          "Nb_Reviews": 1,
          "Date": "2020-11-15T21:34:04.000Z",
          "Titre": "Good platform with easy to use diary",
          "Contenu": "Good platform with easy to use diary, setup and financial planning. Can get as much or as little as you like from it as required. Quite a jump in price from 3-4 calendar users though per month"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Ursula",
          "Nb_Reviews": 1,
          "Date": "2020-11-15T23:51:47.000Z",
          "Titre": "I have been using Powerdiary for my Remedial Massage Business",
          "Contenu": "I have been using Powerdiary for my Remedial Massage business for over a year now. I find Powerdiary to be extremely user-friendly and the online booking system for my clients remains nice and simple which makes my online booking service 90% of my bookings, removing the need to return phone calls, which can be quite lengthy and time-consuming. I would like to see as an upgrade for Powerdiary, the ability to 'block-out' appointments as a block. I mean, if I have one-hour appointments available, (even though I have my diary set out in 30min sections as I have 30min between each booking) that the pre-formatted bookings that I view at the practitioner's end are viewed as one-hour blocks...not two 30min blocks. When I need to book an appointment manually, I have to make sure I highlight both 30min sections as it doesn't recognise the appointment as an hour. This would be more convenient and to ensure that I have the whole hour booked. I have contacted support and they explained that this wasn't an option, however I have used other software that allows for this, so hopefully this may be an option in the future."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Niki Huang",
          "Nb_Reviews": 1,
          "Date": "2023-01-16T04:06:19.000Z",
          "Titre": "Easy to manage",
          "Contenu": "Although the price is a bit high for single use, it saves a lot of work for personal massage studios and is easy to manage."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Marcia Finch",
          "Nb_Reviews": 1,
          "Date": "2020-11-16T10:33:32.000Z",
          "Titre": "I find Power diary is in general very good…",
          "Contenu": "I find Power diary is in general very good,there is room for improvements as my wifes work involves,invoiceing medicare, and reconsilation of payments is a chore.Payment notiications are received via Toolbox /medicare it would be great if they could be linked by invoice number with the client"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Kat",
          "Nb_Reviews": 1,
          "Date": "2020-11-20T02:57:27.000Z",
          "Titre": "Great features, great support, responsive to customer feedback.",
          "Contenu": "I use Powerdiary across two separate businesses. I loved it so much with the first that when I set up the second I just knew I had to use Powerdiary as my diary manager. It saves me so much administration time and is so much more than a diary. The forms, correspondence templates, email and SMS features have all been so incredibly helpful in my business. Clients also comment frequently on how 'professional' my correspondence looks. This is largely due to Powerdiary. I am also really grateful for the responsiveness of the Australia-based support team. Occasionally there are glitches or minor problems with features, but the team are always right on top of this, sorting it out as soon as possible. When customers provide feedback on how their product can be improved the Powerdiary team accepts this with gratitude and looks to respond to this feedback with improvement to their product. Because of this great service and responsiveness to feedback I feel confident that I'll stay with them for a long time as my businesses grow. (Please note: I was offered a $25 gift card in exchange for writing this review. However, this has not coloured my feedback: I do think Powerdiary is a very good product)."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Linda Copper",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T12:12:50.000Z",
          "Titre": "I have been using Power Diary for booking appointments.",
          "Contenu": "I have been using Power Diary for nearly a year now and find it easy to use. i am sure it has a lot of features and benefits i have not yet utilised."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Christine Guttenbeil",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T19:05:52.000Z",
          "Titre": "I find power diary extremely user…",
          "Contenu": "I find power diary extremely user friendly and quick. I also like the face you can complete clinician notes on your smart phone which saves a lot of time"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Mind & Me Psychology",
          "Nb_Reviews": 1,
          "Date": "2022-08-08T23:40:53.000Z",
          "Titre": "user friendly",
          "Contenu": "Powerdiary is user friendly and has thought of everything. Definitely recommend for allied health."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Monique M",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T21:02:25.000Z",
          "Titre": "Fantastic management system",
          "Contenu": "Power Diary has been easy to use and allows for seamless management of client appointments, as well as communication (telehealth, emails, letters, appointment reminders).It has assisted in our practice being able to move to paperless management."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Angelica Bilibio",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T00:48:01.000Z",
          "Titre": "Great system and supportive team",
          "Contenu": "Great software and supportive team. Needs to improve on the waiting list system."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "TKL",
          "Nb_Reviews": 1,
          "Date": "2021-09-07T11:58:59.000Z",
          "Titre": "Organised and Easy",
          "Contenu": "As an itinerant contractor in the allied health profession, a number of people across the Eastern states are involved with my clients and their appointments. Power Diary makes it easy to schedule appointments that don't clash with other therapists, record session notes, file referral and historical notes, write invoices, check on clients' progress with other therapists in our organisation, and report to our admin and CEO. Different sections are well organised and with some training, it is easy to navigate.I only have two things that frustrate me - the invoices attached to the calendar often glitch and don't carry on with regular clients, so I need to rewrite them frequently; and my immediate supervisor doesn't have access to my diary (but that could be an organisational decision?).I would definitely be happy to recommend Power Diary to anyone using them under similar employment circumstances."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Purposed Psychology",
          "Nb_Reviews": 1,
          "Date": "2020-06-11T00:02:28.000Z",
          "Titre": "Very Helpfull",
          "Contenu": "I.T support worker here. Power diary is great. Easy to use and a wide range of features that make my job a lot easier."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Mark Langlois",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T22:35:30.000Z",
          "Titre": "Integration of notes",
          "Contenu": "Integration of notes, invoicing, txt reminders. Communication and reporting is excellent."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Wanvilai Therapeutic Massage",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T01:08:09.000Z",
          "Titre": "Easy to use.",
          "Contenu": "Easy to use. I was very happy with my business to get power Diary."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Dian W.",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T10:37:18.000Z",
          "Titre": "Difficulty in Telehealth",
          "Contenu": "Though your Telehealth has been a great help for health professionals and the patients, unfortunately lately there have been issues of difficulty in accessing Telehealth via PowerDiary experienced by some patients. Despite their efforts to update their apps on their mobile phones, this difficulty remains. Please make Telehealth more user-friendly and easily accessible, as some patients are not technological savvy. Many thanks."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Clare",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T11:47:13.000Z",
          "Titre": "Physio Review",
          "Contenu": "I’ve been using PowerDiary as a sole trader. My experience has been very positive and I find the software intuitive and easy to navigate. I’ve recently incorporated and although I am still the only practitioner, I can already see the features I will need in the future are available. It was also very easy to change the account details saving me the hassle of having to set up a new account."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Van Nguyen",
          "Nb_Reviews": 3,
          "Date": "2020-04-17T08:46:19.000Z",
          "Titre": "Love the innovation and commitment to…",
          "Contenu": "Love the innovation and commitment to hearing our requests, answering honestly and working hard at always improving! Upgrades have always made daily functions faster, smoother and instant. Has a good amount of ability for self to customise vs good automated systems such as Auto reminders, pay online, client portal with view of invoices, DVA and Medicare claims and more Telehaalth feature is simple, effective and great qualityHanging out for HICAPS Go integration to seal the deal to 5 stars;;"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Erin - Active Fitness HQ",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T04:37:19.000Z",
          "Titre": "Power Diary for the win!",
          "Contenu": "The interface and usability of Power Diary is fantastic. The fact that this was designed by Health Professionals for Health Professionals is plain to see and makes my working life so well organised and manageable. Any questions I've had regarding how to do certain things have been quickly and efficiently answered and the promise that this Practice Software will only keep improving. They have been adaptable and accommodating and I won't be going anywhere else anytime soon. Thanks Power Diary"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Lively Eaters",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T02:14:16.000Z",
          "Titre": "Love how responsive PD is to…",
          "Contenu": "Love how responsive PD is to suggestions and assistance.Love the waiting list functionLove the ease with which the program itegrates with XeroLove the reports which can be pulled for monthly stats.Really user friendly program"
        },
        {
          "Note": 4,
          "Lieu": "GH",
          "Pseudo": "afua adjei-kwayisi",
          "Nb_Reviews": 2,
          "Date": "2020-04-17T13:42:15.000Z",
          "Titre": "Amazing efficient EHR /CRM Software",
          "Contenu": "I’ve been with Power diary for a year and a half now. I chanced on them while frantically searching for an EHR system that would meet my wellness service business. I don’t regret settling with them. Their interface is flexible, with a smooth ability to modify settings to suit any health care business. And their support is amazing. Their pricing is moderate but it’s worth all the features they provide. The recent free Telehealth has me hooked on the using Power Diary for the long haul. I give them 4 stars because there is a minor issue of my country  not being part of the listed locales . This makes it challenging using the invoice feature . But over all, I love it and they deserve 5 stars ."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Mindspace Psychology",
          "Nb_Reviews": 2,
          "Date": "2020-04-20T10:30:36.000Z",
          "Titre": "Generally it's really good.",
          "Contenu": "Generally it's really good.On some occasions, powerdiary is slow and has some glitches which can be annoying on a busy day but for the most part it works well.Having the online forms function with automatic filling in of templates would be fantastic.Having share screen available and group chats on your video calls would also be great.Having a security option for a front desk person to simply \"arrive\" the patient only and not also be able to make other changes to appts would be handy (e.g. I have an online reception and often the front desk receptionist still tries to book appts when I don't want her to but I keep her access open as my room is upstairs and I need her to stoll arrive patients for my psychs)Lastly, integration with other bodies such as lantern Pay (TAC) would be fantastic."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Tegan Hopkins",
          "Nb_Reviews": 1,
          "Date": "2020-04-22T23:48:34.000Z",
          "Titre": "Easy to use and learn, multifunctional, often updated",
          "Contenu": "Easy to use interface, multi-functional - allows me to run my private psychology practice from one platform.  Program developers are constantly updating and improving."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Steve Jobson inSync for life",
          "Nb_Reviews": 1,
          "Date": "2020-02-18T00:50:01.000Z",
          "Titre": "Well-developed, User friendly and very efficient",
          "Contenu": "This is great practice-management software.  The best that I looked at for our growing practice.  It has all that we need for booking appointments, reminders, invoicing (it links to Stripe or stores cc details), medicare rebates and so much more.  I'm really impressed with the support service also - there have been many times that we have had to contact Support for advice and they have always responded in a timely and efficient manner.  The only real issue I have is the big jump in cost from 9 diaries to 10 (or really from the Medium User - 4-9 Diaries - to the Large User 10 - 20 Diaries).  In our practice we have 10-12 part-time/casual practitioners... so for all to have a 'full-time' diary, it means a jump  in about $1000 per year.  It's a shame the fees can't be in smaller increments per diary rather than such a big jump in cost."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Clare Franklyn Psychologist",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T00:36:09.000Z",
          "Titre": "Responsive to support requests",
          "Contenu": "Responsive to support requests, easy to use system with consistent updates that are reflective of what I need as a user."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Naz",
          "Nb_Reviews": 1,
          "Date": "2020-02-24T09:46:37.000Z",
          "Titre": "Customer service is excellent",
          "Contenu": "Customer service is excellent. issues get resolved straight away when I call."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Claudia Dullo-Sneesby",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T11:18:34.000Z",
          "Titre": "great system",
          "Contenu": "great system great support team answer promptlygreat service :)"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michelle Carlyle",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T00:46:14.000Z",
          "Titre": "Always great customer service and just a great platform",
          "Contenu": "The standout for me with Power Diary is their Customer Service. It's always available, easy to access, and you can trust they'll come back to you if the answer requires additional expertise. But the system itself is so user friendly, with lots of great functionality. We're a small team and with very little IT experience in-house, we were able to implement the system quickly and easily."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lisa Moore",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T13:01:10.000Z",
          "Titre": "Power Diary is the the best practice software on the market",
          "Contenu": "Power Diary is the best tool I use in my practice. It streamlines my administrative, appointment, documentation & payments processes effortlessly and has given me back so much valuable time that I can spend working on my business rather than in my business. The support team are great & any issues are quickly resolved. I’m so glad I chose Power Diary to use for my practice software!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Lindsay O'Gorman",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:54:27.000Z",
          "Titre": "An easy to use system with help…",
          "Contenu": "An easy to use system with help available at every step to organise your business."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Chris  Bodyworks Physiotherapy",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T14:07:07.000Z",
          "Titre": "Power diary is fantastic",
          "Contenu": "Power diary is fantastic. We had been wanting to go digital but were wary of the transfer, losing control and it all being too difficult. We needn’t have worried as power diary is so simple to use, you have a fee free trial period and the diary gives you so much control of information. power diary allows excellent insight into the business and allows easy analysis of staff productivity, referral bases, income and debtors all at the touch of the mouse. The colour coding allows for easy identification and navigation. I no longer have to go to work to do reports and letters and have all the information at hand. Report writing becomes easy with pre populated templates. Billing is instant and improves cash flow. I only wish I had changed to Power Diary before. I have personally recommended Power Diary to friends and colleagues already"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sierra",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:43:59.000Z",
          "Titre": "Simple, modern software for your practice!",
          "Contenu": "We've been using Power Diary for over a year now and the program is easy to use. I enjoy being able to communicate with patients over texts, especially in this day and age where people are skeptical of phone calls. Scheduling is simple."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Isis Psychology Service",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T11:34:01.000Z",
          "Titre": "I have used Powerdiary for many years…",
          "Contenu": "I have used Powerdiary for many years now. I’ve used other programs with work, but prefer Powerdiary for its features, online support and ease of use.I am still learning about new features"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Amanda Connell",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T09:47:40.000Z",
          "Titre": "Great for working with a VA",
          "Contenu": "PowerDiary has been great for working with an offsite admin. My admin is able to seamlessly communicate with me using flags, to do lists and creating tasks. I love that PowerDiary is a one-stop shop making additional third-party apps unnecessary. This has allowed for a simple and streamlined system which as a busy soletrader is perfect."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Caitlin Sopp",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T02:34:58.000Z",
          "Titre": "Easy to use!",
          "Contenu": "Powerdiary is so easy to use and allows me to manage my solo psychology practice admin with ease."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Gail Macfarlane",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T23:05:49.000Z",
          "Titre": "User friendly & A+ support",
          "Contenu": "PF is so user friendly and there is so many options to use. Even better than that is the available support through webinars, help search, tutorials and the 1:1 sessions you can book with a Pf expert to help you on whatever topic you need at a time that is convenient to you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Shakeera",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T13:04:22.000Z",
          "Titre": "Saves so much time!",
          "Contenu": "Power Diary makes managing the diary of all of my counsellors super simple and saves me so much time."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mary  McMullen",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T12:34:09.000Z",
          "Titre": "I couldn’t run my psychology practice…",
          "Contenu": "I couldn’t run my psychology practice without power diary. I looked at many systems however power diary was being used by so many of my peers and when  researched it , I found it had everything I was looking for to run a successful business. But what makes them exceptional is the ongoing training options and their excellent appreciation of my business, this aligns with my own business values. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "nazam Iqbal",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T01:37:20.000Z",
          "Titre": "I have been using powerdiary for 1…",
          "Contenu": "I have been using powerdiary for 1 year. Really easy to use and saves so much time. The reminders are great. Customers find it easy to book aswell."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Katy",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T11:27:00.000Z",
          "Titre": "Highly recommend this practice management system",
          "Contenu": "Help when needed (access to in person support/ videos/ easy to follow step by step guides) It is clear where to find things and update the system as needed."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel Windridge",
          "Nb_Reviews": 2,
          "Date": "2023-12-01T11:09:06.000Z",
          "Titre": "I have no problem whats so ever giving…",
          "Contenu": "I have no problem whats so ever giving Powerdiary this 5 star review. Since using powerdiary my admin work has reduced significantly.  My patients rave about the online booking system. And so do I actually. The guys and gals at Powerdiary are updating the platform with new and effective ways to streamline your practice and they are always there to help you should you need it. Highly recommended from me :-)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Clements",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T16:39:26.000Z",
          "Titre": "The ongoing support the company provides.",
          "Contenu": "I had the pleasure of working with Katie to set documents in my electronic medical record system, and I couldn't be happier with the results. Their expertise and dedication made the transition smooth and efficient. I highly recommend their services!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Katie Leitzell",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T16:50:52.000Z",
          "Titre": "Excellent Diary",
          "Contenu": "Power Diary have made my appointment booking system so easy. It never fails and is very straight forward. I like the messaging reminder system set up, so that my clients get a text reminder 24 hours before their appointment. It is separate from my own phone text messages so very easy to see who has confirmed. All in all, I’ve been using Power Diary for a year now and I love it!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Angie",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T21:06:05.000Z",
          "Titre": "Powerdiary is a must for maintaining a professional business",
          "Contenu": "Powerdiary is so easy to use. It gives me peace of mind in my private practice as a counsellor as its very professional and keeps notes safe. The app is super helpful too when you are on the go and you need to check your appt diary or quickly respond to a client."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Charmaine Dunn",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T11:05:39.000Z",
          "Titre": "Power diary is the best!!",
          "Contenu": "Power diary has been a lifesaver for my business!! It’s a great system and their customer service/support has been amazing any time I have reached out especially in the beginning when I was setting up. Highly recommend power diary!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Francesca D",
          "Nb_Reviews": 5,
          "Date": "2023-11-24T08:33:01.000Z",
          "Titre": "Power Diary have been supportive throughout",
          "Contenu": "Power Diary have been supportive from the start. I have no experience setting up a client management tool and they provide so many avenues for support. Articles, videos, webinars and one on one sessions. The tool itself is fantastic, I love how many functions it pulls together and the ability to connect with other tools as needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Carpenter, CCH",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:06:57.000Z",
          "Titre": "As a single practitioner",
          "Contenu": "As a single practitioner, I appreciate Power Diary's pricing structure and value having access to all the features.  I have used Power Diary since March of 2022.  During the initial set up of my platform, I reached out to customer service for help and received a very quick response and also scheduled a time for a zoom meeting so they could walk me through some issues I was having.  I have also used the online help chat feature and it has always addressed whatever issue I was having.  Power Diary also does a very good job of communication via multiple platforms (text, email, social media, etc) when there are issues or sharing of update information.  I have recommended Power Diary many times to other practitioners."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "K Burford",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T21:47:49.000Z",
          "Titre": "Great for a Small Business",
          "Contenu": "Its driven footfall onto my website and my clients have said how easy it is to book online."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Fu-Jung Jukes",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:30:25.000Z",
          "Titre": "Convenient practice software",
          "Contenu": "I run a home based remedial massage business. Have been swipe to this one for about 2years. The software is convenient to help me deal with paperwork such as schedule, client records and info, text remider and bulk email function, and payment function in one platform. Normally they reply my emil enquiry effectively as well.I think I haven't reached the maximum potential of this software as I only work on my own. But it helped me deal with daily tasks, easy to use, and I'm happy with it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Grace",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:22:00.000Z",
          "Titre": "It's been about two years now since I…",
          "Contenu": "It's been about two years now since I started using Power Diary and I wouldn't use anything else."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Alexandra Northey",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T04:07:53.000Z",
          "Titre": "I have used Power Diary for a year now…",
          "Contenu": "I have used Power Diary for a year now and recommend it to other Exercise Physiology clinics. Power Diary is great for managing appointments, billing, and client records. It is intended for clinics with a premises however when I first signed up I had a one on one video chat with Power Diary and they showed me how to set it up to be suitable for my mobile practice."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Judith H",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T23:25:45.000Z",
          "Titre": "Look No Further",
          "Contenu": "As a small business owner I wanted to be sure that the program I purchased would be the high quality product I needed. I couldn’t afford the run around or stress. PowerDiary has been a godsend. It covers every possible need and use. Templates. Messaging. Invoicing. Client services. Booking. The list is endless. I highly recommend exploring PowerDiary as your go-to. Easy to use. Easy to individualise. It has everything."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jayne Jones",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T14:09:56.000Z",
          "Titre": "I have been using Power Diary for about…",
          "Contenu": "I have been using Power Diary for about 19 months and love it. Makes everything so much easier as it’s a one stop shop. Great service by Power Diary - they always get back to you if there is an issue.😊"
        },
        {
          "Note": 5,
          "Lieu": "KH",
          "Pseudo": "April Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T04:23:43.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "What stands out to me with PowerDiary is the efficient customer service. Every time I have had a question or an issue that couldn’t be solved or answered with the FAQ, I would reach out on the chat and get answers promptly. I also really like the interface for the charting and invoicing which makes work so much easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica Nichols",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:00:29.000Z",
          "Titre": "User Friendly and Convenient",
          "Contenu": "When I was looking for a EHR for my small practice, I reviewed several platforms and I chose Power Diary because it was user-friendly and I could access important information with ease. I have worked with Power Diary for over a year and have been very pleased with my experience and I would recommend Power Diary to anyone who is looking for a EHR."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Coreen  Bradley",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T18:34:06.000Z",
          "Titre": "The Power Diary App is Robust and Easy to Use",
          "Contenu": "The Power Diary app is robust, easy to use and has all the features I need to run my business smoothly and efficiently. I don't run a traditional clinic, thus, I don't use all the available features, but as someone who has implemented similar systems in health clinics, this app has all the bells and whistles other clinical apps offer, at a reasonable cost. I trust that my client and personal information is secure.The support by the team is timely and resolves concerns or issues quickly. I've used Power Diary for over a year now, have looked at other apps and compared both features and cost, and I would not change! I have recommended this product to several colleagues."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bec",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T14:19:30.000Z",
          "Titre": "I love Power Diary!",
          "Contenu": "I love Power Diary because it so user friendly, and every aspect of the user's experience appears to have be considered! I have loathed the admin aspect of my practice in the past, but Power Diary makes every aspect of it easier, and saves me so much time!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Judith",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T23:31:32.000Z",
          "Titre": "Easy to navigate, quick to help",
          "Contenu": "I find I can easily navigate Power Diary and there is always online support in the background if I can't. It offers a comprehensive system for patient booking, account management and client and staff organisation. I would recommend to anyone thinking of getting a comprehensive system. It will save you time and effort at the click of a mouse and free up time for the things you love, whilst managing what you hate!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Pete Flower",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:50:43.000Z",
          "Titre": "Easy to use platform with sufficient…",
          "Contenu": "Easy to use platform with sufficient features for a small practice."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kim Mole",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T13:51:18.000Z",
          "Titre": "Absolutely LOVE powerdiary",
          "Contenu": "Absolutely LOVE powerdiary. It has completely changed my business - making it seem more professional and also streamlined everything I do. I would not go back to life beforehand. This is a game changer!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Joel Moffat",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:11:19.000Z",
          "Titre": "Automation and ease",
          "Contenu": "Lots of automations that make admin easy. Lots of developments over time that continue to improve the software. Lots of engagement with users to figure out what people want and need out of the software."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cameron Kenworthy",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T03:14:01.000Z",
          "Titre": "top marks from me",
          "Contenu": "I run a small private practice and Power Diary has been a game changer, it integrates with everything i need it to and once you learn it all is a great overall system."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Christine  Halden",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T11:50:02.000Z",
          "Titre": "User friendly software",
          "Contenu": "I find it really user friendly and have it as my preferred calendar for personal and business tasks."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Claire",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T12:08:00.000Z",
          "Titre": "This is a really intuitive system",
          "Contenu": "This is a really intuitive system. It is easy to use, flexible for a range of assessments and professionals. Support with any queries has been great. Can't fault it from our experience. Would definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sharmaine",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T07:19:01.000Z",
          "Titre": "Easy medicare tracking",
          "Contenu": "I love how easy it is to track how many appointments a client has had under medicare, and how Power diary doesn't let you claim if the client doesn't have a referral linked to their appointment. It makes things so much easier & I would definitely recommend Power Diary to other practices."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Ann Cox",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T11:51:46.000Z",
          "Titre": "Easy Practice System for Therapists",
          "Contenu": "Easy to set up, I liked the  forms templates which I customised to suit my private practice. I was able to create an automatic response, and a new client intake form is sent out automatically when a new client books. Plus it has an integrated payment system. So far I'm impressed with the intuitive way that it is set up, since I started using it. The help info online and customer support has exceeded my expectations so far."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Skye Keers",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T01:47:02.000Z",
          "Titre": "Response to an enquiry",
          "Contenu": "I received a quick response to a question that I emailed. The response was very informative and detailed and also included step by step instructions which were easy to comprehend."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lydia Pell",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T11:20:32.000Z",
          "Titre": "Definitely recommend",
          "Contenu": "I use PowerDiary for my private practice as a therapist with diary management, record keeping, telehealth calls, and invoicing and have been doing so for a couple of years. I am impressed by how PowerDiary keeps developing the system to include more guidance, and has recently upgraded the telehealth call options. It is a straight forward system to use for invoicing, and this helps me keep on top of the financial aspects of my work. I also really like that clients don't have to download software to use the telehealth system and that they get a unique code that they can save for all their calls. My only improvement would be to be able to send calendar invites with the link embedded as some people are now used to this with other systems, but I use the emailing reminder to enable clients to always have the link to hand. I am also happy to use a system that complies with GDPR (uk) and I can be confident saying to clients that their information is stored safely - and isn't on my computer, but in a secure password protected system.Its also affordable for small private practitioners like myself."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "J H",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T16:34:01.000Z",
          "Titre": "Power Diary in a single-practitioner practice",
          "Contenu": "I work one day per week in private practice and have been using Power Diary for the practice management application since starting 18 months ago.  I looked at a few practice management offerings and eventually chose PD.  The interface is intuitive and offers plenty of ways to customise the PD experience so that it works best for you.  I was immensely impressed with the level of support I received as a single-user license holder.  My one negative is the lack of integration with Outlook for email and calendaring, but the impact has been minimal so far.   I'd recommend PD to anyone looking for a simple yet powerful practice management application with great support and competitive prices."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Lynda Carlyle",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T18:18:01.000Z",
          "Titre": "Can't go wrong",
          "Contenu": "This is a great product with good support. Constantly updating and expanding what you can do on the platform"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Laertis",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T13:21:00.000Z",
          "Titre": "Excellent",
          "Contenu": "Àn excellent online Practice Management software which save me so much time and effort in my busy schedule!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Chandler",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T17:18:15.000Z",
          "Titre": "Great functionality for very affordable price",
          "Contenu": "I appreciate the functionality of Power Diary for the price. The ability to easily build and use templates for visits and notes as well as the features for communicating with patients via text and email are especially helpful to us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Revive Veterinary Rehab",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T15:49:34.000Z",
          "Titre": "Works Great For My Small Business!!",
          "Contenu": "We use PowerDiary at my job and we love it!! It is so easy to use and there are so many amazing features that make our schedule run so smoothly. Our clients love it also which makes us look good. And the price is so affordable for our small businesses! I'm so glad they offer a free trial period that was easy to sign up for so that we could quickly see if it was the right choice for us!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Elise",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T12:16:17.000Z",
          "Titre": "Easy to use system that is intuitive…",
          "Contenu": "Easy to use system that is intuitive and helpful follow up when questions are asked. Great functionality that streamlines the systems within private practice."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Paula",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T00:18:40.000Z",
          "Titre": "I have been a user of Power Diary since 2021",
          "Contenu": "I have been a user of Power Diary since starting up my practice almost 3 years ago. I wanted a paperless, efficient, organised, and integrated system in working which included all aspects of my practice from taking enquires, all the way to taking payments, providing electronic Medicare rebates, and sending discharge letters where letters were partially pre-filled. Power Diary does so much for me that I have not needed a virtual assistant or to hire a bookkeeper! I have Xero and Stripe connected to Power Diary which makes my bookkeeping and taking payments a breeze! Power Diary is flexible where you can use it as little or as much as you like. I have become dependent on Power Diary. I feel assured that it will continue on due to the commitment Power Diary has to their practice management system, with updates and security ongoing, and responding to feedback and collaboration with other systems."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Christopher Long",
          "Nb_Reviews": 2,
          "Date": "2022-03-01T02:29:13.000Z",
          "Titre": "Simple and Elegant",
          "Contenu": "I opted for Power Diary when I started my new health care business. After reviewing many options, nothing compared to Power Diary for ease of use, integrated payments, Medicare billing automatic remiders and patient record keeping. On top of that, everything can be accessed with any device with a screen! Data transfer was as smooth as silk and I was up and running within hours. I would definately recommend PD to anyone looking to run a small to medium business."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "sam spencer",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T13:25:54.000Z",
          "Titre": "Power Diary makes my business run smoothly",
          "Contenu": "Power Diary makes my business run smoothly and reduces my admin time to an extremely manageable amount.It is user friendly and intuitive to use. Once all your tools, forms and letters are as you want them client file management & communication with other professionals is merely a couple of clicks.My case load is now higher as my admin time is so low."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dawn Clarke",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T21:29:15.000Z",
          "Titre": "I couldn't do without my Power Diary",
          "Contenu": "I couldn't do without my Power Diary. From the automated reminders to the ability to track my monthly earnings, Power Diary has saved me so much time, effort and stress.I am a Remedial Massage and Trauma Therapist working solo so to have these administrative tools readily available is invaluable.I am able to take bookings over the phone using my mobile phone app. version.Too easy.Thanks Power Diary"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Cooper",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T18:39:17.000Z",
          "Titre": "This software is so intuitive and easy…",
          "Contenu": "This software is so intuitive and easy to set up for my practice. Made my own forms, personalized with my logo, easy set-up calendars, payment tracking, built-in telehealth platform, built-in texting and email that save right to your client records. Everything I need, all in one place."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine Hoch",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T19:32:43.000Z",
          "Titre": "Medical software just keeps improving",
          "Contenu": "Medical software just keeps improving, but customer service is often lacking.  Power Diary's customer service has been excellent!  Their documentation/FAQ/Instructions are at your fingertips and if for any reason you can't get help there - a quick e-mail gets you the help you need."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "C, Ward",
          "Nb_Reviews": 1,
          "Date": "2020-07-03T07:45:14.000Z",
          "Titre": "Power Diary has made my business more…",
          "Contenu": "Power Diary has made my business more efficient. When you know your way around it, you can do so many things to make life easier as a practitioner. Great for appointments, letters, emails, telehealth, financials, Medicare and even Mailchimp. Integrates with many other systems that allied health use in practice daily."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kathryn Smith",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T13:16:38.000Z",
          "Titre": "Ultimate management system",
          "Contenu": "Power Diary has made setting up private practice very smooth as it does everything. The 1-1 help at the start was invaluable and saved me hours of trying to figure it out myself"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Helen Walker",
          "Nb_Reviews": 1,
          "Date": "2021-05-24T10:57:44.000Z",
          "Titre": "Fantastic user-friendly system",
          "Contenu": "Fantastic user-friendly system. I've been using Powediary for my client note system since November and am thrilled at how easy it has been to use and how quickly it is to access support if needed from the Powerdiary team. It has been so simple to train new staff to use and I'm really pleased with my decision with this over other client management systems on the market. Thank you Powerdiary"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Heather Kell",
          "Nb_Reviews": 1,
          "Date": "2022-07-12T03:48:20.000Z",
          "Titre": "Counselling Practice",
          "Contenu": "I started my practice about 2 years ago, and was looking for a diary and programme that would help with booking appointments, paying bills, setting up invoices, etc.  I was recommended PowerDiary and haven't looked back.  Great programme.  Excellent support.  Just ask a question and there will be someone to answer it.  For someone not tech-savvy like me, I have to take more time and need patience to 'get it'.  So I have appreciated their support."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dr Nicole Moriarty and Associa",
          "Nb_Reviews": 1,
          "Date": "2021-05-10T11:52:29.000Z",
          "Titre": "Brilliant",
          "Contenu": "I have been using Power Diary for over 8 years, and left admin support behind when I switched over to it. Once set up it is so easy to use and user friendly. Any support questions are responded to quickly. I love the automated sms reminders, that bookings change colour once they’re confirmed by clients and being able to directly process clients Medicare rebates and Medicare bulk billing. The reports it provides are very useful, as is the ability to click a button to see how many appointments a client has attended since their last referral. Clients love the capacity to be able to book online. Overall a brilliant system."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "LJ",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T09:09:14.000Z",
          "Titre": "Intuitive",
          "Contenu": "Intuitive - Moved from another system to PD, and I find PD so much more intuitive and user friendly. Sorting issues, and finding answers is a google search using PD name in the search field. There were some glitches when changing over, and this was resolved over a couple of emails. Only downside is no quick phone chats when you need an answer, it is email based communications but most times there is a quick response within 10mins sometimes next day. But all issues resolved. Happy I've switched."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nicole Lalich",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T12:20:51.000Z",
          "Titre": "I use Power Diary for my home based…",
          "Contenu": "I use Power Diary for my home based Remedial Massage therapy business. It has been a total game changer in helping me with SOAP notes for my clients. The templates are easy to use and to 'tweak' to meet my needs. Power Diary has made a tedious (but necessary) task so easy and totally changed the downtime I need to write my notes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Groarke",
          "Nb_Reviews": 2,
          "Date": "2021-03-15T23:17:28.000Z",
          "Titre": "This is the most astonishing of applications",
          "Contenu": "This is the most astonishing of applications.  It effectively runs our whole business, and our accountant loves it too!It is so intuitive that everyone who uses it is self-taught.  I only had to write a few notes to keep everyone on the right track.We would like to see some enhancements - gift card processing, and, loyalty program processing - which we currently run manually!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kerri",
          "Nb_Reviews": 2,
          "Date": "2022-03-02T22:05:11.000Z",
          "Titre": "Service levels are amazing",
          "Contenu": "Service levels are amazing, although I do miss the ability to talk directly to a person. The system is now to go via a text or email conversation. However, service is still fast and efficient and all the staff are great.My issues are always resolved quickly.The PD system is intuitive and easy to use and it's features makes running a practice easier."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jess L",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T22:29:01.000Z",
          "Titre": "Godsend!!",
          "Contenu": "Power Diary has been an absolute godsend as a solo private OT practitioner. It has made scheduling, creating session notes, invoicing, end of year finances and MORE, so easy with the click of a few buttons. It saves me hours of admin work that I'd have to do if I didn't have a system. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Hilz P",
          "Nb_Reviews": 1,
          "Date": "2022-12-24T10:26:38.000Z",
          "Titre": "Power Diary is simply the best around.",
          "Contenu": "I looked at a lot of different products before deciding that Power Diary was the one that interested me most. I was not disappointed. I love the way there is always help available, tutorials to talk you through each step, extra training if you need it. Regular updates, administration templates, and so many more features. The customer service is also fantastic.The system is very easy to use, it is worth allowing yourself time to get familiar with it.I am so glad I chose Power Diary. The best investment  yet, and very affordable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Vicki",
          "Nb_Reviews": 2,
          "Date": "2021-01-29T14:10:03.000Z",
          "Titre": "Revolutionised running my clinic",
          "Contenu": "Revolutionised running my clinic. Great having online diary that I can even access from home.  Clients able to book and pay up front online. Able to email clients receipts in seconds.Option for clients to have reminder emailed and texted 24 hour prior to appointment therefore reduces non-attendance.Planning to start using the notes section so patient records can be stored safely online thereby reducing costs of stationary and space required to store records.There are so many facilities included in Power Diary that I am not even using yet so could do so much more!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Nicole Bourke",
          "Nb_Reviews": 1,
          "Date": "2022-02-28T09:38:53.000Z",
          "Titre": "We've been using Powerdiary for about 2…",
          "Contenu": "We've been using Powerdiary for about 2 years now and I cannot speak highly enough about it, it's intuitive and fast. Recommendations we make are catalogued and if there's enough demand changes are made. Occasionally there are hiccups and they are fixed anywhere from within a few minutes to at most half an hour. If we have questions about how to do something we normally have a reply within 8 hours regardless of the time of day. This is the second booking software we've had and it's far superior to our previous software."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Mind Wise Psychology Services",
          "Nb_Reviews": 1,
          "Date": "2020-06-23T23:28:51.000Z",
          "Titre": "5 Star Programme",
          "Contenu": "Power Dairy works well for our Psychology Business. With the implementation of Telehealth, the Power Diary team has worked wonders not only for us but for our clients as well.  It's definitely been a savior.  Help is always on hand if needed and the PD team are always very helpful in resolving any queries we have.  Very prompt and immediate responses.Well done team."
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "ANTHI CHRISTODOULOU",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T14:28:36.000Z",
          "Titre": "Very helpful website to organize my program…",
          "Contenu": "Very helpful website to organize my physio appointments and my pilates sessions. Additionally making my invoices,  sessions packs and my statements easily."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Sue McIlwee",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T06:58:26.000Z",
          "Titre": "Power Diary is a very easy program to…",
          "Contenu": "Power Diary is a very easy program to use.  It has a wonderful support team and a great \"Help\" area.  Whenever we have had an issue the PD team were onto it straight away and resolved any issues as quickly as they possibly could.  Over the years I have suggested things that might be helpful or useful and the team has always taken the suggestions on board and even implemented some."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Connie",
          "Nb_Reviews": 1,
          "Date": "2021-10-05T10:22:20.000Z",
          "Titre": "Give it a try",
          "Contenu": "I signed up when my practice started to grow. It's helped streamlined a lot of my admin procedures eg client communications, forms and reminders. I like that I can access it on my phone easily if I'm away from office. I think it's worth the dollars saved in time. Telehealth option is also quite easy and effective but basic features in comparison to other paid programs. The only changes I would like to see is that email correspondence eg client reply being stored back into PD and not just in my own email account (for continuous record flow). Texts costs can add up quite easily, unsure why they are so expensive. Also if there was a fax  option that would be handy also."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frances Wyatt",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T16:49:35.000Z",
          "Titre": "Try it out!",
          "Contenu": "This is my first time owning a private practice & I wasn't sure which EHR (electronic health record) system to utilize. I tested out PowerDiary and I loved it! I greatly appreciate the tech support, the ease & function of the system, and how organized everything is. Try it out, you will not regret it!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Selma Yanik",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T09:28:04.000Z",
          "Titre": "Great Clinical Management Software!",
          "Contenu": "I am so glad that I switched from a previous, less effective software, to Powerdiary. Despite not being a software guru, I could get used to many helpful features on PD to reduce the administrative work to the minimum. The Online Booking and Forms Feature are so practical that gives clients the freedom to book and submit information themselves. No more time consuming back and forth emails. Payments and Invoices are done in seconds. The customer support is amazing. I can get help in a very short period and keep learning about more features since PD has much to offer. The free webinars very helpful too if you want to optimise your Private Practice. I am glad that I switched after 2 years Private Practice to PD. I can focus on the direct client work and worry less about administration. Thank You PD :-)"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2022-07-05T13:28:57.000Z",
          "Titre": "Highly recommend",
          "Contenu": "I have been using Power Diary for a few months now and I am so happy with all of it. I was anxious about learning all the new software while running a busy practice but it is so user friendly that it has been much smoother than expected. The support has been quick and very helpful whenever I have a query. I also really appreciate the regular training webinars. Would highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Jodie Hunter",
          "Nb_Reviews": 1,
          "Date": "2023-11-24T02:38:00.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "The customer service team were very prompt with replies and helpful when I had originally purchased the Power Diary booking portal to assist me with things I needed to do to personalise the program to suit the needs of my business and for any further ongoing support that I have needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lesa Montagna",
          "Nb_Reviews": 1,
          "Date": "2022-02-27T01:59:45.000Z",
          "Titre": "Great product and so easy to navigate!",
          "Contenu": "I looked at various software to help me manage my business but I couldn't find one that was within my price range and would translate well with my business. I have a healing and coaching business and wanted something that was easy to navigate but didn't cost a lot since my business is small and growing. Power Diary was perfect for my needs and came at a reasonable rate. It was so easy to navigate that I was able to set everything up within one day and I was ready to go! I highly recommend this program!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Victoria Richardson",
          "Nb_Reviews": 1,
          "Date": "2021-04-29T22:49:10.000Z",
          "Titre": "A System Strategists Review",
          "Contenu": "As a system strategist I get to review and integrate lot of CRM's and project managers but Power Diary is still one of my favourites.  Once I do a handover to a client they seem to be up and running in hours and the common feedback is that 'it just makes sense'.  It's easy to use, there are lots clinical templates or you can setup your custom forms and notes, it is just a really great product!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T07:41:41.000Z",
          "Titre": "Easy to use",
          "Contenu": "Everything is easy to follow and relatively intuitive.  There are plenty of videos and courses to help you become better at using PD when you first start and they even stagger the content so it's not overwhelming."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Carolyn, Psychologist",
          "Nb_Reviews": 1,
          "Date": "2022-04-27T08:34:00.618Z",
          "Titre": "I find PowerDiary invaluable",
          "Contenu": "I find PowerDiary invaluable in planning and managing my solo private practice. Everything is in one place, wherever I am. Processing payments or sending invoices is so easy, clients get reminders which they appreciate, I am able to very quickly view my clients' appointment history which makes writing reports much easier, and I have a program which basically acts as my very competent receptionist. I don't know where I would be without it."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Patrick Carroll",
          "Nb_Reviews": 2,
          "Date": "2021-06-13T19:35:16.000Z",
          "Titre": "12 Months of Top Quality",
          "Contenu": "I have been using Power Diary for over 12 months to run my physiotherapy practice and it is outstanding. I can manage my diary, write patient notes and manage the financial side of things in one place.It is very straightforward to use but the couple of times I have needed help the customer service has been excellent!Power Diary is by far my easiest business expense to justify, it’s top class for doing exactly what I need to."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Dr V Mills, Clinical Psycholog",
          "Nb_Reviews": 1,
          "Date": "2021-01-25T08:46:46.000Z",
          "Titre": "A very satisfied long-term user",
          "Contenu": "Im now a very satisfied long-term user of Power Diary. I’ve been using Power Diary for 3-years and one of the things I’m most impressed by is the way the program is constantly undergoing development. It therefore remains relevant during  the many shifts in practice management. By also being web based, I am always accessing the most up to date program, without interruption or glitches usually involved in updating. This has been really helpful and I have been able to easily add Telehealth sessions and online booking. I’ve also moved to processing medicare via Power Diary which is far easier than using Hicaps machine or Proda. It really does do almost everything I need.  If there were was a way to also process private health claims,  I think it would be perfect."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ally Briggs",
          "Nb_Reviews": 1,
          "Date": "2022-04-11T10:41:31.000Z",
          "Titre": "Power diary is user friendly",
          "Contenu": "Power diary is user friendly, provides a really good diary management tool and allows the use of electronic note taking. The templates are easily to manipulate and adjust to meet the needs of the service and there are loads of templates that come with the software too. There are loads of really great features and the system is easy to use."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Catherine",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T21:16:16.000Z",
          "Titre": "I am finding Power Diary really good to…",
          "Contenu": "I am finding Power Diary really good to use! It can be used for diary keeping and I find that I can find out all I need to know about clients easily! It is great to use! Being able to add forms and keep all information secure in keeping with GDPR! An excellent versatile database with diary  function!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GIVONA SANDIFORD",
          "Nb_Reviews": 6,
          "Date": "2022-02-18T16:29:57.000Z",
          "Titre": "My go to after leaving Simple Practice",
          "Contenu": "My go to after leaving Simple Practice. The pricing is reasonable and based on the number of practitioners which makes it really adorable for solo practitioners. I love the automatic sms appointment confirmation feature which saves me so much time. The report templates are easy. I wish the forms submission process was a little easier but they have videos to walk you through it. Great value!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Robyn Preston",
          "Nb_Reviews": 1,
          "Date": "2022-04-05T13:24:38.000Z",
          "Titre": "Power Diary is one of the best…",
          "Contenu": "Power Diary is one of the best platforms available to assist with running a business. It really is the complete system and easy to use. The features that are included allow you to do everything you need to provide service to clients. I particularly love the auto fill feature of the client form when a client sends it back via the welcome email I have sent out. Such a easy and efficient system that saves me a lot of work. Thank you Power Diary."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "A Bowen Clinic ... and other journeys",
          "Nb_Reviews": 1,
          "Date": "2020-06-26T05:26:10.000Z",
          "Titre": "Power Diary is fantastic!",
          "Contenu": "Power Diary has totally streamlined my record keeping and administration, giving me more time to see more clients.  It does just about everything except the washing up!  The best bit is if I can't figure out how to do something or have a problem, a quick email to the Power Diary Team and they get back to me within a day with a really friendly, supportive and helpful solution, every time."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Bev",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T01:03:41.000Z",
          "Titre": "Power Diary review",
          "Contenu": "I recently took over maangement of Power Diary as a booking system for our contractors. With no prior knowledge or experience I have found it to be incredibly user-friendly and intuitive. That said, there were a few tricky bits I was unsure how to navigate. The support staff, via Chat & a booked video call, could not have been more friendly and helpful and both issues were resolved in a matter of minutes. I would definitely recommend Power Diary as a business managment system. Thanks everyone!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Clarity & Me Occupational Ther",
          "Nb_Reviews": 1,
          "Date": "2022-03-01T23:29:06.000Z",
          "Titre": "Easy to use platform perfect for Allied…",
          "Contenu": "Easy to use platform perfect for Allied Health. So easy to navigate without reading their help menu. A popular platform. Responsive chat and email support as well as Powerdiary Support Facebook group. They are always improving through listening to customers feedback. Happy :)"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Caroline",
          "Nb_Reviews": 2,
          "Date": "2021-09-08T06:50:20.000Z",
          "Titre": "Power Diary is a Game Changer!",
          "Contenu": "We have been using Power Diary for a few years now and it's been a game-changer for our practice.  The thought behind making this work for many different types of workplaces is outstanding, and the functions that it is capable of is brilliant. The PD team are always helpful, courteous and willing to help in any way they can. Their team are always looking at ways to improve PD by listening to their clients and I've personally noticed that so much has been added as they listen to what's needed.  I cannot give enough stars to Power Diary. If you haven't started using them for your practice, sign up immediately.  It'll be a game changer for you too."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Stefanie Hagger",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T05:44:31.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Power Diary has been easy to use and has all the features I need to run my private practice. The support team have been wonderfully helpful from set up to problem solving. I was even able to link my website to the client portal with ease so my clients can manage their existing appointments online. This feature, among other really helpful features, significantly reduces my administration time, particularly when new clients book."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "New Life Counselling & Psychol",
          "Nb_Reviews": 1,
          "Date": "2022-03-10T23:04:03.000Z",
          "Titre": "Slowly implementing the feature rich system.",
          "Contenu": "We started slowly with implementing this product into our business from day 1. It is definitely worth the subscription. It has so many options and It is very intuitive - that cannot be said of other systems I have used.The best feature is it keeps track of MCHP sessions for calendar year when a referral is split across years. Very important to our business.Reminder sms or email is sent to clients to help remind them. This has helped keep clients engaged.The tutorials and help support (which is responsive to our requests) have made the implementation of the software an enjoyable experience.Thank you so much for a useful and valuable tool for our practice."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Peter Sloper",
          "Nb_Reviews": 1,
          "Date": "2021-04-28T03:16:57.000Z",
          "Titre": "Power Diary is easy too use and has…",
          "Contenu": "Power Diary is easy too use and has become an asset whether its booking session for clients or organising the roster for the staff. Invoicing is super easy and billing to Medicare is a breeze. Power Diary is a superior tool than the program we were using before."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Peter Parnes",
          "Nb_Reviews": 2,
          "Date": "2022-04-05T12:34:47.000Z",
          "Titre": "Power Dairy to the rescue!",
          "Contenu": "We have been round the houses searching for an  intuitive and easy to use practice management system that meets our clinical, administrative and financial needs for some time. Power Diary to the rescue. It does what it says on the tin! We love it.Peter ParnesMD & Consultant Clinical & Educational PsychologistPsychology4"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jolanta Siemianowska",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T11:19:15.000Z",
          "Titre": "Can’t imagine my business without PowerDiary!",
          "Contenu": "I have been using PowerDiary for a nearly a year now and I would never swap for any other software to run my business. I can only say from the experience of 1-person business. It saves me so much time and everything is organised in one place! I can’t imagine to run my Pilates studio without PowerDiary! I can customise everything to my own business needs and my clients preferences. Absolutely love it and highly recommending this software to anyone who needs to have automated bookings, invoices, receipts, email reminders, clients notes , online payments and many more to run their own business / studio / clinic. 5*****"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Gayle Cotton",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T17:31:13.000Z",
          "Titre": "We recently changed to Powerdiary from…",
          "Contenu": "We recently changed to Powerdiary from an alternative. From the offset Powerdiary have been amazing! Communications are immediate, no waiting days to get an answer. They had problems with data migration which they persevered with and eventually managed to convert all client notes over which was just brilliant! I couldn’t be happier with this system it’s reduced our admin work by half and is so slick.Thank you 🙏"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Norma Scevoli",
          "Nb_Reviews": 1,
          "Date": "2022-02-25T07:13:57.000Z",
          "Titre": "Highly recommended!",
          "Contenu": "I have been using power diary for about 6 months now and I couldn’t be more satisfied. It’s really simple to use, for both  practitioners and clients, is practical and it is saving me a significant amount of time on admin! Great customer support as well!Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Yeony",
          "Nb_Reviews": 2,
          "Date": "2021-04-01T02:29:19.000Z",
          "Titre": "meeting clients' needs.",
          "Contenu": "What I like the most about PD apart from their excellent practicality is their willingness to listen and strive to improve to meet the customers' needs. I have been picking some features and suggested to PD. They have listened me and reflected the suggestion in the features. It's really nice to see PD is getting better and meet my needs."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Danielle Corbett",
          "Nb_Reviews": 1,
          "Date": "2021-04-26T22:17:03.000Z",
          "Titre": "Best PMS to date",
          "Contenu": "I've used a variety of PMS over the years, and did a LOT of research before starting my own private practice. I love Power Diary for its intuitive nature and its ability to customise to my business. Once set up, it is seamless for both my clinical needs and for the financials/business needs."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Daniel Windridge",
          "Nb_Reviews": 1,
          "Date": "2021-06-21T11:34:24.000Z",
          "Titre": "Can not fault powerdiary,",
          "Contenu": "Can not fault powerdiary,I find it extremely easy to use, they have thought of lots of ways to help mange both clients and clinic. And, they are continuously added additional features. Most definitely recommend. Powerdiary cuts the admin Hassel right down"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Wise Owl Learning",
          "Nb_Reviews": 1,
          "Date": "2022-03-02T20:03:25.000Z",
          "Titre": "Great for my small business",
          "Contenu": "I’ve been using Power Diary since I started my business in 2015. I am a sole trader and so I use PD to store client details, as a calendar and to generate invoices and receipts. However, it’s the reminder texts that have probably saved me the most money and inconvenience."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Toot Toot Occupational Therapy",
          "Nb_Reviews": 2,
          "Date": "2022-04-02T10:45:57.000Z",
          "Titre": "I find the support team very prompt and…",
          "Contenu": "I find the support team very prompt and helpful.I have 2 recommendations for powerdiary1. when a client submits a powerdiary form, they automatically receive a copy for their own records2. on the forms, there should be an option for clients to upload any files to the form"
        }
      ]
    }
  ]
}