{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "primera.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tim Liao",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T10:50:38.000Z",
          "Titre": "I am a small business owner who has…",
          "Contenu": "I am a small business owner who has pretty much felt like he has flushed $3000 down the toilet with my purchase of the LX3000 by Primera. The first few months had all sorts of alignment issues. I finally worked those out and used them sparingly for a year. Maybe 1000 print jobs or less. Now I can't complete a project I need for my little coffee shop cause the prints are coming out of color cause the Printer Head dye cartridge is broken. Tried doing their ghetto procedure of taking out and dabbing it on wet paper towel. Worked for a total of two prints, and then a problem arose again. I should sue Primera in small claims court. These people are Shysters selling a product that is God Awful. I am wasting all the paper and ink printing it with the broken print head and won't get my needed project done before the Holidays. Shame on you Shysters. Watch the video I am posting on YouTube. Search for LX3000 Primera nightmare."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joe Bienaime",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T04:16:37.000Z",
          "Titre": "Our printer has been breaking down…",
          "Contenu": "Our printer has been breaking down quite a bit in the year we’ve owned it. This is the 2nd one we had to swap for another printer because of issues. The new printer should have been sent from Primera to us overnight since we rely on the printer to print the labels to sell our products, but it was sent ground which caused many more days of delay in our business productivity."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Nada",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T04:06:46.000Z",
          "Titre": "We were excited to get our LX3000",
          "Contenu": "We were excited to get our LX3000, it was a big investment for us but we wanted the freedom of making our own labels...Nothing but trouble and disappointment! I've spent hours of my life trying to get this hunk of junk to work consistently. It's caused so much stress, like it knows when we have a deadline. - The printer had to be sent back when we first got it, problem with the printhead.- It has trouble reading the ink cartridges- It got very clogged another time (but we were told to leave it on if not using it often so it cleans itself periodically, noted) I gave them one star because their tech support is actually quite good and responsive, maybe they get a lot of practice. It's possible I got a lemon, I know someone who raves about Primera printers. They would not refund my money or send a new one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lynn Wilken",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T17:30:54.000Z",
          "Titre": "My order was fine but I installed the…",
          "Contenu": "My order was fine but I installed the new printhead and it still did not print. I chatted online and they were not able to fix. He left and said some one would be in touch. I still have not heard back from anyone and my printer is still not working."
        },
        {
          "Note": 1,
          "Lieu": "AW",
          "Pseudo": "Joseph Oduber",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T19:35:55.000Z",
          "Titre": "You canceled the order"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott Oulellette",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T20:28:02.000Z",
          "Titre": "Second time I’ve got a printer back and…",
          "Contenu": "Second time I’ve got a printer back and it doesn’t work. Figured I would buy brand new and that one doesn’t work out of the box. Very very dissatisfied"
        },
        {
          "Note": 1,
          "Lieu": "CR",
          "Pseudo": "amie flesh",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T14:29:26.000Z",
          "Titre": "You sent me the wrong type of paper",
          "Contenu": "You sent me the wrong type of paper, pushing production back, then you had the nerve to ask me to send it back to you, double unconvincing meIt was annoying And 1 of my friends just bought a printer off you per my adviceSo you guys need to check yourself"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Izhar Groner",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T22:30:55.000Z",
          "Titre": "The ink is very expensive and is…",
          "Contenu": "The ink is very expensive and is lasting much less than represented. I already returned two cartridges, but they keep running empty fast and I don't have the time to keep asking for RMAs to send them back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "brad williams",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:17:12.000Z",
          "Titre": "terrible policies",
          "Contenu": "Paid 350 plus shipping twice. We needed an additional flag spring but your policy is that I need to make a new order and pay for additional shipping.  We have 2 machines and I specifically asked 2 of your people for a 50 cent part.  If anybody asks me about a labeler, I will be sure to tell them about your TERRIBLE policies which add unnecessary costs and aggrevation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "EH Distillery",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T22:09:18.000Z",
          "Titre": "Primera is a terrible printer for…",
          "Contenu": "Primera is a terrible printer for companies.  Their over zealous approach to protecting software and proprietary labels make them completely impractical for a team of people trying to make labels.  You can't have one person make labels and one person print them- has to be the same person because Primera is worried someone will use their software with....  not sure why they are worried as if you are using that software you have their printer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mitch Holmes",
          "Nb_Reviews": 3,
          "Date": "2023-08-22T17:43:16.000Z",
          "Titre": "Bad Ink Cartridge",
          "Contenu": "Bad Ink Cartridge!Metallic paper prints didn’t look vibrant!Call tech Support,sending out new ink Cartridge!She was very helpful!Service was good!Product wasn’t what I was use to expecting!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jordan douglas",
          "Nb_Reviews": 2,
          "Date": "2023-04-09T14:14:42.000Z",
          "Titre": "I'm on my 4th machine..thank God I…",
          "Contenu": "I'm on my 4th machine..thank God I bought the extended warranty. The 4th machine came bad out of the box with bad wear strips, just unreal as the lead tech support assured me he talked to your repair supervisor and assured me that this machine was gone over with a fine tooth come.. And yet again I get another piece of crap."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glen Golonka",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T05:45:48.000Z",
          "Titre": "I was so excited to get the date coder…",
          "Contenu": "I was so excited to get the date coder after it was delayed for so long.  When it finally came I couldn’t get any customer support or a supervisor to call me back.  I was told I needed a new ink cartridge and I should receive it in 10 days.  Then I was told to send the machine back and they would fix it under warranty even though I never used it.After several days of trying without success to get capable help I returned the date coder.  The label applicator still works great though and I highly recommend it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nikki Ponewash",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T09:46:56.000Z",
          "Titre": "My question was not answered",
          "Contenu": "My question was not answered. I need the license for a refurbished printer I purchased. It was not provided with the machine. This is costing our business a lot of time and money. Let me clarify. The representative also did not clearly answer my questions. I had to ask multiple times and in multiple ways to get any answers. When purchasing such an item, once the transaction is complete I should be provided the license. I should not have had to call customer service to receive something that is rightfully mine and should have been provided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marco Fields",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T19:25:15.000Z",
          "Titre": "For the love of all that is good DO NOT…",
          "Contenu": "For the love of all that is good DO NOT BUY THIS PRINTER OR WORK WITH THIS COMPANY.  Their LX610 printer is $3,000 piece of GARBAGE! It hasn't worked from day 1.  The software they use is from the 1990's and you may as well be launching the space shuttle then print a simple label.  NO good support videos and to boot, their customer service that they clearly must outsource to India are HORRIBLE!!!!!! NEVER had a good call and ZERO help. PLEASE do not buy ANYTHING from this company.  You will be wasting your money and precious time trying to get help when the printer doesn't work!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2022-12-16T02:55:04.000Z",
          "Titre": "I purchased a LX 3000 printer and asked…",
          "Contenu": "I purchased a LX 3000 printer and asked for assistance on why I couldn’t use the 18 rolls of 2” core rolls.  I questioned why the new printer wouldn’t take then2” rolls and received a smart@ss answer from a chat with someone named Carl.  Great support….. I doubt if I’ll ever buy from you again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "LeAnneOwen .",
          "Nb_Reviews": 4,
          "Date": "2023-02-22T03:16:47.000Z",
          "Titre": "No help making order",
          "Contenu": "No help making order. When I ordered my printer 2 years ago y’all went on and on about how helpful in making purchasesOf labels but not so much"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon Busch",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T21:04:31.000Z",
          "Titre": "We are on our third LX3000 printer and…",
          "Contenu": "We are on our third LX3000 printer and are still unable to get a label printed that is not blurry."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Think Higher",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T03:48:10.000Z",
          "Titre": "Prepare for hell if you get the LX2000.",
          "Contenu": "We purchased the LX2000 a  couple years back. As soon as it arrived we had issues with the machines reliability, consistency and just over all user experience, which was extremely subpar to other sticker and label machines we have ran and operated. We tried to get refunded, but they insisted it was our machine, so we sent it in and received a new one just to find the same cumbersome issues. We tried to get a refund but they insisted it was too late by that time (conveniently for them right?)  We then  sporadically used the LX2000, even with its time consuming printing setup process (print a test, adjust, print a test, adjust, etc). This setup process can take a long time, waste material and is just a straight up pain. Then additionally, with there high print costs. They use HP print cartridges with chips which the printer will only allow one use of, even though you can easily just refill them and not produce the extra plastic, waste or charge. It was a pain but we persisted using it as we had paid over $3000 for the LX2000. Fast forward to present, we had a small issue with a stuck label, no big deal we thought as its happened 100's of times. However this time after removal of the stuck label, we had issues with our upper & lower label sensors. We called tech support, and after discussion determined it was either another stuck label or the sensors. After confirming that no stuck label was present, we called back to find out that the upper and lower sensors are not available for purchase... that instead you have to purchase the whole feeder, a $650 dollar charge before shipping.  After confirming that the individual sensor parts are \"not available\" they insisted the only option was to send it in, and have them perform their duties to fix the sensors, but again at the same time consistently claimed they couldn't send me those exact parts that would be used. When I stated our frustration with the time, money and energy put forth the customer service team just simply dismissed me, not caring that I would NEVER purchase anything Primera every again. Which makes it very clear these guys are just simple scam artist who prey on unknowledgeable consumers. They nickel and dime there consumers at every opportunity. Who in their right mind should have to pay hundreds of dollars to have to send in a bulky machine because a label got stuck? How is that even reasonable? Stay away from this company at all costs. This company will waste your money, time and energy. Go elsewhere and avoid headaches."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "juan jimenez",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T18:49:08.000Z",
          "Titre": "Hi need original software for this",
          "Contenu": "Hi need original software for this When i bought it 3 years agoIt al all the acces to do everything Now it will let me do 1sticker at the timePlease send feed backThanks"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ric Lavallee",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T22:11:54.000Z",
          "Titre": "LX3000",
          "Contenu": "LX3000. Looking for a good compact cost effective printer? I would not be able to recommend the LX3000. We purchased ours in April of 2022. Today on January 29th, 2023 I have been trying to print 200 3.125 x 3.125 BOPP labels for the last four hours. I have less than 20 printed. I have to stand by the machine and press the feed button every 4-labels. I have made several attempts at resets gap sensors and powered unit off/wait/on. To reset gap sensors  labels have to be removed and did as instructed, yet software states labels are still in and at same time states \"out of paper\". Prints 4 spits out 4 and stops.  We have had nothing but problems. Despite attempts from both sides to work out issues, we are still having problems with every label run.  We use their recommended label provider Hickman Labels. We have gone through 4 printer replacements and 9600 labels printed in the 8 months we have owned the LX3000, we still run into consistent issues.1. Gap Sensor issues: Consistently and on every label run we get gap sensor errors. We go through the reset process, loaf and unload, adjust alignment, reset, power off & on, call support and try to resolve. Sometimes successful, other times not. Spits out and skips massive quantities of labels costing money and time.2. Kraft Label Printing: Cannot print kraft labels without spitting out massive quantities of labels and receiving gap sensor errors throughout the print job of under 100 labels. We had to abandon printing kraft labels to accommodate the printer.3. Service: While the folks are nice and may try to help, I am 50/50 here. We run 7-days per week 7am to 7pm. If we have an issue, we cannot get support in Sundays. Some of the interactions do not result in satisfactory resolution, Some do. I have had contact from top tier and did some good work to help us. Lately though not getting response. Consistently spend hours trying to resolve issues resulting in lost time and production. Strung out on several occasions  shutting down production.6. Labels will peel off on rollers and get stuck. May be a Hickman Label problem but the result is no field serviceable capability on the LX3000 to remove a stuck label. Told by support to try using tweezers, otherwise no way to remove stuck label. Requires stopping production and sending unit for repair. I have two of these that are now unable to be used due to the stuck labels.7. Reviews: When I first had issues I was asked to take down negative review. I did this as I thought the replacement printer would work. Not so, three printers later and still having several issues. Was told by support they have hundreds of LX3000's in field with no issues. Nice to have a supplier make you feel like you are incompetent.All in all I would do a lot more research into the LX3000 before deciding on its purchase. I have learned a lot about label printers as a result of my experience I would look for the following as must haves. Good sensors technology. Ability to print the labels you need. Field serviceable label feeds. 7-days per week support."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica Wardrope",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T21:27:59.000Z",
          "Titre": "Paid for over night delivery and it did…",
          "Contenu": "Paid for over night delivery and it did not get delivered over night."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel Brown",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T18:13:13.000Z",
          "Titre": "POOR CUSTOMER SERVICE AND TREATMENT",
          "Contenu": "I HAVE BEEN A CUSTOMER SINCE I BELIEVE AROUND 2005 WHEN I BOUGHT MY FIRST PRINTER LX810? I HAVE HAD IT ALL THESE YEARS AND HAVE ALWAYS BOUGHT ALL MY SUPPLIES FROM YOU EVER SINCE.  I FINALLY WAS LAID TO REST 2 WEEKS AGO AND I CALLED SPOKE WITH SOMEONE AT PRIMERA TO SEE WHICH WOULD FIT ME AND ASK ABOUT THE REFURBISHED AND HOW QUICK I COULD IT GET AS ALL MY PRODUCTION WAS DONE FOR MY BUSINESS WITHOUT THE PRINTER.  SHE SAID THAT THE SALE OF 8% HAD JUST BEGUN ON THE REFURBISHED SO IF I PLACED MY ORDER RIGHT THEN I COULD HAVE IT OVERNIGHTED. SO I PLACED MY ORDER ON LINE FOR A REFURBISHED PRINTER O#1000805418 $2159.91.  ONCE I RECEIVED MY PRINTER I TRIED TO GET IT TO PRINT AND WAS IMMEDIATELY HAVING PROBLEMS.  IT WAS ONLY PRINTING 1/2 THE COLOR THE OTHER HALF WAS EITHER FADED OR NOTHING AT ALL. I CALL ON THE 31ST AND SPOKE WITH TECH SUPPORT.  I THINK I FIRST TRIED GOING THRU THE CHAT BUT THEN CALLED. ANYWHO, THE PERSON I SPOKE WITH ON TECH SUPPORT WALKED ME THRU MY CLEANING, INSERTED, CLEANING ETC ETC.  NOTHING WORKED.  I ALREADY USED THE INK THAT CAME WITH IT AND THEN USED THE ADDL ONE I PURCHASED AT THE SAME TIME AS I THOUGHT MAYBE IT WAS THE INK?? THE TECH SUPPORT GUY SAID HE WOULD HAVE TO OVERNIGHT ME AN INK CARTRIDGE FIRST TO SEE IF IT WAS INFACT THE INK AND IF THAT WAS NOT THE PROBLEM I WOULD HAVE A NEW PRINTER OVERNIGHTED.  WELL INK CAME THE NEXT DAY AND DID NOT WORK SO I CALLED BACK AND SPOKE WITH BRENTLEY WALTERS IN TECH SUPPORT.  I HAVE TO SAY I WAS NOT NICE THE FIRST TIME AND THEN NOW THIS CALL I GOT VERY ANGRY BECAUSE BRENTLY TOLD ME THAT WAS NOT HOW THE PROCESS WORKED AND THAT I WOULD HAVE TO PURCHASE THE $600 2 YEAR EXT WARRANTY IN ORDER TO HAVE A PRINTER SHIPPED OVERNIGHT TO ME OTHERWISE I WOULD HAVE TO SEND IN MY PRINTER FOR REPAIR????!!! KEEP IN MIND THE PRINTER CAME TO MY DOORSTEP DEFECTIVE!!!!!!! I WAS FURIOUS I EXPLAINED THAT MY BUSINESS WAS PRACTICALLY SHUT DOWN BECAUSE OF THIS AND YES I WAS VERY ANGRY.  HE MADE ME GO ON LINE AND PAY FOR THE EXT WARRANT o#1000809777 TO VERBALLY GIVE HIM THE ORDER NUMBER AND MY NEW PRINTER WOULD BE SHIPPED OUT OVERNIGHT.  WELL NEXT COMES AROUND I WAITED ALL DAY UNTIL 5PM AND WENT ONTO PRIMERA TO CHECK THE TRACKING AND GUESS WHAT THE ORDER HAD BEEN CANCELED!!!!!!! NOW I AM VERY VERY ANGRY.  I CALL BACK AND TECH SUPPORT INFORMS ME THAT PRIMERA DOES NOT SELL REFURBISHED PRINTERS ONLY NEW.  I TOLD HIM HE WAS CRAZY AND HE NEEDED TO KNOW THE WEBSITE AND GAVE HIM THE ORDER #.  AGAIN, NOW IM TOLD THAT I WAS NOT ABLE TO PURCHASE AN EXT WARRANTY ON A REFURBISHED AND THAT I WOULD STILL HAVE TO SEND MY PRINTER IN FOR REPAIR.  I WAS VERY VERY HOT.  I TOLD HIM I WANTED TO SPEAK TO A SUPERVISOR AND THEN I WAS SENT TO RICHIE GRIFFITHS.  HE EXPLAINED TO ME AGAIN THAT HE WAS SORRY AND IF I GOT THE PRINTER TO FEDEX AND SENT A PICTURE OF IT AND TRACKING TO HIM I WOULD GET MY PRINTER IN MY HANDS TODAY AS IT WOULD BE OVERNIGHTED!!!!  WELL I SENT PICTURES TO HIM AROUND 10AMEST AND EMAILED AND SAID IT WAS GOING OUT. THOUGHT ALL WAS GOING TO BE GOOD UNTIL WENT ONTO TRACKING WITH FEDEX AND IT SHOWS THAT THE PRINTER WILL NOT BE DELIVERED UNTIL MONDAY!!! I HAVE NEVER NEVER NEVER BEEN MORE DISAPPOINTED WITH THE WAY I HAVE BEEN TREATED AND LACK OF CARE FOR ME AS A SMALL BUSINESS OWNER.  I EVEN TOLD RICHIED YESTERDAY I WOULD RATHER ORDER ONLINE A BRAND NEW ONE YESTERDAY AND PAY THE FEDEX OVERNIGHT TO HAVE IT HEAR TODAY AND RETURN THIS PIECE OF CRAP THAN TO WAIT ANOTHER DAY WITHOUT MY PRINTER.  HE ASSURED ME THAT I WOULD HAVE MY PRINTER TODAY, WHICH AGAIN WAS A LIE.  I WILL NEVER RECOMMEND YOUR COMPANY FOR ANY PRINTERS IN THE FUTURE AS I HAVE ALWAYS GAVE GREAT RECOMMENDATIONS FOR YOUR COMPANY BUT AFTER THIS I WILL NOT."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Vance Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T16:34:10.000Z",
          "Titre": "Very disappoint the printer is delayed…",
          "Contenu": "Very disappoint the printer is delayed by two weeks!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacobo Cotter",
          "Nb_Reviews": 2,
          "Date": "2023-07-06T22:43:36.000Z",
          "Titre": "The products and services is a…",
          "Contenu": "The products and services is a disaster. Nothing works."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "HN",
          "Nb_Reviews": 6,
          "Date": "2022-10-02T23:35:50.000Z",
          "Titre": "We were shipped and charged for a…",
          "Contenu": "We were shipped and charged for a printer we NEVER ordered.  When trying to return it, there is NO record, thus no credit. I have put the charge into dispute. We were also charged for a replacement lx3000 that has been exchanged 8 times due to errors and continual breakdown of several components. We never received that refund once they received the exchanged printer. That is also disputed, for a total of over 4600.00. Next is a BBB claim and any other criminal complaints we can bring against this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Genesis Oropeza",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T17:44:05.000Z",
          "Titre": "the printer was printing in an awful way"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sunil Kumar",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T05:18:19.000Z",
          "Titre": "I purchased the printer LX 3000 top…",
          "Contenu": "I purchased the printer LX 3000 top model. Right from very first day , i had an issue with print quality on my labels. I'm seeing bad white lines on each of my product label. I had contacted the support, they sent me the new print head but the problems still exist. I wish I could return this printer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chad Peters",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T16:41:17.000Z",
          "Titre": "Order would not process on line",
          "Contenu": "Order would not process on line. Waited on hold TWICE to place a sale. Over ten minutes each time. Asked to speak to a rep on the third call transferred to voice mail. When someone is trying to buy, get the cleaning lady to take the order if you have to. Don't make the customer jump through hoops."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cornelius Glancey",
          "Nb_Reviews": 1,
          "Date": "2022-07-29T16:49:39.000Z",
          "Titre": "I called twice about a faulty ink",
          "Contenu": "I called twice about a faulty ink. Both times the phone service was friendly and they promised to send me a replacement. Both times they sent an email that contidicted everything that was stated over the phone. What was supposed to take a few days took 3 weeks 3 phone calls and a new order to get the ink I needed. Overall experience was not satisfactory and still have not received my new replacement which was promised to be overnighted weeks ago."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry - reseller",
          "Nb_Reviews": 1,
          "Date": "2022-04-14T17:11:46.000Z",
          "Titre": "They lost our order. Never shipped. No contact from Primera.",
          "Contenu": "We placed an order. They told us they received the order and would contact us if they needed anything else. We heard nothing back. Six days later we still don't have tracking so we call again and are told they never processed the order. Our contact info was on our PO as well as our email but they never even attempted to contact us. Turns out they lost our credit card number so they never finalized the order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2022-04-08T14:53:56.000Z",
          "Titre": "Did a swap a couple months ago with my…",
          "Contenu": "Did a swap a couple months ago with my over 10 years CX1200 and received two bad cartridges, after dealing with almost 6 months of problems decided to buy the cartridge's myself since customer services don't care about a bad unit I still have warranty on....To bad Primera took this phat I always had Primera as a great partner to work with."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tucker Noyes",
          "Nb_Reviews": 2,
          "Date": "2022-04-10T11:15:16.000Z",
          "Titre": "We constantly have to send our printer…",
          "Contenu": "We constantly have to send our printer back due to labels becoming stuck. We have been offered no reason why this keeps happening, other than the labels are too small, despite the labels being within the advertised capabilities of the printer, and is purchasing the more expensive label stock from Primera.  It has cost us a great deal of money in operational downtime as we have to stop production of our product while we wait for the printer to be fixed and returned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Hubbard",
          "Nb_Reviews": 1,
          "Date": "2022-03-04T21:11:03.000Z",
          "Titre": "The Primera support team doesn't care…",
          "Contenu": "The Primera support team doesn't care about helping me in using their software (ptcreatepro) or their printer (LX610).  When one support rep says they can't help and will transfer me to someone who can, they just transfer me back into the tech support queue where I have to start all over.I regret investing in a Primera printer since they clearly don't care about their customers post-purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "stephen ortiz",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T19:29:32.000Z",
          "Titre": "The process of creating a custom label…",
          "Contenu": "The process of creating a custom label was painful. I am still concerned I will be receiving the wrong product after 100 emails and calls. I ordered a full Primera system, printer, applicator and labels even though I've seen many negative comments about the hardware and customer support..I am hopeful, but mostly concerned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jenny Peni",
          "Nb_Reviews": 2,
          "Date": "2022-04-24T20:05:55.567Z",
          "Titre": "I don’t recommend",
          "Contenu": "I’ve had problems with my printer from the very beginning. The tech peeps try to be helpful, but I think I have a lemon. The color never prints true to scale. I kept going back and forth with my artist trying to get it right and because my printer crapped out I outsourced labels. The color printed bright and true to scale… I didn’t need to adjust my artwork at all. It’s my printer. I’m very frustrated with it and Primera kept elevating my case to a “higher up” who never followed up. I give up and now I’m stuck with an expensive mistake."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nick Cioffi",
          "Nb_Reviews": 2,
          "Date": "2022-10-05T23:05:04.000Z",
          "Titre": "Spend 1500.00 on a labeling machine",
          "Contenu": "Spend 1500.00 on a labeling machine, it breaks before hitting the first service requirement, and you make me pay 400.00 to repair it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bill Gates",
          "Nb_Reviews": 1,
          "Date": "2022-04-16T22:54:03.000Z",
          "Titre": "Poor return policy",
          "Contenu": "Poor return policy . Sent me a defective device and then the customer has to pay an extra deposit for another machine until the defective device was returned. Then primera wants you to drop what ever your doing just to return the device . Good machines horrible customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2022-08-31T01:55:06.000Z",
          "Titre": "I have never worked with aprinter that…",
          "Contenu": "I have never worked with aprinter that needs constant care .New print heads don't work your new software is inconstant. if i could work with another printer i would"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Adel Almalki",
          "Nb_Reviews": 1,
          "Date": "2021-10-20T21:10:50.000Z",
          "Titre": "Poor customer service",
          "Contenu": "Poor customer serviceUpdate : You have control over the  email you send  to me, you can tell me about your master distributor in Germany, or you can tell me that you need more info to processe my order , in fact you said my order is declined and if i want my order to be approved you need more info, So you are expecting and  asking me not to go on with my order and i did, Thanks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Romeu",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T23:03:09.000Z",
          "Titre": "Ink Smears",
          "Contenu": "I spent $4000 on this printer in December. I have called twice to complain about ink smudging all over the place and the only options I was given was to send in printer (my business can't be without labels for 10 days) or spend more money on parts. at this point I've had to spend money on graphic designer to print labels for me while my hands are full of ink. The exact problem I was trying to alleviate when I bought the printer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Appalachian Gap Distillery",
          "Nb_Reviews": 2,
          "Date": "2021-09-28T17:01:49.000Z",
          "Titre": "Ordering through the website is kind of…",
          "Contenu": "Ordering through the website is kind of horrendous, with things regularly broken, incorrect info, etc. We had a custom die made for labels a couple of years back. I tried to reorder, and they claimed they didn't have stock, then tried to charge me for the die again, and on and on. It took weeks to get it right. Sloppy, slow service.Can you tell I'm irritated?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "yourdigitalconnection1444567278972",
          "Nb_Reviews": 2,
          "Date": "2021-12-21T22:27:27.000Z",
          "Titre": "Where do want me to start.",
          "Contenu": "Where do you want me to start.. my printers error out frequently,  rather it's a gap sincing error or just an equipment stall error. I have had the printers fixed and replaced by primera several times. It seems like everything they do does NOT fix the issue. I dont know if its just the model lx600 that I have or if all there printers they sell do this. They are JUNK!!My $39.99 hewlit Packard works way better   unfortintily it doesn't print labels.... I feel completely ripped off by primera......."
        },
        {
          "Note": 1,
          "Lieu": "HN",
          "Pseudo": "Monica",
          "Nb_Reviews": 1,
          "Date": "2021-09-15T16:38:51.000Z",
          "Titre": "Very rude & disrespectful customer…",
          "Contenu": "Very rude & disrespectful customer service. One of the associates was being rude to me because of where I lived.Updated: First if all my conversation with the associate was in English- there was nothing lost in translation.  Not at all how the conversation with the associate went- like I mentioned the printers final destination was Miami. She never even mentioned concern about “Fraud”.  However, I appreciate you reaching out to me immediately. I wont be making the purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOE Ginet",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T21:46:15.000Z",
          "Titre": "Your web site is very bad!!",
          "Contenu": "Your web site is very bad!!Not sure if i ordered what I want or not!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick F",
          "Nb_Reviews": 4,
          "Date": "2021-08-06T14:59:18.000Z",
          "Titre": "The material that the 073326 5x4 labels…",
          "Contenu": "The material that the 073326 5x4 labels seems to have been changed. We cut these in 3s and they curl up. This had not been the case until the last few months. This makes the product hard to work with and adds labor. I hope someone will actually follow through with follow. Still waiting on LX610 machine issues."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ernest Clamar",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T21:34:52.000Z",
          "Titre": "VERY DISSAPOINTED",
          "Contenu": "I Ordered ink for my primera 400 the customer service said it only came in a pack of 4,  I ordered the 4, I received a box of 4 different colors not what i ordered.I also asked for help with alignment of my printed page,  I gave my email address including Sr. this separates me from my son well they dropped the SRproving they did not listen what a disappointment to me.I was going to order a larger primera  printer but this experience made me look elseware.EJCLAMARSR"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jahn Coppey",
          "Nb_Reviews": 2,
          "Date": "2022-02-02T10:41:04.000Z",
          "Titre": "That was a terrible chat on my last…",
          "Contenu": "That was a terrible chat on my last order. I placed a re-order online and noticed that sales tax was still showing up on my order even though I was notified earlier that my application for exemption of sales tax was approved. Karen on chat had me place the order so I would know the order number. I told her that I wanted the sales tax removed but she answered that they don't refund the sales tax. I then asked her immediately to cancel my order and wanted no automatic sales tax removed on my next order.  She was rude and told me that it was too late to cancel and that I could not order online any more."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Wang",
          "Nb_Reviews": 4,
          "Date": "2020-03-10T22:47:28.000Z",
          "Titre": "CX1200 toner cartridges had support…",
          "Contenu": "CX1200 toner cartridges had support plastic support stick broken issues and the problems were so many.    Sometimes we need to URGENT reorder via overnight shipping with our high fee when we opened box and suddenly found defective one.   That's really make troubles for us over our production lines.We have gotten total 17 broken cartridges since last October.   I am going to claim RMA soon."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Atef Halaka",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T13:08:48.000Z",
          "Titre": "Everything was EXCELLENT until I tired…",
          "Contenu": "Everything was EXCELLENT until I tired to order online. Their website ordering system is the worst I have ever seen.  Their technical assistant on \"chat with us\", told me the solution is for \"me\" to use a different \"browser\". If Google Chrome is the wrong browser then why are you in business?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patrick F",
          "Nb_Reviews": 4,
          "Date": "2021-07-28T16:07:43.000Z",
          "Titre": "If you purchase a LX 610 be prepared…",
          "Contenu": "If you purchase a LX 610 be prepared for lots of down time.  This printer has frequent carrier stalls that require emptying the print que and shutting down the printer each time.  Support is limited to a FAQ sheet with several steps that could be the problem.  Be Tech Savvy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RICARDO AGUILERA",
          "Nb_Reviews": 1,
          "Date": "2020-03-17T21:47:04.000Z",
          "Titre": "Received a defective toner cartridge…",
          "Contenu": "Received a defective toner cartridge for my CX1200 - 3/10. Called in and was told I would receive and email with the RMA Label. On 3/12 I called in to see what the holdup was and finally got the email with RMA. Had to order a new Toner Cartridge.  FedEx didn't pick up until 3/13. Here we are 3/17 and still have not received the replacement.Very Upset."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rebecca D.",
          "Nb_Reviews": 2,
          "Date": "2021-07-14T20:02:13.000Z",
          "Titre": "I have had consistently poor customer…",
          "Contenu": "I have had consistently poor customer service from this company. They have dropped my order, they have failed to explain payment conditions, and every person i have spoke with has had poor personal tact and never takes ownership of their mistakes. i had previously rated this company better after a decent customer experience where they corrected an error, but now that i have been forced to continue working with this company due to their products not being in local stores, i have found that that positive experience was an anomaly and i should come to expect poor experiences."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "benjamin blate",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T20:49:03.000Z",
          "Titre": "I bought the lx500 easy to use but this…",
          "Contenu": "I bought the lx500 easy to use but this 610 is like one after taxes n shipping almost cost me 3000$ then the software isn't even available for Mac then u charge me 150$ for the software now it can take up to a day to generate me a simple simple code??????? Will never purchase a primera product again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mel",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T14:26:01.000Z",
          "Titre": "We've had nothing but issues since day…",
          "Contenu": "We've had nothing but issues since day 1. The printer always has an issue finding the next label and feeds the roll in and out. It finally peeled up a label and jammed. We are in the Holiday crunch and the service department is not responding. We now have to run a $2000 rush order with a pro printer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ted",
          "Nb_Reviews": 5,
          "Date": "2019-12-10T23:18:26.000Z",
          "Titre": "Not a happy camper!",
          "Contenu": "My Bravo Pro duplicator wouldn't turn on.  I shipped it to Primera and paid the whopping flat repair fee of $450 plus return shipping.  What I got back was a machine that would turn on, but now the robot arm would move horizontally, only one DVD drive was recognized and the lid switch was not connected so the software thought the lid was up all the time and wouldn't duplicate anything.  Nice job, Primera!  They had me ship it back (at their cost this time) and now I'm waiting to see what else they screwed up."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T20:37:46.000Z",
          "Titre": "Worst experience ever",
          "Contenu": "Worst experience ever. Do not use this company. They will tell you whatever they think you want to hear to buy their product but afterward are rude and talk down to you as if you should know how to use the printer. Returned and went with another company. Save your time, patient and frustration and use a better company!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Randy Borresen",
          "Nb_Reviews": 1,
          "Date": "2020-11-02T16:41:54.000Z",
          "Titre": "The dumbest humans I have ever…",
          "Contenu": "The dumbest humans I have ever experienced in my life. 30 minutes to order a print head and some inkjets for my 4051. I am 68 years old and these morons you have working for you could never hold a job in the 20th century. Back then you had to be good at something!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michele Bickford",
          "Nb_Reviews": 1,
          "Date": "2022-10-24T00:58:22.000Z",
          "Titre": "My issue is still not resolved nor have…",
          "Contenu": "My issue is still not resolved nor have I gotten notified if it will be fixed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Corey Cole",
          "Nb_Reviews": 2,
          "Date": "2022-08-02T17:40:15.000Z",
          "Titre": "LX610- Not for custom cosmetic labels.",
          "Contenu": "I was asked to remove my review to give them a chance to make things right. I did that and they did not do well. I'm sure this is great for some people. But what they don't tell you is that you have to spend more money on a laminate process to have waterproof cosmetic labels. But even then, the laminate only comes in specific size formats. If you need custom sizes they send you to a third party to have a custom set made, which increases the cost even more. They have a clear label, but they will not send a sample to test. They expect you to spend the $255 on the full 2 rolls. This is a giant paper weight for us and can not be used. Also, they refuse to take it back even though there is nothing wrong with the machine. We were just sold wrongly on how it would benefit us. We will not be doing business with Primera Tech in the future. Make sure you ask EVERY question you need and then some before purchasing the LX610."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Thomas Hambrecht",
          "Nb_Reviews": 1,
          "Date": "2022-03-27T12:52:02.000Z",
          "Titre": "The products are very good",
          "Contenu": "The products are very good. But the ordering process is a disaster. During the ordering process (Germany) only Amazon Pay was offered and it took us 15 minutes to process the order via PayPal."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve Turner",
          "Nb_Reviews": 1,
          "Date": "2020-12-17T03:16:37.000Z",
          "Titre": "I ran about 100 labels through my…",
          "Contenu": "I ran about 100 labels through my printer and 2 of the labels got stuck in the printer, making the printer useless. Only after calling tech support did I learn that my printer would have to be mailed back to the company for repair. After 100 labels!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-31T13:45:39.000Z",
          "Titre": "Took about two weeks to actually place…",
          "Contenu": "Took about two weeks to actually place the order.  Every customer service person I spoke to had a different answer for the same questions.  Seemed they only wanted to get off the phone.  People are not trained well and very inconsistent.  Info given was consistently wrong."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Purchasing Dept.",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T21:57:30.000Z",
          "Titre": "poor customer service",
          "Contenu": "Customer service dropped the ball with entering my order. I am on automatic cc payment so as not to delay my shipment yet I find out today they did not ship because they could not find payment information which is never an issue 9 out of 10 times."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayla",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T20:28:56.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Terrible experience.  Not knowledgeable about their products at all. They sold us printers claiming they could do things that they could not.  Also led us in the wrong direction about labels and when timing marks were and were not needed.  I would not recommend working with Primera to anyone."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "WineMaker",
          "Nb_Reviews": 1,
          "Date": "2020-12-13T22:28:57.000Z",
          "Titre": "I ordered PTcreate PRO and my order is…",
          "Contenu": "I ordered PTcreate PRO and my order is on hold.  I don't understand why that is not automatic like all software purchases.  Why do I need to wait until someone from the company gets to work before I can my authorization key for the software?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-07T02:10:00.000Z",
          "Titre": "Poor print quality",
          "Contenu": "Poor print quality, prints grey not black upon receiving email from primera, kindly stated its not the printer for us... maybe we needed a step up. 2 days later,  no one has contacted me but I keep receiving automated emails about wonderful customer service 🤣"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Eduardo Ariel Pragier Korenman",
          "Nb_Reviews": 2,
          "Date": "2021-06-09T11:03:28.000Z",
          "Titre": "Sales representative disappear for…",
          "Contenu": "Sales representative disappear for weeks after negotiating P.O. New sales rep did not honor previouly agreed discount, promised to sent quotation in 1 hour, I gave up after one full day and order from website the next day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon",
          "Nb_Reviews": 1,
          "Date": "2018-06-07T16:29:13.000Z",
          "Titre": "Unit was back ordered and I was never notified",
          "Contenu": "Said they had refurbished units in stock that would ship in 3-5 days. Received no further communication. When I followed up over a week later, it was back ordered with no ETA. How no one contacted me to let me know they didn't have the unit in stock is beyond me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phil Schneider",
          "Nb_Reviews": 2,
          "Date": "2020-01-21T19:16:45.000Z",
          "Titre": "You computer system",
          "Contenu": "You computer systemWas not functioning properly and it delayed my order but the people who helped me were friendly. It’s just that you seem to require on line ordering for custom labels and when your website is down this www frustrating"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ana Hernandez",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T03:22:12.000Z",
          "Titre": "It didn’t work",
          "Contenu": "It never worked, we called customer service about 5x and we also called the place where we bought it from and nobody was able to help us. We bought every app that we were told Buy and nothing worked. Very upset about this product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "San Antonio",
          "Nb_Reviews": 2,
          "Date": "2022-07-07T20:26:42.000Z",
          "Titre": "I purchased the LX610 and have had…",
          "Contenu": "I purchased the LX610 and have had issues from the beginning.  I was using a Mac and was told by a tech support person that this printer works better with a PC and that is the only way to clean the cutter appropriately.  After the 1st printer I received had to be sent back and replaced I have had to call numerous times.  My colors do not print true to what is on screen and I was told they could not help me.  I recently to sent the printer back for a stuck label and was told I had to pay for shipping and $350 service charge.  It has been slightly over a year and I complained so they waived the service fee (thanks), however when I told them I was a business and needed the printer asap I was told they were doing me a favor and they would not expedite my ticket!  Stick with an expensive piece of crap printer.  Was also told there were no issues with this printer however looking into the reviews that is a lie!  It does not have good reviews and there are issues!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lewis Eaton",
          "Nb_Reviews": 1,
          "Date": "2018-07-14T01:34:31.000Z",
          "Titre": "I am still waiting for my printer",
          "Contenu": "I am still waiting for my printer.  I received a faulty one, lost sales in the interim and have yet to see a tracking number.  Three hours with customer service, while they were nice, nothing was accomplished.  $3300 for nothing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul Newsham",
          "Nb_Reviews": 1,
          "Date": "2018-08-24T18:45:26.000Z",
          "Titre": "I had to pay for parts for a unit that…",
          "Contenu": "I had to pay for parts for a unit that us under warranty.  After 40 minutes on the phone, I found out that the part was $4.99.  Complete waste of my time.  And now your follow up is some email?????  You've lost a customer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 3,
          "Date": "2020-02-26T22:25:14.000Z",
          "Titre": "We have more problems with our Primera…",
          "Contenu": "We have more problems with our Primera Printer than every other piece of equipment in our shop combined. Solutions usually involved changing half-full cartridges or replacing print heads that are still at 70%"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Claire",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T20:39:08.000Z",
          "Titre": "I cannot check out of the website for…",
          "Contenu": "I cannot check out of the website for the last 4 months now. There is a glitch in the shopping cart page. I have had to call and place an order by phone for 4 months and it is very inconvenient. Please fix immediately."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brice Porter",
          "Nb_Reviews": 1,
          "Date": "2021-10-22T21:47:52.000Z",
          "Titre": "Terrible experience",
          "Contenu": "I placed an order for parts for my printer and ordered it with two day shipping. There website claims if you place the order after 2pm it will ship the next business day. After 5 days and four different conversations with their employees they tell me it has finally shipped. After complaining about this they tell me I can go ask fed ex about the problem. I heard the fed ex tracking number is wrong, the item is on back order, and go ask fed ex why it was late from this company. After all of that no one offers a refund on shipping, or partial discount, no apologies or anything. Terrible company, horrible customer service, and my company will never use them again for our products. Buy at your own risk because if you ever have a part break you will be out of service for a while and their customer service is horrible."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2019-12-19T19:00:19.000Z",
          "Titre": "I waited two weeks to get the…",
          "Contenu": "I waited two weeks to get the replacement ink cartridges.One of the cartridges, Cyan s3601 was bad, I replaced it with the second cartridge, it works. How do I get a replacement for the bad cartridge?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Iron Mountain",
          "Nb_Reviews": 1,
          "Date": "2020-06-12T11:44:59.000Z",
          "Titre": "I had made RMA/warranty service…",
          "Contenu": "I had made RMA/warranty service request. Sent my printer for repair and get the printer back without anyone even opening the box. The printer was not repaired. No explanation from Tech department."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dr Ron Caskey",
          "Nb_Reviews": 3,
          "Date": "2018-10-26T14:47:22.000Z",
          "Titre": "I call in and get a live \"Tech\"",
          "Contenu": "I call in and get a live \"Tech\". I said \"I have a new black cartridge in my Bravo Pro. Yesterday it showed 98%. After running 10 CD's it shows empty\". His SOLUTION? Replace the NEW cartridge with another NEW cartridge. That should keep you guys in the cartridge business! The next day the machine totally quit communicating with my computer. I sent a chat after hours on Friday explaining my situation. Your chat box came back \"we are closed but some one will call you on Monday morning\". Well this is Friday of that same week. No call! Machine is totally dead. In the meantime, sure enough I ordered new ink, black and colored. Thanx for your spectacular 'tech support' for a non-working machine!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2018-08-24T00:12:58.000Z",
          "Titre": "I am very disappointed",
          "Contenu": "I am very disappointed.  We purchased a2 generation upgrade expecting a significant productivity and connectivity improvement.  Did not happen.  Tech support has been mediocre.  Must be our fault."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jeremiah",
          "Nb_Reviews": 3,
          "Date": "2018-08-25T03:08:34.000Z",
          "Titre": "Ink purchased directly from Primera and…",
          "Contenu": "Ink purchased directly from Primera and labeled for our printer threw \"Incompatible Ink Installed\" error. All the issues until now have been annoying, this one is costing us revenue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gary Robinson",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T01:07:25.000Z",
          "Titre": "Terrible product and customer service",
          "Contenu": "I bought this Impressa IP60 4 months ago and it kept saying it was a backorder. I canceled the order after a month and 3 months later I found the machine on my porch. I found the machine doesn't work and the customer service seem to act like they have no concern for the product. After getting the machine the paper will not go through the roller, I spent an hour with customer service and they couldn't fix it. I tried to return it and I was told you had to hold $1000 for me to return it. And I had to go through a process for approval to get my money back. Now my question is why do I need to get approval for a product that doesn't work? So, now it's going on for 5 months without a machine. And they say they're the number 1 company with these machines and have great customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mel BG",
          "Nb_Reviews": 1,
          "Date": "2019-05-30T04:25:24.000Z",
          "Titre": "If you are looking to print high…",
          "Contenu": "If you are looking to print high quality, water resistant labels this is not the machine for you. The quality of the labels pale in comparison to outsourcing to professional printers. YOU WILL NOT SAVE MONEY BY USING THIS FOR YOUR IN-HOUSE PRINT NEEDS. We thought this would be our savior but it wound up costing us an arm and a leg and a few wholesale accounts. You will burn through tons of bad test labels every time you run a job, even more if you are switching out label sizes often. Beware of the labels and ink you buy, Primera will knowingly sell you ink and labels that are not compatible. We’ve tried combos of the dye and the pigment with glossy paper labels & extreme tuff matte labels and they all had issues with either smearing, discoloration over time, and over dullness in print quality."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon Goodman",
          "Nb_Reviews": 1,
          "Date": "2021-07-04T08:46:16.000Z",
          "Titre": "Just rubbish avoid",
          "Contenu": "We have low use of a label printer (max 50 prints a week) and the recommended lite software is beyond dire . Crashes more than it works , just rubbish"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 3,
          "Date": "2020-02-27T22:08:14.000Z",
          "Titre": "I have been a customer of Primera for…",
          "Contenu": "I have been a customer of Primera for many years and recently I was told that Primera will stop supplies for the fx and cx 1200, so know what? Very disappointed...."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Barbara  Wilson",
          "Nb_Reviews": 2,
          "Date": "2022-02-16T20:51:27.000Z",
          "Titre": "I ordered the Primera LX2000 ink when I…",
          "Contenu": "I ordered the Primera LX2000 ink when I asked to process payment with Amazon it switched to the wrong ink while processing payment."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T19:35:41.000Z",
          "Titre": "Product did not perform as sold",
          "Contenu": "Product did not perform as sold. After numerous hours working with salesperson and tech support we were told there was nothing more they could do to assist."
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "abdulla binghalaita",
          "Nb_Reviews": 1,
          "Date": "2020-10-06T07:28:58.000Z",
          "Titre": "This is the most unfriendly website I…",
          "Contenu": "This is the most unfriendly website I love design I think you should have a look and re-launch your website and please disable go to language Transfer"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Emily Perez",
          "Nb_Reviews": 2,
          "Date": "2020-01-19T20:05:48.000Z",
          "Titre": "problems with product",
          "Contenu": "It didn’t give me any information on why my printer is printing lines in my photos. I’m terribly disappointed in service. It’s harming my photo business."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nichelle Cruz",
          "Nb_Reviews": 1,
          "Date": "2020-05-21T22:22:05.000Z",
          "Titre": "DO NOT BUY",
          "Contenu": "absolutely insane that only these rolls work for the printer. makes you spend a ridiculous amount of money on labels and blades causing so much waste."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Deb",
          "Nb_Reviews": 1,
          "Date": "2018-04-11T17:13:38.000Z",
          "Titre": "The person I was talking with was good",
          "Contenu": "The person I was talking with was good, but gave me wrong advise that cost me 79.00!  They need to be more knowledgeable to avoid giving the wrong solution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rachel Utecht",
          "Nb_Reviews": 1,
          "Date": "2018-08-25T03:28:21.000Z",
          "Titre": "What a joke. Everything from the printer programming to labels to the ink.",
          "Contenu": "This is life with a Primera label printer:Step 1. load label roll. -3 labels for the glue on the roll itself. -1 more once it loads. Step 2. Load ink cartridge. -1 to -2 labels every time you do this as the printer is programmed to spit out a blank label when the cartridge is changed. If you fail to use your printer every 3 days, the ink cartridge dries out. You must then manually rehydrate it as per their support team's directions. Again losing 2 to 3 labels to get this to work properly again. Once the ink gets down to 30-40% it frequently just stops working entirely & when it's at 0% it's often just a programming scam to get you to order more ink because it'll print another 30-50 labels in full color, but not when it's at 50% apparently. Absolutely terrible, pull your hair out trouble shooting every time you use it. Should've bought the other brand, deeply regretting it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-11T15:28:14.000Z",
          "Titre": "The inability to work with a MacBook…",
          "Contenu": "The inability to work with a MacBook Pro, require a USB adapter and according to your own support the lx500 can’t work with an adapter is ridiculous."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Berger",
          "Nb_Reviews": 3,
          "Date": "2020-12-20T18:51:18.000Z",
          "Titre": "Doesn't print from Adobe nor Corel files anymore",
          "Contenu": "I have a Primera LX2000 printers and after initial problems and having to have it sent back and replaced, things worked well for a few months.  We use current versions of Adobe Illustrator and Corel Draw, and had been printing from them all along. Now we can't print from either, and tech support can't get it working and say its Adobe and Corel problems. say we need to use Bartender software work around. Hmmm worked for months. We have tremendous numbers of files that have been designed for this printer, and a small fortune in labels. They won't fix the issue! So upset about cavalier attitude of their tech support since we purchased these. Do your self a favor and look at the Epson comparable. Work's with the main graphic software's, faster and more affordable consumables. Don't risk your business future on a company that does not support its customers and it's current products! Happy to discuss with anyone considering this printer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Yates",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T01:15:03.000Z",
          "Titre": "I have not received the product"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rich",
          "Nb_Reviews": 3,
          "Date": "2018-03-02T21:17:37.000Z",
          "Titre": "Ink cost is insane do not buy.",
          "Contenu": "Love the printer what I don't like is the fact they relable hp ink cartridges and then chip them to make massive profits on the printer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Operations Mgr",
          "Nb_Reviews": 1,
          "Date": "2018-11-20T17:21:14.000Z",
          "Titre": "We were billed 3 times for the same…",
          "Contenu": "We were billed 3 times for the same order  we have called to to resolve and awaiting for a call back - please call us ASAP - 727.729.2715"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "A.E.",
          "Nb_Reviews": 1,
          "Date": "2020-03-24T01:31:43.000Z",
          "Titre": "LX400 color label printer",
          "Contenu": "We own the LX400 color label printer.  It was sold to us as being good for product labels.  That was not accurate - the ink smears if it even remotely touches any form of water or condensation.  If you are running different labels at different times, it constantly advances a label so that you are wasting so many labels instead of it printing on the first available label. The software for designing the labels is not user friendly or intuitive either.  I do not recommend this product.  I've expressed these concerns to Primera and they have offered an upgrade that of course, we would pay for.  I'm not willing to spend more money and not have my problems solved.  No reimbursement has been offered for the wasted labels.Thank you for your response.  We order BOPP labels and I turn down the ink saturation.  Both of those options have been provided over the phone and I currently do both - not with the success I had hoped.  When this machine was demo-ed for us, it had beautiful multi-color labels, not barcodes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mai Liao",
          "Nb_Reviews": 1,
          "Date": "2022-09-06T19:55:53.000Z",
          "Titre": "I have replaced the printer 3 times and…",
          "Contenu": "I have replaced the printer 3 times and none of them work functionally"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ERWAN JESTIN",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T09:59:41.000Z",
          "Titre": "DHL subcontracted the delivery to colis…",
          "Contenu": "DHL subcontracted the delivery to colis prive. The driver did not show up and dropped the parcel 20 miles away from us. Our complains were dismissed. This does not happen with other services like UPS or Fedex."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jerralyn Cox",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T22:38:20.000Z",
          "Titre": "The Primera Support is horrible",
          "Contenu": "The Primera Support is horrible.  They continue to give me fixes for my LX500c Color Label Printer and nothing works.  I continue to have to unclog the thing, wasting labels and \"ink\".  And I still can't get a correct picture."
        },
        {
          "Note": 2,
          "Lieu": "VE",
          "Pseudo": "Adrian Jose Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T17:41:01.000Z",
          "Titre": "The last two purchases was wrong by the…",
          "Contenu": "The last two purchases was wrong by the support team"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cynthia Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-06-12T23:55:47.000Z",
          "Titre": "Missing parts",
          "Contenu": "I ordered a printer and it was missing a part , I was told it would arrive in the next 3 days because I had an event  , 15 days later I had to follow up cause I never got my part . When I spoke w customer service again they said they were going to send it out since the first time they were having issues  and should arrive in the next couple of days , same story from the first time , We will see how it goes ."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Judy Bulcroft",
          "Nb_Reviews": 4,
          "Date": "2023-07-16T18:54:53.000Z",
          "Titre": "I have had error codes at pointing…",
          "Contenu": "I have had error codes at pointing toward defective replacement ink cartridges. Replaced by Primera. I asked the technician in my chat, why the cartridges were repeatedly defective. My concern is the possibility that the problem may also involve my printer's operation. I was directed to receive another replacement, and if the problem continued perhaps the printer itself could be diagnosed via the chat. Its great that the replacements are provided, but if the same issues persist, at what point does the technician get involved with investigating another cause?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stacey M",
          "Nb_Reviews": 3,
          "Date": "2022-11-01T18:53:47.000Z",
          "Titre": "Long delays between messages",
          "Contenu": "Long delays between messages - never responded during remote request to reboot. Finally gave up and rebooted without instructions for reconnect. In general, unhappy with the glitchy nature of the LX610 and wish I could return it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Mullenax",
          "Nb_Reviews": 1,
          "Date": "2023-01-11T04:32:56.000Z",
          "Titre": "Ink cartridge are poor quality",
          "Contenu": "Still have not gotten my replacement ink cartridge and keep having problems with the cartridges not performing correctly.  That’s right they don’t work all the time."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2023-01-14T17:58:13.000Z",
          "Titre": "This printer cost thousands of dollars…",
          "Contenu": "This printer cost thousands of dollars and is used very little, yet it seems to break down annually costing alot more money. This time $700!I wonder what is next?It hasn't stopped breaking down since we bought it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Pat",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T00:10:51.000Z",
          "Titre": "Shipping was VERY expensive",
          "Contenu": "Shipping was VERY expensive, and more that it needed to be. $14 to ship a 3 oz package FedEx, when you could have shipped it US First Class, with tracking, for just over $4.00"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ted Tacker",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T20:07:41.000Z",
          "Titre": "I am attempting to reorder a custom…",
          "Contenu": "I am attempting to reorder a custom product and getting no help with this sent an email on the 15th and got no response"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Janice Garvin",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T16:52:39.000Z",
          "Titre": "Disappointed-lots of down time",
          "Contenu": "This unit prints beautiful labels when it works. We have had so many issues with the machine and now parts are just falling off. We have spent more time with support on this model than should be necessary. Bad ink heads sent back multiple times. Very disappointed  with this model and it came highly recommended and we waited over 6 months to get it. Now parts are just falling out of the print head area. We have had so much costly down time. Unit should be replaced."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Allen",
          "Nb_Reviews": 2,
          "Date": "2021-09-28T02:03:42.000Z",
          "Titre": "Great service with some product reservations...",
          "Contenu": "Service wise, I have to give to them,  on time as always. Order products after hours for an event within a few days and was received within two days without delays. Primera has never let me down. On the other hand,  the paper rolls ordered were a big letdown. At the event,  with customers lining up for prints, the IP60 printer could not receive the rolled paper ordered. I had to forced the roll into the slots then prey out to remove. Luckily the printer performance was not effected but over time it is a concern."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Chaz Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-03-22T16:30:40.000Z",
          "Titre": "The issue that the Printer was…",
          "Contenu": "The issue that the Printer was originally sent in for has been resolved. However, the QA on the printer does not seem to have been very thorough. The metal bar that slides the finished cassettes to the side does not work. It makes a grinding noise whenever a cassette is printed and does not come out. The Printer is also having connectivity issues with our PTLAB program. It is not recognizing the Printer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-12-02T00:51:05.000Z",
          "Titre": "Ink problems",
          "Contenu": "Ink problemsI did not have a problem with customer service, they were helpful.  However, I am just frustrated with the printer in general.  We have had nothing but problems with it since we bought it - and in my opinion - it is too expensive to be having so many issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Darren Mann",
          "Nb_Reviews": 1,
          "Date": "2022-01-03T22:34:03.000Z",
          "Titre": "I received my Primera LX610 printer…",
          "Contenu": "I received my Primera LX610 printer today. Was excited to open it and try it out. Once I open the package, and had it all set up. I thought I was missing something no labels to print. I called customer service and they told me it does not come with any. I never heard of a machine not coming with at least some sample labels. I paid $2,800 for a machine I cannot used. I told it would of been nice to have that stated clearly that you need to buy labels. Disappointed that I have to wait now.  I order labels but now need to wait till they arrive. Not a good way to start my experience with a new printer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2021-05-20T15:47:38.000Z",
          "Titre": "I found it very difficult to enter a…",
          "Contenu": "I found it very difficult to enter a custom order on the website. I contacted the sales team three times via their chat feature and all three times I was told I had to enter the order myself on line.  Certainly a lack of customer service and unless you are ordering a standard product I would not recommend."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cesar Castro",
          "Nb_Reviews": 2,
          "Date": "2020-10-31T20:44:23.000Z",
          "Titre": "Hello!",
          "Contenu": "Hello!Today, I purchased (Oder # 1000446913) the software printer driver for an LX610 (MAC Version). I received purchase confirmation and a copy of my PAID receipt but no Software Activation Key. NOT GOOD, customer satisfaction and service. The Software Activation Key must be sent immediately.César F Castro"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brianna Cunney",
          "Nb_Reviews": 1,
          "Date": "2021-11-18T19:54:33.000Z",
          "Titre": "Nothing but problems since i received…",
          "Contenu": "Nothing but problems since i received my printer last Wednesday. bad ink, bad media chip, a week later, new media chip waiting for manager approval.  I am without chip to use my roll of labels. I was told it was sent out last week.  Very disappointed"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Krystal Read",
          "Nb_Reviews": 1,
          "Date": "2021-06-29T17:18:33.000Z",
          "Titre": "Needs to come with at least some labels!!",
          "Contenu": "The initial purchasing process was simple and easy. But, our printer did arrive late; Also we were unable to put it to use right away due to the fact that it did not come with any label paper of any kind, nor were we informed of that fact at any point before, during, or after purchasing. Possibly consider at least putting in a foot or two of labels for customers to use for test printing. And that detail seriously needs to be added to the product description: does not come with labels! It is great that at least there is some ink included though, so thank you for that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lonnie",
          "Nb_Reviews": 1,
          "Date": "2019-10-25T21:09:39.000Z",
          "Titre": "Still not working because of poor communication",
          "Contenu": "I sent it in and for what ever reason it took almost 2 weeks after it was repaired to get it back to me.  I had sent the print head with it so I assumed that the repair person had used that print head to test everything.  When I hooked it up and tried to print nothing came out, not a drop.  If it needed a new print head then why didn't they send one with it and charge me.  So now I ordered a new print head.  Very poor communication from Primera."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2019-11-20T01:09:11.000Z",
          "Titre": "Very disappointed that the…",
          "Contenu": "Very disappointed that the brochure/software included with the printer was outdated... Only a call to customer support (TOTALLY unnecessary!) revealed, after 3 straight days of conversations, that the software that came with the printer AND the updated software on  your website, was totally useless for my iMac 27\" running on Catalina OS!  Now I have to WAIT until your company comes up with a solution... I don't think I can hold my breath that long!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer1",
          "Nb_Reviews": 2,
          "Date": "2018-07-27T16:06:48.000Z",
          "Titre": "I had such high hopes for this label…",
          "Contenu": "I had such high hopes for this label printing system- the LX500c, but unfortunately, the ink is quite high priced for as fast as it goes.  I am quite happy with the end product labels but I just don't think long term I'll be able to sustain use of it in my business.  I contacted customer service about a bulk discount- which amounted to very little & you must purchase a case of 48!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "tristate label",
          "Nb_Reviews": 3,
          "Date": "2018-07-05T19:54:54.000Z",
          "Titre": "terrible communication,bad info",
          "Contenu": "terrible communication,bad info , asked for an amended invoice still don`t have it, i was told i could send a check then i was told i had to wait until it cleared,paid $40 to overnight the check, could have sent a cashiers check or bank check was told they didn`t accept them, had to call 3 times just to find out what was going on, it was just a mess,no one seemed to know what the hell the procedure was."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "chelsie vaughan",
          "Nb_Reviews": 1,
          "Date": "2020-03-13T22:27:41.000Z",
          "Titre": "Not very happy!!!",
          "Contenu": "I placed order at 12:30 on a Friday and didn’t receive order placed until the following Monday... then I was told if I didn’t pay the $50 faster freight charge it would take a month... so I told them I would go ahead and pay because I’m in need ASAP... so for $50 then they tell me I can get it in hopefully two weeks which I feel is ridiculous... on top of it they charged me 100 so I called and they said they would remove the other $50 they added on!!! So in my personal experience it wassnt great!!!!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Happy enough",
          "Nb_Reviews": 2,
          "Date": "2020-09-02T16:08:02.000Z",
          "Titre": "Primera seems a shadow of itself these days",
          "Contenu": "I always thought that Primera was a good company, but these days when I call for help with something that I cannot resolve on their website, I just get some guy with marbles in his mouth who tells me to go to the website. In short, I can't get the help I was after, and need to go elsewhere."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Virginia",
          "Nb_Reviews": 3,
          "Date": "2020-02-04T16:11:01.000Z",
          "Titre": "Difficult for special orders",
          "Contenu": "I have been ordering custom labels for years but the new website is very difficult and confusing for placing special orders.My order came through wrong but fortunately there was a good customer support person who spotted it and contacted me to correct.5 stars for customer service 2 stars for the new website"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matt",
          "Nb_Reviews": 3,
          "Date": "2018-02-21T20:48:27.000Z",
          "Titre": "The first tech I spoke with a few weeks…",
          "Contenu": "The first tech I spoke with a few weeks ago said I needed an entire print carriage at a cost of over $125. I ordered it and was sent. Not only was it the wrong part for my Bravo se, it turns out, after speaking with a different tech, I only needed a $5 dollar replacement part. It was sent and works fine.      I had to pay the $22 in return shipping costs even it was Primera's fault for sending me the wrong part!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-08-07T22:06:17.000Z",
          "Titre": "Website seems to change monthly",
          "Contenu": "Website seems to change monthly. Very difficult to navigate. Not user friendly as you must start over from the home page every time you need to add another item to your cart. Prices are expensive and they are the only ones you can purchase from if you have their printer. I have reached out to them about this in the past and it has changed nothing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danny",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T21:31:29.000Z",
          "Titre": "Please provide other shipping options!",
          "Contenu": "All I needed were two springs that were less than one dollar total. Shipping charges were going to be close to $13 because they only shipped FedEx. The only Reason I did place an order was because they were the only provider for the spring. I had to add other items in order to justify the shipping. Please offer other shipping options then FedEx only."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jennifer B",
          "Nb_Reviews": 1,
          "Date": "2021-09-29T23:05:33.000Z",
          "Titre": "The new website: thumbs down!",
          "Contenu": "The new website was really wonky to use.  Too many annoying popups cluttered the screen and obstructed my trying to get to my order history.  I intensely dislike the non-choice of having to accept Cookies in order to get rid of that banner and am not interested in having my shopping experience \"enhanced\" by having even more intrusive tracking to intrude in my emails.It took several attempts to get what I wanted to order because of all the screen clutter not allowing me to select my products. It was so frustating, that had it not been too late, I would have closed out and just called an order in over the phone.  Your old site was much easier to use."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scot",
          "Nb_Reviews": 1,
          "Date": "2019-08-27T15:27:01.000Z",
          "Titre": "Not the best value",
          "Contenu": "Power receptacle is loose, lid is flimsy, does not calibrate well enough to print to edge consistently, labels rolls leave glue on label, have to upgrade software to cut and paste... Just not a good value. We would return but need it too much. We just worked around all of the challenges."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rick Sures",
          "Nb_Reviews": 2,
          "Date": "2018-05-15T14:21:07.000Z",
          "Titre": "AT 9.15 AM I ORDERED and paid for next…",
          "Contenu": "AT 9.15 AM I ORDERED and paid for next day air because the areaonl9ine said that that if ordered before noon it would go out same day.  It never got shipped and I paid for the next day air. When I called no one said what I though they should have said which is to credit back the next day air cost of $121.00.Instead they offered a free set of ink cartridges which  were not sent so I am disappointed in the customer service i was given. My call trying to get my freight reduced ,took 45 minutes to an hour. Way to long"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bernie Kaufman",
          "Nb_Reviews": 14,
          "Date": "2022-01-25T20:11:39.000Z",
          "Titre": "An unusually difficult experience.",
          "Contenu": "We have always had great service from Primera but when we recently reported a defective role of labels using the live chat option, the experience was frustrating and ultimately led to an unresolved problem."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "saadallah abu abu",
          "Nb_Reviews": 6,
          "Date": "2020-08-18T21:11:42.000Z",
          "Titre": "i called twice to place order i had to…",
          "Contenu": "i called twice to place order i had to put down the phone they could not pull out my sea   y accountthen i did order under my new company but when i called to say that should not tax my payment the lady made it complicated so end it paying extra $35 for taxes"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2018-05-28T20:35:41.000Z",
          "Titre": "bottle labeler did not work for our…",
          "Contenu": "bottle labeler did not work for our application despite being in spec (1\" 50ml bottle) and tech support was a joke when we called in for support, essentially saying that our bottle probably would not work in the labeler consistently despite it being within the range.  Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Erik",
          "Nb_Reviews": 3,
          "Date": "2018-02-28T20:51:29.000Z",
          "Titre": "Way more $ and trouble than its worth!",
          "Contenu": "I purchased a refurbished LX2000. The printer is capable of producing beautiful labels...when its actually working. I had to send the LX2000 off for repair the first day I received it. The second LX2000 stopped working several months later. I sent the second printer off to be repaired. I was charged $350 plus shipping. Oh, and over $50 for a cardboard box to ship the printer in. A little over 2 weeks later I received the second repaired printer. So far it is working about 80% of the time. It quits periodically, so I have to turn it off and back on again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jeremiah",
          "Nb_Reviews": 3,
          "Date": "2018-02-21T21:05:29.000Z",
          "Titre": "Using the printer is a routine point of frustration and source of profanity.",
          "Contenu": "Printers seem designed to waste as many labels as possible while the ink cartridges commonly malfunction if not used more than once a week at a minimum.Using the printer is a routine point of frustration and source of profanity. When it works the labels are good enough."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jean-Eric Maurice",
          "Nb_Reviews": 1,
          "Date": "2022-05-03T21:18:45.000Z",
          "Titre": "It says \"IN STOCK ITEMS ORDERED BEFORE…",
          "Contenu": "It says \"IN STOCK ITEMS ORDERED BEFORE 2:00 PM (CST, -5 GMT) TO SHIP TODAY\", my item is in stock and it's been 48h since I placed the order, still not shipped."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "DMCM",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T16:32:18.000Z",
          "Titre": "NOT USER FRIENDLY",
          "Contenu": "I bought the LX500C from Amazon because they make returns so easy, unfortunately by the time I realized the printer was so un user friendly it was too late to return, the labels I bought at the same time that said they were for this printer were too big so I ordered directly from Primera and they just won't match up with what I'm printer. I was under the impression from discription the bar tender was more user friendly and could \"create\" documents, it doesn't and when I called for assistance the Primera tech I spoke to was very rude and degrading. I was hoping to find an easy solution to making labels for our coffee bags and it has been nothing but frustration."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-30T16:17:49.000Z",
          "Titre": "Lack of communication between…",
          "Contenu": "Lack of communication between departments, transferred multiple times between departments. Don't see why the tech can't just help me order the part I need, rather than bouncing back and forth between tech and sales. Still ended up receiving the wrong part."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Golden Gate Whisky Co",
          "Nb_Reviews": 1,
          "Date": "2019-07-03T21:30:51.000Z",
          "Titre": "Honestly, not great.",
          "Contenu": "Honestly, after one year of use I conclude that this printer is very wonky, not accurate (lots of label-loss due to faulty alignment and cheapness of design) AND the ink issues make for expensive labels. Quite a wasteful machine in fact."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "William Walton",
          "Nb_Reviews": 2,
          "Date": "2018-02-21T21:08:37.000Z",
          "Titre": "Unresolved repair issue",
          "Contenu": "I bought a Primera Bravo SE a few years back and the machine has worked well up until a point.  At that point, the burner drive malfunctioned and I was unable to resolve the issue with a driver update.  So I contacted Primera to initiate a non warranty repair of the unit.  I paid the $400 flat fee and shipped the unit to their repair facility.  When I received the unit back, the unit still worked as if no repair was conducted.  I tried several attempts to resolve the issue with their technical support staff, to no avail and the unit now only functions as a disk printer and not as the publisher that I purchased.  Very disappointed."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 3,
          "Date": "2018-02-21T21:05:21.000Z",
          "Titre": "We have long had problems with Primera…",
          "Contenu": "We have long had problems with Primera printers -- they work for a while and then go bad. As a small business owner, most of my time is spent solving problems, and the biggest problem I have, without questions, is my Primera printer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sheila Duda",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T22:51:16.000Z",
          "Titre": "Primera Video Shows How to Remove a Stuck Label",
          "Contenu": "Revised 8/23/2022. I removed the link as requested by Primera. Now, a cautionary tale. Wouldn't you know another label got stuck in the feeder. The second time we took the LX2000 apart did not go as well. A tiny screw got away and landed where we could not retrieve it. This messed up the printer. So, I shipped it to Primera for $650 and am crossing my fingers it can be repaired.I contacted support because a label came off the backing and got stuck under the feeder. I was looking for instructions on how to remove the stuck label.Tech support recommended either sending me a service manual or shipping the LX2000 in for servicing, costing $650, not including shipping. I chose the service manual. The manual was complicated and not very helpful. I searched YouTube hoping someone else had this issue. I found a video by Primera showing how to remove a stuck label on the LX2000. I followed the directions on the video and successfully removed the label. I recommend tech support have a reference list of Primera's videos to offer the customer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mia",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T20:30:30.000Z",
          "Titre": "We are a company that orders…LABEL STOCK",
          "Contenu": "We are a company that orders semi-frequent, and all stock for our LX2000 is custom.  Prices went up without any explanation to us, and we were forced to complete the order.  Looking at our options from this point forward, thanks."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kevin",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T20:48:22.000Z",
          "Titre": "Would not buy again",
          "Contenu": "The sales staff will tell you all the good things about the printer when you are you looking to buy one but they won't tell you that you are pretty much on your own when if comes to after sales questions or tech support."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Evan",
          "Nb_Reviews": 2,
          "Date": "2021-07-19T17:55:01.000Z",
          "Titre": "I had 10 defective ink cartridges to…",
          "Contenu": "I had 10 defective ink cartridges to send back, and I've had to pay for more cartridges to cover me until the new ones arrive, which Primera states takes a long time on their website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joe Davis",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T14:01:19.000Z",
          "Titre": "The Power supply unit on our 4100x unit…",
          "Contenu": "The Power supply unit on our 4100x unit failed, we contacted support for the appropriate replacement part number.  Transferred to sales to ensure the part was in stock and ready to ship today.  This was all before 2:00PM EST, at 5:16PM after we closed, received email stating PSU was no longer available and the replacement \"It is not a direct replacement though as it is 200w instead of 300w, it's not auto-switching and it doesn’t have a physical on/off switch. It will fit and power the unit though.\" Customer Service only response is \"Looks like we will need to get everyone updated on the status of the original SKU you ordered.\"  After talking with 3 people and explaining the urgency of the problem.  It's nice to know one thing on the internet is absolutely correct \"Customer service is a dead concept\"."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2020-03-06T15:33:53.000Z",
          "Titre": "I am not willing to share any more…",
          "Contenu": "I am not willing to share any more details because the last time I did I was attacked on social media by someone at Primerica saying that any issues I had were my fault because I hadn’t been to their school"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T20:29:25.000Z",
          "Titre": "Primer -eh..",
          "Contenu": "Most companies do follow ups and have strong IT support - Not Primera.  we only hear from them when we contact them, and each time we have an issue, it seems the last person that we left off with has left the company."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jacob Cornell",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T22:51:22.000Z",
          "Titre": "I feel like I wasted my money",
          "Contenu": "I feel like I wasted my money. The $3000 printer that I bought to cut out labels does not cut out unless you buy the $130 sub-par software that is required for the printer to do it's job. Even worse, the software frequently crashes, and when it does work it re-arranges my designs entirely for ai, svg, psd, and pdf files. The only viable way to print with it is when you just plop a .png or .jpg file  on it but that sucks too because the print always comes out faded. The only upside to this purchase is saving pennies per label, but is it really worth it when the quality is so much worse? I might just go back to ordering labels from Avery or Staples. Supplies for this printer are not cheap either. $120 for two rolls of paper? How am I saving money with this thing again?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Rhaphael Tarpley",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T19:52:58.000Z",
          "Titre": "LX610 Printer Sucks!",
          "Contenu": "LX610 worked amazing for a month.  Now all get is cutter errors with no support in the knowledge base.  I spend more time researching errors than I do actually printing labels."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Katherin",
          "Nb_Reviews": 1,
          "Date": "2021-10-08T10:58:41.000Z",
          "Titre": "Not a waterproof label solution",
          "Contenu": "We purchased the LX610 with plot cutter, specifically for the “oil and water resistant” label solution. Prior to purchase, we did our research and spoke to Primera and we’re assured this printer would work die our needs. Unfortunately the label stock does not hold up to any moisture whatsoever which is essential for our product. We have spent hours on the phone with tech support adjusting the ink and saturation, but it has made no difference. We were advised to purchase the clear lamination that was recently released, which we did. But, the lamination film does not work on labels with a white background. It shows every spec of dust/imperfection (maybe this is a better solution for full colour labels?). We’re feeling disappointed and frustrated - having invested $4k+ CDN and countless hours troubleshooting, but have no solution for our needs."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2018-03-01T16:12:42.000Z",
          "Titre": "What they don't tell you",
          "Contenu": "Overall great printer, with some issues. The biggest issue is the ink is very expensive. The other issue is that the printer will not function if you run out of any single cartridge. They have intentionally placed a bug in the system that will intentionally only print a partial label when a cartridge is empty. Even if you switch the settings to monochrome black it will still not function properly (this is by their intentional design). During such cases the printer is a totally useless robot that intentionally prints improperly until you pay the outrageous price to have a single cartridge shipped to you and replace it. A week later and after much inconvienience you are good to go again. I have no complaints about reliability. I like the printer."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AFFS Corporation",
          "Nb_Reviews": 2,
          "Date": "2018-05-02T17:06:51.000Z",
          "Titre": "Because I was shipping to a different…",
          "Contenu": "Because I was shipping to a different place they canceled my order within 3 business days -- that is just too short. I placed my order on May 25th on May 26th (Thursday) -- they said I had to call by noon on Monday -- I called Monday but after noon their time and it was canceled. It also took forever to get the \"bill to\" different from the \"ship to\" ONLINE because it keep duplicating the ship to the bill to and the bill to to the ship to.  I finally placed my order through a nice person on the phone in SALES and it went through -- but you ONLINE is not good. We are also getting the machine because you stopped making the toner for a perfectly functioning machine we have. You product is good but the company servicing us needs serious improvement."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kike",
          "Nb_Reviews": 5,
          "Date": "2020-09-30T18:17:53.000Z",
          "Titre": "The website is terrible",
          "Contenu": "The website is terrible.  No mobile use as the Captcha totally interferes with screen operation.  I only needed ink and it was a Herculean task to give you business......"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T17:45:31.000Z",
          "Titre": "Not sure they know their own products.",
          "Contenu": "We were not only given the wrong information several times, but it seemed that no one at the company could agree on what label stock is used for what type of product. After being bounced around many times we were left with no answers. Our customer did not get labels in time for his wine bottles because the 'water proof' labels and inks/dyes were anything but. We purchased our primera printer primarily FOR wine labels and now it appears that it is not a good use for that - even though our rep told us this printer would work specifically for this.  We ended up going through a different vendor, and are now left wondering what to use the machine for.  The only reason they get 2 stars is because of them finally accepting the labels that they recommended to us back, and after going through some red tape, they also included the shipping of said product back."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Celine Persinette",
          "Nb_Reviews": 1,
          "Date": "2021-05-06T20:30:03.000Z",
          "Titre": "Sales process from the website is to be…",
          "Contenu": "Sales process from the website is to be improved!!I had to place my order 3 times to get it right.Sales support (Pat) was very helpful. Thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-12-19T15:47:01.000Z",
          "Titre": "No communication",
          "Contenu": "No communication. Snarky Customer Service Reps. Primarily interested in having the customer upgrade rather than solving the problem they were contacted for."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-20T18:20:04.000Z",
          "Titre": "Never got a reply to a shipping…",
          "Contenu": "Never got a reply to a shipping question on a priority overnight order I placed. Why have email customer support if you're not going to answer them?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Candice",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T21:41:15.000Z",
          "Titre": "Thought I was suppose to get the repair…",
          "Contenu": "Thought I was suppose to get the repair for $350, I purchased an upgrade but could not ship the other machine for repair.  They charged me $450."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "wendy acosta",
          "Nb_Reviews": 2,
          "Date": "2020-09-18T21:31:40.000Z",
          "Titre": "Inflexible Shipping Policy Bites Again - The company policy to only use one…",
          "Contenu": "The company policy to only use one shipper sunk this customer once again. This issue?  Only shipping FED EX to Hawaii - which adds $44-87 to the cost of ONE ink cartridge, making it impossible to enjoy my 910 printer as much as i'd like to.  Same shipping with USPS INSURED is $11.00 - oh and I added in 3 more cartridges. The individual employees who went the extra mile for me get 5 Stars, but again, they are hitting the company policy ceiling and will not be able to assist me again with this matter. Mahalo to both of you for getting my ink on it's way to me. Contrast this 2 day issue (and it's a repeat, we went thru this when I ordered the printer) to a response from Kenco asking if they'd mail inks and labels via USPS.  \"Of Course!\", they said.  \"Just put a note in the comment section and it will flag it for personal attention.  Then you can use our USPS account or send the prepaid postage to us.\"  Guess who is getting all my ink and label business from now on?"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Me",
          "Nb_Reviews": 1,
          "Date": "2022-05-14T03:33:54.000Z",
          "Titre": "Shipping too high",
          "Contenu": "Shipping is atrocious!  All I ordered was filters and the shipping was almost as much as the order!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ANGEL BERNARD",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T23:20:34.000Z",
          "Titre": "Wanted to see if a military discount…",
          "Contenu": "Wanted to see if a military discount was offerded however revieved nothing for 20 yrs of service for my country. Sad!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 2,
          "Date": "2021-10-20T20:57:05.000Z",
          "Titre": "Was expecting more...",
          "Contenu": "I upgraded my LX900 label printer to the new LX3000 as they are phasing out the LX900.  For a small business like ours, this was a big investment.  We ordered on Aug 14, 2021, and were told it would be a 1-2 week lead time which would be putting us in a tight position as we had several events coming up in Sept, mainly a beer can release on Sept 8th.  Apparently, there were issues and I was not made aware and we did not receive the printer until Sept 10th.  Then there was an issue with the Paypal credit payment (because it took so long Paypal put it on hold and then dropped it) and they threatened me with having to send the printer back if I did not pay.  Then to top it all off, one of the ink tanks did not have a chip on it so I could not use the printer.  I contacted them and instead of just sending me a new ink tank they made me send the other one back first.  Needless to say, I was out a label printer for 2 months during the busiest time of the year for our business.  The printer is up and working now and for that I am thankful, but Primera really needs to work on their customer service.  I was made to feel like it was all my fault.  We would never treat a customer like that and in fact would do everything to make it up to them.  It was a very frustrating experience."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 2,
          "Date": "2021-06-11T08:47:15.000Z",
          "Titre": "Not great",
          "Contenu": "Terrible customer service. Products break easily from normal use. Great prices but not worth it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOE Ginet",
          "Nb_Reviews": 2,
          "Date": "2022-10-02T00:25:21.000Z",
          "Titre": "Your web site is not easy to use and…",
          "Contenu": "Your web site is not easy to use and trust"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "JOE Ginet",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T00:43:22.000Z",
          "Titre": "Your web site is not user friendly",
          "Contenu": "Your web site is not user friendlydoesn't work as it shouldNot a pleasurable experience"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "John Alexander",
          "Nb_Reviews": 1,
          "Date": "2019-12-30T00:42:59.000Z",
          "Titre": "No return call.",
          "Contenu": "I called them, earlier this year, about a label.  No one called me back, I had to make another call."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ryan Klock",
          "Nb_Reviews": 1,
          "Date": "2020-04-17T15:52:49.000Z",
          "Titre": "your website wont let me buy ink from…",
          "Contenu": "your website wont let me buy ink from you, credit card malfunction.  purchased on amazon instead"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mardymar",
          "Nb_Reviews": 2,
          "Date": "2018-04-25T17:20:49.000Z",
          "Titre": "My printer  done close to 400 cds and…",
          "Contenu": "My printer  done close to 400 cds and stoped picking up the cds! I paid 450.00 to get it fixed!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Amos Kauffman",
          "Nb_Reviews": 2,
          "Date": "2019-05-21T23:24:35.000Z",
          "Titre": "Options for Mac are limited",
          "Contenu": "Options for Mac are limited. Why limit the abilitys for the best computer on the market??"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Trig Simon",
          "Nb_Reviews": 2,
          "Date": "2018-07-27T14:28:33.000Z",
          "Titre": "Way too slow",
          "Contenu": "My Bravo II Primera 4100 is a great machine...when it is functioning properly.  But, that never happens for me.  When I use the PTPublisher, it takes anywhere from 2 minutes to 10 minutes to print each disc.  So, I always bypass it by using the Disc Cover 3 PE software.  Unfortunately, Primera locks the quantity of prints to 1.  So, I have to enter each print job, one at a time.  When you have 340 discs to print like i did last night, it can take a half hour to enter the print job.  But when you bust your butt to get a job done, then have to wait for the Primera print job, it can take 24-36 hours to print compared to manually getting it done in 4 hours.When you are manually loading jobs, you cannot use the PTPublisher's data to watch ink levels.  I have asked Primera why it takes so long to print and they just tell me the pauses are built in to let the system cool off or let programming respond to the next task.  I don't buy that, because it is very slow from the start.I have been manually entering 4000 disc per year, and it doesn't seem to overheat or have a problem with programming, printing a disc every 40-50 seconds, depending on the ink coverage (area printed).  If only they could give me a firmware to unlock the quantity of one limit, I would be totally satisfied and change my rating to 5."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Cathy",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T21:42:23.000Z",
          "Titre": "the choices of label stock are slim and…",
          "Contenu": "the choices of label stock are slim and i cannot find any templates i need!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-07-02T19:27:15.000Z",
          "Titre": "He did not make an effort to understand…",
          "Contenu": "He did not make an effort to understand my issue and offered one solution."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "R.D.",
          "Nb_Reviews": 2,
          "Date": "2020-06-10T13:55:34.000Z",
          "Titre": "Printer does a beautiful job - when its working!  Customer service less than stellar!",
          "Contenu": "While my printer works fine - when it's working, I have been less than impressed with customer service, even after having the printer for a year.  It started with no assistance in using BarTender software and printer setup.  I had to teach myself how to setup and use that, then I've had glitches along the way and contacted customer support.  They are less than impressive and I get the feeling they are learning alongside with me.   They even had me go onto their website to download the manual for my printer only to find out that it was a broken link so he told me to just use a different printer model because \"it's almost the same.\" Now my printer is in for repair because a label peeled off while printing and got jammed.  A jammed label = sending printer in for repair, folks!!  I was quoted 5-7 business days for the repair.  Today is DAY 9  and nobody will respond to me regarding the status of the repair.  Also interestingly enough, I placed a low rating earlier after my purchase regarding the customer service in the beginning and they begged me to remove or edit it.  I did not and quite honestly I am glad I didn't because they have continuously proved less than stellar in the customer service area.  Always say \"they are working on the website\" or \"have new techs\".  We get a lot of positive comments about our labels and packaging.  They are beautiful.  But when we are asked what printer we are using, I will tell them and will be honest about our customer service experiences."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "alan",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T20:46:00.000Z",
          "Titre": "My issue is still not resolved",
          "Contenu": "My issue is still not resolved. I can’t update to FW 1.45 on my LX500."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Phil",
          "Nb_Reviews": 2,
          "Date": "2021-10-25T17:30:03.000Z",
          "Titre": "Took 1 hour and 14 minutes to complete…",
          "Contenu": "Took 1 hour and 14 minutes to complete my purchase."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sonny",
          "Nb_Reviews": 2,
          "Date": "2018-02-28T21:01:19.000Z",
          "Titre": "No customer retention plan, quirky printer",
          "Contenu": "We have the Printer **, the spooler***** and the labeler *****.  The worst of the 3 is the printer.   very quirky.  Getting the label centered is hit and miss, the same label can print 100 times, and then all of a sudden be off the label. Also, the image will fade unexpectedly and you will have to abort and clean the print head - sometimes that works, sometimes it does not - the printer needs constant babysitting if you care about the quality of your labels.  Service is not real good, they have no loaner program and you have to send the printer in with no guarantee it will be fixed or how long they will have it.  Printer is 2 years old (bought it new), and already deemed obsolete by the vendor, some things just can't be fixed because the 2 year old printer is discontinued.  For this reason they get a 2 Star (should really be 1 star).  When it is working it is great, but the quirkiness is annoying and the repair is non existent.  When it fails we will replace with another vendor.  What would be great customer service in this case is an offer to give us some sort of credit/incentive to stay with the primera line.  But in the 2 years and the $10K + we have spent, not one offer or any type of communication has come our way - we discover the primera product strategy when the device fails and we have to call support - which I might add is not often (we deal with the quirky printer issues, primera can not fix them as it is not constant).  Oh, and did I mention the printer eats ink and it is not cheap.  The spooler and labeler have been error free in the last 2 years - they are great and hopefully will work with other printers."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Reiner Zanotelli",
          "Nb_Reviews": 3,
          "Date": "2020-06-26T00:40:49.000Z",
          "Titre": "2 weeks waiting support",
          "Contenu": "2 weeks waiting support, for now, this the best option!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2018-09-21T14:24:10.000Z",
          "Titre": "You gouge your customers on supplies…",
          "Contenu": "You gouge your customers on supplies and shipping"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Tony",
          "Nb_Reviews": 3,
          "Date": "2018-06-07T16:31:37.000Z",
          "Titre": "Order has not come",
          "Contenu": "Order has not come, start to worry,"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Billy Lindsey",
          "Nb_Reviews": 1,
          "Date": "2019-02-06T00:58:41.000Z",
          "Titre": "No real help for my problem"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris Ralph",
          "Nb_Reviews": 20,
          "Date": "2021-01-03T09:32:38.000Z",
          "Titre": "Too much carriage to uk"
        },
        {
          "Note": 2,
          "Lieu": "SG",
          "Pseudo": "Boon Pin Tay",
          "Nb_Reviews": 2,
          "Date": "2020-11-30T00:04:33.000Z",
          "Titre": "Far delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie A.",
          "Nb_Reviews": 2,
          "Date": "2023-11-10T00:45:03.000Z",
          "Titre": "It is not easy to reorder custom labels",
          "Contenu": "It is not easy to reorder custom labels.  The site makes you have to re-enter all the information from your last order.  This increases chance of errors being made when we re-order our custom labels. This really frustrates me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "McKenna Gilman",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T22:34:15.000Z",
          "Titre": "delayed service but kind support",
          "Contenu": "I felt that the customer service was often delayed. I had to reach out a few times to receive a reply and it delayed our ability to order our product. Kind service though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer Jenn M.",
          "Nb_Reviews": 2,
          "Date": "2023-10-15T23:01:12.000Z",
          "Titre": "The checkout and recycling policies need some love.",
          "Contenu": "I don’t like that I have been purchasing lots of ink in the past 3 years… you ask for a coupon code when I check out, yet I never received one :( doesn’t make me feel valued. Also I have hundreds of empty cartridges that I wished I could return to you for a recycling credit. :((("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jordan douglas",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T20:33:35.000Z",
          "Titre": "I'm on my 3rd LX610",
          "Contenu": "I'm on my 3rd LX610, the 2nd Machine had problems right out of the box.  We are just now installing our 3rd LX610 and confidence in your refurbished products is running low. Factory Refurbished machines should be better then new, bugs worked out and faulty parts replaced, but you guys sent me a still broken printer.  Not happy with this product so far"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Matthew Hurd",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T18:16:11.000Z",
          "Titre": "I suppose it's more of a quality issue",
          "Contenu": "I suppose it's more of a quality issue. We purchased 2 new LX3000 printers this year. So far we have had to RMA the 2 original printers, plus one of the replacements that was sent to us. That's 3 total printers that have had failures. 2 of the printers leaked blue ink all over the place and made quite the mess on our floor and desk. Doing the RMA on the third replacement printers was also a frustrating experience dealing with customer service.Edit: Thank you for the prompt response and explanation."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "LRenee Jones",
          "Nb_Reviews": 1,
          "Date": "2023-01-09T20:33:46.000Z",
          "Titre": "I have had to make too many adjustment…",
          "Contenu": "I have had to make too many adjustment in order to get a good print.  I feel if I'm paying $3,000 for a machine I expect it to be ready for me to use and i shouldn't have to waste countess materials just to get the correct adjustments.   There is too much that needs to be done in order to achieve a good print. Theee should also be a specific video for Mac Users I have had to rely on Facebook groups and this shouldn't be the case.UpdateI am responding to the comment left by a staff member, I have taken the training and I still have to rely on Facebook groups and others in order to navigate through the printer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marco",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T18:19:03.000Z",
          "Titre": "Great Machine, Defective Ink though!",
          "Contenu": "I have enjoyed my edible printer greatly and it has been very straight forward to use! Only issue I have had is that the ink cartridge arriving with the printer stopped working properly with 90% remaining ink! Never heard back from customer support on the matter but had a spare I bought when ordering. I'm hoping the spare does not do the same as they are $130 Cartridges!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2023-06-28T05:21:32.000Z",
          "Titre": "Read reviews first!!",
          "Contenu": "The printer is really neat, however it is not flawless which is unfortunate given the substantial investment. For the price of the machine and for some of the accessories, there should not be issues with parts on it being level. I purchased a new machine and used it for three weeks when I decided to install the platform kit that was an extra $80. I noticed the platform was not level and therefore the food items being printed on were not level causing images to be blurry on one side. Thinking it was the platform, I removed it to check. The platform was fine and is level but the arm that it attaches to is not. After receiving a second printer to hopefully resolve the issue, it disappointingly is not resolved. The new machine has the same issue. So, buyers should read reviews and think twice before paying extra for the platform kit because you will never get a clear image with a 3 mm difference in heights between the two sides. The same issue can be seen in the video on the website for the installation of the platform kit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sinking Creek Soaps",
          "Nb_Reviews": 3,
          "Date": "2022-11-07T00:22:25.000Z",
          "Titre": "We love our new labels…when it…",
          "Contenu": "We love our new labels…when it works……the software/printer is not very user friendly.It’s easy to chat with support but, unfortunately it doesn’t always solve the problems we have.  I’m sure a lot of our issues are “user” related.  Just wish it was easier to navigate without having to call/chat."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Stan Mills",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T13:49:11.000Z",
          "Titre": "I am a long time customer of Primera",
          "Contenu": "I am a long time customer of Primera. I try to keep extra ink on hand all the time so I placed an order for a set. The ink levels were fine and we are really busy with customers so I didn't realize the ink was never delivered. After we ran out of one color I contacted customer support and after several emails was told there policy is you only have 48 hours to report a non delivery and I have to eat $125.00 I paid for the ink. It doesn't seem like much to Primera but it is the lack of caring that really bothers me. It sad that some companies won't take the time or make even an effort at keeping 15 year customer.I am please with the response Primera Tier 2 has been most helpful and how quickly they responded. I appreciate the immediate correction of the problem and the help. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T13:07:14.000Z",
          "Titre": "After a 40 min phone call was told let",
          "Contenu": "After a 40 min phone call was told let publisher sit for30 min to allow unit to absorb software. Huh?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ed Wagner",
          "Nb_Reviews": 6,
          "Date": "2023-03-10T20:35:12.000Z",
          "Titre": "The chat line after 3 tries didn't help…",
          "Contenu": "After leaving a #1 review I was contacted almost immediately by Primera as they had a voice mail issue and also were proactive in trying to help me solve my LX900 printer issue. Unfortunately I left town for 3 weeks and was not personally able to reconnect but I believe my son will contact Primera as soon as possible. For this effort I am changing my review to a #3 and if we are able to finally solve this problem I will upgrade the rating again to a #5.The chat line after 3 tries didn't help me determine my problem with the LX900 Color Label Printer. So I called twice to the customer service support line and in both cases after about 10-15 minutes the recording said sorry try some other time. So the second time it asked if I wanted a call back which I said yes and gave my phone number. After 3 days I am still waiting. I gave up and used a different printer. I have had good experience with my AP362 but cannot get this LX900 Printer do do anything. Ed Wagner"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Morgan",
          "Nb_Reviews": 1,
          "Date": "2022-11-22T19:31:40.000Z",
          "Titre": "Mediocre assistance at best",
          "Contenu": "Every time I call for help for my Eddie printer, the associates don’t seem to understand the issues and the trouble shooting they ask me to do is already things that I’ve tried already. I’d really like this process to be more efficient. Additionally, associates often cop an attitude which drives me away from using Primera’s customer service altogether."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Greg",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T18:50:30.000Z",
          "Titre": "I'm disappointed",
          "Contenu": "I'm disappointed that you don't stock BOPP (Waterproof) labels of various sizes. I was told it would have to be a custom order. I'm left with having to spray  clear coat over them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "cassie franklin",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T22:14:39.000Z",
          "Titre": "Your website/platform is not easy to…",
          "Contenu": "Your website/platform is not easy to use, I have a hard time every time I order ink from you; I had to zoom out 4x just to successfully add a new shipping address."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa Petrizzi-Geller",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T12:36:47.000Z",
          "Titre": "The technician was excellent but we…",
          "Contenu": "The technician was excellent but we still haven't solved the problem (s).  Had to switch from the Sassy trays to Milton tray.  Printer seems a bit better.  Haven't tried chocolate covered Oreos on sassy trays again"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy McLane",
          "Nb_Reviews": 2,
          "Date": "2023-08-21T12:59:54.000Z",
          "Titre": "I did receive my order eventually",
          "Contenu": "I did receive my order eventually, but it was too late to do the job I ordered it for.   I had to make way too many phone calls to get my order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jerry Rezny",
          "Nb_Reviews": 5,
          "Date": "2023-03-27T19:10:55.000Z",
          "Titre": "My first LX 3000 stopped working at…",
          "Contenu": "My first LX 3000 stopped working at about the time I changed ink cartridges for the first time.It was still under warranty. Anther was sent and worked great until the same thing happened soon after the ink cartridges were changed the first time. I would think they would know how to fix it because the same thing happened to the first one.Did you not figure out the problem when I sent it back?Now the third printer is a “reconditioned” LX3000. It worked fine for a little while, then started not advancing the labels and stopping. After contacting your tech, I cleaned the rubber roller and it worked ok for almost one roll of labels. It’s now screwing up badly and I’m at wits end.I am out-of-town right now and could not take the he time to send it back to you and will have to deal with it when I get home on April 6.You sent a reconditioned printer."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Barbara Marshall Wag Tantrum",
          "Nb_Reviews": 3,
          "Date": "2022-12-08T19:45:21.000Z",
          "Titre": "Returning a product that was damaged…",
          "Contenu": "Returning a product that was damaged was.....almost not worth it....It still may not be. a damaged roll of labels arrived.  I choose to talk to them on line via  online chat.  It took more than 45 minutes to get it done.  I then had to return my product.  I refused to return the product unless they provided a return label.  That took even more time.   I took pictures of the product and sent it in.  It's a lot of wasted time and money to return a clearly damaged product.  I am a returning customer for 4 years and i was treated as if I was trying to get a free roll......it was nits."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Linda Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T22:40:43.000Z",
          "Titre": "The website was difficult to maneuver",
          "Contenu": "The website was difficult to maneuver. I kept having to go back to the start and do it over and over."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Randal Ferman",
          "Nb_Reviews": 1,
          "Date": "2022-10-23T14:30:40.000Z",
          "Titre": "Label Feed and Alignment Problems",
          "Contenu": "Ticket ID 122234; Here was the response: \"Based on what you've explained, it would seem the Liner Drive Roller is worn on one side and to remedy the factors of that issue I would suggest to wrap a blank label around the Liner Idler Roller to increase the tension on the labels as they are being fed to prevent the misfeeding.\"Problem that I see is that if the above did not work, we still don't know what the problem is because hand wrapping a label onto the Label Idler Roller introduces variables that could go wrong. We decided to buy a new Liner Drive Roller.I did appreciate Sadike's quick response - that was most excellent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn",
          "Nb_Reviews": 1,
          "Date": "2023-02-09T17:05:31.000Z",
          "Titre": "Solid customer support",
          "Contenu": "Some delay in shipping but customer support was helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Leiah Bauer",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T16:00:45.000Z",
          "Titre": "Service and shipping is always great but...",
          "Contenu": "Service and shipping is always great, fast, reliable.  I would have given a better rating but it seems like the adhesives on my labels is not as strong as it used to be because they peel up from my product on their own now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "TP. Canavino",
          "Nb_Reviews": 3,
          "Date": "2023-02-02T17:31:14.000Z",
          "Titre": "My ticket was closed and the issue…",
          "Contenu": "My ticket was closed and the issue persists"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Art A",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T22:46:44.000Z",
          "Titre": "sent multiple emails",
          "Contenu": "i had to send multiple emails and did not get a feedback on my emails. it took a phone call to accounting Marisa Lerum to get the answer i needed. she was very helpful and attentive and see knew exactly what process needed to start. customer service and tech support were very lackluster."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Roylene Clare",
          "Nb_Reviews": 6,
          "Date": "2022-09-03T16:22:41.000Z",
          "Titre": "Platform Kit",
          "Contenu": "I have found the platform kit extremely frustrating.  Every other cookie using the carousel has been low where it is not printing and it is returning under the carousel. I have reinstalled the clear rectangle insert several times with no avail. I am now printing one at a time and lifting off the carousel if it is low.  Definitely not user friendly right now. Will be working with primera hopefully tomorrow 🙏Update, I am returning the platform kit and thanking Mitchell Hoaglund for his assistance."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lois Kelzer",
          "Nb_Reviews": 3,
          "Date": "2023-05-19T02:30:32.000Z",
          "Titre": "I order my ink for Eddie",
          "Contenu": "I order my ink for Eddie. It came so fast."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Marina Sawyer",
          "Nb_Reviews": 3,
          "Date": "2022-03-15T17:12:02.000Z",
          "Titre": "The website is not as user friendly as…",
          "Contenu": "The website is not as user friendly as it could be. Products cannot be filtered. You have to open each after you find the selection that you are looking to get. For example, I need 3\" core but want to look at BOPP only. You have to go through the entire list because there is no filter so that you can sort by material."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andrew Phillips",
          "Nb_Reviews": 1,
          "Date": "2022-06-17T20:56:59.000Z",
          "Titre": "Printer is ok generally but not what we…",
          "Contenu": "Printer is ok generally but not what we expected. Website is abysmal. You can't click onto a page without random pop ups and \"how can I help\" windows opening. The reordering page is a nightmare to navigate- you have a \"reorder\" button on your past orders, but there is no drop down to see what that order was, which makes you click on each individual order to try and hunt down the thing you are looking to reorder, which then causes all the pop ups to come up again... super frustrating website that feels like they are trying to integrate too many third party plugins and leaves you feeling like you just walked onto the strip in Las Vegas."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Richard Hall",
          "Nb_Reviews": 5,
          "Date": "2021-11-22T12:34:25.000Z",
          "Titre": "Sending me other peoples orders",
          "Contenu": "Well, it seemed to take a bit longer to get my custom order than usual.  The other issue I have is it appears that you sent me someone else's order in addition to my own.  The box has my name on it in addition to the company name, but all has \"Jenna Trenbeath\" on the order.  These labels were clearly not ordered by me or anyone here at Browne Trading Co,  What do you want done with them?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelly Shotel",
          "Nb_Reviews": 1,
          "Date": "2021-10-18T19:11:59.000Z",
          "Titre": "All was great except I thought I could…",
          "Contenu": "All was great except I thought I could purchase premade cookies through you and then was told they’d send me the vendor. Vendors of the premade cookies never sent and then I called again and your company person told me they couldn’t share the vendor for the cookies information.I feel a bit angry about this as I was relying on the purchase of cookies"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "RM",
          "Nb_Reviews": 1,
          "Date": "2022-03-09T18:19:19.000Z",
          "Titre": "I had a lot of trouble trying to order…",
          "Contenu": "I had a lot of trouble trying to order a product on the website. The main problem was a shipping quote not able to be calculated after entering my address multiple times.  The sales rep I called was very helpful and was able to process my order very quickly, though."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Robin Felder, Master Distiller",
          "Nb_Reviews": 1,
          "Date": "2021-12-05T19:21:46.000Z",
          "Titre": "I am a new Primara customer",
          "Contenu": "I am a new Primara customer.  I purchased two bottle labelers one for round and one for square bottles. The round one worked as advertised. The other required specially printed labels. I have emailed customer service several times to allow a 60 return policy on the square bottle labeler. I have not heard from them despite the fact that the salesman who sold me the labelers said I would hear from them soon. As I am right up against their return policy I don’t know how to proceed. Customer service could be improved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Isabelle Paradis",
          "Nb_Reviews": 1,
          "Date": "2022-03-26T17:06:24.000Z",
          "Titre": "Beware of ETA for Bo items",
          "Contenu": "I purchased a machine 7 weeks ago and still no news about when we will get it.Thank you Primera for this explanation, this could have been disclosed right from the beginning as this might have influenced our decisions and for sure our expectations."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian Morris",
          "Nb_Reviews": 2,
          "Date": "2021-12-22T00:59:24.000Z",
          "Titre": "meh?",
          "Contenu": "meh?I have both an LX500 and an LX610 and the 610 has been nothing but problems since the start. First one I received was defective out of the box and its replacement had to be sent in for warranty repair after two months of relatively light use. Two days after receiving it back it was already having issues. Tech support got me up and running for the rest of that day(software issue) but it failed again the next. Rating a 3 because my 500 has been wonderful, unfortunately I completely regret the purchase of the more expensive printer at this point."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Suzanne Rowell",
          "Nb_Reviews": 3,
          "Date": "2021-05-18T23:04:22.000Z",
          "Titre": "The supplies I purchased were described…",
          "Contenu": "The supplies I purchased were described as matte white...what I received was off white almost parchment color. Returned the two rolls after chatting online with a customer service representative. The following week Primera shipped back one of the rolls of the off white back to me. ???? Still have not received a credit or an exchange. Very disappointed to have wasted $$$."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Fuhrman",
          "Nb_Reviews": 1,
          "Date": "2021-06-06T15:28:05.000Z",
          "Titre": "When lined up it works very well",
          "Contenu": "When lined up it works very well.  The issue is keeping it lined up.  We're losing 17 bottles per 500 plus the time lost to stop and realign the machine.  This happens in the beginning of a roll and repeatedly during the last third of a roll.  While advertising 1,200 labels per hour, with all the stop and starts, we have averaged 350 per hour."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DON WENZL",
          "Nb_Reviews": 1,
          "Date": "2021-01-29T22:36:44.000Z",
          "Titre": "We order The same custom labels a…",
          "Contenu": "We order The same custom labels a couple of times a year. it would be nice to save the settings, so we do not  have to reinvent the wheel each time.I adjusted my review after the company contacted me directly, stating that they are in the process of up dating the their ordering system to store custom label part numbers. once I see how well it works I will system up date this review."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T14:15:03.000Z",
          "Titre": "Don’t waste your time with a refurbished printer",
          "Contenu": "I bought a refurbished printer, it came defective. Primera had a brand new printer at my door with-in the week. Excellent, receptive customer service.The new printer I received was also defective. I was offered a brand new printer, after not receiving a shipping label for the old one. At this point I had already purchased a new printer, I would not suggest buying a refurbished unit from them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Alan Pronko",
          "Nb_Reviews": 2,
          "Date": "2022-04-29T16:51:40.000Z",
          "Titre": "Quote from email on 4/19/22 was for…",
          "Contenu": "Quote from email on 4/19/22 was for 300.00 plus tax. Invoice came and it was350.00 plus tax. Not sure what the extra 50.00 was for?Primera had a price increase but they honored the quote for 300.00 issue resolved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim McBreen",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T18:38:00.000Z",
          "Titre": "We received the parts in a timely…",
          "Contenu": "We received the parts in a timely manner. Thank you. We are a packaging equipment company and are reselling the parts a part of a repair on a AP362.We did not want to pay tax since it was for re-sale. Also no resellers discount?This is the part we are unhappy with. Person that we ordered parts from on the phone was saying Primera does not deal with resale.How do we get set up to sell your parts. We sell many brand label applicators and would like to add your product line to ours."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tucker Noyes",
          "Nb_Reviews": 2,
          "Date": "2020-06-11T20:12:20.000Z",
          "Titre": "Great Tech Support, Bad Product",
          "Contenu": "Customer service was polite and helpful despite restrictive company policies.  The product itself is fraught with issues and the money we thought we would save with printing labels ourself was generally wasted in misprints and bad alignment.  Additionally our production was constantly interrupted by device failures and having to send the printers back for repair (even with having two of them)."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "VIvian H.",
          "Nb_Reviews": 1,
          "Date": "2020-02-13T00:31:09.000Z",
          "Titre": "The products have been okay :/",
          "Contenu": "This is not the first time we received the labels without perforation. I know the rolls of 3\" x 2\" Extreme Matte BOPP, 750/roll, 2\" core SKU: 075891 has them, so it's annoying to know we keep getting the ones that doesn't have it. These labels aren't cheap, and knowing the quality is not what I signed up for is disappointing. However, I do appreciate the on-timed delivery."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John M",
          "Nb_Reviews": 1,
          "Date": "2020-01-29T19:11:41.000Z",
          "Titre": "The Customer Service Agents are great...",
          "Contenu": "The Customer Service Agents and Tech Support are great. They have always been very helpful. The cost of replacement parts, ouch... If they buy the drives in bulk, they probably pay $50. Then they have a little time flashing in their custom firmware, then they charge $250 for a drive that I have been through 4 of over the life of my Duplicator."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phil Pelletier",
          "Nb_Reviews": 1,
          "Date": "2020-12-03T02:20:35.000Z",
          "Titre": "Looks used not like new",
          "Contenu": "We were very excited to receive our AP360 refurbished and was a little disappointed when we took it out of the box and the first thing we notice is that the foot peddle is dirty and the rubber pad on the bottom is pealing away.They were great to respond promptly and replace the peddle. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "rob metz",
          "Nb_Reviews": 1,
          "Date": "2018-12-04T15:36:19.000Z",
          "Titre": "ordering supplies",
          "Contenu": "when ordering supplies such as ink cartridges and labels, I have to click thru the supplies and then click on the model I need the supplies for then I can get to the supplies I need. The problem is when I need to order 3 different ink cartridges, after each one I have to repeat all the steps to get back to the supplies for the model I have.  Maybe I am doing something wrong but it seems very cumbersome."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Phoenix Labels & Graphics Inc.",
          "Nb_Reviews": 1,
          "Date": "2018-12-03T20:36:01.000Z",
          "Titre": "EXREMEMLY POOR CUSTOMER SERVICE FOLLOW UP …",
          "Contenu": "placed any order and received a response, confirming that someone would be in touch my us and nothing happened for over a week until I called back asking what was the hold up with my order. Then I found out the hold up was the fact that we pay with credit card and are not on terms ; which should not have mattered. Someone should have called for the information on the card and kept things moving forward. KNOW ONE DID"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Terry Boiselle",
          "Nb_Reviews": 1,
          "Date": "2020-10-30T05:16:21.000Z",
          "Titre": "AP360 Unit Review",
          "Contenu": "The AP360 labeling unit we got us great, but it doesn't fit some of our rolls, for others it has to be set up higher on lifts due to the size, and then finally the used stock roll gets sucked back into the labeler causing it to jam and apply several labels uhh until the unit is shut off."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2019-05-27T19:20:26.000Z",
          "Titre": "I ordered a replacement power supply…",
          "Contenu": "I ordered a replacement power supply for Bravo Series 4100 Disc Publisher from Primera. It came with no instructions. Tech support was kind enough to send me the service manual that had instructions for replacing everything BUT the power supply. I tried to replace the power supply but must have done something wrong. Unit still doesn't work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Joel",
          "Nb_Reviews": 1,
          "Date": "2018-03-01T15:21:19.000Z",
          "Titre": "Quality Supplier",
          "Contenu": "The products are acceptable and I have always been able to get support when I need it. I don't like that I can't get payment terms and order with a purchase order. This makes Primera one of the most cumbersome suppliers I have to deal with. It requires internet orders and credit card payment in addition to purchase orders in my system. If they were easier to order from I would rate them higher."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gayle",
          "Nb_Reviews": 1,
          "Date": "2018-05-21T19:19:19.000Z",
          "Titre": "The machine sometimes gives me…",
          "Contenu": "The machine sometimes gives me problems. I have the Primera 500 series. I wish they had perforated labels for less. It would be nice to print a bunch of labels at a time. I put several label names in at a time and they drop in to a box. Then I have to sort them out. You have to figure out the ideosyncrasies of the machine. Otherwise, you will have problems. Well, I did."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Carl Lekavich",
          "Nb_Reviews": 1,
          "Date": "2018-09-09T17:17:00.000Z",
          "Titre": "I have been in business for over 50…",
          "Contenu": "I have been in business for over 50 years and have never packaged aproduct that can be easily damaged in a bubble envelope. These kind of products need to be in a box. The money you save isn't worth it if the product gets damaged like the last ink cartridge your Company sent me.I like Primera products just don't like some of the company policies."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "NtzPrinter",
          "Nb_Reviews": 3,
          "Date": "2018-04-16T19:44:05.000Z",
          "Titre": "After adding an item to the cart",
          "Contenu": "After adding an item to the cart, the website does not return to the page you were on before thus requiring you to click back thru the whole products, ink listing, etc. to get back to the next ink to be added to the cart. In other words, when you click \"continue shopping\" the last page you were looking at does not come up. This forces you to click thru a bunch of stuff just to get back to what you were trying to order."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Candy",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T20:48:19.000Z",
          "Titre": "Their printer works great",
          "Contenu": "Their printer works great.  We have had many problems with ink cartridges, and labels skip - lots of waste.  Fast shipping is not an option.  I got a defected ink cartridge from here in the middle of the holidays. They could not get me a replacement overnight or even two days, I ordered one on  Amazon and got it overnight.  Customer service is ok and very text book."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "janey",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T20:31:21.000Z",
          "Titre": "Its okay",
          "Contenu": "Its okay. But it does require a LOT of cleaning (nearly) each time before printing. So there is a lot of time wasted and a lot of money wasted on ink, printing tests and trying to clean it. Guess it is nature of ink jets but for the almost $2500 I paid for the printer I guess it should have been laser printer so it wouldn't have that issue? Just my two cents."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jana",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T16:10:14.000Z",
          "Titre": "The labels we have been purchasing for…",
          "Contenu": "The labels we have been purchasing for the past 5+ years have just doubled in price. It was hard enough for all of us to get through the pandemic. Small businesses that actually made it will be put out of business by people that push pricing through the roof."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2018-03-07T19:12:25.000Z",
          "Titre": "Overall decent product, more costly than advertised to operate",
          "Contenu": "Overall I'm satisfied with the print quality, it works just as you'd expect.The ink cartridges are expensive, they can't be refilled, and they don't seem to be actually empty when the printer says that they can't be used anymore.I feel like I'm not getting a good value for the high cost of the ink.The number of labels ruined by misprints or printing errors is far too high and also cuts in to the overall value of the experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "brenda white",
          "Nb_Reviews": 7,
          "Date": "2021-10-11T23:45:52.000Z",
          "Titre": "This is my 2nd reminder asking me for a…",
          "Contenu": "This is my 2nd reminder asking me for a review of my Eddie machine. But I have not received it as of yet, because I am waiting on a coaster machine. I will have to notify my sales rep to see how many coaster orders they have. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rhonda",
          "Nb_Reviews": 1,
          "Date": "2020-02-19T21:14:18.000Z",
          "Titre": "We paid over 3,000 dollars for this…",
          "Contenu": "We paid over 3,000 dollars for this printer to replace our old Primera printer that stopped working. I took about 5 days for this printer to consistently actually work correctly after multiple calls to tech support. We did not do anything differently to get it to start working consistently as we have had this model before and know what we are doing. It works fine now but it was pretty disappointing and frustrating to have to deal with this after spending so much money on this printer. Fingers crossed it continues to work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-07T00:56:09.000Z",
          "Titre": "The Primera web site is poor.",
          "Contenu": "The Primera Bravo is a good product.  The web site is not. It took nearly half an hour to order a color print cartridge. The cartridge was not easy to find.  Checking out was a long and tedious process. I kept being interrupted by someone trying to chat with with me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Albi",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T21:11:42.000Z",
          "Titre": "Ink and labels can sometimes cause misprints",
          "Contenu": "I have been experiencing some issues both with ink and labels.  The black ink cartridge is only lasting down to 25% thereby not printing the labels correctly and  creating waste and expense. Also, some of the labels stick to the roll causing misprints. I have contacted customer support regarding the ink cartridge, they have replaced a couple free of charge but lately their response has been to clean the spongy part with alcohol. I did not contact about the sticky labels."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2018-02-21T20:31:38.000Z",
          "Titre": "Ink Is Way To Expensive...",
          "Contenu": "Ink Is Way To Expensive If You Are Using This To Make Money It Isn't Worth It. Also The Print Quality Is Ok Could Be Better. You Can See Lines Where The Ink Was Printed And When I Use A CIS Printer There Is 0 Lines And Perfect Quality, Also CIS Is Wayyyyyy Cheaper On Ink. So Its Common Sense Why I'm Selling My Primera Now!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customerKevin Arthur Cleveland",
          "Nb_Reviews": 2,
          "Date": "2019-05-02T02:04:11.000Z",
          "Titre": "A refurbished portable printer is…",
          "Contenu": "A refurbished portable printer is usually sold the same things it would come with new including a battery. I had to buy the battery separately and discovered that it did not have a battery when it showed up. You should have at least mentioned that it did not come with the battery so I could order one in advance and have a working unit when it got here. I do not know if it is any good because without the battery I cannot test it, so you can understand though I like it generally I am not impressed with your site"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-10T20:50:31.000Z",
          "Titre": "For Bravo 4201 Disc Publisher.",
          "Contenu": "For Bravo 4201 Disc Publisher.The reasons for an average rating is do to the proprietary nature of the device. I don't have a problem with most of it. It is mainly the fact that if you order a unit that has one drive and there is a slot available for a second, you should be able add a second drive. My other issue is that it only works with specific drives why not get the customer the option to purchase your awesome printer, but get there own drive. Overall the product works great and support is great."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sally Stott",
          "Nb_Reviews": 1,
          "Date": "2022-07-21T22:53:09.000Z",
          "Titre": "Your customer service is lacking",
          "Contenu": "Your customer service is lacking. They never reach back out after a problem, I just assume or have to to reach out to you. Your label rolls cut short for printing and there is still an inch left on roll, but they read as empty so I can't use the complete roll. This has happened three times now. Some rolls have tape and have been repaired in the middle of a roll. Last time I called to report a cartridge that would not work, I felt like the man I spoke with was giving me the third degree. I sent it back to you with label you emailed me.  I had to call over a week later to see if you received and were going to send me a replacement out.  When I called they had not sent a replacement, so if I had not called would you have not sent a replacement?Your pop up on website, I had tried to use once when placing an order, they told me to do it on line and not through the pop-up.  Don't have it there then."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jaime Zubia",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T18:15:37.000Z",
          "Titre": "I like the products the only thing i…",
          "Contenu": "I like the products the only thing i dislike is when the roll has about 10 labels left it says to change the roll even when it still has labels. I have lost over a roll now with how much i print. It is the LX900"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tracey Schaertl",
          "Nb_Reviews": 2,
          "Date": "2022-06-08T18:28:29.000Z",
          "Titre": "This review is of the ordering process…",
          "Contenu": "This review is of the ordering process only.  The chat feature was useful to address some of my questions, but I'm still curious about how the cookie is held in place during the printing process.  When I ordered, there was inconsistency on whether you had the inventory - the cart image didn't show it was in the cart, so I kept clicking to move forward with the purchase...I was in previously on another day also...  When I finally advanced, the cart showed 3 :)!  It said one would be delayed.  I reduced it to 1 printer and checked out.  After submission, I got the backorder message in email.  You do have a message on the front, but different messaging on the actual order screens.  I was hopeful it would be here before I leave town, now I don't know.  I think the web order screens / cart need to be reviewed.  Hope this helps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Zack",
          "Nb_Reviews": 1,
          "Date": "2021-02-26T17:34:02.000Z",
          "Titre": "Great fast turn around time",
          "Contenu": "Great fast turn around time on my sent in unit and helpful online tech support. Unfortunately, my issue has still not been resolved. My Bravo 4150 had a power failure and was sent in for a power supply replacement. However, it came back with a new drive that did not work for Dual Layer DVD burning (That's about 90% of my business). They immediately sent out a new replacement drive but, it too, is having issues. It's just frustrating that I sent it in fully functional minus a power supply and get it back with a replaced power supply but now can't perform any of the DVD burning functions that worked fine before."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Clinton",
          "Nb_Reviews": 2,
          "Date": "2019-03-25T00:32:05.000Z",
          "Titre": "Im sure we will love this printer",
          "Contenu": "Im sure we will love this printer, however when the first one arrived and yes I said first one because I had to send the first one back because it was received broken. You couldn't see the damage because it was internal. Returning it was bothersome enough but if I wanted a rapid return I had to give them a $1000 dollar hold on my debit card. Wasn't my fault it was received broken but it cost me another $1000 hold for over a week till they got the broken one back. But we got the replacement within a couple days and it does work. I just hate receiving anything broken."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Mead",
          "Nb_Reviews": 3,
          "Date": "2018-04-24T21:05:43.000Z",
          "Titre": "The color 500 image printed is…",
          "Contenu": "The color 500 image printed is excellent, but beware the ink dries out on the print head after a day or so of non use and requires extracting and wiping with alcohol in order to try to clear.The phone support was prompt and informative but curt and not particularly friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dick",
          "Nb_Reviews": 1,
          "Date": "2018-02-22T12:21:06.000Z",
          "Titre": "Replacement Parts inventory",
          "Contenu": "When calling in for repair parts the option to get refurb. parts is great, but when you are out of stock on the refurb. part there is no referral to buy the new parts that are in stock.  Overall the tech. department is very knowledgeable and answered all other question."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "DG",
          "Nb_Reviews": 1,
          "Date": "2019-10-01T15:31:41.000Z",
          "Titre": "The Lx500 has a piece of rubber plastic…",
          "Contenu": "The Lx500 has a piece of rubber plastic they call a wiper then wears out very fast and you cannot print finished labels without it working properly. You end up wasting labels and ink because of poor quality of printed labels. Primera needs to fix this constant problem with this wiper. Also the ink for this machine is outrageously priced at $50-60. There are no cheaper versions to purchase so you are trapped into buying this ink at the price they set. They also never give any promos or discounts on ink at any time. It is a very large money maker for them probably more then the printer itself over the life of the unit."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-12T22:13:18.000Z",
          "Titre": "Tech Support hustled to get repair don, BUT",
          "Contenu": "Tech Support hustled to get repair done quickly, which was great.  Upon receipt, a vital part was missing--Tech Support found it, but then it took another week for its delivery, thereby wiping out all the good value from the initial early turnaround"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-18T20:02:07.000Z",
          "Titre": "Sent our printer in for repair",
          "Contenu": "Sent our printer in for repair. Called a number of times on the condition of repair but no response. I believe that customers should have a detail report of what is fixed during a repair. For the reason that a customer may avoid future repairs if necessary."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HN",
          "Nb_Reviews": 6,
          "Date": "2018-02-26T01:12:09.000Z",
          "Titre": "They used to be excellent-now I'm switching to Kiaro",
          "Contenu": "Their chat support is excellent whereas their phone support is mainly handled by rude people who do the bare minimum to assist. To make matters worse, they have discontinued printers...like the LX900, even though the purchase came with a lifetime service warranty, they have \"discontinued\" all support for the main components....It's a lawsuit waiting to happen.I love the ease of the printer and its components, and used to love everything about this company except the phone support, but with all the new changes that help the company and hurt their customers, my next printer purchase will be a Kiaro."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Deb Henrickson",
          "Nb_Reviews": 1,
          "Date": "2021-10-29T21:32:41.000Z",
          "Titre": "The customer service over the phone was…",
          "Contenu": "The customer service over the phone was wonderful,  delivery was expected on one day and it took a couple days after that because my machine ended up in a different state  but that was probably due to the delivery service,  The guy I got for the free one hour was not very helpful he talked fast he seemed irritated when I would ask him questions he ran through things so fast and would not explain a whole lot and I told him I was not computer savvy at all and to be patient and explain,  my daughter was even with me and she could not keep up with him we gave up and stopped taking Notes because he was going way too fast and he was sighing a few times like I was bothering him, So I’ve been trying to learn on my own but there’s so many things I cannot figure out ☹️☹️☹️☹️"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Robert Lawrence",
          "Nb_Reviews": 1,
          "Date": "2020-10-02T22:34:09.000Z",
          "Titre": "Website riddled with problems creating…",
          "Contenu": "Website riddled with problems creating accounts and ordering materials (shipping vs billing address was totally confusing as the buttons switched back and forth so both were always the same when attempting to enter a shipping addesss, buttons below should be removed as they don't work.   Figured out  you have to ignore this and add a new address that they allows you to assign it to a billing or shipping  address and this works.spend some money to getting your  online orders working properly, many would have given up and just bought from Amazon that was actually cheaper by $300 than your website, but the lead time was one additional week and I needed it here quicker than 3 weeks.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Elsa L",
          "Nb_Reviews": 2,
          "Date": "2021-06-16T17:05:18.000Z",
          "Titre": "I RECEIVED THE PRINTER BUT IT DID NOT…",
          "Contenu": "I RECEIVED THE PRINTER BUT IT DID NOT RECOGNIZED THE CARTRIDGE AT FIRST, I TRIED SEVERAL INTENTS, PHONE CALLS AND FINALLY I GOT IT TO WORK, BUT NOW IT SEEMS I NEED TO PURCHASE AN EXTRA PROGRAM TO USE MY PRINTER TO THE FULLEST, THIS WAS NEVER MENTIONED TO ME BY THE SALES DEPARTMENT AND I FEEL THAT IS A DOWN SIDE OF THE COMPANY. ALSO I WAS SUGGESTED TO BUY THE MATTE PAPER FOR A BETTER WATER RESISTANT RESULT IN PRINTING BUT AGAIN THIS IS NOT THE PAPER I NEEDED FOR MY JUICE LABELS, I NEEDED SATIN OR GLOSS INSTEAD. AN OVERAL AVERAGE EXPERIENCE IS WHAT I GOT IN TERMS OF GETTING STARTED THE PRINTER AND NOT WELL INFORMED OF EXTRA INVESTMENT of 150.00 TO MAXIMIZE THE USE OF THE PRINTER, AND THE WRONG PAPER I NEEDED TO GET MY LABELS GOING..."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Janet Lemons",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T23:50:35.000Z",
          "Titre": "Have had issues since 1st received",
          "Contenu": "Have had issues since 1st received - think that you should have someone to walk you through install and explain everything to you the 1st time.Still trying to figure it all out - tech support is very helpful though"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Raymond Watson",
          "Nb_Reviews": 1,
          "Date": "2020-02-07T21:22:10.000Z",
          "Titre": "Wasting labels",
          "Contenu": "Its Horrible that 15-18 labels at the end of the roll don't get used every time. Plus every time you turn the printer on/off it will skip and waste 3 more labels. Over time that is a TON of UNNECCESARY waste."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Eddie Owner",
          "Nb_Reviews": 1,
          "Date": "2021-12-02T21:56:07.000Z",
          "Titre": "Exciting day for such a big purchase",
          "Contenu": "Exciting day for such a big purchase! I only wish the customer service representatives were a little more kind and understanding. World class customer service goes a long way!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Aquil",
          "Nb_Reviews": 3,
          "Date": "2018-07-07T15:46:15.000Z",
          "Titre": "For Primera to be such  a major…",
          "Contenu": "For Primera to be such  a major supplier in the printer market I would think you would have one of the best fulfillment centers. Your delivery times are prohibitive to us who use your machines. Labels ,supplies ETC......"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Average Joe",
          "Nb_Reviews": 1,
          "Date": "2019-01-10T12:42:17.000Z",
          "Titre": "LX2000",
          "Contenu": "Lx2000 nice printer with the exception that printing in color is very very slow.  In this industry 1000’s of Labels are crazy at once and when it takes multiple hours that becomes an issue. Maybe it’s time to upgrade"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Baila Vorhand",
          "Nb_Reviews": 5,
          "Date": "2022-05-03T00:59:03.000Z",
          "Titre": "I actually would like to thank you for…",
          "Contenu": "I actually would like to thank you for your efficient and professional service. You serviced my machine and it came back it good working order thanx"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "David Andersen",
          "Nb_Reviews": 1,
          "Date": "2020-08-28T20:46:40.000Z",
          "Titre": "I've used them for a number years and…",
          "Contenu": "I've used them for a number years and ever time there is one glitch or other, it usually takes several tries to get an order placed.  Annoying on a Friday afternoon late when you want to get out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T01:32:07.000Z",
          "Titre": "We have been trying to connect…",
          "Contenu": "We have been trying to connect personally with a rep and have a ticket number, but I finally just went online to purchase, and the website is a little tricky to navigate (i/e having a different billing and shipping address took me in a big circle). I may not be the most tech savvy person so have a little extra patience to figure things out, but would have preferred just dealing with a person. Figured it out and made the purchase, overall not a big deal. I did like that I could look at the cart while checking out without navigating to a different page and restarting the process. This is the 2nd AP 362 we are buying, the first  one is on the fritz and hopefully with a new backup in good shape we can get the first one in good working order again!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mr.Rankin",
          "Nb_Reviews": 1,
          "Date": "2018-05-21T19:03:24.000Z",
          "Titre": "only holds 20 cd's",
          "Contenu": "The ordering process was fine,no problems there.But I'm just not satisfied with the Bravo se-3.I purchased it to replace my Bravo II printer/burner.The quantity that the new machine holds is the only problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "HN",
          "Nb_Reviews": 6,
          "Date": "2021-05-06T18:45:30.000Z",
          "Titre": "You should reward your customers with…",
          "Contenu": "You should reward your customers with discounts on labels, ink instead of ONLY new printers. it's disrespectful and I'm looking at other options. I'm tired of your set up!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guy",
          "Nb_Reviews": 2,
          "Date": "2020-06-18T14:14:24.000Z",
          "Titre": "Online support not that great",
          "Contenu": "Online support not that great.  When the printer works, it works, when you get a label jam, be prepared to spend an hour trying to get it out, then sending printer back to Primera for repair."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-05-21T13:13:07.000Z",
          "Titre": "No instructions provided",
          "Contenu": "No instructions provided. The part was well-priced, easy to order, and shipped promptly, but no instructions were available anywhere on exactly how to remove the broken part and install the new one."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2022-02-23T05:48:00.000Z",
          "Titre": "site still not easy to navigate",
          "Contenu": "site still not easy to navigate, and the printer cartridges I order do not seem to last a long time and they dry out quickly.  I wish they worked longer"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dick Silva",
          "Nb_Reviews": 2,
          "Date": "2022-06-06T18:04:41.000Z",
          "Titre": "Ordering custom labels online is…",
          "Contenu": "Ordering custom labels online is tedious and interface is somewhat unclear. No provision for re-ordering a previously ordered item."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-04-05T14:47:11.000Z",
          "Titre": "NEW WEB SITE IS MORE DIFFICULT TO FIND…",
          "Contenu": "NEW WEB SITE IS MORE DIFFICULT TO FIND WHERE TO PURCHASE REFILLS FOR LABELS.  COULD NOT LOCATE BOX TO IMPUT PART NUMBER .  HAD TO SCROLL ALL THE WAY TO BOTTOM TO FIND FINNALLY ORDERING SUPPLIES TAB.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dick Silva",
          "Nb_Reviews": 2,
          "Date": "2022-07-20T01:41:41.000Z",
          "Titre": "Oversll a great store",
          "Contenu": "Oversll a great store. Checkout procedure had a button that did not wok. Had to call them to complete tha sale."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "SCOTT",
          "Nb_Reviews": 1,
          "Date": "2018-02-28T22:06:06.000Z",
          "Titre": "Good communication - bad terms.",
          "Contenu": "Good communication, but ordering can be difficult due to minimum yearly spend to qualify for terms. Therefore, credit cards must be used if your company falls below that threshold."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2019-09-13T14:14:59.000Z",
          "Titre": "Costly Non Repair",
          "Contenu": "While the person I chatted with made several attempts to solve my problem, the suggestion then was to return my unit for repairs.  After $ 450.00 to Primera and another $ 65.85 to ship the unit, they returned the unit with a new print head.  The unit worked and had been returned with ink cartridges that they had installed.  I then tried my original black ink cartridge again.  I got the same \"ink cartridge not installed properly\" message.  After a couple times back and forth with their replacement and my original cartridge, the real problem was evident.  My ink cartridge (yes, it's an original Primera cartridge and not an aftermarket one) was the problem all along.  I would think they woud have had similar problems in the past and could have suggested the source of the problem, thus saving me close to $ 500.00."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Edgar Escalante Sánchez",
          "Nb_Reviews": 2,
          "Date": "2022-06-21T06:40:41.000Z",
          "Titre": "Custom Label Size Service",
          "Contenu": "The service of ordering customed size and material labels should be available to any country ! Why only USA ?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Guyetri",
          "Nb_Reviews": 2,
          "Date": "2019-02-20T18:41:31.000Z",
          "Titre": "The machine doesn't perform properly…",
          "Contenu": "The machine doesn't perform properly all the time You have to setup frequently.it is tedious job.you loose production and Labels. That increase the cost."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Happy enough",
          "Nb_Reviews": 2,
          "Date": "2018-02-21T22:53:38.000Z",
          "Titre": "Niche product that is not as good as the purchase price would suggest",
          "Contenu": "I have had multiple Primera products over the years. Their products are mostly in a niche that no other company is competing with. This means, in part, that they are not motivated to have their products work as smoothly, or with the refinement, that one might normally expect. It also seems likely that their sales quantity is lower than would be normal for most other equipment. All this seems to result in a less refined product at a higher price, but if you need this kind of product you don't have much other choice. My biggest issues are inconsistent technical support when problems arise, glitchy and/or under-refined printer drivers and/or application software, high cost of expendables, high purchase prices, and the fact that they don't make their own print engines and are thus at the mercy of the print engine manufacturer when it comes to availability and price of ink."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Justin Taylor",
          "Nb_Reviews": 2,
          "Date": "2020-01-03T17:33:45.000Z",
          "Titre": "Customer service/tech issues",
          "Contenu": "Customer service/tech issues. Purcashes have been fine, but I still keep getting into hiccups with returns and getting help in customer service aspect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Ames",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T18:34:38.000Z",
          "Titre": "I needed an ink cartridge overnight",
          "Contenu": "I needed an ink cartridge overnight, and the web site indicated that if I ordered by a 2pm, that it would ship same day...a Saturday. Great! I thought...except it didn't ship until Monday. Gotta fix that weekend verbiage."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Karns",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T23:00:39.000Z",
          "Titre": "It would have been a 5-star review…but",
          "Contenu": "It would have been a 5-star review had it not been for one experience with tech support. My initial experience was great and they pointed me in the direction I needed. Once I purchased my product, there were technical issues and using the chat tech support the website suggested was infuriating. The person was of NO help, simply telling me to keep reading the manual. My faith in them was renewed when my frustrations were addressed by a supervisor and followed up with a second round of help with a phone number and person talking through the issues. They were able to connect through my computer and took the time needed to correct the issue."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David McBurney",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T14:33:35.000Z",
          "Titre": "Payment options need revision",
          "Contenu": "The repair process is fairly easy. Payment options need to be revised. Many companies prefer to use purchase orders. In our case, we had to put the payment on a personal credit card to get our repair done and then ask for re-imbursement."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DENNISA MOORE",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:44:08.000Z",
          "Titre": "Customer Service needs improvement",
          "Contenu": "Have bought labels and ink for many years.  In the past customer service has been great but my past order I made a mistake and ordered the wrong size labels.  Reached out through chat and was told to send an email.  I sent an email on two different occasions to see if I could send the product back and just get a refund or store credit for future use and have not received any responses which is disappointing. It was my mistake ordering the wrong size so I can not be upset with them for that but not responding to a customer even if they were not able to accept the return is my complaint.UPDATE: After seeing this review I was notified that they assume the emails went to their spam folder and then created a ticket and sent a return label for those items to be sent back.  I would suggest maybe the spam folder to be checked if you are not seeing customer emails.  Regardless the situation is resolved."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Annette Conrad",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T18:58:47.000Z",
          "Titre": "High Quality Printing Technology & Excellent Support",
          "Contenu": "High quality product.  Timely delivery.  EXCELLENT support.  Leon, our FREE training Guide was fantastic.  Knowledgeable and answered all our questions.  Having past experience with edible printers and Photoshop, Leon curated his training to meet our needs.  Easy set up!  We were printing within 30 minutes of set up!  Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Stanton",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T15:30:11.000Z",
          "Titre": "Ink issues",
          "Contenu": "We've been using Primera ink with our Bravo printer for many years and it's been fine. Our duplicator/printer is an older model, the Bravo se. Recently I noticed we were getting fewer disks printed per cartridge. Primera was quick to respond to my inquiries and after several emails, we discovered we were using an old style ink cartridge (the 53332) that does indeed have less ink in it. At Primera's urging, we switched to the 53334 cartridge and now we get significantly more disks printed per cartridge. Primera even sent me a free sample and a new \"wiper\" to help clean cartridges."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T17:41:13.000Z",
          "Titre": "I’m still learning how to use the Eddie…",
          "Contenu": "I’m still learning how to use the Eddie printer, but so far it’s great. I’m pretty much teaching myself through YouTube videos. They offer a training session with the purchase of the printer but my trainer was terrible. He RUSHED through the steps (absolutely making it impossible to write anything down) and spent the remaining time pushing me to buy third party accessories. The machine itself is great, but the training session with useless."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wejeep12",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T01:39:52.000Z",
          "Titre": "Primera Tech's are AWESOME",
          "Contenu": "Overall, the customer service is amazing and helpful.  There was only one time where it was questionable and that was when someone put in very little effort resolving a problem that I had less that 24 hrs before which was quickly resolved the previous time. That unhelpful person told me I would need to send in my machine.  I ended up fixing the problem myself.  BUT - again, the customer service tech helper people are AMAZING and so helpful - especially in a pinch!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Stephen Emond",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T16:33:13.000Z",
          "Titre": "The delivery is quick and what we…",
          "Contenu": "The delivery is quick and what we receive is always what we ordered!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mushroom Guy 🍄",
          "Nb_Reviews": 2,
          "Date": "2023-01-16T08:13:33.000Z",
          "Titre": "Lx610 is fantastic",
          "Contenu": "Lx610 arrived on time and undamaged. Had it up and printing contour cut stickers quick. Had a small issue with printing but it was my error. I'm loving it and hopeful to get some wholesale customers. I'd recommend more choices for material life holographic Rolls!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 5,
          "Date": "2023-10-13T21:39:40.000Z",
          "Titre": "The website would not process my order…",
          "Contenu": "The website would not process my order for some reason. I tried many times. That is why 4 stars. The customer service chat got it done for me though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Young Lee",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T17:59:11.000Z",
          "Titre": "We tried to get to refurbished one",
          "Contenu": "We tried to get to refurbished one. It took us a few steps to locate it.We had difficulty getting help to find the directions to center the labelling process."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Monique Boucher",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T15:19:37.000Z",
          "Titre": "Real people - The best",
          "Contenu": "I appreciate talking to real people in the chat instead of a robot.  The staff answered all my questions and my product arrived super fast."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barb .",
          "Nb_Reviews": 1,
          "Date": "2023-08-27T22:51:36.000Z",
          "Titre": "Website organization",
          "Contenu": "Website organized in a way that made it easy to find what I was looking for.  Visually appealing and easy to locate products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "james Harrison",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T18:22:36.000Z",
          "Titre": "Ordering",
          "Contenu": "Had a little trouble understanding the person that took my order.Another lady came on the phone and got everything straight. I was ordering a replacement part."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bethany Ranno",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T00:45:35.000Z",
          "Titre": "Excellent service",
          "Contenu": "I purchased a printer that didn't fully meet my needs.  Customer service helped me order the right printer and allowed me to return the original printer."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tiffany Feger",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T00:03:22.000Z",
          "Titre": "Feedback on primera photo printer and…",
          "Contenu": "I bought the primera photo printer and bought the additional part so I can tint right from my photo phone wirelessly without a laptop. I think if it had instructions it would be way better. The printer says stop, hook up to a computer first. So it is contradictory info. I YouTubed it and it still is not perfect. How will I know when my ink is low? And it does not print as quickly as advertised. There is a big pause between printing. It is better than the cheap small air printer for sure, but for the cost, it should be turn key easy. Plus it did not come with paper or ink. I mean I bought that and refills, but it should honestly have a starter checklist or something. So to improve: getting started what to buy if printing from computer or phone. And a way to talk to the phone to check ink levels or thst the paper is loose. The paper comes loose and it prints anyway!!! I have to open it and it happened mid printing without moving it too. I hear the printer going bit no prints!!! Also, please sell an inexpensive carrying case for it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mushroom Guy 🍄",
          "Nb_Reviews": 2,
          "Date": "2023-04-03T03:20:06.000Z",
          "Titre": "good experience!",
          "Contenu": "Always have a good experience with Primera. TEC support is great and thus far have had a good experience with customers service.  Highly recommend 😁"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michelle Alameda",
          "Nb_Reviews": 3,
          "Date": "2023-04-30T19:10:51.000Z",
          "Titre": "Your website makes it easy to reorder",
          "Contenu": "Your website makes it easy to reorder, but the shipments have not been as timely as they used to be. I am now waiting a week for delivery when it used to be 3-4 days. Other than that, everything is great!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "SL",
          "Nb_Reviews": 4,
          "Date": "2022-10-31T16:36:05.000Z",
          "Titre": "Great company to work with",
          "Contenu": "I find Primera an excellent company to work with. They have products in stock, and ship quickly. Thank you for being efficient and reliable."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dan Impieri",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T19:04:54.000Z",
          "Titre": "i would like to see the setting up the…",
          "Contenu": "i would like to see the setting up the repair was more streamlined and less time consuming. The repair was very quick (thank you) ."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Muhammad Waqas",
          "Nb_Reviews": 3,
          "Date": "2023-06-24T12:53:13.000Z",
          "Titre": "listening to customers a top priority…loyalty",
          "Contenu": "listening to customers a top priority across the business.Management is good and overall work easier than other platforms"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stacey Pryor",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T18:19:07.000Z",
          "Titre": "I have had a great experience with…",
          "Contenu": "I have had a great experience with using the Eddy but never received my free hour demonstration."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Loren Elks",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T20:40:45.000Z",
          "Titre": "Good information on what I needed to…",
          "Contenu": "Good information on what I needed to fix the IP 60 printer issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Hall",
          "Nb_Reviews": 5,
          "Date": "2022-11-16T16:57:12.000Z",
          "Titre": "No issues is good",
          "Contenu": "It is just good when there are not issues to complicate ones day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Kinner",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T13:39:30.000Z",
          "Titre": "Website",
          "Contenu": "I bought it from your website at your regular price."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eric Elfman",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:03:34.000Z",
          "Titre": "No Comment at this time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RRrFff",
          "Nb_Reviews": 1,
          "Date": "2022-10-27T21:24:31.000Z",
          "Titre": "Not getting usable results with dvd-r’s",
          "Contenu": "I am changing my review to 4 stars because Primera reached out and sent me new dvds overnight, however they are still printing very grainy, splotchy, and with a lot of ink on the surface which comes off on my fingers. I cannot use the dvds and will go back to Verbatim inkjet printable a which are half the cost and have always worked fine. I’m bummed that these didn’t work out and I have to now wait for the Verbatims to arrive to finish my project, but I appreciate Patrick and others reaching out to me and trying to make it right. The first person I spoke to, Kim, just kept saying I have the settings wrong etc and I didn’t really appreciate how they were corresponding with me, but Patrick and others have been great. My primera se-3 is awesome, will just use Verbatim discs from here on out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roman Laczkovich",
          "Nb_Reviews": 8,
          "Date": "2022-10-08T14:49:04.000Z",
          "Titre": "super fast turnaround…",
          "Contenu": "I appreciate the super fast turnaround time. Only the $300 charge is a bit hefty. I paid $15 for shipping. I cannot imagine it cost more for returning the printer. This is $285 for checking a paper sensor error that occurred after updating firmware."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "saadallah abu abu",
          "Nb_Reviews": 6,
          "Date": "2023-02-27T05:40:36.000Z",
          "Titre": "quailty",
          "Contenu": "perfect company, 1st quality, fair prices"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kerri",
          "Nb_Reviews": 3,
          "Date": "2023-09-19T17:10:38.000Z",
          "Titre": "Wonderfully knowledgable company to…",
          "Contenu": "Wonderfully knowledgable company to work with !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2023-03-27T15:36:46.000Z",
          "Titre": "helpful",
          "Contenu": "helpful, had what I needed and I ordered.  As an addendum.. I arrived quickly"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2022-08-21T22:52:44.000Z",
          "Titre": "High Print Quality, Some Mechanical Issues",
          "Contenu": "In general the printer works well. There are some mechanical/controls problems with ours and causes the print head to slam all the way to the right, then you have to hit several buttons for it to keep printing. Sometimes the feeder arm goes back too far into the printer and gets stuck. The print quality is great and easy to upload designs.  We are concerned for the price with the glitches that this printer will last our small business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Matisha Chambers",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T16:56:01.000Z",
          "Titre": "It is always easy to order what I need…",
          "Contenu": "It is always easy to order what I need because I have an account.  But I have to order custom labels since the ones I used to order have been discontinued and it will not allow me to just reorder my previous order.  I have to go in and select all the details every time I order.  It is just a nuisance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck Price",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T17:44:20.000Z",
          "Titre": "It would be nice to have some coupons…",
          "Contenu": "It would be nice to have some coupons to save on orders once in a"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Buyer in Florida",
          "Nb_Reviews": 1,
          "Date": "2022-06-24T14:49:33.000Z",
          "Titre": "Update: They are resolving the printer issues quickly",
          "Contenu": "Update/Edit:So afterward, they contacted me to resolve the issue I was encountering. They sent me the printer part that is believed to be the issue with the printer. Changing the part did not solve the issue, but the rep (Mark) allowed to take the printer for repair at no charge. Good customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Hall",
          "Nb_Reviews": 5,
          "Date": "2022-05-18T13:54:57.000Z",
          "Titre": "I have to be honest",
          "Contenu": "I have to be honest.  I have ordered several things from Primera this month and I am not sure which purchase this review is asking about.  But, for the most part, I like and trust Primera and its products.  You guys screwed up a custom label order but you are fixing it.  As long Primera continues to find a place to \"fit\" within Browne Trading co, they will be used.  thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JPECHA",
          "Nb_Reviews": 1,
          "Date": "2022-06-09T07:08:07.000Z",
          "Titre": "Great printer, except.....",
          "Contenu": "The printer itself, and the tech support we received, are excellent. The really cool function is the die cut feature. The reason we didn't give the 5th star was the software that came with the package we bought. I thought I was opening a Windows 98 program. It's clunky and, at times, difficult to navigate. That being said, I've managed to work with it enough to figure things out, but it took a lot of extra time in my busy schedule that I wish that I didn't have to. Overall, it's a great product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jerry Rezny",
          "Nb_Reviews": 5,
          "Date": "2022-07-19T05:20:59.000Z",
          "Titre": "They handled it quite well",
          "Contenu": "They handled it quite well. They promised to ship new printer overnight on Monday but shipped it ground on Wednesday. I am happy it’s finally here but lost some business for getting it late. Nobody called me to warn about the change in delivery."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Harrison",
          "Nb_Reviews": 2,
          "Date": "2022-09-07T19:10:39.000Z",
          "Titre": "Update your youtube page with more…",
          "Contenu": "Update your youtube page with more helpful hints when working with the LX3000. Most of your videos are for older models and it would help seeing the actual machine im working on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Debra Schuett",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T01:44:36.000Z",
          "Titre": "Eddie Review",
          "Contenu": "Training went ok but was hard to understand his voice.  Could have been our phone connection.  I was having trouble installing bartender but he logged into my computer and got the job done.  Thank you!  I am loving my Eddie so far.  Lots more to learn in Bartender ❤️Highly recommend this product!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vincent Lombardo",
          "Nb_Reviews": 3,
          "Date": "2022-07-22T13:38:33.000Z",
          "Titre": "repairs are always done well",
          "Contenu": "repairs are always done well The only downside of primera is there is no support and if the printer needs mechanical repairs, you need to send it to them but with a quick turnaround not so bad. Very reliable printer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Blake Haffner",
          "Nb_Reviews": 1,
          "Date": "2022-04-08T22:25:10.000Z",
          "Titre": "Quality and dependable, but… not cheap.",
          "Contenu": "Quality dependable equipment and supplies. The price per label is comparable to buying rolls it would be nice if it actually saved $ printing in house. Ultimately there is little cost savings per label however you can print whatever labels you need when you need them.Savings come into effect on short run prints and avoiding MOQ on rolls for new products or seasonal products. The website interface could use a face lift.Client sign in and user dashboard, drop down menu could use an update for ease of use on mobil devices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Varela",
          "Nb_Reviews": 1,
          "Date": "2022-03-16T20:54:34.000Z",
          "Titre": "First Time Purchase",
          "Contenu": "Customer service is wonderful. As many questions asked and answered except for one. My order stayed on backorder status even though the representative stated it would ship in a couple of days. Maybe it’s the system not updating properly. Other than the system miss-communication, so far a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jefferson Pyatt",
          "Nb_Reviews": 1,
          "Date": "2022-02-05T23:10:44.000Z",
          "Titre": "I found my experience with dealing…",
          "Contenu": "I found my experience with dealing Primera Associates was very productive and I received my machine as soon as it was available. I'm looking forward to more future business through Primera in the future and I thank you for your professionalism. If it is all it all possible could you possibly send to my address some address stickers so as I might send a machine to be refurbished. Thank you very much and have a very good day.Jeff Pyatt owner/ operator, rattle on records c e o."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tamara Conroy",
          "Nb_Reviews": 2,
          "Date": "2021-12-08T14:49:56.000Z",
          "Titre": "I was hoping to get my LX800 printer…",
          "Contenu": "I was hoping to get my LX800 printer fixed to continue using, but it is no longer being serviced, so I had to buy another Primera. I now have an LX900 and am happy with it. I had several questions while setting it up, and the customer service thru live chat was a nice option. They were helpful and I was able to get it up and running."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura C Cerow",
          "Nb_Reviews": 1,
          "Date": "2022-02-10T23:23:13.000Z",
          "Titre": "The person who assisted me was very…",
          "Contenu": "The person who assisted me was very helpful.  But I wouldn't even need help if you would post online what dies you already have for custom label printing.  I also wish there were more options in non-custom labels for my LX500.  I love my LX500 by the way!  Perfect for my small business."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liam McDonald",
          "Nb_Reviews": 1,
          "Date": "2021-10-13T14:14:53.000Z",
          "Titre": "Great product and service",
          "Contenu": "The AP360 is a great product that has helped us immensely in streamlining our process and delivering a better looking crowler to our customers. After a year and a half of fairly heavy use one of the roller motors gave out. Customer service was extremely helpful in setting up a service ticket and walking us through purchasing a new machine. The new machine arrived very quickly, and the old one was fixed in a matter of days! Highly recommend!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "brenda white",
          "Nb_Reviews": 7,
          "Date": "2022-06-01T03:24:05.000Z",
          "Titre": "i called bc eddie was acting up",
          "Contenu": "i called bc eddie was acting up. not fully printing a cookie and stopping midstream. after the call with tech, eddie continues to do the same thing. i had to finish cookies this weekend by drawing by hand to complete pictures"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "chris woodland",
          "Nb_Reviews": 4,
          "Date": "2021-12-13T15:25:11.000Z",
          "Titre": "Pleasurable experience",
          "Contenu": "Great company thus far,  support is some of the best around.  Very helpful each time I’ve needed them the 1st few weeks.  Some issues haven’t been addressed to my satisfaction thus far but it’s a work in progress for sure.  Overall,  very happy with my experience dealing with primera.  Highly recommended"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jason Kane",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T20:06:09.000Z",
          "Titre": "Support slow this time, but everything works",
          "Contenu": "I experienced some delays with my support ticket, but they did respond eventually and matters have since been resolved.Primera supplies good equipment (although ink cartridges sometimes clog), and have in the past had good support.  They are honest, and hopefully in the future support will come easier."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Christine Botella",
          "Nb_Reviews": 1,
          "Date": "2021-07-27T17:54:08.000Z",
          "Titre": "As a canadian customer",
          "Contenu": "As a canadian customer, I need to use the website to place my order. I had to redo it numerous time to get through, this i why I am giving only 4 stars. On the other hand, I had the assistance of the sales teams on the chat and they are very helpfull, well trained, polite and quick. The search engine is very well done and efficient. I would have give them 6 stars if the option was available. Thanks in particular Kelli and Kate."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eileen",
          "Nb_Reviews": 2,
          "Date": "2021-07-05T17:18:33.000Z",
          "Titre": "The site was fairly easy to maneuver!",
          "Contenu": "The site was fairly easy to maneuver!! Right up front the site tells you the lag time for delivery is 4-6 weeks, so this should be again stated in delivery options. If I pay overnight delivery am I REALLY going to get it tomorrow if they are running 4-6 weeks behind?  It shouldn’t even be an option. Second, my billing and shipping address are NOT the same but every time I tried to change one the other would automatically change. Little annoying glitches.  The rest of the site was great"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chris",
          "Nb_Reviews": 4,
          "Date": "2021-05-29T14:06:42.000Z",
          "Titre": "A little Clunky",
          "Contenu": "I had to create an account to order. Then I logged out, then logged back in to place another order and it would not let me. Why?When placing my order I have a different billing and shipping address. To get it to work I had to type both in several times. I am not confident the info will be saved correctly for my next order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Lebow",
          "Nb_Reviews": 6,
          "Date": "2022-03-28T14:54:30.000Z",
          "Titre": "I love the concept of printing directly…",
          "Contenu": "I love the concept of printing directly onto my cookies.  There was a steep learning curve, many misprints which, hopefully have been remedied by the recent update.  Customer service is the best!  Friendly, knowlegable and patient."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Rourke",
          "Nb_Reviews": 2,
          "Date": "2020-12-15T14:24:52.000Z",
          "Titre": "Easy enough to set",
          "Contenu": "Easy enough to set up with the included instruction manual. Only running single (front) labels right now, but will eventually be adding a second (back) label. Much quicker than hand labeling. Only issue is that there is one corner of the label that does not get pressed on, but a simple swipe of the hand over the label as the bottle is put in its case solves the problem. Will play with the settings some more to see if I can fix it in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Harold Kociba",
          "Nb_Reviews": 3,
          "Date": "2020-10-26T18:21:18.000Z",
          "Titre": "The website is not the easiest to…",
          "Contenu": "The website is not the easiest to navigate.  Could be set up a little different, example.. I am purchasing dye based ink, did a search and the pigment based printhead came up when I searched for printhead. I had it in my cart and remembered that there were options.  Should have been first option.  It did not come up until I retyped in printhead"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "tootoolz2",
          "Nb_Reviews": 2,
          "Date": "2021-03-16T17:59:36.000Z",
          "Titre": "Good reliable printers, I'm on my second one in 7 years.",
          "Contenu": "My trusty LX400 label printer died yesterday and a rep reached out to me via the chat feature. She told me that I could get a credit for my old printer towards a new one, which will be here Friday. A new printer was a big hit for a small business like mine, but was necessary. These are good reliable printers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vee Graphics",
          "Nb_Reviews": 1,
          "Date": "2020-06-15T18:47:05.000Z",
          "Titre": "I needed immediate feedback",
          "Contenu": "I needed immediate feedback. Went to the support page and obediently filled out the \"Submit a ticket\" tech support form. In the past, this method has worked quickly to reach an actual human, but not so this time. The day wore on... eventually I gave in to impatience and used the live chat box support. Was able to get the problem sorted on the spot! RE: talking -vs- live chat: Why no 800 number?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A. Tee Migliori",
          "Nb_Reviews": 1,
          "Date": "2020-05-06T18:54:41.000Z",
          "Titre": "I have issues with a company that can…",
          "Contenu": "I have issues with a company that can decide who their real customers are. Drop shipping to a reseller’s customer With Primera part #, address, telephone# splashed all over their product is unethical. For a 10% discount on the first order to ADC, they now have paid a small price for a live lead.Previous ADC Buyers let that happen, but no longer!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Benoit Sicotte",
          "Nb_Reviews": 1,
          "Date": "2021-07-29T11:54:36.000Z",
          "Titre": "It took me open an account to pay an…",
          "Contenu": "It took me open an account to pay an RMA to find out that I could not lay on your web site because I am in Canada and ended up call your office.  it would have been nice to let me know up front payment from Canada cannot be done online and I would have called right away."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2019-11-11T19:37:54.000Z",
          "Titre": "Third Times A Charm",
          "Contenu": "I was a little disappointed in the quality of the product. I had to swap out a brand new printer twice before I received a third one that worked properly. However, the company was very good at getting replacements sent out in a timely manner.  My assumption is that they had a bad run of printers. I guess that  can happen to any company.  Once I received a good printer, it worked perfectly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Roylene Clare",
          "Nb_Reviews": 6,
          "Date": "2021-08-20T20:15:17.000Z",
          "Titre": "Difficult",
          "Contenu": "I am finding it difficult to do, since I am not computer literate, but I will still continue to try.  Your assistance employees are top notch.  They try to explain in laymans terms how to do things.  When I am doing very simple pictures they are great.  Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "R.D.",
          "Nb_Reviews": 2,
          "Date": "2019-09-18T17:18:48.000Z",
          "Titre": "Nice printer but website lacks product help and support.",
          "Contenu": "Had troubles initially setting this printer up.  Customer support was helpful but I would like if they had more tech support information right on their website.  It's not always convenient to have to chat, call or wait for a reply email - would much rather just go to a support section and get the info I need to start using this printer and the BarTender software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave Sheldon",
          "Nb_Reviews": 2,
          "Date": "2020-03-17T13:27:49.000Z",
          "Titre": "Though I think everyone's toner…",
          "Contenu": "Though I think everyone's toner cartridges are way over-priced, it would be an economical option if Primera offered a 3-color package (i.e. without the black) so that a little money can be saved. I find on my labels black doesn't run out as fast, so for me to keep purchasing the 4 packs only leads to stock-piled black toner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "William Daugherty",
          "Nb_Reviews": 2,
          "Date": "2020-08-07T17:01:25.000Z",
          "Titre": "Package arrived 4 days late.",
          "Contenu": "My package was suppose to be delivered  Monday. FedEx said I wasn't home and I was. They said it would be delivered Tuesday. It wasn't delivered Tuesday. They said it would be delivered Wednesday and it wasn't delivered. I called FedEx twice and both times after speaking to them I was disconnected."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-08-20T01:22:34.000Z",
          "Titre": "I ordered a printhead for a 4100…",
          "Contenu": "I ordered a printhead for a 4100 Autoprinter. It worked well. I gave 4 stars because I ordered one in the past that didn't work at all and I couldn't get a replacement. I will never forget that experience. I continue to order from here just because it's easier and I only had that one poor experience. Not enough to write them off completely. I've used them a lot over the years and for the most part it's been a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Countdown",
          "Nb_Reviews": 2,
          "Date": "2020-01-30T20:49:10.000Z",
          "Titre": "Easy to deal with mostly",
          "Contenu": "Easy to deal with mostly. SE-3 AutoPrinter worked right out of the box, instructions were clear, installation was a snap on my MacPro. Calibration was confusing as some instruction like “align printer” button should be pressed, but there wasn’t a button with that name so I clicked on two of the buttons. There was a slight bit of skipping on the smaller font, not bad, just didn’t notice that on the older Bravo. Overall would use this company and am content with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eduardo Mauro",
          "Nb_Reviews": 6,
          "Date": "2022-04-12T18:21:55.000Z",
          "Titre": "We had some problems trying to pay the…",
          "Contenu": "We had some problems trying to pay the P/O yesterday. We don't know the reason for it, but it was in the Primera.com page link. Today we were able to place, pay and sent the P/O for our items. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andy Smith",
          "Nb_Reviews": 2,
          "Date": "2020-05-12T17:32:31.000Z",
          "Titre": "The order arrived on time",
          "Contenu": "The order arrived on time. These are obviously crazy prices for simple paper labels and ink, but if they are able to get it, I guess it's the free market. On the other hand, when a product become too expensive, the customer starts to search for alternate solutions e.g. farming the jobs out to production printers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Michael Sweet",
          "Nb_Reviews": 1,
          "Date": "2022-02-07T14:32:49.000Z",
          "Titre": "This review is for the Eddie",
          "Contenu": "This review is for the Eddie, Edible printer. It is an amazing machine and once you read the manual,  do the training and learn to use it it's awesome! There's so much you can do with it. The only reason for the 4 (and not 5) star review is it is glitchy.  It may stop partway through a print. It is not something you can set and walk away from. I have yet to call customer service because I have figured it out on my own - which usually consists of pressing the load or pause buttons or turn it off and back on again. I hear customer service is responsive and very good!We do find the Eddie a wonderful addition to our business and would consider purchasing another one!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jon Peterson",
          "Nb_Reviews": 1,
          "Date": "2021-12-21T20:17:26.000Z",
          "Titre": "Customer Service was excellent however",
          "Contenu": "Customer Service was excellent however, the product came with frustrations.  After about a month of troubleshooting my wife feels more confident in using it.  It has not been a smooth process although the customer service was 5 star."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Carter",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T00:31:45.000Z",
          "Titre": "The Little engine that Could",
          "Contenu": "Overall, leaning toward 5-stars. However, the printers are very finicky and can be very frustrating to fine tune. Rolls are a little higher than competitors (paper companies, BOPP, etc.) but they're always good quality. I'd certainly recommend Primera products still."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "AlbertInc",
          "Nb_Reviews": 1,
          "Date": "2019-08-15T19:10:27.000Z",
          "Titre": "Great labels, fast delivery",
          "Contenu": "I've used these labels for years. I get the 4x6 gloss labels. They used to be perforated all the time, but they took that away saying they were getting jams on machines. We never had any jamming and now have to do a special order to get the same labels at an additional cost. If it wasn't for that I'd given it 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tyler Backus",
          "Nb_Reviews": 1,
          "Date": "2021-03-08T17:26:59.000Z",
          "Titre": "Service process was easy and efficient",
          "Contenu": "Service process was easy and efficient. I do wish that they would be able to ship us out an appropriate sized box and proper packaging, especially for the cost of repair. Never-the-less, we shipped it out of here with a bunch of bubble wrap, and it must of arrived safe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ANN Raresheid",
          "Nb_Reviews": 3,
          "Date": "2020-09-15T03:28:51.000Z",
          "Titre": "Nice help on CHAT",
          "Contenu": "I used the chat option a couple of times before ordering and everyone was very helpful. My only complaint? While placing my order, it would not let me get past the address line because I do not have a second address line... so I had to use my street address twice.  Hope it gets here ok!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Yu",
          "Nb_Reviews": 1,
          "Date": "2020-05-13T16:36:25.000Z",
          "Titre": "The warranty stuff is kind of…",
          "Contenu": "The warranty stuff is kind of confusing. No instruction on how to get it matched with the printer we just bought so had to go through emails to ask, quite a few emails. The label printer is awesome and the quality is good. Like the pro software very easy to use. Overall is a good experience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nancy Kroneberger",
          "Nb_Reviews": 1,
          "Date": "2021-08-13T21:17:54.000Z",
          "Titre": "Foam Roller",
          "Contenu": "The product that I ordered came in a timely fashion and was in great condition. My only complaint was that I needed two rollers as they sit side-by-side on my machine, and I did not see anywhere on the description that they were sold singly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Conor Martin",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T23:11:29.000Z",
          "Titre": "Only reason its a 4 star and not 5 is…",
          "Contenu": "Only reason its a 4 star and not 5 is because when I clicked on \"Buy more ink\" on the printers software it brought me to a 404 page and I had to manually find the ink. Not the end of the world just wanted to bring that to you attention! Cheers."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "George Mackenzie",
          "Nb_Reviews": 3,
          "Date": "2021-02-02T23:44:07.000Z",
          "Titre": "great service",
          "Contenu": "Great service very helpful, efficient and patient. I saw on the internet first time buyers were entitled to a saving of 10% if purchase on-line if they enter code SAVE10. Sales person and web site did not make this option available. I was disappointed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Al",
          "Nb_Reviews": 7,
          "Date": "2021-02-17T00:36:13.000Z",
          "Titre": "way to go to provide updates",
          "Contenu": "it was difficult finding my product since it has been updated with new ones... but it was great the company reached out with an explanation which I appreciated.I like a responsible response company and will continue to use their great products."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MARGIT",
          "Nb_Reviews": 5,
          "Date": "2021-04-13T16:56:28.000Z",
          "Titre": "Have always had good luck and very…",
          "Contenu": "Have always had good luck and very satisfied.  However, when cut off is at 2 p.m. and I order at 1;45 and schedule and pay for next day shipping, it takes 2 days to get here.  Order is not packaged that same day.This has happened twice"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emanate Essentials",
          "Nb_Reviews": 1,
          "Date": "2019-08-13T21:24:42.000Z",
          "Titre": "HUGE purchase for me but....",
          "Contenu": "HUGE purchase for me, I bit the bullet and bought the LX500 I have to say finally my labels match the quality of my products. I have leveled up, my clients love the look, I am getting more inquiries for wholesale, and advertising requests! I am so glad I took a chance, I already see it paying off. The LX500 works fine with great with Adobe Illustrator and my Macbook Pro, with an usb adapter of course. Karen in sales- went above and beyond for me!  Any issues I have had I was able to iron out with Primera support. I only wish support was 24/7!!! Thank you Primera!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-12-19T13:35:20.000Z",
          "Titre": "I like the out of warranty repair…",
          "Contenu": "I like the out of warranty repair option.  However, shipping the unit back was rather complicated as we didn't have the original packaging so luckily we had a location shipping company to assist.  Repairs were performed quickly and the unit returned in a timely manner."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lauren",
          "Nb_Reviews": 2,
          "Date": "2021-08-27T00:21:47.000Z",
          "Titre": "The ordering process is very glitchy",
          "Contenu": "The ordering process is very glitchy. When you're in your cart and you need to make edits, it's very slow and doesn't always save changes. This has been happening ever since I've ordered from PRIMERA."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HN",
          "Nb_Reviews": 6,
          "Date": "2021-08-11T22:15:40.000Z",
          "Titre": "Most Primera CS people are wonderful except.....",
          "Contenu": "Most CS people are wonderful at Primera. When I get Janiel, I normally hang up or disconnect the chat since he seems to prefer to drag out the correction process rather than jumping in to assist a busy office environment. Today I tried to work with Janiel. Wasted time! It would have been better to disconnect the chat and start fresh with someone who is actually interested in delivering customer service. We keep a copy of his chats and tape them to the wall near our Primera printers as a reminder for all staff that when they get Janiel, hang up or disconnect and get someone else! To be fair to the rest of the kind team at Primera, I will give a 4 star but for Janiel, I would give a zero."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron Tremblay",
          "Nb_Reviews": 2,
          "Date": "2020-07-17T15:25:03.000Z",
          "Titre": "The Primera products we are purchasing…",
          "Contenu": "The Primera products we are purchasing are for resale to our customers.  Our quotes to our customers and operating cost promotions are based on our costs.  The inkjet cartridge prices on our order were 27% more than the quoted prices."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kevin Frisch",
          "Nb_Reviews": 1,
          "Date": "2020-05-25T15:42:02.000Z",
          "Titre": "Fast shipping.",
          "Contenu": "Web platform was clean and easy to navigate. Shipping time was fast. Shipping prices were relatively low for next-day priority. Would have been 5 stars if the customer service team had been a little bit more knowledgeable about product."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JD",
          "Nb_Reviews": 1,
          "Date": "2021-06-23T15:50:37.000Z",
          "Titre": "Everything has always been pretty…",
          "Contenu": "Everything has always been pretty smooth, but Primera should add a tab on the actual product of the printer paper and ink that is supported by it.  Seems more difficult to get to the paper we need for the LX500c."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kim Mesa",
          "Nb_Reviews": 1,
          "Date": "2021-02-08T22:27:14.000Z",
          "Titre": "I wasn’t able to check out on the site",
          "Contenu": "I wasn’t able to check out on the site. The billing and shipping addresses are different, and I indicated it as such, and was unable to complete my purchase. I spent over 20 minutes on this. When I checked the box that both addresses were the same (they are not), I was able to check out, and complete my purchase. Please correct this. This is not the first time that I’ve had trouble on your site.UPDATED REVIEW:Thank you for your response. I’ve ordered from the site since my last review. I’ve been able to check out by just checking the box, indicating that the shipping and billing addresses are the same. I won’t fault the company, since this is an issue that they can’t control."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laura Dickinson",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T17:13:12.000Z",
          "Titre": "I love the print cartridges but they do…",
          "Contenu": "I love the print cartridges but they do not last very long once they are put in the machine.  We don't reproduce DVD's as often as we used to and I wind up throwing the cartridges away even though they show full on the system."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randy Eaton",
          "Nb_Reviews": 1,
          "Date": "2019-03-05T17:48:13.000Z",
          "Titre": "some direction",
          "Contenu": "It would’ve been a five star rating if there would’ve been some direction on how to line up the postcard material as I wasted about 15 postcards getting the correct line up so it would print on each post card and not bleed over to the next"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "CMK",
          "Nb_Reviews": 1,
          "Date": "2021-01-09T02:01:09.000Z",
          "Titre": "Took me a few tries to navigate the…",
          "Contenu": "Took me a few tries to navigate the site but lo and behold managed to place my order after accidentally deleting and then not being able to find my items. Felt a tad challenged but in the end mission accomplished."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BA",
          "Nb_Reviews": 1,
          "Date": "2021-10-23T14:25:02.000Z",
          "Titre": "Communication Issues",
          "Contenu": "Ordering was easy, however no one notified us to let us know that our card was declined due to fraud. We received a shipping notification with tracking and finally had to call to see why the printer hadn’t moved. Come to find out it was still sitting at Primera. After speaking with customer service, we completed our charge, the printer was shipped and received within 3 days. 2 days later however, we received an email from customer service that they needed a new card number to run through because the first one was declined. I politely emailed back to let them know we had already received our printer and it was already being used.I know communication can fail sometimes but I feel this could be better. We are loving our Eddie and are pleased with the purchase!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Burst Electronics Inc",
          "Nb_Reviews": 1,
          "Date": "2019-02-08T21:51:07.000Z",
          "Titre": "Bravo number 4",
          "Contenu": "This my 4th Bravo disc publisher. All have been very good work horses. My only issue with the new SE3 is that even when powered down, there are two blue LEDs that continue to shine. One bright and steady, the other bright and flashing."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Betty Brown Friend",
          "Nb_Reviews": 3,
          "Date": "2022-05-06T18:21:29.000Z",
          "Titre": "I love their label printer and the ink…",
          "Contenu": "I love their label printer and the ink works great, however, I do not think over $10 in shipping is necessary for one little 2 1/4\" x 1/2\" cartridge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Tom Peterson",
          "Nb_Reviews": 1,
          "Date": "2022-04-10T13:17:44.000Z",
          "Titre": "Products are delivered quickly and…",
          "Contenu": "Products are delivered quickly and accurately.  The quality of the ink cartridges is not great. I have received several that are dried up or have very low yields."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Forest Mushrooms, Inc.",
          "Nb_Reviews": 1,
          "Date": "2019-03-15T17:12:02.000Z",
          "Titre": "We had some issues with the software…",
          "Contenu": "We had some issues with the software not loading correctly and it took a couple of hours on the phone to get it resolved, but the service on that issue was good too, and once it was resolved, the product works very well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Woodward",
          "Nb_Reviews": 1,
          "Date": "2020-02-27T22:58:18.000Z",
          "Titre": "When the printer arrived",
          "Contenu": "When the printer arrived, the power cord was not included, but after emailing Primera, they were prompt in apologizing and FedExing a power cord. The unit had a new print head unit, but it would have been helpful to have a page of diagram instructions. I forgot that the carriage assembly had to be popped open before the print head could be inserted. Then the PTPublisher would not recognize the repaired printer even after rebooting the computer and changing cables. An email to tech support was answered by phone soon and, after eventually getting the remote control application to work, tech support cleared the problem. But the instructions that solved the connection problem could have been included on an instruction page..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CliniSys Associates.",
          "Nb_Reviews": 2,
          "Date": "2020-01-02T14:38:52.000Z",
          "Titre": "pleasant experience",
          "Contenu": "My experience with the rep was very pleasant. However, I took a star away because I shouldn't have had to call in the first place. I understand that kinks are still being worked out on the website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tonie Breeding",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:08:37.000Z",
          "Titre": "Lots of help!!!!",
          "Contenu": "All the information that you’ve given me, as well as how to get started with different programs. The videos to help get started are so helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Grangruth",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T23:49:07.000Z",
          "Titre": "Excellent Service",
          "Contenu": "When I placed my order, it was processed and shipped extremely quickly! I also received communication on how to access the manual and links to training videos in advance, which is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg Mann",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T06:54:14.000Z",
          "Titre": "Pat my sales person was great I had…",
          "Contenu": "Pat my sales person was great I had trouble with PayPal and he helped me through the whole buying process Thank you Pat S!!👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenene Heyer",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T21:25:14.000Z",
          "Titre": "Fast shipping and expert customer service.",
          "Contenu": "Primera has always been an incredible business to work with. Their customer support team is extremely knowledgeable and when I’m out of cartridges and order early enough in the day they literally send out a shipment notice within minutes. Their products have grown my company over the last three years. Thank you Primera!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie P",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T18:11:12.000Z",
          "Titre": "My virtual training went very well",
          "Contenu": "My virtual training went very well. I appreciate my trainer's patience and knowledge of the product and it's functions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele Singer",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T14:24:56.000Z",
          "Titre": "The best!",
          "Contenu": "The tech was helpful, explained everything so I can understand it and was patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Hodges",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T17:42:44.000Z",
          "Titre": "The best I have experienced",
          "Contenu": "The best I have experienced!  Spent an hour with me on the phone trying to trouble shoot my machine.  After running test and determining the machine need technical repair they made it easy to send in and effortless on payment and return.  6 stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy Ricks",
          "Nb_Reviews": 5,
          "Date": "2023-12-06T19:38:17.000Z",
          "Titre": "Reasons for 5 stars:Impressive Service!",
          "Contenu": "Reasons for 5 stars:*quickly connected with a tech service person*He was very knowledgeable about my problem* Very patient and easy to understand his instructions* Spent over an hour walking me through the steps to    rectify my issue* Super impressive support department!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Floyd",
          "Nb_Reviews": 4,
          "Date": "2023-12-09T19:08:40.000Z",
          "Titre": "Needed Labels",
          "Contenu": "Needed to order labels but the one I need is not a normal stock item. A custom label takes too much time but the Sales Chat advised two preferred vendors where I could get them. So, I ordered stock labels from Primera as cheaper and the others I needed from their preferred vendor. All good."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jeff Pelletier",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T19:54:44.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, speedy shipping!We were replacing an existing Primera Disk Publisher that was put through its paces and was ready for retirement. The new one arrived very quickly and the service throughout was fantastic.Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyn with Happy Day Creations",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T15:06:36.000Z",
          "Titre": "As a small business owner",
          "Contenu": "As a small business owner, we rely on and appreciate our suppliers and vendors who support us with equipment setup,  maintenance and troubleshooting issues. Primera's technical team has been outstanding in thier level of service; knowledge of our printer's features, functions and processes. The Facebook group is responsive and shares useful information about specific industry issues and solutions. Primera attends and participates in industry events offering participants an opportunity to see their equipment in action and meet/speak to company representatives. We saved up to purchase our Eddie printer and it is one of the best decisions we've ever made.  Having Eddie is almost like having an employee.... without the payroll increase! No vacation or sick days, lunch breaks or holiday time off for Eddie! Everyone here at Happy Day Creations loves our Eddie printer and the Primera team for helping us achieve our sales goals and keeping our customers happy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Howell",
          "Nb_Reviews": 6,
          "Date": "2023-12-13T19:08:17.000Z",
          "Titre": "Kelli is amazing and is the best…",
          "Contenu": "Kelli is amazing and is the best Customer Service Rep EVER !!  We've been working with her for 4 years now and we love her !! She is the BEST !!The Cajun Turkey CompanyBilly Howell"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Boyle",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:13:13.000Z",
          "Titre": "Real Service Not Typical Automation",
          "Contenu": "I think customer service with this company is great because they have people handling business. Automated systems are the downfall of exceptional customer connections. The expectation of todays service is to wait on hold, and talk to an automated voice. Primera doesn't do this to customers and this is a reason for success."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles Watson",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T11:57:30.000Z",
          "Titre": "FAST AND EASY ORDERING",
          "Contenu": "FAST AND EASY ORDERING, PROMPT SHIPPING."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Powers",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T02:19:37.000Z",
          "Titre": "I love my Eddie so much",
          "Contenu": "I love my Eddie so much. Thank you so much for helping this cookier’s life so much easier.🤗"
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "Daniela Vallone",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:43:25.000Z",
          "Titre": "The purchasing process was very easy",
          "Contenu": "The purchasing process was very easy. Pat guided me through the entire process, because it was an international purchase. He answered all my questions clearly and quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mackenzie Hamm",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T18:53:33.000Z",
          "Titre": "Customer service is always great at…",
          "Contenu": "Customer service is always great at helping out and explaining things so we can understand it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Holtz",
          "Nb_Reviews": 2,
          "Date": "2023-11-20T17:47:17.000Z",
          "Titre": "What a fantastic devise!!! We love it. Its even better than we had hoped.",
          "Contenu": "We were a little apprehensive about spending such a large sum of money on a device that will mainly be used for charitable activities. After the first printed cookie, we knew we made the right choice. What a fantastic printer. My wife loves it and has requests coming in already."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LBB",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T21:33:08.000Z",
          "Titre": "Primera has the best customer service and Shipping",
          "Contenu": "The customer service and quick shipping is beyond perfection! I deal with a lot of businesses with all the products that I purchase! What I have experienced with Primera so far, is Vastly different from all other manufacturers I deal with....if they could all be like Primera!  Thank you for being the BEST!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Durbin",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T16:28:27.000Z",
          "Titre": "Ordered Ink Cartridges -",
          "Contenu": "Ordered Ink Cartridges - always before they have been shipped in a box - this time they were shipped in an envelope - one of the three was smashed when they arrived. When Primera found out they are going to replace the damaged cartridge - outstanding customer service,"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naomi Reed",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:52:46.000Z",
          "Titre": "Customer service is top notch",
          "Contenu": "When we first received our printer, we were in the midst of starting our business....many moving parts to navigate - all of it unfamiliar.  As I was having trouble with labels, I called the help desk and they were able to walk me through what I needed to know  and gave me helpful tips to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Davis",
          "Nb_Reviews": 4,
          "Date": "2023-12-11T03:58:58.000Z",
          "Titre": "Such a great company",
          "Contenu": "Such a great company. Always so friendly and immediate response on any issue."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T22:39:08.000Z",
          "Titre": "David and Kate - Sales",
          "Contenu": "Between both David and Kate they did what it took to be able to get my order through!  Both were very helpful and it is so appreciated!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy Elmore",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:00:21.000Z",
          "Titre": "The purchasing experience was good",
          "Contenu": "The purchasing experience was good.  I have tried my Eddie Printer and now I know why I need an hour lesson with one of your technicians!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maxx Leekley",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T20:19:07.000Z",
          "Titre": "Helpful staff",
          "Contenu": "Each staff member who helped me was super kind and patient with me. It took a long time but their help and advice was very helpful. My only downside is having to purchase a new piece before sending the defective one"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Phavady Singvilay",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T21:47:07.000Z",
          "Titre": "Customer service is great and very…",
          "Contenu": "Customer service is great and very helpful. I went on the chat with customer service to ask questions, before and after I purchased the printer and got the answers to all. Also, with one on one training, highly recommended, Leon, the trainer was very helpful. During the training, there was an earthquake at where he was, but he returned with a calm manner and resumed with the training. He explained and covered all the basic of everything of how to operate the printer. I only have Eddie printer for about three weeks and am loving it. Still have a lot to learn, but he has been a great help with my cookie decoration. He makes certain job a whole lot easier and faster. If you have any question, get on the chat or call, customer service representatives are very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Medina",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:30:15.000Z",
          "Titre": "The online ordering was easy",
          "Contenu": "The online ordering was easy. Liked the custom labelformat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Winkleman",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T18:10:46.000Z",
          "Titre": "Had a great experience working with…",
          "Contenu": "Had a great experience working with Chas! He made me feel my business needs were important and help me find the best solution for my process and budget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Bulcroft",
          "Nb_Reviews": 4,
          "Date": "2023-11-16T02:03:47.000Z",
          "Titre": "My printer fan was installed improperly…",
          "Contenu": "My printer fan was installed improperly and causing frequent intervention from Primera Technicians. After several years, I shipped it to Primera for diagnostics. The repair costs were waved after I requested assistance from the RMA supervisor. To reimburse the shipping expense, I received ink cartridges at no cost.A fair and acceptable reimbursement. Everyone including Patrick Timmins was pleasant and most satisfactory!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bren",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T16:21:00.000Z",
          "Titre": "Chat help was EXCELLENT Ambar saved…",
          "Contenu": "Chat help was EXCELLENT Ambar saved your sale!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy J",
          "Nb_Reviews": 6,
          "Date": "2023-11-05T18:54:09.000Z",
          "Titre": "Customer service is fantastic!",
          "Contenu": "I asked for some details about the label printers as well as available label sizes before making my purchase. I received a very thorough and helpful email response that really helped me to feel comfortable making such a large purchase and believing I will be able to make it work for my needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T18:04:23.000Z",
          "Titre": "After 5000 cookies printed",
          "Contenu": "After two years we began expierencing platform feed obstruction errors. We contacted customer support and determined a repair was necessary.  Sent it in and had it returned looking brand new in just seven days.  It also came back with a new print cartridge!  Great job, very pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "sundy b keichel",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T14:53:40.000Z",
          "Titre": "Broken gear",
          "Contenu": "I had to return my printer due to a gear breaking during normal operation. It was fixed and returned promptly and I have had no other issues so far. Very expensive to ship, but it was still within the 1-year warranty for the repair. It was returned with a full ink cartridge which offset the shipping cost."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle Schwab",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T19:02:45.000Z",
          "Titre": "Excellent service!",
          "Contenu": "We ran out of ink during a huge project. My husband called and ordered some to be delivered the next morning. The representative also gave him some tips on how to make our ink last longer. We called back later in the day to order another cartridge and they canceled the original order and added the second with no additional shipping charges. Excellent customer service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tere Walsh",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T06:20:44.000Z",
          "Titre": "Received a \"cartridge unknown\" message…",
          "Contenu": "Received a \"cartridge unknown\" message on my Eddie cookie printer when icing lodged under the cartridge. The rep was very helpful with a couple of troubleshooting suggestions. When neither helped resolve the problem he thought it might be a cartridge problem so he said he would send out a complimentary cartridge on Monday which I received promptly on Tuesday. I was very pleased with the courtesy, efficiency promptness of the customer service rep. After putting in the new cartridge the problem was resolved. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Floyd",
          "Nb_Reviews": 4,
          "Date": "2023-10-08T20:30:17.000Z",
          "Titre": "Best Customer Support",
          "Contenu": "Needed ink for an older model (LX810) that we use for backup and it was shipped right away which helps us avoid delays in our business. We appreciate Primera's attention to urgency and customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda C.",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T17:44:28.000Z",
          "Titre": "Excellent Customer Service!",
          "Contenu": "I had called to place an order, then realized 15 minutes later that I ordered the wrong quantity.  I called back and it had already gone to shipping (fast!); however, the customer service rep reached out to them to see if it could be changed, and they did.  Very grateful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Helen",
          "Nb_Reviews": 5,
          "Date": "2023-09-25T18:11:49.000Z",
          "Titre": "They are super fast",
          "Contenu": "They are always so prompt!  Placed my order and within 10 minutes I had received my Confirmation/Invoice Copy/Notification that my product had shipped.  I have never had any trouble with any orders and they have always had a fast turn around.  Which is super great when you sometimes get told at the last minute that an item is needed to keep the production line rolling."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sharlena Height",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T15:32:50.000Z",
          "Titre": "I  have NEVER dealt with a company …",
          "Contenu": "I  have NEVER dealt with a company  that has invested  so much time into their  customers. The customer  support  agent that  helped me stayed on the phone until my printer was working in top condition. He even took control  of my laptop to troubleshoot  shoot problem till it was right. It was a user error and no fault  with the printer but just the fact that he made sure everything  was right assured me that my purchase  was worth it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald Walker",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T20:31:51.000Z",
          "Titre": "Printer is printing perfectly again",
          "Contenu": "Printer is printing perfectly again.  Did need to find contact for door closed as it had cracked off during shipping I guess.  I just bypassed it so the printer works with the door opened or closed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:04:10.000Z",
          "Titre": "Speedy delivery",
          "Contenu": "I ordered an ink cartridge for my Eddie printer and it arrived much faster than I expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberta Standen",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T05:06:54.000Z",
          "Titre": "I preferred new ink for the Eddie & it…",
          "Contenu": "I preferred new ink for the Eddie & it arrived quickly!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Jansie Bruwer",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:40:33.000Z",
          "Titre": "The process of ordering was easy",
          "Contenu": "The process of ordering was easy. Had a few hassles with the courier in South Africa. Seems it is not so easy ordering from abroad.  I must say David Arcand with all his patience went out of his way to accommodate my requests to meet the courier service requirements."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T17:30:15.000Z",
          "Titre": "The customer service rep sent me a very…",
          "Contenu": "The customer service rep sent me a very detailed report on how many labels/size a tonor cartridge could print.  This was excellent information."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hoop2125",
          "Nb_Reviews": 5,
          "Date": "2023-09-03T15:29:12.000Z",
          "Titre": "We bought some used Primera machines",
          "Contenu": "We bought some used Primera machines. When I called in seeking support, I totally figured I would be paying for support. We were not, and support spent hours with us, setting these machines up and teaching us how they work. Their website has tons of written documentation, for these machines. I have yet to get a NO answer to any of my questions, only solutions. In our 35 years in business, we have never worked with a company as well managed. We will not hesitate to purchase more Primera equipment in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyne Thrasher",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T23:32:00.000Z",
          "Titre": "I am so glad I bought the LX 610",
          "Contenu": "I am so glad I bought the LX 610. It has made packaging my products so much easier. Really good investment. Shipping is fast on label rolls and ink carts. Also the ink carts last a good long while. Printing quality is very professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janice Leto",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T17:54:17.000Z",
          "Titre": "Primera Website user friendly and easy to navigate to what you are searching for.",
          "Contenu": "Primera website, whether ordering supplies or searching the knowledge base, is so user friendly. I ordered a back up ink cartridge for my Eddie printer and because it was ordered before 10am the cartridge was mailed that day"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew Hazen",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T01:15:20.000Z",
          "Titre": "1st there price for a commercial…",
          "Contenu": "1st there price for a commercial labeler was great as I vetted all that were available out there.    I needed a live person who could direct me to the best model and Kelly was amazing.    I couldn't get the labeler working(it was my fault) amd called their tech customer service number and the gentleman who talked me through it had a great attitude amd got me on track in minutes. I am very satisfied as a customer with this companies operating structures."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeani Wells",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T18:03:12.000Z",
          "Titre": "My first time ordering with you",
          "Contenu": "My first time ordering with you, ordering was easy and quick, I loved the availability of help that was offered! I look forward to receiving my Eddie printer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darlene Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T19:56:39.000Z",
          "Titre": "Primera Customer Support",
          "Contenu": "Primera is always a phone call away. They are nice, professional, and they want to help! There are not any customer service departments that hold a standard as high as theirs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vickie T",
          "Nb_Reviews": 2,
          "Date": "2023-12-18T18:27:50.000Z",
          "Titre": "Prompt response and setup"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CF, Twp. of Washington",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T15:05:35.000Z",
          "Titre": "The sales rep was very knowledgeable",
          "Contenu": "The sales rep was very knowledgeable. I love the upgrade program. It helped our municipality to save money and still have great equipment.  Company was in constant contact before and after our purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Unhwa Oler",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T03:00:09.000Z",
          "Titre": "Owner I like this company so much they’re…",
          "Contenu": "I like this company so much they’re very responsible and customer service very good .. highly recommend it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judy Foster",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T20:15:53.000Z",
          "Titre": "Great communication and help",
          "Contenu": "Great communication and help. Quick turn around. Very thankful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Sexton",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T14:35:09.000Z",
          "Titre": "Quick professional assistance by phone",
          "Contenu": "Quick professional assistance by phone! The technician listened to me  and assessed my situation quickly. My DVD burner/printer was up and running in no time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily Hasan",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T17:58:41.000Z",
          "Titre": "Primera is fantastic- I've contacted…",
          "Contenu": "Primera is fantastic- I've contacted them twice in the past month - and both times- super fast responses- and so helpful. They are the gold standard of customer service!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "VeeJay",
          "Nb_Reviews": 3,
          "Date": "2023-09-26T13:04:31.000Z",
          "Titre": "Live Agents Always On Duty!!",
          "Contenu": "Customer service was very efficient. Based on price of equipment,  I think the warranty should be longer and the design of the labeler and printer could be better. I got labels stuck in the printer and had to mail it back in. Overall I'm happy with my purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alan Burns",
          "Nb_Reviews": 3,
          "Date": "2023-11-24T02:58:18.000Z",
          "Titre": "I've been dealing with this company for…",
          "Contenu": "I've been dealing with this company for 15 years and they've always been spectacular"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patticakes Cookies",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T21:58:49.000Z",
          "Titre": "Speedy shipping as always",
          "Contenu": "Speedy shipping as always. The new magenta formula is fabulous, producing vibrant reds -- love it!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Raresheid",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T17:13:14.000Z",
          "Titre": "Great products, great service",
          "Contenu": "From my first connection I was retreated like a valued customer.  I then had to be transferred and received the same excel attention.  It is this exact feeling, plus the products and quality that will keep my business turning to you first."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbie Riddle",
          "Nb_Reviews": 2,
          "Date": "2023-10-04T02:44:34.000Z",
          "Titre": "Your customer care is great",
          "Contenu": "Your customer care is great. Every time I call needing help the folks are knowledgeable and quite pleasant. However, you do need to have more classes to teach everything Eddie can do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bailey Christopherson",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T23:44:10.000Z",
          "Titre": "Easy to Work With",
          "Contenu": "Straightforward and sincere people made the purchasing experience smooth. The service team is always willing to help solve any issues that may arise as well."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hanson Liu",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T23:45:43.000Z",
          "Titre": "Easy to order with help from real people online",
          "Contenu": "Online chat with real people help me understand what is the best option for my business.Online help team is friendly and knowledgeable. Ordering online is an easy experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Diane Fox",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T23:17:33.000Z",
          "Titre": "Fantastic product",
          "Contenu": "Fantastic productThe replacement drive for the Bravo dvd duplicator was about a hundred dollars, worked perfectly. Just ordered another one as a back up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Robinson",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T15:49:25.000Z",
          "Titre": "I ordered ink online so no interaction",
          "Contenu": "I ordered ink online so no interaction. But,loving my Eddie."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T17:09:37.000Z",
          "Titre": "Good information and follow up",
          "Contenu": "Good information and follow up. Pointed in the direction I needed to go for my. Purchase"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "David  Toro",
          "Nb_Reviews": 6,
          "Date": "2023-10-31T21:40:47.000Z",
          "Titre": "Primera makes great products",
          "Contenu": "Primera makes great products. The products are well made and last, they are thought through and make it easier to produce things with beautiful quality."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassandra Henjum",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T20:00:36.000Z",
          "Titre": "Always amazing",
          "Contenu": "Always amazing! I live near the headquarters and can pickup ink or anything I need convenient and same day! Love it! They are always kind and helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TERRY BEHM",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T19:06:16.000Z",
          "Titre": "Kelly was extremely helpful and…",
          "Contenu": "Kelly was extremely helpful and knowledgeable and courteous. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "chris woodland",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T00:30:14.000Z",
          "Titre": "another great experience",
          "Contenu": "Mitch from tech was an awesome teacher,  learned so much about the lx610 and its capabilities.  thank you so much for your help. I say it all the time, Primera has the best tech support in the game."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 4,
          "Date": "2023-10-17T18:21:09.000Z",
          "Titre": "Quick and easy order",
          "Contenu": "Quick and easy order.  A little confusing changing my address and credit card information, but I figured it out."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ric Stacey",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T16:49:46.000Z",
          "Titre": "The website was easy to navigate and…",
          "Contenu": "The website was easy to navigate and ordering was easy as well.  I just wish the ink wasn't so expensive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Walters",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T00:54:50.000Z",
          "Titre": "I love this machine so quick and easy…",
          "Contenu": "I love this machine so quick and easy and everyone is amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawna Reed",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T18:21:33.000Z",
          "Titre": "Everything about Primera is…outstanding!",
          "Contenu": "Everything about Primera is outstanding!  Their customer support/service is the best you will ever find.  They sell a product and ensure you know how to use the product -help you use it-are there at a phone call away to trouble shoot and make sure your product works and you know how to work it.  Are fast and friendly too!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "Iryna Pigida",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T18:38:10.000Z",
          "Titre": "I am very pleased with the printer",
          "Contenu": "I am very pleased with the printer, but I have questions about the technical aspects of its use. You sent me a consultant’s email, but I didn’t use it. Now I see that I can’t do it on my own"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T13:09:55.000Z",
          "Titre": "My issue was fixed quickly",
          "Contenu": "My issue was fixed quickly. He really knew the printer and what I needed to do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawna Penny",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T22:22:12.000Z",
          "Titre": "My phone call was answered quickly and…",
          "Contenu": "My phone call was answered quickly and the person helping me was quick to diagnose and solve my problem so I could be on my way!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Geis",
          "Nb_Reviews": 3,
          "Date": "2023-11-29T19:18:59.000Z",
          "Titre": "Primera is great",
          "Contenu": "Primera is great.  Their customer service is second to none."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candace Connaker",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T17:09:38.000Z",
          "Titre": "It was very easy to order in the…",
          "Contenu": "It was very easy to order in the product came very quickly. Everything was packaged very securely. I had no problems. The printer is amazing!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fred",
          "Nb_Reviews": 4,
          "Date": "2023-10-30T19:18:12.000Z",
          "Titre": "The repairs made on my disk printer…",
          "Contenu": "The repairs made on my disk printer were perfect. The Tuffcoat DVDs have had 100% success.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cookie Joy",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T19:24:53.000Z",
          "Titre": "The help from the service agent was…",
          "Contenu": "The help from the service agent was thorough and helpful. She seemed invested in solving my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick J Morrissey",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T21:51:01.000Z",
          "Titre": "Attention to customer needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shawna Tvrdy",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T16:59:22.000Z",
          "Titre": "Sales team was super helpful",
          "Contenu": "Sales team was super helpful!  They were patient with all of my questions and guidance needed to order my printer.  I am so excited to get it next week!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eve Nolan",
          "Nb_Reviews": 3,
          "Date": "2023-11-15T07:50:44.000Z",
          "Titre": "Always the most helpful staff and fast…",
          "Contenu": "Always the most helpful staff and fast delivery on products"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hoop2125",
          "Nb_Reviews": 5,
          "Date": "2023-09-14T23:42:08.000Z",
          "Titre": "Always amazing service",
          "Contenu": "Always amazing service. My only small gripe, is it would be nice to be able to get free shipping on larger orders."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie T.",
          "Nb_Reviews": 2,
          "Date": "2023-10-31T17:24:46.000Z",
          "Titre": "Good honest company",
          "Contenu": "Great company, printers and supplies. They have quality product and are quick to ship. I also own 2 of their lx810 printers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Howard Sharfman",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:07:44.000Z",
          "Titre": "i have returned defective ink",
          "Contenu": "Primera Tech has taken care of the issue with the Black ink cartridges to which were defective.they sent out replacements"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Rammel",
          "Nb_Reviews": 3,
          "Date": "2023-11-02T22:15:12.000Z",
          "Titre": "Quick service!!",
          "Contenu": "Very responsive and product arrived well in advance of quoted date."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abbey Poff",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T00:43:15.000Z",
          "Titre": "I had trouble finding a product",
          "Contenu": "I had trouble finding a product, but I asked the online customer service and they sent me a direct link to it. Super easy & quick!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mati",
          "Nb_Reviews": 6,
          "Date": "2023-11-04T17:07:47.000Z",
          "Titre": "Great company",
          "Contenu": "You have the most helpful, friendly and knowledgable people there, always ready to help."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue Baumgard",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T05:11:03.000Z",
          "Titre": "User error…",
          "Contenu": "My experience is always 5 star with Primera.  It's always been user error and not the equipment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ricardo Leyba",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T20:48:09.000Z",
          "Titre": "Great supplies!",
          "Contenu": "Fast and easy experience from loading my cart to checkout. Thanks a bunch Primera and crew! ;)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Holly Kluger",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:53:09.000Z",
          "Titre": "Great customer support",
          "Contenu": "Available for customer support when needed"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Paul",
          "Nb_Reviews": 3,
          "Date": "2023-08-23T17:02:16.000Z",
          "Titre": "Efficient, informative email communications.",
          "Contenu": "My email communications to obtain information and make a purchase of a printer and label media were very helpful. Responses were prompt and all my questions were answered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda Erdogan",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T17:47:40.000Z",
          "Titre": "So helpful",
          "Contenu": "So helpful!  Answered all my questions and I ended the session being able to use my new eddie!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wendy",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T15:42:55.000Z",
          "Titre": "Love love love the eddie printer",
          "Contenu": "Love love love the eddie printer.  The ink lasts a longgggg time and the prints are laser quality ! The machine is very easy to use as a cookier"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Clark",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T14:27:57.000Z",
          "Titre": "Great Company",
          "Contenu": "Great Company We were treated very well and the whole experience was a pleasure. Very accommodating."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert De Salazar",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T14:03:56.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, had what I needed in stock."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joel Velazquez",
          "Nb_Reviews": 3,
          "Date": "2023-12-13T02:50:06.000Z",
          "Titre": "Great product and great service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AnnaMarie White",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T08:39:11.000Z",
          "Titre": "The service at Primera is stellar",
          "Contenu": "The service at Primera is stellar. I enjoyed the training and will reach out to them for more."
        }
      ]
    }
  ]
}