{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "qeepsake.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T23:48:43.000Z",
          "Titre": "Horrible Communication/Support",
          "Contenu": "I am a paying customer and have a membership. The app has been easy to navigate and I love how easy it is to add a journal entry. I would rate this product 5 stars...My problem is, I can't order my book! Every time I try to order a book, their website crashes. I've tried multiple computers and browsers (safari, chrome, edge) without any luck. Communication is terrible! I can't get ahold of anyone! I've tried calling the only phone number I can find multiple times and left a voicemail message. I've submitted a help request more than once and no one has returned my calls or emails. I wonder if they are still in business? It is so frustrating!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Angela Rogers",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T16:09:39.000Z",
          "Titre": "Not thrilled",
          "Contenu": "The idea is great!! It's easy to use and convenient. The books are extremely costly. Now the big problem poor photo quality in an outrageous priced book. The pictures are very dark compared to the originals and are grainy. My originals are bright , vibrant, and clear. The ones in my $150 photo book are dark and fuzzy. Not vibrant at all. I'm no newbie to photo books. I have about 20 photo books created by mixbooks. They are beautiful and bright. There is also way too much white space on the pages of these books. Love the idea but you've got to work on your printing quality."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T01:08:22.000Z",
          "Titre": "I’ve always loved but losing interest as he gets older…",
          "Contenu": "I’ve tried changing the entries for my oldest to be school aged, but it still doesn’t send school questions. They also repeat a lot of the same questions"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "NOPE",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T19:08:59.000Z",
          "Titre": "its just the same type of question…",
          "Contenu": "its just the same type of question every time and doesnt coincide with my babys age"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "g.e.",
          "Nb_Reviews": 11,
          "Date": "2023-07-26T03:41:47.000Z",
          "Titre": "Expensive",
          "Contenu": "Cool idea. But my book that I'm about to print is going to cost about $300.  That's not including the membership/subscription fee.  I'm going to have to suck it up and pay it because I've been working on this book for so long.  Next time I'm using Mixbook or Shutterfly.  I could have used that $300+ on something else.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kristina",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T02:14:25.000Z",
          "Titre": "Very convenient but not the most useful",
          "Contenu": "I like that I can text photos. I don't like that there isn't a \"family\" album, only albums with each person's name. I like that I can order books, but I would prefer a monthly mini book subscription instead of only fancier books."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Frisch",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T09:48:40.000Z",
          "Titre": "Meh...",
          "Contenu": "I really appreciate the text abilities - words and pictures - annoying that the captions don't save with the photos I text in. The daily questions are only okay (maybe one in four questions are actually relevant to the stage my child is in and another one in four are just nonsense like 'what does they/zem like about vacations' when I clearly marked boy). The books are a bit pricey and Shutterfly has better layouts. Also, it's terrible that you can't order a book with ALL your kids memories (you can mark every memory for every kid, but that seems to lose the point); I guess it's made for only children..."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Bailey",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T20:25:39.000Z",
          "Titre": "Great app, lots of bugs",
          "Contenu": "I love the app. But it has quite a few bugs still. Even with a premium membership, I have missing photos and loading them is incredibly difficult and frustrating. Many times they won't load and when they do there distorted. I did reach out to tech support and after an update it was better, but again I have the same issues so I chose not to renew premium."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Plowman",
          "Nb_Reviews": 2,
          "Date": "2023-03-24T20:24:29.000Z",
          "Titre": "Nice Reminders",
          "Contenu": "I love the prompts and reminders but over time the questions become repetitive. I usually just post something memorable from the day. This is great when kids are very little but questions seem less relevant once they are mid-elem school."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:25:23.000Z",
          "Titre": "Good. Leaves lots to be desired...",
          "Contenu": "I wish we could have different audiences for different books--nobody knows about our second pregnancy yet, but we can't document it because the audience list is the same between books.I also wish the books were put together with less required user interferance/work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gwenn",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T20:02:14.000Z",
          "Titre": "I like the text prompts but would appreciate special needs consideration",
          "Contenu": "I like the text prompts and the ability to add photos. I get a little overwhelmed in trying to make books.Sadly, some things can be tough as my daughter had special needs… have you considered another version to address that?"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sheena",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T01:34:53.000Z",
          "Titre": "There are a lot of repeat questions",
          "Contenu": "There are a lot of repeat questions. Also some of the questions just seem like a waste of time. I wish it would have prompted me to answer a lot of these questions when they were age appropriate so I could have better documented them."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gloria",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T20:01:51.000Z",
          "Titre": "3rd Child, Lame Questions",
          "Contenu": "We're expected our third child and have used Qeepsake for all 3 pregnancies and their first year. This time around I'm not very impressed with the questions. It's asking me things like what my house is like. I don't know if it's trying to avoid repeat questions from the first two pregnancies but this is a new pregnancy so there are new answers to those same questions. Like \"How did you find out your pregnant?\" or \"Are you going to find out the gender of the baby?\" or \"Will the new baby have any older siblings?\" I haven't gotten any of those. I'm thinking I'll just start writing journal entries with my own prompts because I don't like the questions it's giving me. Otherwise I like the app and the books it creates. To me it's still worth it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "MH",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T07:03:58.000Z",
          "Titre": "I love the ease of Qeepsake",
          "Contenu": "I love the ease of Qeepsake. I love that I can scrapbook from Tempe ease of my phone. Recording memories while waiting at the doctor office, school pick up lines and more. I simply wish when printing that there were more customizations. I wish I could have all pictures be large and have a smaller font to the side of the image. Often the words are large, but the pictures are small making it hard to see the details in the pictures. Where the words could be much smaller and still easily readable. I don’t need a font 18/20 in order to read it. A font 11/12 is just fine. That is what is typical of most forms, etc…. If this one things was fixed I would be 100% happy with the product."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2023-03-09T19:15:05.000Z",
          "Titre": "Facebook integration is gone!",
          "Contenu": "I dislike that the integration with Facebook is gone. Makes it a little more time consuming making sure i put entries into the app."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "KELSEY BARFIELD",
          "Nb_Reviews": 4,
          "Date": "2023-03-09T19:30:08.000Z",
          "Titre": "I love that I can record memories and…",
          "Contenu": "I love that I can record memories and make a baby book for my kids without having to take time out of my busy day to do it however I’m annoyed that the same questions keep being asked over and over and over again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Bri",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T19:23:55.000Z",
          "Titre": "I absolutely love the app but find the photo books too expensive",
          "Contenu": "I absolutely love the app and have been using it for years but the books are so expensive that I haven’t been able to print them in the last couple years and therefore I find myself less likely to continue adding memories to my Qeepsake"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T05:48:57.000Z",
          "Titre": "Questions are subpar",
          "Contenu": "Questions are subpar. Books have way too much white space, pictures should be bigger, or be able to put more entries on each page."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ali",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T19:50:58.000Z",
          "Titre": "Love the book and the idea",
          "Contenu": "Love the book and the idea. When I go into edit it it just takes a long time to load. Also they are very pricey I wished you all did more sales.. and allowed more pages per book. I take a ton of pics and have maxed out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniela",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T21:09:02.000Z",
          "Titre": "Better questions"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jena",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T21:26:06.000Z",
          "Titre": "So helpful for busy families!",
          "Contenu": "I absolutely love this app and the ease of creating a book! I've already ordered one and will be ordering my next one soon. The ease of inputting memories and pictures is so wonderful! The quality of the book is great, too. I took one star off only because the app has some glitches that make it frustrating at times. But it's not enough to be a \"make or break\" thing... just makes it slightly annoying. If the glitches were fixed, I would give it 5 stars!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 2,
          "Date": "2023-05-19T00:53:55.000Z",
          "Titre": "Easy to use.",
          "Contenu": "I wish the pictures were clearer in the books, but compared to the other companies I’ve tried, this is the easiest to use."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carolyn",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T05:09:02.000Z",
          "Titre": "I love that I can use a quick text to…",
          "Contenu": "I love that I can use a quick text to save a keepsake memory book for my beloved daughter. Fast. Easy."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Jillian",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T20:12:23.000Z",
          "Titre": "Love it - one suggestion",
          "Contenu": "I love having the reminders to write things down to remember each stage of my children's lives. I wish there was an option to add several photos randomly to various questions, so that I could quickly add photos to my draft book. Adding one by one is not as efficient as it could be."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "K Magnus",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T20:17:29.000Z",
          "Titre": "Time Friendly, Easy to Use, & Memorable to Read",
          "Contenu": "I have been slowly adding to my son's journal for 3 years now. Once in a while, I go into the app and see all the memories I have left. It's heartwarming. I have not bought a journal yet, but I will one day. Adding entries is so easy with the text message feature, and editing entries later, or going back to missed questions, is even easier. Definitely recommend because with life being so busy, I would not have sat down to create these entries on my own. 👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-03-24T21:05:42.000Z",
          "Titre": "So worth the cost!!!",
          "Contenu": "The books I ordered are an amazing keepsake for my daughter!This is a process that I started before our daughter was born, answering questions uploading pictures. I love the text message feature. Order the first book right after she was born. Continue answering questions and order a second book shortly after her 1st birthday. Now she has a two wonderful keepsakes!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Aubrey",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T17:35:34.000Z",
          "Titre": "Great way to quickly save memories and photos!",
          "Contenu": "Great idea and easy way to add photos/jot down memories of the kids on my phone.  One suggestion is, is there a way to order 2 books at once and only pay shipping one time?  I've had to order 2 books, 1 for each kid, and I noticed I can't put two in the cart at the same time so end up having to pay twice for shipping.  Also, it'd be great if there was a way to add more collage options with more than 4 photos.  And also with the design of the book, would there be a way to make sure all the text & accompanying photo make sure to stay on the same page together?  Just some suggestions :)  Otherwise we love the app!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kristen",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:26:17.000Z",
          "Titre": "Fantastic App, but with Technical Issues",
          "Contenu": "Absolutely love the app and have been using it for over two years to track the growth of my daughter, and my family has become dependent on the weekly recap emails!  The only problems are technology-related: (A) The app tends to crash when using.  (B) We used to be able to post a collage of 6x photos, but then it changed back to only 4x photos.  (C) Editing/creating the book is a very difficult process and not user friendly.  (D) The recap email limits to only 10x posts within the email, regardless if there were more entries for that week.  (E) Customer support was not responsive.  I understand that Qeepsake is run by a small group of entrepreneurs, so overall I applaud their efforts and accomplishments.  If they could work on some of the bugs, that would be great!  I am a grateful used overall!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T05:41:26.000Z",
          "Titre": "A great app that makes baby-booking easy!",
          "Contenu": "I love this app! They make it so easy to make a great looking baby book. I love that I can text the app a message and picture and it automatically goes into the journal. The books are pretty expensive, otherwise I would give it 5 stars!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Briggles",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T20:03:27.000Z",
          "Titre": "Good quality!",
          "Contenu": "The colors are wonderful, the quality is wonderful! I love the couple of books I’ve ordered so far. If I had a complaint, it would be that the text questions seem to all be the same but worded differently and often. Please come up with a variety of questions about every day life."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Liz",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T22:02:42.000Z",
          "Titre": "Love having this memory preserve",
          "Contenu": "Love having the platform to preserve memories on a daily basis! My only complaint is that the questions are repetitive sometimes. I would also like the option to have a different question if one is skipped."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amber",
          "Nb_Reviews": 1,
          "Date": "2023-04-01T11:56:05.000Z",
          "Titre": "Excellent product!",
          "Contenu": "I ordered two books from Qeepsake. One for each of my kids, and it covered a 12 month period of time. I enjoyed getting a question daily and I thought some of the questions were too repetitive. I really enjoyed the layouts for the individual add-on posts, and that I could include multiple photos. I liked that I could go back easily to edit typos and content. It was easy to see during the editing process what the book was going to look like. The quality of the binding on the hardcover is excellent. The quality of the paper and clarity of the photos were excellent!The only thing keeping me from giving it a 5 star review is that I didn't have much control over the layout of the book. There were a couple of pages that printed with just a single question on it, and I would have preferred a better use of space for that page. I would also have preferred some options on cover color. I don't like that it's a white cover.I wish this product had been available when my kids were babies! I love it, and I'm very happy I can so easily record memories!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Idan",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:07:44.000Z",
          "Titre": "Videos",
          "Contenu": "I wish you could send videos via text message!Also when you try to upload videos from the app it takes forever and you need to stay to look it at until it upload and then to press save. It take so long and the process is annoying"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Yanci",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T21:29:24.000Z",
          "Titre": "Loved that I got to keep all those…",
          "Contenu": "Loved that I got to keep all those memories. Wayyy more pics and comments than I would have been able to fit into a scrapbook yearbook. I do however have a complaint about the size of pictures in the hard cover book. The pages seem like they could hold larger pictures! Also, I find the ink is poor. I would like my pictures to be a bit brighter."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cassandra",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T22:57:10.000Z",
          "Titre": "I LOVE Qeepsake",
          "Contenu": "I LOVE Qeepsake. It would be better for me if:1. I can print a book that is more than 300 pages. What if I write one Qeepsake a day and then want to create a book that spans a year? Even if it is more expensive, I would appreciate the option. What I do now is edit out full memories and I feel like that goes against all the hard work put in to writing the memory to begin with. Also, I know I can do a year in two books, volume 1 and volume 2, but that seems like too many books to keep up with if I stop when my kids are 18…36 books seems like a lot. 2. I would like to control when the Qeepsake recap email goes out. Sometimes I haven’t entered any memories and then my family doesn’t get any recap at all for a week."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jocelyn",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:38:48.000Z",
          "Titre": "I like the question prompts",
          "Contenu": "I like the question prompts. I wish I could go back and do questions for different children on different days.  My kids really liked their books"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T19:48:02.000Z",
          "Titre": "This is my number 1 thing I tell new…",
          "Contenu": "This is my number 1 thing I tell new moms to get.  It’s easy and makes you feel like you’re doing something awesome for your kids. This is the second time I’ve used this and will be using it again for baby #3."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelsie",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T19:44:58.000Z",
          "Titre": "The whole concept is so great",
          "Contenu": "The whole concept is so great. I recommend Qeepsake and often purchase it as baby shower gifts for friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T16:30:02.000Z",
          "Titre": "I love this idea and it has been a life…",
          "Contenu": "I love this idea and it has been a life saver for making keepsake books! I only give it 4 stars because the app can be a little glitchy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Surya",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T06:34:49.000Z",
          "Titre": "love our books",
          "Contenu": "love our books! App is pretty easy to use… the editing of the book could be easier but overall love it"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T19:08:52.000Z",
          "Titre": "Over all it is pretty good.",
          "Contenu": "Over all it is good. My main issue is the videos can’t be viewed in the weekly recap."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Leanne T.",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:04:17.000Z",
          "Titre": "Treasured memories",
          "Contenu": "My sister joined Qeepsake several years ago when her son was 2 or 3. Sadly, she died this past year of cancer before she was able to finish and order her book. I contacted Qeepsake asking to have access to her account and book so that I could finish and edit it and order a copy for her now 8 year old son. They responded immediately, and with such compassion, it blew me away! They not only gave me access to her account, they gave me a free two week membership so that I could do a vinal edit and place the order (her membership had expired since her death), and they gave me a code to order two free books, one for her son and one for myself. I can't say enough positive things about Qeepsake, and Freddy Munoz, the rep I communicated with. The quality of both the hard cover and soft cover books is just beautiful and we will treasure these memories forever. Thank you Qeepsake!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dan&Nicole",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T18:21:07.000Z",
          "Titre": "Important Firsts All In One Place",
          "Contenu": "Qeepsake is amazing to enable you to keep an ongoing photo album wherever you are, to enter in those first words or first smiles - all those important first moments and more! Then, you can setup a distribution list and share it with friends and family rather than having an unfinished book collecting dust somewhere in your house. I love Qeepsake!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:17:43.000Z",
          "Titre": "Super freaking duper",
          "Contenu": "I love the daily text messages. I also appreciate the fact that there's a website I can log in to and quickly type up responses on my normal laptop keyboard. I have been using the service since they started and although I haven't ordered a book yet, I love that it's easy to add new kiddos to the mix and there's no extra charge for the 10,000 babies I keep finding in my uterus."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsie",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T01:21:54.000Z",
          "Titre": "Best Birthday Gify",
          "Contenu": "Qeepsake allows me to safely document my kid’s lives and remember all the cute things they do and say that I will forget. Each child gets a book documenting the previous year on their birthday. I can’t think of a better present we can give them. I also love that I can now get a PDF to save in case anything happens to the hard copies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ms cho",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T17:54:46.000Z",
          "Titre": "As a first-time mom",
          "Contenu": "As a first-time mom, finding time to write down the sweet, hard, and amazing moments of the beginning of our family journey was difficult. Learning, remembering managing so many new things about parenthood is a lot. Qeepsake made it super easy for me to just decompress at nights and write down a few things that I want to remember from the day. I'm so excited to share the book with our daughter when she's able to enjoy it! I also hope it will be something she can reference if she decides to have a family one day!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:46:19.000Z",
          "Titre": "Love love love Qeepsake",
          "Contenu": "We've been so pleased with Qeepsake! From the easy to use application, to the email recaps to family, to the quality of the book we have printed. Definitely planning on keeping up with new books for each year of our son's childhood. The way Qeepsake works fits so well into our life and it never feels like a burden to add things. I recommend it to everyone looking for a way to document their child's life."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Noah",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T20:01:34.000Z",
          "Titre": "Qeepsake has been so valuable to me for…",
          "Contenu": "Qeepsake has been so valuable to me for saving memories for my family!  Having three children, and expecting our fourth, it feels like it would be impossible to remember and have a way to gift these memories to our children without the tools and structure a platform like Qeepsake provides.  Great app, and great company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ruth",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T20:56:43.000Z",
          "Titre": "I absolutely love qeepsake",
          "Contenu": "I absolutely love qeepsake. I was an avid scrapbooker both with paper and digitally. When I had my 3rd child I just knew I couldn’t continue accumulating memories at the end of each year. Qeepsake has made it easy for me to do this when k hade 1-5 minutes every few days. Our family albums are complete and caught up!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brooke",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:17:34.000Z",
          "Titre": "Amazing",
          "Contenu": "We are on our 3rd year documenting our little one’s life, milestones, adventures etc! Love the ease of use right from my phone and the ability to order a book anytime with any date range I choose. We have gifted grandparents yearly books and they LOVE them! The quality is amazing and worth the price. Only wish would be that the picture collage allowed for 6 pictures like they had previously instead of 4."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candice",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T22:44:52.000Z",
          "Titre": "When I contacted Queepsake about…",
          "Contenu": "When I contacted Queepsake about expired codes because I only have one book printed a year per child (which I have 4), they really tried to help a mom out and made sure past coupon codes were useable so I at least got free shipping. Way to be awesome."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T04:48:58.000Z",
          "Titre": "Great with comments",
          "Contenu": "I appreciate how fast you guys got back to me. I was wondering how to get more credits towards a book because they're very expensive and we are very low income. The customer service rep gave us a little bit more of a credit, which is very nice of him. I was hoping that you guys were running that deal where you get so many people to sign up that you get credit towards a book but I'm guessing you aren't doing that anymore. But I appreciate all the help that you guys have given me. I will always recommend qeepsake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 2,
          "Date": "2023-03-15T16:04:08.000Z",
          "Titre": "We absolutely love the books!",
          "Contenu": "We absolutely love the books that we have printed.  It has helped me to remember so many things that I thought I would remember, but definitely didn’t one or two years later.  I also like how some of the questions make you think of things that you wouldn’t have recorded otherwise.  My daughter is 4 and she loves looking at her books.  We’re still using Qeepsake and will probably continue for a long time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edana",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T18:01:58.000Z",
          "Titre": "Qeepsake is the most amazing discovery!",
          "Contenu": "Qeepsake is the most amazing discovery. I had been stressing about documenting my children since I never had time to sit down and work on a baby book. This app allows me to document and track EVERYTHING and I spend a lot of my spare time working on books. I just ordered my first books for my kids and I blown away by the quality! I tell everyone I know with kids about this app and the best part is being able to reproduce the books for any family that would like a copy. There are not words to describe how incredible this app is!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leigh",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T22:48:31.000Z",
          "Titre": "A Great Way to Document Your Memories!!",
          "Contenu": "I’ve been a customer of Qeepsake for 3 years now. I absolutely love the books I can make my kids for Christmas or their birthdays and my kids LOVE looking through the books and reminiscing. There are often memories that the text reminders prompt me to document that I normally may have forgotten. I recommend Qeepsake to all parents. It’s such a reasonable cost and you’ll never regret documenting memories of your children’s lives!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T23:38:03.000Z",
          "Titre": "I've enjoyed the daily reminder to…",
          "Contenu": "I've enjoyed the daily reminder to journal about my kids. I don't always respond to the questions, but it's nice to get prompted and to take a few minutes to focus on what matters–my family. Plus, texting in responses is easy! I recently ordered a book for my children, and they loved it. It's fun to sit down and revisit the photos and memories I saved for each of them. I'm not the type of person who often scrapbooks or prints photos, so it was nice to have an easy way to make their memory books without much effort or time."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Samantha",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:42:14.000Z",
          "Titre": "I love my Qeepsake books",
          "Contenu": "I love my Qeepsake books, I now have three of them spanning two years. It’s really easy to add photos and entries. I use the questions like journal prompts if I don’t have anything notable of my own to submit. It can be a little tedious when reviewing old entries, they just seem slow to load. But my the daily usage of the app and the books themselves have been a good experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gabriella Kaminsky",
          "Nb_Reviews": 4,
          "Date": "2023-03-29T20:42:03.000Z",
          "Titre": "Qeepsake is a gift!",
          "Contenu": "I love Qeepsake SO much! I have the worst memory of all time so if I don’t write something down, I will absolutely forget it. Luckily, Qeepsake has provided the opportunity for my husband and I to write down all of memories we would never be able to look back on otherwise. I’m so grateful that my husband and I can just look back on everything in the app or our books!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T04:55:39.000Z",
          "Titre": "2,000 memories and counting",
          "Contenu": "In the last three years I have sent in more than 2000 photos and purchased seven Qeepsake books. Every book feels like a masterpiece of memories to me. I am so proud of our collaboration. Thank you to the tech team and all of the people who have given me the gift of remembering my child’s early years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Savannah",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:15:06.000Z",
          "Titre": "Easiest way to journal ever.",
          "Contenu": "I love that Qeepsake is able to text me thought-provoking prompts daily, straight to my phone. I was able to customize when I receive prompts to when I'm usually able to answer thoughtfully and detailed. It's the easiest way to journal I've ever experience, and even when there's something I need help with, Qeepsake's incredible customer support team has been on it. They're kind, responsive, and understanding, which only adds to the amazing Qeepsake experience overall!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LT",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T22:52:43.000Z",
          "Titre": "In all the craziness of raising kids…",
          "Contenu": "In all the craziness of raising kids it’s hard to remember to print your photos and journal. The two promoted questions a day is the perfect way for me to spend less than five min remembering the day. I have one book completed and working on my second book now. The pictures are not only, not stuck in my phone, but combined with my journal!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T20:40:38.000Z",
          "Titre": "Really love how Qeepsake makes life easier",
          "Contenu": "Really love how Qeepsake makes it so easy to record memories and photos  of my child. I love the idea of albums and scrapbooks but never have the time. With Qeepsake I can do a little bit at a time, and then the app pulls together an official album when I want!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Claire Eidson",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T22:09:58.000Z",
          "Titre": "I love this app",
          "Contenu": "I have been using Qeepsake for about 2.5 years. I decided to try it for about 6 months to see if it would help me consistently collect my children's memories and experiences - and it did! I appreciate the daily prompts and the types of questions that are asked. I love being able to include a photo to go along with the text."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcie",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T23:33:16.000Z",
          "Titre": "I had a great experience with Qeepsake",
          "Contenu": "I had a great experience with Qeepsake. The books turned out great! Our family loved them! The only recommendation I have for Qeepsake, is to look into enabling a mass upload of pictures. It was a bit tedious, adding pictures individually."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T15:51:23.000Z",
          "Titre": "As an expecting mother",
          "Contenu": "As an expecting mother, Qeepsake has been a great tool to help capture this journey of pregnancy. I like the ease of texting in a response to the daily questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T18:54:03.000Z",
          "Titre": "the best gift for your kids",
          "Contenu": "I have been doing Qeepsake for 6 years, and have created a yearly book for each of my kids. It is truly the only way that I am able to remember some of the cute, funny, memorable things that happen and to keep track of milestones. At the time you think “how will I ever forget this”… but you do. My 6yo loves to look through past books I’ve made and enjoys when I read it to him. It’s fun to see him enjoy and appreciate it with me. I can reduce the number of questions when I’m behind or catch up on the app or website when I have more time. Now when people tell me “you should really write these things down” I can say, I do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T20:10:34.000Z",
          "Titre": "I adore Qeepsake",
          "Contenu": "I adore Qeepsake! It’s amazing that I can have both my children’s journals on the same app and they can even share entries. It’s a great investment to print beautiful, memory filled books for them to keep. My pictures in my phone finally have a meaningful spot to go!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T18:16:56.000Z",
          "Titre": "Best thing we’ve had to preserve memories",
          "Contenu": "I love scrapbooking, but I haven’t have time to do it for years. Now that I have a 2.5 year old plus another on the way, I definitely don’t have time for it. We love Qeepsake because our children wouldn’t have any memory books with it out (or they wouldn’t get made for another 20 years and by that time the little memories would have been forgotten). Every Sunday night, we do our Qeepsake entries for the week, mostly so the grandparents have something to see in the Monday morning email. We order one hard copy memory book a year. Although they are pricey, it’s definitely worth having minimal time into the boom creation. Two things I wished: that it would save the old book orders for easy reordering and that there were a few more options for layouts that would fill out more of the page. We do a lot of collages. I like to create one entry that’s like “Phrases of the week” now that we are talking a lot, there are a lot of funny phrases and questions that are fun to look back on."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elise",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T05:06:08.000Z",
          "Titre": "Helps me remember the little things",
          "Contenu": "Easy to use. Printing the books is simple. I wait until there’s a sale to buy them. The prompts make you think of things you might otherwise forget to mention. I love looking back on previous entries and so does my husband. It takes us back through each moment and how we were feeling."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rayann",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T18:46:12.000Z",
          "Titre": "Absolutely LOVE Qeepsake!",
          "Contenu": "We have been using Qeepsake for 3yrs now and have 2 books so far. It is such a great app. So much easier than trying to print photos and put them in a book. This way you can easily add a story to each photo. I also love the option to share each week’s entries via email. My family lives 12hrs away from us and we only get to see them once a year. They love getting the weekly updates. Absolutely recommend Qeepsake to everyone. Worth every penny!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kirstin",
          "Nb_Reviews": 2,
          "Date": "2023-03-29T02:38:24.000Z",
          "Titre": "Forever Qeepsake!",
          "Contenu": "Love Qeepsake! It is perfect for me on the go. I can make an entry while baby sleeps in my arms, I can add pictures while in the car, and review with friends and family. Love that if anything happened to the book, I could always get a new one. I have many family members who have lost their baby scrapbooks and have nothing. I will always have my memories!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Erin Waite",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T21:31:25.000Z",
          "Titre": "Love that I am prompted to write daily",
          "Contenu": "Love that I am prompted to write daily. And if I don’t, I can always open the app and add to any day I want to. This will be something my kids can look back on one day and absolutely love to experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Camille",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T18:20:08.000Z",
          "Titre": "Whenever I have an issue or question…",
          "Contenu": "Whenever I have an issue or question they are always very prompt and punctual with a response. I always feel like my needs are met and helped."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T01:09:28.000Z",
          "Titre": "I love the Qeepsake app because it's so…",
          "Contenu": "I love the Qeepsake app because it's so easy to use and it's incredibly convenient. No more printing photos or organizing scrapbook supplies. Beautiful baby books!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindzy",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T04:27:21.000Z",
          "Titre": "I always enjoy getting the questions…",
          "Contenu": "I always enjoy getting the questions every day. It always me a chance to reflect on the small things that make being a parent so great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shelley",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T20:07:30.000Z",
          "Titre": "Very pleased with the ease of recording…",
          "Contenu": "Very pleased with the ease of recording my little guys most precious moments. I have also loved both books i ve had printed so far. Quality is amazing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T14:20:04.000Z",
          "Titre": "I am in love with the Qeepsake app!",
          "Contenu": "I am in love with the Qeepsake app! I have Been a user for 5yrs and it is so special looking back and getting books printing of my 2 kiddos! They make it so easy to track and log memories and milestones!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T19:09:58.000Z",
          "Titre": "Great way to track memories",
          "Contenu": "I really love being able to track the daily memories of my family. The app makes it easy and ordering the book is very simple. My only wish is that you were able to add a few more pictures to a collage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T10:21:11.000Z",
          "Titre": "Love this service it helps keep me on…",
          "Contenu": "Love this service it helps keep me on track with my goals of providing a history for my grandchildren"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Melissa Loucks",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T17:12:57.000Z",
          "Titre": "Makes being a mom of 3 a little easier",
          "Contenu": "Makes keeping track of all the little things with three kids so easy to jot down. I like that I can go back and add things from days when I didn’t get a chance to upload something. The prompts are handy also and ask things I may not think of to add."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T00:05:18.000Z",
          "Titre": "I love this app!",
          "Contenu": "I love this app! Easiest way for me to track my baby's growth, milestones, and just sweet things that happen day to day. Haven't ordered a book yet, waiting for a sale, but excited to have print someday!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T23:43:00.000Z",
          "Titre": "It’s super convenient to update",
          "Contenu": "It’s super convenient to update, and the grandparents love that they get weekly updates about the entries."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T18:47:25.000Z",
          "Titre": "Qeepsake is wonderful",
          "Contenu": "Qeepsake is wonderful! I would not have a baby book if not for Qeepsake making it so easy for me. I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrienne",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:16:20.000Z",
          "Titre": "Great books my kids love!",
          "Contenu": "The books were laid out well and good quality. My kids loved looking at it with me and reading all the fun questions and my answers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shasta",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T18:18:57.000Z",
          "Titre": "Easy and intuitive",
          "Contenu": "Easy and intuitive. Not too many options but still enough to guide the process effectively."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Erin",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T19:22:38.000Z",
          "Titre": "A must for all parents!",
          "Contenu": "Wow! My book is the most beautiful things I’ve done to capture all the moments of my child’s life! Qeepsake makes me look amazing.  If it wasn’t for them, there would be no book.  Mom life is busy and time flies."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T18:59:43.000Z",
          "Titre": "I love the ability to drop memories in…",
          "Contenu": "I love the ability to drop memories in quickly so I don’t forget all the cute things the kids say and do!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:25:57.000Z",
          "Titre": "So Easy! We love Qeepsake!",
          "Contenu": "Qeepsake has been so easy to use and capture such meaningful moments to our family!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katie",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T05:55:38.000Z",
          "Titre": "I love how user friendly the app is and…",
          "Contenu": "I love how user friendly the app is and convenient for keeping memories recorded from anywhere."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elyssa",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T05:06:12.000Z",
          "Titre": "So thoughtful and easy to use",
          "Contenu": "This is amazing app and makes journaling so easy!!! My only regret is that I didn’t stay caught up and print the books yearly!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emily",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T13:56:39.000Z",
          "Titre": "A great reminder",
          "Contenu": "I love being reminded to slow down and think about my kids and who they and what they do. Qeepsake is my reminder."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tara Lynn Hoppe",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T20:39:43.000Z",
          "Titre": "Social media free",
          "Contenu": "So fun to capture memories that you may not want to share on social media!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 4,
          "Date": "2023-03-14T21:42:43.000Z",
          "Titre": "I've been using Qeepsake for almost 5…",
          "Contenu": "I've been using Qeepsake for almost 5 years, and it makes it so easy to preserve memories for my kids. I love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsey",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T02:49:51.000Z",
          "Titre": "So user friend and quick",
          "Contenu": "So user friend and quick! Great to jot down a note to go with a pic and quick story that otherwise would have been forgotten."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T11:24:55.000Z",
          "Titre": "Love how the date automatically fills…",
          "Contenu": "Love how the date automatically fills in when you upload a picHow you can use it from your phone. How you can toggle between 1 and 2 children"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TC",
          "Nb_Reviews": 2,
          "Date": "2023-03-21T19:02:05.000Z",
          "Titre": "Using it for years",
          "Contenu": "Been using it for years now for my two sons. The ease of adding comments/photos while on the go is priceless!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cassie",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T12:39:47.000Z",
          "Titre": "Kids love their books!",
          "Contenu": "The questions provided are great prompts for each kid! Both of my kids have a book now and they love reading through them! So many memories captured!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karis",
          "Nb_Reviews": 2,
          "Date": "2023-03-28T19:22:18.000Z",
          "Titre": "This is a gift.",
          "Contenu": "I love this. It has made keeping memories a lot easier.  The little things don’t get missed as he grows up. I also love that I can share these memories as gifts to those who don’t see him all the time.  The only thing that was harder for me is my son was born early.  A few weeks and was in the NICU.  So at the time they didn’t have anything for that the prompts were off. They just didn’t account for that. However I was looking through the other day. And it does now have those questions.  That category. And it makes me happy to see. I have used this since 2020. I love it. The only thing that happened is I didn’t review my book last year and I thought I could text a memory for it to be put in my book. But it just answers the last question that had been sent. User error so my fault. But other than that I like it a lot."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linique T",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T02:33:40.000Z",
          "Titre": "This platform is helping me in so many…",
          "Contenu": "This platform is helping me in so many ways. I can’t wait to share these memories with my children."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sophie",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T21:09:40.000Z",
          "Titre": "Wonderful service",
          "Contenu": "Wonderful service. Books are veryHigh quality. I treasure them all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "April Rogers",
          "Nb_Reviews": 2,
          "Date": "2023-04-06T20:43:21.000Z",
          "Titre": "I can't wait to eventually give my boys…",
          "Contenu": "I can't wait to eventually give my boys these books when they are 18 and out on their own. It will be such great memories for me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgan",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T21:15:38.000Z",
          "Titre": "Great to look back on!",
          "Contenu": "I love that it gives me prompts for our everyday experiences. It is so great to look back on!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shurae",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T15:07:49.000Z",
          "Titre": "Love the quality of these books and how…",
          "Contenu": "Love the quality of these books and how easy it is to add pictures and memories!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandi",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T01:50:20.000Z",
          "Titre": "Great service",
          "Contenu": "Great service. Beautiful keepsake when you want one printed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kimberly Franz Nowak",
          "Nb_Reviews": 2,
          "Date": "2023-04-07T17:03:35.000Z",
          "Titre": "What a wonderful way to keep the…",
          "Contenu": "What a wonderful way to keep the memories going--and in one place!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiara Bollinger",
          "Nb_Reviews": 3,
          "Date": "2023-03-30T13:42:09.000Z",
          "Titre": "I enjoy using this app",
          "Contenu": "I enjoy using this app. It makes keeping a baby book easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jamie Savage-Hulsey",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T16:20:09.000Z",
          "Titre": "I love Qeepsake!",
          "Contenu": "I love Qeepsake! The books are so beautiful and it's so easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T19:04:52.000Z",
          "Titre": "Really grateful for this service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea Hess",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T05:37:02.000Z",
          "Titre": "Thank you",
          "Contenu": "Thank you! I appreciate it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JAW",
          "Nb_Reviews": 1,
          "Date": "2023-03-19T00:01:10.000Z",
          "Titre": "Love their app",
          "Contenu": "Love their app! Ordered a book too and it was just as I’d hoped."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Martha",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T20:05:00.000Z",
          "Titre": "I love how easy it is to save memories!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany R.",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T00:15:52.000Z",
          "Titre": "Best company ever!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michele",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T02:17:21.000Z",
          "Titre": "My son loved the book and I loved the…",
          "Contenu": "My son loved the book and I loved the ease of it all!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Tasha",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T21:39:07.000Z",
          "Titre": "Helpful and answered my needs"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-05-18T19:36:48.000Z",
          "Titre": "Quick and very helpful",
          "Contenu": "Quick and very helpful!  Thank you!"
        }
      ]
    }
  ]
}