{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "qrcodekit.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Lamu k Sunday",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:35:14.000Z",
          "Titre": "To summarize, QR code kits can be a great way to engage customers and increase brand awareness.",
          "Contenu": "In summary, here are some suggestions for how the company can improve its QR code kit:- Make sure the user experience is seamless and easy to use.- Test the QR code kit to make sure it works properly.- Provide clear instructions and guidance on how to use the QR code kit.- Offer customer support in case users encounter any issues.Is that more clear? I hope this helps!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Phoenix Digital Strategy",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T05:51:50.000Z",
          "Titre": "contact me via phone for more info"
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "ART",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T13:30:15.000Z",
          "Titre": "Is a misleading advertisement",
          "Contenu": "Is a misleading advertisement: it says that you can make a free trial by having ONE free QR code (and it is not specified that it has limited value in time) implying that the first QR code is free and, if you like the system, you can sign up, pay and make other QR codes. So it becomes a blackmail, because we created a QR code printed on dozens of copies of a product, considering to create latelay more codes for a fee, but after 2 weeks we got the blackmail of having to pay a QR code that should have been free, and they canceled it, so now that QR code doesn’t lead to the desired page, creating a big problem to the company, as if he had put in the cellar and tied up his own friend. It's ridiculous to consider the \"test\" for a site that creates QR code as \"a trial period of ONE code\" (besides on the site is not clarified in this sense), if it had been immediately and directly communicated a \"paid version\" we would have used it, but at that moment, looking for a site togenerate a QR code before sending the file to the print shop we used this site, considering to sign up later, waiting to get if it was a half-scam or not, and in fact we did well not to subscribe and not use a paid version because it is tremendously not serious to attract users with this \"trick\". So, we decided to replace it with stickers doing it with another site that REALLY offers a free QR code (forever working) and then we will pay other products by subscribing. In so much competition it is really foolish to create such a phishing and blackmail people afterwards."
        },
        {
          "Note": 1,
          "Lieu": "LT",
          "Pseudo": "Disappointed customer",
          "Nb_Reviews": 2,
          "Date": "2020-12-18T09:43:06.000Z",
          "Titre": "Do not recommend",
          "Contenu": "I was mislead and now I have to purchase a plan every month. Before creating a code there is no information that you are creating a dynamic code. In order to use it later, you have to have a plan. Only static codes are for free but you don't get any information about that. So be careful before using.I was offered to create a new code and a refund of the first payment I had to make. But since I need to use the code for at least a year from now so none of the options fits. And now I will have to pay only because they mislead new clients. And their promise of trying to make the changes doesn't make my situation solved..."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Leandro",
          "Nb_Reviews": 2,
          "Date": "2020-08-06T12:44:17.000Z",
          "Titre": "....",
          "Contenu": "Clearly they are not available to answer to the customer. They are asking me now, that I rated 2 stars if  I had a problem but before they did not answer my contact. The problem is that I am not even now able to write to them because here re-answering is not permitted.2nd Message: Ok Diego, may be it is a misunderstood. I have not received any answer from you. I wil check my Credit Card account if there is any probem I'll contact you. Thank you."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Lesley and Reg Brown",
          "Nb_Reviews": 2,
          "Date": "2020-12-15T12:47:41.000Z",
          "Titre": "Be sure you want to subscribe before you try out",
          "Contenu": "I didn't find it that easy to apply the codes to a page I was going to print but it might have got easier with practice. I did not want it for business I wanted it for voluntary work.  The product is fine but I had not understood at the outset that with this company the codes used in the trial period would be deactivated and no longer work if I did not subscribe at the end of the trial period.  I do think that it should be absolutely clear that the codes created in the trial period will expire once the 2 weeks have expired and a warning ought to be given clearly that it is not advisable to use the trial codes in any permanent paperwork - in my case I also put the website on which was just as well.  Obviously at the outset you just don't know if you want to pay for a subscription and after a week I found it too fiddly.  No doubt the warning was there somewhere in the microscopic small print Ts and Cs; that any codes created would not last beyond the 2 weeks but it was not apparent to me when I went through the process.  So I feel like I wasted my time with it."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Enrique Villa Caballero",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T01:29:35.000Z",
          "Titre": "Sometimes the pojects page gets crazy",
          "Contenu": "Sometimes the pojects page gets crazy, Simply It wasn't let me in. the page didn't discharge at 100%, it seems like it can't enter complety. I tried several times Until the page entered. Last time was today, could you check this issue please? Thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Carly",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:08:23.000Z",
          "Titre": "Solved Problem Quickly!",
          "Contenu": "I sent a chat in with a problem I was having. The chat mentioned they respond in about 20 minutes which was not the case. It happened to be 2:00am when i received a response. I missed it but Luli Ini followed up via email. They were able to solve my problem quickly and efficiently."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "mandy",
          "Nb_Reviews": 1,
          "Date": "2023-03-16T15:21:26.000Z",
          "Titre": "It was quickly en very nice :)"
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Lino Bonetto",
          "Nb_Reviews": 3,
          "Date": "2023-03-10T16:37:44.000Z",
          "Titre": "Easy",
          "Contenu": "an ideal collaborator, very simple and intuitive"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Robert Hall",
          "Nb_Reviews": 9,
          "Date": "2022-08-25T14:38:58.000Z",
          "Titre": "System works well no problems until cancelation",
          "Contenu": "System works well no problems, only issue is with the auto subscription, would have like some notification before renewal to enable a cancelation request to be submitted."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "lesley",
          "Nb_Reviews": 7,
          "Date": "2022-08-03T19:15:29.000Z",
          "Titre": "A couple of challenges getting it to work initially",
          "Contenu": "A couple of glitches that meant certain formats wouldn't work for me  on these dynamic QR. However the chat team sorted out my main problem. The QR codes are really easy to modify too, and change the destination video, which was really important to me"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RB",
          "Nb_Reviews": 1,
          "Date": "2022-12-01T22:11:48.000Z",
          "Titre": "Helpful and easy to increase QR code package via email",
          "Contenu": "Lucas was very helpful"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Charla Chapin",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T23:36:46.000Z",
          "Titre": "Problem fixed in the end.",
          "Contenu": "Luli was very helpful and the problem is nowe fixed, however, I was first told that the problem was occurring on the domain side - which I have been told before and tried to fix, but then all of the sudden (once uQR started looking into it) it was fixed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rachel Willard",
          "Nb_Reviews": 2,
          "Date": "2022-07-08T20:41:38.000Z",
          "Titre": "I appreciate getting service via chat",
          "Contenu": "I appreciate getting service via chat. I found it weird that the agent was reluctant to confirm they helped Me until I left a review. That sounds like holding costumers hostage to a review."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Paige Sowden",
          "Nb_Reviews": 1,
          "Date": "2022-05-04T21:21:29.000Z",
          "Titre": "My experience with Luli was great AFTER…",
          "Contenu": "My experience with Luli was great AFTER we started communicating by email.  The chat only option for customer service stinks.  The delays in conversation are annoying and it takes much longer to resolve issues."
        },
        {
          "Note": 4,
          "Lieu": "MY",
          "Pseudo": "Pong",
          "Nb_Reviews": 1,
          "Date": "2021-06-09T13:30:51.000Z",
          "Titre": "More customisation & flexibilities on the QR code & landing page design",
          "Contenu": "uQR is so far a better than average QR code service provider. The support team are prompt to respond to my query. Of course there's still room to improve in terms of a more friendly user experience for both UX & UI, expand more customisation and flexibilities on the QR code design & landing page design. Looking forward to those additional feature. TQ!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "South Shore Chamber",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T19:28:45.000Z",
          "Titre": "Very easy to set up and use",
          "Contenu": "Very easy to set up and use. Good reporting back. We liked the opportunity to have a few different codes for the one project so we could track where people were seeing the promos."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Bert",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T09:04:23.000Z",
          "Titre": "I appreciate the quick action",
          "Contenu": "I appreciate the quick action. I would however be good to have an EFT option available so we can ensure renewals can be processed through our accounts payable processes."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Mister-r",
          "Nb_Reviews": 12,
          "Date": "2022-04-14T11:57:50.000Z",
          "Titre": "Good product and does what it says",
          "Contenu": "Good product and does what it says to do.Support is responsive.Back end is ok'ish. Nothing amazing but also not bad.This worked good for us in using mobile menu's in Covid times."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Araceli Wendolin Mendoza Pepi",
          "Nb_Reviews": 1,
          "Date": "2022-06-02T21:21:41.000Z",
          "Titre": "Well is the first time we choose QR.me",
          "Contenu": "Well is the first time we choose QR.me, but the service was very good, the info in the webpage is very clear and is simple to use."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "Fiorella Rosario Facciola",
          "Nb_Reviews": 1,
          "Date": "2022-04-25T20:18:53.893Z",
          "Titre": "I think that the price is high compared…",
          "Contenu": "I think that the price is high compared to the use that I’ll give"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Claudia Ramos",
          "Nb_Reviews": 1,
          "Date": "2022-05-12T21:25:13.000Z",
          "Titre": "it was good and easy."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Mathivanan Murugesan",
          "Nb_Reviews": 1,
          "Date": "2021-12-28T01:08:53.000Z",
          "Titre": "Works very well for us !"
        },
        {
          "Note": 4,
          "Lieu": "KH",
          "Pseudo": "Som Dasa",
          "Nb_Reviews": 6,
          "Date": "2021-08-03T04:21:02.000Z",
          "Titre": "Rate your recent experience"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Victor",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T19:10:50.000Z",
          "Titre": "Excellent after",
          "Contenu": "Excellent after - sales, very friendly"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lauren Brickley",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T17:26:43.000Z",
          "Titre": "Great customer service and really useful platform",
          "Contenu": "We've been using UQR for a couple of years and have found it a really helpful platform to keep track of our QR codes and monitor performance. Would recommend to anyone looking for a platform and the customer service has always been fantastic, the team are happy to help and answer any questions you may have to help you get the most out of UQR!"
        },
        {
          "Note": 5,
          "Lieu": "DO",
          "Pseudo": "Monarca Bistro Menú",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T22:38:41.000Z",
          "Titre": "Excellent costumer service!",
          "Contenu": "Excellent costumer service!Hardworking people that truly solve your problems, while being lovely at the same time. 5 stars to the person that served me, Milena.More than satisfied with the QR and the people that keep it running.Thank You."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne Vidmar",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T22:48:03.000Z",
          "Titre": "Lucas was fantastic",
          "Contenu": "Lucas was fantastic at helping solving a very specific glitch issue that happened with when uploading an updated PDF to my menu format QR Code. We spoke and worked over the course of 3 days to solve the issue. He was timely in his responses and very helpful."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Naor",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T22:10:13.000Z",
          "Titre": "quick and professional response",
          "Contenu": "I was used to logging in using a username and password, and today, after about two years of not logging in to my account, I found out that they changed the login methods to email and password. And I had no idea which of my emails I used to sign up. I sent a message in the help center and a representative named Franco helped me locate my email within 2 minutes. Thank you very much for a quick and professional response 🥰"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "J. Duggan",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T17:53:22.000Z",
          "Titre": "Paula was very helpful",
          "Contenu": "Paula was very helpful. Checked on everything I wondered about, even generating a sample of the stats report. She also searched up the discount link for nonprofits which I so appreciated."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "patricia bakosh",
          "Nb_Reviews": 2,
          "Date": "2022-12-30T23:29:54.000Z",
          "Titre": "Lucas Helped me troubleshoot where my…",
          "Contenu": "Lucas Helped me troubleshoot where my QR code was and how to see the statistics. I had two accounts, one from work and one from personal. I used the personal account as a test site to see how the public received the mailing I sent over the holidays. Thus out of 300 sent, six responded and interacted with the QR code.Thank you, Lucas, for taking the next step to help."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marton Primary",
          "Nb_Reviews": 2,
          "Date": "2022-11-09T16:51:37.000Z",
          "Titre": "Brilliant service",
          "Contenu": "Brilliant service, allows you to keep the same QR code but change the forwarding URL perfect for things like Newsletters (this is what we use it for in our school, we have one QR code and the newsletter changes each week). Their customer service is second to none and i would highly recommend them. We are a school in the NW of England, UK."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherri Matlock",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T16:52:46.000Z",
          "Titre": "Lucas-Top Notch Team Member",
          "Contenu": "Lucas was attentive and very patient/professional in his responses to my very ignorant questions.  I appreciated this as I am a \"5\" on the \"being adept at technology scale\" (1-10).  My question was answered and he then added additional resources for me so that I could be successful with the task in front of me. Lucas was definitely knowledgeable. I can see that he is a valuable asset to your team.  Thank You!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T01:20:03.000Z",
          "Titre": "Account Query on Ownership Transfer",
          "Contenu": "I messaged with a query about account ownership... within 2min a lovely, friendly woman called Donna replied. Gave me all the info I required in a quick timely fashion and made my morning!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Nick",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T21:49:25.000Z",
          "Titre": "I used the chat function for a question…",
          "Contenu": "I used the chat function for a question about how to navigate around the UQR.me website. Milena was very helpful: Concise with her information, quick to respond and approachable in her tone. A professional."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Riccardo",
          "Nb_Reviews": 4,
          "Date": "2023-06-08T15:33:57.000Z",
          "Titre": "Customer support as it should always be",
          "Contenu": "Donna, the person who helped me out with my issue, she has been very kind and precise. She solved my problem and kept me updated throughout all the customer support path! Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George Liu",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T00:25:42.000Z",
          "Titre": "Easy to use QR cod generator",
          "Contenu": "Easy to use QR cod generator with link and social media support. Great way to manage points of contact and track campaigns. Customer service was prompt with resolving a billing issue."
        },
        {
          "Note": 5,
          "Lieu": "AD",
          "Pseudo": "Antonio Cañabate Jiménez",
          "Nb_Reviews": 2,
          "Date": "2022-11-15T17:08:51.000Z",
          "Titre": "A great atention",
          "Contenu": "She was able to give me a solution to my problem, she didn't just answer me, she investigated the possible origin of the fault, she fixed it and taught me not to make mistakes on subsequent occasions, all with patience and a lot of empathy. Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Greenfield",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T19:52:40.000Z",
          "Titre": "Issue quickly resolved, give Paula a raise!",
          "Contenu": "Paula was knowledgable, very helpful, and on top of the situation. She quickly resolved my issue. I think the auto-message that a reply is typically quickly made within minutes could be updated, as it took about 30 or so minutes to talk to someone, but that's pretty nitpicky. I'm happy my issue was resolved and resolved quickly."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Nisar Mohammed Siddiqui",
          "Nb_Reviews": 1,
          "Date": "2022-09-08T19:16:01.000Z",
          "Titre": "uQR is a great platform for creating…",
          "Contenu": "uQR is a great platform for creating and managing QR codes for organisations. It's very easy to use and user friendly. It has helped us digitise our restaurant menu during covid and increased our customer satisfaction and our review score."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Suman",
          "Nb_Reviews": 4,
          "Date": "2023-01-04T21:48:36.000Z",
          "Titre": "Best QR Code generators [2022] The only…is best",
          "Contenu": "Best QR Code generators [2022] The only list you’ll ever need!A detailed comparison of QR Code generators (yes, I tested all of them).Best QR Code generator: Choose the right oneYour QR Code is a marketing channel. Pick a QR solution, not just a generator.QR Codes have been around for two decades, but they never became mainstream. 2020–21 changed that. As the pandemic hit in 2020, QR Codes took the center stage. Brand owners and marketers felt inclined to use QR Codes as a contactless solution driver. From adding them on product packaging to replacing physical menus with QR Codes, these scan codes are everywhere. What started as a contactless way to deliver information, evolved into a direct-to-consumer communication channel for most brands.But QR Codes are often associated with security threats. To help you choose the safest and best QR Code generator for your use case, I tested and put together a comprehensive comparison sheet."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joy L",
          "Nb_Reviews": 4,
          "Date": "2022-10-26T16:42:09.000Z",
          "Titre": "Good customer service",
          "Contenu": "I'm new to QR codes (not using them, but having our own for a new business). This is the ONLY company I found that has good reviews. I needed help choosing a plan and I was able to connect with a real person via live chat in less than a minute. Luli was super-helpful and very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Frida Méndez",
          "Nb_Reviews": 1,
          "Date": "2023-04-17T21:12:07.000Z",
          "Titre": "Really good service",
          "Contenu": "Really good service, super easy and intuitive website to generate and mofied your QRs, great response team to any doubt or problem you have. 10/10"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T16:42:30.000Z",
          "Titre": "Quick Response",
          "Contenu": "Paula gave me quick response with the answer I needed about roles.  I also shared that I couldn't find \"roles\" on the support page and she told me to search for  \"user management\".  It might nice if \"roles\" was a searchable word.    Again, Paula, was quick and efficient.   Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lance F.",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T17:36:59.000Z",
          "Titre": "Paula Pepe was AMAZING",
          "Contenu": "Paula Pepe was AMAZING. She answered ALL My questions and provided me backup resources to check and she also was very kind and quick to respond. She is a customer service superstar!!!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Calero Lanzar",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T18:41:20.000Z",
          "Titre": "They always solve any questions or…",
          "Contenu": "They always solve any questions or problems within minutes. They are very helpful and professional. Cecilia has always helped us with everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marcela",
          "Nb_Reviews": 2,
          "Date": "2023-06-28T21:22:56.000Z",
          "Titre": "It was a pleasure working with Milena",
          "Contenu": "It was a pleasure working with Milena! She was super helpful and patient with me. Helped me navigate and understand the site more which I truly appreciate."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Mikhaila Coerecius | Pargo",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T13:01:57.000Z",
          "Titre": "Received quick and friendly customer…",
          "Contenu": "Received quick and friendly customer support. All my queries were answered and the person who helped was even willing to set up a meeting and assist further."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Beth D",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T00:03:02.000Z",
          "Titre": "Great Customer Service",
          "Contenu": "Milena in Customer Service was fantastic.  She helped resolve my problem quickly and with little effort.  Thank you so much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis Bellas",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T17:53:48.000Z",
          "Titre": "Their product is topnotch…",
          "Contenu": "Their product is topnotch I've worked with a few companies that offer the same services and uQR.me is by far the easiest to use, great price, and support is super helpful and kind."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Alex",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T14:12:08.000Z",
          "Titre": "Great support",
          "Contenu": "Great support! Very responsive and solution oriented with my request."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Francois",
          "Nb_Reviews": 2,
          "Date": "2022-11-08T16:23:10.000Z",
          "Titre": "Luli",
          "Contenu": "Luli, understood my needs and were not just focused on selling me something, but first checking if they have what we are looking for"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alan",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T10:42:34.000Z",
          "Titre": "Donna was super helpful and responsive",
          "Contenu": "Donna was super helpful and responsive, she went out of her way to help and ensure our issues were resolved asap."
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "Md Shafaet",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:41:28.000Z",
          "Titre": "This is very good"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ivey",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T20:51:14.000Z",
          "Titre": "Quick Resolution",
          "Contenu": "Lucas was able to help me identify the issue and even came up with an interim solution while we waited for the tech team to merge accounts!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Johan",
          "Nb_Reviews": 3,
          "Date": "2023-05-31T13:37:25.000Z",
          "Titre": "Great knowledge and fast service",
          "Contenu": "Their communication, knowledge and solutions are at top level, with short response time and fast solutions to any query. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lori Timney",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T19:13:59.000Z",
          "Titre": "Milena has been very professional and…",
          "Contenu": "Milena has been very professional and helpful in closing my account as my website will soon be closed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather Hill",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T18:05:14.000Z",
          "Titre": "Quick and efficient help",
          "Contenu": "I contacted chat with a question about upgrading my account and while it seemed like they were more used to troubleshooting technical issues they were able to help me upgrade quickly when we ran out of codes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T22:20:03.000Z",
          "Titre": "Great customer service",
          "Contenu": "I had a question about switching from monthly billing to annual billing, and when I reached out via the website chat function, Lucas answered quickly, clearly, and respectfully."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "JJ",
          "Nb_Reviews": 1,
          "Date": "2022-11-30T15:26:04.000Z",
          "Titre": "The assistant was very friendly and professional, find solution for my plan.",
          "Contenu": "The assistant was very friendly and professional, giving me the answers to my questions.Also I had assistance for a new plan, with clear explanation of all the features! Thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Rollar II",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T18:33:06.000Z",
          "Titre": "I was so impressed with how responsive…",
          "Contenu": "I was so impressed with how responsive and helpful the team was here. They really cared about my situation and also were so quick to solve my problem."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexis Weatherspoon",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T03:04:25.000Z",
          "Titre": "straight to the point!",
          "Contenu": "Helpful in getting straight to the point of my issue. I'll be on my way now happily making QR codes for my organization!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Liran",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T13:14:13.000Z",
          "Titre": "Extremely quick and effective response",
          "Contenu": "Extremely quick and effective response, was hard to believe that a human being answered that fast. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Erwin",
          "Nb_Reviews": 2,
          "Date": "2023-06-30T11:04:44.000Z",
          "Titre": "The contactperson helped me really fast…",
          "Contenu": "The contactperson helped me really fast and accurate!in simple texts. Very happy with this company,Erwin"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T22:44:38.000Z",
          "Titre": "Their customer service got back to me…",
          "Contenu": "Their customer service got back to me right away when I had trouble so that meant a lot to me. In the end it all worked out so I would give them five stars. The last place I dealt with was slow as molasses getting back to you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madeleine Brown",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T05:08:14.000Z",
          "Titre": "Donna did great at reassuring me and…",
          "Contenu": "Donna did great at reassuring me and then resolving my issue within 24 hours of my request. Excellent response time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CP",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T17:53:40.000Z",
          "Titre": "I was very happy to receive immediate…",
          "Contenu": "I was very happy to receive immediate assistance with an issue I was having, both in the initial response time to my chat request as well as a fix needed from uQR's IT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Wheeler",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T19:30:16.000Z",
          "Titre": "Luli was terrific!",
          "Contenu": "Luli was terrific and knew exactly how to guide me through the process of getting my QR code up and running."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Artecomp, S.L.",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T10:57:36.000Z",
          "Titre": "Impeccable customer service",
          "Contenu": "Impeccable customer service. I had a problem with a bill and they fixed it right away. Very friendly, I totally recommend, thank you!"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Juan Rivas",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T11:04:20.000Z",
          "Titre": "Great helpdesk service",
          "Contenu": "Great helpdesk service, very fast and so polite, Cecilia is the best partner to talk if you have any problem"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emmanuell Masso",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T16:20:31.000Z",
          "Titre": "Best & Easiest Way To Create QR codes!",
          "Contenu": "We have been using uQR.me for almost a year now and we couldn't be happier. The ease of use of the portal and support from the uQR.me team has made the process seamless."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "JJ",
          "Nb_Reviews": 3,
          "Date": "2022-11-22T17:49:59.000Z",
          "Titre": "They are a good communicators",
          "Contenu": "They are a good communicators - follow through on what they say, which nowadays is not the most common"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Isabel",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T21:29:12.000Z",
          "Titre": "The answers were immediate",
          "Contenu": "The answers were immediate. I really feel close with uQr team. It has been a help for me, and without your support I couldn´t have done what I have achieved.Thanks!!Isabel"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T16:56:51.000Z",
          "Titre": "Luli was a great help",
          "Contenu": "Luli was a great help! I signed up for the wrong thing by mistake and she was great to help me out. She went above and beyond to help get everything straightened out and to see about getting  an old QR code reactivated. She’s a keeper!"
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Heather Pearse",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T10:58:12.000Z",
          "Titre": "Help was readily available to help.",
          "Contenu": "Help was readily available and quick to understand and respond to resolve my query."
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Yassine Mahfoud",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T16:22:07.000Z",
          "Titre": "Paula the awesome support staff",
          "Contenu": "Paula was very responsive and fixed the billing issue in a matter of minutes!"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "George Lambrakis",
          "Nb_Reviews": 1,
          "Date": "2022-11-04T06:35:59.000Z",
          "Titre": "Great support",
          "Contenu": "A nice service, easy to use and with great features!The most incredible was the 5 star after sales support even when I had to quit the service! A \"must use\" tool if you want such a service!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Harry Barton",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T01:08:25.000Z",
          "Titre": "Quick response and it was easy for me…",
          "Contenu": "Quick response and it was easy for me to follow the instructions from the agent to fix my account."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T18:30:11.000Z",
          "Titre": "Luli has been very helpful answering my…",
          "Contenu": "Luli has been very helpful answering my questions. She even called to walk me through some testing to make sure it was right the first time! Thanks for all your help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kasey C",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T23:44:24.000Z",
          "Titre": "Customer support was great",
          "Contenu": "Customer support was great! Lucas responded to my request within seconds and gave me the info I was looking for."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T17:04:57.000Z",
          "Titre": "Milena was very helpful and responsive",
          "Contenu": "Milena was very helpful and responsive, wish everyone would work like she does :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlie Morris",
          "Nb_Reviews": 2,
          "Date": "2023-02-07T19:48:23.000Z",
          "Titre": "Support responded immediately to any…",
          "Contenu": "Support responded immediately to any concerns I had and fixed any issues.I highly recommend uQR.me for an excellent QR Code Generator."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "QR Coder",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T16:10:24.000Z",
          "Titre": "Lucas was very helpful and quickly…",
          "Contenu": "Lucas was very helpful and quickly resolve my issue while providing future troubleshooting help."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Jo Mogale",
          "Nb_Reviews": 2,
          "Date": "2022-09-16T09:40:18.000Z",
          "Titre": "Donna was super helpful with my…",
          "Contenu": "Donna was super helpful with my situation. I have been with UQR for over a year now and absolutely loving it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "QR Coder",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T13:08:19.000Z",
          "Titre": "Issue was solved very quickly and the…",
          "Contenu": "Issue was solved very quickly and the support person was very knowledgeable on there systems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EG",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T18:54:21.000Z",
          "Titre": "Platform was easy to use and customer…",
          "Contenu": "Platform was easy to use and customer care chat was helpful. Love having a real person to talk to."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2022-12-05T20:24:00.000Z",
          "Titre": "Good job Lucas",
          "Contenu": "Lucus answered me quickly and really tried to provide answers that I needed not generic answers"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Dan Rupoli",
          "Nb_Reviews": 3,
          "Date": "2023-01-09T01:21:44.000Z",
          "Titre": "Quick response",
          "Contenu": "Quick response, knew the product and got me prompt answers. It was a pleasure to communicate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia Rittenhouse",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T16:22:44.000Z",
          "Titre": "Prompt and Friendly!",
          "Contenu": "I had a download issue that the uQR.me team was not able to replicate on their end so they kindly set up a Google Meet so we could share screens. A good clean out of the cache cleared it up.Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Kay",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T15:34:52.000Z",
          "Titre": "Fast response to my email",
          "Contenu": "Fast response to my email. Requested an invoice and received it in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antonio Ruiz",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T19:03:22.000Z",
          "Titre": "My experience was excellent!",
          "Contenu": "My experience was excellent!Melena was awesome! She provided good customer service from beginning to end."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie Dixon",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T21:31:21.000Z",
          "Titre": "Timely and helpful",
          "Contenu": "Lucas was quick to respond and very helpful with the issue I was having. Everything was resolved. Easy peasy! =]"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "mig ang",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T18:59:41.000Z",
          "Titre": "Lucas was very informative and quick",
          "Contenu": "Lucas was very informative and quick. He answered every question right away."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Canana Canana",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T18:11:53.000Z",
          "Titre": "Cecilia attended me quickly and until…",
          "Contenu": "Cecilia attended me quickly and until my problem was solved. I appreciated it very much."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Giuseppe - Giunti TVP",
          "Nb_Reviews": 2,
          "Date": "2023-10-03T13:07:32.000Z",
          "Titre": "It works!",
          "Contenu": "After long time, now the platform is very well structured and smart."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T21:47:18.000Z",
          "Titre": "Great service!",
          "Contenu": "I was helped by Melina. She offered incredibly easy solutions to the requests I had, and was timely and available."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Alan Ferguson",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T15:39:19.000Z",
          "Titre": "Thanks for the product and support",
          "Contenu": "We used this as a one off project which it worked well for. Online support is very quick and efficient. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "Nicolò",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T15:30:10.000Z",
          "Titre": "Really quick and efficient support",
          "Contenu": "Rather easy to use and functional platform. Really quick and efficient support normally."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rita Fields",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T02:37:52.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent. Easy to use for the most part but customer service was very responsible when I did need additional assistance."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Maya WB Tropic",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T16:32:23.000Z",
          "Titre": "Great support service",
          "Contenu": "Support service was very efficient and quick to respond. Query was resolved quickly."
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Sergey Abovyan",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T23:33:50.000Z",
          "Titre": "Perfect knowledge of the subject Perfect knowledge of the subject by staff. Very fast responsby…",
          "Contenu": "Perfect knowledge of the subject by staff. Very fast response"
        },
        {
          "Note": 5,
          "Lieu": "BG",
          "Pseudo": "Nikola Tenchev",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T15:27:47.000Z",
          "Titre": "Perfect experience",
          "Contenu": "It was very helpful as the person answered all my questions plus gave me additional information to check in order to make a better decision."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "QR Coder",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T18:28:58.000Z",
          "Titre": "Great helper",
          "Contenu": "The attendant was kind, polite, and solved my problem very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 3,
          "Date": "2022-09-14T22:18:32.000Z",
          "Titre": "Lucas quickly helped me by changing the…",
          "Contenu": "Lucas quickly helped me by changing the expiration date on my plan."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin C.",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T20:08:41.000Z",
          "Titre": "Responded to my email extremely quickly…",
          "Contenu": "Responded to my email extremely quickly with helpful info and links."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Justin",
          "Nb_Reviews": 1,
          "Date": "2022-12-02T01:54:30.000Z",
          "Titre": "Quick and helpful!",
          "Contenu": "They were quick to respond and address my need. Very personable support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DG INc",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T18:14:30.000Z",
          "Titre": "Lucas was very helpful and answered my…",
          "Contenu": "Lucas was very helpful and answered my questions timely and confidently."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Makayla Drummond",
          "Nb_Reviews": 4,
          "Date": "2023-02-16T11:42:03.000Z",
          "Titre": "Donna helped me quickly and…",
          "Contenu": "Donna helped me quickly and professionaly.  Satisfied with the outcome."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Daniela Alexandra Gavilán Mald",
          "Nb_Reviews": 1,
          "Date": "2022-11-10T21:27:17.000Z",
          "Titre": "The Luca´s attention was good",
          "Contenu": "The Luca´s attention was good, he helped me to resolve my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dev Cadas",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T21:17:04.000Z",
          "Titre": "Tried to solve my problem patiently",
          "Contenu": "Tried to solve my problem, which was probably operational at my end.... :("
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sophie Taylor",
          "Nb_Reviews": 2,
          "Date": "2022-10-24T09:49:29.000Z",
          "Titre": "Great customer service",
          "Contenu": "Very helpful and quick responses. Overall great site for managing QR codes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anna",
          "Nb_Reviews": 3,
          "Date": "2022-10-12T21:09:03.000Z",
          "Titre": "Helped with payment schedule",
          "Contenu": "Helped me with my payment schedule. Always helpful whenever I need assistance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott Alder",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T20:05:46.000Z",
          "Titre": "The woman that helped me on the group…",
          "Contenu": "The woman that helped me on the group chat. She helped me get the QR code right and stayed until I was happy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Cattin",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T15:25:02.000Z",
          "Titre": "The chat person was very helpful in…",
          "Contenu": "The chat person was very helpful in assisting me with my request."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dani",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T16:09:18.000Z",
          "Titre": "Lucas was really helpful and quick to…",
          "Contenu": "Lucas was really helpful and quick to respond. I not only had a response in a couple of minutes but also the fix was really quick"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Jun Donovan",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T01:30:33.000Z",
          "Titre": "Great customer service",
          "Contenu": "They have great customer service. Fast response time and super helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alisha Neva",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T00:38:06.000Z",
          "Titre": "Donna was kind and very helpful",
          "Contenu": "Donna was kind and very helpful! She answered my question in a timely manner and was thorough."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matt Weiner",
          "Nb_Reviews": 1,
          "Date": "2022-12-05T18:17:14.000Z",
          "Titre": "Lucas was very helpful and patient and…",
          "Contenu": "Lucas was very helpful and patient and quickly addressed my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T00:16:07.000Z",
          "Titre": "Donna was very nice to message with and…",
          "Contenu": "Donna was very nice to message with and helped me resolve my issue quickly"
        },
        {
          "Note": 5,
          "Lieu": "BE",
          "Pseudo": "Bart D'haenens",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T14:30:30.000Z",
          "Titre": "Friendly people and quick solutions",
          "Contenu": "The people are always very friendly and problems get solved quickly."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Blair Ann Verrier",
          "Nb_Reviews": 1,
          "Date": "2022-09-09T02:47:38.000Z",
          "Titre": "Customer service team was friendly and…",
          "Contenu": "Customer service team was friendly and easy to deal with.  I had my query resolved quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CJ TaYLOR",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T21:18:44.000Z",
          "Titre": "Was a excellent help very fast on reply…",
          "Contenu": "Was a excellent help very fast on reply and helpful"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Yvette van den Broeck",
          "Nb_Reviews": 1,
          "Date": "2023-03-31T00:23:58.000Z",
          "Titre": "Lucas was professional",
          "Contenu": "Lucas was kind, patient and always willing to help."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Rafael",
          "Nb_Reviews": 4,
          "Date": "2023-01-04T16:27:56.000Z",
          "Titre": "They quickly solve my request or issue…",
          "Contenu": "They quickly solve my request or issue with questions or hesitations."
        }
      ]
    }
  ]
}