{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "qualitymacs.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Max B.",
          "Nb_Reviews": 1,
          "Date": "2022-06-13T16:49:03.000Z",
          "Titre": "“Unforseen circumstances”",
          "Contenu": "My order was cancelled without any other explanation than “unforseen circumstances”. They did not contacted me to offer a more thorough explanation or any kind of solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Archviz Pro",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T19:07:19.000Z",
          "Titre": "Great equipment you can trust."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Hall",
          "Nb_Reviews": 3,
          "Date": "2022-04-13T02:10:26.000Z",
          "Titre": "The Apple MacBook Pro was overall pretty decent",
          "Contenu": "The Apple MacBook Pro pretty decent, I would not have called it pristine as was described though. The MacBook was packed in the original box, however, without any protection from the charging cable, as a result of that, the backside of the laptop has some scuffing on the MacBook case. It does have the Apple Warranty until 2024, so that is a positive."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rick Ingram",
          "Nb_Reviews": 3,
          "Date": "2022-05-04T20:56:39.000Z",
          "Titre": "Will definitely buy from QM again",
          "Contenu": "Everything was great and my Macbook Pro is just as described and works perfectly. Will definitely buy from QM again and have recommended them to 4 friends. The only reason for not being 5 stars was it took longer than expected to ship and I had no communication on why it hadn't shipped or when it would. (Ordered morning of Friday April 1 and notified Tuesday April 5 afternoon) Not a big thing but something that could be improved on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Arthur Carter",
          "Nb_Reviews": 9,
          "Date": "2022-08-22T23:30:15.000Z",
          "Titre": "Excellent prices and customer support",
          "Contenu": "Excellent prices and customer support. The gear sold comes as described. The only weakness is using Fedex for your shipping... my experience over the last couple of years is Fedex has seriously declined in their ability to deliver on time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "James Schmitt",
          "Nb_Reviews": 1,
          "Date": "2020-09-26T01:34:19.000Z",
          "Titre": "Fair pricing. Good seller.",
          "Contenu": "Transaction was smooth,Delivery prompt and the item was as described. I will do additional business with Quality Macs again when possible."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "rob burkhardt",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T02:13:01.000Z",
          "Titre": "A great experience I would buy from…",
          "Contenu": "A great experience I would buy from them again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anonymous Nomenclature",
          "Nb_Reviews": 1,
          "Date": "2020-08-18T16:19:08.000Z",
          "Titre": "Thanks",
          "Contenu": "Thanks. Item as described."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bruce Saunders",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T23:00:41.000Z",
          "Titre": "Very good experience"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T05:15:47.000Z",
          "Titre": "Return customer because Quality Macs is great",
          "Contenu": "I have purchased a couple of Macs from Quality Macs. It has been a good experience both times. Macs were as described, and quickly delivered. I wish I could say that their support team was great, but I have never had to contact support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Jacobs",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T20:03:37.000Z",
          "Titre": "I am a long-time customer and fan of Quality…",
          "Contenu": "I am a long-time customer and fan of Quality Macs, and I have to say that every interaction with their team is wonderfully professional, extremely knowledgeable, and enjoyable. They are my absolute \"go-to\" for any new Mac product I want to purchase. I have purchased iPads, Apple Watches, Laptops, and keyboards, they are simply an amazing resource!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T.J.",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T18:37:00.000Z",
          "Titre": "Friendly, Prompt and Descriptive with Quality Used Macs on Hand",
          "Contenu": "Prompt communication from online inquiries.  The descriptions of their used inventory along with pictures made it incredibly efficient to pick out a used MacBook that has suited my needs and looks like I bought it brand new.  The added warranty coverage through Quality Macs means I feel secure that my new laptop will last well into the future for me."
        },
        {
          "Note": 5,
          "Lieu": "CU",
          "Pseudo": "Vicente García Armador",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T04:19:05.000Z",
          "Titre": "A good choice",
          "Contenu": "Thank you very much for your services. I confess that I was a little skeptical at first, because buying online has never been my thing, but a friend recommended it and everything else is history. The money I've saved with you, I've been compensated by this letter, now I can work and design with the Mac you wanted thanks to the good price/quality ratio of the devices you sell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Ingram",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T20:54:36.000Z",
          "Titre": "Great price, Great service.",
          "Contenu": "Great price, free shipping and exactly what I ordered in the pristine condition described. Packaging was excellent and delivery was ahead of schedule. Will continue shopping with Quality Macs as I have for the last 6 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Grossberg",
          "Nb_Reviews": 2,
          "Date": "2023-11-06T02:23:36.000Z",
          "Titre": "reliable refurbs and great customer service",
          "Contenu": "Refurbished electronics have a lower environmental impact than new. With Quality Macs I can trust their assessment of the refurb the reliability of their work. Prices are very good and they're easy to do business with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ISA staff",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T20:50:44.000Z",
          "Titre": "awesome quality on 2 macbook pros",
          "Contenu": "2nd macbook pro bought through them in the last 4 years. Awesome response and the description in the items is exactly what you get or even better."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JARET",
          "Nb_Reviews": 1,
          "Date": "2023-07-03T23:57:11.000Z",
          "Titre": "Excellence",
          "Contenu": "What the Customer sees is what the Customer gets. \"E\" was a gracious and patient Staff member, and he knows his hardware. I feel like I wasted his time because I reviewed all of the machines online first. I like the documented 'scratch and dent' situations, as these are like refurbished cars which are really new only once. But, I can't tell this machine was previously owned. I'm extremely satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Van Porter",
          "Nb_Reviews": 2,
          "Date": "2022-07-28T07:05:11.000Z",
          "Titre": "Shoes for these crews of hard workers, Thanks 🙏",
          "Contenu": "Fantastic service from everyone working there, they all know their macs. Would I go back? Absolutely, do they sell great condition items? Absolutely, I’m extremely picky about where I get and purchase A refurbished item. These products are top notch, thoroughly diagnosed, examined, cleaned and as good as any floor model that you would find in Apple store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Van Porter",
          "Nb_Reviews": 2,
          "Date": "2022-07-28T07:03:49.000Z",
          "Titre": "Fantastic service from everyone there",
          "Contenu": "Fantastic service from everyone working there, they all know their macs. Would I go back? Absolutely, do they sell great condition items? Absolutely, I’m extremely picky about where I get and purchase A refurbished item. These products are top notch, thoroughly diagnosed, examined, cleaned and as good as any floor model that you would find in Apple store."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Damilola Olatunji",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T23:03:04.000Z",
          "Titre": "My MacBook Pro arrived  as described…",
          "Contenu": "My MacBook Pro arrived  as described with all the required accessories. In addition, the product came with a new box and well-packaged."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anne Foster",
          "Nb_Reviews": 3,
          "Date": "2023-03-09T21:57:36.000Z",
          "Titre": "Love it here!",
          "Contenu": "We love this place and wouldn’t buy a computer anywhere else (have purchased 3 over the years)! Enzo was friendly and so very knowledgeable; helped us pick a laptop that is perfect for me and listened to my questions very patiently! It’s SO much more affordable here than purchasing a new laptop and it works perfectly! I recommend them without reservation!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javi Domo",
          "Nb_Reviews": 1,
          "Date": "2020-07-24T03:10:02.000Z",
          "Titre": "Deal or steal?",
          "Contenu": "Bought a 6-month-old MacBook with minor cosmetic imperfections for 400 below the original price. The laptop was just as described and pictured on eBay, and was shipped way faster than expected...through a pandemic! No original packaging, but the condition was like new. 3 months in, I'm highly content that I purchased through QualityMacs.PS - they also give you the exact health status of the laptops battery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Leyton",
          "Nb_Reviews": 4,
          "Date": "2023-03-04T16:41:45.000Z",
          "Titre": "Best Mac reseller around!",
          "Contenu": "I been doing business with QM for over 3 years and they are far and away the best Mac reseller around!   Their customer service is first rate and their products are all very reasonably priced for their age and condition.   I have purchased 4 laptops from them, and would never hesitate to buy another when I need one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Monica",
          "Nb_Reviews": 3,
          "Date": "2022-08-15T04:12:59.000Z",
          "Titre": "While looking for a third party apple…",
          "Contenu": "While looking for a third party apple product resellers I came across Quality Macs account on eBay. I saw their apple products and investigated their main website to see if they have legit apple products and other affordable devices. After purchasing my IPad Pro 11 inch 3rd generation with the Apple Pencil for $834 in Excellent condition.  I couldn’t believe it was legit and affordable for the deal I got. Will definitely support and purchase again in the future!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason W.",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T21:51:03.000Z",
          "Titre": "This is the 5th refurbished apple…",
          "Contenu": "This is the 5th refurbished apple computer our family has purchased through Quality Macs. We keep getting totally functional machines at a steep discount"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Ziegler",
          "Nb_Reviews": 3,
          "Date": "2023-08-13T01:21:16.000Z",
          "Titre": "Very high quality product",
          "Contenu": "Very high quality product, fair prices, fast shipping, great selection. Very knowledgeable too. An Apple experience like in the good old times...."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott H.",
          "Nb_Reviews": 1,
          "Date": "2022-08-26T01:52:11.000Z",
          "Titre": "I've purchased Mac products exclusively…",
          "Contenu": "I've purchased Mac products exclusively at Quality Macs for years.  Recently bought both a late-model MacBook Pro and an iMac.  Very satisfied, they provide an accurate and detailed description on-line and items I've purchased in the past have worked perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gerhard gross",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T15:09:37.000Z",
          "Titre": "Great used Mac",
          "Contenu": "Great used Mac! Better features than the competitors for similar price. Received only a few days after order in quality packaging, no damage. The computer has been working perfectly, no issues. Would recommend this vendor."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve L",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T02:21:37.000Z",
          "Titre": "Don’t buy from anyone else! Trust Quality Macs!",
          "Contenu": "Great presales support! Answered every question completely and helped guide me to a system capable of the type of applications my daughter would be using for music editing.  Before I even knew what I was going to buy, I was completely certain that I’d be buying from Quality Macs and that proved to be the right decision! The system was flawless and runs perfectly.  Thanks Quality Macs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Leyton",
          "Nb_Reviews": 4,
          "Date": "2022-05-31T15:40:29.000Z",
          "Titre": "Best Mac reseller around!",
          "Contenu": "QM is absolutely the best Mac reseller I have ever dealt with.   The products are exactly as described, and their customer service is second to none.   I have purchased 3 computers from them over the last couple of years and will only go to them when I need another.   There may be some out there that are a few dollars less, but there are a lot of unknowns when you buy from auction sites.   The option to purchase an extended warranty, is also a huge bonus, and it's less, per the value of the computer, than Apple Care would be.   I can't say enough good things about Quality Macs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2022-04-04T18:31:14.000Z",
          "Titre": "This is the second higher-end iMac I’ve…",
          "Contenu": "This is the second higher-end iMac I’ve purchased from Quality Macs. The first was a five year old iMac bought in 2015, and this one is also five years old. Both iMacs look and function like brand-new and shipped with the latest macOS when I received them. The first iMac which is now 12 years old still runs like a top even after extensive business and personal use, and the included HDD, SSD and internal DVD drives as shipped are still functioning fine. I believe because Macintosh hardware in general is built to last, and that Quality Macs sells well-inspected exceptional Macs, buying a Mac from Quality Macs that is 2 to 5 years old is a great way to get a lot of bang for your computer buck. Knowledgeable responses to questions and quick shipping, too. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "edward wilk",
          "Nb_Reviews": 2,
          "Date": "2020-08-19T00:07:15.000Z",
          "Titre": "13\" MacBook Pro -satisfies!",
          "Contenu": "this was only my second computer.  I had previously had a 17\" MacBook Pro.the 13\" fits my uses  with much more agility, plus the repair shop guy said the 13\"s held up better than the 17\"s and the 15\"s. so far so good, also I did not want the super thin keyboard (newer models), and the multifunctional touch-screens (newer models) they were way past my comfort /skill levels.  so,  all told my 2015 fills my bill exactly. thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BRENDAN HOGARTY",
          "Nb_Reviews": 3,
          "Date": "2020-08-18T17:44:08.000Z",
          "Titre": "I am always looking for ways to save…",
          "Contenu": "I am always looking for ways to save money and help keep my environment a little bit greener by supporting businesses that deal in refurbished products.  The computer I purchased looked brand new!  It works flawlessly and I am so happy I stumbled across Quality Macs website during my \"used Mac search\" on Google.  This was a no brainer because the prices are great, the service is stellar, the shipping is easy & free, they deal in trade-ins as well, and I received very timely and clear emails on what to expect along the way.  I give Quality Macs my highest recommendation and will purchase from them again.Brendan H."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bret Pearson",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T22:25:48.000Z",
          "Titre": "Been a QualityMacs customer for years",
          "Contenu": "Been a QualityMacs customer for years, they’re always fast and friendly with their shipping and customer service. I can always easily recommend their store on eBay and their new online storefront if you’re buying anything Apple new or used. Cheers to the team at QualityMacs for their superb products and high standards!"
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Zoltan Matrai",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T09:04:52.000Z",
          "Titre": "feedback",
          "Contenu": "Solid, good service. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Compton",
          "Nb_Reviews": 4,
          "Date": "2020-09-18T23:22:14.000Z",
          "Titre": "I was very apprehensive buying my…",
          "Contenu": "I was very apprehensive buying my MacBook online, but the experience was superb. My machine is flawless and has no issues whatsoever. Like new, but with a big cost savings and AppleCare to boot. I would buy again fromQuality macs in a microsecond. Many thanks. You vastly exceeded my expectations. I also bought the extended warranty and feel completely covered for any eventuality."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "American",
          "Nb_Reviews": 2,
          "Date": "2022-07-21T15:35:15.000Z",
          "Titre": "Patience & Education",
          "Contenu": "It’s not my first go around with the company. There service is on point so I went back. I went in specifically to purchase an I watch 3, but after comparison and discussion with sales person I moved past what I thought I wanted and got what was a better purchase. I’m completely happy with my purchase and appreciate the time they took to make me / help me make the right decision."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Simpson",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T20:02:19.000Z",
          "Titre": "Second time buying, definitely won’t be the last",
          "Contenu": "This is the second Mac I’ve bought from Quality Macs, and as far as I’m concerned it’s the only place to buy Macs if you’re getting one second hand. They describe the items very clearly and accurately, and they get your order out the door fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sydney Segal",
          "Nb_Reviews": 1,
          "Date": "2023-04-08T04:14:49.000Z",
          "Titre": "Always a pleasure doing business with…",
          "Contenu": "Always a pleasure doing business with Quality Macs. I have purchased at least 3 times from them. Every time I get a quality machine at a great price. Customer service is also top notch."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel DiGriz",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T02:23:18.000Z",
          "Titre": "I'm quite happy with the experience",
          "Contenu": "I'm quite happy with the experience. No news is good news. The product was exactly as described, and in the condition I expected, which means the description accurately matched the condition (which by the way was superb). This is how I'd like all purchases to be. Will do this with Quality Macs again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hans",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T23:39:36.000Z",
          "Titre": "I love you guys",
          "Contenu": "I love you guys. I bought a whole bunch of stuff. Absolutely fantastic products. Cosmetically and functionally as described. Fast and professionally shipped. I can’t wait to do it again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Gain",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T19:47:05.000Z",
          "Titre": "The team at Quality Macs was efficient",
          "Contenu": "The team at Quality Macs was efficient, and their work was superb.  My computer worked immediately, did everything it should, and even came with a warranty."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joshua L.Derrico",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T13:25:33.000Z",
          "Titre": "I'm extremely satisfied!!",
          "Contenu": "This was my second purchase here, in person as I live nearby. Enzo helped to answer all my questions making it easier for me to choose what I needed. Great experience for the second time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Doris",
          "Nb_Reviews": 2,
          "Date": "2022-08-19T23:16:39.000Z",
          "Titre": "Great price on a Quality Mac !!",
          "Contenu": "I guess that's where they got the name for their company !! I am very satisfied with the refurbished iMac I purchased. I got the 2017 model with the latest OS on it for a terrific price. I'm super happy with the quality and price, it was a great savings over purchasing brand new."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Curtis Johnson",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T19:44:45.000Z",
          "Titre": "I'm very happy with your services",
          "Contenu": "I'm very happy with your services.  I've purchased 3 used computers in the last few years and have had no problems with them.  For one acquired in person, I needed advice on selection and your staff proved to be knowledgeable and eager to help with that and parts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Biddle",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T22:24:19.000Z",
          "Titre": "Excellent communication",
          "Contenu": "Excellent communication, great deal, amazing products I would recommend them to anyone. Shipping was super fast and packaging was great! When I need another Apple item used I will go straight to these guys"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cj",
          "Nb_Reviews": 1,
          "Date": "2020-08-26T04:20:15.000Z",
          "Titre": "They are simply the best",
          "Contenu": "They are simply the best. I bought a used iMac and I couldn’t be happier. I absolutely love my computer and appreciate the care and quality in the condition that I received it! I will definitely recommend to everyone I know that is in need! Thank you guys for delivering quality for an affordable price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gail Evans Suggs",
          "Nb_Reviews": 1,
          "Date": "2020-08-31T11:02:55.000Z",
          "Titre": "I'm so impressed with this company",
          "Contenu": "I'm so impressed with this company.  I researched and read everything about the company and the one thing was that for their service of excellence they didn't have a lot of reviews.  I reached out to the company for consideration of selling my 2018 Mac Mini or if not could they install more hard drive.  They went out of the way to give me specific information in a very quick response that temporarily made me reconsider selling mine.  So they really offered me alternative options that didn't benefit them financially.  They won me as a customer for future purchases and trades.  This is so hard to find when most companies just want to get your money.  Please consider supporting this company.  I just can't tell you how impressed I am!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marc R",
          "Nb_Reviews": 5,
          "Date": "2022-06-28T20:19:33.000Z",
          "Titre": "Enzo spent a lot of time with me in…",
          "Contenu": "Enzo spent a lot of time with me in deciding to replace my ipad, and which model and features fit my needs best. I never felt that he was pushing me or steering me for his benefit. Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Luis Domiguez",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T20:01:51.000Z",
          "Titre": "Excellent service!!",
          "Contenu": "The service was very good, the products were in very good condition and the person who assisted me was very friendly, answered my questions and helped me choose the best option based on my budget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike Brandon",
          "Nb_Reviews": 2,
          "Date": "2022-08-24T20:16:25.000Z",
          "Titre": "A little wary at first",
          "Contenu": "I wanted a larger screen MacBook moving on from my 12\". I found a few that I put in my cart but when I went back a couple of days later to decide on one, they were...GONE!A new search a few days later found me the one I wanted in SUPERB condition. In the cart, immediate checkout and quick delivery. Not a mark on it anywhere and it performs as expected. Like brand new!I was nervous as I've never done this before, spending money on a used computer. I was not disappointed and will use Quality Macs again in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T01:25:22.000Z",
          "Titre": "I've ordered two Macbooks so far and I…",
          "Contenu": "I've ordered two Macbooks so far and I will continue ordering more. Great deal and the two that I bought were like-new and a way better deal than ordering a brand new laptop. It also helps that you're 5 minutes from our HQ office!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim H.",
          "Nb_Reviews": 1,
          "Date": "2020-08-25T22:27:04.000Z",
          "Titre": "eBay Laptop Purchase",
          "Contenu": "Product was exactly as described, and in excellent condition.  Their responses to my questions were very prompt and totally honest. Shipping was extremely fast from the left coast to the right coast.  I would not hesitate to do business with them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Watt Razormaid",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T22:29:42.000Z",
          "Titre": "Can’t put a price on getting it right the 1st time",
          "Contenu": "I must say, plopping down $3400 by internet is not an easy thing to do on something you’re not holding in your hands!  But this company delivered EXACTLY “as described”. Yes, I know they offer a full refund, but getting it right the first time?  Can’t put a price on that. Thank you guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omar Contreras",
          "Nb_Reviews": 3,
          "Date": "2022-04-27T09:13:30.985Z",
          "Titre": "Quality Macs is a fantastic alternative to buying brand new",
          "Contenu": "To date, I have purchased 3 MacBooks from Quality Macs. I’m thoroughly impressed by their service, their inventory, their pricing and their knowledge of Apple products of all varieties. I plan to continue buying my computers from Quality Macs in the future. If you’re looking for a reasonably priced professionally refurbished, fully functional Apple product, certainly consider checking with Quality Macs before paying 3 times the price from Apple or any authorized vendor!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joey D",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T03:24:47.000Z",
          "Titre": "I needed to purchase another iMac Pro",
          "Contenu": "I needed to purchase another iMac Pro, my other one was getting to slow. The Quality Macs team gave me a great buy back on my old iMac and a great price on a 2019 iMac Pro. They were very helpful and professional. I highly recommended them for you Apple computer needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T17:04:49.000Z",
          "Titre": "This was my second purchase here",
          "Contenu": "This was my second purchase here, in person as I live nearby. Enzo helped to answer all my questions making it easier for me to choose what I needed. Great experience for the second time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marty Zelder",
          "Nb_Reviews": 1,
          "Date": "2022-01-23T22:14:24.000Z",
          "Titre": "Absolutely fabulous iMac",
          "Contenu": "Absolutely fabulous iMac.  Exactly as described…. Fast shipping & Great service.  We could not be more pleased.  Will certainly recommend others to you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Borth",
          "Nb_Reviews": 1,
          "Date": "2023-03-30T01:47:34.000Z",
          "Titre": "Enzo was the best and simplified my in…",
          "Contenu": "Enzo was the best and simplified my in store experience beyond my expectations. He is an asset to the company and solidified me as a return customer down the road. Great work and thanks again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alicia",
          "Nb_Reviews": 1,
          "Date": "2020-08-12T14:48:01.000Z",
          "Titre": "I love this company!!!!!",
          "Contenu": "I absolutely love this company. I have purchased 2  iPhones and a MacBook Air in the past. I just recently purchased a MacBook Pro. Their service is AMAZING! Always honest and really good prices!! I have recommended this company to friends that have purchased as well!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Manuel Ferrer",
          "Nb_Reviews": 2,
          "Date": "2020-09-19T13:38:27.000Z",
          "Titre": "Great company",
          "Contenu": "Wow just wow. Quality Macs is the best seller I ever bought from. They have a lot of inventory and when I found the MacBook I wanted it was shipped fast. When I received the computer it was packed very well and the machine itself was almost flawless. It’s a 2018 MacBook Pro but it looks brand new and everything works perfectly. I will definitely buy from Quality Macs again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy C",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T01:20:49.000Z",
          "Titre": "A friend referred us to your company…",
          "Contenu": "A friend referred us to your company and we couldn't be more happy with the purchase.  The computer arrived as promised and was in great condition as described.  My son said it looked brand new.  He has been using it ever since it arrived."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DJ",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T03:36:47.000Z",
          "Titre": "Pricing",
          "Contenu": "Pricing, Service, Overall Experience."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Rabib",
          "Nb_Reviews": 3,
          "Date": "2020-07-22T22:12:07.000Z",
          "Titre": "Amazing experience with this company",
          "Contenu": "Amazing experience with this company. The product arrived damaged and they went the extra mile to make sure everything was sorted out with great focus on customer satisfaction. Would buy again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frank Wiater",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T05:05:47.000Z",
          "Titre": "Good company to deal with",
          "Contenu": "Good company to deal with. Answered all my questions, delivered my Ipad as ordered. Good communication, no bait and switch tactics. Sent me tracking# as soon as my order shipped, which was quickly. Even offered a warranty. I do a lot of internet purchases and have seen both sides of the coin. I would buy from Quality Macs again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T21:46:32.000Z",
          "Titre": "I had a great experience buying a MAC…",
          "Contenu": "I had a great experience buying a MAC from \"Quality Macs\".  The item was exactly as described, accurate to the photos online.  Shipping was fast and easy, I got a great deal on a nice machine and I'm very happy.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Canh Tran",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T00:43:52.000Z",
          "Titre": "Great mac",
          "Contenu": "Great mac, refurbished but looks and works like new even the accessories were great.The item was very carefully packaged. Overall, it was a great buy and definitely recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2022-09-01T20:56:06.000Z",
          "Titre": "Great company for a super deal on used…",
          "Contenu": "Great company for a super deal on used Macs. Have purchased many from Quality Macs. Fast Shipping and reliable computers with great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "rich gonzales",
          "Nb_Reviews": 2,
          "Date": "2022-03-13T05:51:30.000Z",
          "Titre": "This is my second MacBook Air from…",
          "Contenu": "This is my second MacBook Air from Quality Macs, the first one was perfect, ran flawless for seven years, my new one arrived fast and seems perfect.  Keep up the good work."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jaime C.",
          "Nb_Reviews": 2,
          "Date": "2023-02-18T03:57:57.000Z",
          "Titre": "Excellent service and customer service",
          "Contenu": "Excellent service and customer service. No doubt I will buy again from you in the future.The Macbook Pro I just bought is in perfect condition and the price was good.Keep on with the good work !!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wilfredo Pedroza Jr",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T22:50:37.000Z",
          "Titre": "Qualitymacs were excellent",
          "Contenu": "Qualitymacs were excellent.  Order was sent immediately and just as promised.  I highly recommend anyone who is looking for a good used Mac at a great price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KenS",
          "Nb_Reviews": 2,
          "Date": "2020-10-21T00:15:48.000Z",
          "Titre": "There is a plethora of laptops for sale…",
          "Contenu": "There is a plethora of laptops for sale and its a bit bewildering. I knew I wanted a Mac book but which was good better or best? If you will contact these guys they will guide you to the best recommendation for your want at a fair price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bing Guan",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T01:02:40.651Z",
          "Titre": "Great experience",
          "Contenu": "Great experience, would buy again. Staff was very friendly and helpful at the San Diego store, and the Mac was as described, in impeccable condition!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donte Blackwell",
          "Nb_Reviews": 1,
          "Date": "2020-08-13T00:24:08.000Z",
          "Titre": "Prestine Condition",
          "Contenu": "I received my iMac in pristine condition and it arrived 2 days before the estimated delivery date. You guys are awesome. I will definitely continue to purchase through you for all my future computer needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Barango",
          "Nb_Reviews": 1,
          "Date": "2022-02-15T16:44:12.000Z",
          "Titre": "I purchased a 2020 MacBook from Quality…",
          "Contenu": "I purchased a 2020 MacBook from Quality Macs and i have to say that tjey do live up to their name. I was very impressed with the quality of the Macbook i received. It appeared as good as new but I knew it wasn't. The price for the quality was great. I would definately order again from them in the future. I'm very happy with the fact they even offer warranties which not everybody does. Thank you for offering great products at excellent prices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Liu",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T21:58:13.000Z",
          "Titre": "Quality Macs sells Apple products  at…",
          "Contenu": "Quality Macs sells Apple products  at competitive prices and provides excellent customer service.  I’ve purchased multiple MacBooks and an iPad from them and have been extremely satisfied with my purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony FcNetworks",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T17:46:19.000Z",
          "Titre": "Always great quality",
          "Contenu": "To the administration of Quality Macs great Job.You guys always take care of my needs and send me trusted equipment.Great customer services."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stavros Enterprises LLC",
          "Nb_Reviews": 3,
          "Date": "2022-10-29T01:01:57.000Z",
          "Titre": "Excellent Experience",
          "Contenu": "The team at Quality Macs are patient and are extremely proficient in their knowledge. I will be purchasing items from them in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Lee Moore",
          "Nb_Reviews": 1,
          "Date": "2022-01-18T23:56:30.000Z",
          "Titre": "The whole team works very efficiently…",
          "Contenu": "The whole team works very efficiently together.  I felt like I was pestering them with trying to get my questions answered and needs mit but they were so gracious.Richard"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael Lou",
          "Nb_Reviews": 1,
          "Date": "2020-10-20T19:49:01.000Z",
          "Titre": "Exceeded expectations!!!",
          "Contenu": "Exceeded expectations!!!!  The MacBook Pro was in nearly PERFECT condition especially being 8 years old.  Absolutely an outstanding company that is BEST of the BEST in integrity, product quality, and support.  Thank you Quality Macs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miriam Donath",
          "Nb_Reviews": 1,
          "Date": "2020-07-20T20:58:57.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience buying from Quality Macs. I needed a machine with pretty specific criteria, and they had one. And they sold it at a very fair price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JamesD",
          "Nb_Reviews": 4,
          "Date": "2020-10-20T22:20:00.000Z",
          "Titre": "Found exactly the MacBook Pro I wanted",
          "Contenu": "I found exactly the MacBook Pro I wanted here.  Even though it was years old, it was in great condition.  They packed it well and shipped promptly.  If I had this machine since it was new, it wouldn't be in this good shape.They communicate well, and I recommend them highly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Happy Customer",
          "Nb_Reviews": 2,
          "Date": "2022-08-09T19:36:42.000Z",
          "Titre": "I had to update our late 2015 IMAC…",
          "Contenu": "I had to update our late 2015 IMAC which was super slow to something faster. I found Quality Macs online and I ordered a 2019 IMAC which is way faster then what we had. Everything went well and the computer works perfect. You can even reach someone on the phone. If I need any other Macs I'll be going back to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles",
          "Nb_Reviews": 3,
          "Date": "2022-06-27T21:41:27.000Z",
          "Titre": "Computer was as advertised",
          "Contenu": "Computer was as advertised. Excellent service to call me and verify that I am the purchaser. This is the second Mac I have bought from this company and have always been pleased."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andy Ting",
          "Nb_Reviews": 2,
          "Date": "2020-07-23T05:02:54.000Z",
          "Titre": "Quality Macs sell me reliable machine",
          "Contenu": "Quality Macs sell me reliable machine. All defects are well-informed on the website. Great choice for careful buyers like me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T01:53:42.000Z",
          "Titre": "Great all around experience",
          "Contenu": "Great all around experience. Computer took a dive on a work trip, I found a computer I liked on their website, and they had it in the store so I went to check it out. The staff was knowledgeable and I saved a lot of money!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "julia murphy",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T14:19:22.000Z",
          "Titre": "Honest seller",
          "Contenu": "Honest seller, they describe every issue with the computer. My new Mac runs great, thank you so much! Would absolutely recommend A+++"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MORRIS",
          "Nb_Reviews": 2,
          "Date": "2022-08-03T15:13:52.000Z",
          "Titre": "Quality Macs delivered a mint condition…",
          "Contenu": "Quality Macs delivered a mint condition iPad as promised in a timely manner at a reasonable price. I am very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexander Lopa",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T19:21:37.000Z",
          "Titre": "10/10",
          "Contenu": "Incredible product at a really reasonable price!! Thank you so much!!! Shipping was fast and the whole process was excellent!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gerardo Gutierrez",
          "Nb_Reviews": 1,
          "Date": "2022-04-02T13:35:36.000Z",
          "Titre": "Customer service was perfect",
          "Contenu": "Customer service was perfect. The service that you provide it’s awesome and the product has been the best so far.Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Semonsen",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T04:35:09.000Z",
          "Titre": "wife's mac book",
          "Contenu": "it was great. the model we wanted, fair price and efficient pickup."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John from Saint Paul MN",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T23:23:31.000Z",
          "Titre": "I've purchased two computers from…",
          "Contenu": "I've purchased two computers from Quality Macs and both have been working great.  I'll definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brad Steffens",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T18:37:29.000Z",
          "Titre": "Everyone I spoke with has a lot of…",
          "Contenu": "Everyone I spoke with has a lot of patience and is very helpful and knowledgeable"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Eichinger",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T18:57:28.000Z",
          "Titre": "MacBook Pro",
          "Contenu": "Had a very good experience with these people.  Good phone conversations, good online descriptions, etc.  This was a very Quality transaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashley Sencion",
          "Nb_Reviews": 1,
          "Date": "2022-08-11T04:52:44.000Z",
          "Titre": "Perfect",
          "Contenu": "Tablet that I bought came in good condition and You can’t even see the mini scratch at all, shipping took about 4 days but the tablet overall is perfect condition, this is my second item buying from here and I will forever be buying from here!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Spencer",
          "Nb_Reviews": 1,
          "Date": "2022-07-24T02:35:50.000Z",
          "Titre": "prompt service selling mac I did not…",
          "Contenu": "prompt service selling mac I did not want and sig savings buying another.Almost immediate reply to email questions."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian",
          "Nb_Reviews": 3,
          "Date": "2020-07-19T23:34:21.000Z",
          "Titre": "An Exceptional Company",
          "Contenu": "I recently bought a used 2015 MacBook Pro 13” (early 2015) model from QualityMacs back at the start of 2020. The laptop itself has a few minor scratches on the outside case and some dings but overall is everything they describe their products to be. For a 5 year old computer, it’s in killer shape and runs like its brand new. My computer stopped working about a month ago, but they went above and beyond to help me resolve the issue. The owner, Jeff, and the rest of the QualityMacs team has worked with me personally to give me the best quality products and service for a great deal. I have a working laptop now within a week of working with them. If you’re in the market for a used or even new Apple product, I would highly recommend buying from this company. Used computers, like anything used, do come with inherent risk though. They have very qualified (Apple certified) technicians to oversee each product, but over time minor errors can lead to bigger issues so consider buying their warranty so you don’t have to stress if this were to happen to you. It’s a fair price in my opinion.Lastly, buying any expensive product online is risky, but I assure you, they care a heck of a lot and deliver on their promises. I was skeptical when I first bought my used MacBook Pro since $640 seemed like too great of a deal for an Apple computer, but it’s been worth it and am planning on purchasing an iMac from them in the coming months."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stavros Enterprises LLC",
          "Nb_Reviews": 3,
          "Date": "2022-12-13T02:17:31.000Z",
          "Titre": "Great Team of people helping their…",
          "Contenu": "Great Team of people helping their customers on time, every time. Hardware and Services were perfect."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yuriy",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T14:38:28.000Z",
          "Titre": "Good solid purchase",
          "Contenu": "Computer was as described, for a fair market price given the configuration. Customer service was also professional and reached out to me before shipping. I am happy with the purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Anderson",
          "Nb_Reviews": 1,
          "Date": "2021-02-18T01:05:46.000Z",
          "Titre": "Helpful, Trustworthy company",
          "Contenu": "We called and talked to one of the guys who works there, and he helped us choose the right Macbook for our daughter. Extremely helpful, and very fast shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy Y..",
          "Nb_Reviews": 2,
          "Date": "2020-08-06T00:49:13.000Z",
          "Titre": "A reliable source for used computers",
          "Contenu": "I've bought two used computers from Quality Macs.  Both were exactly as described in their ads, and I could not be happier.  That I went back to them for the second one pretty well says it all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Grossberg",
          "Nb_Reviews": 2,
          "Date": "2020-08-18T23:39:10.000Z",
          "Titre": "I got what I feel was a great deal on a…",
          "Contenu": "I got what I feel was a great deal on a used MBP in great shape. It was less expensive than others I saw of the same year and model and I've had no problems setting it up or since. That's about it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Mcclanahan",
          "Nb_Reviews": 2,
          "Date": "2022-02-06T00:17:29.000Z",
          "Titre": "Just as described.",
          "Contenu": "This is my 4th Mac I have purchased from Quality Macs.  All if them have exceeded my expectations.  Good company to deal with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Davis",
          "Nb_Reviews": 1,
          "Date": "2022-01-22T15:10:55.000Z",
          "Titre": "Great products and service.",
          "Contenu": "I would buy a used Mac from these folks again.  Quality products and a phone number where you can talk to their helpful sales people.  My 2020 MacBook came as described, well packed and on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodger A",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T05:24:06.000Z",
          "Titre": "Awesome MacBook Pro",
          "Contenu": "The MacBook Pro I purchased exceeded my expectations.  And the service was first rate. Kudos to Quality Macs!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Mcilroy",
          "Nb_Reviews": 4,
          "Date": "2020-07-23T21:12:42.000Z",
          "Titre": "Fast ship",
          "Contenu": "Fast ship, great packing, very good communication. Would not hesitate to do business with them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2020-07-23T18:47:26.000Z",
          "Titre": "I had a great experience with Quality…",
          "Contenu": "I had a great experience with Quality Macs.  My machine arrived as advertised and the whole buying process went smoothly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MODENA WELSH",
          "Nb_Reviews": 3,
          "Date": "2020-08-19T01:07:43.000Z",
          "Titre": "My purchase with Quality Macs was FST",
          "Contenu": "My purchase with Quality Macs was FST , FLAWLESS and VERY PROFESSIONAL !!!!!!  I HIGHLY recommend this seller to everyone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DANCY",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T03:41:00.000Z",
          "Titre": "MY New iMac",
          "Contenu": "Had a great experience with Q'Macs.Picked up a great iMac at an Excellent Price. Thanks to Quality Macs!!!"
        }
      ]
    }
  ]
}