{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "rentredi.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Don  Oneida",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T18:13:15.000Z",
          "Titre": "The system is confusing",
          "Contenu": "The system is confusing, chat support is slow. To set up bank accounts if a pain. You cant split payments."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jre",
          "Nb_Reviews": 2,
          "Date": "2023-09-04T19:29:51.000Z",
          "Titre": "Please see my review on May 29",
          "Contenu": "Please see my review on May 29, 2023.  I am still having the same issue 3 months later.  Sent them another chat which they are also making harder to chat with live person.  This was their response,  \"We have an ongoing investigation with deposits not appearing to have incorrect amounts, but I will check an update with the Team if we have an available work around to sort this out.\"Something as serious as this I would think it wouldn't take this long.They also have a \"feature request\"  which is no longer operational.  I put in a request over 6 months ago and absolutely no response,  not even an acknowledgement that they received my request"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nicole Hodge",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T15:41:29.000Z",
          "Titre": "RUN from this company",
          "Contenu": "RUN from this company! They collected rent from my tenants for 3 months, while my account was on hold with NO NOTIFICATION and no explanation as to why. I still have no idea and it took me over 20 hours of customer service phone calls (got me nowhere), online chats (same) and emails to their Underwriting team. RUN AWAY. Absolute nightmare."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike Costa",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T15:50:35.000Z",
          "Titre": "The program is very bugy",
          "Contenu": "The program is very bugy.  Unreliable… It mixes up data from different applicants.  The program follows a process that needs to be customizable.  Will not send a link for credit and background check."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Arington",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T15:46:59.000Z",
          "Titre": "Horrible Platform",
          "Contenu": "Less than a one star. Company is horrible. They took my money and I cannot use my software. It's been a whole month. They also deal with third parties inside their business which the communication is horrible between them. Trying to get my refund since I was never ever able to the software. Definitely do your research on this place before giving your time ad energy to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T01:35:07.000Z",
          "Titre": "THE WORST!",
          "Contenu": "I always paid my rent on time within this app to my Landlord. Recieved an email on 01/01/2023 that my payment was successful. RentRedi sent me a late notice 5 days later stating that the payment was not completed due to insufficient funds. They didnt pull my funds out of my account until 4 days later that resulted with me being hit with a late fee of $100. Customer service is horrible, they didn't consider the delay on their end and how I never had a processing problem to occur until that incident. Plus the staff Lies"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rickyrat pog",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T19:08:01.000Z",
          "Titre": "Rent Redi is a SCAM",
          "Contenu": "Rent Redi is a SCAM. W cancelled in March but were billed in April, May and June. Finally, we deleted all credit cards from the site. We continued to receive messages that our payment was rejected and asking to update our credit card information. Finally, we were told that our subscription was cancelled because the payments were not going through. In other words, the ONLY way to cancel a subscription seems to be that you you have to delete or cancel all credit cards associatd with the site. A TOTAL SCAM! DO NOT PATRONIZE this dishonest company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zach Langston",
          "Nb_Reviews": 2,
          "Date": "2021-12-07T02:03:42.000Z",
          "Titre": "Junk product with useless support…",
          "Contenu": "Junk product with useless support staff, but hey, at least they include smiley faces with their useless responses. They require far more personal, unnecessary information to set up payment profiles than any other similar product. You don’t realize it until you actually read the fine print. There are way better options out there."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mgmt",
          "Nb_Reviews": 1,
          "Date": "2022-12-06T20:48:34.000Z",
          "Titre": "I was victim of a FRAUD through RentRedi payment portal.",
          "Contenu": "Had a client pay through credit card and file a dispute. RentRedi provided no assistance and I was a victim of a FRAUD from this former tenant 3 months after they left the property. I sent all the necessary supporting documents and could never even see who talked to who and what was sent to any party. Rent Redi put the responsibility on Propay (the merchant) and when I called Propay they put the responsibility on RentRedi.I followed up about this issue for at least 2 months, I was told I would get an email with the determination from Propay and financial institution but I never did. Instead, after reaching out to Rent Redi again, I was just told that the Bank ruled in favor of the former tenant and I had no legal recourse to dispute again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jre",
          "Nb_Reviews": 2,
          "Date": "2023-05-26T08:16:07.000Z",
          "Titre": "Customer service and tech support",
          "Contenu": "I have had this app since October, 2022.  I really liked this at first and it was working fine until recently.  When I try to reconcile my batch deposits they are now, not showing up in the reports.  This is very frustrating!  It has been two weeks and still no fix.  I have over 200 units and it is a nightmare to try to figure out which payments go to which deposits without this feature.  I would not recommend this product for anyone that has multiple properties/tenants and multiple accounts.May 26.  Instructions are how to view from the back end.  Which I know how to do.  Very clumsy though. The reason I am writing a follow up is, report stopped working again for a brief period of time.  Having problems with support because these people only know how to cram directions down your throat not fix the problem.  Actual tech support is impossible to reach"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dawn",
          "Nb_Reviews": 1,
          "Date": "2022-06-27T18:44:12.000Z",
          "Titre": "Just don't do it!!!",
          "Contenu": "Tried Rentredi for our rentals and it was so not user friendly for my tenants.  Most of them couldn't get it to download with the correct property.  Also we only used for a couple of months to try it out and paid for the year as it was cheaper.  Went to cancel our subscription today and they don't refund the remaining year that I paid for.  Won't be coming back when we restructure our tenant payments on line."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T17:50:30.000Z",
          "Titre": "IT'S A SCAM.",
          "Contenu": "IT'S A SCAM.NEVER WORKED WILL BE LOOKING FOR PAYBACK. OUT $72CANCELLED CREDIT CARD, SINCE THEY DIDN'T RESOLVE THE FRAUD CHARGE. STAY AWAY FROM THIS SCAM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TMW",
          "Nb_Reviews": 2,
          "Date": "2022-07-16T14:33:24.000Z",
          "Titre": "Rentredi did not post my property…",
          "Contenu": "Rentredi did not post my property photos on the sites is says it posts to. I cannot reach anyone at customer support. I have been trying for 4 days. Phone number says they are not available. Chat is worthless. They say they will have someone get back to you in 24 hours and they do not. It feels like I have been ghosted. I have tried to create listing on Zillow Rent but am blocked from doing so because it is already listed through Rentredi. I am stuck and can’t list my property because of Rentredi. I am going to delete my Rentredi listing and delete my account and see if that works. Hate to do it but no one there is available to help me. The only option I get is to set up an appointment in 5 days toTalk to somebody. This company is cratering."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Baby Love",
          "Nb_Reviews": 1,
          "Date": "2022-07-03T01:18:58.000Z",
          "Titre": "Thieves",
          "Contenu": "Thieves! All my payments have been completed but just sitting there while rent redi gives me the runaround. They don't and have not helped at all. $2800 of mine has been stolen by these incompetent hacks. Don't use this service. You'll regret it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sue Santos",
          "Nb_Reviews": 3,
          "Date": "2022-07-08T00:51:34.000Z",
          "Titre": "There is no one at this company",
          "Contenu": "There is no one at this company. All we get is recordings, no call is made back to me (left 3 messages) called all the #s listed. I am continuing to do reviews on rentredi because they need to understand that there are real issues, that they need to fix. Again this is my third review and I have 30 tenants signed up, but I will no longer add anyone more !!! TODAY I had 2 tenants who had the funds in their accounts, and continue to have,  rentredi never took out the funds and they now removed them from my account as bounced meanwhile they never took it out of the tenant's account, both on the same date,... but at least this time they sent me an email.!!! THIS now brings it to 3 tenants with funds that were not taken out, In addition they now decide that one of my properties which is in my portfolio they need to charge me $12.95 a month when we already paid the full year in March. Can't get anyone on the phone, and only appointment to talk to someone is July 11 at 2 pm. THIS IS HOW THIS MESS OF A CO OPERATES. Looking for a better service, this is a mess"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 3,
          "Date": "2023-07-16T22:23:46.000Z",
          "Titre": "GOOD NEWS",
          "Contenu": "GOOD NEWS. I heard a call center was destroyed. 1 for our side."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T15:18:10.000Z",
          "Titre": "Opportunities to Increase User Efficiency & Satisfaction",
          "Contenu": "We have 16 Cabins in Soldotna AK.  We are fairly tech savvy users - and in general you can eventually get most of what you need done by contacting the support team and having them take you through the steps.Biggest headline feedback:1)  Please read all of my threads with your support team members.  All of them are very patient teaching me how to use WAY TOO MANY clicks to get done what should be simple/intuitive tasks in the software.2)  This platform is not 'client/renter' centric.  Any of your users are out of business if client's are not well taken care of.  Half of the icons on the left side of the screen should be consolidated under 'Renters'.3)  I use safari, and 1/2 the time I send a lease for signature, the process fails...don't know why4)  Returning a security deposit should be a single click - the current process is NOT intuitive, yet this step is a core process step with every renter5)  For some reason, we have a lot of prospect renters indicate that they want to complete the app - but then don't.  Am wondering (since I have not used your link myself yet) - if the process is not intuitive/burdensome and that reflects poorly on me as the landlord).  Our brand needs to 'easy to use, very clear, intuitive, accurate'.  Your platform needs to align with our brand image.6)  You could dramatically decrease your customer support time demands by more proactively training users on the common tasks used for every single renter7)  The Dashboard was interesting at first - but I believe needs a rehaul.  It lists interesting, but not ACTIONABLE information.  If it was me, I would want to know the following buckets on a dashboard:  1)  What is my occupancy rate for the next 3, 6, 9, 12 months? 2) Who has leases coming due that I need to pulse to extend or renegotiate terms?  3) What is my projected cash flow next 3, 6, 9, 12 months 4) What are the top reasons why 'applicants' are NOT completing the lease application?8)  I come back to every action starts and ends with a renter/client.  Make the functionality for the top 10 tasks that must happen for each client be 'single click' and very intuitive events...I don't like having to spend so much time with your support team (although they are very good) to perform what should be very routine events for the acquisition, setup, management, and closure of clients on the platform."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Stuber-Velasquez Trust",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T05:13:12.000Z",
          "Titre": "Always Issues with the Payment Processor",
          "Contenu": "Once again this year, I'm having difficulty with the payment processor providing 1099's correctly. The RentRedi agents haven't been very helpful in resolving the issue. They continue to suggest I send a new W-9, which isn't going to push Propay into doing anything. Last year it took 4 months to resolve the issue, and so far after 2 weeks, no resolution in sight."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joanna Brown",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T16:30:12.000Z",
          "Titre": "Waste of Money",
          "Contenu": "I bought the service to use before my rental was ready to go live. I wanted to be acquainted with it first. About a month later, my rental was ready and I listed with RentRedi to post on Realtor.com. It took almost 2 weeks before it went live on Realtor.com. I posted on Zillow for free and got so many responses while still waiting for my listing to post on Realtor.com. They tried to blame it on Realtor.com and said they would get back to me when the bug got fixed. It took me reaching back out to them (they never got back to me) and then suddenly I guess that day (2 weeks later) it was fixed. I asked for a refund because I never used their service and was denied that because I had it a month before I went live. Don't let them rip you off like they did me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Oak Road Properties LLC",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T18:02:51.000Z",
          "Titre": "Good For Small Landlords But An Amateur Service",
          "Contenu": "We have been a rentredi customer going on 2 1/2 years now. It’s certainly not the best system but the price is right for most small landlords. The back end accounting and money transfers are absolutely awful. They lump sum your payments and expect you to sort out how much came from each property. A convoluted “report” is available if you spend enough time digging through the site. We are now dealing with a nine day hold on funds after requesting that out hold time be reduced to 24 hours. We are currently sitting, accumulating bank fees on mortgages, while RentRedi decides if they want to release our money. When pressed for answers, no one seems to have any. In the end, this is a great platform for one or two properties but if you want to be a serious property manager RentRedi is not for you. They definitely fall into the amateur category in this industry and will remain there until the company drives to get serious about customer service and payment processing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Consumer Name",
          "Nb_Reviews": 5,
          "Date": "2023-02-02T15:12:44.000Z",
          "Titre": "The interface for tenants is very…",
          "Contenu": "The interface for tenants is very clunky, and several thought they had to sign up for others services with fees in order to pay rent.  I tried to set up a test run with several of our apartments; the software requires time consuming work-arounds for things like month-to-month leases, keeping notes on a tenant, etc.  I paid for a year, and after 48 hours of running my test I find no refund is available.   I felt harassed by customer service trying to \"help\" me so that I didn't cancel.  THERE IS NO WAY TO SEE WHAT THE EXPERIENCE IS FOR YOUR TENANTS WITHOUT SIGNING UP.Thanks for the offers to help me experience the program more (see note above) but when a product doesn't fit, it doesn't fit.   Can't you take no for an answer?  And, really,  no refunds after 48 hours, nit even a partial amount?  The motto really is, if you didn't like us it's your fault & we're keeping your money.  Consistent with the tenant interface: you tried to just get set up to pay rent & you ended up signing up for services you didn't want?  Oops, too bad, we're keeping your money"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Allyse",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T17:46:33.000Z",
          "Titre": "Poor user experience, poor company integrity",
          "Contenu": "The payment options on the app seem intentionally confusing. There was no option to add bank account information except to log into my bank account through the app. Then when I went to make the payment, I was not given an opportunity to review the charges/amounts before I was charged. I got hit with an unexpected processing fee that the RentRedi customer service folks are saying is out of their hands and they can't do anything to reverse or fix the issue. And it took them over a week to get back to me on my inquiry. My landlord used RentRedi for one month before deciding it was insufficient for basic functionality and has already moved to a new platform. I'm just sorry he ever used it in the first place as it's been a terrible experience. The one pro I will give them is that they have a live chat feature that made it easy to reach out to customer service (even if I wasn't happy with the answers I ultimately got from them).Update: I reached out to the email listed in RentRedi's response 2.5 weeks ago and (shocker) they never replied. Presumably because they know they won't change their answer or do anything to rectify my situation.Responding to RentRedi update: I indicated such in the opening sentence of my outreach 2.5 weeks ago. Even if I hadn't, you should still respond to your customer inquiries in a timely manner."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Zach",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T15:58:04.000Z",
          "Titre": "Payment processing takes too long",
          "Contenu": "Payment processing takes too long, mobile app can be clunky/confusing to navigate. Issues with posting rentals through portal."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Joseph",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T16:33:04.000Z",
          "Titre": "I like the app and how it organizes…",
          "Contenu": "I like the app and how it organizes everything for you. The bad part is I wish you couldUpload receipts and costs into the app for end of the year taxes/filing. Also the app is very slow, glitchy at some points."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T18:35:10.000Z",
          "Titre": "Glitches without prompt support!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shawn Lemieux",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T02:52:17.000Z",
          "Titre": "My renter is complaining about online…",
          "Contenu": "My renter is complaining about online pay options."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "AD Desert Properties",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T17:58:05.000Z",
          "Titre": "Payment System Delays",
          "Contenu": "Payment system for tenants has a long delay period. Tenants once rent is paid, normally see transaction/money withdrawn from account 4 to 5 days after transaction has been made by tenant. This process needs too occur alittle faster for tenants while accounts have funds available."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Maurice Cox",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T17:04:14.000Z",
          "Titre": "Great product horrible interface",
          "Contenu": "Great product horrible interface. Been using for years still confusing"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T18:37:26.000Z",
          "Titre": "This system is clunky",
          "Contenu": "This system is clunky. It's just not very intuitive.Last time I had a tenant signing up and they were having trouble. It took three days to get back to us. We'd already fixed the problem by then, thankfully. We got it for dirt cheap through a bigger pockets promo. We'll probably stay because we have so many tenants on it now. But I may start transitioning new tenants to another program."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Asset Management",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T16:42:14.000Z",
          "Titre": "It is not user friendly with mobile…",
          "Contenu": "It is not user friendly with mobile app. In PC mode is better but still pretty cumbersome to understand the login in charges and viewing payments and deposits."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue Santos",
          "Nb_Reviews": 3,
          "Date": "2022-06-30T15:55:26.000Z",
          "Titre": "please find another application!!",
          "Contenu": "please find another application!!! I signed up for this service for my properties, Unfortunately this application leaves alot to be fixed. so far I have set up 30 accounts, over 40% of them have issues when tenant downloads the application and get set up the application does not link up to the tenant apt.  I have had to met up with my tenants and try to help them out.  We chat with the tech and all they do is show us screen shots and how its supposed to work, BOTTOM LINE ALOT OF TIME THIS DOES NOT WORK!!! Then the next thing they say is that the landlord did not put the tenant info in., to which I reply hey I am the landlord here trying to help my tenant and I DID EVERYTHING ON MY SIDE.... they have a problem with the software in the link up to the account and they refuse to fix it. Again today I have sent them a text and am meeting up with 2 tenants to try to get this fixed so that my tenants can pay me online. Really fustrating to use this application."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T16:30:08.000Z",
          "Titre": "Good start, needs accounting functionality.",
          "Contenu": "Not having an accounting feature in rentredi is a big deal. You can't be a one stop shop for landlords without that. The interface is good, fuctions so far have been good. Lack of accounting...not so good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gina  Burroughs",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T15:18:58.000Z",
          "Titre": "The hold /processing on the money to…",
          "Contenu": "The hold /processing on the money to owner is too long otherwise I like the app features ."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sue Santos",
          "Nb_Reviews": 3,
          "Date": "2022-04-12T12:42:44.000Z",
          "Titre": "Have been using rent redi for about a month",
          "Contenu": "Have been using rent redi for about a month. Customer service takes too long to return calls. 2) they don’t really do a good job on the amount of time to get the rent into your account. The email they send to let u know a tenant paid says about 3 business days but it never comes through on the day they say in the email. In reality it takes at least business 5 days. So The tenant pays on the 5th. And it only hits your account on the 12th but the emails say the 8th. Not reliable. Cash app, and other payments take only 2 business days. So why are these apps able to do it so quickly and they can’t even keep to the information they give you. Disappointed. Now stuck w this for a year. Will not renew bc they are lying about the time it will hit your account. Banks only take 2 days to clear checks. Snail payment is more their style. If you need to pay your bills early in the month look for something else."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Property Manager",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T22:05:18.000Z",
          "Titre": "Love everything besides the monthly rent report format",
          "Contenu": "Love everything on the Renredi App, besides the monthly reports feature. New property and new tenant set up is a breeze and there is always support available through the online chat. Love the credit report feature and lease signature feature and recently I started recommending the renter's insurance feature on the app, which my tenants loved to use because it was fast and the rates were actually much better than the traditional insurance companies.The reports feature-it is not working entirely for me. It is a super lengthy process to get to the reports feature and to reconcile the accounts is time consuming in the current set up.  I should clarify: my problem is that rent payments that are received on the same date from multiple properties are lumped in one large deposit when it reaches our bank account. The reports available so far are missing some of the information I need. I have to go to multiple screens to get my info needed. Please design a report that shows the total deposit from multiple properties paid in one day, the tenant's name, property address, transaction date and amount in one screen.  If y'all have the feature developed - please post it on the main screen or publish an article. So far the \"reports\" under \"Rent\" for the last 30 days shows all the deposits for the separate properties, but don't show the detail for the large deposits received from multiple properties if it gets paid the on same date. This is the way I have been preparing my reports to detail rent by property when multiple payments are posting on the same date:I go to \"Settings\", then \"Feature Settings\", then on the Receive Payments tab click \"Modify\" on the \"Accounts\" tab, then I click  \"Reports\" and lastly \"Transaction reports\" , download in Excell and clean up all the transaction ID info on the spreadsheet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jay",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T18:55:54.000Z",
          "Titre": "Middle of the pack",
          "Contenu": "Overall, solid platform performance. Could use some upgrades and flexibility to allow for more diverse tenant and owner situations."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "will epps",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T17:44:43.000Z",
          "Titre": "The app is super user friendly",
          "Contenu": "The app is super user friendly, the tutorials are comprehensive and chat messaging is responsive and helpful.Where improvement can be had is in *more freedom to email residents in the app and include non residents (parents, co-signers, etc)*Easier way to apply lump sum payments and spread out automatically*Easier way to send people to apply for a vacant, without having to be specifically invited to apply"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sergiy",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T16:26:15.000Z",
          "Titre": "Need Export to PDF for Security, Credit  and Eviction Check Reports",
          "Contenu": "One feature will need to be updated ASAP. We need to have way for export to PDF Security, Credit  and Eviction check reports. By low we will need provide the copy to applicant but in most of cases results of the report are not print friendly ( has tree structure which cannot be show all leaves at ones) Example of this report can be security report with several violations - you will not able to print all info of violations in ones .Please work on export to PDF these 3 reports in simple table structure with clear print friendly records"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jorge",
          "Nb_Reviews": 3,
          "Date": "2021-07-08T16:55:55.000Z",
          "Titre": "I love that you can manage so many…",
          "Contenu": "I love that you can manage so many aspects of being a landlord. Features like receiving payments, automating late fees, and being able manually mark rent as received when needed make the app really great. I love that tenants can sign up for a low cost way to have their rent reported to credit bureaus to help them build their credit history. My other favorite part of the app is the management of maintenance requests. My only wish for this app is that it provide an ability to chat with the tenant about their request. Right now it only lets you receive the request, upload a picture or short video, and mark it as complete. I would like a chat feature to document the discussion and keep it all in one place."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kasia K",
          "Nb_Reviews": 3,
          "Date": "2021-07-08T18:49:20.000Z",
          "Titre": "Excellent customer service, faulty bank connections",
          "Contenu": "I love the concept of RentRedi and so far it has been a great, easy to use platform. Plus, the customer service is PHENOMENAL. The RentRedi reps are always available via the chat within moments, answer questions as thoroughly as possible and escalate if they cannot, are always polite and kind, and even follow up multiple times to make sure my problems were solved. The major hiccup has been that my tenants have issues connecting to their banks, even larger banks. This has been the biggest set-back and why we would look at other rental platforms. Some of my tenants have to disconnect, uninstall the app, reinstall, and reconnect every month just to pay rent. I can see this getting tedious as a tenant, which may damage my business down the line. I'd love for this issue to get resolved and we would gladly stick with RentRedi."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T16:28:47.000Z",
          "Titre": "Overall great value",
          "Contenu": "Overall great value,  some glitches and some issues with the Plaid integration for payments,  but mostly sound operationally and stable, decent customer service, always available though it can take some.time to resolve issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandra Paskins",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T18:34:06.000Z",
          "Titre": "GREAT app, but a few glitches and room for improvement",
          "Contenu": "Using this app has made it easy for me to handle tenant applications, getting leases signed and stored, and collecting rent.  It is easy to set up charges like automatic late fees as well as one-time fees like cleaning fees or pet fees. The maintenance request system is great too since it allows the tenants to upload pictures and video and you can track the progress of the repair (being reviewed, out for bid, etc). For the most part, the app is easy to use for both tenants and landlords. Customer service are quick to respond to chats and they follow up afterwards to make sure the issues were resolved, which I like.  There are a lot of support and instructional videos online that I can direct my tenants to when they have questions.   There are some issues that I wish would be resolved:There are some things that are not very clear for tenants and they ask me for help, and I as a landlord don't see the same view/options as them. For example, I have had tenants want to change bank accounts for auto pay.  I would tell them to click on \"edit autopay\", but the option to change accounts is not there--I don't know how to help them since I don't even see autopay options as a landlord. I have had to set up a ‘dummy tenant account’ so that I can see what they see and walk them through it.Another issue is that you can't have 2 tenants using the same email address. So, I can't send a lease to two people for signature unless I set them up separately and then I have to always have 2 separate tenant cards associated to the unit. This isn't a huge issue, but is inconvenient.The reports feature, although useful, are not very easy to use--it takes me several tries to get the data I want to download and I usually end up downloading more than I need since I can't filter it correctly in the app and I will just filter out the data that I don't need in Excel.  For example, when I download Tenant Payment History, I should be able to filter out convenience fees since I don't get that money and I don't care about those payments; I want to see rent/late fees/security deposits that were billed and paid.Some new features, like the information about which payments are part of each pending/completed deposit is very help since it was not always clear which payments were part of the deposit.  This was a great improvement, and they continue to add new features to make it an even better tool.I wish it didn't take so long to get payments posted to my bank account.  I have had several tenants make a payment (and they have enough $ in their account on day of payment), but the withdrawal from their account doesn't happen for 3 days, and then it bounces and they have to start the process over again.  Even if it doesn't bounce, the money is drawn from their account 3 days after they make payment, then the deposit is initiated, and then several days later I get the funds.  It takes over a week in most cases to get my rent money.  Tenants are starting to used CashApp and ChimePay to make payments because it is more reliable and is instant.  The payment turn around-time needs to be shortened.  That being said, it is great that the app allows for ACH payments for only $1, or credit card payments if the tenant wants to pay the extra fees.  It also gives me as a landlord the ability to enter payments received outside of the app such as cash, check, money order, etc.Overall this is a great tool for landlords to be able to self-manage multiple rentals rather easily."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremiah Carlson",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T00:26:34.000Z",
          "Titre": "One Property",
          "Contenu": "I have one property, so I just need a simple way for my tenant to make payments from their phone, and set up recurring payments. Rent Redi does a good job with this, and the few times I’ve called for tech support they’ve solved my problem right away!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Miller",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:31:44.000Z",
          "Titre": "I like how it makes everything simpler",
          "Contenu": "I like how it makes everything I need simple."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason Moore",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T19:18:05.000Z",
          "Titre": "Great for automating the rental process",
          "Contenu": "I have been using RentRedi for several years now because they are the most cost effective for all the tools they include with their service. RentRedi puts themselves as the center of the equation in that there's not the monthly case of tenants coming and asking for their rent to be late (yet again) because they help you:1. Do a better process of vetting your potential tenants.2. Set up auto late fees in several different configurations which makes late fees a known event that happens without negotiations each month.3. Keep track of which units leases are expiring and your overall tracking of all of your units monthly income.Overall, I like that they are continually improving the product to make it even more useful, which shows that they care about their product and customers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Giovannina Paloumbis",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T21:22:14.000Z",
          "Titre": "Excellent customers service. This is by far the best company around.",
          "Contenu": "We’re using RendRedi for a number of buildings the past 3 maybe 4 years. You guys are amazing, and we are so glad this service exists. Money deposited in our accounts exactly as indicated. All of Our tenants are more than happy to use RentRedi, no tenant had an “issue” since we started using this company. Customer reps answer any and all questions within minutes. We will continue to use RentRedi for many years to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jake Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T04:28:52.000Z",
          "Titre": "I was getting ready to build this exact…",
          "Contenu": "I was getting ready to build this exact thing. Bittersweet like a warm toilet seat, my grand idea was not just my own and someone had beaten me to the punch, but it also saved me a ton of work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sean  Slover",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T17:47:40.000Z",
          "Titre": "This makes collecting rent much easier…",
          "Contenu": "This makes collecting rent much easier for me as well as creating automated late fees to be paid by the tenant if necessary. It also helps me to keep track of expiring leases that need to be renewed of updated. Best bang for the buck!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caleb",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T16:54:57.000Z",
          "Titre": "Rentredi staff are always incredibly…",
          "Contenu": "Rentredi staff are always incredibly responsive to my needs. I never have a problem they can't help me solve within 5-10 minutes. Their software is also incredibly intuitive and constantly being improved week by week, and month by month. The Rentredi platform if a \"force multiplier\". They make my current staff more efficient and effective and as my rental portfolio grows, my costs do not! I love Rentredi. CalebLandlord / Property Owner"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick D.",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T17:18:24.000Z",
          "Titre": "This is a timesaving service for…",
          "Contenu": "This is a timesaving service for landlords. The best thing about it is you are able to track yearly rent increases and the tenant has a lot of options for payments. I've used it for over three years and recommend it.There is good support too, I am always able to contact a human quickly from their chat feature and the people who respond really know the software and have good answers."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christophe R.",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T00:00:03.000Z",
          "Titre": "Rentredi is the perfect app for landords and tenants",
          "Contenu": "Rentredi is the perfect app for landlords and tenants. I manage several properties with different bank accounts. The setup is super easy and the interface very convenient. Its also very easy to install and use for tenants. Now its all automated and I have nothing to do, the rents being wired to my bank accounts."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2023-01-26T21:32:50.000Z",
          "Titre": "Great product and value",
          "Contenu": "Great product and value.  Overall RentRedi provides a very automated solution for property management, rent payments, and tenant communication at a fraction of the cost of alternatives.  Having the features available without other required add-ons (accounting, etc.) keeps this product above the rest for us."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Billy/Lorrie Watkins",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T20:03:11.000Z",
          "Titre": "Simple & Cost Effective",
          "Contenu": "The interfaces are not fancy, but they work just fine.  Overall, using the app is simple and cost effective."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stuber-Velasquez Trust",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T17:05:05.000Z",
          "Titre": "We love the app",
          "Contenu": "We love the app! We have cancelled our property management agreement, the app allows us to effectively and efficiently self manage our properties. The tenants love the ease of using the app as well. The cost is affordable for small business. We have moved all our various entities over to RentRedi. It has been a win, win for everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew Cosme Jr",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:42:16.000Z",
          "Titre": "Honestly everything is just so easy and…",
          "Contenu": "Honestly everything is just so easy and I feel like I haven’t even learned all the tools to make things even easier."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda C",
          "Nb_Reviews": 2,
          "Date": "2021-07-08T18:37:45.000Z",
          "Titre": "Fantastic app, makes management easy",
          "Contenu": "Fantastic app to manage rental properties It Does take a few days to get the rent when the clients use the app- but the convenience is well worth it. When you have questions you get answers either by chat or phone. Even the online repair request makes it easy to keep a list of things to do. And the ability for tenants to upload photos helps. Amazing follow up for any questions and a great product"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nuremberg Properties",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T17:03:17.000Z",
          "Titre": "We love the app",
          "Contenu": "We love the app! We have cancelled our property management agreement, the app allows us to effectively and efficiently self manage our properties. It also saves us $14,000+ per year in management fees. The tenants love the ease of using the app as well. The cost is affordable for small business . It has been a win, win for everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Krystal Freedom",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T17:32:48.000Z",
          "Titre": "RentRedi is your best Value…",
          "Contenu": "I have been with RentRedi for almost 2 years. I suggested some changes/improvements over this time and they implemented those changes which was great! RentRedi makes being a smaller property management business very easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marco & Christine Padilla",
          "Nb_Reviews": 2,
          "Date": "2021-07-28T14:05:28.000Z",
          "Titre": "As we continue to grow our rental…",
          "Contenu": "As we continue to grow our rental portfolio RentRedi continues to help us out on how to make the best use of their software. Especially now with managing our out of state properties. Keep up the great work guys & gals!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jabbar",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T18:37:45.000Z",
          "Titre": "Rentredi is super awesome",
          "Contenu": "Rentredi is super awesome. I have 5 tenants and I was successfully able to manage them from 2,000 miles away. It helps me with a very detailed tenant application, communicating with tenants, putting my vendors on a schedule I can track, rent collection and everything. Can’t recommend these guys more. The big thing is they have chic Fil la like customer service, there team is fast so if you have any issues with the site they can help. They have tons more features that I can’t wait to try out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "One Happy Customer",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T20:01:52.000Z",
          "Titre": "I joined RentRedi a year ago and every…",
          "Contenu": "I joined RentRedi a year ago and every time I have had an experience with their Chat line, the people have been really helpful, knowledgeable and pleasant to deal with.  They all seem to go out of their way to make their clients feel good.  The days of good customer service are waning, but these guys really shine!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lilly",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T21:36:38.000Z",
          "Titre": "I love this App",
          "Contenu": "I love this App.  Since my tenants are in another state, I was told I would need a management company to manage my property.  I looked up Management apps and found this one with great reviews and the price was right.  What I didn't expect was how user friendly it is and how available the staff is every time I type in a question.  They are all very nice and helpful and if I'm not too sure about something and I want to speak to a live person, I can set an appointment and they're there to help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T10:59:40.000Z",
          "Titre": "Excellent! Purchase now!",
          "Contenu": "Excellent program especially for the Price!  It handles so much of our management needs for a fraction of the cost these other property management softwares.It was one of the best moves we made for our properties."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria E Hernandez",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T02:25:08.000Z",
          "Titre": "Thank you RentRedi!My tenants like the easiness' of making…",
          "Contenu": "My tenants like the easiness' of making their monthly rent payment.  They make few if any mistakes.  Great costumer service and help with every problem I can not fix myself."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Heppner",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T15:41:42.000Z",
          "Titre": "This platform has made it so easy for…",
          "Contenu": "This platform has made it so easy for my company to manager our properties and assets"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JUAN",
          "Nb_Reviews": 3,
          "Date": "2023-04-26T18:04:21.000Z",
          "Titre": "Easy to use, effective and efficient",
          "Contenu": "Been using it for two years. I have uploaded two separate leases and managed rent without issue, including additional fees and months with not tenants. RentRedi made it easy to manage documents, fees, notifications."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MatchPointPM",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T18:34:53.000Z",
          "Titre": "I am thrilled with the RentRedi system…",
          "Contenu": "I am thrilled with the RentRedi system so far. I continue to give them feedback to and they receive it very well. I am able to get support within minutes of my requests. They are a cutting edge technology platform that serves my property management company very well! Thank you all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pasadena Marina Properties, LL",
          "Nb_Reviews": 1,
          "Date": "2021-07-14T16:02:08.000Z",
          "Titre": "No regrets",
          "Contenu": "It isn't perfect - no system is, but it has helped me as a landlord to automate a lot of things I was previously doing manually, including online, automated rent payments. The company is very responsive and really listens to customer feedback. No regrets at all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T17:58:08.000Z",
          "Titre": "This is by far the best software for…",
          "Contenu": "This is by far the best software for property owners. It is easy to use and also has a tenant portal that collects payments. You pay one fee and manage as many properties as you would like."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DFW Elite Management",
          "Nb_Reviews": 1,
          "Date": "2023-02-23T16:41:59.000Z",
          "Titre": "Great software for landlords!",
          "Contenu": "This software does everything I need as an owner of 20 doors. My favorite is that you can stop payments and require them to be paid in full(no partial payments)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Tan",
          "Nb_Reviews": 9,
          "Date": "2023-04-12T18:16:06.000Z",
          "Titre": "Easy to use and set up for any new…",
          "Contenu": "Easy to use and set up for any new tenant. Also, it is easy to remove any existing tenant who moves out. I love the calendar view to see which tenants paid their rents on time and which have not and need to be evicted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristy V.",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T19:40:08.000Z",
          "Titre": "Great rental app",
          "Contenu": "I have been very pleased with the functionality and ease of this platform. Customer service has also been outstanding. Great services for a very reasonable price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda L",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T22:47:12.000Z",
          "Titre": "Good easy tool quick assistance",
          "Contenu": "quick assistance through the chat feature. Help articles linked for thorough answers and if that isn't enough live chat is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Frederick",
          "Nb_Reviews": 2,
          "Date": "2023-06-06T04:36:13.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service. The guy went above and beyond to properly structure my account so that I could properly collect my rent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2021-07-10T21:44:41.000Z",
          "Titre": "Easy to use software at a great price",
          "Contenu": "Easy to use software at a great price. I mostly use the rent/tenant tracking, application, and rent payment portions of the software and it has been a huge time saver!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T13:12:22.000Z",
          "Titre": "Online support team was awesome 🤩",
          "Contenu": "Online support team was awesome 🤩 They assist me every step of the way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Nguyen",
          "Nb_Reviews": 1,
          "Date": "2023-02-21T23:29:28.000Z",
          "Titre": "The best landlord app ever.",
          "Contenu": "The best landlord one stop shop app. Super easy to use. Have all the services that makes being a landlord enjoyable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elisabeth Muse",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T00:43:48.000Z",
          "Titre": "RentRedi saves me a ton of time I used…",
          "Contenu": "RentRedi saves me a ton of time I used to spend on record keeping, and automatically tracks and adds late charges I was missing when I did rent collection the traditional way."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARWAN MASOUD",
          "Nb_Reviews": 2,
          "Date": "2023-04-12T19:24:34.000Z",
          "Titre": "So far it is great as we are still not…",
          "Contenu": "So far it is great as we are still not using it completely But we are in the final process to completely using it in our work."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T02:17:05.000Z",
          "Titre": "The assistant was clear and concise!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Thomas Phu",
          "Nb_Reviews": 1,
          "Date": "2023-01-26T21:14:23.000Z",
          "Titre": "This is an amazing app",
          "Contenu": "This is an amazing app, it has everything a small time landlord needs and more! Then the customer service is out of this world . I love using this app"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morgan la Fee",
          "Nb_Reviews": 2,
          "Date": "2021-07-08T19:05:05.000Z",
          "Titre": "There were issues with my account and…",
          "Contenu": "There were issues with my account and the team stood behind their product /services by making it right Thank you !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lashaun",
          "Nb_Reviews": 1,
          "Date": "2021-07-08T16:34:04.000Z",
          "Titre": "ONE OF THE BEST PLATFORMS FOR ALL YOU…",
          "Contenu": "ONE OF THE BEST PLATFORMS FOR ALL YOU REAL ESTATE PORTFOLIO NEEDS !!!!!!!!! NO COMPLAINTS"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Twimom",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T20:49:15.000Z",
          "Titre": "So far so great!",
          "Contenu": "We are new to this app, but so far so great! It is such a big help to help us keep track of everything!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbarite Adams",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T19:41:06.000Z",
          "Titre": "Why I choose RentRedi",
          "Contenu": "I appreciate this application for its ease of use, and because the developers continue to improve options. A great resource and valuable tool for real estate professionals!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lane",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T17:50:02.000Z",
          "Titre": "Great service everything that a small…",
          "Contenu": "Great service everything that a small landlord needs to be successful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luke Kippert",
          "Nb_Reviews": 2,
          "Date": "2023-02-15T23:35:58.000Z",
          "Titre": "RentRedi FTW",
          "Contenu": "Love this website. Super easy to collect rent/utilities and screen potential tenants. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T16:20:48.000Z",
          "Titre": "Works well and no headaches.",
          "Contenu": "We're going on a couple of months, and it's going well! Really liking the metrics."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mr. Black",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T18:20:44.000Z",
          "Titre": "Best landlord application hands down!",
          "Contenu": "This application has simplified the screening process and allows seamless distribution and oprganization of applicants. I have tried several other applications, and none can compare to Rentredi's service and price for product."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amy",
          "Nb_Reviews": 2,
          "Date": "2021-07-14T16:19:40.000Z",
          "Titre": "Professional and concise",
          "Contenu": "I like having all my documents and payments in one place and the platform presents a professional appearance to potential renters"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CC",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T20:49:31.000Z",
          "Titre": "Love working with RentRedi for property…",
          "Contenu": "Love working with RentRedi for property management software!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonathan R",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T18:33:11.000Z",
          "Titre": "thank you for servicing my rentals"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kendrick Nesbitt",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T21:40:43.000Z",
          "Titre": "Excellent Systems",
          "Contenu": "Very easy to use. Straightforward and customer service is excellent!’"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Cunliffe",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T17:41:17.000Z",
          "Titre": "Easy",
          "Contenu": "Easy to use and set up. Responsive when help is needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TS",
          "Nb_Reviews": 1,
          "Date": "2021-07-15T23:42:15.000Z",
          "Titre": "Love rentredi!",
          "Contenu": "Such a great platform for renters and tenants."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Merika Mcmillan",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T18:38:01.000Z",
          "Titre": "Great app and makes everything easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian Jones",
          "Nb_Reviews": 1,
          "Date": "2023-06-07T19:54:07.000Z",
          "Titre": "Updating it to make it commercial property",
          "Contenu": "Quick response"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amona",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T14:09:29.000Z",
          "Titre": "Super easy and Great customer support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Irina",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T17:04:21.000Z",
          "Titre": "Answered my question clearly and…",
          "Contenu": "Answered my question clearly and quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-19T16:48:16.000Z",
          "Titre": "Customer service is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dana",
          "Nb_Reviews": 1,
          "Date": "2021-07-07T15:59:32.000Z",
          "Titre": "Extremely Happy with this app."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholas",
          "Nb_Reviews": 2,
          "Date": "2021-07-07T17:06:59.000Z",
          "Titre": "Customer service is very motivated and…",
          "Contenu": "Customer service is very motivated and always helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dave Feldman",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T22:53:02.000Z",
          "Titre": "Simple and effective.",
          "Contenu": "Excellent customer service and product functionality!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Corey Brown",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T17:51:42.000Z",
          "Titre": "Attention to cetail"
        }
      ]
    }
  ]
}