{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "rentcars.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "MEM",
          "Nb_Reviews": 14,
          "Date": "2023-12-21T20:53:38.000Z",
          "Titre": "Work with the scamming company HDC in…",
          "Contenu": "Work with the scamming company HDC in Miami. Don’t rent at HDC!! Search on Scammers, driving license, Sunpass etc"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gareth Norman",
          "Nb_Reviews": 5,
          "Date": "2023-12-15T09:40:28.000Z",
          "Titre": "Deposit withheld and poor customer service",
          "Contenu": "The initial rental experience of booking and confirming through Rentcars was good, easy to use and quick. After that the experience got rapidly less pleasant. The company that they used to supply the cars was definitely not one shown on their website. The quality of the car we rented was terrible. And the service from them worse. Trying to contact Rentcars and get help from them is difficult, only emails and very slow. But the response when you got it was always the same - not our problem. The final straw and why I would suggest never using Rentcars is that the rental company has withheld my deposit. Rentcars says the company has 30 working days to return it and even when that has passed the deposit has not been returned and no help from Rentcars. Rentcars use sub contractors. They advertise the big names on their website but when you boom it’s with the least reputable companies out there."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "ira",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T09:19:30.000Z",
          "Titre": "they charged me double the price that was agreed in advance",
          "Contenu": "Very bad experience with the Guerin rental company in Portugal. At the end of the hire, they charged me double the price that was agreed in advance. I complained through their website 4 times, it's been 3 weeks and I still haven't heard from them. This is very serious to me. If this is not stopped, more people will continue to fall into the trap by their own hands."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Graham Mc Neill",
          "Nb_Reviews": 11,
          "Date": "2023-12-16T09:29:22.000Z",
          "Titre": "I completed the online booking form in…",
          "Contenu": "I subsequently had a reply from RentCars which was a link to their full Terms and Conditions which mentioned possible charges for over aged 70s drivers. THESE WERE NOT LISTED during the online booking process or the price quoted. The final price was 5 times more.!"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "Tiago Andre",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T12:19:27.000Z",
          "Titre": "Worst Rental experience so far",
          "Contenu": "One reservation choose unlimited mileage: Ended up having limited mileage.Other reservation on Suisse airport, Ended up with a car from the French SIDE of geneve airport.Don't use this company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Ibrahim",
          "Nb_Reviews": 4,
          "Date": "2023-12-16T10:58:13.000Z",
          "Titre": "They took my deposit and rental company was no where to be seen",
          "Contenu": "They took my deposit and sent me confirmation voucher and code. When I got to the airport, the rental company in Abu Dhabi said they had cancelled the contract as the price was incorrect (something to do with not including airport fee) - so when I challenged them why they took my money, they said it is not us and instead Rentcars.com who by the way have an intentional Brazil number you can call (£££) in order to rectify your issues - the relevant emails that came to my inbox were also in Portuguese for the booking.  Even 24hrs prior to the booking they sent me a confirmation email reminding me how my reservation was all green to go, whereas, the rental company had never accepted it.So we were left with my five daughters aged 1 to 10 with no car and no way of getting a taxi legally from the airport as they are not allowed to let more than 6 passengers into a taxi (officially, and the airport needs to be squeaky clean) - the reason I was hiring a 7 seater in the first place."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Vero Marie D.",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T01:02:04.000Z",
          "Titre": "❌ TOTAL SCAM ❌",
          "Contenu": "❌ TOTAL SCAM ❌@rentcars you guys are the biggest scam ever! We have rented a car, cancelled it (legally in time as per the companies term & conditions) due to scam warnings for the initial car rental companies you work with (in our case keddy by EuropeCar). We have had five phone calls over the past weeks to get our money back. The only answer has been, that our money will be refunded within 3-5 working days. Since weeks we haven’t received any refund! ❌ TOTAL SCAM ❌"
        },
        {
          "Note": 1,
          "Lieu": "ES",
          "Pseudo": "Bárbara Ituarte",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T19:38:23.000Z",
          "Titre": "Noleggiare are scammers!",
          "Contenu": "Noleggiare are scammers!!  If you don't pay the full insurance, they make you pay for any damage to the car even if you didn't do it. They want to make me pay for damage that I didn't do, although in the initial contract it appears that this damage was already there and I showed them photos that prove it.  They don't care, they still want to steal my money by charging me more than what it costs to fix it.  They are thiefs!! Scammers!! Don't let anyone rent with them because they are going to steal from you!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Krista  Huber",
          "Nb_Reviews": 2,
          "Date": "2023-11-29T16:32:28.000Z",
          "Titre": "You would NOT give me a car as I am a…",
          "Contenu": "You would NOT give me a car as I am a Canadian and you people have discriminated against the Insurance Institute Of Canada by demanding no car without your insurance.  I want to know who the president is as I will be filing a complaint with BBB and the Insurance Institute of Canada.  I want my refund ASAP"
        },
        {
          "Note": 1,
          "Lieu": "PE",
          "Pseudo": "EDUARDO RADICE RADICE",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:22:29.000Z",
          "Titre": "INCOMPETENCE",
          "Contenu": "Easy. We had your reservation confirmed to pick up  a car at 09,00AM in the morning.  When we  arrived at the office they had no idea of that. They suggested I should have to call you  back (where???) and that you were reponsible for this. They found a similar car  entering at 15,00PM. ABSOLUTELY IMPOSSIBLE"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Jairo",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T19:22:48.000Z",
          "Titre": "IMPROPER CHARGER",
          "Contenu": "The attendent offered a new car fordifference payment. I returned the car with full gas, but the company charged me $ 20,00 for that. The problem is, at the return moment there's no nobody to check the car and after is easy fot then to say what they want.,"
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Martha Nel",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T14:05:26.000Z",
          "Titre": "TERRIBLE",
          "Contenu": "No direct contact person for South Africa.  Rentcars deducted a higher amount from bank account than quoted amount"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "shaun munro",
          "Nb_Reviews": 3,
          "Date": "2023-10-30T11:58:58.000Z",
          "Titre": "Arrived at the airport and no one to collect us or answer the phone......avoid at all costs",
          "Contenu": "Arrived at the airport and no one there to collect us for the shuttle to the car collection. Tried to call for two hours and no one ever answered the phone or returned our calls. Ended up having to book another cart with a different company and paid a huge premium."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T05:42:41.000Z",
          "Titre": "Reservation was not valid",
          "Contenu": "We reserved with Renters and we received a confirmation email with our reservation.  However, the voucher sent was not valid and when we tried to use our reservation number directly with Hertz, it is not valid either. I checked our credit card statement and we have been billed.  Now I will have to call an international number to rectify the problem.  Frustrating!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Michelle Papna",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T06:31:48.000Z",
          "Titre": "Horrible service",
          "Contenu": "This is the first time I have a horrible experience with renting a car using this website. I was trying to contact them to cancel the reservation but the number that was posted was not working. In addition, I had to call a long distance number which means I will have to pay.  They made so easy to get a reservation but made it so hard to get your money back. I will never use this website again to look for rental cars. I will go with the big companies even if I have to pay more. At least there is no surprise fees. I feel like I was cheated. It would have been better if they said we have to pay additional fees that are mandatory."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Madeline",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T04:22:20.000Z",
          "Titre": "Inaccurate rental terms",
          "Contenu": "Rental terms provided at time of booking not honored at actual rental location. Mileage capped at 300 per day and all above that at an extra fee. Also confirmed prior to booking that no additional hold would need to be put on my credit card and was forced to put a $1500 hold to get my car. Also wanted a compact and was given a SVU which isn’t as fuel efficient"
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Rafael",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T23:31:44.000Z",
          "Titre": "Car Durty",
          "Contenu": "Car DurtyService -5 Puntos (No Gentle at all !!!! Coral Gables Hertz.Durty outside, and paper for the bathroom in the Guantera this is incredible.Car You can enter smell smoking carpets un Asco."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "nick punyamurthy",
          "Nb_Reviews": 2,
          "Date": "2023-11-23T19:31:57.000Z",
          "Titre": "Terrible company with all kind of…",
          "Contenu": "This is about Routes Car Rental in Orlando, FLTerrible company with all kind of ridiculous rules that were not disclosed at the time of booking. Ultimately they left me stranded with no cars in Orlando in the middle of the night!Here are the details: I booked a car from them from Orlando Airport for 11/12-11/17/2023. While booking they said that they do not rent to Florida residents and I should have a return flight ticket. I was fine with both conditions. When I went to rent, they tell me that my return flight ticket has to be on the same day as their return of car...that was never mentioned. My return was on 11/19/23 as I did not need the car from 11/18-11/19/2023. Bocuse of this they refused to rent me the car. Left me stranded in Orlando with no car at 11:30 PM in an unsafe area outside their rental office. I had to get a Lyft to get out of this unsafe place. The staff were very uncooperative and inconsiderate even though it was their unclear policy that left me stranded!Never rent them...they will try to get you some way or other!"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "TVTrav",
          "Nb_Reviews": 2,
          "Date": "2023-10-23T18:12:17.000Z",
          "Titre": "I paid in full for my rental but received bogus charges anyway",
          "Contenu": "I paid in full for my rental, was charged $154.28 in extra bogus charges, and there's no way to talk to someone about it. They have a useless chatbot, but otherwise it appears there's no customer support whatsoever."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Arifa Khalil",
          "Nb_Reviews": 1,
          "Date": "2023-09-17T17:00:51.000Z",
          "Titre": "Very Disappointed",
          "Contenu": "Hi - we selected a 7 seater and paid. But when we got to Malta only to be told its a 4 seats. This caused a lot of inconvenience as you can imagine on your 1st day of your holiday  So the car category we were suppose to have; they didn't even have that available until the following day. Be careful with this website as the car you select is different to when you pay for it. Please ensure you check the category of car when you're going to pay."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Henk",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T14:58:57.000Z",
          "Titre": "Dissapointing service!",
          "Contenu": "Sadly Rentcars service was disappointing as we requested a minor time change which Rentcars was unwilling to accommodate. Fortunately Sixth was very helpful in this regard. For this reason will not be using Retcars in future. Much easier and efficient to deal directly thank through an unhelpful third party - lesson learned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sergio Perez",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T19:46:16.000Z",
          "Titre": "The Mystery Driver",
          "Contenu": "Driver who supposed to pick us up at the Airport in Guadalajara Jalisco never showed up. I kept calling the office and they kept telling me driver is on the way. Waiting for 1 and 1/2 hours driver did not show up. Called the office for the 6th time and the representative told me driver picked up another family and driver went back to pick us up. To make a long story short. Driver didn’t show up. 😠"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Xiangang Guan",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T06:53:33.000Z",
          "Titre": "It is very unfair!",
          "Contenu": "Because the post machine at the counter couldn't swipe my credit card when I picked up the car, because my credit card is a magnetic stripe card, and didn't have a Sim chip, so I couldn't pick up the car.My pickup time is July 27th at 10:00 pm I didn't pick up the car and I called the Herz and Rentelcars company.But The customer says it's been over 24 hours since I called and can't refund me.It's very unfair and makes me very moody and disappointed!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mandy Barrett",
          "Nb_Reviews": 5,
          "Date": "2023-07-22T16:28:59.000Z",
          "Titre": "Do not book with this company",
          "Contenu": "Do not book with this company Booked a car from limoges Airport booked and paidTurns out sixt car rental  aren't  based at limoges  Airport but in limoges itself Rentcar advertised the car to be collected  frow the Airport So you have to get a taxi costing 40euros each way on top of your rental costSixt car rental we're brilliant  and have Contacted rentcars numerous  times to change listing but they continue To ignore them so beware when booking also trying  to contact  rentcars is a nightmare"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Emma Sharpe",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T11:40:06.000Z",
          "Titre": "Very, very dodgy website!",
          "Contenu": "Have been through the payment process twice now to reserve a car, but the website just freezes (seemingly after you have paid!) and you don't know if you've booked or not.Reservation number S4BD9JQ - now getting very uneasy that this company has had my card details twice and still not confirmed a booking!  And there's nowhere to contact anyone to get help - useless."
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "José María Alberto",
          "Nb_Reviews": 2,
          "Date": "2023-01-27T13:41:34.000Z",
          "Titre": "It was not a good experience",
          "Contenu": "It was not possible to modify a reservation data without canceling it. Please, new users, read the entire contract carefully, there, for example, it says that in case of cancellation, a minimum of 3% will be charged and that the refund of the money takes up to 20 days. But the worst thing is that there is no real contact (phone, email) with the company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "zoe pearman",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T10:07:06.000Z",
          "Titre": "EXTREMELY DISAPPOINTING",
          "Contenu": "EXTREMELY DISAPPOINTING, when we went to pick up our Enterprise rental, after adding the excess protection it worked out to over double the agreed price so we had to reduce our rental to 2 days instead of 3 days. So no relaxing weekend away just a day of driving there and a day driving back. Also the pick up location said North terminal rather than south terminal. Feeling EXHAUSTED & FRAZZLED thx"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Southwell, Claudia",
          "Nb_Reviews": 5,
          "Date": "2022-12-23T14:56:19.000Z",
          "Titre": "Avoid!",
          "Contenu": "I went to collect the car to find out the rental company didn't accept driving licenses other than for the own country. Ended uo having to call the customer service to find an alternative company and pay a lot more than originally paid. I also had to pay for it twice ifnI wanted to get the car for that day and am still waiting for a refund for the original payment. Nightmare! Looks cheaper but ended up a lot more expensive."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Luis Riquelme de Bustamante",
          "Nb_Reviews": 2,
          "Date": "2022-12-08T22:13:31.000Z",
          "Titre": "Next car didnt pass me a car if I don't pay pay 400 USD extras",
          "Contenu": "I payed 200usd and after in the company where I choose the car, they didn't rent the car because they wanted than me payed 400usd more over the firts price like obligation of taking all insurance to the car.Im here travelling with 2 babies with 1 years old each one twins and my couple and was the worst experience in my life.And now rent cars don't response for refund the money"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "bradley",
          "Nb_Reviews": 10,
          "Date": "2023-02-20T12:20:42.000Z",
          "Titre": "Failure at the last step! Misery! But re-Booking has worked!",
          "Contenu": "Went through the rental process only to find that the payment system failed. At least, I hope I wasn't charged, as I received no confirmation of the booking.A dispiriting experience!But Guilia from RentCars has worked to solve the problem. Now, all is booked and hoping for no more problems when Picking up the car in Lisbon"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "XINYUE SONG",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T14:44:50.000Z",
          "Titre": "Scam company with many names: one switch , next car, surprice...because their reputation stinks",
          "Contenu": "The voucher in the email never loads on your system. Got to the counter, was told that there was no unlimited mileage..I would have to pay more for that actually surprisingly. Clerks are rude and helpless. Not giving their manager's phone number either. Totally a scam company. Will expose it everywhere in social media"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Ricardo Medina",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T17:12:16.000Z",
          "Titre": "When I got to the airport I went…",
          "Contenu": "When I got to the airport I went directly to HERTZ.They said there was not any car available (same model and type I reserved). They offer me a different car buy I have to pay 4 times more than the initial payment.Their attitude was completely unprofessional and abusive.Today, I cannot communicate with your support area to claim the reimbursement.The reservation number is: 0B9571."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Karl Rasmussen",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T00:18:58.000Z",
          "Titre": "Beware renting with Routes car rental",
          "Contenu": "Booking with rentcars was not an issue. Attempting to communicate with the rental provider, Routes, in order to cancel the rental has been a real headache! A family emergency required me to cancel my trip. Calling the phone number provided for Routes at Calgary airport, multiple times on multiple days, heeded zero results because no one answered the phone and all voice-mail were full. Then, emails sent to Routes using their customer care email and their Calgary email did not result in a response from the company. A terrible experience."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "jon warren",
          "Nb_Reviews": 2,
          "Date": "2022-12-10T20:14:43.000Z",
          "Titre": "Site does not work neither does ask Carol",
          "Contenu": "Twice, once this morning & then I tried again this afternoon I went through the whole process including bank verification & then the site stops not allowing confirmation & ask Carol does not work either so hopefully no money comes out of my account because I am booking a car on another site that actually works & does not waste my time."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Joshua Feetham",
          "Nb_Reviews": 5,
          "Date": "2022-12-21T20:37:40.000Z",
          "Titre": "Terrible company!",
          "Contenu": "Terrible company!! Booked a car with these and wasn't able to collect the car as our flight got cancelled. I called immediately the number they provided in the emails. Spoke to a guy from the hire company and was told I'd get a full refund minus a fee of £40. Now rental cars are claiming there's no records of my cancellation and refusing to refund anything! Avoid this company, just out to make a quick book of people in unfortunate circumstances. Would be 0 stars if possible."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Sheyla",
          "Nb_Reviews": 6,
          "Date": "2023-02-02T16:35:53.000Z",
          "Titre": "Réservation confirmée par Rentcars mais pas de voiture disponible à l'agence de location",
          "Contenu": "Today is 02.02.2023, after one month of my bad experience with Rentcars, I have received two emails from the Quality Customer's Service of Rentcars offering the reimbursement of the total amount of the reservation that they didn't respect, they offered me a 10% discount in my next reservation and asked to change the one star note I left.At this moment, I haven't received the reimbursement in my credit kard. I've sent another email and no response at all.Do something Rentcars.****************J'avais la réservation 87K76P5 confirmée, à récupérer le 31.12.2022 à 18h00. Aujourd'hui 31.12.2022 vers 14h30 j'ai reçu un appel du propriétaire de l'agence de location qui m'a prévenu qu'ils n'ont pas de voitures disponibles. A aucun moment je n'ai été informé par \"Rentcars\" et à ce moment la réservation est toujours confirmée sur l'application. Pouvez-vous me dire ce que je dois faire maintenant. Je me trouve sans voiture pour les fêtes de fin d'année et pour lundi 02.01.2023."
        },
        {
          "Note": 1,
          "Lieu": "IT",
          "Pseudo": "Lucio Sirotti",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T06:31:27.000Z",
          "Titre": "Is my booking confirmed",
          "Contenu": "Can you please confirm that my reservation has been cancelled.ThanksLucio"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SFor",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T14:51:38.000Z",
          "Titre": "I received a reservation confirmation…",
          "Contenu": "I received a reservation confirmation and booking number on day I booked car. Now a day before my trip it is not coming up in your system at all. Says I have no bookings. As there is no way to call you and can only email you with a 48 hour of response I will need to book a different car. What a joke! Or maybe a scam????"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "WOJCIECH WIERZCHUCKI",
          "Nb_Reviews": 2,
          "Date": "2023-08-17T20:03:37.000Z",
          "Titre": "I honestly do not recommend",
          "Contenu": "I honestly do not recommend. When selling additional insurance, we were deceived that everything is insured. When someone broke our window and we returned the car, the lady said that the glass is not covered by the insurance. Nobody wanted to talk to us. The deposit has been stopped. They did not want to give any bill for the repair. The contact was very rude. They generally don't care about the customer. He cheats people. I recommend to be careful!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "TMIK",
          "Nb_Reviews": 23,
          "Date": "2023-02-13T21:12:53.000Z",
          "Titre": "Follow up to my earlier review which…",
          "Contenu": "Follow up to my earlier review which they replied to without answering 2 of the questions asked. How does a person contact them if they have a question on a future rental when the 800 number they list goes to a spammers website and the CHAT  line goes NOWHERE because it's not working or isn't manned."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Angel  Cain",
          "Nb_Reviews": 1,
          "Date": "2023-09-04T15:50:31.000Z",
          "Titre": "Did not get the rental",
          "Contenu": "Did not get the rental, first they said it was not unlimited mileage it was only 300lm and second they asked for $1500 deposit when the contract said $500 . And after all the only way to contact rentcars.com is through an international phone number"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leslie G.",
          "Nb_Reviews": 2,
          "Date": "2023-04-15T03:29:26.000Z",
          "Titre": "Very disappointed!",
          "Contenu": "We were very disappointed with our recent rental with Routes in Denver, Colorado in April 2023. We were given an older car with license plate stickers from 2021 (fortunately we did not get stopped and ticketed), a chip in the windshield and wipers that were flapping rubber and totally useless in the snowy, wet mountain roads. We had to put air in the back tire twice in our 5 days of rental. The vehicle was not clean when we received it either. It seemed as though it was an employees vehicle, not typical of a rental company."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "A Panjwani",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T16:28:20.000Z",
          "Titre": "Worst application",
          "Contenu": "Worst application, no support at alll!!!All good reviews are fake reviews!!!!I booked a car near YYZ airport and found that they never received any booking under my name!!! After receiving confirmation as well from rentalcarsThey made my Holiday at risk !!! No contact support available to answer any questions!!"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Pedro",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T07:47:40.000Z",
          "Titre": "Rentcars & Rentalcovers",
          "Contenu": "Booked a car through RentCars app with a company called Nissa in the airport of Antalya, Turkyie.There was no guichê of that company at the airport, neither was it a known company for the locals we asked. There was nobody waiting for us or pick-up service. We tryed calling the number that was given at the contract, but it was a wrong number.Contacted RetnCars, told them what happened and was informed that they would check if the car was rent or not, but nevertheless that they could not give me a refund from the protection that I had bought, because that was provided through a third party company called \"Rentalcovers\".Rentalcovers website tells you that only rentcars can cancel the insurance.Now I'm on the loss of the amount charged me for renting a car that was not rented and also for the protection of that car that was never provided. For me this is simply bananas. I've used rentcars many times before, but this time it was really a bad experience."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Venâncio Freitas de Araújo",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T00:28:53.000Z",
          "Titre": "Não recebi o estorno da garantia de…",
          "Contenu": "Não recebi o estorno da garantia de 700,00 Euros que foi debitado do meu cartão de crédito como caução na entrega do veículo.Solicito a devolução do valor.I did not receive the guarantee reversal of 700 Euros that was debited from my credit card as a deposit upon delivery of the vehicle."
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Goncalo Vieira",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T10:20:51.000Z",
          "Titre": "Bad service",
          "Contenu": "I had a value of 31€ and suddently after paying I get a value of 36€. You need to confirm the real value of the transaction before charging.Edit: Yesterday the flight got delayed, arrived to the rental car no one was there and no one answered the phone. had to get a taxi to get to the hotel."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lahrizi Zi",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T22:59:57.000Z",
          "Titre": "ACARENT Morocco bad customer service and terrible experience",
          "Contenu": "ACARENT bad customer service and terrible experienceI rented from ACARENT Morocco for 1 month, I called them to return it one week earlier, and they agreed and came and picked up the car from my house and promised me a refund within 7 days, but they never did, I called ACARENT and they changed their mind and said they would not refund me.Also, their cars are in bad condition, they gave me a car that needs service, the back windshield was a brook, empty of gas and had a lot of scratches and pumps everywhere in the car, The back right tire had a hole that any time can cause you problem if you are driving a long distance.Also, ACARent Casablanca will take your deposit. they will find anything that existed in the car already and charge you for it. STAY AWAY"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Katinka  Salgado",
          "Nb_Reviews": 1,
          "Date": "2022-12-30T17:06:36.000Z",
          "Titre": "It was a shame I had to do everything…",
          "Contenu": "It was a shame I had to do everything again because I received a mail indicating my reservation was cancelled and I didn't cancel it ! But I downloaded the app and did all again. Isuggest you check why is this annoying situation happening.Besides that if you want to print from the application it says \"voucher not available\" and we have to wait the nail confirmation.Actualization:Besides the situation that they cancel my reservation they charged me 270 EUR and they want to give me back after 14 days they said only 84.49 USD !!!!"
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Marino Signorelli",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T09:29:50.000Z",
          "Titre": "Awful experience",
          "Contenu": "The battery of the car ran out after the first stop. I called to have a another car but I had to wait several hours. The office kept assuring that they needed just few minuts but they just ignored my request. I lost my entire day of vacation and I will sue them for a compensation"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria Fernández",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T05:24:41.000Z",
          "Titre": "Trying to contact customer service…",
          "Contenu": "Trying to contact customer service since December 24 for problems with a reservation. Can’t find any phone number for USA, chat on company web page not working, sent message by email and messenger and nothing. We lost one vacation day and have to make and pay other reservation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Hassan Elmoussaoui",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T23:33:58.000Z",
          "Titre": "Rental car 8 and car rental route.",
          "Contenu": "First this company is not located in the airport. they will not allow you to drive out of canada. you will not get your all money back. I took the car from their location to my garage to the hotel garage and still trying to find somethig to charge my insurace especially if you have full coverage. Please don't use car rental 8 or rentalcars located in canada."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Sheyla",
          "Nb_Reviews": 6,
          "Date": "2023-02-11T09:26:55.000Z",
          "Titre": "RUN AWAY FROM THEM!",
          "Contenu": "Hello Rentcars, I'm back to ask for my money. On the 31.12.2022 you left me and my children without a vehicle to celebrate New Year's Eve with our family and friends.  On the 02.01.2023 you have offered me the refund of my booking and after that you ghosted me.Neither the girl named Beatriz nor the boy named Hyrum, or the Customer's contact e-mail would do anything. The WhatsApp number is a bot with automatic replies. No refund, no explanation, nothing. After reading several reviews on Google I've seen that is the way you work. You steal money's people! Worst service ever!!! Run!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cynthia",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T13:15:52.000Z",
          "Titre": "The experience was completely horrible",
          "Contenu": "The experience was completely horrible. Took hours for the “book” button to finally work. I had to refresh the page numerous of times before it worked. I was consistent because I wanted to get the deal but I was extremely close to spending my money elsewhere even with it being more expensive. Please take time to update the functionality of your page. This was such a frustrating experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kim Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T15:21:49.000Z",
          "Titre": "Don't use this company!!!!!",
          "Contenu": "We made reservation with a 10pm pick up time but the car rental place closed at 10am. After we arrived at destination to get car, the car rental company (Routes Car Rentsl) canceled our reservation so we are out $150 that we prepaid.  we had to spend $62 to get to hotel and then the next day we took a $24 Uber to the car rental and they said they had no cars and couldn't help us at all. We ended up renting a car from another car rental place for $486. How do you take our reservation and I put a pick up time of 10pm when the car rental is closed. I need my $150 refunded to me otherwise this is a scam."
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Radana Buzkova",
          "Nb_Reviews": 2,
          "Date": "2023-03-07T12:15:32.000Z",
          "Titre": "We booked a vehicle through rentcars.com",
          "Contenu": "We booked a vehicle through rentcars.com 3 months in advance. We were assured that everything was fine.After arriving at the location, we were told at the car company´s counter that the reservation had been cancelled.We called rentcars, we wrote rentcars an email. NO ANSWEAR.  We have not received any support.The truth is that rencars company has failed. It is not able to ensure the fulfillment of the obligations of the car rental companies with which it cooperate. It's it´s shame.With rentcars never again."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jenifer Dsouza",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T21:16:21.000Z",
          "Titre": "Wish there was Zero star!",
          "Contenu": "Wish there was Zero star!! Surprice Rent a Car is the worst car rental I've ever come across. After charging a full advance payment, they refused to provide me with the service upon reaching their office to pick my car because apparently I failed their Theory Test!! I have rented cars from so many places around the world but never have come across such a horrible experience. Staff and manager were both pathetic made me wait for an hour to get my documents. Manager Sadan was completely unaware of the rules. Once I got everything in order they did not release the car ruining my whole vacation. BE AWARE THEY ARE A SCAM AND NEVER BOOK FROM THEM. When I requested for a refund they asked me to reach out to the aggregator since they had not received the money from them.Booking Ref: GB771875020"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Susan Potts",
          "Nb_Reviews": 2,
          "Date": "2023-03-02T06:03:45.000Z",
          "Titre": "DO NOT TRUST RENTCARS",
          "Contenu": "Did not disclose additional charges. I was sold “insurance” at $12 a day which the rental company did not accept. I paid online $106 with $50 due at pickup. Rental company informed me $170.00 was due with a $500 deposit. The rental agent gave me a ride back to the airport. He complained to me the inaccurate info Rentcars quotes leaving him to clean it up. I am stranded at LAX with no car without my $106. Thanx"
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Stelio Belchior",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T16:42:12.000Z",
          "Titre": "American cars rental did not have a…",
          "Contenu": "American cars rental did not have a similar car and blamed the broker for not checking their inventory.  They tried in every possible way to pass me an inferior car, and only after a lot of fighting did they end up finding another similar car.  Also, I paid full insurance through rentacars, but that doesn't cover it through the rental company.  I had to pay again for services already contracted."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "hector valenzuela",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T04:01:24.000Z",
          "Titre": "nobody from the rent car company…",
          "Contenu": "nobody from the rent car company presented that day, and I rent with another company in the airpot for the double a payed cross your service, the worst experiencie of my life"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "chris",
          "Nb_Reviews": 6,
          "Date": "2023-02-24T15:59:22.000Z",
          "Titre": "Payments not working, no support whatsoever",
          "Contenu": "In spite of having carried out multiple payments with 3D authorisation, rentcars continuously asks me to perform the payment again. Support chat button does not work in German. If one switches to English, at least the chat window pops up, but only if you use Firefox. It does not work in Chrome. Their chat robot will tell you then to call Brazil…Terrible service\"This channel is exclusively for customer service with our virtual assistant.To receive personalized service, I suggest you contact my colleagues through the following channels:☎️ Call Center: +554131529700 (international call to Brazil) 📧 E-mail: support-(at)-rentcars.com\""
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "FXD",
          "Nb_Reviews": 2,
          "Date": "2022-11-29T05:45:45.000Z",
          "Titre": "I dont see the point of going through…",
          "Contenu": "I dont see the point of going through the reservation process and payment process when all I get, every time, is a message that reads \"Reserva no autorizada para anticipos\". You have waisted my time all day today!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "azee",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T17:46:28.000Z",
          "Titre": "I RENTED A CAR FROM YOU",
          "Contenu": "I RENTED A CAR FROM YOU, I DELIVERED IT WITHOUT ANY PROBLEMS, BUT YOU DID NOT RETURN MY DEPOSIT, I HAVE BEEN WAITING FOR 3 WEEKS, YOU ARE A SCAMMER"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gregory Leytes",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T17:49:34.000Z",
          "Titre": "Nobody met us at the airport as was…",
          "Contenu": "Nobody met us at the airport as was promised.Wrong not in service contact phone number was provided on the reservation to contact rental company.The rental company name Victory Rent a Car not one on the reservation. It was not aware per their representative that they should meet us at the airport."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexander Paoli",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T18:38:28.000Z",
          "Titre": "Scam",
          "Contenu": "Scam. You pay double or triple at the destination. They send me confirmation all paid, while the rental co said they do not know who Rentcars are. The rental co in Miami occur to be actually a mexican mafia"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Alejandro Cardenas",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T21:48:19.000Z",
          "Titre": "SCAM!!!!",
          "Contenu": "SCAM!!!!They told me that they would not refund my money since my credit card was not suitable even though it met all the requested parameters.They are scammers, be careful."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ahmed Tahoun",
          "Nb_Reviews": 3,
          "Date": "2023-05-06T20:01:03.000Z",
          "Titre": "Allegedly Fraud my Credit Card",
          "Contenu": "I had a booking, when I arrived to the pock up location, it was like a phone booth, where an agent comes on TV and asked to put the credit card in front of a Camera.They took photo of the credit card, both sides, and the driving license.2 days later I found charges amounting to more than USD 4,000 charged to my card ilover few transactions from $100 to $2500.Reported to bank for fraud, they stopped the charges, and replaced the card.In addition to the fraud that I discovered 2 days later, i was disappointed at the service provided and the extra charges they wanted to impose, and I canceled my booking, and got a car from another provider at IAH."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lajos",
          "Nb_Reviews": 1,
          "Date": "2023-01-17T04:51:14.000Z",
          "Titre": "I cannot complete the booking…",
          "Contenu": "I cannot complete the booking reservation. The website is rejecting the payment for partial prepayment. Nobody is available for help. No customer service. The Brazilian phone number disconnects before you have a chance to present your issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Angela Ibarra",
          "Nb_Reviews": 3,
          "Date": "2023-06-16T20:00:49.000Z",
          "Titre": "I paid for peace of mind insurance at a…",
          "Contenu": "I paid for peace of mind insurance at a rate of$12/day and when I got to my destinatiopn I was forced to sign a document saying that I was waiving insurance and was completely responsible for any damage to the car as the insurance on rentcars.com is not valid to them. Also a hold of $2,500 was placed on my credit card. To this date I have not been able to get in contact with anybody through their website as it seems impossible. Very bad service and deceptive."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Rogerio Dart",
          "Nb_Reviews": 2,
          "Date": "2023-09-02T01:08:57.000Z",
          "Titre": "POOR HELP",
          "Contenu": "The attendee told me he could not inform the rental company about my delayed flight. The reservation was cancelled as NO SHOW. Although the rental company representative had told me that the amount already paid to RentCars should be refunded, up to now I have received no indication that it will happen.I visited the rental company again and another representative advised me to insist on this matter with RentCars as \"they might want to keep the money\".The WhatsApp communication did not help much."
        },
        {
          "Note": 1,
          "Lieu": "DK",
          "Pseudo": "Jonas Ankersen",
          "Nb_Reviews": 2,
          "Date": "2023-06-01T08:17:27.000Z",
          "Titre": "Charged another 200 euros",
          "Contenu": "The car company charged another 200 euros after the car was handed over, promising to send an invoice, but I never received it despite writing to them countless times. Therefore, I cannot get it covered by my own insurance."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Clyde Fowler",
          "Nb_Reviews": 2,
          "Date": "2023-06-21T12:19:54.000Z",
          "Titre": "Tried three different cards from United…",
          "Contenu": "Tried three different cards from United States (MasterCard, Visa, Discover), and one from Brazil, all rejected. Finally had to ask a friend to use his PIX to pay for rental."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ansuette Serrano",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T06:51:32.000Z",
          "Titre": "I had the worst experience",
          "Contenu": "I had the worst experience. I was traveling with my family and the car never arrived at the airport. The office was closed and nobody was able to solve the problem. So we paid a taxi to drive us tonthe hotel. Next morning I went to pick up the car at downtown office where I had to pay another 68 dlls. I Will never recommend this site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lemoyne Anderson",
          "Nb_Reviews": 2,
          "Date": "2023-04-13T19:59:01.000Z",
          "Titre": "WARNING! WARNING!! WARNING!!!",
          "Contenu": "WARNING ! WARNING ! !  WARNING ! ! !As I stated before this car rental place is the WORSE!!! DON'T DO IT!!! This is my 2nd NEGATIVE REVIEW.  REASON... 1. DECEPTIVE 2. OVERCHARGED 3. NOT UP FRONT W/PRICING 4. BAD BUSINESS PRACTICES I wish I could hv.left 0 stars..."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "A. M.",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T01:08:55.000Z",
          "Titre": "Car  in bad mechanical conditions",
          "Contenu": "The suv showed “oil engine check required”, the breaks make big noise, the service tag shown service required 5,000 km ago,  so we were forced to return the unit and change and they gave us a very bad service when changing it.  I would not rent a car with Europcar again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Maria F Alvarez",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T22:08:51.000Z",
          "Titre": "S C A M",
          "Contenu": "S C A M IS A BIG NONO I can give this creepy company minus 10 starts, they got it -**********. Nobody to pick us after being waiting as the instructions said. The drivers of other companies were very helpful but no one know this company, there was no information online about the company (yes! My mistake). No phone number in the States, they have a phone number we found with area code +55 which is Brazil, they didn’t pick up. Don’t waste your precious time and money. Will be reported to consumers affairs so can’t do business anymore."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Michal Walczak",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T14:55:12.000Z",
          "Titre": "Hidden costs",
          "Contenu": "Prior booking no deposit charge provided. On arrival asked to pay 1700€ for deposit for 3 days which is ridiculous! Given option to pay less deposit but topped up with 20€ a day additional charge for \"insurance\" This is simply fraud!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RobertD",
          "Nb_Reviews": 3,
          "Date": "2023-08-04T22:32:54.000Z",
          "Titre": "One missed step after another",
          "Contenu": "I had a change of flights. It shortened my trip by one day. When I asked if the car I reserved could be held for one, I didn't ask for money back, same drop off time, they said no.I was contacted by a customer service rep from Rentcars who offered to cancel the reservation at a cost. I said \"yes please\" 1 hour after the reps email was delivered to my account.It is now three days later. I never heard back from the rep but I have been charged the full cost.Obviously, not feeling real happy about this series of interactions."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "RAF",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T20:26:50.000Z",
          "Titre": "Medium service",
          "Contenu": "Medium service, deposit taken on the credit card was cashed down instead of retained. After 6 weeks upon the car was return, still waiting to get my money back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anthony Williams",
          "Nb_Reviews": 1,
          "Date": "2023-05-08T15:17:22.000Z",
          "Titre": "There were no cars available",
          "Contenu": "There were no cars available. I had to cancel at the rental place but I can’t get in touch with anyone at Rentcars to get a refund. I took a picture of the receipt showing that the rental company (Dollar) issued a refund but how do I send it to you guys so that I can get my refund back from you."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JW",
          "Nb_Reviews": 2,
          "Date": "2022-12-28T19:09:13.000Z",
          "Titre": "Avoid",
          "Contenu": "Website was slow and awful.None of my cards would be accepted. Still haven't heard back from the customer service email address and gave up on the phoneline after 20 minutes on hold. Would recommend anyone to avoid this company."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Al Sadeghi",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T01:47:01.000Z",
          "Titre": "I am sorry to say I can not change or…",
          "Contenu": "I am sorry to say I canceled my car rental reservation but did not get the full amount I paid to rentcars company, although I rebooked another reservation later on!If you get my message, someone can call me to discuss it at 1-416-358-3147"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "josh conley",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T04:26:07.000Z",
          "Titre": "Don’t rent from them",
          "Contenu": "Don’t rent from them. Lied about rental company being at the airport and it was off site, failed to provide insurance info. If you do make sure your insurance carrier is recognized by the site. I have travelers insurance, which I found out wasn’t accepted when picking my car up from Priceless in Tampa, Fl. As soon as we checked in, Priceless offered a refund, but they know all other places are out of cars and the guy at the counter said it happens all the time because it’s not clear and that’s why they (Priceless) is quick to offer a refund. Príceless was great, but Rent Cars is terrible. Long story short I paid more for an off airport rental car than I would have renting at the airport. Original price $210, statement stated nothing due at pickup. Insurance was $25 a day and I had to buy it or not get the car."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Dave",
          "Nb_Reviews": 4,
          "Date": "2023-03-20T10:44:12.000Z",
          "Titre": "Booked car for Limoges Airport- only to…",
          "Contenu": "Booked car for Limoges Airport- only to be told I had had to goto Limoges City centre on arrival at airport. 60 euro return journey. Email confirmation states Limoges Airport pick up. Will not use Rent cars again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ahmed Tahoun",
          "Nb_Reviews": 3,
          "Date": "2023-04-30T21:20:21.000Z",
          "Titre": "Horrible experience. A rip off.",
          "Contenu": "Horrible experience.A rip off1. No counter l, just a booth to talk to screen, with someone on the other's identity. Lines keeps breaking.2. Booking made with AMEX.They charged AMEX But when I went to pick up the car, the lady said, they don't use AMEX and she is doing exception to use AMEX.3. They did not accept my AMEX insurance, neither my Progressive insurance4. Charging $100+ for 4 days rent more and above the advertised rental rate.5. They seem wither making money without renting cars from penalties or putting people at a corner when you are coming from travel and have no time to waste.In my case, I had few hours extra, I requested cancellation, and booked another provider through EconomyBookings.comIt is a rip off"
        },
        {
          "Note": 1,
          "Lieu": "CO",
          "Pseudo": "Diego Machado",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T14:54:50.000Z",
          "Titre": "The worst Renta Car service in…",
          "Contenu": "The worst Renta Car service in Colombia, Rentcars and Ready Rent Car doesn't have post sale costumer service, be careful never use your credit card because you can lose your money, Ready Rent Car don't meet the hourly."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Rod Lau",
          "Nb_Reviews": 1,
          "Date": "2023-04-25T20:36:57.000Z",
          "Titre": "I was charged twice for a one day rental…",
          "Contenu": "I was charged twice for a one day rental on my credit card. When I called to inquire about the charge, my call was dropped numerous times, no one was able to explain the extra charge, I was told to call my financial institution."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Ian Willett",
          "Nb_Reviews": 1,
          "Date": "2023-01-25T19:31:23.000Z",
          "Titre": "Rentcars",
          "Contenu": "The company Rentcars hired to provide our rental vehicle (American) were terrible to deal with.They wanted to charge an extra $30 US a day for insurance and $5000 US deposit on my Visa,despite the paperwork from Rentcars stating that this was not necessary.We argued for about an hour, and eventually left without a vehicle. Because this was on a Sunday and no one was available to help us, we had no choice but to make our way back to the airport to rent another vehicle from another car hire company. When we complained to the Rentcars representatives they were very helpful and are refunding our deposit, but at the time it was very stressful.Rentcars should no longer deal with American car hire."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Alicia Ferrari",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T23:26:12.000Z",
          "Titre": "The booking process was never completed…",
          "Contenu": "The booking process was never completed by their system and they did not inform any further on steps to follow or how to contact the actual agency who is delivering the service. Not recommending this site to anyone."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sardar sohail  Khan",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T10:43:42.000Z",
          "Titre": "..VERY RUDE STAFF ..The staff at the place where we pick up…",
          "Contenu": "The staff at the place where we pick up our car is very rude .. I would say very very rude ..no customer service at all .I was forced to buy the extra insurance (I already bought an insurance but was told that was fake or not effective. A good way of conning people and charging them when they are left with no choice).and when I saud I will complain she said (young Asian lady ..looked like a bangali or indian not sure of her ethnicity but definitely not italian..she laughed and said complain to who .. ha ha ha ..go and complain now as if I care ... I think that attitude for a customer who is paying you lot of money for a good service... 100% DO NOT RECOMMEND THIS COMPANY TO ANYONE  ..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Saad Khan",
          "Nb_Reviews": 2,
          "Date": "2023-05-06T16:20:42.000Z",
          "Titre": "Rip off company! I wish I could give -1 star",
          "Contenu": "I wish I could give -1 star. Worst experience. Total Rip off company for following reasons:1. Hidden fees - the total cost during online checkout is different than the actual one due to many hidden fees. Eventually, its same/more expensive than other regular rental cars (Avis, Hertz).2. Manipulative - I booked an SUV but they manipulated me to agree for a small sedan car with my family/kids. When I argued, then they were like oh! this is the only car available to us currently (I did get an SUV later after much fight).3. They add many additional small charges for small things. Be ready to pay extra for vacuum cleaning, exorbitant amount for gas etc. 4. The rental car unit is 12 mins away from all airports and shuttle only comes every 30 mins. So long wait time. 5. Poor customer service. When we argued with the salesperson about our dispute and asked for manager, we were informed that manager is busy and cannot attend to our complaints. Bottom line - save yourself some money and hassle and do not go for this car rental company. Its only purpose is to rip off people."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Hagen Muench",
          "Nb_Reviews": 2,
          "Date": "2023-02-25T14:50:30.000Z",
          "Titre": "Terrible service, not reliable company",
          "Contenu": "When arrived at the airport at 11:00PM with small kid, the prepaid reserved car was not available and there was no replacement. The chat robot on whatsapp was annoying. After we could chat with a real person, they blamed us that we did not pick up the car before10:00AM, though we have informed about our flight arrival time and we asked in advanced whether this is a problem. They had told us there is no problem since there is a 24h service at the airport. But they didn't inform the car rental company. Furthermore, the most flights arrive after 10AM, so how can anybody be sure to get a car? We had a lot of trouble and pain until we could get a overpriced  replacement  car at about 03:00AM next day from another car rental company. rentcars has not refunded our payment despite several requests and of course denies any compensation for the additional costs we had due to their mistakes."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DCP",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T22:39:33.000Z",
          "Titre": "Pay Now buy How",
          "Contenu": "It said on the website to Pay Now but I could not with any of my cards  There was no one to help with this problem and we emailed and got no replys Because of this I will be paying about $60 at the counter."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Houda D.",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T20:36:14.000Z",
          "Titre": "Dishonest / Loss of time and money",
          "Contenu": "Very bad experience! Based on the other reviews, it is clear that this business is repeatedly using the same fraudulent technics to PURPOSEFULLY fool and scam its customers. I booked unlimited mileage and it was confirmed on the bill. When I went to pick up the car, they told me: 300 km/day maximum for Ontario and Quebec licensed drivers (information they hid with lots of care). Another lie: the famous Ottawa airport pick up! Not to mention the unreasonable amount asked for the credit card. Another customer was in the exact same situation as me. We both cancelled our reservation on the spot because it clearly had a scammy flavour. The whole experience was very upsetting and uncomfortable. Employees are unprofessional and useless perhaps because they are busy milking people's money. Not going back there FOR SURE. Stay away / stay safe folks! I am waiting for my reimbursement and please don't send your useless automatic message that you are sorry and that we need to contact your so called customer service."
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Ana Maria Sánchez Pérez",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T20:19:18.000Z",
          "Titre": "I came to the airport to pick up the…",
          "Contenu": "I came to the airport to pick up the rented car, and the person in the counter person din´t respect the contract, They wanted me to pay 3 times more than the agreed amount for the deposit.I´ll never recommend you."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Alejandro Tobón",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T04:42:01.000Z",
          "Titre": "You cannot cancel!!",
          "Contenu": "They don't let you cancel!! They say there's a lot of options to do it but that's a lie!! Neither by phone nor webpage, nor reservation page, nothing! In the support it appears to be a \"Cancel\" button but is not there! There's no options to cancel, they only want to charge the no-show fee!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Joanne Le Prevost le prevost",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T20:22:38.000Z",
          "Titre": "The amount that I paid was not the…",
          "Contenu": "The amount that I paid was not the amount that was applied to my car rental bill, thus costing me more than was expected!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ERIC Schnedecker",
          "Nb_Reviews": 1,
          "Date": "2023-05-21T20:03:07.000Z",
          "Titre": "This is very dishonest and will dispute…",
          "Contenu": "This is very dishonest and will dispute with Amex. I need tocancel the reservation because the offer was hiding costs and there’s no way to join you. I will use this as proof of communication with your company."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Adam",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T17:39:35.000Z",
          "Titre": "When I went to pick up my car I was…",
          "Contenu": "When I went to pick up my car I was told that international travelers could not rent cars in Brazil even though I had my driving license e and passport. I went to a different company and they have me a car in 20 mins"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Rene",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T22:02:15.000Z",
          "Titre": "You guys are a f@#cking joke !",
          "Contenu": "You guys are a f#cking joke !! not only you can not get a car advertised in your website (approval in progress for 6 hours ?!!!), you also have a terrible client service !NOT RECOMMENDED ... SCAM !"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "DAngelo nascimento",
          "Nb_Reviews": 2,
          "Date": "2023-06-10T04:21:58.000Z",
          "Titre": "I wouldn’t ever use them again",
          "Contenu": "I wouldn’t ever use them again, my plane was later by 2 hours and when I arrived to collect the car a have arrange to rend and payed in full, the company told me that I had to pay a extra £1044 to have another car. Keep away"
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "ANDREW BAGE BAGE",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T13:16:47.000Z",
          "Titre": "Poor communication",
          "Contenu": "As per previous evaluation. Not all information was supplied."
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Sihome Thodire",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T18:00:14.000Z",
          "Titre": "Better to go straight to the privider",
          "Contenu": "The car rental company was happy to let me return the car 2h late if rentcars modified the reservation. Rentcars refused to do so because their policy is to not make any amendments after picking up the car. Because rentcars did not want to change the reservation we had to pay 24 full hours extra hours for the 2h delay. That taking in account that the car company was happy to do it for free. I'll never use this service again. I'll go straight to the car provider"
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Drew",
          "Nb_Reviews": 7,
          "Date": "2023-08-29T20:45:54.000Z",
          "Titre": "Beware - They Don't Include US Taxes",
          "Contenu": "Beware - they do not include taxes in the total you pay for US rental, as other search sites do. So when you collect the car you will need to pay quite a significant sum on top of what they have quoted you. In my case $110 of tax above the $522 already paid for the reservation. Factor this in when comparing pricing. My reservation stated I had paid in full and had to pay $0 on collection, but this was not the case."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "M. Agar",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T11:33:39.000Z",
          "Titre": "Feeling anxious!",
          "Contenu": "The booking process went smoothly -- but I am anxious about paying up front  and then reading that there's no fee for amendments, no fee for cancellations and then also reading 5% fee for cancellations and 100% fee for prepay cancellations. Which is it? I rented from Europcar through you -- but when I tried to compare prices to rent directly from Europcar, their site repeatedly says no vehicles available for those dates. Your site says no border crossing is allowed without permission. Where can I get permission to cross into the US from Canada? When I am standing at the rental counter? That's too late, isn't it? My spouse will also need to drive the vehicle, but the cost is not available on the site. Anxiety is rising!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "llooyd",
          "Nb_Reviews": 2,
          "Date": "2023-02-28T17:19:47.000Z",
          "Titre": "Website and support is utter rubbish",
          "Contenu": "Tried booking online but was unable. The website repeatedly white-screened/crashed during payment. Tried contacting but they have no support desk, so tried the chatbot and it just says someone will be in touch. Who!! support is unmanned!Website is also missing critical information for renting cars, so now have to contact the actual hire company.Much room for improvement, would not use/recommend again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-01-06T03:50:24.000Z",
          "Titre": "It could’ve been better",
          "Contenu": "The pickup and communication was great. The car worked well and was as expected. Drop off went fine. The aftermath of my rental is what I am not happy with. I gave a $150 hold for toll roads & such, I was told I’d get the refund from what money wasn’t used within 5-15 days, it has now been almost two months & I have contacted the company numerous times without resolve. I am really bummed. If they would’ve refunded my money as promised, I would give 5 stars. No refund, no receipt showing my toll roads etc. I feel like they stole from me. Such a bummer. :("
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Laura",
          "Nb_Reviews": 6,
          "Date": "2023-04-01T14:43:20.000Z",
          "Titre": "Rentcars & Centauro are both terrible",
          "Contenu": "I rented a car in Italy booking through Rentcars.com and using Centauro car hire company - terrible experience. Firstly, when picking up the car, Centauro told us they only accept specific credit cards and that we were meant to be informed about this on our booking voucher. However, the voucher we received from Rentcars.com did not include any information about this. We had to pay extra to add an additional driver and use another card!Secondly, the pick up description on the voucher was completely different from the real shuttle pick up location, making us walk back an forth with heavy luggage an calling Centauro several times. When trying to find a way to give feedback to Rentcars.com, their website obviously only includes an automated chat and no other contact opportunities.Will not be using again!"
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-04-02T01:23:14.000Z",
          "Titre": "When I made the reservation they offer…",
          "Contenu": "When I made the reservation they offer the insurance of coalición I paid 72 dollars and they didn’t offer liability , now in the counter they tell me I have to paid 14.95 for each day plus they told me I have to pay fue liability 25 fir a day !!Si what it was a regreso fir 20.55 now is more than 250 wich is"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Glenn Mudd",
          "Nb_Reviews": 4,
          "Date": "2022-12-17T23:17:49.000Z",
          "Titre": "One switch rental stay away !",
          "Contenu": "Made reservation with a company-one switch that ended up having no positive reviews and was a scam that ripped people off so I ended up cancelling with these instead …."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jorge Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T21:30:09.000Z",
          "Titre": "The rental place don’t have cars…",
          "Contenu": "The rental place don’t have cars avalable at the time of pick up a nigtmare for me my wecken was screwup"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "MARIA FERNANDA KARINA ROLDAN B",
          "Nb_Reviews": 1,
          "Date": "2023-08-01T06:26:39.000Z",
          "Titre": "I could not get the proper invoice",
          "Contenu": "I could not get the proper invoice. I requested the invoice with the necessary information and the do no do that"
        },
        {
          "Note": 2,
          "Lieu": "BR",
          "Pseudo": "Marcos Vargas",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T14:02:37.000Z",
          "Titre": "I can’t access my wallet and can’t…",
          "Contenu": "I can’t access my wallet and can’t access my booking in the app"
        },
        {
          "Note": 2,
          "Lieu": "CR",
          "Pseudo": "RC",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T08:40:18.000Z",
          "Titre": "No customer service",
          "Contenu": "I know your customer service. It's really bad. I can't recommend your services cause last time it was literally the worst in the world."
        },
        {
          "Note": 2,
          "Lieu": "PE",
          "Pseudo": "jorge tuma",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T20:25:41.000Z",
          "Titre": "2 hours waiting in the front desk",
          "Contenu": "2 hours waiting in the front deskBudget."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Raquel Mcnerlin",
          "Nb_Reviews": 2,
          "Date": "2023-05-29T17:05:20.000Z",
          "Titre": "I booked a car and received the…",
          "Contenu": "I booked a car and received the confirmation email. 30 minutes later I received an email canceling my reservation."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "cesar omar pantoja aguirre",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T19:04:52.000Z",
          "Titre": "Then rent company tell me tjat I need…",
          "Contenu": "The rent company tell me tjat I need too pay the insurance again because your not work"
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Rene Lemoine",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T20:14:22.000Z",
          "Titre": "Reservation was not confirmed by…",
          "Contenu": "Reservation was not confirmed by Budget. I am traveling tomorrow, 24 hrs confirmation is longer than I expected."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Dr Stuart Hutchison",
          "Nb_Reviews": 15,
          "Date": "2022-12-17T03:38:52.000Z",
          "Titre": "Poor software",
          "Contenu": "I tried to hire a car and my bank confirmed the payment but Rentcars website said I still needed to pay? Again!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris Bodker Bodker",
          "Nb_Reviews": 3,
          "Date": "2023-01-11T15:03:55.000Z",
          "Titre": "vey hard to pay",
          "Contenu": "vey hard to pay - tried twice, still not sure if my fee was taken a total of three times!"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "TANIA RODRIGUEZ",
          "Nb_Reviews": 1,
          "Date": "2023-08-19T18:31:45.000Z",
          "Titre": "I asked for my invoice and I had no…",
          "Contenu": "I asked for my invoice and I had no aswer"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Chris Strike",
          "Nb_Reviews": 3,
          "Date": "2022-10-22T21:57:17.000Z",
          "Titre": "Very poor despite booking completing…",
          "Contenu": "Very poor despite booking completing all forms providing evidence and paying You failed to tell me which agent to pick the car up from at Val de Cans Airport Belem Brazil. after eventually finding the agent by trial and error, they had the booking but we had to go through the whole process again for nearly an hour then the agent wanting paying until I pointed out for the third time the payment having been made conceded the booking, the system them froze for 20mins she then wanted a R$1500 deposit The Agent could only speak Portuguese if my wife had not been with me we would probably still be there. Utter farce and to top it off the car has a puncture. Come on Car Rent get your act together By the way no way to reach customer service other than a call which goes the Agent who does not speak anything other than Portuguese"
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "AARON BURCHAEL",
          "Nb_Reviews": 6,
          "Date": "2022-10-09T13:50:30.000Z",
          "Titre": "after spending 25 mins twice booking a…",
          "Contenu": "after spending 25 mins twice booking a car we entered all our bank details and were transferred to a page with ERROR twice so we did not book a car through this company"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luciano Filizzola",
          "Nb_Reviews": 1,
          "Date": "2022-10-02T02:12:23.000Z",
          "Titre": "Went thru all the booking information…",
          "Contenu": "Went thru all the booking information and when it came to payment they were unable to process the payment and wouldn’t say why. Nothing wrong with my credit card. Very disappointing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adam Kay",
          "Nb_Reviews": 2,
          "Date": "2022-10-03T00:27:48.000Z",
          "Titre": "needed to add a couple hours to pickup…",
          "Contenu": "needed to add a couple hours to pickup its been a little difficult. Ive had a hard time seeing just what company I'm looking for at the airport. nextcar/rentcart ??"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Noe Morales",
          "Nb_Reviews": 2,
          "Date": "2022-09-20T06:07:31.000Z",
          "Titre": "the rental experience is good",
          "Contenu": "the rental experience is good, the big problem is when you get to the counter since they do not want to respect the price and they put many obstacles to rent through Rentcars"
        },
        {
          "Note": 2,
          "Lieu": "BE",
          "Pseudo": "Wim Le Compte",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T13:57:23.000Z",
          "Titre": "Mandatory all-in insurance was not mentioned in advance",
          "Contenu": "Having booked a car via Rentcars almost everything went well, we where well informed and the car was ready at the rental company but...The car we had asked for was not the one they had prepared for us. The papers indeed indicated \"or similar\". \"Similar\" is a subjective statement. The car we got was smaller and no 4x4 (what we needed to go into the mountains). They stated that they did not even have the car we had asked for. Why did Rentcars not told this in advance? The rental company made us pay for an all-in insurance which was mandatory for this kind of car. This almost doubled the initial price stated by Rentcars. Why where we not informed before we decided to book the car? This would have made us change our booking. On the spot it was to late to change. It's a said happening to start your holidays like this!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "david arredondo arredondo",
          "Nb_Reviews": 1,
          "Date": "2023-08-20T20:34:21.000Z",
          "Titre": "No neber rent not good company",
          "Contenu": "No neber rent"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sylvia Sumpter",
          "Nb_Reviews": 3,
          "Date": "2022-09-28T07:53:24.000Z",
          "Titre": "Good",
          "Contenu": "My previous experiences with plumbers wasn’t good but this company were quick to come out and fixed the problem within an hour."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sharon Clark Myers",
          "Nb_Reviews": 2,
          "Date": "2021-05-17T13:26:46.000Z",
          "Titre": "I am very angry",
          "Contenu": "I am very angry,  I rented a car with you through dollor and when I picked up the car expecting to pay only the state tax they also charged me for insu6that I stated I did not want, I feel like I was tricked because they were very dishonest by charging Me this fee when I told them that I did not want it. I really would like these charges reversed from my credit card, I am very disappointed with dollor for doing this."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel",
          "Nb_Reviews": 4,
          "Date": "2022-08-22T01:53:00.000Z",
          "Titre": "Uncertainties Abound",
          "Contenu": "The fact that there was no rent-a-car company mentioned by name or pickup and return information that gave me any confidence, I decided to cancel the rental."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Leslee Gold",
          "Nb_Reviews": 4,
          "Date": "2021-12-25T18:39:23.000Z",
          "Titre": "They lied",
          "Contenu": "Renting was easy except that they didn't accept our Collision Damage Waiver and Theft protection insurance provided by our credit card. Apparently, Israel is one of 4 countries in the world that requires a special letter.  The manager asked us to fax a confirmation on the credit card letter head within 2 days of returning the car to avoid being charged for insurance. We did exactly as asked. We have complied with the requirements and have been fighting ever since, but Hertz has charged us making our car renal $348.00 + $470-  double what it should have been. Poor customer service."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "AM",
          "Nb_Reviews": 4,
          "Date": "2020-03-24T18:38:10.000Z",
          "Titre": "Cancellation issue",
          "Contenu": "Hi there,I am writing through a way of review. I made booking in April and have to cancel is as due to Covid-19, where I can't travel anywhere! I didn't receive any confirmation from Rentcars. Also I paid full rental for the car that has not refunded. I tried calling Brazil phone number and can't get through as #I don't understand language. Please contact me as soon as possible.Thank you"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Derold",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T20:26:29.000Z",
          "Titre": "Set up rental for a car a month ago, no confirmation, and need to change the date by one day but do not have the option.",
          "Contenu": "We booked our rental about a month ago. The status is still \"approval in progress\". I believe this may have something to do with why we do not have the option to adjust our 2 week trip by one day. There is no phone number to reach out to and my wife tried to send an email a couple weeks ago with no reply. When we called Hertz, they stated we need to work with the booking company. We are unsure of how to proceed and we are getting closer to our trip date. Frustrating!"
        },
        {
          "Note": 2,
          "Lieu": "EC",
          "Pseudo": "Dalis Garzon",
          "Nb_Reviews": 1,
          "Date": "2022-10-11T19:50:48.000Z",
          "Titre": "I don´t know the name of the rental…",
          "Contenu": "I don´t know the name of the rental company, reason why I didn´t finish the reservation."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Andy Gardner",
          "Nb_Reviews": 2,
          "Date": "2022-12-05T19:20:09.000Z",
          "Titre": "Payment not accepted",
          "Contenu": "Payment not accepted, no meaningful error message given"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael Bell",
          "Nb_Reviews": 1,
          "Date": "2022-07-17T16:12:44.000Z",
          "Titre": "Diffucul getting times right",
          "Contenu": "It was difficult getting times right. Some how the app would not take the right times. Time should be whatever time zone the rental begins. Pain in the rear"
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Alvaro (8P-MSD)",
          "Nb_Reviews": 2,
          "Date": "2022-11-14T03:09:05.000Z",
          "Titre": "Try to pay on line",
          "Contenu": "Try to pay on line, it was impossible"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gary K",
          "Nb_Reviews": 1,
          "Date": "2021-11-11T12:21:42.000Z",
          "Titre": "Horrible  bad service- dirty car",
          "Contenu": "Car was never cleaned - handed to us dirty!Was not the car they advertised, said it was “comparable”. The Fiat was not compatible to the Peugeot with my opinion by far!Not friendly! Was told the tire pressure was low as we started to drive off. Suppose we had to fix that ourselves!  Then we took it to gas station and guess what! Yes screw in the tire - we had pay fix it!  O’course they didn’t refund us our money at return.  Returned call to grumpy man that stated that it was 6:56 AM and we needed to wait Til 7AM til when he opened to return the car. Did not refund our deposit - had to call back 3 weeks later and again not friendly! To beg to return our 150 € Won’t be back!!"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Pat",
          "Nb_Reviews": 5,
          "Date": "2020-12-19T16:50:46.000Z",
          "Titre": "I always rent a car whenever I travel…",
          "Contenu": "I always rent a car whenever I travel for safety and convenience. I booked 1 month before and I thought that was all I am going to pay but sadly they have hidden charges when you are about to use the car, a sudden additional increase that I need to pay."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ben Dagnall",
          "Nb_Reviews": 4,
          "Date": "2020-08-26T17:20:58.000Z",
          "Titre": "A cunning ploy",
          "Contenu": "Ill try to be as honest and fair regarding this company as i can, and will change the review if circumstances change, however at present i am in dispute with rentcars and their partner for charges not explained beforehand and the lack of communication between them. Maybe they are aware of their bad practices, however i give them ample opportunity to prove me wrong. The reason i give two stars is because at least upto now their communication has been good even under such bad circumstances. Please prove me wrong about your company and refund the charges not explained on my rental voucher!"
        },
        {
          "Note": 2,
          "Lieu": "UA",
          "Pseudo": "viktoria",
          "Nb_Reviews": 2,
          "Date": "2018-11-22T14:49:48.000Z",
          "Titre": "Poor service",
          "Contenu": "Warsaw airport, at the counter I  was informed that they have no car to rent. I was shocked. The rent was paid .They didn't  even offer me another option. I had to address another place and pay again. I waste my time trying to get a refund for poor customer service. Shame...."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Rui Qi",
          "Nb_Reviews": 5,
          "Date": "2020-11-20T20:24:35.000Z",
          "Titre": "No car available after booking",
          "Contenu": "When I arrived the rental company didn't have a car for me, not even soon. It's impossible to contact Rentcars for them to give a solution, I send an email hoping they answer. I put 2 stars because I know it is not entirely their fault."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ian Woolnough",
          "Nb_Reviews": 2,
          "Date": "2022-10-04T10:00:24.000Z",
          "Titre": "Finding a car was great but real…",
          "Contenu": "Finding a car was great but real problems with paying as kept failing to work for credit cards"
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Rafael Herrerias",
          "Nb_Reviews": 2,
          "Date": "2021-03-02T05:38:59.000Z",
          "Titre": "When I was in the rental company…",
          "Contenu": "When I was in the rental company (AMERICA RENT CAR ) they wanted to charge me 300 USD for liability insurance, which was already included in the price paid previously.I did not accept it"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Brian Hoskin",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T14:31:21.000Z",
          "Titre": "You get what you pay for",
          "Contenu": "You get what you pay for!  They were the cheapest, but the process was so challenging that I almost cancelled at the counter.My instructions after booking said to bring Proof of Insurance, so I brought my State Farm Insurance ID card, but upon arrival they \"Also Needed\" a Dec page showing the Collision coverages and Deductible or you had to pay Their daily insurance charge. Luckily I was able to log in to my insurance comp website via my cell phone and pull up the entire policy, I had a $1,000 Deductible so they were going to charge more $$ to cover the Deductible OR instead of the normal $500 they automatically charge your card, refundable when returned undamaged, they would charge my card $1,000.  So I chose the $1,000 option with no extra insurance payment from them.  The couple next to me, I felt so aweful for. They booked their rental using and AMEX card without issue, but then there at the counter, they also had to pay the refundable deposit but they told them they don't accept AMEX and they didn't have another card.  Not sure what happened to them.The lady at the counter was very rude when I was trying to explain what the Routes website said to bring and how it differed now at the counter. She pulled out a booklet and said you can read this, it is in the fine print. I said that those rules are different than the rules I was given when booking.  She walked away, muttering something in Spanish, leaving my Credit Card & Drivers license sitting on the desk.This is an off site car rental company - the instructions on how to get to the Shuttle are long and challenging. Be prepared to stop multiple times on your \"Journey\" to find where you actually need to get to.  My opinion, use another company."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Andrew Webb",
          "Nb_Reviews": 4,
          "Date": "2023-02-01T20:32:56.000Z",
          "Titre": "The \"My Bookings\" page doesn't contain…",
          "Contenu": "The \"My Bookings\" page doesn't contain all my bookings. The process is also quite confusing - I went through the entire payment before finding out the car isn't necessarily available."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Elaine Morrison",
          "Nb_Reviews": 2,
          "Date": "2020-04-23T18:41:26.000Z",
          "Titre": "Thank you.",
          "Contenu": "UPDATE:  I did receive a full refund.  I appreciate the information received  to contact the company.  Thank yoi, I will rent a car without hesitation when I next travel. Thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Bobbi",
          "Nb_Reviews": 1,
          "Date": "2020-02-19T02:39:52.000Z",
          "Titre": "This site is not very user friendly",
          "Contenu": "This site is not very user friendly. I cannot get the confirmation to pull up and why do I need a passport in Florida? And it will not let me reply yo email."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Bridget Mooketsi",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T21:24:25.000Z",
          "Titre": "I couldn't be transferred to an advisor…",
          "Contenu": "I couldn't be transferred to an advisor because there was no one... The personal who tried to transfer me couldn't answer me"
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Juan Botero",
          "Nb_Reviews": 2,
          "Date": "2022-07-15T16:24:13.000Z",
          "Titre": "when I went to pay",
          "Contenu": "when I went to pay, the rate was different from the one stated on the page. I decided to cancel."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Lorrie",
          "Nb_Reviews": 1,
          "Date": "2020-01-15T15:07:48.000Z",
          "Titre": "The app was very hard to get into and…",
          "Contenu": "The app was very hard to get into and use after setting up an online account. Emails I have received are not in English for the most part."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2022-10-28T16:21:11.000Z",
          "Titre": "You didn’t complete my transaction."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Matthew",
          "Nb_Reviews": 8,
          "Date": "2022-08-16T03:03:24.000Z",
          "Titre": "Avoid. Poor customer service, insurance not integrated with agencies",
          "Contenu": "I will personally avoid this company in future and go direct instead due to the difficulties in reaching customer service and the way their insurance is organised.If there is a problem, Customer service is mostly automated through bots. It is very difficult to actually talk to a person. To give you an idea of how difficult it was to talk to someone, we tired the WhatsApp number to contact them at 9:38. We eventually received a response at 12:32. Almost 3 hours later.As an overview of what happened, We paid for total insurance, but they didn’t communicate this to the rental agency as the insurance is separate. So to the local agency we only had basic insurance, so if there was a problem, we would be charged by the rental agency then have to claim with Rentcars.com.  After taking a ridiculous amount of time to talk with someone to understand how the insurance worked, we decided that given the difficulty in talking to them, we didn’t want to risk dealing through them, so wanted to cancel, which turned out more difficult than we expected.  We eventually managed to resolve this over the phone, but they initially only cancelled the extra insurance and required another call to get the car refunded.  I have dealt with equivalent aggregate car rental companies in Europe and Australasia, where the rental and insurance is all integrated and it was always reasonably able to be reached if needed. CarRentals.com needs to evolve to be competitive."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Daniel T",
          "Nb_Reviews": 9,
          "Date": "2022-09-06T09:28:29.000Z",
          "Titre": "Website is really bad",
          "Contenu": "Website is really bad . Couldn’t even finish the payment process.."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Bianchi Thomas",
          "Nb_Reviews": 2,
          "Date": "2020-02-03T22:51:18.000Z",
          "Titre": "Impossible to contact support",
          "Contenu": "I booked a car for 4 days in December but when I got to the EuropCar agency they told me I couldn't get the car because I had (stupidly) forgotten my driver's license.Ok, fine, that one's totally on me.Problem is, the terms & conditions say I can get a partial refund back but there's absolutely no channel on the website where to ask for it!If I click on contact us, it shows only two options:- FAQ- A link to the reservation page in case I want to cancel a bookingBut on this page, I have 0 options to modify a booking.I tried contacting them on Twitter but 0 answer also.Can I get a phone number at least? ANYTHING? Please!Edit : Concerning rentcars.com response : as I said previously, there's absolutely nowhere on the website where I can contact you directly.Once again, how do I get in contact with you?Last edit : finally got a partial refund more than 5 weeks later.I cannot rate higher as this was an extremely frustrating experience.Please make your support easier to contact without having to use trustpilot as a contact form."
        },
        {
          "Note": 2,
          "Lieu": "MX",
          "Pseudo": "Lloyd Vandeberg",
          "Nb_Reviews": 3,
          "Date": "2021-07-25T19:05:18.000Z",
          "Titre": "I have requested communication in…",
          "Contenu": "I have requested communication in English because I do no speak Spanish but you sending me things in Spanish."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kenneth Thomas",
          "Nb_Reviews": 2,
          "Date": "2022-08-08T22:04:56.000Z",
          "Titre": "Discrimination",
          "Contenu": "They would not rent to us because my husband is 79.This is shameful."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Mark DesRochers",
          "Nb_Reviews": 3,
          "Date": "2023-12-11T03:34:53.000Z",
          "Titre": "Online process worked well but I need…",
          "Contenu": "Online process worked well but I need to change pickup time of my vehicle & there's nowhere to make those changes. I spoke with Firefly the actual car rental company & they cannot modify rental. Stupid."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ginelle Skerritt",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T19:09:58.000Z",
          "Titre": "very easy to use and gave great…",
          "Contenu": "very easy to use and gave great comparayive information. Ran into problem with rental agrement at the site.  This info was not available online as I was deciding whoch company to choose.  1.  although I had selected additional driver,  it was not o  the agreement and the renter cost is $20/day to add a driver.  2.  This renter, YORK, has very detailed policy requirements regarding insurance coverage - must be comprehensive, must name each driver, must show them the policy where rental car is listed as included on the policy- and not sure who walks around with their entire policy. I had to call home and have the policy sent page by page.  This delayed my by about an hour.  3.  policies about returning the car clean to avoid $300 cleaning charge and 5.  penalty of $50 for driving on a toll road in addition to paying the toll fee and taxes.    The customer service person was great and answered my questions about these policies, but it was all done at the counter, and I would have appreciated the opportunity to consider these additional costs and penalties prior to selecting the rental company."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Ashton Dill",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T06:52:07.000Z",
          "Titre": "CAD issues?",
          "Contenu": "Easy to use. Almost To easy. Great Rates. I did have One huge issue the site told me the prices where in CAD when I got my email it told me it was USD. I'm concerned my credit card won't be enough to hold the Deposit when I get to the Rental Location. Also another big issue is that there should be a small print estimate hold based on vehicle size and rental company. Going in Blind is kind of concerning."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Roberto Barrios",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T03:19:25.000Z",
          "Titre": "Reservation rentcar from Martin Irarrazaval",
          "Contenu": "You didnt send the reservation that done Mr. Martin Irarrazaval. I payd this rentcar from my credit card.Please check it."
        },
        {
          "Note": 3,
          "Lieu": "EG",
          "Pseudo": "adel moussa",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T13:11:08.000Z",
          "Titre": "How to recover the  reservation confirmation",
          "Contenu": "I liked the wide spectrum  of choices.I dislike the way they sent the confirmation ,it came in the spam and I deleted it accidentally   and do not know how to recover it"
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Catherine",
          "Nb_Reviews": 6,
          "Date": "2023-10-15T11:10:29.000Z",
          "Titre": "Good price but poor communication",
          "Contenu": "Good price but odd set up, they work through many different companies and do not actually send you the terms and conditions of who you have booked with e.g. actual deposit amount"
        },
        {
          "Note": 3,
          "Lieu": "PK",
          "Pseudo": "shobi khan",
          "Nb_Reviews": 5,
          "Date": "2023-09-08T09:19:18.000Z",
          "Titre": "Renting a car can be a convenient and…",
          "Contenu": "Renting a car can be a convenient and flexible way to get around, whether you're traveling to a new city, going on a road trip, or need a temporary vehicle for any reason. However, navigating the world of car rentals can be daunting, with various options, prices, and terms to consider. In this guide, we'll provide you with valuable insights and tips to make your car rental experience as smooth as possible"
        },
        {
          "Note": 3,
          "Lieu": "CY",
          "Pseudo": "Marinos",
          "Nb_Reviews": 5,
          "Date": "2023-08-30T10:44:20.000Z",
          "Titre": "There is no direct helpdesk in case you…",
          "Contenu": "There is no direct helpdesk in case you need an assistance r anything else related to your rental.However, its much cheaper than other companies to book and rent a car but the fact that there is not a help desk its very important."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Oduvaldo",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T16:51:32.000Z",
          "Titre": "Product presentations should be honest",
          "Contenu": "Product presentations should be honest. Why is it that when I'm making an online reservation, some fees or services that are shown to me when I pick up the key don't appear?"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Fredo",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T23:02:02.000Z",
          "Titre": "Easy to book but charges in $US",
          "Contenu": "Website was easy to follow. What I didn't like was being charged in US dollars, not my local currency which the price was based on. Expect this increased the cost."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Antonio Rosales",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T07:04:05.000Z",
          "Titre": "Cep is not a code used in chile",
          "Contenu": "Cep is not a code used in chile, we use rut or ci and its imposible to input it i had to search for a cep number and enter the first i found"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Alex Warrington",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T05:16:52.000Z",
          "Titre": "Good prices but misleading on what’s…",
          "Contenu": "Good prices but misleading on what’s included so makes it feel a little untrustworthy when you’re ordering from the UK and hoping you’re not getting sold any extras when you arrive in the US. Last thing you need after an 11 hour flight"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Margaret",
          "Nb_Reviews": 3,
          "Date": "2023-09-14T13:33:00.000Z",
          "Titre": "I was not happy with the website",
          "Contenu": "I was not happy with the website. Would not accept the sign in that was previously used so I had to set up a new account. I put in the wrong time for pick up and was not able to edit it. There was no phone # to call so I called customer service for the rental car company and was told she couldn’t change anything. Very poor customer service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "pauline rudge",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T19:43:05.000Z",
          "Titre": "The number you give me as a booking…",
          "Contenu": "The number you give me as a booking ref. is not the number Avis have given me as a booking ref. sio its impossible to tell if its the same booking. Its confusing and now need to check with them.Inform customers of both ref numbers"
        },
        {
          "Note": 3,
          "Lieu": "SK",
          "Pseudo": "Sandra",
          "Nb_Reviews": 3,
          "Date": "2023-03-21T09:38:33.000Z",
          "Titre": "Reservation was confirmed",
          "Contenu": "Reservation was confirmed, but there is missing lot of information and nobody answers. I understand that Rentcars is just intermediary but anyway I need to know e.g. how much is deposit for this rent when we have insurance from 3rd party and we want just pure rent without other services. Rental company is Midway Rent a Car, therefore at least email contact would be appreciated to avoid any misunderstanding at the rental desk."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas Lee",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T15:08:59.000Z",
          "Titre": "Had trouble with rental booking this…",
          "Contenu": "Had trouble with rental booking this time. It said it was a Netherlands booking and everything I try to view it say it did not go through or is being modified.  Unsure if it is a confirmed booking or not so will try to verify today. First time had a problem with this site."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Pedro",
          "Nb_Reviews": 1,
          "Date": "2023-01-01T17:24:43.000Z",
          "Titre": "Fast sales, poor filter",
          "Contenu": "Fast sales experience, but there many features of the car that you can’t see by using the filter. I have to read all them and select the car manually. Example: type of insurance and if it’s included or not."
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Mario Roberto",
          "Nb_Reviews": 2,
          "Date": "2023-09-09T00:04:02.000Z",
          "Titre": "I cannot access my reservation",
          "Contenu": "I cannot access my reservation. I am in my account and it either says I have no reservations or when I try to open the document, it does not open."
        },
        {
          "Note": 3,
          "Lieu": "BO",
          "Pseudo": "Vivian Reynolds",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T21:29:25.000Z",
          "Titre": "THE PRICES WERE THE BEST BUT PAYMENT SUCKED",
          "Contenu": "THE PRICES WERE THE BEST AND I WAS READY TO RENT FROM YOU BUT I HAD PROBLEMS WITH THE PAYMENT. FOR SOME REASON YOUR SYSTEM WOULD NOT ACCEPT MY CREDIT CARD. I GOT TIRED OF WAITING AND TRYING REPEATEDLY, SO I DECIDED TO PAY A LITTLE MORE BUT WITH LESS HASSLE AND RENTED FROM BOOKING.COM"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "lorraine patterson",
          "Nb_Reviews": 1,
          "Date": "2022-11-26T20:31:25.000Z",
          "Titre": "This was a very difficult reservation",
          "Contenu": "This was a very difficult reservation. I believed having a third party involved made it complicated. When speaking to the online agent and the Rentcars agent on the phone both were not in agreement that I made a payment or had a reservation for a rental car. I went for several hours while on the plane not knowing if I would had a rental car when my flight landed. Thankfully through the grace of God I had a rental car. Not the best. •Could not see gas mileage and barely could see speed limit due to a frosty plastic shield. This became a concern when returning the car not being able to be sure I was returning the car back on a full tank of gas. I’m waiting to get my $150.00 refund and then see if I need to take any further action."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Jonhnatha Trigueiro",
          "Nb_Reviews": 3,
          "Date": "2023-04-22T03:48:30.000Z",
          "Titre": "They didn't had the car I rented",
          "Contenu": "When I came to the Hertz, they said that they haven't the car that I rented available so they will upgrade the car with a lower rate per day. What happens is that I got a premium car, but I will need to pay more than 400 USD for that."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Juan Diego Pedroza Medina",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T15:43:22.000Z",
          "Titre": "Free cancellation",
          "Contenu": "The web did not allow me to make the reservation of the vehicle without generating the payment. They talk about free cancellation but the payment was already made and it looks more complicated, so I don't trust the service they offer."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Zarina Jiwani",
          "Nb_Reviews": 2,
          "Date": "2023-03-14T16:47:06.000Z",
          "Titre": "My confirmation doesn't say the mileage…",
          "Contenu": "My confirmation doesn't say the mileage I have and the type of insurance I am being charged for. My confirmation number is W55PDN5. Please if you can let me know this information"
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Ivan Vivas",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T15:36:33.000Z",
          "Titre": "The company in Colombia works great was…",
          "Contenu": "The company in Colombia works great was a great service. But, in rent carts de values and services had different prices than the real ones in the stores, something to keep in mind"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Fabio Steffens Cardozo",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T15:36:21.000Z",
          "Titre": "Agent of Mediocre",
          "Contenu": "It's a good rental platform, with competitive prices, and really easy to use. The problems are the rentalcover insurance that is useless because no rental company acknowledge it as a valid insurance, and you always have to pay the rental insurance of the rental company or to make a security deposit of thousands of euros (which often is problematic). And another issue is that it's impossible to change something on your reservation, like to extend it, or change the pickup time, or anything else. Another issue is related to the categories shown on the app, which leaves a wide margin to interpretation. For instance: I've made a reservation for a Peugeot 2008 because I needed a big car, but the insurance company gave me a Dacia Sandero instead, claiming they were the same category. The day an SUV is the same category as an economy vehicle it's going to be tragic. It should be clear which cars belong to each category, otherwise it's just plain cheating. I don't know about other platforms, but this is an average service."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Francis Lacasse",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T20:29:19.000Z",
          "Titre": "Good selection but watch out different pricing for same cars",
          "Contenu": "Liked;The choice of vehiclesDislike; but due to the cie logarithm prices go up after a second research and the same car model could be almost 3 times the initial price"
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "Julian Esteban  Giardini",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T23:08:50.000Z",
          "Titre": "It first appears my own country…",
          "Contenu": "It first appears my own country currency in the budget, but then it ends in U.S. dollars and in a final total cost that isn´t aproppiate with my country currency exchange"
        },
        {
          "Note": 3,
          "Lieu": "PA",
          "Pseudo": "Gonzalo Garcia",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T19:09:28.000Z",
          "Titre": "I sent a request to adjust the pick-up…",
          "Contenu": "I sent a request to adjust the pick-up time of the vehicle to my flight that arrives at 4:07pm, instead of the default one that is at 12:00pm, but I did not receive a response and the reservation (ALKHLG4) is still at a pick-up time at 12:00pm"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Katinka Salgado",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T22:11:56.000Z",
          "Titre": "All kinds of insurance or have the option to add them to the quotation . Information is not clear enogh",
          "Contenu": "Is not very clear what you get regarding insurances there is not possibility to add more services and is impossible to get information regarding the deposit or extras"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Verónica Álvarez ll",
          "Nb_Reviews": 2,
          "Date": "2023-04-30T21:08:51.000Z",
          "Titre": "Leave paid for the service using a…",
          "Contenu": "Leave paid for the service using a bonus you had. In the car rental they charged me the entire amount again, even the discounted with a bonus"
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Luis Villarroel",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T07:00:53.000Z",
          "Titre": "My firs trip",
          "Contenu": "For my first trip and first car rental, it's pretty good. I hope I don't have any problem when I arrive at my destination."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel  Schmitt",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T04:46:07.000Z",
          "Titre": "Currency keeps changing by itself.",
          "Contenu": "Currency keeps changing by itself.Value of rentals are too high even in advance"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Zarina Jiwani",
          "Nb_Reviews": 2,
          "Date": "2023-03-09T15:04:17.000Z",
          "Titre": "No the cheapest car rental as it states",
          "Contenu": "The website claims to have the best deal but it was more expensive but other than that all ok"
        },
        {
          "Note": 3,
          "Lieu": "GT",
          "Pseudo": "Mariano Santolino",
          "Nb_Reviews": 3,
          "Date": "2022-11-20T02:43:22.000Z",
          "Titre": "car's insurance it's a pian in the ass",
          "Contenu": "The price's I paid was no the total price, always when you get to the facility you will have to pay more for the car's insurance"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "ARTURO CASTELLANOS",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T17:49:22.000Z",
          "Titre": "GOOD PRICE",
          "Contenu": "GOOD PRICE, BUT SOME PROBLEMS TO PAY BY CREDIT CARD, AND YOU DO NOT ACCEPT AMEX"
        },
        {
          "Note": 3,
          "Lieu": "PT",
          "Pseudo": "Fernando Cunha",
          "Nb_Reviews": 2,
          "Date": "2022-12-06T16:49:58.000Z",
          "Titre": "A rent a car Drivers on Hollidays que…",
          "Contenu": "A rent a car Drivers on Hollidays que contratei NÃO tinha identificação física do local de levantamento da viatura."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shelli Vacca",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T01:17:26.000Z",
          "Titre": "You need to step into the 21st century…",
          "Contenu": "You need to step into the 21st century when you ask whether client is a Mr. or Mrs. ! There are plenty more like Ms.out there!!!!!!!!!!!!!"
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "Rocio Iturralde",
          "Nb_Reviews": 1,
          "Date": "2023-02-25T17:24:26.000Z",
          "Titre": "Payment method",
          "Contenu": "I would prefer to Pay with credit card in the website and I couldn’t find how to rent the babyseat"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Antonio Davalos",
          "Nb_Reviews": 2,
          "Date": "2023-01-13T22:53:39.000Z",
          "Titre": "I dislike cannot finish my rent due to…",
          "Contenu": "I dislike cannot finish my rent due to cellular phone must be american number . I live in Mexico"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Aviad C.",
          "Nb_Reviews": 4,
          "Date": "2023-02-15T01:09:38.000Z",
          "Titre": "Took us three calls to make the change…",
          "Contenu": "Took us three calls to make the change that was supposed to be solved after the first call."
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "alejandro edo",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T22:00:08.000Z",
          "Titre": "The car you receive have to be similar to the car you rented",
          "Contenu": "The car that they ofer to me wasn't the car I rented. Didin't had air condicioned either hydraulic stearing. At the ends the guy who were in charge fixed the problem and they gave to me other car with both thinks."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Ana Martha Fuentes",
          "Nb_Reviews": 2,
          "Date": "2022-12-11T02:39:42.000Z",
          "Titre": "I had to cancel my trip and could not…",
          "Contenu": "I had to cancel my trip and could not cancel my reservation, I could only change the dates."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "J Taylor",
          "Nb_Reviews": 6,
          "Date": "2022-11-05T19:28:59.000Z",
          "Titre": "Very slow response with the online…",
          "Contenu": "Very slow response with the online chat. Would be much easier to talk with a real person and would then take quarter of the time."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "Dagoberto  Mendoza",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T23:23:42.000Z",
          "Titre": "You never confirm my car rental",
          "Contenu": "You never confirm my car rental, any time shop up that credit card was invalid,,,"
        },
        {
          "Note": 3,
          "Lieu": "SX",
          "Pseudo": "Ian De Souza De Souza",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T15:54:46.000Z",
          "Titre": "I booked pick-up on Oct 26 with…",
          "Contenu": "I booked pick-up on Oct 26 with drop-off on Oct 27. Your system changed dates to November on its own. I had to cancel the booking."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Marco Antonio  Ruiz",
          "Nb_Reviews": 1,
          "Date": "2023-01-21T17:50:55.000Z",
          "Titre": "I couldn´t pay on months in my credit…",
          "Contenu": "I couldn´t pay on months in my credit card, even you offer that payment"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "ROBERTO DANTAS",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T21:32:01.000Z",
          "Titre": "Wrong dates for pick up and drop off in…",
          "Contenu": "Wrong dates for pick up and drop off in the email that was sent to me."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Carlos Vasconcelos",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T20:27:06.000Z",
          "Titre": "Please include AVIS in the discount codes",
          "Contenu": "It would be great if AVIS were included in the discount codes you send by email."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Fernando Rehbein",
          "Nb_Reviews": 4,
          "Date": "2022-09-01T00:02:04.000Z",
          "Titre": "I made a mistake in the reservation",
          "Contenu": "I made a mistake in the reservation, I wanted to correct the place to pick up the car and I did not accept making the change, so I had to cancel the reservation"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Jaime Alejandro Copado Olivare",
          "Nb_Reviews": 1,
          "Date": "2022-05-01T19:16:51.000Z",
          "Titre": "We didn’t get the car",
          "Contenu": "We have an issue with the provider of the rental car and we didn’t get the car at last. We need to have a refound of our money because they didn’t have the unity that we paid for and didn’t offered a real and equal solution for us"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 2,
          "Date": "2020-03-03T14:21:48.000Z",
          "Titre": "On line experience was flawless",
          "Contenu": "On line experience was flawless, so I rated you three stars; as for the what experience I had with product purchased; It's too early, since I have yet to experience the \"picking up\" of the vehicle and see how that encounter will be like.  My hope is also that the experience will be flawless; so comeback to me after that experience, and then I will rate you accordingly."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Frank Narciso",
          "Nb_Reviews": 8,
          "Date": "2018-06-15T15:19:29.000Z",
          "Titre": "I would give a 5 Star but there are 2…",
          "Contenu": "I would give a 5 Star but there are 2 negative things with using your service: I cannot use my Rental Car membership number to get credit points ( ie with Alamo) and cannot bypass the counter because there is no link in my Alamo account and the car I rent through you.Your biggest positive obviously is the low price, but long lines at the counter are worth paying a bit more"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "for your order",
          "Nb_Reviews": 2,
          "Date": "2022-10-13T15:05:19.000Z",
          "Titre": "The process was fairly simple until the…",
          "Contenu": "The process was fairly simple until the part where you MUST print out the rental agreement."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "James Houlihan",
          "Nb_Reviews": 8,
          "Date": "2015-12-31T11:08:01.000Z",
          "Titre": "Confusing",
          "Contenu": "Went to the localiza site, was redirected to rent cars.com, got the reservation that I asked for ( very happy).  I went to Localiza with reservation in hand but they had no reference so it took some time to find / confirm the reservation - again success but a little less confusion would make it easier😃"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Hing",
          "Nb_Reviews": 1,
          "Date": "2018-05-29T14:38:18.000Z",
          "Titre": "The search for rental car was swift.  But ......",
          "Contenu": "The search for rental car was swift.  A couple of things could make a big improvement:  1.  This survey email arrived and CONFIRMATION email has yet to arrive. 2.  The dollar value of the rental should be more specific.  That is, US dollar is OK with just a dollar sign but car rentals from other country should have their local currency specifically marked.  For example:  car rental from an Australian tourist should post their car rental in A$ while a Canadian tourist should have their car rental posted in C$, so on and so forth. H.  Leung"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Andressa",
          "Nb_Reviews": 1,
          "Date": "2019-09-04T16:22:50.000Z",
          "Titre": "Fast to book but not to have informations.",
          "Contenu": "It was so fast, but there's no way to put the right number of our flight because it was not accepting letters, just numbers. I tried to login on the Unidas website and they don't accept my informations, I tried to put the reservation number on the account but it was not located. So.. Its fast but I feel Localiza a little bit more expensive but their response is quick, the website give us the electronic payment option, there are someone chatting online to give you informations. I'm still waiting for responses, I send messages and I hope I will have a great experience."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Debbie",
          "Nb_Reviews": 1,
          "Date": "2019-12-01T16:10:50.000Z",
          "Titre": "Well your rates are high but cheaper…",
          "Contenu": "Well your rates are high but cheaper than everyone else.  I'm still looking for cheaper rates for the 11 day stay so I might come back.  But I was with another company, and they extended the reservation for less than you were charging so I cancelled."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Will",
          "Nb_Reviews": 1,
          "Date": "2018-12-12T11:52:57.000Z",
          "Titre": "we rent cars every time from the site",
          "Contenu": "we rent cars every time from the site, just check that your filter options are respected before confirming, sometimes something like automatic transmission is unchecked because non are available, but the site proposes manual vehicles without you realizing it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 2,
          "Date": "2020-01-24T22:48:02.000Z",
          "Titre": "Booking was pretty straight forward",
          "Contenu": "Booking was pretty straight forward. More interested in how it goes picking up and dropping off the vehicle. Really want the car we selected. The \"this car or similar\" makes  me nervous. Hopefully, everything will work out."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "PAUL",
          "Nb_Reviews": 2,
          "Date": "2019-11-15T11:41:07.000Z",
          "Titre": "Decent rates but website defaulted to 9…",
          "Contenu": "Decent rates but website defaulted to 9 am pickup and drop off which is not what I put in. I tried to change it, was told that the price had changed, never received a new quote. Canceled and re booked and got the right times."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "J.B.",
          "Nb_Reviews": 1,
          "Date": "2016-05-30T14:18:35.000Z",
          "Titre": "Be careful with the pictures",
          "Contenu": "In summary, the rental worked.I've used the service two times to rent cars in Dallas (with Hertz) and Miami (with Avis).The only problem is that the car category showing in rentcars.com website made think I would receive a Ford Focus Sedan or other similar Sedan. The website don't have a link to better understand which will be the cars available and what are the \"similar\" cars. When I arrived to pick up the car, it was not a Sedan but a Hatchback, the trunk space was very small and would not fit my luggage.Overall, the costs are very attractive but you really have to be careful with the choices they offer and try to choose wisely."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Fabio Villani",
          "Nb_Reviews": 4,
          "Date": "2019-03-27T11:23:50.000Z",
          "Titre": "Nice and simple",
          "Contenu": "I should write more than 10 words ? Why ... so that just decreased the review from 5 to 4 stars ... just be thankfull people review some stars too when its good ! Why always ask for more ?? People usually review when something is bad! So try to take the good reviews and dont upset people with more formalities ... as you see when i wanted to give you guys a 5* review i had no text. Now im writing you a text and you get 4* and it already took me more than 1 min so the ad on the email is a lie. Make the review part as simple as your booking part and you will get more good reviews. So now because it took more than 1 min and you lied on me you will get 3* Im still happy with the service, wish you a nice day."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Camila Nicolau",
          "Nb_Reviews": 2,
          "Date": "2023-02-05T20:51:17.000Z",
          "Titre": "Charge for the driver",
          "Contenu": "I did a reservation for my family, my husband is the driver. The reservation is in my name and I was charged for an extra driver . I was charged too for snow tire chain for 4 days. I want to change the driver in the reservation but the attendant says it’s not possible. It was such as stressing travel I was so sad it’s not possible to solve those questions."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Chris",
          "Nb_Reviews": 1,
          "Date": "2022-10-26T16:31:33.000Z",
          "Titre": "Do not trust the quotation!",
          "Contenu": "Upon arrival and verification at the pick up location, I was demanded to purchase additional CDW and theft protection as the representative insisted that the coverage that I purchased along with my booking (insured by Rental Cover) does not give any coverage to the rental company (\"Green Motion\"). Hence they would not provide me the vehicle, unless additional CDW and theft protection is purchased at the spot.As I was in a rush I had no choice but to pay extra for the additional options so I could pick up the vehicle.This creates an unnecessary hassle and additional cost for me as it just appears that the original coverage is somewhat irrelevant if a customer is in such situation, given the vehicle is at their possession, not mine.Most importantly, the price that Rentcars provided was absolutely incorrect because that is NOT going to allow to pick up your car, unless paying extra as demanded by the rental company.Have reported the case since end of August and still have not received any constructive feedback as to date. Would rather book via other agencies instead.Update as of Oct 26th: Problem resolved after numerous attempts to reach out to the team (even an escalation email to the CEO). Long story short, the excessive amount that I paid for was refunded at last. Thanks Pamela for the help. My opinion remains unchanged that the quotation provided by the company is not accurate. Believe that's something the company should consider including going forward."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "patrick  Achiam",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T00:58:43.000Z",
          "Titre": "ii is not clear what they want to do"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Samuel",
          "Nb_Reviews": 2,
          "Date": "2019-11-20T05:21:07.000Z",
          "Titre": "I'm trying to get in touch with a live…",
          "Contenu": "I'm trying to get in touch with a live agent I'm having problems extending my contract and my rate has jump to a exuberant price after being one day late."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lorena",
          "Nb_Reviews": 1,
          "Date": "2017-02-22T22:57:38.000Z",
          "Titre": "explain",
          "Contenu": "the time to pick up the car was at 7a.m. but until 7:30a.m. there is no one over there and we need to wait and delay the trip. At the end they did send me the receipt"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Belinda W.",
          "Nb_Reviews": 1,
          "Date": "2019-10-27T02:10:35.000Z",
          "Titre": "This opinion is just for now",
          "Contenu": "This opinion is just for now. I will do another review after I rent the vehicle. I will not know anything until I rent the vehicle."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Thomas",
          "Nb_Reviews": 1,
          "Date": "2018-12-05T18:44:50.000Z",
          "Titre": "Well to be honest I don’t pick up me…",
          "Contenu": "Well to be honest I don’t pick up me vehicle until April. I will see how it works out then I will give my honest opinion."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Tadashi Hirosawa",
          "Nb_Reviews": 4,
          "Date": "2022-08-12T19:27:46.000Z",
          "Titre": "I wanted to pay using my card but I…",
          "Contenu": "I wanted to pay using my card but I couldn’t do it, had to use PayPal."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Conrad",
          "Nb_Reviews": 3,
          "Date": "2018-04-30T14:39:32.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. I hope everything will go smoothly and as per contract and no suprises at time of pick up."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "André Luiz  Salma Cerqueira",
          "Nb_Reviews": 2,
          "Date": "2022-10-26T19:00:15.000Z",
          "Titre": "impossivel pagar on line."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michael Schuler",
          "Nb_Reviews": 2,
          "Date": "2017-03-11T13:16:07.000Z",
          "Titre": "Convertible rental - ad is misleading",
          "Contenu": "The confirmation did not confirm that the car is a Mustang convertible.  Your advertising is misleading."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Lachlan",
          "Nb_Reviews": 26,
          "Date": "2019-12-31T14:05:58.000Z",
          "Titre": "Good price and appears to be in order…",
          "Contenu": "Good price and appears to be in order but had expected to prepay rather than wait until pick up"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Fabio Silveira",
          "Nb_Reviews": 1,
          "Date": "2016-12-28T13:59:41.000Z",
          "Titre": "IMHO, to improve the service, the s …",
          "Contenu": "IMHO, to improve the service, the site could offer an option to choose cars with AWD or even 4WD."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Juan Carrillo",
          "Nb_Reviews": 1,
          "Date": "2022-08-31T02:35:20.000Z",
          "Titre": "I haven’t received a confirmation"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken",
          "Nb_Reviews": 2,
          "Date": "2020-03-09T15:29:19.000Z",
          "Titre": "A bit confusing in follow up emails",
          "Contenu": "A bit confusing in follow up emails.  Some came in Spanish."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "All good except no email confirmation received",
          "Nb_Reviews": 1,
          "Date": "2018-12-24T17:01:44.000Z",
          "Titre": "After I booked the car",
          "Contenu": "After I booked the car. I did not receive email confirmation"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Guibel Campos",
          "Nb_Reviews": 1,
          "Date": "2015-01-11T21:26:59.000Z",
          "Titre": "Bom.",
          "Contenu": "Site tem várias opções e ofertas vale a pena."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "yanhong",
          "Nb_Reviews": 1,
          "Date": "2019-09-16T05:11:58.000Z",
          "Titre": "real car",
          "Contenu": "we can't get the cars always what we booked online."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "WALDO DANIEL  DURAN RODRIGUEZ",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T18:13:19.000Z",
          "Titre": "GUADALAJARA",
          "Contenu": "VERY GOOD EXPERIENCE"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Alan Gomez",
          "Nb_Reviews": 1,
          "Date": "2017-06-14T19:56:54.000Z",
          "Titre": "NO ENCONTRE DONDE REALIZAR LA FACTURA …",
          "Contenu": "NO ENCONTRE DONDE REALIZAR LA FACTURA DE LA COMPRA"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Carlos Alberto",
          "Nb_Reviews": 1,
          "Date": "2019-04-05T18:14:29.000Z",
          "Titre": "I could not rent the car without…",
          "Contenu": "I could not rent the car without insurances."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Walton",
          "Nb_Reviews": 1,
          "Date": "2017-06-15T02:32:37.000Z",
          "Titre": "I do not like the pay in advance …",
          "Contenu": "I do not like the pay in advance portion."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Marcelo Alves Pereira",
          "Nb_Reviews": 1,
          "Date": "2015-05-19T19:02:01.000Z",
          "Titre": "Processo Simples",
          "Contenu": "Fácil de usar e confiável."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Alvaro  Larrañaga",
          "Nb_Reviews": 1,
          "Date": "2021-11-03T16:59:48.000Z",
          "Titre": "limited alternatives"
        },
        {
          "Note": 3,
          "Lieu": "AR",
          "Pseudo": "Harold",
          "Nb_Reviews": 1,
          "Date": "2018-02-06T00:13:05.000Z",
          "Titre": "no confirman rapido el auto"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "carlos afonso castro teixeira",
          "Nb_Reviews": 1,
          "Date": "2020-02-20T12:10:13.000Z",
          "Titre": "boa mas o site e lento"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "PAULO HENRIQUE MORALES",
          "Nb_Reviews": 1,
          "Date": "2016-02-02T01:34:21.000Z",
          "Titre": "Testando Rent a cars",
          "Contenu": "reservando rent a cars"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Fernandes Souza Rampazo",
          "Nb_Reviews": 1,
          "Date": "2017-04-27T14:22:30.000Z",
          "Titre": "easy to use and rent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna M",
          "Nb_Reviews": 1,
          "Date": "2020-03-05T02:42:43.000Z",
          "Titre": "Slow",
          "Contenu": "Very slow web site"
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "Evandro",
          "Nb_Reviews": 1,
          "Date": "2017-11-06T21:17:11.000Z",
          "Titre": "Custo e beneficio."
        },
        {
          "Note": 3,
          "Lieu": "BR",
          "Pseudo": "darlete neto",
          "Nb_Reviews": 1,
          "Date": "2016-03-02T09:01:49.000Z",
          "Titre": "Satisfatório",
          "Contenu": "Satisfatório!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tommaso",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T17:35:43.000Z",
          "Titre": "would have been5 stars except they…",
          "Contenu": "would have been5 stars except they didn't have all the info from your site to Fox.  Like the additional driver for free and the declined insurance.  Although this may just be Fox trying to squeeze out a few more dollars."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Erick Contreras Saucedo",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T23:27:48.000Z",
          "Titre": "insurcance showns differently than the…",
          "Contenu": "insurcance showns differently than the page you reserved"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Brian Larter",
          "Nb_Reviews": 2,
          "Date": "2023-12-03T04:29:16.000Z",
          "Titre": "Check em' out!",
          "Contenu": "Quick, reasonable process and price. I am concerned that picking up the vehicle may be more than a simple shuttle bus. Any thoughts?"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "de passage Dkr",
          "Nb_Reviews": 2,
          "Date": "2023-09-01T23:49:39.000Z",
          "Titre": "Follow up after bad experience",
          "Contenu": "This is a follow up after my bad experience last mid July. After a few weeks, I was reimbursed. By the numerous emails I got from Rentcars, it is clear that they care about their customers' satisfaction. The local franchise is to blame for their misleading practices."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Cherilyn Schrijer",
          "Nb_Reviews": 15,
          "Date": "2023-04-27T11:17:42.000Z",
          "Titre": "I highly recommend Rentcars for anyone…",
          "Contenu": "I highly recommend Rentcars for anyone looking for a convenient and easy car hire. Rentcars compares prices from over 200 car rental companies across the world, so you can find the best option for your needs and budget. Rentcars also has a flexible pricing plan, where you can choose unlimited kms or with fuel plans. The car delivery and return are also on time and hassle-free."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "REBECA PACHECO GOMEZ",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T20:48:00.000Z",
          "Titre": "You must review the process by computer",
          "Contenu": "First I tried to do the reservation by my laptop but it was terrible… three diferent credit card and anyone did it.At last have the reservation but to pay by paypal was impossible and have to dowloand the app in my phone and do everything again and finally got the reservation and the pay."
        },
        {
          "Note": 4,
          "Lieu": "PY",
          "Pseudo": "Carlos Penayo",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T13:30:09.000Z",
          "Titre": "Easy to navigate",
          "Contenu": "Easy to navigate. Scope of offer well balanced"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Jughi",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T15:07:54.000Z",
          "Titre": "This is very good company in my opinion…",
          "Contenu": "This is very good company in my opinion and I'm happy from their work."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Marcelo Ferreira",
          "Nb_Reviews": 1,
          "Date": "2023-02-12T23:32:02.000Z",
          "Titre": "Price could be better and when I…",
          "Contenu": "Price could be better and when I deliver the car rented I was looking for a compact car but in the Rental Plus was only two options for a small car. The attended Alessandro was very sympatic and nice and cordial (smalling) and explain me everything. outstanding !!!:)"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Ian Foster",
          "Nb_Reviews": 1,
          "Date": "2023-06-24T02:12:25.000Z",
          "Titre": "Great rate but real supplier is a partner",
          "Contenu": "Rentcars presented several very low offers, I chose EuropCar at YVR (but with shuttle service to a nearby off-airport site) and the booking process was smooth.  After reserving, prepayment of 80% of the rental and receipt of a voucher, I found that the vehicle will be supplied by Routes.  Routes is partnered with EuropCar.  Their YVR office has mixed reviews: several positive and many negative.  I am now apprehensive but hope that my experience is positive."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Gianni",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T14:39:37.000Z",
          "Titre": "Great variety but rentals doesnt have…",
          "Contenu": "Great variety but rentals doesnt have all details of the rent.Generaly when renting a car with you app, the rent company doesnt have all de detalis of the extras , insurements or actual plan we reserved."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "A Fonseca",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T16:50:58.000Z",
          "Titre": "Cashback not released",
          "Contenu": "If you let me use my credits (cashback) available since I rented a car and returned ok about 8 months ago, I would give you the 5 stars. You did not allow me to use (and it was available) and no explanation was given. So, 4 stars only."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "ANA MARIA  NITSCHE",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T17:22:53.000Z",
          "Titre": "On internet was easy to follow the…",
          "Contenu": "On internet was easy to follow the steps and  get the confirmation of the car rental in my e mail.  Tomorrow I'm travelling so I will be able to give 5 stars to Rentcars if the car is ready to be used.Absolutely fine, everything went perfect!!!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "NABIL",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T21:09:52.000Z",
          "Titre": "Fair prices compared to other sites",
          "Contenu": "Fair prices compared to other sites, web site is easy to use, you can cancel any time before your trip date with full refund."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "HA Customer",
          "Nb_Reviews": 4,
          "Date": "2023-10-19T21:57:59.000Z",
          "Titre": "Great price easy to navigate site.",
          "Contenu": "UPDATE The lovely people called me and let me know they do pick up at T2.Great price easy to navigate site.But it does say MXP not Shuttle Service which you don’t know till you have paid and it’s not cancellable without losing your money. This is misleading. It’s also hard to understand if there is a pick up at Terminal 2. I don’t think there is but because it was so cheap I went ahead and will get the bus from T2 to T1 and then the shuttle bus."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Philip Macoun",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T00:03:50.000Z",
          "Titre": "Good price",
          "Contenu": "Good price. Had a problem processing my credit card, first card used came up with a “problem”.  Used a different card ok, then the first card company contacted me to advise a suspected fraud with that card.  Still sorting it out"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "PHILIPPE CORNUT",
          "Nb_Reviews": 3,
          "Date": "2023-07-04T16:18:37.000Z",
          "Titre": "I have found a Jeep Renegade at a…",
          "Contenu": "I have found a Jeep Renegade at a special rate ! Good news. When I will be at the Hertz counter in La Paz what car they will suggest, will it be a 4 wheel drive and what kind of milage in Baja California will have this car ???? Many questions mark and probably several bad news !!"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Juan Carlos Alzate H",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T15:41:52.000Z",
          "Titre": "Highly recommended option.",
          "Contenu": "The experience was pleasant thanks to the availability of options with information. You guys are doing things right, looking for options, I searched directly with several providers without success."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Marcela  Carcamo",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T15:27:19.000Z",
          "Titre": "Rentcars need to supervise the rental…",
          "Contenu": "Rentcars need to supervise the rental car companies, especially regarding chairs for kids. Not all the companies know about the type of chairs and the legislation. In addition, having a fluid communication channel is difficult if you have a problem. The assistants responded very slowly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Amanda  N",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T15:31:39.000Z",
          "Titre": "The ease of booking was excellent as…",
          "Contenu": "The ease of booking was excellent as well as the price. I would have liked to see the final price after all the added taxes, fees, and add-ons I would like to select though, like sirius xm, transponder for tolls, etc... I would also like to see if I get the car I choose..."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Rupesh Sharma",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T04:51:08.000Z",
          "Titre": "Thats is good and nice company",
          "Contenu": "Thats is good and nice company. Google is very good search engine site."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Vicki  Willems",
          "Nb_Reviews": 1,
          "Date": "2023-05-27T18:01:16.000Z",
          "Titre": "Rent cars rating",
          "Contenu": "You came up on the Google page first, so I clicked on it. It appeared that you had all the different real aito rental companies in your list. The selection was impressive. I found the type of vehicle I wanted easily and the prices were competitive. It took a bit of time to register and then find my way back to the vehicle I wanted, but was easy to finally book it. Thanks for the service.Blessings"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Maria Fernanda Sepulveda Colas",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T20:57:52.000Z",
          "Titre": "Platafom worked at espected , autorental shop did not",
          "Contenu": "We rented a car for thre days, payed the aditional coverage and when delivering the car the clerk was really pushy about us buying once again the aditional coverage that we previously bought, saying that what we had did not work."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angie Ybarra",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T05:00:16.000Z",
          "Titre": "You guys want some more useful it's a…",
          "Contenu": "You guys want some more useful it's a little bit of time I wish I could have paid for my car right then right here now instead of paying for it half an hour so next time maybe you got to just charge me one time for everything"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Giancarlo Mejia",
          "Nb_Reviews": 3,
          "Date": "2023-06-13T20:16:46.000Z",
          "Titre": "To have a phone number where you can call and actually talk to a live person",
          "Contenu": "The price is what people are looking for we're all looking for a well affordable price. It would be great if there was a phone number where I could actually talk to a live person"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Franciscus van der zanden",
          "Nb_Reviews": 3,
          "Date": "2023-12-19T13:58:22.000Z",
          "Titre": "It was easy to book"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Ricardo Silva",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T19:13:06.000Z",
          "Titre": "The  service",
          "Contenu": "The service was carried out sucessfully. I got a good car without much difficulty."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Irving C",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T09:05:57.000Z",
          "Titre": "The app for iPhone works flawlessly",
          "Contenu": "The app for iPhone works flawlessly, but the website gave me a headache to pay. I tried with different cards, and none worked, so I tried the app on my iPhone, and it worked just fine. Please fix the website, but I love that we can filter and use the same options between the website and the app."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Yow Martin",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T15:04:33.000Z",
          "Titre": "Online Rentals",
          "Contenu": "All went well reserving online.Too bad you do not have a location downtown that is open on Sundays."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Jacqui Walsh",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T16:17:41.000Z",
          "Titre": "First booking",
          "Contenu": "This is my first time booking through RentCars. The booking process was good, I like that I can book now and pay later. I am hoping the actual picking up of the vehicle is as easy."
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Roberto Jop",
          "Nb_Reviews": 2,
          "Date": "2023-04-28T18:01:33.000Z",
          "Titre": "I had a mistake in my reservation and…",
          "Contenu": "I had a mistake in my reservation and was a litle hard solve in the web page, and a i had contact with an assistent by WhatsApp All the rest was wonderfullThank"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Rafael",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T13:26:00.000Z",
          "Titre": "1 the reservation is so fast",
          "Contenu": "1 the reservation is so fast2 the price is lowI wait have the car soon!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Maria Mauro",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T12:13:42.000Z",
          "Titre": "I want to add to my reservation…",
          "Contenu": "I want to add to my reservation insurance and the application does not let me.  Please call me or help me do this.  I understand I have to pay more money and I'm ok with adding the e tea charges.  630 290 8603."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Carlos Lopera",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T18:16:16.000Z",
          "Titre": "Fast and good service from the office",
          "Contenu": "Fast and good service from the office. The person who gave me the car at the parking, didn't explain nothing about the features of the car. Thanks to Efrain who received the car the last day."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Stephanie Shore",
          "Nb_Reviews": 2,
          "Date": "2023-04-01T11:37:18.000Z",
          "Titre": "CURRENCY = Be very careful that you CHANGE the…",
          "Contenu": "Be very careful that you CHANGE the country $ tab at the top, otherwise you think you are getting a very good deal only to find you've booked in a foreign currency and its actually DOUBLE what you thought you were paying"
        },
        {
          "Note": 4,
          "Lieu": "BO",
          "Pseudo": "Wilson Flores",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T21:16:16.000Z",
          "Titre": "Easy to access",
          "Contenu": "Easy to access and contract the services. Anyway I had troubles with payment on the App that is why I went to the website to complete the rental."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Carlos Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-03-15T04:26:45.000Z",
          "Titre": "The available information is limited",
          "Contenu": "The available information is limited, and if you need more details it says that you can check at the counter"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2022-11-20T18:45:47.000Z",
          "Titre": "The rental selection process was quick…",
          "Contenu": "The rental selection process was quick and easy.  The only glitch I ran into was with payment.  My card company automatically declined the transaction for fraud, so they have apparently never heard of this agency."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Tadashi Hirosawa",
          "Nb_Reviews": 4,
          "Date": "2023-06-06T17:50:11.000Z",
          "Titre": "Good,It was easy to make reservation",
          "Contenu": "Good,It was easy to make reservation. Just I hope that in the reserved site the delivery will be smooth."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Hector Manuel Meza Curiel",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T01:30:11.000Z",
          "Titre": "It was easy to rent the car",
          "Contenu": "It was easy to rent the car, good price. I looked how to get the invoice but could not find a hint where or how to get it.  Also the final evaluation will be at the time the car is delivered."
        },
        {
          "Note": 4,
          "Lieu": "HT",
          "Pseudo": "Leslie Boulos",
          "Nb_Reviews": 1,
          "Date": "2022-12-22T01:26:40.000Z",
          "Titre": "Easy choice",
          "Contenu": "Simple easy anyone can fill the form ,even  for a stranger to the system .It would be great if more clearer for the insurance needed."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Daniel",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T15:11:14.000Z",
          "Titre": "Distancia entre o aeroporto e local de…",
          "Contenu": "Distancia entre o aeroporto e local de pegar o carro"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ann Marie  Scarpellino",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T20:19:31.000Z",
          "Titre": "rentacar.com",
          "Contenu": "first of all, I made an initial deposit of $124.00 dollars, and expected to pay balance upon pick up of my rentalis that correct.."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Marcelino",
          "Nb_Reviews": 4,
          "Date": "2023-03-14T17:44:53.000Z",
          "Titre": "Good princing and overall easy process…",
          "Contenu": "Good princing and overall easy process to rent. Found a bit odd to have only PayPal as payment though."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Mauricio g Carrera Lance",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T03:38:15.000Z",
          "Titre": "Easy to reserve a car but tha…",
          "Contenu": "Easy to reserve a car but tha application takes some time to respond"
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "al Ignacio Zegpi",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T13:14:04.000Z",
          "Titre": "Great prices",
          "Contenu": "Great prices. Friendly interface.  Easy to book. Down side, wouldn't let me book the same care twice."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Juan David Ulloa Ribón",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T01:49:59.000Z",
          "Titre": "Excelent!",
          "Contenu": "Great webpage! It's user friendly and they send you the PDF file with the voucher 1 minute after the payment is approved."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Domenico",
          "Nb_Reviews": 5,
          "Date": "2022-11-29T02:59:35.000Z",
          "Titre": "Clear and fast booking",
          "Contenu": "Clear and fast booking, good pricing . Trustworthy website."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Shruti Gour",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T12:04:49.000Z",
          "Titre": "That is great Company"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Hector Palma Tapia",
          "Nb_Reviews": 1,
          "Date": "2023-05-13T19:44:03.000Z",
          "Titre": "It is a practical page and gives you…",
          "Contenu": "It is a practical page and gives you several options for displaying cars and sizes"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Alejandra  M",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T20:25:15.000Z",
          "Titre": "Honest with the status of the car and…",
          "Contenu": "Honest with the status of the car and good attention. In the page the cost said it included the insurance but when I went to pick it up I had to pay a lot more because the insurance wasn’t included."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Janet Surrett",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T03:12:47.000Z",
          "Titre": "I seem to have made a reservation…",
          "Contenu": "I seem to have made a reservation fairly easily, but until I actually get to Cranbrook BC on August 31, 2023 I will not know whether my reservation is successful or not!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rebecca  Rotgers",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T05:25:08.000Z",
          "Titre": "Good company",
          "Contenu": "Very nice and got me in n out without any problems. Didn’t get my full size car that I requested but it was ok."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Christine SCHLEMER DUPUY",
          "Nb_Reviews": 4,
          "Date": "2023-01-26T15:58:41.000Z",
          "Titre": "Perfectible",
          "Contenu": "Plans : Prise en charge et restitution non fournis.2ème conducteur non mentionnéMAIS prix attractifs!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Naomi",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T16:08:26.000Z",
          "Titre": "easy and quick",
          "Contenu": "The website was easy to use and it was a quick process to find the right car for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T14:47:00.000Z",
          "Titre": "Good rental but bad system"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Xing Rao",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T21:24:07.000Z",
          "Titre": "Reservation cancelled",
          "Contenu": "Update of March 2023: Finally got my refund after more than 4 months. The refund is about 89% of the original payment. It turns out that rentcars do process payment, just very very slow and conversion rate is worse now.Original Review: Reservation was cancelled by rental company. There is no response and no refund for over 2 weeks."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Abdulaziz Altammam",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T14:08:44.000Z",
          "Titre": "Price too high than compared with other…",
          "Contenu": "Price too high than compared with other companies"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T02:31:40.000Z",
          "Titre": "Quick and easy to use with lots of…",
          "Contenu": "Quick and easy to use with lots of different options."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Dinosca",
          "Nb_Reviews": 3,
          "Date": "2023-07-25T20:33:35.000Z",
          "Titre": "Easy to see the cars and pick up point",
          "Contenu": "Easy to see the cars and pick up point. Only downside was I wanted to add a driver and couldn’t work out how."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Laurivan  Aragão",
          "Nb_Reviews": 4,
          "Date": "2023-05-04T04:15:05.000Z",
          "Titre": "A transparência e as ofertas mais…",
          "Contenu": "A transparência e as ofertas mais baratas."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Elia",
          "Nb_Reviews": 4,
          "Date": "2023-10-09T22:16:09.000Z",
          "Titre": "Good and friendly platform",
          "Contenu": "Good and friendly platform, it was easy and fast to book my car."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Veronica Gabriela Martinez Her",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T06:13:08.000Z",
          "Titre": "A little beat confuse but we found what…",
          "Contenu": "A little beat confuse but we found what we need with the best price"
        },
        {
          "Note": 4,
          "Lieu": "CL",
          "Pseudo": "Pilar JIménez JIménez",
          "Nb_Reviews": 1,
          "Date": "2022-12-26T19:34:13.000Z",
          "Titre": "I need a invoice for this service",
          "Contenu": "I need a invoice for this service, but a I couldnt found the place to asked for it."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Hassan Raza",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T23:50:21.000Z",
          "Titre": "Hey are you looking for rentcars?",
          "Contenu": "Wow, user friendly and helpful website.First time i used and I'm happy to see this. 😊"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Wendel Damasceno",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T18:46:52.000Z",
          "Titre": "Execelente atendiemtno via WhatsApp",
          "Contenu": "Execelente atendiemtno via WhatsApp Reserva feita completamente via msg"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "Tanaphol Rodpinyo",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T16:47:56.000Z",
          "Titre": "Website very convenient but got an issue with the payment method.",
          "Contenu": "I have made reservation via website which is very convenient and great.  However, I have got a problem during settle the payment.  At the first time, It was too slow and stuck so I think It wasn't go successfully.  After that I tried again and it went successfully but it show double transaction meaning that I have been charge twice.  I have tried to contact support team via email but still no feedback yet. Please help to fix this issue, would be much appreciated.  Thank you so much."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gregory",
          "Nb_Reviews": 5,
          "Date": "2022-08-30T21:32:10.000Z",
          "Titre": "It was easy to book",
          "Contenu": "It was easy to book.  However, we will see how the rental location reacts when I go to collect the car and the 3rd party liability charges.  In the past the rental location has charged an extra fee or a crazy deposit depending on the extra insurance coverage.On my account there are 3 differnt numbers some in Can dollars some in US dollars.  We will see."
        },
        {
          "Note": 4,
          "Lieu": "DZ",
          "Pseudo": "Nadir Ait hamou",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T05:33:57.000Z",
          "Titre": "Efficace",
          "Contenu": "Simple, rapide, pas d'entraves"
        },
        {
          "Note": 4,
          "Lieu": "UZ",
          "Pseudo": "Khamdam",
          "Nb_Reviews": 2,
          "Date": "2022-09-15T18:14:51.000Z",
          "Titre": "😑😑",
          "Contenu": "hello. I took the car in Pittsburgh and the car was in bad condition. When I left the car they said that there was damage.when they gave me there were already damages and I took it and left it. They even gave me a piece of paper that there were damages to the car"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dennis Dorling",
          "Nb_Reviews": 2,
          "Date": "2022-11-22T18:45:13.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy, best prices, lots of choices"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Tadashi Hirosawa",
          "Nb_Reviews": 4,
          "Date": "2023-08-28T23:32:12.000Z",
          "Titre": "Easy step to make reservation"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Keith Fleming",
          "Nb_Reviews": 38,
          "Date": "2022-11-11T18:49:21.000Z",
          "Titre": "Good price,",
          "Contenu": "Good price,Had to try to pay 3 times, which was a pain, but all good in the end."
        },
        {
          "Note": 4,
          "Lieu": "PT",
          "Pseudo": "Vitor Florencio",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T21:38:05.000Z",
          "Titre": "By rent a car for next November i had a…",
          "Contenu": "By rent a car for next November i had a problem it the payment. I contact the people from Rentcars and they resolved it very fast and professional"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gustavo Cerezo",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T22:24:43.000Z",
          "Titre": "Quick way to select a car an company"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leesa Overstreet",
          "Nb_Reviews": 2,
          "Date": "2023-08-25T20:19:42.000Z",
          "Titre": "The experience with rentcars was smooth."
        },
        {
          "Note": 4,
          "Lieu": "AR",
          "Pseudo": "EDMUNDO FLOREAL",
          "Nb_Reviews": 4,
          "Date": "2023-06-05T13:24:19.000Z",
          "Titre": "VERY GOOD PAGE",
          "Contenu": "All very well.  Page friendly and simple to understand."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Stephen Moore",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T18:00:07.000Z",
          "Titre": "Reasonably intuitive website design",
          "Contenu": "Reasonably intuitive website design , which helped speed up the process of searching in a country I have never rented in."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "T R Namballa",
          "Nb_Reviews": 6,
          "Date": "2022-07-17T15:25:03.000Z",
          "Titre": "Easy Interface and easy to book",
          "Contenu": "The website is easy with all options like breakdown/additional protection etc. The only issue with this company/website is there is no option to add additional driver information. Hopefully this wont be additional hidden cost to make money by car company."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Esteban Vazquez Almazan",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T03:28:05.000Z",
          "Titre": "Friendly and simple process",
          "Contenu": "Friendly and simple process, goodRecommendations and good pricess"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Pedro Otalora Valencia",
          "Nb_Reviews": 2,
          "Date": "2023-05-28T02:18:11.000Z",
          "Titre": "Dificil la asignacion on line"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Ijaz Ahmad",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T20:10:04.000Z",
          "Titre": "Its a Nice website.",
          "Contenu": "Its a Nice and user friendly website. I use this from a lot of time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Don Reeves",
          "Nb_Reviews": 4,
          "Date": "2022-07-29T02:55:21.000Z",
          "Titre": "The rental car industry needs to take…",
          "Contenu": "The rental car industry needs to take note that one day rentals need to be as cheap as possible or people will just take Uber or lyft. Not one day rental for 80-100 dollars the last 1 1/2 years. You loose a lot of business."
        },
        {
          "Note": 4,
          "Lieu": "CR",
          "Pseudo": "Luis Diego Acuña",
          "Nb_Reviews": 1,
          "Date": "2022-11-01T22:25:29.000Z",
          "Titre": "easy to rent",
          "Contenu": "It is my first time to rent a car, looks very easy to use and find a perfect car for me."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "jc bemvenutti",
          "Nb_Reviews": 13,
          "Date": "2022-02-03T14:22:22.000Z",
          "Titre": "Taking to long to get my refund",
          "Contenu": "Not a 5 star because my refund from a canceled reservation is taking to much time. I was supposed to get an email to inform my bank account and it has been three days and nothing happened. I even call the rentcar center and they just told me to wait. What bothers me is that I pay on time and at the time of refund it's not the same thing."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Giovanni  DellaForesta",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T12:08:54.000Z",
          "Titre": "I was about to book but I did not…",
          "Contenu": "I was about to book but I did not complete booking since I do not have PayPal. My insurance with my credit card will cover rental only if payment is made with my credit card"
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "Jaime Eduardo  Amarillo Serran",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T02:39:46.000Z",
          "Titre": "Was expedite and easy"
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Alonso Aguirre",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T06:11:14.000Z",
          "Titre": "Thanks for your help to make a…",
          "Contenu": "Thanks for your help to make a reservation for rent a car"
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "BRUNO CUNHA",
          "Nb_Reviews": 4,
          "Date": "2023-01-27T21:46:04.000Z",
          "Titre": "Site de facil busca que facilita as…",
          "Contenu": "Site de facil busca que facilita as locacoes de veiculos."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcos Marmolejos Jr.",
          "Nb_Reviews": 1,
          "Date": "2021-01-16T01:54:30.000Z",
          "Titre": "4 stars for online service only",
          "Contenu": "4 stars for online search only. i have not yet experience the auto renter @ facility ft. lauderdale hollywood airport reserved 01/16/2021.      this survey is not relevant until customers received the services rendered accordingly. so, until then...... after 01/22/2021 conclusion review.p.s. first time rental customer"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Brian Hyde",
          "Nb_Reviews": 10,
          "Date": "2020-09-28T10:51:32.000Z",
          "Titre": "Loads better than expected",
          "Contenu": "Once I had booked I looked at reviews on trustpilot and was worried as most reviews were only about the booking process and not about the actual hire. I was therefore delighted when I arrived at the Eurocar desk in Elmas Airport Sardinia to have excellent service and an excellent car.Will certainly be happy to use this company again."
        },
        {
          "Note": 4,
          "Lieu": "IT",
          "Pseudo": "Mitja",
          "Nb_Reviews": 7,
          "Date": "2021-06-22T14:25:47.000Z",
          "Titre": "It took a while, but they solved everything",
          "Contenu": "I had a booking for May 2020 but had to cancel due to the travel restrictions. I canceled  the booking more than 5 days before the pick-up date to avoid the no-show fee directly on their website.I never got the refund and I never got a reply to any email or message I sent.There is no working way to contact them directly on the website.---update--They finally contacted me after I wrote this review. Apparently the refund was issued through Paypal but never arrived. The customer service solved the issue and got me a refund."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Lucas Beckenbauer",
          "Nb_Reviews": 3,
          "Date": "2021-10-22T14:34:15.000Z",
          "Titre": "This ones can save your job",
          "Contenu": "I think that it's a quite common situation when you can't drive your car and you have to apply to special services which can help you to rent a car. In my opinion, such services have already saved lots of lives and this fact shouldn't be underestimated. Sometimes we face some circumstances when we're not able to drive a car and have to think about some ways how to get to work or something llike that. I just want to thank this agency, which saved my profession. I was nearly fired and due to the fast help from this company, I 'm still working in my company. They're very rapid."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T02:42:26.000Z",
          "Titre": "i WAS NOT ABLE TO PUT IN A DIFFERENT…",
          "Contenu": "i WAS NOT ABLE TO PUT IN A DIFFERENT LOCATION FOR DROP OFF. I WOULD FILL OUT THE PROPER LOCATIONS BUT THEN IT WOULD GO BACK TO BRINGING IT BACK TO SAME LOCATION. IT WAS A LITTLE FRUSTRATING. THE PRICE WAS GREAT BUT I HAVE NOT GOTTEN THE CAR AND GONE THROUGH THE WHOLE RENTAL EXPERIENCE. I WILL CHECK BACK AT THE END OF APRIL WITH THE FULL RENTAL EXPERIENCE."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Allita Rodrigues",
          "Nb_Reviews": 4,
          "Date": "2022-02-20T00:51:58.000Z",
          "Titre": "Refund fully paid",
          "Contenu": "I had to cancel my booking before picking-up my rental car. My refund was fully available back to my credit card within 20 days, as per the policy. Thank to the Customer Happiness Assistant that reassured me when I had questions."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "Jaime Francisco Contro Yllanes",
          "Nb_Reviews": 1,
          "Date": "2021-03-23T20:06:34.000Z",
          "Titre": "I wanted to change the pick up place",
          "Contenu": "I wanted to change the pick up place. The web page did not show how to modify my reservation. I contacted your support tema. She answered \"go to your reservation, in the upper right corner click the button \"change my reservation\". But... there is no such button to click on..."
        },
        {
          "Note": 4,
          "Lieu": "MX",
          "Pseudo": "DANIEL ZALDIVAR NAVARRO",
          "Nb_Reviews": 1,
          "Date": "2022-05-05T23:37:07.000Z",
          "Titre": "Baby seat",
          "Contenu": "Hi, the rent car process in Rencars was quick and efficient, but I ask for a baby seat at American rent car in Los Cabos but they don't have the service to reserve it even one month in advance."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lilian",
          "Nb_Reviews": 1,
          "Date": "2020-03-11T19:20:50.000Z",
          "Titre": "When I rent through you the cost was…",
          "Contenu": "When I rent through you the cost was $345.16 but when I called Dollar rental , because I had to change it to my son’s name they said is $362.47. They said sometimes you guys don’t know the fees for Ohio requires. Luckily the difference is not much but if the difference is a lot then I won’t be too happy."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pedro Verissimo",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T18:32:33.000Z",
          "Titre": "Very efficient but the chat have a…",
          "Contenu": "Very efficient but the chat have a delay for questions"
        },
        {
          "Note": 4,
          "Lieu": "BO",
          "Pseudo": "CV",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T18:05:59.000Z",
          "Titre": "Regular",
          "Contenu": "Cobros extras"
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "VALERIE  SCIAMARELLI PILARTE",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T01:51:23.000Z",
          "Titre": "They give us a lot following",
          "Contenu": "They give us a lot following, they was Kindle, sympathic, and I used them for sure again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Martin",
          "Nb_Reviews": 2,
          "Date": "2023-12-16T15:29:11.000Z",
          "Titre": "Affordable rental car prices",
          "Contenu": "It was very easy to navigate the website for a rental car, and with prices that were affordable too."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Gerald  Archambeau",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T15:17:34.000Z",
          "Titre": "Easy to understand,and choose what u…",
          "Contenu": "Easy to understand,and choose what u want.Prices are competitive."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "João Vinícius",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:49:29.000Z",
          "Titre": "The service was pretty fast to give me…",
          "Contenu": "The service was pretty fast to give me a car, the car was new.Great service and friendly attendants."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Claudio Muñoz",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T13:30:44.000Z",
          "Titre": "I was not aware about Rentcars",
          "Contenu": "I was not aware about Rentcars, I usually use traditional companies. Everything works pretty well, amazing! It was such a good service that it went into my favorite service in the future. I have to admit that at first I was skeptical about advancing in the process, but the offers were good and I continued, luckily!!"
        },
        {
          "Note": 5,
          "Lieu": "HN",
          "Pseudo": "Allen",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T05:30:51.000Z",
          "Titre": "Excellent service",
          "Contenu": "I rented a mid-size, but since the pick-up was on Thanksgiving, they hadn't one available at the time scheduled to pick up, they resolved this situation, giving me a SUV (in great condition and clean) with no additional cost. I really appreciated their effort to solve the inconvenience; they are committed to fulfilling the car rental. They pick you up at the rental car center, and when you return the car, they take you to the airport."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Esteban",
          "Nb_Reviews": 4,
          "Date": "2023-12-02T12:05:04.000Z",
          "Titre": "Amazing customer service!",
          "Contenu": "Rented a car through Rentcars to pick up at Cancun airport (at a great price!). However our flight was delayed and the rental company (Keddy) had already closed by the time we arrived.We couldn't get through to speak to someone at Keddy so we ended up just renting a car at a different rental company the following day so that we could continue with our holidays.I assumed that we'd lost the money paid on our original booking through Rentcars, as I never showed up to pick up the car. However when we returned from our 2-week holiday I contacted the amazing customer service at Rentcars just in case: After they checked with Keddy to confirm that we didn't pick up the car they sent me a full refund for the booking! In retrospect I should have contacted Rentcars when I arrived late to Mexico, rather than trying to reach Keddy. I'm sure they'd have sorted it out somehow!"
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "JOHN JOHN",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T15:47:05.000Z",
          "Titre": "This is the first time I have used your…",
          "Contenu": "This is the first time I have used your rental company. As far as your response to my needs was excellent. I comment further after experiencing your service and the vehicle I get for use. Thanks."
        },
        {
          "Note": 5,
          "Lieu": "GT",
          "Pseudo": "Ismar",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T20:12:35.000Z",
          "Titre": "We liked our car",
          "Contenu": "We liked our car, the personel of AVIS gave us a good service and presented us the alternatives and extras of the vehicle."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Fahad Awan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T16:39:57.000Z",
          "Titre": "This is very trusting website his…",
          "Contenu": "This is very trusting website his service is very fast"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Josh",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T13:29:42.000Z",
          "Titre": "Great overall experience",
          "Contenu": "Good communication, clean car, easy pick up and easy drop off- no issues"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "GD",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T17:00:29.000Z",
          "Titre": "It was easy to book the car",
          "Contenu": "It was easy to book the car, fair price, quick and respectful attendance, and the vehicle was according to the offered service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T04:45:32.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, smooth booking."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Kristhell Mercedes",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:06:01.000Z",
          "Titre": "SERVICIO EXCELENTE",
          "Contenu": "IN ENGLISH, SERVICE AND BOOKING  WAS FLAWLES,, I WAS VERY IMPRESSED. I RECOMMEND THE SITE AND THE RENTAL CAR BOTH."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Hugo",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T15:22:41.000Z",
          "Titre": "recomended all went as it should",
          "Contenu": "All good it all went smooth no issues best price available at the time, 1 thing I didn't like the credit you receive for each rentals is not genuine. When I choose to use the credit available the then the rental rate changes to a higher rate that is more expensive even after the credit is apply."
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "EMANUELE CARNOLI",
          "Nb_Reviews": 2,
          "Date": "2023-10-28T21:19:51.000Z",
          "Titre": "Great service",
          "Contenu": "Great service, they even substituted our car and took off one day of payment due to a major inconvenience. It shows that they care about customer satisfaction and it couldn't have gone better. Excellent overall!"
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "TVTrav",
          "Nb_Reviews": 7,
          "Date": "2023-10-26T23:21:20.000Z",
          "Titre": "Good price and (eventually) good support",
          "Contenu": "Rentcars gave me a good deal on a car rental, more than $100 cheaper than other options I had found, which was great. However, even though I paid in full in advance for my rental, I was charged $110.00 in erroneous charges by the car company and wanted to contact Rentcars to help me with the dispute. Initially I had difficulty receiving support because other than a chatbot, I wasn't able to find a way to contact support, which was a bit frustrating. However, upon leaving a review on this site, I was contacted right away by a representative and they helped me sort out the problem, thankfully. They even asked me about my experience with the chatbot because they want to make sure it's working properly. Because of the good support that I eventually received, I'll definitely consider Rentcars again as an option for finding a good deal on a car."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Keith",
          "Nb_Reviews": 3,
          "Date": "2023-09-06T05:40:26.000Z",
          "Titre": "RentCars - The better choice",
          "Contenu": "This is a very easy site to navigate. You are told upfront the charges and if there are any additional charges incurred by other companies supplying cars.  They also have a review system which is helpful.  So read the reviews and if the prices appear too cheap.. there will obviously be some added extras.  So read the fine print then decide on the rental company of your choice.  I have been using RentCars for several years with absolutely no issues in finding the right vehicle for my needs."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "OSCAR ALEXANDER  PATIÑO CARDEN",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T00:48:44.000Z",
          "Titre": "It was very easy for me to interact…",
          "Contenu": "It was very easy for me to interact with the application.  The information is clear and the best thing is that they immediately confirm your reservation."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Alan Pilkington",
          "Nb_Reviews": 4,
          "Date": "2023-10-03T17:13:27.000Z",
          "Titre": "Great service at Enterprise Cheltenham",
          "Contenu": "I hired a car from Enterprise Cheltenham from 27/09/23 to 2/10/23. The service that I received from all the staff was very good, especially Yasmine, Craig and Oliver.They were very helpful in choosing the best car for our trip, it was just right for our needs, four adults and all our luggage! The whole experience was problem free!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Jhonatas",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T18:28:40.000Z",
          "Titre": "Very easy to find the appropriate car…",
          "Contenu": "Very easy to find the appropriate car and select the protections and other itens needed. You can find different companies, car options and prices as well. I always recommend rentcars.com to my friends and family."
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Ana Duarte",
          "Nb_Reviews": 3,
          "Date": "2023-08-26T09:03:30.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience. I picked up the car in Venice. the service was extremely fast and simple, the service was very kind and professional. The car was new, in excellent condition. The return of the car which was also in Venice was also very quick and simple. They did not charge anything beyond what was initially presented in the rental reservation. Next time I need to rent a car, I will certainly use Locauto again."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "j man",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T21:22:13.000Z",
          "Titre": "I just booked my rental and it took all…",
          "Contenu": "I just booked my rental and it took all of 5 minutes.Easy website to navigate, select the vehicle to rent and make the reservation.  The confirmation email when completed is always a nice touch so I know it's done."
        },
        {
          "Note": 5,
          "Lieu": "CR",
          "Pseudo": "Robbie Diaz",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T02:27:09.000Z",
          "Titre": "The difficult part was to choose from a…",
          "Contenu": "The difficult part was to choose from a variety of good choices. Let's just hope the car rental company does not charge anything unexpected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ann Spratt",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T17:05:17.000Z",
          "Titre": "Thank you Arturo",
          "Contenu": "The pick up experience was easy. I was running late getting the car back....the team made it a smooth check-in just before five o'clock. A very special thank you to ARTURO for taking me to the bus stop in Wenatchee. I greatly appreciated the car, the service and especially Arturo. It was a very warm afternoon and  would have been a long walk.A.S."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Darko Teslich",
          "Nb_Reviews": 8,
          "Date": "2023-11-04T01:52:42.000Z",
          "Titre": "legible website",
          "Contenu": "legible website, options clear and exactly what is needed (e.g. full insurance cover option), competitive price"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T18:15:21.000Z",
          "Titre": "Easy and fast booking"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elliot O'Connor",
          "Nb_Reviews": 2,
          "Date": "2023-11-27T15:29:59.000Z",
          "Titre": "It's easy to use the application even…",
          "Contenu": "It's easy to use the application even for a not-a-tech-person like me haha. overall, good experience. would recommend"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Steen Carstensen",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T01:56:03.000Z",
          "Titre": "It was very straight forward to rent…",
          "Contenu": "It was very straight forward to rent through their website. Hope the actual rental experience will go just as smoothly."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Alexander Alcántara",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T22:32:07.000Z",
          "Titre": "Good service!",
          "Contenu": "It is the first time that I use this platform to rent a vehicle in another country. And I have been pleasantly satisfied with the quality of service and precision in everything that is offered. I will definitely return to Rentcars in a next opportunity."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Forastiere",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T22:06:08.000Z",
          "Titre": "Makenna was great!",
          "Contenu": "Makenna was great!Wonderful staff were very flexible with pickup and dropoff!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "claudia gm",
          "Nb_Reviews": 2,
          "Date": "2023-08-29T23:26:19.000Z",
          "Titre": "Pick up was easy",
          "Contenu": "Pick up was easy , service , I did not have any issue with the pick up or extras , I called a day before to confirm any extra charge they only charge me the tolls ."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "ADRIANO ANNUNZIO  GAMBIRASI",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T22:48:58.000Z",
          "Titre": "THE ATTENCION",
          "Contenu": "SAMPLE THE RESERVECION AND GOOD"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Carlos Rodrigo",
          "Nb_Reviews": 3,
          "Date": "2023-08-20T19:31:19.000Z",
          "Titre": "Sicily By car is nice company",
          "Contenu": "Sicily By car allowed me to rent a car without having PID.Sales rep called Sara was a very pleasant person.I would consider this company next time i will return to Italy"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "B Quist",
          "Nb_Reviews": 4,
          "Date": "2023-11-14T10:44:48.000Z",
          "Titre": "Good website",
          "Contenu": "Good website,  clear contact and nice offers. Eu gosto rentcars."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Heitor Augusto",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T16:49:50.000Z",
          "Titre": "Easy to use",
          "Contenu": "Easy to compare options, very good rates and all worked very nice. Sure will use Rentcars again in the future."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Paul Boomer",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T18:47:09.000Z",
          "Titre": "Collected car from Waygo",
          "Contenu": "Collected car from Waygo, quick, easy with helpful staff. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cheryl",
          "Nb_Reviews": 3,
          "Date": "2023-12-02T21:10:34.000Z",
          "Titre": "Excellent price and a great website!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Andres Fonseca",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T21:25:30.000Z",
          "Titre": "Cool",
          "Contenu": "I have been using rentcars for a few years now and have never had any problems. I recommend it if you want peace of mind."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Jaysinh kamalia",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T06:21:27.000Z",
          "Titre": "Company is very good and service…",
          "Contenu": "Company is very good and service provided is also good."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Joao Paulo Leme Darcadia",
          "Nb_Reviews": 4,
          "Date": "2023-09-07T21:10:51.000Z",
          "Titre": "The best amongst many other companies",
          "Contenu": "The best amongst many other rental companies. I already hired their services twice and already booked a third one. They have the best price on the market, very simple to book and very practical."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Andrew Gabriel Tabberrah",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T11:46:07.000Z",
          "Titre": "Easy access to rental cars kiosk in CVG…",
          "Contenu": "Easy access to rental cars kiosk in CVG airport. No need to take shuttles unlike in LAX and IAH airports"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Bernadette Teuma",
          "Nb_Reviews": 2,
          "Date": "2023-08-05T11:12:10.000Z",
          "Titre": "Maree was great",
          "Contenu": "Maree was great. She works from Luqa airport in Malta. She was really helpful, esp after the other car hire cancelled our car hire reservation without notice! Thanks Maree you’re a star"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alejandro Ortiz",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T04:22:03.000Z",
          "Titre": "The assigned car was what I expected",
          "Contenu": "The assigned car was what I expected, there is a fee for activate the sun pass of 25 usd and a retention of 200 usd, but it too bad has other companies"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "waqas fatima",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T08:34:29.000Z",
          "Titre": "Rentcars.com Review:good experience",
          "Contenu": "Rentcars.com Review:I recently used Rentcars.com for a car rental during my vacation, and I was pleasantly surprised by the overall experience. Here are the key highlights of my experience with Rentcars.com:1. User-Friendly Website: Rentcars.com has a user-friendly website with an intuitive interface. It was easy to navigate, and I was able to find the information I needed quickly.2. Wide Selection of Vehicles: I was impressed with the vast selection of vehicles available for rental. Whether you need a compact car for city exploration or a spacious SUV for a family trip, Rentcars.com offers a variety of options to suit different preferences and budgets.3. Competitive Prices: Rentcars.com provided competitive rental rates. I compared prices with other rental platforms, and Rentcars.com offered a good deal that was within my budget.4. Convenient Booking Process: The booking process was straightforward and hassle-free. I appreciated the clear and transparent rental terms and conditions, which helped me make an informed decision.5. Excellent Customer Support: I had a few questions about my rental, and the customer support team was responsive and helpful. They were available through multiple channels, including live chat and email.6. Flexible Cancellation Policy: Life can be unpredictable, and it's reassuring to know that Rentcars.com offers a flexible cancellation policy. I had to make a change to my reservation, and the process was smooth and accommodating.7. Partnered Rental Companies: Rentcars.com partners with reputable car rental companies, which gave me peace of mind knowing I would be dealing with established and trusted providers.Overall, my experience with Rentcars.com was positive. The booking process was convenient, the prices were competitive, and the customer support was reliable. I would recommend Rentcars.com to anyone looking for a hassle-free and cost-effective car rental experience."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Rajanikant Vaishnav",
          "Nb_Reviews": 3,
          "Date": "2023-12-03T21:00:39.000Z",
          "Titre": "The world greate company my ferve"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jaime Neftali Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T18:28:46.000Z",
          "Titre": "The experience was so good!",
          "Contenu": "The experience was so good!The aditional insure for avoid extracost with the car rental companies is an extraoodinary idea - I just have doubts about how it¨s going to operate on my next car rental."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ana Torres",
          "Nb_Reviews": 1,
          "Date": "2023-07-21T13:39:26.000Z",
          "Titre": "Efficient",
          "Contenu": "The booking experience was quick, clear & great overall. Prices were fair and there were several options to choose from in the website."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Ma. Gpe. Sanchez",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T23:02:06.000Z",
          "Titre": "Easy and convenient",
          "Contenu": "It was easy to make a booking and when I needed to cancel a reservation, it was possible with only one click."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Gabriel",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T04:44:22.000Z",
          "Titre": "Best place to compare",
          "Contenu": "Using the rentcars.com made my life easier to compare between companies and finding the right deal for me."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Gerson Silva",
          "Nb_Reviews": 3,
          "Date": "2023-08-05T13:16:02.000Z",
          "Titre": "Team was very helpful",
          "Contenu": "Team was very helpful, kind with much attention to my situation. They offered me quite good alternatives to solve it."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "CARLOS ZANINI",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T04:06:15.000Z",
          "Titre": "Above Car",
          "Contenu": "ease of picking up the above car, as the rented one was not available"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Pedro",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T00:43:23.000Z",
          "Titre": "Great to compare prices and find best option",
          "Contenu": "Great to compare prices and find best option. After doing all the process thru Rentcars, everything ran smoothly."
        },
        {
          "Note": 5,
          "Lieu": "CO",
          "Pseudo": "Olga Lopez",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T22:03:31.000Z",
          "Titre": "It was very easy to contract",
          "Contenu": "It was very easy to contract, the page is quite friendly to the end user.Rent with the Provider: Confort Rent a Car"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Luiz Henrique Santana",
          "Nb_Reviews": 10,
          "Date": "2023-09-08T10:29:48.000Z",
          "Titre": "All good",
          "Contenu": "They provide a very good service by comparing the prices and the emiting a voucher that's easily used."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "vinicius",
          "Nb_Reviews": 1,
          "Date": "2023-10-29T19:10:57.000Z",
          "Titre": "Rate 10/10",
          "Contenu": "Quick service, clean car and they do not force you to buy extras/upgrades."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Jorge Yoshinobu",
          "Nb_Reviews": 6,
          "Date": "2023-11-11T17:49:22.000Z",
          "Titre": "Check in e check out agilizado",
          "Contenu": "Check in e check out agilizado, atendentes prestativos."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "José Amauri",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T04:08:20.000Z",
          "Titre": "I had no issues to pick up the car and…",
          "Contenu": "I had no issues to pick up the car and to reuturn too, the team was super friendly and helpfull.A big thank you forTim (SFO) and Jina (LA)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Pia Anglesio",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T08:42:58.000Z",
          "Titre": "It’s safe",
          "Contenu": "It was great. We rented on Alamo through this page. It was cheapier than alamo and gave us the option to deliver the car in a diferent location. It’s safe!"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Perry Patraszewski",
          "Nb_Reviews": 11,
          "Date": "2023-10-27T15:36:45.000Z",
          "Titre": "Customer service of this company has…",
          "Contenu": "Customer service of this company has been really helpful , a breath of fresh air in comparison to “can’t do” attitude of other companies offering car rentals."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacqueline",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:51:47.000Z",
          "Titre": "La atencion amable y eficiente"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Sharon Logan",
          "Nb_Reviews": 3,
          "Date": "2023-08-16T01:32:39.000Z",
          "Titre": "Excellent company",
          "Contenu": "Web page simple to use great value car prices and excellent communication through emails"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jose Luis Olvera Mendoza",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T20:24:54.000Z",
          "Titre": "ALL IS VERY QUICK AND ATTENTION EN CALL…",
          "Contenu": "ALL IS VERY QUICK AND ATTENTION EN CALL CENTER WAS EXCELENT, TANKS"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jose Luis Castillo",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T21:41:15.000Z",
          "Titre": "Clear information",
          "Contenu": "Clear information, good prices. I hope I don't have any problems at the counter with the insurance."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Sergio",
          "Nb_Reviews": 2,
          "Date": "2023-09-27T23:45:01.000Z",
          "Titre": "Rent a car is really easy…",
          "Contenu": "Rent a car is really easy and the platform has some good opportunities.."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "CARBONI",
          "Nb_Reviews": 10,
          "Date": "2023-08-20T15:05:48.000Z",
          "Titre": "A useful tool!",
          "Contenu": "I did not know the website, got the suggestion by the hotel and tried… very easy and very fast indeed!!"
        },
        {
          "Note": 5,
          "Lieu": "CH",
          "Pseudo": "ANA PAULA",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T12:58:41.000Z",
          "Titre": "Easy and fast",
          "Contenu": "It was easy and fast, no complications!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karel Wendl",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T14:55:55.000Z",
          "Titre": "Karel's Rental",
          "Contenu": "Yes, It was a very good experience renting my car with Rentcars in Brazil"
        },
        {
          "Note": 5,
          "Lieu": "AT",
          "Pseudo": "Xianping Wang",
          "Nb_Reviews": 1,
          "Date": "2023-08-31T06:33:58.000Z",
          "Titre": "Clear structured interfaces and easier…",
          "Contenu": "Clear structured interfaces and easier handling to find what the customer wants.Confirmation and payment conditions are convenient.A well done job."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Carol Bennett Bennett",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T14:46:07.000Z",
          "Titre": "The website was easy to navigate.",
          "Contenu": "The website was easy to navigate.Good prices."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Nestor Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T16:27:51.000Z",
          "Titre": "the process is fast and very easy to…",
          "Contenu": "the process is fast and very easy to do, plus there are no hidden fees."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "j man",
          "Nb_Reviews": 2,
          "Date": "2023-10-30T16:59:42.000Z",
          "Titre": "Quick contract time when picking up and…",
          "Contenu": "Quick contract time when picking up and clean car.  Easy return as well"
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "LUIS ALBINO  RODRIGUEZ OPAZO",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T13:34:47.000Z",
          "Titre": "Excellent…now",
          "Contenu": "Excellent…now, we are very very interesting being to travel next year"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Legend",
          "Nb_Reviews": 1,
          "Date": "2023-09-12T20:39:19.000Z",
          "Titre": "Easy to use and fast   Great…",
          "Contenu": "Easy to use and fast   Great availability of vehicles for family trips highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "AA",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T12:20:06.000Z",
          "Titre": "It was easy pick up and got an upgraded…",
          "Contenu": "It was easy pick up and got an upgraded car on the day without paying any extra."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jeanene Carvajal",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T23:57:21.000Z",
          "Titre": "Great selection and prices",
          "Contenu": "Great selection and prices. Included insurance is very important."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Pablo Andres  Vallejo Rengifo",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T23:04:49.000Z",
          "Titre": "They have a good number of options…",
          "Contenu": "They have a good number of options according to the needs"
        },
        {
          "Note": 5,
          "Lieu": "PT",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T12:23:04.000Z",
          "Titre": "Rentcars is always my first choice!",
          "Contenu": "Rentcars is always my first choice when renting cars :)"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Alejandro Carrillo Alfaro",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T05:04:02.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, very friendly and clear the training"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Farah Tahir",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T14:13:20.000Z",
          "Titre": "Nice experience,",
          "Contenu": "User friendly app and website.For cancellation also no issue"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Victor Alejandro Suarez",
          "Nb_Reviews": 1,
          "Date": "2023-07-27T18:07:48.000Z",
          "Titre": "Very very good prices and very easy to…",
          "Contenu": "Very very good prices and very easy to get car that you want , I rent 2 cars on my trip to Colombia , thanks !!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Obenauer Bussert",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T10:16:36.000Z",
          "Titre": "Fast",
          "Contenu": "Fast, clear & good booking experience overall. Prices are fair"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Joseph Murat",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T00:40:09.000Z",
          "Titre": "Found a better deal than the other…",
          "Contenu": "Found a better deal than the other comparison site I used."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "CARLOS  FELIX",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T00:41:21.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, just what I asked for ( the car).Excellent"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Mohamed El Alami",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T23:49:56.000Z",
          "Titre": "User friendly website as well as the…",
          "Contenu": "User friendly website as well as the price is very competitive"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jose Manuel Tovilla m",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T05:23:53.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, Clear, good options. No other unexpected charges"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Javier Garcia",
          "Nb_Reviews": 2,
          "Date": "2023-10-10T22:11:29.000Z",
          "Titre": "It was easy to to the…",
          "Contenu": "It was easy to to the reservation,friendly wweb page."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "MAURO MORA",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T01:17:52.000Z",
          "Titre": "SERVICE AND SIMPLICITY IN TE PAGE",
          "Contenu": "SERVICE AND SIMPLICITY IN TE PAGE, GREAT OPTION!"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Carlos Crasto",
          "Nb_Reviews": 4,
          "Date": "2023-10-17T02:20:54.000Z",
          "Titre": "Very practical and easy to use website."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Romaisa Liaqat",
          "Nb_Reviews": 1,
          "Date": "2023-07-22T04:52:49.000Z",
          "Titre": "Rentcar is a best app for the world its…",
          "Contenu": "Rentcar is a best app for the world its an emergency use urgently"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Basil Melnyk",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T19:34:54.000Z",
          "Titre": "Easy to reserve an auto"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Raul Humberto  Valdez Cuellar",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T18:32:19.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, I would gladly rent at this agency again, Valeria's attention was excellent"
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Antonio Carlos",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T14:57:02.000Z",
          "Titre": "Very good service and price",
          "Contenu": "Very good service and price! I strongly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RAUL  ORTA",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T22:21:00.000Z",
          "Titre": "BEST CAR PRICE OF ALL SITES.",
          "Contenu": "JUST HAVE TO LOOK AND COMPARE AND YOU WILL SEE WHAT I MEAN!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Ignacio Sanchez Gavito",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T15:20:23.000Z",
          "Titre": "Very easy to nagivate",
          "Contenu": "Easy to make my reservation and add extras"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert Cristia",
          "Nb_Reviews": 2,
          "Date": "2023-08-20T01:34:53.000Z",
          "Titre": "Ease of booking",
          "Contenu": "Ease of booking and the right price to make the trip enjoyable. .."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Karim Lima",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T00:03:04.000Z",
          "Titre": "Mais barato que no local e pouca…",
          "Contenu": "Mais barato que no local e pouca burocracia"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "REGINALDO S VEAS",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T23:16:23.000Z",
          "Titre": "The car reservation",
          "Contenu": "The car reservation was quick, and easy to do!!"
        },
        {
          "Note": 5,
          "Lieu": "AW",
          "Pseudo": "JORGE JIMENEZ",
          "Nb_Reviews": 2,
          "Date": "2023-07-22T17:15:37.000Z",
          "Titre": "FAST & EXCELLENCE SERVICE",
          "Contenu": "FAST & EXCELLENCE SERVICE, JIMMY IS YOUR GUY."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Vanessa Valadez",
          "Nb_Reviews": 2,
          "Date": "2023-09-19T16:45:43.000Z",
          "Titre": "Easy",
          "Contenu": "Easy , fast , good price and amazing experience"
        }
      ]
    }
  ]
}