{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "repairpartsinc.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kristopher Kelley",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T05:56:41.000Z",
          "Titre": "I usually never complain about anything…",
          "Contenu": "I usually never complain about anything but I will about this. I ordered my part almost 2 weeks ago and I have yet to receive it yet. It has been all around my delivery location but has yet to make it to my house. I will make sure to never order from here as the 3-5 business day shipping is a lie."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JoAnna Cockrell",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T22:39:48.000Z",
          "Titre": "The heating element sparked and shorted…",
          "Contenu": "The heating element sparked and shorted out the entire oven range. The information was relayed to repair parts via their \"contact us\" page. I asked for a refund and I have not been contacted by them regarding this issue."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Donald Carter",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T19:10:29.000Z",
          "Titre": "I ordered a part and waited and after 3…",
          "Contenu": "I ordered a part and waited and after 3 days USPS was still waiting for package so I contacted you and was told another one was shipped out 2 day priority mail and I checked again and USPS is still waiting for the package so I asked for a full refund and was told I had to wait and see if order shows up"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ds",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T14:49:39.000Z",
          "Titre": "I'm glad I saved all the original…",
          "Contenu": "I'm glad I saved all the original parts, bc it definitely wasn't all the right parts. Tracking is stupid with this company and eith them being aware of it, they would rather be rude/smart about it then understand the issue. I'd definitely find a different company to buy from!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Upton",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T21:42:46.000Z",
          "Titre": "Delivery time terrible",
          "Contenu": "The delivery took 20 days from time of order for a part that was in stock. Ordered on June 27th, received on July 17th. After the delay in receiving the part, the package was received damaged. I've yet to determine if the part is OK."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Margaret Ortega",
          "Nb_Reviews": 1,
          "Date": "2023-03-17T16:13:58.000Z",
          "Titre": "I’m very dissatisfied with the kind of response and no action to respond to my problem",
          "Contenu": "I’m very dissatisfied with the kind of service I have received. Two weeks ago I received from you a damaged range burner. I contacted someone and he asked that I send pictures of the damaged item, which I did. To date I have not heard from anyone how to return it and refund me the full payment. Margaret Ortega"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T22:21:09.000Z",
          "Titre": "Bad instructions so useless part",
          "Contenu": "This is either the wrong part or the instructions aren’t good. The steps described aren’t clear and don’t have diagrams to help confirm what to doIt says to cut the tubes on the fridge which doesn’t make sense since there isn’t a way to grip and hold the tubes. Suggestion is basically to ruin fridge side which if it’s wrong, your problem is more costly"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas Lundgren",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T00:50:00.000Z",
          "Titre": "Item name:\t36TX16-RP1354",
          "Contenu": "Item name:\t36TX16-RP1354Item description:\tCompatible For 36TX16 Furnace Thermostat Manual ResetItem number:\t110094Quantity:\t2They trip at a lower temperature than the originals.  I can't use them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric Empson",
          "Nb_Reviews": 2,
          "Date": "2022-10-29T04:21:11.000Z",
          "Titre": "They sent a bad part and didn't remedy…",
          "Contenu": "They sent a bad part and didn't remedy it! Also it was extremely hard to figure out what the shipping date was? Bad website parts from China probably my fridge started smell like it like it was burning after the part was installed."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Freddie Carlisle",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T00:18:55.000Z",
          "Titre": "Still have not received my spring",
          "Contenu": "Still have not received my spring. Would never use you again or recommend your company to anyone else. Today is April 5."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Peter Travers",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T21:37:02.000Z",
          "Titre": "The instructions are pathetic",
          "Contenu": "The instructions are pathetic. Spent extra money for this product and can’t even see the pictures on the instructions"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Craparo",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T19:14:11.000Z",
          "Titre": "The item did not fit properly the lent…",
          "Contenu": "The item did not fit properly the lent does not catch right I would have returned it but I needed a lent basket."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Not ok",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T16:01:05.000Z",
          "Titre": "Not the right part for the freezer…",
          "Contenu": "Not the right part for the freezer despite the correct part number. Connection was wrong."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T14:18:44.000Z",
          "Titre": "Defective part",
          "Contenu": "Defective part, doesn't work. Preparing package to ship back at my expense, hopeful for a refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dan Lyons",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T15:40:27.000Z",
          "Titre": "Part didn’t quite match up couldn’t get…",
          "Contenu": "Part didn’t quite match up couldn’t get a hold of nobody to get it fixed. Didn’t leave a phone number that I could call."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mark Kretsch",
          "Nb_Reviews": 1,
          "Date": "2022-12-29T19:47:32.000Z",
          "Titre": "They do match the original",
          "Contenu": "They do match the original.  They are 90 degrees out, so they do not line up correcly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Glenn Campbell",
          "Nb_Reviews": 1,
          "Date": "2023-10-14T22:25:10.000Z",
          "Titre": "I never received the part I ordered."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Curtis",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T16:20:24.000Z",
          "Titre": "I received a different part than…",
          "Contenu": "I received a different part than ordered without notice or explanation."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Page",
          "Nb_Reviews": 2,
          "Date": "2022-09-04T20:44:39.000Z",
          "Titre": "I give a 1 star because FOUR days after…",
          "Contenu": "I give a 1 star because FOUR days after i placed my order, i received the call to tell me that despite what i saw online, they didn't have this product in store & was on extended backorder (2+ months). Then, the lady asked if i wanted to wait on the back order....I don't know about the rest of you, but if I am ordering a part to fix something, I don't want to wait 2 months before getting a chance at getting it. So, yes, I requested a cancellation of my order."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joseph Shanholtzer",
          "Nb_Reviews": 3,
          "Date": "2023-08-28T03:43:26.000Z",
          "Titre": "Knob was for this model",
          "Contenu": "Knob was for this model, knob hole for shaft was too large 💩"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Manuel Sosa",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T01:00:11.000Z",
          "Titre": "I ordered a drain pump for my LG…",
          "Contenu": "I ordered a drain pump for my LG dishwasher and I received a thermostat instead. I received an email today from director of sales stating the part I ordered is on its way. Let’s hope this time is the correct one."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Julien Hong",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T01:09:54.000Z",
          "Titre": "Wrong item",
          "Contenu": "Hello, I needed a new drive belt for my dryer (Bosch Axxis , WTA4410US). After I entered the reference number, I ordered the item from the list of parts suggested. Unfortunately the drive belt is way too small."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john dillivan",
          "Nb_Reviews": 1,
          "Date": "2022-07-14T04:18:03.000Z",
          "Titre": "Impartial shipping with parts",
          "Contenu": "If you're going to order the part or the part kit you want to make sure all the pieces are together not partially packaged. Because then now I have to call and get it tracedown for the rest of the part with delayed me from completing my job. Which cost me 250 bucks because I didn't have the right part and the delay time is what got me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roberta C.",
          "Nb_Reviews": 1,
          "Date": "2022-08-14T19:12:21.000Z",
          "Titre": "I ordered two parts and neither part…",
          "Contenu": "I ordered two parts and neither part fit. I sent an email and later received a response which said to call. I called and had to leave a message since no one answered. I still have not received a call back or a resolution."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Charles Miller",
          "Nb_Reviews": 1,
          "Date": "2022-08-22T04:34:14.000Z",
          "Titre": "Received part & installed",
          "Contenu": "Received part &instslled, check getting power.  Does not work.  Replaced ice maker, checked all line water coming thru but no ice.  Food freezing in freezer but still no ice.  ? Do next."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T01:11:32.000Z",
          "Titre": "We have not received the part yet",
          "Contenu": "We have not received the part yet.  Over a week late.  Not very pleased."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ghiocel musca",
          "Nb_Reviews": 1,
          "Date": "2022-05-02T04:14:24.000Z",
          "Titre": "The part is not the same as pictured",
          "Contenu": "The part is not the same as pictured. Is not same product as on the picture. I can buy 3 of this  product on Amazon at the price of one on this website. The part worked one day and got broken."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2022-04-06T15:38:17.000Z",
          "Titre": "I never received the package",
          "Contenu": "I never received the package.  I called the company, and they told me to contact USPS.  USPS told me they could not confirm whether the package was delivered to my address or another address."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ben & Kim West",
          "Nb_Reviews": 2,
          "Date": "2022-04-06T22:21:24.000Z",
          "Titre": "Poor customer support.",
          "Contenu": "Received incorrect item due to my error.  Immediately contacted support to return at my expense and was never contacted.  I have two wonderful filters that will not work for my fan."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Philip Mcqueen",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T02:05:39.000Z",
          "Titre": "was sent the wrong part."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ann Christopoulos/Steve",
          "Nb_Reviews": 1,
          "Date": "2022-04-15T21:12:33.000Z",
          "Titre": "defective part 2nd one from 2 different busimesses.",
          "Contenu": "defective part. Igniter small crack.  Dropped in shipping? Bought one elsewhere in in my state that was mailed me first. Both igniters I had shipped were cracked from 2 different mail order places. Never again. No wonder the prices were cheap. I am not spending money anymore on the \"cheaper\" mail order parta. Why do your \"review\" guidelines say to \"play nice\", no language, etc.????  I Cant write a bad review if I am upset over 2 broken parts from 2 different company's?This entire country is going to crap and no one has any conscience of how they run a business. Don't ask me where my part is. I threw it in the street, because that's the way I am when I hey jammed, albeit only once from your company, but unfortunately, you were the second time in 10 days.Have a nice day. I am sure it isn't anyone's particular fault."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Lucia Bain",
          "Nb_Reviews": 1,
          "Date": "2022-07-08T06:35:41.000Z",
          "Titre": "I ordered this item on June 29 2022",
          "Contenu": "I ordered this item on June 29 2022, It was suppose to arrive on July 3 2022 today is July 7 2022 AND MY item is still not here. Not happy"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2022-06-12T18:32:23.000Z",
          "Titre": "Bad fit",
          "Contenu": "The part though the right one was to loose and wouldn't grip the prong tight enough to turn it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rhonda M",
          "Nb_Reviews": 1,
          "Date": "2022-05-24T23:17:56.000Z",
          "Titre": "This burner dial did not fit and would…",
          "Contenu": "This burner dial did not fit and would not slide on the prong no matter how hard I tried."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Martha Ray",
          "Nb_Reviews": 4,
          "Date": "2022-04-13T23:42:06.000Z",
          "Titre": "Was sent the wrong product",
          "Contenu": "Was sent the wrong product, total waste of my time and money."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jesus Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T01:23:45.000Z",
          "Titre": "Wrong part",
          "Contenu": "Wrong part I thought it was the right one for the model"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Collins",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T23:07:31.000Z",
          "Titre": "Did not get it yet"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2022-06-02T15:11:45.000Z",
          "Titre": "Have yet to receive my order (2 months…",
          "Contenu": "Have yet to receive my order (2 months now)"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jean Skufza",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T23:24:11.000Z",
          "Titre": "Both igniters were damaged and i cannot…",
          "Contenu": "Both igniters were damaged and i cannot get anyone to respond to me about what i have to do"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Edward Williams",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T03:10:39.000Z",
          "Titre": "Good price on the part quick shipping…",
          "Contenu": "Good price on the part quick shipping unfortunately the problem was not resolved. Trouble shooting guides didn't pinpoint the problem I can't afford to buy everypart for an ice maker swapping them out and still no ice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Church",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T23:43:40.000Z",
          "Titre": "I asked that the package be sent…",
          "Contenu": "I asked that the package be sent signature required/do not leave. This request was complete ignored. If this was something you can not do you should not have shipped it without contacting me first.The part is fine but only because I was lucky to be home when the package arrived."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jesse Greenough",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T02:00:33.000Z",
          "Titre": "Compressor relay did not work …",
          "Contenu": "The relay didn’t work but the capacitor did. The capacitor is what I needed so at the end of the day what I got worked I just paid extra for something that doesn’t work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Eric Empson",
          "Nb_Reviews": 2,
          "Date": "2022-10-15T02:12:36.000Z",
          "Titre": "No response from company or way to call to check your order",
          "Contenu": "There was no way to look up whether I purchased or not it was kind of a budget website. No way to look up the tracking. Tracking number but no way to respond to the company! Very unprofessional. Not happy. Plus the part didn't work go figure"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Diego Turgano",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T18:52:41.000Z",
          "Titre": "Use the part once and burnt right away",
          "Contenu": "Use the part once and burnt right away. Waste of money because I can’t return it anymore."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Thomas Balistrieri",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T01:28:32.000Z",
          "Titre": "Wasn’t the correct dial for the oven I…",
          "Contenu": "Wasn’t the correct dial for the oven I described"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Martk Smith",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T20:55:16.000Z",
          "Titre": "The part didn't work",
          "Contenu": "The part didn't work.  I don't know if it was the wrong setting or what.  The oven heated up to 120 degrees and shut off.  The part didn't work."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Danny Aldred",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T18:32:55.000Z",
          "Titre": "wrong part it could not hook up to old…",
          "Contenu": "wrong part it could not hook up to old conection"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Clella",
          "Nb_Reviews": 3,
          "Date": "2022-04-06T14:36:17.000Z",
          "Titre": "Part and shipping were too expensive",
          "Contenu": "Part and shipping were too expensive. The part was a small dishwasher rinse dispenser cap that cost close to $30 and shipping was close to $11. Granted, the cost was similar to other sites I visited but the least that could have been provided was free or low cost shipping. The web site was easy to use as opposed to other sites. I haven't received the part and the shipping cost was the \"economy\" option. To get it sooner I would have had to pay close to $50 which is crazy for a part that is about the size of a 50 cent piece."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "C L G",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T09:46:24.000Z",
          "Titre": "Connections did not match"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marcia Black",
          "Nb_Reviews": 1,
          "Date": "2022-05-08T16:52:43.000Z",
          "Titre": "You shipped a breakable part in a…",
          "Contenu": "You shipped a breakable part in a plastic bag with now packing material. Part arrived broken. You are sending a new one, but they are not in stock so I won't get it for 3 to 4 weeks!!! It's my dishwasher too!! Grrrr"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Richard Breithaupt",
          "Nb_Reviews": 5,
          "Date": "2022-06-02T19:03:43.000Z",
          "Titre": "The fill cup did not fit into maker.",
          "Contenu": "The fill cup provided by you would not fit into the ice maker provided by you. I had to file the plastic mount point until it fit. Have not created any ice so far but I will update this review then."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom K.",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T23:01:17.000Z",
          "Titre": "Improperly packaged",
          "Contenu": "Improperly packaged. Timer motor cover was crushed in transit. Was able to remove cover and repair.  Ten cents worth of bubble wrap could have avoided this  and given you a 5 star rating from me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Burrell Palmer",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T23:50:39.000Z",
          "Titre": "No gasket",
          "Contenu": "The diverter valve i ordered arrived on time and was the exact part, came with disc and lube. I was bummed that the shaft gasket was not included, but lubed the shaft and installed the valve using the old gasket and it all worked out fine, for now.....i just have a ticking time bomb. Hopefully i can buy the gasket as a single piece in the future."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Shaun Howard",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T17:30:42.000Z",
          "Titre": "The part was slightly different on the…",
          "Contenu": "The part was slightly different on the hook ups the pipe hook ups was a different size from original part"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gary N",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T22:40:03.000Z",
          "Titre": "Part arrived in excellent condition",
          "Contenu": "You got the part to me quickly and in good shape.  Unfortunately I needed to return it in brand new condition.  Paying a re-stocking was unexpected and not a pleasant surprise.  I guess that is why so many do business with Amazon who would have refunded my money completely.  Otherwise all my contacts with Air Filter Factory were positive.  Kenny was excellent."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Judd Martin",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T16:33:43.000Z",
          "Titre": "Love the ordering and shipping",
          "Contenu": "Ordering was easy and the product seems decent of quality. The only issue is half of the ice cubes that are made are not full ice cubes, they are hollow."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-12-10T16:31:59.000Z",
          "Titre": "I thought I was getting a direct…",
          "Contenu": "I thought I was getting a direct replacement temp sensor for my range. What arrived was a so called compatible sensor. My range is a Gemini unit and has had a fault code of F1-1. When I installed the sensor the initial reading was 210 degrees and began to climb quickly. The sensor is not compatible with my range. Unfortunately I had to cut wires on the sensor and now have no recourse to return it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Steve Helmich",
          "Nb_Reviews": 1,
          "Date": "2023-02-11T18:42:22.000Z",
          "Titre": "Order seemed to be ignored for a week…",
          "Contenu": "Order seemed to be ignored for a week till I emailed then was quickly sent though .....and parts were exactly what I wanted for a lot less than other places."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Gabriel Sloane",
          "Nb_Reviews": 1,
          "Date": "2022-08-23T02:59:24.000Z",
          "Titre": "This part did not fit even though I…",
          "Contenu": "This part did not fit even though I provided the model number of the fridge. I believe this was a universal part fitting many brands. It did not fit mine and since I cut the item to fit because it came in sections I imagine that it is not returnable. It also came with no instructions. I'm a smart guy so figured it out, but it is now cut so.....Three stars because its my fault for trying to find the cheapest part. Like OEM parts. Don't skimp on price."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jay farrar",
          "Nb_Reviews": 1,
          "Date": "2022-07-16T02:58:36.000Z",
          "Titre": "One of the quick connect valves to main…",
          "Contenu": "One of the quick connect valves to main water would not seal properly. I used some pipe fit to seal…we will see how long it holds. I already cut the factory lines so can only use quick connectors now."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-05-09T10:44:26.000Z",
          "Titre": "Received product quickly",
          "Contenu": "Received product quickly, however, because of the price increase because these were hard to find, was fine except I did expect it to be in new shape, it was missing one of the \" feet\", I had to use it anyway so I could fix my oven."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T20:24:51.000Z",
          "Titre": "Didn't deliver the part advertised or ordered.",
          "Contenu": "Part delivered was not the part that was advertised or ordered.  I had to modify the mounting brackets to make it work."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark Doughty",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T19:26:29.000Z",
          "Titre": "Parts were not durable and broke after…",
          "Contenu": "Parts were not durable and broke after installation!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Eddie",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T05:01:42.000Z",
          "Titre": "Reasonable price quick to ship",
          "Contenu": "This site gave me most confidence in my replacement element working with oven.  Other websites weren’t easy to match up.  Great job.  Arrived quickly, ordered Tuesday night and had received it by Saturday. Price was very reasonable, especially compared to GE site. Only negative is that the shipping tracking information was not updated. So never knew when it was to arrive.  Product does work good though."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Techy",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T16:48:24.000Z",
          "Titre": "As a replacement for 5 crescent…",
          "Contenu": "As a replacement for 5 crescent Whirlpool ice maker, service and price was ok. One plastic tab that holds the ice “slide” that channels crescents into door dispenser was broken off. That tab was present in the packaging, so it broken in transit or warehouse. It is kind of a pain to have to repair the replacement part…. So, only four stars."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "M. Klein",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T00:30:34.000Z",
          "Titre": "Part arrived quickly, nice value!",
          "Contenu": "Part arrived quickly.  Didn't seem to be the same quality as the OEM but it does work!  The funnel for where the water drops into the icemaker is considerably but it seems fine as not seeing drips.  Making ice again at 1/2 the price of the OEM parts.  Directions were good not great.  Used an YouTube video instead.  Would buy again, nice overall value."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PETER E ALISON",
          "Nb_Reviews": 3,
          "Date": "2022-12-05T20:28:10.000Z",
          "Titre": "Replacement Magnetron for Panasonic Microwave Oven",
          "Contenu": "Purchased a magnetron for my older Panasonic Microwave. The new part was defective, so I had to return it. A replacement was sent to me, and it is working fine. The part looks well made; it is a perfect fit for the original component. I would have awarded 5-stars if the original part had worked! The price was competitive, although the fact the RMA did not include return shipping added to my total cost. I like the fact the magnetron came with a new high-voltage diode."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dougie Fresh",
          "Nb_Reviews": 1,
          "Date": "2023-04-15T15:06:41.000Z",
          "Titre": "Got my part fast but there was an issue",
          "Contenu": "I bought a replacement cable for my ice maker because the thermal in-line fuse blew. The new cable wouldn't click into place on the refrigerator end. Was very frustrating. Had to splice the good thermal fuse to the original cable. The cable ends looked very similar and I tried to make it fit several times to no avail."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "GREGG BLAIR",
          "Nb_Reviews": 2,
          "Date": "2023-04-24T21:02:35.000Z",
          "Titre": "The replacement water discharge pump…",
          "Contenu": "The replacement water discharge pump for my KitchenAid dishwasher,  that I purchased from Repair Parts arrived in a few days as expected.  It looks different (improved) from their picture on line and different from original, however it 'plugged' in perfectly and works like new.The one star demerit is because the 'new and improved' pump isn't exactly like the old pump."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T18:14:49.000Z",
          "Titre": "Parts were in good order and arrived…",
          "Contenu": "Parts were in good order and arrived unscathed.  Worked great too.  First order was never received, but we got a credit before it was even due to arrive.  Maybe the post office damaged it?  Don't know & that was a little unsettling, but went ahead a reordered.  Glad we did.  Second order arrived really fast and not via usps.Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dwayne Faw",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T18:18:02.000Z",
          "Titre": "It’s a ton better than my broken one",
          "Contenu": "It’s a ton better than my broken one. Not perfectly straight, and luckily I am able to take the door apart to replace it. Thank you for being the company that carries it so I don’t have to replace a working microwave."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PAUL M.",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T19:59:36.000Z",
          "Titre": "Dishwasher door seal was not an exact…",
          "Contenu": "Dishwasher door seal was not an exact replacement.  It was larger than the original.  Door closed but it took some effort."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hotrodowner",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T10:26:21.000Z",
          "Titre": "My new supplier",
          "Contenu": "Ordering was easy. Shipping update emails were a PLUS!!PRICES are great as well. Will tell my buddies about yall for sure"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Hanna",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T15:53:33.000Z",
          "Titre": "Easy to use site to find part I needed…",
          "Contenu": "Easy to use site to find part I needed only problem was delivery was late"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Duane Bellinger",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T01:51:43.000Z",
          "Titre": "Replacement ice maker",
          "Contenu": "Shipping of the part was efficient.We are having issues with water not going to tray to create ice cubes.Have returned ice maker to the company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "EJ Santa Barbara",
          "Nb_Reviews": 3,
          "Date": "2023-06-17T18:33:00.000Z",
          "Titre": "Parts arrived on time and they fit as…",
          "Contenu": "Parts arrived on time and they fit as advertised - always a good thing when they are not OEM parts!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Rommel V Yanto",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T16:52:53.000Z",
          "Titre": "I ordered 2 pcs",
          "Contenu": "I ordered 2 pcs but 1 just arrived. They ran out of stock. They refunded me for the other part. They even left me a note explaining why? Nice job."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JERRY GARNER",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T05:40:34.000Z",
          "Titre": "Part for refrigerator wasn’t exactly…",
          "Contenu": "Part for refrigerator wasn’t exactly the same but work better than old one"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gavin Webb",
          "Nb_Reviews": 3,
          "Date": "2023-05-01T19:09:03.000Z",
          "Titre": "Part arrived very quickly after…",
          "Contenu": "Part arrived very quickly after expediting the order for UPS ground"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Joshua Parker",
          "Nb_Reviews": 2,
          "Date": "2022-12-14T22:12:18.000Z",
          "Titre": "Part shipped quickly",
          "Contenu": "Part shipped quickly, and the price was fair. Beggars being choosers, would be nice if the mounting screws came with it."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T07:04:21.000Z",
          "Titre": "Too slow shipping",
          "Contenu": "Wish it would have shipped a day sooner. Had to wait through a long holiday weekend."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Darrin Mack",
          "Nb_Reviews": 2,
          "Date": "2023-01-16T17:24:52.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Fast shipping, had the parts......I wish the pricing would have been a little better, but will come back if needed."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MH",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T00:39:39.000Z",
          "Titre": "Improve time of shipment"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Linda Komorek",
          "Nb_Reviews": 3,
          "Date": "2023-02-13T18:07:34.000Z",
          "Titre": "Service was fine",
          "Contenu": "Service was fine.  Wrong part was ordered. I hope to get a partial refund for sending it back."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "D. Alexander",
          "Nb_Reviews": 1,
          "Date": "2023-05-22T18:59:13.000Z",
          "Titre": "Got our order in very quickly",
          "Contenu": "Got our order in very quickly. worked perfectly. Nicely packaged"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J C Cintron",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T15:05:54.000Z",
          "Titre": "Item arrived well was described well…",
          "Contenu": "Item arrived well was described well and works well with a great Value"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brenda Brown",
          "Nb_Reviews": 1,
          "Date": "2023-06-13T17:14:05.000Z",
          "Titre": "Part came fast",
          "Contenu": "Part came fast, it was well packaged, and no hassels."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ronald ng",
          "Nb_Reviews": 4,
          "Date": "2022-12-21T18:46:30.000Z",
          "Titre": "Easy to process order and received…",
          "Contenu": "Easy to process order and received quickly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ana Reis",
          "Nb_Reviews": 1,
          "Date": "2022-10-17T19:32:42.000Z",
          "Titre": "Good",
          "Contenu": "Very good products got them in reasonable time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VICTOR QUIROZ",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T16:12:30.000Z",
          "Titre": "I got exactly what I was looking for."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Christopher Sjoblom",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T19:06:18.000Z",
          "Titre": "Part was a direct replacement"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave",
          "Nb_Reviews": 2,
          "Date": "2022-06-07T21:19:55.000Z",
          "Titre": "Was contacted by the company after I…",
          "Contenu": "Was contacted by the company after I did not receive the item ordered…they were very accommodating & indicated they would send a replacement for the item that wasn’t received… am satisfied now that the company will rectify the situation"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gregory J Geuss",
          "Nb_Reviews": 2,
          "Date": "2022-04-13T17:53:10.000Z",
          "Titre": "Took a little time to find the model of…",
          "Contenu": "Took a little time to find the model of the Samsung refrigerator but I did find it . Was tricky waiting for the download was ensured if it was gonna be 24 hours later or just took long but eventually it did complete , reasonable price..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T18:54:42.000Z",
          "Titre": "Works for now.",
          "Contenu": "Seems to work ok. China product so time will tell?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary Duell",
          "Nb_Reviews": 4,
          "Date": "2022-04-19T22:34:34.134Z",
          "Titre": "The box arrived opened with one of the…",
          "Contenu": "The box arrived opened with one of the ceramic wire nuts crushed.  Would have been a good idea to tape the box shut before shipping.Other than that, very fast and accurate order."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T17:47:19.000Z",
          "Titre": "Part fit perfectly we needed it after…",
          "Contenu": "Part fit perfectly we needed it after so many years!--hey send me roll of of charcoal filter for expressing my opinion okay-?--probably wont happen but gave it a shot!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Luigi Gomes",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T19:16:43.000Z",
          "Titre": "Compatible Ice Maker replacement",
          "Contenu": "Two part review here.  Chapter 1 - OrderingLocating and ordering the desired part was fairly straightforward and was \"nothing to write home about\".  It works like it should. Chapter 2 - The replacement part (cue sinister sounding organ music)I ordered a replacement Ice Maker (PS1993870) for my GE fridge.  The part was one of those 'compatible' replacement kits which always inspires fear and trepidation to those who have experience replacing things.  Unfortunately this was another one of those cases.  The kit included a plethora of parts to help match a number of different models of existing ice makers and you have to decide what combination works on your fridge.  Depending on the model you're replacing I suspect this will be fairly trivial task. Mine however, was a little more complex due to the design change which required me to research how ice makers actually work (youtube as always is invaluable for this).  With this newfound wisdom, I'm happy to report the replacement part does indeed work for my fridge and now beautifully formed ice is magically appearing again within the confines of my freezer.  Equally important, the maker now knows when the ice bin is full and to call it a day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Miller",
          "Nb_Reviews": 1,
          "Date": "2022-06-04T18:37:42.000Z",
          "Titre": "Good Vendor",
          "Contenu": "Service was quick.  Replacement part works good.  Tracking was a bit off, as I never knew status until package arrived."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Helena Chavarria",
          "Nb_Reviews": 2,
          "Date": "2022-12-27T04:21:02.000Z",
          "Titre": "It had the right part for the machine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kelly Sparks",
          "Nb_Reviews": 1,
          "Date": "2022-05-13T12:33:32.000Z",
          "Titre": "Good service",
          "Contenu": "Good service Good trackingPaid a bit more for priority pack and shipping Overall good service with no issues"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "JOHNNY",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T16:40:25.000Z",
          "Titre": "All went well"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pamela",
          "Nb_Reviews": 1,
          "Date": "2022-04-13T15:42:10.000Z",
          "Titre": "Easy peazy!",
          "Contenu": "Easy peazy!  Fits perfect!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vito R.",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:46:44.000Z",
          "Titre": "Excellent Customer Service!!!",
          "Contenu": "Excellent Customer Service!!!Ran into a problem and they took care of it IMMEDIATELY and shipped me anew part out that day. AWESOME!Don’t hesitate to order from them, Good People 🤝"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sue",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T17:37:44.000Z",
          "Titre": "Great source for replacement parts'",
          "Contenu": "Great source for replacement parts' The only small problem was that we paid for faster shipping and it took longer than we thought it would to receive the part. Eventually came by snail mail."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Martin Fensterstock",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T21:33:56.000Z",
          "Titre": "Fast shipping",
          "Contenu": "Part shipped right away and was a perfect replacement for broken one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Enrique Vallejo",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:47:17.000Z",
          "Titre": "Thank you",
          "Contenu": "So the part that I thought was never sent. Was a complete misunderstanding but regardless they sent me a replacement part and sent it over quickly! They replied to my concern within the same day and made my request feel urgent ! Thank you 😊"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "brian self",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T03:30:56.000Z",
          "Titre": "Loose fitment",
          "Contenu": "Loose fitment. Not exact to original. Made rubbing sound (opened it back up and checked placement) first two runs then sound went away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven Catanzaro",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T18:43:13.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. The part I ordered fit perfectly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 9,
          "Date": "2023-12-05T00:59:33.000Z",
          "Titre": "Rapid and simple service"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Max",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T19:57:47.000Z",
          "Titre": "Easy to order, shipped fast and worked well",
          "Contenu": "Easy to order the correct part, shipped almost immediately, arrived a day earlier than expected, fitted in minutes after receiving it – everything hassle-free"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry",
          "Nb_Reviews": 3,
          "Date": "2023-11-19T10:16:35.000Z",
          "Titre": "After searching for months",
          "Contenu": "After searching for months, this place had exactly what I needed and it was VERY affordable,  arrived very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany Byrd",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T23:21:22.000Z",
          "Titre": "Easy order and great communication",
          "Contenu": "Yours is the only company I found that had the part I needed. It was quick to ship. The part numbers did not match so I contacted the company. I received a quick response assuring me I had the correct part. I was able to easily replace the motor and my refrigerator runs like new. Thank you for an easy order and quick correspondence."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "The Reader of Many Books",
          "Nb_Reviews": 7,
          "Date": "2023-10-30T16:54:35.000Z",
          "Titre": "It was easy to find the part we needed…",
          "Contenu": "It was easy to find the part we needed to repair our dryer. The order quickly came in a few days. The part perfectly fit. We will keep Repair Parts Inc’s contact information handy when we need other parts. We saved several hundred dollars by avoiding a service call and the repairer’s charge for a part. Thank you for the great service and stocking the part we needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Zeph",
          "Nb_Reviews": 2,
          "Date": "2023-11-14T22:59:31.000Z",
          "Titre": "I'd order from here again",
          "Contenu": "Was very pleased that order was filled accurately and sent out right away, on the same day I ordered it. It arrived in my mailbox sooner than expected. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dwight E Erickson",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T00:23:03.000Z",
          "Titre": "Perfect transaction",
          "Contenu": "Shipping was fast received exactly what I ordered exact replacement very happy with the product. Installed it and back up and running! Thank you very much!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Amato",
          "Nb_Reviews": 3,
          "Date": "2023-11-28T07:53:23.000Z",
          "Titre": "Ordering was easy and part arrived on…",
          "Contenu": "Ordering was easy and part arrived on time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Harrison",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T17:44:30.000Z",
          "Titre": "Great Icemaker replacement...couldn't go any smoother.",
          "Contenu": "Shipping was fast, part was as described and of excellent quality. Installed easily and my new ice maker is cracking out ice. Price was very fair and appreciated the free shipping. I'll definitely buy from them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wilson Peralta",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T19:17:59.000Z",
          "Titre": "Item works great",
          "Contenu": "Item works great, delivered 2 days early than expected. Will be buying another for the other side of stove.Samsung DG44-01002A Range Surface Infinite Switch"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Keliiheleua",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T17:44:29.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Three reasons why I gave a 5 star rating: correct part, cost, and received shipment in 3 days!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chinook",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T16:27:36.000Z",
          "Titre": "Great Place",
          "Contenu": "Great Place!  Easy to find the part and easy to order.  Super fast shipping and no tax!  Exactly what I needed!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronald F.",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T00:25:27.000Z",
          "Titre": "Parts in stock and immediately shipped",
          "Contenu": "Ordered a part early in the morning, before open of business, and received an email 8:45 AM that it had already been shipped, with tracking number!.  When the part if for a refrigerator, you don't want any delays, and this company excels."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "darek",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T18:19:59.000Z",
          "Titre": "Great customer service",
          "Contenu": "My experience with this company was made great by the customer service I received. Initially, the young lady I spoke to was not very knowledgeable about the product, but she did find somebody who was and provide me with guidance. She also sent me an email regarding the modifications that had to be made to the new part prior to installation. This was most helpful and made my job successful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Anderson",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T15:41:06.000Z",
          "Titre": "Ice maker",
          "Contenu": "My purchase was fairly priced, and shipment was quick.Item was easy to find online, and was accurately described."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2023-10-25T14:18:59.000Z",
          "Titre": "This is a company that backs their word",
          "Contenu": "I believe that reviews are written to inform the public of your experience that you encounter with the product or service and I have to give Repair Parts Inc a thumbs up. I had ordered a part for my refrigerator  they didn’t waste anytime getting the part out to me, which I really appreciated. I replaced the old part with the new one and it didn’t seem to work. I read the return policy and I decided to bite the bullet and take my losses. I submitted a review based on what I thought was unfair with the return policy. A few days later I got a reply from the Director of sales and he informed me that everything would be taken care of if I wish to continue with the return. I took him up on it and I can’t say enough about the support I received from the people that worked there. I am very grateful and pleased with the outcome. First class operation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah Lanham",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T15:13:02.000Z",
          "Titre": "Just what I was looking for!",
          "Contenu": "I was able to find the parts I needed at a reduced price than other websites and I received them very quickly!  Very satisfied customer and I have the page book marked for future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T17:03:47.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent! Just the part I needed. Delivered quickly... I'll definitely be a return customer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JOSEPH SPENCE",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T17:52:37.000Z",
          "Titre": "This kit had everything I needed",
          "Contenu": "This kit had everything I needed,  and easy instructions to make my task simple. The cos,t saved me a lot I am sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Litteral",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T02:36:30.000Z",
          "Titre": "Received it a just a few days",
          "Contenu": "Received it a just a few days. The part I ordered was the exact replacement for my refrigerator. I will use your company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Polly Killian",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T01:44:33.000Z",
          "Titre": "My Mothers oven is approximately 50…",
          "Contenu": "My Mothers oven is approximately 50 years old.  I honestly didn't think we would find the part we needed.  Not only did we find it, it didn't cost an arm and a leg, and was delivered in 3 working days!!  That doesn't happen much anymore and I for one appreciated it greatly!!  Thank you!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul East",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T17:17:25.000Z",
          "Titre": "quick service",
          "Contenu": "Great service had part I needed showed up before  the expected date will buy furnace parts again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BY",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:17:20.000Z",
          "Titre": "Great seller!",
          "Contenu": "Received product exactly as described, fast, and for a great price!  What more could I want?  Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky Wilford",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T15:20:39.000Z",
          "Titre": "Found What I Needed",
          "Contenu": "Ordering was easy and I found just what was needed.   It was shipped fairly quickly but then sat at the post office for 2 days which isn't Repair Parts fault.I will order again from this company but not be in a big hurry to receive it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Dobbins",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T19:26:58.000Z",
          "Titre": "Perfect match",
          "Contenu": "Part arrived earlier than anticipated and was an exact match replacement belt for the dryer saving me $500-$700 on a new dryer"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Theresa Hintz",
          "Nb_Reviews": 2,
          "Date": "2023-10-16T18:02:52.000Z",
          "Titre": "The ice maker fit perfectly in ny…",
          "Contenu": "The ice maker fit perfectly in ny Whirlpool fridge. This was so much cheaper than buying from a local company or a new fridge. Granted my fridge is 13 years old but it still woks great other than the ice maker. We now have ice again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sherry",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T16:43:17.000Z",
          "Titre": "Old Sears frig needed defrost timer",
          "Contenu": "The search for my refrigerator part was quick and easy. It was an exact replacement for a very old frig.  Many other suppliers had only substitutes. It arrived on schedule. Comparable prices."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pedro Rodriguez",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T00:26:31.000Z",
          "Titre": "The fastest shipping I could’ve asked…",
          "Contenu": "The fastest shipping I could’ve asked for. Great product at an amazing price. I found my new supplier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristen Lewis",
          "Nb_Reviews": 2,
          "Date": "2023-10-18T19:11:36.000Z",
          "Titre": "I was shocked at how quick we received…",
          "Contenu": "I was shocked at how quick we received I received my oven heating element. It was great quality and got the job done! Will definitely order again, if needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Devon Duane",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T13:43:47.000Z",
          "Titre": "The first part delivered was defective",
          "Contenu": "The first part delivered was defective. Called for help and without any trouble at all a new one was sent out directly. Love not having to jump through hoops with an automated voice prompt system. Immediate response and resolve to the problem. Kudos to you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Wehrenberg",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T16:41:36.000Z",
          "Titre": "Parts arrived as promised and were…",
          "Contenu": "Parts arrived as promised and were correct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kiel Lofstrand",
          "Nb_Reviews": 1,
          "Date": "2023-11-13T15:25:04.000Z",
          "Titre": "Quick shipment",
          "Contenu": "Part shipped very quickly and was exactly the right piece to repair my GE dryer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "dale smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T16:24:36.000Z",
          "Titre": "warm and happy",
          "Contenu": "this was easy to find and explained. i had my part in 3 days took 5 mins to install and the savings my locai repair wanted $258.00  to  $277.00 to fix thank you guys."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bob Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T23:24:43.000Z",
          "Titre": "Not a perfect fit, but it worked.",
          "Contenu": "Not a perfect fit, but made it work. Bottom threads were a little different than original,  even though was the same part number.  Price was right."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M J",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T15:27:11.000Z",
          "Titre": "Good price",
          "Contenu": "Good price, fast delivery, and very detailed tracking info. No complaints, really. We simply needed a \"dryer filter thingy\" for our dryer and we got it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Recny",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T00:20:15.000Z",
          "Titre": "The relay that I ordered for my freezer…",
          "Contenu": "The relay that I ordered for my freezer came in record time.  I replaced the old relay with the new one and it worked great and my freezer is running as normal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T02:44:28.000Z",
          "Titre": "Easy to navigate website to find the…",
          "Contenu": "Easy to navigate website to find the part I needed,The cost was good, and the delivery was speedy, though the package got lost on the way. Part worked as intended and seems good quality. Overall pleased with purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Morocho",
          "Nb_Reviews": 2,
          "Date": "2023-11-04T17:34:02.000Z",
          "Titre": "EASY!",
          "Contenu": "Exact replacement at the lowest cost I could find.Very fast delivery!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mitchell Dalton",
          "Nb_Reviews": 1,
          "Date": "2023-08-02T14:37:40.000Z",
          "Titre": "Missing part but immediately corrected.",
          "Contenu": "Initially a part was missing from my order but I merely contacted them and they corrected it immediately sending the missing part. Cheapest cost of parts I have found so far so will look to them again for future purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NOLAN PENNER",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T16:00:27.000Z",
          "Titre": "Just the part needed to get ice back",
          "Contenu": "Just the part needed to get ice back. Old part number took me directly to this replacement. A few adjustments after installation and it was ready to go. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JC",
          "Nb_Reviews": 1,
          "Date": "2023-08-09T03:27:29.000Z",
          "Titre": "Great Service!",
          "Contenu": "Company had the correct parts, reached out to make sure that I had all the help I needed. Ordering was easy to do and had the product moving through the shipping process as fast as possible. It was great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolyn Havard",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T03:18:50.000Z",
          "Titre": "Was looking for a timer for my dryer…",
          "Contenu": "Was looking for a timer for my dryer and they had one with a good price.Ordered it and it was to be delivered in 3 to 5 business days, got it in 4 put it on and it works great. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff Pennell",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T15:25:50.000Z",
          "Titre": "Perfect replacement for my old ice maker",
          "Contenu": "Easy order, fast shipping. Perfect replacement for my old tired ice maker. Would definitely order from them again. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "William Perkins",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T02:04:59.000Z",
          "Titre": "Please with quick delivery",
          "Contenu": "website was easy to use.  Part came in quickly and the order was accurate."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liz Sutton",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T17:36:44.000Z",
          "Titre": "Fast shipping, great service",
          "Contenu": "I ordered a replacement washing mashing motor. The shipping was extremely fast and I installed the part and it is working great. No complaints, great service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Higuera",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T00:33:05.000Z",
          "Titre": "Delivered promptly and works."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Wittenauer",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T13:49:49.000Z",
          "Titre": "I ordered this part on July 8th 2023 to…",
          "Contenu": "I ordered this part on July 8th 2023 to replace the oven igniter. I travel for work majorities of my time and when I’m home I try to get things done. Today, August 5th, 2013, I finally had time to replace the part. I opened the box and found the coils were broken and in pieces in the box. I understand this is most likely the shipping provider but the part wasn’t wrapped in bubble wrap and just laying in the box. Now I have to pay for another part. Idk if I would order from here again unless they send me another part at no cost, wrapped how it should be.8/22/23I would like to add on to my review. My original review was a 1star and I was mad in the moment. I did not expect for this company to do what they did and send me a new one. Stand up company. I apologize for the original review."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jason S.",
          "Nb_Reviews": 5,
          "Date": "2023-07-14T12:02:13.000Z",
          "Titre": "Right Part, Delivered On Time",
          "Contenu": "EXACT PART I NEEDED, DELIVERED IN A TIMELY MANNER.  Was able to successfully replace the evaporator fan in my LG refrigerator, thanks to Air Filter Factory:  accurate part description, helpful cross reference to match part number, and free, timely delivery. Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carroll Butler",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T13:50:38.000Z",
          "Titre": "Refrigerator water inlet valve I…",
          "Contenu": "Refrigerator water inlet valve I purchased works as wellas the factory model, but at less than half the price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J Fouché",
          "Nb_Reviews": 2,
          "Date": "2023-09-08T17:46:10.000Z",
          "Titre": "Great experience",
          "Contenu": "Solenoid was as described and was priced very well.  Performs better than expected, thus far."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brooks",
          "Nb_Reviews": 3,
          "Date": "2023-07-31T19:22:07.000Z",
          "Titre": "Prompt delivery of correct part",
          "Contenu": "Prompt delivery of correct part.  Easy to install.  No reason this one won't last another 16 years."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CarlaK",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T02:47:03.000Z",
          "Titre": "Fast shipping and correct item sent!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tillee",
          "Nb_Reviews": 1,
          "Date": "2023-09-25T14:38:04.000Z",
          "Titre": "4 filters for the price of two,I didn’t…",
          "Contenu": "4 filters for the price of two,I didn’t have to go looking for them and they arrive faster than expected. Thanks you lots"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "T Masden",
          "Nb_Reviews": 2,
          "Date": "2023-08-09T22:52:37.000Z",
          "Titre": "The delivery was fast",
          "Contenu": "The delivery was fast. Free delivery was one of the reasons we ordered from you and the ice maker seemed well made and was easy to install. We got it in quickly and it’s working great 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Austin Beckley",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T14:45:36.000Z",
          "Titre": "Everything was great a big thank you to…",
          "Contenu": "Everything was great a big thank you to Chev he really went over board in helping me. Thank you again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tom Downs",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T19:57:33.000Z",
          "Titre": "Correct part",
          "Contenu": "Correct part. Appears to be good quality. Reasonable price. Shipped and arrived in a very timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Settle",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T23:52:02.000Z",
          "Titre": "The part was an exact match and…",
          "Contenu": "The part was an exact match and included the factory plug unlike others you have to splice and use wire nuts. Whole job took less than twenty minutes. Price was good and shipped quick. Will use again. Thanks,Dave"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DF",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T15:39:43.000Z",
          "Titre": "Part arrived as promised",
          "Contenu": "Part arrived as promised, we installed and have working ice maker again now!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Miguel SARMIENTO",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T00:56:26.000Z",
          "Titre": "The ice maker is a duplicate of the…",
          "Contenu": "The ice maker is a duplicate of the original one that came with the refrigerator when it was new great product awesome price and very fast shipping"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl Plochowietz",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T16:53:01.000Z",
          "Titre": "Quick",
          "Contenu": "Quick, easy, and affordable."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Speed",
          "Nb_Reviews": 2,
          "Date": "2023-09-11T16:50:04.000Z",
          "Titre": "great part,  arrived in a timely manner",
          "Contenu": "part arrived in a timely manner, and worked great, at half the cost of other places.  thanks for providing a good part at a lower price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Monk",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T17:19:31.000Z",
          "Titre": "Thank you everything worked out.",
          "Contenu": "Thank you everything worked out.The part fit and our refrigerator is working again. The part was delivered quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "BURT D YOST",
          "Nb_Reviews": 9,
          "Date": "2023-08-11T02:41:13.000Z",
          "Titre": "Gold strike.",
          "Contenu": "We were looking for a part to make dryer repair kits. small plastic clips. on the internet they were selling for 25.00 per unit. Air Filter sold us a 25 count for just 7.50. what els can we say."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "STEPHEN FREDERICK",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T22:33:51.000Z",
          "Titre": "Fast service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph  H.",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T03:36:55.000Z",
          "Titre": "turbo fan motor for oven",
          "Contenu": "The motor sent to me was an exact replacement!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jimmy Sloan",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T18:12:12.000Z",
          "Titre": "Quick delivery",
          "Contenu": "Quick delivery, reasonably priced, correct part.  It corrected the no hot water in the clothes washer issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed Ferrer",
          "Nb_Reviews": 2,
          "Date": "2023-07-11T00:02:45.000Z",
          "Titre": "Part was perfect",
          "Contenu": "Part was perfect! Fit right in and works like a charm. Never repaired a washing machine before."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis Stom",
          "Nb_Reviews": 1,
          "Date": "2023-09-16T01:59:01.000Z",
          "Titre": "Parts were priced decent n free…",
          "Contenu": "Parts were priced decent n free shipping parts arrived early good job !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Meghann Pickett",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T16:09:16.000Z",
          "Titre": "I have been looking for a replacement…",
          "Contenu": "I have been looking for a replacement knob for my stove for a year and I finally found it here"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "B. Spear",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:24:21.000Z",
          "Titre": "Exceeded expectations.",
          "Contenu": "Easy to order.  Price was great.  Order arrived ahead of schedule."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Nebel",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:00:22.000Z",
          "Titre": "Dryer parts",
          "Contenu": "Parts fit perfect, and actually arrived a day early. Great prices and shipping!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "KCC",
          "Nb_Reviews": 1,
          "Date": "2023-07-11T17:46:14.000Z",
          "Titre": "Easy Oder Process",
          "Contenu": "great customer service…just placed an order, very easy process….thanks !!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carol Bittinger",
          "Nb_Reviews": 2,
          "Date": "2023-07-29T15:33:38.000Z",
          "Titre": "Right part fair price.",
          "Contenu": "I was searching the web for parts for my fridge and found this website. They had the part at a fair price and it looked the same in the picture. I ordered it, it came and fit perfectly. My fridge is working great aga"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Rapp",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T20:30:40.000Z",
          "Titre": "Part is what I needed"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tony Napier",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T23:31:05.000Z",
          "Titre": "I got the part I needed very quickly…",
          "Contenu": "I got the part I needed very quickly and absolutely had no issues!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodney Neiman",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T14:18:46.000Z",
          "Titre": "Good service",
          "Contenu": "The part was what I needed, sent quickly and easy to install."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Connie",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T00:07:45.000Z",
          "Titre": "Prompt response to my order",
          "Contenu": "Prompt response to my order, had the replacement bulb in less than a week!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GiGi Marie",
          "Nb_Reviews": 5,
          "Date": "2023-09-08T21:22:17.000Z",
          "Titre": "The parts were in stock",
          "Contenu": "The parts were in stock. The box was well packaged, shipping was prompt. And now my washing machine works again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Evan Sutton",
          "Nb_Reviews": 3,
          "Date": "2023-10-06T16:37:54.000Z",
          "Titre": "Great company",
          "Contenu": "Product as advertised and shipped lightning fast. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian Lynch",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T11:45:22.000Z",
          "Titre": "My order came within a couple days",
          "Contenu": "My order came within a couple days, very easy to order, good website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gina",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T18:42:34.000Z",
          "Titre": "The right parts",
          "Contenu": "Parts arrived on time and as advertised."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don",
          "Nb_Reviews": 1,
          "Date": "2023-08-24T22:04:50.000Z",
          "Titre": "Need a refrigerator fan motor",
          "Contenu": "I sent Ken the pictures of the  motor I needed and received the motor and adapter plug.Thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "stephen b",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T16:37:31.000Z",
          "Titre": "LG Washer Valve Assy",
          "Contenu": "Aftermarket part for my LG washer fit perfectly and was delivered on time as projected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Teas",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:01:25.000Z",
          "Titre": "Speedy fulfillment …",
          "Contenu": "I got the correct part in less than a week at a very reasonable price.  I would use this company again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bonnie W",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T23:32:26.000Z",
          "Titre": "Whirlpool Thermostat",
          "Contenu": "Received the Thermostat and in stalled, so far so good. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paula Schultz",
          "Nb_Reviews": 3,
          "Date": "2023-08-17T23:40:50.000Z",
          "Titre": "Great Job!",
          "Contenu": "The product received is correct for my dryer and works fine. Shipping was very prompt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen Prusator",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T21:10:11.000Z",
          "Titre": "My order was handled efficiently and…",
          "Contenu": "My order was handled efficiently and received in two days"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T01:13:47.000Z",
          "Titre": "I am very happy with my order",
          "Contenu": "I am very happy with my order. It came on time and there was no hassle."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rod",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T01:50:06.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy Part was correct"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Kunsaitis",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T14:49:37.000Z",
          "Titre": "Quick fulfillment.  Part works great.",
          "Contenu": "Quick fulfillment.  Part works flawlessly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Polly",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T15:18:49.000Z",
          "Titre": "Ordered a part looks",
          "Contenu": "Ordered a part looks like it’s working Saved good amount of money About 5 days getting it I’m satisfied"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Yvonne Yaunk",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T15:45:51.000Z",
          "Titre": "Quick shipping and quality replacement…",
          "Contenu": "Quick shipping and quality replacement part at a great price!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Bagnetto",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T20:26:22.000Z",
          "Titre": "Magnetron was shipped in 1 week and…",
          "Contenu": "Magnetron was shipped in 1 week and worked as advertized."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Liping Zhang",
          "Nb_Reviews": 1,
          "Date": "2023-07-19T03:42:39.000Z",
          "Titre": "I received the parts in good condition",
          "Contenu": "I received the parts in good condition.  I replaced the parts and the washer start to work well."
        }
      ]
    }
  ]
}