{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "retire-it.com",
      "Review": [
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Shawn Downey",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T14:16:18.000Z",
          "Titre": "Everything went great except...",
          "Contenu": "- Everything went great.  Everyone I talked to was professional and courteous.- My only complaint is that the truck did NOT show up during the scheduled time. I was given a 6-hour window and had to reschedule for the following day."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Faye",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T22:32:59.000Z",
          "Titre": "My only complaint honestly was the…",
          "Contenu": "My only complaint honestly was the language barrier between the 2 very nice gentlemen and myself. I don't speak Spanish and they apparently don't speak English .We did manage to get the stuff done but no real paperwork was exchanged so I had to send everything in after.  The guys were great, efficient and very nice , just wish I could have spoken to them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dakota Lake",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T17:20:13.000Z",
          "Titre": "Very easy process",
          "Contenu": "Very easy process. They give you everything you need to properly dispose of equipment that is no longer needed."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Greg M",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T15:56:14.000Z",
          "Titre": "Retire-IT was wonderful to work with…",
          "Contenu": "Retire-IT was wonderful to work with from start to finish. Process was easy, concise, and the picked up of our \"old\" technology went smoothly. Retire-IT was on time, as promised and the Technicians that picked the equipment up, were professional and courteous."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josue Pichardo",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T06:00:37.000Z",
          "Titre": "Great support service",
          "Contenu": "Great support service, representatives always provided a prompt response. The scheduling and pick-up process was smooth. The driver's estimated arrival time was accurate and provided ahead of time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "EMSL Analytical",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T17:56:57.000Z",
          "Titre": "Quick and easy disposal!",
          "Contenu": "The entire process took place over just a couple of business days from the time we asked for a quote until the time our E-waste was picked up.  Very easy to list what you have to dispose of and Retire-IT basically takes care of the rest, including arranging shipping all the shipping!  Data destruction proof also a very big plus!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lindsay Montes",
          "Nb_Reviews": 1,
          "Date": "2023-07-28T18:01:08.000Z",
          "Titre": "This is the second time using Retire-IT…",
          "Contenu": "This is the second time using Retire-IT to recycle old equipment at work and they are great! The team was very responsive. The driver and team they sent to pickup the equipment was quick and efficient. All around positive experience. Highly recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve Lundy",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T17:15:03.000Z",
          "Titre": "Communication has been great",
          "Contenu": "The communication from Retire-IT has been great.  Everyone I have spoken with has been polite, professional and responsive to my questions.  The carrier called an hour before arrival so we could be prepared, showed up on time and did a great job with the pickup.  I am very happy with the service provided."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Landon Smith",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T15:45:16.000Z",
          "Titre": "Hanger Inc recycling pickup",
          "Contenu": "Was contacted by logistics company 1 hour before their arrival. Crew was very professional and efficient. They got everything done right on time, about 5 minutes before we closed up for the day. Great experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2021-09-01T18:50:13.000Z",
          "Titre": "Great communication and great…",
          "Contenu": "Great communication and great experience. The only thing I would say is that up front it should have been discussed about getting an updated COI, cause if have known the pickup would have been done earlier, but it was delayed until after the fact. But that is not a negative. Very friendly and fast responses."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashton Ekhoff",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T22:52:36.000Z",
          "Titre": "Very communicative and helpful",
          "Contenu": "Each step of this service was handled quickly and efficiently. There was plenty of communication, and any questions were handled as well as I could have hoped. The pickup drivers were also very professional, and got the job done to my satisfaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rose, Artesia",
          "Nb_Reviews": 1,
          "Date": "2023-03-10T16:23:54.000Z",
          "Titre": "Great experience",
          "Contenu": "It went very well. Antonio Morris was a quick, efficient, patient, and polite guy. My only downside would be if they came with boxes or something to pack the equipment up to take with them, but outside of that everything else was great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brenda",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T12:58:15.000Z",
          "Titre": "I have used Retire-IT for over 11 years…",
          "Contenu": "I have used Retire-IT for over 11 years and have never had a bad experience.  Michelle, Trish and Kyle are wonderful to work with.  They have provided wonderful service in every state I've needed assistance in.  I use them knowing that our items our disposed of correctly and safely."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Becky",
          "Nb_Reviews": 4,
          "Date": "2022-06-03T17:50:52.000Z",
          "Titre": "Great communication and support, excellent organization",
          "Contenu": "Our company had a mass e-waste project happening at all locations, a massive and complicated endeavor. Retire-IT did a great job of coordinating and when we did inevitably have some issues, they were very quick to amend them and were always easy to get in touch with. They are organized and have incredible customer support, this process could definitely have been much more painful without them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RHUBER",
          "Nb_Reviews": 2,
          "Date": "2021-12-29T15:01:46.000Z",
          "Titre": "FIRST TIME USERS",
          "Contenu": "We are closing down and moving offices- and needed to size down LAN room- Retire-IT made the process quick -easy- and affordablescheduled pickup - -they arrived on time- driver and crew - helpful thanks again - WILL USE RETIRE-IT AGAIN"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jaime",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T12:24:24.000Z",
          "Titre": "I switched my company to Retire-IT when…",
          "Contenu": "I switched my company to Retire-IT when our last ITAD vendor decided to close their doors with very little notice about a year and a half ago.From the first meeting, I could tell I was working with a very competent group of people who were out to do things the right way. The pickups are done around your schedule and the drivers are precise, clean and courteous.  We are also part of the program to re-purpose some of the equipment we send and I am confident in the ROI being one of the best in the field.The website is another thing that is absolutely wonderful and user friendly and just another way that this company builds confidence with their customers.Whether it is to schedule a job or ask a question, I can pickup a phone or send an email and I know that I will be taken care of immediately. I have and will continue to recommend Retire-IT."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Bollinger",
          "Nb_Reviews": 1,
          "Date": "2022-09-21T18:08:29.000Z",
          "Titre": "No issues at all",
          "Contenu": "No issues at all. From scheduling, to pickup, to removal, the entire process was very simple and easy. Communication was great between all parties. And the removal team was even early per the 8AM start time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sandra Ramirez",
          "Nb_Reviews": 1,
          "Date": "2020-10-29T15:23:42.000Z",
          "Titre": "Excellent service!",
          "Contenu": "Excellent service!This was our second time using Retire-IT, LLC to recycle our e-waste, and everything was as great or even better than the first time. We received a timely quote, and were able to recycle everything from our printers, phones, and toners. The team was quick and efficient. Completed the job in less than 20 minutes. Customer service was great! Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Darryl Burt",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T19:50:48.000Z",
          "Titre": "Great Service",
          "Contenu": "This company is great with it's response for service and can work with any type of hardware. I have had a lot of issues with companies not following up and that is not good customer service. This company exhibits great customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Huey",
          "Nb_Reviews": 1,
          "Date": "2023-10-23T21:37:46.000Z",
          "Titre": "They we're very helpful at walking me…",
          "Contenu": "They we're very helpful at walking me through the process. Driver was very nice and helpful too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanie",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T17:53:11.000Z",
          "Titre": "Great Experience!",
          "Contenu": "Both gentlemen were super nice and very helpful.  Very willing to take care of what we needed. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Jimenez",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T23:22:31.000Z",
          "Titre": "I had the pleasure of collaborating…",
          "Contenu": "I had the pleasure of collaborating with Kyle Marks and his team, and I must say that the service I received from day one was truly exceptional. Among all the candidates I had on file, Retire-IT Support stood out as the provider of outstanding service.The entire process was organized with utmost professionalism, and they accommodated my team's needs flawlessly. From the initial gathering of information to the deployment day for pick-up service, every step was handled with precision and efficiency.I would like to extend my gratitude to our direct contact on site, who provided valuable feedback regarding the project day. Their experience confirmed that the disposal of office items was executed swiftly and effortlessly.I sincerely appreciate the excellent service provided by Retire-IT Support, and they exceeded my expectations by going above and beyond. If we have any future projects similar to this, you will be my highest priority. Furthermore, I will gladly recommend your outstanding service whenever the opportunity arises.Once again, thank you for your exceptional service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan",
          "Nb_Reviews": 1,
          "Date": "2022-02-03T19:46:48.000Z",
          "Titre": "Courteous and professional",
          "Contenu": "Courteous and professional - they did all of the heavy lifting and had everything picked up as scheduled."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian D",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T19:29:55.000Z",
          "Titre": "The process to pick up old equipment…",
          "Contenu": "The process to pick up old equipment including a heavy server was excellent.The person was on time and efficient"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brigitte Hollie",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T13:54:16.000Z",
          "Titre": "Very efficient, polite and completed job in a timely manner.",
          "Contenu": "Orlando and Chris were very polite. The job was done efficiently and in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steven J. Galluzzo",
          "Nb_Reviews": 1,
          "Date": "2023-03-21T22:03:01.000Z",
          "Titre": "Courteous and professional",
          "Contenu": "The gentlemen that came to our office to pick up the used equipment were courteous and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Siria, Jeff",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T15:54:41.000Z",
          "Titre": "Pickup at EMSL-St. Louis",
          "Contenu": "Good communication, the driver called in advance and arrived as scheduled, and the pickup was conducted efficiently and in a timely manner."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan Relken",
          "Nb_Reviews": 1,
          "Date": "2023-05-09T15:42:05.000Z",
          "Titre": "They came during the required time and…",
          "Contenu": "They came during the required time and loaded their truck with our order."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S. Zilk",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T13:25:57.000Z",
          "Titre": "We had an old multi-use printer that…",
          "Contenu": "We had an old multi-use printer that needed to be picked up and the two drivers that came were very nice. It was quick and easy too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chad Fuchs",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T20:26:30.000Z",
          "Titre": "Retire IT Experience",
          "Contenu": "This was a very easy process and professional staff to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Madden, Patrick",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T14:28:21.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Very easy to work with."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "shuttle la",
          "Nb_Reviews": 2,
          "Date": "2022-08-10T15:56:29.000Z",
          "Titre": "Quick & Clean",
          "Contenu": "Our pickup was made a day early, to the satisfaction of all involved! Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd Bell",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T15:43:55.000Z",
          "Titre": "Pick-up drivers were on time",
          "Contenu": "Pick-up drivers were on time, quick and professional."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Niki",
          "Nb_Reviews": 1,
          "Date": "2021-09-23T16:00:37.000Z",
          "Titre": "Driver was very courteous and quick…",
          "Contenu": "Driver was very courteous and quick picking up the inventory"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Emmitt Fennessey",
          "Nb_Reviews": 1,
          "Date": "2021-10-11T16:04:51.000Z",
          "Titre": "Great company to use for equipment…",
          "Contenu": "Great company to use for equipment disposal. Can use all around the US."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christian Price",
          "Nb_Reviews": 1,
          "Date": "2020-09-10T17:48:42.000Z",
          "Titre": "Nice and Easy...Did what they said they…",
          "Contenu": "Nice and Easy...Did what they said they would do.  Great communication."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebeca Ornelas",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T21:34:32.000Z",
          "Titre": "Director of Information Systems",
          "Contenu": "I like that the process is easy and not time consuming."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melinda Poulton",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T22:16:31.000Z",
          "Titre": "Arrived on time and was fast and…",
          "Contenu": "Arrived on time and was fast and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Star Lord",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T21:49:26.000Z",
          "Titre": "Very professional and courteous",
          "Contenu": "Very professional and courteous.  Gentlemen, picked up 36 Pieces, of computers, monitors, signature pads, and keyboards."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patrick",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T21:54:29.000Z",
          "Titre": "The movers were on time and very…",
          "Contenu": "The movers were on time and very professional"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sally Preto",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T16:06:12.000Z",
          "Titre": "Everyone was very pleasant to work with"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James Chapman",
          "Nb_Reviews": 1,
          "Date": "2020-09-14T14:27:16.000Z",
          "Titre": "Retire-IT is very professional",
          "Contenu": "Retire-IT is very professional, prompt, flexible and responsible when it comes to retiring company assets."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T22:42:05.000Z",
          "Titre": "VP CloudOps.",
          "Contenu": "Excellent service with pick up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeramy Woody",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T15:36:37.000Z",
          "Titre": "The driver was early and made the…",
          "Contenu": "The driver was early and made the process easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T05:08:36.000Z",
          "Titre": "Efficient",
          "Contenu": "Efficient, professional and painless!  Phenomenal customer service - definitely went above and beyond our expectations!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ed",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T15:40:18.000Z",
          "Titre": "Very reliable and trustworthy"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "James",
          "Nb_Reviews": 1,
          "Date": "2022-08-18T23:59:01.000Z",
          "Titre": "Easy and Straightforward"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "acorzo",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T21:02:35.000Z",
          "Titre": "Great and speedy service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sheila Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T20:35:39.000Z",
          "Titre": "It was great",
          "Contenu": "It was great, everything went as planned"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Abed Sadeddin",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T21:18:36.000Z",
          "Titre": "Super helpful and responsive!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nick Jones",
          "Nb_Reviews": 1,
          "Date": "2023-01-03T18:19:19.000Z",
          "Titre": "Quick and easy pick up."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda Honaski",
          "Nb_Reviews": 1,
          "Date": "2021-09-24T16:14:40.000Z",
          "Titre": "Equipment Pickup",
          "Contenu": "Pickup went very smooth!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Leonard, Sean",
          "Nb_Reviews": 1,
          "Date": "2023-06-22T18:21:37.000Z",
          "Titre": "Quick and easy"
        }
      ]
    }
  ]
}