{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "rocketnode.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Smith smith",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T16:04:32.000Z",
          "Titre": "Can't use server and when I whent for a…",
          "Contenu": "Can't use server and when I whent for a refund they said on but lets try thos and avoided a refund and just closer all my tickets THEY ARE A SCAM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Narjol Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T14:30:40.000Z",
          "Titre": "No such thing as service here i been…",
          "Contenu": "No such thing as service here i been trying to get help setting up a server and nobody ever even answer back"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Colby Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T11:31:17.000Z",
          "Titre": "They did not take responsibility for…",
          "Contenu": "They did not take responsibility for the faulty service they provided"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jj abrams",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:07:14.000Z",
          "Titre": "The server I paid for literally never…",
          "Contenu": "The server I paid for literally never works and its like the warehouse where they store these is constantly on fire. Panel never works and when I try to get support it usually never works"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Justin Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T22:58:27.000Z",
          "Titre": "Terrible Support",
          "Contenu": "The support team rarely responds, definitely not in a timely manner. If/when you get a response, it will most likely be very short and rude, then you're back at waiting for days for the next 3 word response which clearly doesn't do much to help your needs."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gspur",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T01:36:41.000Z",
          "Titre": "Everytime I have purchased a server...",
          "Contenu": "Everytime I have purchased a server from rocketnode, I can expect to have no access to it for a minimum of 24hours. With that time never added back to your billing cycle. Customer service is laughably slow and unresponsive, and many times when they finally do respond, they are by no means trained enough to actually help with the problem at hand. Very disorganized, and sadly a very disappointing service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "johnny morgan",
          "Nb_Reviews": 1,
          "Date": "2023-10-24T02:52:27.000Z",
          "Titre": "Unacceptable",
          "Contenu": "Have had five m service with you guys for months now. Decided to purchase an ark server as well. Since I purchased it going on a week now, I've had no option to configure in game settings and made multiple tickets. Responses have been slow, and a rep stated that they were fixing the issue but hasn't responded since I asked for an update 2 days ago. Have requested to cancel the subscription multiple times as well and have been ignored....unacceptable!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tomas TIrado",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T19:45:28.000Z",
          "Titre": "Not very easy to setup or install…",
          "Contenu": "Not very easy to setup or install scripts if anything it makes it harder to install scripts I do not recommend using this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Spyda King",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T00:14:14.000Z",
          "Titre": "They Deleted My Account.",
          "Contenu": "Yes this looks like it can be the best option for game hosting. But when you are in need of help, which I was. Simple question of will I keep my data after renewing my canceled subscription. No response for 3 days. But today I decided to just bite the bullet and see for myself but for some reason I couldn't log in. I tried multiple times and change my pass but no luck. Turns out, they're help was to just delete my account that I never asked them to do."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ThatOneGuy",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T04:11:45.000Z",
          "Titre": "Ordered a fivem server and it was banned",
          "Contenu": "Ordered a fivem server, went to get a keymaster they said rocketnode was a banned company. Then when I finally got to connect to it, it said it was banned from the server list…."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Amber Plante",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T19:40:05.000Z",
          "Titre": "Just bought a minecraft server today",
          "Contenu": "Just bought a minecraft server today, switched it to forge without issue, now that im trying to download a modpack (from their website options), its been stuck on a \"running installer, try again in a few minutes\" screen for 2 hours.... opened a ticket with no answer, also asked in the discord server with no answer. Was hoping that I'd at least be able to find a way to cancel the download of the modpack but their panel isnt very user friendly and is quite hard to use for someone whos purchased servers in the past from other options. its cheap but i guess you get what you pay for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nico",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:14:00.000Z",
          "Titre": "I pay way to much a month to deal with…",
          "Contenu": "I pay way to much a month to deal with how often the server goes down. Even upgrading the plan only helped so much. Now I've gotta find a new place to host my server."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessica B",
          "Nb_Reviews": 2,
          "Date": "2023-09-24T18:31:34.000Z",
          "Titre": "I'd give it less if it was possible",
          "Contenu": "I'd give it less if it was possible. They are always having issues with servers going down or having errors. They take forever to get back to you. They also prioritize 5m servers over minecraft."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Seth Thompson",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T05:20:33.000Z",
          "Titre": "I believe in great customer service",
          "Contenu": "I believe that great customer service is what makes a company strong. I am sad to say that your customer service is just awful, take hours to respond, I actually have a ticket open right now and it has been open for over 12 hours."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JayeMs",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T21:49:32.000Z",
          "Titre": "Server Hosting Company blocked by CFX",
          "Contenu": "Using this Hosting Company will get your Fivem Server blocked by CFX. Use a company that doesn't use FiveM brand name for profits. Using RocketNode for FiveM will just cause you to lose money and not even to be able to use the server host for what you intended on using it for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexander Walters",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T07:08:14.000Z",
          "Titre": "Wanted to save a dollar",
          "Contenu": "Wanted to save a dollar. Worse choice ever. Platform is poorly designed. Was not able to connect to the data source. I'll stick with my vps I've been using. A bit more expensive but worth it. This is a waste of money. But I got plenty of videos posted showing step by step how it kept failing. This place wants you to contact customer service. Don't waste your time or effort. Plenty of other places that only cost 10-20 dollars more and actually work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Ballew",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T22:32:55.000Z",
          "Titre": "Your service and knowledge on how to…",
          "Contenu": "Your service and knowledge on how to communicate with customers and resolve issues is very bad"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wyvu",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T01:46:25.000Z",
          "Titre": "EVER FING TIME I TRY RO MAKE A SERVER…",
          "Contenu": "EVER FING TIME I TRY RO MAKE A SERVER WITH YOU IV TRYED 7 TIMES AND EVERY TIME ITS JUST DOESNT LOAD IN THE CONTORL PANEL"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jose Merced GBG",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T12:21:38.000Z",
          "Titre": "never got my refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Prince",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T21:10:56.000Z",
          "Titre": "TERRIBLE HOSTING DO NOT PICK",
          "Contenu": "I started a server with them on May 2nd.. then on May 19th I get a email saying \"You have a unpaid invoice, pay now to avoid interruption in service:\"??? Ever since my server has been running super slow, crashing, kicking players out. and its not the files its literally the service. I would get it if I had a resource crashing it but NO i've been making servers for 4+ I would know if it was me crashing it. These people are money hungry. giving me a invoice saying its unpaid! NO $HlT ITS UNPAID, ITS NOT DUE FOR ANOTHER 2 WEEKS. like why state something is unpaid if its not needed to be paid."
        },
        {
          "Note": 1,
          "Lieu": "PH",
          "Pseudo": "Jonathan Valdemoro",
          "Nb_Reviews": 1,
          "Date": "2023-07-30T20:02:23.000Z",
          "Titre": "The support was not so responsive and…",
          "Contenu": "The support was not so responsive and it take atleast 6 hours before they could answer you. I will just finish my subscription for this month and will transfer to a different one."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Steele",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T17:07:35.000Z",
          "Titre": "I tried to get a refund after 2 days of…",
          "Contenu": "I tried to get a refund after 2 days of having the server. I cannot use the server so I no longer needed it but my refund was denied for some reason. I will never use rocketnode again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "roy giles",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T01:01:14.000Z",
          "Titre": "WAS NOT AT ALL WHAT I WAS LOOKING FOR I…",
          "Contenu": "WAS NOT AT ALL WHAT I WAS LOOKING FOR I THOUGHT WITH WHAT I PAID FOR IT WOULD HOLD MORE THEN IT DID SO WITH THAT I WILL NO LONGER BE A CUSTOMER OF YOUR SERVICE WITH VIBES I CAN GET A FULL VPS WITH BETTER SSD FOR LESS"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "a Adame",
          "Nb_Reviews": 1,
          "Date": "2023-05-15T01:59:00.000Z",
          "Titre": "Refuses to give me refund after telling…",
          "Contenu": "Refuses to give me refund after telling them I wanted to go to a different vps they insisted to refund me in store credit to buy their vps which I stated I do not want to do business"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Sharon",
          "Nb_Reviews": 5,
          "Date": "2023-04-13T00:50:49.000Z",
          "Titre": "I am sending emails.",
          "Contenu": "I am sending emails.Still can't log in.I would like to request that I cancel my subscription with you.I have not been able to access the server at all which from your end you will be able to see.Please reply with how I request a cancellation. Thank you  Sharon Brice"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "iverson",
          "Nb_Reviews": 3,
          "Date": "2023-09-29T02:54:28.000Z",
          "Titre": "Support team is way too slow and we…",
          "Contenu": "Support team is way too slow and we can't even ping them or else we get timed out. do better. specificly muneeb R he is mad slow and needs to be talked to."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tony Pee",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T12:31:47.000Z",
          "Titre": "I been having problems since February every month I be down for at lease a week for idk what reason I got banned from the discord by a kid because I don’t accept kids in my serious 18+ server and more",
          "Contenu": "Smh I been having problems since February every month I be down for at lease a week for idk what reason I got banned from the discord by a kid because I don’t accept kids in my serious 18+ server and more"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jarred Lewis",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T05:44:57.000Z",
          "Titre": "Horrible customer service",
          "Contenu": "Horrible customer service.  Money scam.   I was told if I canceled within 30 days it would be a refund and now they aren't trying to give me my money back.  Never again"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Larry Walker",
          "Nb_Reviews": 2,
          "Date": "2023-06-07T00:14:16.000Z",
          "Titre": "Deleting my files before the server is…",
          "Contenu": "Deleting my files before the server is over due my I only got one email saying my server was due and I paid it that Friday and my hole server had been deleted"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Roberts",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T20:05:00.000Z",
          "Titre": "Broken Server Hosting",
          "Contenu": "Your services are very bad when you can't give a refund back for a broken server hosting for FiveM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alexander Walters",
          "Nb_Reviews": 2,
          "Date": "2023-10-17T06:59:34.000Z",
          "Titre": "Bad platform",
          "Contenu": "Bad platform. Posted video of how bad the platform is. I'll stick with my vps. Easy set up and works great. Wanted to save a few dollars. You get what you pay for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brennan Weitzel",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T00:45:18.000Z",
          "Titre": "I was charged but wasnt given my…",
          "Contenu": "I was charged but wasnt given my product. When I asked for a refund none was given. Terrible service and staff."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Wilton Acta",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T15:21:26.000Z",
          "Titre": "Server was not working for the first…",
          "Contenu": "Server was not working for the first two weeks, I cannot believe I paid for this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "davonte martin",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T14:03:34.000Z",
          "Titre": "Can’t get the support I need"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Easton III",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T03:38:34.000Z",
          "Titre": "I wasn’t even able to gain access to my…",
          "Contenu": "I wasn’t even able to gain access to my account and start building my server."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shadow Rolepay",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T08:52:04.000Z",
          "Titre": "Absolutely terrible",
          "Contenu": "Absolutely terrible, So much lag, and daily issues that would cause the server not to be able to launch without placing a ticket, after four days of using this service i requested a cannel, and they wouldnt offer me any sort of refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arvys Sendrauskas",
          "Nb_Reviews": 4,
          "Date": "2023-11-08T22:25:31.000Z",
          "Titre": "My ticket not got answer and be closed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kamala Greenwood",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T03:59:22.000Z",
          "Titre": "The sever is always down",
          "Contenu": "The server goes down every 10 to 30 minutes"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kasey Artrip DeltaSquad",
          "Nb_Reviews": 1,
          "Date": "2023-10-08T16:15:50.000Z",
          "Titre": "Proor customer support",
          "Contenu": "They helped me for a bit and then just stoped responding"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "True LincolnLover",
          "Nb_Reviews": 1,
          "Date": "2023-08-06T10:52:57.000Z",
          "Titre": "First month with rocket node…",
          "Contenu": "First month with rocket node experienced more downtime than a prostitute 🤦🏾‍♂️"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Gaming Thief",
          "Nb_Reviews": 1,
          "Date": "2023-09-26T02:17:29.000Z",
          "Titre": "RocketNode Hosting Reliable?",
          "Contenu": "Yesterday (09/03/23), I bought an Arma 3 Dedicated server for my Arma 3 Unit. Great prices and this isn't the first time I have hosted servers with Rocketnode. but yesterday's/Today's experience definitely won't be a 5-star review.  It could have been if some things changed. To start, Pricing is great 3.50 USD for a TS3 Server and 18.75 for a 6 GB RAM and 85 GB SSD (Arma 3 Dedicated server) is great. no issue there. they really do uphold their \"affordable\" tag they put on themselves. next is \"Fast\" This is where things go bad and where I had issues. Apparently, they were too fast and when I got my server there was a configuration on my server that made it unable to start at all. I would keep getting Error Exit 1 crashes and then have to ask the RN support team about it. other than that every time I got a server from RN (RocketNode) it has not had this issue. I'm going to guess it was just a bad deployment. I'm not going to let that be why I leave RN and stop hosting with them. Lastly \"Reliable\", this tag they put on themselves is true but I will say why it can make them look bad when you open a ticket. Before I go into what exactly happened. let it be known I understand \"Newer\" support members do not know everything. now into the main issue. Yesterday and Today (09/03 // 09/04/23) I would open 3 Tickets. 1. Would be talking about What servers there are, 2. Other questions about the servers 3. The Server crashing issue that made the server not able to go online.and now into the details. if you are known as a \"Senior support member\" and you dont know about that ticket (Arma, Minecraft. Fivem etc) then maybe let another Support member take it. not going to name names as thats wrong and if that person is read let them learn from it. but this was bad enough to where i think customers should know to ask for another support member. This ticket would start around 11:20 PM ET, i immideatly say theres issues with my Arma server and send a Screenshot with that. where a support member thats a senior member would ask me to verify myself (Reasonable tbh) and then ask me what server it is thats has a issue.... (Let it be known i only have a Team Speak Server and a Arma Server and the Arma server's name being \"Operator Development Group\") so its its kind OBVS that its the arma server. he would then ask me about is its Minecraft... like i already said it like 3/4 times thats its arma. then he trys to start the server (I tryed that... id hope) he would then refer to the arma dev. i would ask about a ETA and get \"He will be there when he gets available\" (12 hours so far) now into today fully. I get home from work and I get another support member who instantly knows what to do and gets my server going. so although it took a long time the Team Leads and Management have shown me that RocketNode has people who know the basics. My personal appraisal to Skylar B. - helped with the first ticket and was a Great help. he knows his job and does it well. Lewis T. - Helped with the last ticket and got the server working. def deserve and Management spot tbh. (If it wasn't for the bad parts I would do a solid 4/5 star but with everything I have to do 3... actually ill do 4 but know that with everything that has happened I am very on the wall about this star rating. I still hold RocketNode up and will still promote them on my Streams and all that. Thanks, Lane for helping aswell.)Changing my 4/5 Star to 1/2 star. After they moved server nodes and changed my SERVERs ip it has been giving me nothing but issues. Support Doesnt know their job most of the time. you have people int here that do (Very few) i will not be back AT ALL."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brandon H",
          "Nb_Reviews": 2,
          "Date": "2023-04-10T22:50:17.000Z",
          "Titre": "Terrible experience",
          "Contenu": "Support takes hours to talk back and forth with, mods are nearly impossible to set up. You get what you pay for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Brayden Mccowan",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T07:43:24.000Z",
          "Titre": "Thery bad service need to get there…",
          "Contenu": "Thery bad service need to get there support team in line"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Karnell Callender",
          "Nb_Reviews": 1,
          "Date": "2023-05-28T01:24:37.000Z",
          "Titre": "Untrustworthy employees",
          "Contenu": "Well your employees we’re helping themselves to my server however whenever they wanted without my knowledge or permission the guy accessed my server then forgot to shut it down or I wouldn’t of noticed then higher ups telling me he would take time to discuss the misconduct which was a complete lie then you had another guy asking me for my password to my txadmin to make changes he’s already been making without it just a lot of untrustworthy actions them I told them for me to allow anyone else in I had to be there and I need to be aware and they got mad but what do you expect when the guy just ruined my server has a warning on it now so I just gave up cause they ruined it and wouldn’t take responsibility or the fact that I’m gonna be more aware moving forward"
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "NO",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T18:31:13.000Z",
          "Titre": "Bad Service!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cory Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T03:32:18.000Z",
          "Titre": "Haven’t even been able to connect to my…",
          "Contenu": "Haven’t even been able to connect to my server"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Cody Stout",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T09:16:47.000Z",
          "Titre": "Only had the server for about an hour",
          "Contenu": "Only had the server for about an hour. It crashed and couldn’t get it to restart."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "JOSH",
          "Nb_Reviews": 1,
          "Date": "2023-05-14T22:48:55.000Z",
          "Titre": "Not good long support and not good…",
          "Contenu": "Not good long support and not good pricing wise"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Big Chunky",
          "Nb_Reviews": 1,
          "Date": "2023-06-05T03:18:37.000Z",
          "Titre": "bad price",
          "Contenu": "bad price not good for business"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "julian haenig",
          "Nb_Reviews": 1,
          "Date": "2023-06-01T02:52:38.000Z",
          "Titre": "Horrible service and customer service…",
          "Contenu": "Horrible service and customer service would never recommend them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zelgos",
          "Nb_Reviews": 1,
          "Date": "2021-11-06T09:42:33.000Z",
          "Titre": "DO NOT TRUST",
          "Contenu": "DO NOT TRUST. Scammers, I have filed a complaint with the New York State attorney generals office. Paid them to develop a GTA server for me and couldn't do it. One because they didn't have the knowledge and then they lost the files. Convenient right?Update: Finally got a hold of Cybergreen and at first he seemed to want to work something out, then he kicked me from his discord and blocked me again. Will be moving forward with a chargeback for the total amount and updating the Attorney Generals office. Apparently its a bunch of 14-16 year olds scamming people. DONT BE FOOLED like I was. Im out $1800 because of this company!Update: Them saying the development work was completed is complete and utter lie. Cybergreen complained he had to much schoolwork to complete my server. So what did I pay $1300 for? Nothing. Had to start completely over. Do not trust!Update: cybergreen offered a refund of a one time payment of $496 then after he said he \"consulted a lawyer\" which I believe to be complete bs changed his mind and blocked me. I would love to know this companies attorney but they refused any information. I have updated the attorney general of New York and they did say my claim had merit. Just waiting on action now. Sad that this company thinks they can mess with money in these amounts and have no repercussions."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Trevor_Edits",
          "Nb_Reviews": 1,
          "Date": "2021-08-11T01:24:42.000Z",
          "Titre": "Did not get help this time 😂"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "IniqtyTV",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T02:55:42.000Z",
          "Titre": "Support is slow to respond...",
          "Contenu": "Support is slow to respond as they only seem to employ people from the other side of the world (compared to USA locations) VPS tends to work, but seems to have crashes when doing simple tasks.."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "aVibingPlaylist Bee",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T04:20:36.000Z",
          "Titre": "Well the first day went well but afterwards...",
          "Contenu": "Went well the first day but afterwards me and several other server mates started having problems. We kept on getting kicked out not five minutes after logging on and this is despite the Internet and Minecraft running smoothly. Now none of us can get into the server."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Craig G",
          "Nb_Reviews": 3,
          "Date": "2023-11-10T19:06:18.000Z",
          "Titre": "Do your investigating before you buy! Just Sayin!!!!",
          "Contenu": "Every time you turn around something crashes or server has errors. This is a daily thing not only for me but many many others as well. Ticket response time to get a tech to fix the issue can take 24 hours in my case a few times the ticket was never answered. Instead the Rocketnode closed the ticket. Submitted another ticket 11/8/2023 that QBCore on my server has issues stopping the use of 2 way radio and Qb phone has limited use. A major error comes up on the log and then the game freezes. Today 11/10/2023 yet nobody has reached out or even attempted. Rocketnodes Discord has miles of complaints of the same or similar issues that several were not answered. I put in a cancelation and go somewhere else, Rocketnode does NOT refund anyone. Not good business treating clients like that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ThePhantom",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T10:29:17.000Z",
          "Titre": "Not that great",
          "Contenu": "I purchased their service, 2 in fact. One for my gameserver and one for my dev server. When I chose to transition from my previous company to this one they decided to make upgrades happen. This in turn caused massive issues for my server. The VPS (Virtual Private Server which your server runs on) constantly froze up causing massive De Sync to happen. I got fed up and didn't see a point in paying for something that was not working that well. Especially up to 28.50 a month for a thing that freezes constantly making my service unplayable. The only thing that was done right, was their consumer support. They helped me cancel my service since for some reason it also changed languages on the panel and I could not figure out how to change it back. Overall rating 2/5 not very good honeslty"
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Devin Jodoin",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T07:43:15.000Z",
          "Titre": "Can not recommend for modded minecraft.",
          "Contenu": "only giving a 4 star cause it took 24+ hours to resolve my issue, but shawkat A, and Matt M had my back in the end when i was giving up and got my modded minecraft server up and running. also had my custom world uploaded with an hour after troubleshooting the problems, i highly suggest opening a ticket on discord rather then the site for better responses.Edit: I bought 24gbs worth of ram, which should be more then enough to run a silky smooth all the mods 8 playthrough(solo) but I have had multiple crash issues, significant server lag when trying to explore and load new chunks, can not recommend this hosting provider what so ever unforchanitly. will be lowering my rating to a 2 star."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Devyn Muniz",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T05:47:52.000Z",
          "Titre": "i wanted to uncancel my subscription",
          "Contenu": "i wanted to uncancel my subscription cuz at first i gave up but then i wanted to re try so if i can get a free month next month and then ill pay the rest then it will be good"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Baker Schultz",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T17:27:24.000Z",
          "Titre": "Wouldn't Recommend",
          "Contenu": "Frankly, it's too good to be true. The servers are cheap, and easy to setup. The d-sync is TERRIBLE for Five M. I switched from Zap-Hosting in attempt to get better performance, and I honestly seemed to have gotten worse with the d-sync. Switched back to Zap and am having a better time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Aaron Miller",
          "Nb_Reviews": 1,
          "Date": "2023-05-20T18:31:55.000Z",
          "Titre": "Goes down alot",
          "Contenu": "The server has recently been going down alot and it's frustrating hence the 2 star review."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Blake B",
          "Nb_Reviews": 2,
          "Date": "2023-07-01T19:23:24.000Z",
          "Titre": "It was great until the host lost the…",
          "Contenu": "It was great until the host lost the data and lost all of my stuff that I had worked hard for to get it where it’s at. Asked for a refund but they were willing to give me a month for free. How am I going to want a month for free when I have LOST everything? I was not pleased by that."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "steven Pennini jr",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T23:34:59.000Z",
          "Titre": "The host was down for a week and that…",
          "Contenu": "The host was down for a week and that not right to keep it down and all of my stuff didn’t work. I went to a new host due to that."
        },
        {
          "Note": 3,
          "Lieu": "NL",
          "Pseudo": "Aks Nezinau",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T21:12:38.000Z",
          "Titre": "Very slow respond to support tickets",
          "Contenu": "Very slow respond to support tickets and when i bought one of the things for 10 eur they still didnt fix an error"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Clayton M",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T08:30:08.000Z",
          "Titre": "It’s a great product with a great…",
          "Contenu": "It’s a great product with a great interface, for people who are at the very least mildly educated in this field.. would love to see some kind of basic “how to” option in the menu covering the different options, and fixes for various basic problems/errors one would encounter, instead of having to open a ticket."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jonathan Mulholland",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T18:58:02.000Z",
          "Titre": "For the most part they’ve been great…",
          "Contenu": "For the most part they’ve been great although recently there’s been quite a bit of unannounced extended down time from apparent issues on their end because they somehow ran out of disk space causing an almost 24 hour outage and loss of profit. Then a day or so later, unannounced it goes down again. Hope we don’t deal with this stuff again in the future.  I can deal with outages but not announcing anything until after it goes wrong and having such a large downtime is kinda absurd"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Cody Morrison",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T18:36:15.000Z",
          "Titre": "Good price, could be more user friendly",
          "Contenu": "Good price, but servers are unstable and my friends got burned out with all the trouble we experienced. Service was quick enough to resolve any issues I have had, but the frequency of which we experienced issues was high. Would recommend another hosting site if you're new to server management"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Tristan Lewis",
          "Nb_Reviews": 17,
          "Date": "2023-04-27T09:32:07.000Z",
          "Titre": "Rocketnode are good in terms of pricing but...",
          "Contenu": "Rocketnode are good in terms of pricing for servers etc, but communication is poor ! Especially as I paid for something which apparently gives me fast response priority or whatever it is they call it. SOME staff seem VERY disinterested to help and sometimes take a couple of days to reply!! Which is not good !Other than that negative in regards to discord communications I think rocketnode are good!"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Jared Nash",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T05:10:38.000Z",
          "Titre": "Upload Files",
          "Contenu": "Rocket Node is priced great, website is easy to navigate and clear. The only downside is that you can't upload files so If you need to add new clothing for example and you need to upload 3000-4000 files, you can only drag over 10 at a time. Takes up a lot of time."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lincoln Courter",
          "Nb_Reviews": 1,
          "Date": "2022-06-07T19:06:46.000Z",
          "Titre": "Outages were common & they deleted my server.",
          "Contenu": "I found them while looking for a cheap server host for FiveM. While they are cheaper, In my 6+ months of using them there were constant outings, and they even deleted my server “because there was an issue with the rack it was on” and then literally blamed me for not having a full backup of my 60+gb server. (I didn’t back it up, 60gb s would have taken days because the server was so slow) From my research, rocketnode isn’t even a legit business, they don’t have a license and their about page has next to nothing on it. I wouldn’t recommend using them to anyone, unless maybe it was a test server they did t really care about. The customer service can be helpful but otherwise I had nothing but hard aches from them."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "stefan woodhouse",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T23:09:26.000Z",
          "Titre": "I like the easy and manageable panel…",
          "Contenu": "I like the easy and manageable panel but with a week of owning a server I had to move to a different server due to a bunch of issue"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Luis",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T22:08:01.000Z",
          "Titre": "new rules L",
          "Contenu": "the servers all very good but the new rules are trash and its not good for my milsim server ;("
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jason Staples",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T02:30:21.000Z",
          "Titre": "ESX framework don't work in rocketnode"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jake roland",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T16:43:19.000Z",
          "Titre": "Nodes Breaking",
          "Contenu": "I dislike how the nodes are always breaking and you always have to create a ticket each time it does it."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jake roland",
          "Nb_Reviews": 2,
          "Date": "2023-07-27T21:35:17.000Z",
          "Titre": "Bad and good experience",
          "Contenu": "It took 63 hours to fix my server and nobody was helping me until 7/27/23"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "jack tobias",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T04:17:09.000Z",
          "Titre": "that i couldn't do it how the yt says…",
          "Contenu": "that i couldn't do it how the yt says but Vinni P help me out"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "zain",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T08:03:19.000Z",
          "Titre": "they did a good job responding ur… issue for FIVEM server",
          "Contenu": "they did a good job responding ur answers kinda quick but i take it i mean i create a ticket at 12am lmfao all thought i love there services !!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Logan",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T21:32:47.000Z",
          "Titre": "Usman T.",
          "Contenu": "Started out rocky but got my issue fixed."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Olimpus",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T02:29:11.000Z",
          "Titre": "Really good",
          "Contenu": "Really good, just sometimes there are moments where u want to say goodbye but overal nice"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "HartBOI",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T21:27:15.000Z",
          "Titre": "Great service with few issues",
          "Contenu": "Overall the hosting service is amazing but there are just a few things that could be changed. Purchasing a server and installing items are straightforward and are very easy to follow but there have been many cases of server downtime. The ticket bot in the discord is also down sometime but apart from that I will recommend rocketnode as an affordable server host for FiveM. I don’t have any information about their other hosts but I hear that they are good aswell"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Clover R",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T23:15:52.000Z",
          "Titre": "Good support",
          "Contenu": "Good support, meh automatic help.Reinstalling a server doesn't reinstall the bare bones needed for the server to run. But running it by support does the trick, glad they could help!Thanks, Shawkat"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean Burns",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T15:03:50.000Z",
          "Titre": "Solid Hosting company",
          "Contenu": "Been with these guys for about a month so far. They’re support team can be iffy, especially since they’re slow and the staff team can be a little bit arrogant at times. But they fix issues very quickly, and they’re very transparent about issues."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A B",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T18:43:34.000Z",
          "Titre": "good control panel and its easy to use",
          "Contenu": "good control panel and its easy to use, however other stuff could use some work"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Samsong",
          "Nb_Reviews": 11,
          "Date": "2023-02-02T16:12:37.000Z",
          "Titre": "Very good hosting provider",
          "Contenu": "Honestly this hosting service is pretty good for the cheap pricing. Your server runs very smooth and there aren't many downtimes. I give 4 stars because the support is a little bad. I've heard from the people who bought priority support that it was a big waste of money so I recommend not adding it to your package as you will pretty much get the same support. But in general this is a very good host, you definitely can't go wrong with this one. I'll recommend searching for a host with more support if you're entirely new to making servers or whatever but for the people who are looking for a better host, this is probably your best choice!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon S",
          "Nb_Reviews": 1,
          "Date": "2023-06-20T17:21:05.000Z",
          "Titre": "Company is great and very responsive",
          "Contenu": "Company is great and very fairly priced. only reason for 4 stars is there has been a bit more than usual downtime...BUT...they usually resolve very quick...other than that! i couldn't have asked for a better provider!"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Colin",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T23:09:13.000Z",
          "Titre": "Muneeb R",
          "Contenu": "Muneeb R. did good of assisting me whith my problem"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Minster",
          "Nb_Reviews": 3,
          "Date": "2022-07-03T01:51:48.000Z",
          "Titre": "maddox helped out very well took the…",
          "Contenu": "maddox helped out very well took the time to go ono my server and find the issue and sort it out and was very quick and efficient thank you very much"
        },
        {
          "Note": 4,
          "Lieu": "ES",
          "Pseudo": "Rares Bogdan Bulihar",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T18:26:14.000Z",
          "Titre": "Very nice hosting",
          "Contenu": "Very nice hosting, cheap and fast also it has got anything that you need in just 2 clicks. The only thing that I would say is that they should add more plugins."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dustin Drews",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T00:30:23.000Z",
          "Titre": "Usman T.",
          "Contenu": "the support did a great job and was quick and patient working with me"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Charlie Burbidge",
          "Nb_Reviews": 3,
          "Date": "2023-08-08T01:07:42.000Z",
          "Titre": "Muneeb R",
          "Contenu": "Muneeb R Helped me and he was great so 10/10 service"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Swervo",
          "Nb_Reviews": 2,
          "Date": "2023-06-05T18:38:19.000Z",
          "Titre": "Good cheap hosting on multiple platforms"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Epic NC",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T21:13:28.000Z",
          "Titre": "It was good",
          "Contenu": "It was good And staff was helpfull"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jake Carl",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T00:38:19.000Z",
          "Titre": "it was good",
          "Contenu": "it was good , so uh yea buy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy Silverio",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T00:59:00.000Z",
          "Titre": "Outstanding!",
          "Contenu": "Great customer service with very high knowledge regarding the solution to my issues....Many thanks to the RocketNode team specially Saad A!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian Bullard AJB",
          "Nb_Reviews": 3,
          "Date": "2023-12-16T23:33:19.000Z",
          "Titre": "Awesome Support!",
          "Contenu": "Awesome Support!I was having an issue that i couldn't resolve, and Mr. Muneeb R came to the rescue!He/her has been nothing but formal to me and respectful, and i really appreciate it.And again Awesome Support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cory Hayden DominatorC",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T05:09:33.000Z",
          "Titre": "Fast and clean",
          "Contenu": "Usman S was very quick to respond and assist me with my roadblock on server databases. He was able to get the issue resolved quickly and was professional through the whole interaction."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brandt Harnish",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T15:43:11.000Z",
          "Titre": "Support is very helpful",
          "Contenu": "Support is very helpful, Muneeb R was very nice and quickly responded."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Byron",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T05:57:23.000Z",
          "Titre": "Usman S has been amazing help when it…",
          "Contenu": "Usman S has been amazing help when it comes to fixing issues with my FiveM server. Giving me steps that are very easy to understand and follow :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JaiC",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:52:01.000Z",
          "Titre": "Great Interaction System",
          "Contenu": "One of the Greatest Web interfaces to use for beginners and honestly everyone!"
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Milton Pena",
          "Nb_Reviews": 2,
          "Date": "2023-12-05T00:31:00.000Z",
          "Titre": "Rocketnode Review",
          "Contenu": "After some time with rocketnode, my impressions have been totally positive, in terms of price-quality it is the best option on the market currently.A very intuitive interface for someone who is not a programmer and the truth is that it offers a lot.As for support, they have 10 stars, on Discord they solved my problem in less than 5 minutes (special mention to Mr. Muneeb R). Both the tickets on their page have also been resolved very quickly and clarified several doubts (special mention to Shawkat).After all the decision is in your hands"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Angel Goodcop",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:06:13.000Z",
          "Titre": "Muneeb R helped my get my server back…",
          "Contenu": "Muneeb R helped my get my server back up and running by helping me fix TX admin"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T07:15:40.000Z",
          "Titre": "RocketNode Has One The Best Staff Team",
          "Contenu": "RocketNode Has One The Best Staff Team, Respond Fast They Reslove Any Issue Right Away It Can Be Anything And They Will assist you, Thanks To Usman S He Has Been Helping Me A lot One Of The Best Staff Out There"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gage",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T08:01:20.000Z",
          "Titre": "Usman S This man is an absolute legend…",
          "Contenu": "Usman S This man is an absolute legend i didnt even have time to explain my problem he looked right at the database and fixed it right away 10/10 customer service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John Legutzy",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:30:27.000Z",
          "Titre": "Support",
          "Contenu": "Had a problem, and opened a ticket on their discord. The problem was resolved in UNDER 10 MINUTES by a very friendly support team member named Muneeb R., I recommend the service to anyone who wants a quick reply back, and I will be continuing my subscription with this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gotty",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T10:12:05.000Z",
          "Titre": "i will like to thanks Shawkat A",
          "Contenu": "i will like to thanks Shawkat A. for the big amazon and great job they help me. great service and patience kind best RocketNode employee most definitely needs employee of the month every since i started playing fivem i never had no one help me like them.... Keep Up The good work..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jim",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T06:56:15.000Z",
          "Titre": "Amazing customer service!",
          "Contenu": "Had a problem with my server not running right and within 24 hours of opening a support ticket they fixed my server and had it working right again! Definitely would recommend for anyone looking for hosting!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reese Jackson",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T01:03:15.000Z",
          "Titre": "Muneeb R assisted with a problem I ran…",
          "Contenu": "Muneeb R assisted with a problem I ran into he was very nice professional and quick with the replies. If you need a GTA FiveM sever RocketNode is definitely the place to come."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AJ JACOB",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:59:37.000Z",
          "Titre": "help me when a guy on online that hack…",
          "Contenu": "help me when a guy on online that hack me and help the my problem's for the server thank you fr"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Daniel Kavanagh",
          "Nb_Reviews": 5,
          "Date": "2023-12-05T23:07:30.000Z",
          "Titre": "They are brilliant",
          "Contenu": "They are brilliant they respond to you straight away non judgmental and no way sarcastic. Always helping u with everything. No limits don’t know why I only went with them now"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CamBeast",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T02:33:45.000Z",
          "Titre": "Muneeb R Review",
          "Contenu": "Muneeb R made my server work after trying ALL DAY"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyndel Richardson",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T10:38:10.000Z",
          "Titre": "Usman S did an amazing job",
          "Contenu": "Usman S did an amazing job. They took the time to explain to me what was going on and made sure I was aware of how to prevent the issue in the future."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Andrei Pablo",
          "Nb_Reviews": 3,
          "Date": "2023-12-20T00:19:27.000Z",
          "Titre": "great support 10/10 Usuman T best admin"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "opdonuts",
          "Nb_Reviews": 4,
          "Date": "2023-12-05T16:39:20.000Z",
          "Titre": "Recommend they have great customer…",
          "Contenu": "Recommend they have great customer support  Saad A. helped me im very pleased thank you guys for making a great vps/server hosting"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PROMO Q GAMING",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T14:11:38.000Z",
          "Titre": "The BEST service and discord help you…",
          "Contenu": "The BEST service and discord help you can get. Usman S.is definitely a HUGE late night help for devs who have servers that game into the late nights"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "opdonuts",
          "Nb_Reviews": 4,
          "Date": "2023-12-01T08:00:43.000Z",
          "Titre": "rocket node is awsome",
          "Contenu": "HI!, I have been a rocket node member scince novenber 21,2023 and it is the best fxserver hosting/vps out there. They have AWSOME support that is fast and reliable Usman S helped me and it took about 15 mins."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Who This",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:41:37.000Z",
          "Titre": "Amazing customer service",
          "Contenu": "Amazing customer service, whenever I had a request or question the support team were straight on it, almost every time Saad.A has been there to assist, thanks again to him for the effort he puts in, I am yet to close a ticket without the issue solved :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiden Favors",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T19:59:30.000Z",
          "Titre": "Helpful",
          "Contenu": "Muneeb R. Was a great staff support and rockenode has no problem and I recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "F m",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T19:30:19.000Z",
          "Titre": "Usman s and Matt w are great help.",
          "Contenu": "Usman s and Matt w are great help.Usman was patient with me and helped with some issues I had and Matt was a great closer helped give a 2nd opinion on the matter and together.The issue was resolved great team effort and I truly appreciate the team at rocketnode."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "vue",
          "Nb_Reviews": 2,
          "Date": "2023-11-25T11:18:23.000Z",
          "Titre": "Amazing Customer Service",
          "Contenu": "Rocket node has amazing customer service. Usman S helped me out a lot when setting up the server. He was responded very quickly and answered all of my questions"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jairei Coates",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T03:24:37.000Z",
          "Titre": "Easy Interface",
          "Contenu": "Easy Interface , Quick and Direct HelpMuneeb R was GREAT"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Podcast Dave",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T15:07:26.000Z",
          "Titre": "This is my FiveM server hosted",
          "Contenu": "This is my FiveM server hosted, and they have good support to help if you have any glitches. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Logan D",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T23:24:31.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, if you need a server these are the guys to go to!"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Malaysia Hotstar RP",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T19:36:59.000Z",
          "Titre": "the best hosting",
          "Contenu": "the best hosting when i launch the server easy to use"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zachary McDowell",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:55:55.000Z",
          "Titre": "10/10 Support",
          "Contenu": "Usman and Matt with support tickets helped me with quick responses. Very nice cust service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RonS",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T01:08:48.000Z",
          "Titre": "Had some issues on seting up my server",
          "Contenu": "Had some issues on seting up my server.  Sent in a ticket and it was answered fairly fast and informative.  Derek was the man of the hour for getting the issues resolved and explained everything to me.Thanks Derek.  Highly recommend their services."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Cameron Bingham",
          "Nb_Reviews": 2,
          "Date": "2023-11-13T18:17:06.000Z",
          "Titre": "Best server hosting website out there",
          "Contenu": "Best server hosting website out there on the market. I have had problems with my server and the support has been rapid and that's why I have been with RocketNode Hosting for a month now. It is the best service out there and Its cheap. They have customizable plans to suit everyone's needs for a FiveM, Minecraft server."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "XUXKWII",
          "Nb_Reviews": 1,
          "Date": "2023-11-19T01:44:38.000Z",
          "Titre": "It's very good And I highly recommend.",
          "Contenu": "They have very good servers that include lots of good features with easy to navigate menus which is very good in my opinion. Everything is simple to change and allows for easy management of your server. I recommend buying a server from them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "F m",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T01:14:51.000Z",
          "Titre": "Muneeb came in clutch",
          "Contenu": "Muneeb came in clutch had an issue he solved it right away.Another success for the rocketnode team.5 stars don't cover the quality of customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jess claps",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T08:33:24.000Z",
          "Titre": "Usman S",
          "Contenu": "Usman S, Was great support that i had a issue on.Really cool person and awesome Thank you Usman S."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adrian Bullard AJB",
          "Nb_Reviews": 3,
          "Date": "2023-12-09T06:02:21.000Z",
          "Titre": "Helpful Service!",
          "Contenu": "I was having a issue, but then Mr.Usman S came along and help me with it!He/Her was really helpful, and was straight to helping me!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Markus Marks",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T05:20:44.000Z",
          "Titre": "Usman S W man help me in no time",
          "Contenu": "Usman S W man help me in no time! would ask for him everytime!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Duncan Schmidt",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T13:18:53.000Z",
          "Titre": "Awesome service",
          "Contenu": "Awesome service! They have great support and it’s fast (not like zap) I would 110% recommend!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "_gavin _",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T02:30:28.000Z",
          "Titre": "Muneeb R gave me AMAZING service",
          "Contenu": "Muneeb R gave me AMAZING service. He helped me get my server up and working after I couldnt get it to start. He was also extremley respectful using words like \"Yes sir\" \"No Sir\"."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Lyons",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T06:50:11.000Z",
          "Titre": "Usman S",
          "Contenu": "Usman S. Was extremely help when i have any concerns or need any help in regards to the server."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Owen Wilson",
          "Nb_Reviews": 1,
          "Date": "2023-10-06T20:42:36.000Z",
          "Titre": "Muneeb R",
          "Contenu": "First off Muneeb R. Replied in seconds of the ticket being opened, He replied every single time within minutes, He described what i did wrong, And fixed it for me, If you are thinking of going with RocketNode you 1000% should, 10/10 support 10/10 services very happy."
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "Gytis",
          "Nb_Reviews": 4,
          "Date": "2023-12-12T16:34:14.000Z",
          "Titre": "I recommend it",
          "Contenu": "very quick help response.  stable host.  I recommend it"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Omilly James",
          "Nb_Reviews": 1,
          "Date": "2023-12-15T23:22:46.000Z",
          "Titre": "they fixed my problem instantly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesse Mackenzie Johnson",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T03:56:59.000Z",
          "Titre": "RN Support 100% Recommend",
          "Contenu": "The way the support team can just fix my server just like that, it's amazing! 100% recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wyatt bolin",
          "Nb_Reviews": 2,
          "Date": "2023-12-02T00:51:18.000Z",
          "Titre": "Saad a an useman T got a 100% vouch…",
          "Contenu": "Saad a an useman T got a 100% vouch from me they know what they doing fr fr a that sh!t shows excuse my language💯"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kevin Marconett",
          "Nb_Reviews": 1,
          "Date": "2023-10-07T06:20:27.000Z",
          "Titre": "Usman makes your late night support great.",
          "Contenu": "Usman the guy whose always on late night and does an amazing job and making sure that he asks pertinent questions that ultimately end with him solving my issues every time. Favorite staff member by far"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Lewis leeson",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T23:47:49.000Z",
          "Titre": "Muneeb R is amazing and always at my…",
          "Contenu": "Muneeb R is amazing and always at my side whenever needing support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aiden Cain",
          "Nb_Reviews": 2,
          "Date": "2023-12-17T15:19:11.000Z",
          "Titre": "Saad helped me out and it was amazing…",
          "Contenu": "Saad helped me out and it was amazing very quick and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "wyatt bolin",
          "Nb_Reviews": 2,
          "Date": "2023-12-10T14:46:49.000Z",
          "Titre": "SAAD A always coming in clutch they…",
          "Contenu": "SAAD A always coming in clutch they deserve a promo"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CDO Official",
          "Nb_Reviews": 3,
          "Date": "2023-10-05T21:42:11.000Z",
          "Titre": "ive been using Rock Node for almost…",
          "Contenu": "ive been using Rock Node for almost 2years and they are great they are quick to help when a ticket is made and i recommend them to any new fivem server owner or even seasoned owner their just the best. I've been with 3 other hosting's and non can compete"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "GODZCLAPS",
          "Nb_Reviews": 2,
          "Date": "2023-10-12T05:07:24.000Z",
          "Titre": "Feedback",
          "Contenu": "This service is super reliable they helped me so much!Special thank you to Usman S. he has been really helpful with dedicating his time and efforts to providing me the best reliable server. Thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TSmith Gaming",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T05:17:34.000Z",
          "Titre": "Very Good",
          "Contenu": "Usman S was a very helpful person! Got my issue resolved very fast!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C K",
          "Nb_Reviews": 3,
          "Date": "2023-11-22T16:50:51.000Z",
          "Titre": "Usman S helped me a lot with my new…",
          "Contenu": "Usman S helped me a lot with my new server! I’m looking forward to this new experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Josh",
          "Nb_Reviews": 2,
          "Date": "2023-12-06T02:32:35.000Z",
          "Titre": "fast response",
          "Contenu": "fast response, know what they are doing, and really helpful"
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "scar face",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T20:26:06.000Z",
          "Titre": "5 starts",
          "Contenu": "quick response from Saad A"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ethan Lupton",
          "Nb_Reviews": 2,
          "Date": "2023-11-03T01:57:29.000Z",
          "Titre": "Muneeb R.",
          "Contenu": "great support i took a while to respond but it took him seconds to reply best  service ever fixed my problem in a flash even at 12 am"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Adam Strachan",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T13:54:22.000Z",
          "Titre": "Fantastic customer service!",
          "Contenu": "This company is fantastic. I’ve hosted games on other server sites and they have always been like “figure it out” kind of people and just take your money. But this site is willing to help you, and even fix the problem for you. They even loaded my modded Minecraft pack on my server and set it up for me! Customer for life!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bricks Montana",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T14:25:09.000Z",
          "Titre": "Usman S was extremely helpful and…",
          "Contenu": "Usman S was extremely helpful and unbelievably fast at responding to my messages. I was very impressed with how effortless it was to have my problem resolved."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nicholie Semento",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T02:17:34.000Z",
          "Titre": "Usman T",
          "Contenu": "thanks to Usman T"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steven Scott",
          "Nb_Reviews": 2,
          "Date": "2023-12-11T21:47:06.000Z",
          "Titre": "i needed my server wiped and Muneeb R…",
          "Contenu": "i needed my server wiped and Muneeb R helped me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "J .",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T10:37:44.000Z",
          "Titre": "Usman S really helped me a lot",
          "Contenu": "Usman S really helped me a lot, figured out the issue and solved it immediately. Even really late at night!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Weeduh Peepool",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T12:02:59.000Z",
          "Titre": "this guy spent alot of time helping me…",
          "Contenu": "this guy spent alot of time helping me with my problem and he figured it out"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jonah Thetford",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T13:48:50.000Z",
          "Titre": "Great experience, they make it fun and easy for all.",
          "Contenu": "I just started out with learning how to create a server and mod games.  Rocket node has been there to help along the way with figuring certain things out.  Great team, great company and a lot of help for someone learning."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan Smith",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T08:52:13.000Z",
          "Titre": "Usman S Rating from ThatGuyRyan",
          "Contenu": "Usman S Rating from ThatGuyRyanUsman S. Was a amazing help and awesome at awnsering all my questions/concerns."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Zaid",
          "Nb_Reviews": 4,
          "Date": "2023-10-13T08:27:36.000Z",
          "Titre": "Saad A was really helpful",
          "Contenu": "Saad A, helped me with some fast support today at rocketnode. These guys are always willing to help and support theyre community. Definitely recommended."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eddie Mendez",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T11:15:52.000Z",
          "Titre": "Usman T Was a very helpful person to…",
          "Contenu": "Usman T Was a very helpful person to getting my sql working for me!!! Also Muneeb R. was very helpful as well overall amazing support"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack K",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T12:54:04.000Z",
          "Titre": "Usman S Helped a lot in discord!",
          "Contenu": "Usman S Helped a lot in discord! Solved all the issues and got my server  running. Great guy like always."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rafferty Hasher",
          "Nb_Reviews": 1,
          "Date": "2023-10-13T18:24:41.000Z",
          "Titre": "Amazing and reliable",
          "Contenu": "Amazing and reliable, helped every step of the way. The employees from this company made everything run sp smoothly would definitely recommend"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Legend Bub",
          "Nb_Reviews": 1,
          "Date": "2023-11-20T17:28:43.000Z",
          "Titre": "Best Customer Service!!",
          "Contenu": "To be honest, one of the best customer service's i've ever experienced paired with the best pricing on the market for a FiveM Hosting, really recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cergio Bravo",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T07:39:57.000Z",
          "Titre": "Usman S was incredible i felt like i…",
          "Contenu": "Usman S was incredible i felt like i was bothering him but he helped me alot to fix something on my server"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anzix Gaming",
          "Nb_Reviews": 3,
          "Date": "2023-10-04T07:10:10.000Z",
          "Titre": "Usman S For Team Lead!!",
          "Contenu": "Usman S For Team Lead!!! He was the most helpful Support Operator and he desereves it. He always helps and he even can understand angry customers."
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Jeff Fillo",
          "Nb_Reviews": 3,
          "Date": "2023-12-17T16:33:21.000Z",
          "Titre": "Very profesional hosting",
          "Contenu": "Very profesional hosting, helpful admins and comunity."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Ethan Lupton",
          "Nb_Reviews": 2,
          "Date": "2023-10-09T14:12:53.000Z",
          "Titre": "fixed my exact problem instantly very…",
          "Contenu": "Muneeb R fixed my exact problem instantly very helpful amazing customer support and did it again today thanks a lot"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "kommandant_nacht",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T05:53:41.000Z",
          "Titre": "Usman S.",
          "Contenu": "Usman S. This support agent was, very straight to the point solved my issue the second I read what he said, fast response excellent support agent."
        },
        {
          "Note": 5,
          "Lieu": "NO",
          "Pseudo": "Alexander Thorsen",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T22:51:05.000Z",
          "Titre": "Muneeb R was helpign me and my fiend…",
          "Contenu": "Muneeb R was helpign me and my fiend good and we foudn out what we need love the help"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Donuts",
          "Nb_Reviews": 2,
          "Date": "2023-09-30T16:09:56.000Z",
          "Titre": "Rocketnode is great!",
          "Contenu": "Usman has helped us a few times this week, and he's amazing. Very satisfied with Rocketnode as a provider, they're quick to help and fix things."
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "ohmjerome",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T17:06:06.000Z",
          "Titre": "Support was amazing",
          "Contenu": "Ticket support was extremely quick and i had my questions answered very kindly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Snorff",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T07:42:28.000Z",
          "Titre": "Usman S",
          "Contenu": "very helpful and knew what to do and got it done in a short time 10/10"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Marcus Phillips",
          "Nb_Reviews": 8,
          "Date": "2023-10-07T01:17:14.000Z",
          "Titre": "“I highly recommend this business.”",
          "Contenu": "“I highly recommend this business.”“Their customer service is second to none.”“The product quality is consistently outstanding, exceeding my expectations every time.”“I was completely impressed with their professionalism and customer service.”thanks to gravedigger001! for all the support for today"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C K",
          "Nb_Reviews": 3,
          "Date": "2023-12-01T03:02:11.000Z",
          "Titre": "once again Usman T helped out…",
          "Contenu": "once again Usman T helped out tremendously!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Virtarius Benton",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T20:28:19.000Z",
          "Titre": "Usman t best helper",
          "Contenu": "Usman t. fast response with clear instructions on what i needed very helpful all the time thanks so much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "pollark",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T23:14:22.000Z",
          "Titre": "Give a try!",
          "Contenu": "rocketnode is the best, I couldn't get people in my server, and I couldn't even join my own server, but with rocketnode, it does the job."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cypher Alt",
          "Nb_Reviews": 2,
          "Date": "2023-09-28T06:32:38.000Z",
          "Titre": "Good customer service and pricing",
          "Contenu": "Good customer service and pricing, cusman330 did an amazing job, I hope hell get an promotion he really deserve it thank you again sir :)"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "xx wolf",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T22:29:10.000Z",
          "Titre": "Fast support TYSM!",
          "Contenu": "So fast at responding helped me immediately these guys defo know what there doing TYSM"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chris Wells",
          "Nb_Reviews": 1,
          "Date": "2023-11-06T07:57:59.000Z",
          "Titre": "the support is really grate they are…",
          "Contenu": "the support is really grate they are patent and will help when they are available i recommend"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Vanity",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T07:54:22.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, great hosting, & usman you da best man, thanks for everything."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Marrero",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T08:51:51.000Z",
          "Titre": "Saad A",
          "Contenu": "Saad A. Helped me figure out the issues i was having with my server with ease Thanks for having great support team members"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brennan Goodman",
          "Nb_Reviews": 1,
          "Date": "2023-10-18T22:54:15.000Z",
          "Titre": "Shawkat and muneeb W help out a lot…",
          "Contenu": "Shawkat and muneeb W help out a lot definitely want them to be my support in tickets all the time ❤️"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Zaid",
          "Nb_Reviews": 4,
          "Date": "2023-10-30T19:47:01.000Z",
          "Titre": "Muneeb helped me fix my server issues",
          "Contenu": "Muneeb helped me fix my server issues. Thanks to rocketnode for the fast services."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-11-21T16:05:04.000Z",
          "Titre": "Hands down best Customer service and services",
          "Contenu": "So I was originally with another provider and was having troubles with getting the server to work the other provider was not much help so I went Into the rocketnode discord and asked for help although at the time I was not a rocketnode customer they fully supported me in getting the server working. After they had helped me I then decided to leave the other server provider and went to rocketnode, hands down the best customer service/support and the hosting of the server I can not fault 10/10 highly recommend this provider, Thankyou"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ci Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T00:29:24.000Z",
          "Titre": "Saad A",
          "Contenu": "Saad A. exceptional help and very knowledgeable."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "RWRP Roleplay",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T17:46:16.000Z",
          "Titre": "rocketnode review",
          "Contenu": "great service muneeb r was a great guy helped alot im new to all this so it helped he took me on a step by step guide"
        },
        {
          "Note": 5,
          "Lieu": "CZ",
          "Pseudo": "Lay Zey",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T18:18:53.000Z",
          "Titre": "Fast and efficient",
          "Contenu": "Muneeb R. Was fast and efficient at answering my question"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "J-red Bargan",
          "Nb_Reviews": 3,
          "Date": "2023-11-08T09:03:12.000Z",
          "Titre": "Clear and patient",
          "Contenu": "Clear and patient! Customer/support service is really good! Thanks Usman!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Cypher Alt",
          "Nb_Reviews": 2,
          "Date": "2023-09-29T23:25:42.000Z",
          "Titre": "GOod support answer fast and helped me…",
          "Contenu": "GOod support answer fast and helped me tofix my problem in my server thanks to muneeb amazing work"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "C K",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T11:05:01.000Z",
          "Titre": "Usman S has helped me out a lot",
          "Contenu": "Usman S has helped me out a lot! This is not the first time. I am new to all of this and he has helped me through almost every step!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MollyTov",
          "Nb_Reviews": 1,
          "Date": "2023-11-10T08:45:24.000Z",
          "Titre": "Matt W.",
          "Contenu": "I had just gotten a server a few hours ago and was having trouble setting up a modpack Matt was quick to reply very friendly and patient with me and overall just very very helpful had the server with the modpack setup for me in under an hour great first impression with how good their support is :)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cache Chanell",
          "Nb_Reviews": 1,
          "Date": "2023-11-17T22:39:44.000Z",
          "Titre": "Very helpful and understanding Muneeb R…",
          "Contenu": "Very helpful and understanding Muneeb R is who helped me"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "George",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T00:30:11.000Z",
          "Titre": "Muneeb R is the goat",
          "Contenu": "Muneeb R is the goat! helped me immediately and resolved my problem's with no issues!"
        }
      ]
    }
  ]
}