{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "savegadget.com",
      "Review": [
        {
          "Note": 1,
          "Pseudo": "Tt Blessed",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T10:35:34.000Z",
          "Titre": "Still waiting for payment..a over a…",
          "Contenu": "Still waiting for payment..a over a week later. Not forthright w offer half like many reviews say. keep waiting for payment but they have expensive phone mailed in n trust. I see lots of folks saying same gets pushed by baiting folks with 600 or 700 dollar or 800 offer get your phone and email low ball to 200 say it's a junk phone parts  and then never to b heard from. L. Thought of calling authorities if don't receive money or phone back."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jarrod",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T00:32:26.000Z",
          "Titre": "I feel scammed",
          "Contenu": "I feel scammed that I was only offered half of the offer price.  I wiped the phone and removed the sim card. After arrival, they emailed me several times asking for the \"old password\" I'm not sure why this is needed as the device was wiped. After giving all my old passwords, they still claimed they couldn't format it, but somehow offered me half as much. Because it was taking too much time I accepted the lower offer. Not sure what they could do with the phone if they truly couldn't get access."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nader",
          "Nb_Reviews": 2,
          "Date": "2023-11-26T20:23:57.000Z",
          "Titre": "Untrustworthy",
          "Contenu": "Sent my phone to them in mint condition. They claimed it was scratched and downgraded my offer (I always had a screen protector on it, never a single scuff or scratch). Declined their offer and received my phone back with 5 scratches on the screen. SCAM- BEWARE OF SAVEGADGET"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tyler Stump",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T23:43:39.000Z",
          "Titre": "Sold my 13pro since I got a 15pro.",
          "Contenu": "I sold my phone that was always in a case with the original box and charging cord. I was then told the damage was excessive, enough to knock it down a tier. I think they did this due to the decrease in trade values because of the 15 and 15pros coming out. Then paypal didn't trust save gadget and were going to hold the funds for 2 weeks. Never going yo trade to them right as a new model comes out."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victor Hurtado",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T01:11:54.000Z",
          "Titre": "Disappointed, the phone I sent was in excellent condition",
          "Contenu": "The iPhone 12 Max I sent was in excellent condition. Always had a protective case and glass shield. However, they only paid $378.00. Instead of the $500.00 their system said I was going to receive. You are better off selling through another company. In addition, I decide to get the money via PayPal, I've been doing business with that platform for many years, and not until I did business with SaveGadget, I got a fraudulent invoice from a scammer. coincidence...?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Pison",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T00:26:24.000Z",
          "Titre": "Not good",
          "Contenu": "The communication (emails) was lacking & poor . I would not describe the process as fast but rather slow (it took almost a month to process) and I believe I may still be waiting for my payment if I had not had to complain to mother company Cellsell . In the future I would avoid this company and not recommended them to others based on my recent experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandeepa Surya",
          "Nb_Reviews": 3,
          "Date": "2022-12-05T23:43:06.000Z",
          "Titre": "They paid me WAY less money then…",
          "Contenu": "They paid me WAY less money then originally promised. My phone had one thing wrong with it. The screen wasn't even cracked! If they were going to change the payment amount, they should've at least notified me before issuing a check. I will never use this company again and I don't recommend them"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "陳宇鎮（陳老師）",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T07:08:55.000Z",
          "Titre": "Many good comments here are operated by their own company..."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Edie Corbett",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T17:21:16.000Z",
          "Titre": "I sent in an Apple Watch phone seven…",
          "Contenu": "I sent in an Apple Watch phone seven series in perfect condition and I got a email after they received it stating that my watch is completely smashed. When I asked for the missing a picture, they refused to. And then told me that all part of my watch was smashed. They can’t get the story straight. They can send me a picture so now I’m waiting to see when my package comes back if it’s even my watch and what they did to it. Very disappointing. Will never use them again I think they should be looked into fraud."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Smith Poston II",
          "Nb_Reviews": 2,
          "Date": "2023-04-26T12:45:00.000Z",
          "Titre": "The online quote for my iPhone 11 with…",
          "Contenu": "The online quote for my iPhone 11 with a cracked screen in good condition was allot more than what they actually paid me. It’s was well below $100 even after I had them pay me $70 for it. I felt like I had been scammed when I was told it was only worth $44.00. I will never do business with this place again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Andrea",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T18:07:32.000Z",
          "Titre": "Was not offered what I was promised…",
          "Contenu": "Was not offered what I was promised originally and was not offered but ten bucks on other item and still yet to received it and had item over two days before contacting me to make a ten dollar offer."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jonathan",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T04:32:31.000Z",
          "Titre": "I sent in a perfectly good phone and I…",
          "Contenu": "I sent in a perfectly good phone and I got an email saying there was problems with the phone so they paid me less than what was promise."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T14:52:09.000Z",
          "Titre": "They try and convince you that you sent…",
          "Contenu": "They try and convince you that you sent in a lower model phone so they don't have to pay you as much. Unfortunately at the time I fell for it, but when I sold the case to that phone I realized the original request I put in was correct. They scammed me out of almost $100.  Reply to company: They can say whatever they want. I got scammed out of my money. Please do not sell to these people."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mac McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-04-18T17:56:03.000Z",
          "Titre": "They quoted me 1740",
          "Contenu": "They quoted me 1740. Then when they got the phones they said 800. Then we agreed on 1400 and they sent 1350. I would never do business with them again personally. Bad first experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jacqua Hart",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T19:40:21.000Z",
          "Titre": "I sent in my s22 ultra for a quote of…",
          "Contenu": "I sent in my s22 ultra for a quote of over $400 free of and cracks and I looked it over and have pictures before being sent in box and once they inspected it they said it had cracks all of a sudden so they lower the price to 150 I am never using this company again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Omer Trout",
          "Nb_Reviews": 2,
          "Date": "2022-09-17T17:31:54.000Z",
          "Titre": "Trade-in number 24276",
          "Contenu": "Trade-in number 24276I  received at check for $65.00.This is way short of what you agreed to pay: $266.00Please send the additional $201.00 As soon as possible"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chaney Mckinley",
          "Nb_Reviews": 1,
          "Date": "2023-08-23T06:10:03.000Z",
          "Titre": "Scam and damage my phone",
          "Contenu": "Savegadget: We've inspected your device(s) and noticed some differences in condition you listed your gadget. Inspection results: During the inspection, we found that the phone has scratches on the frame, scratches around the charging port; Scratches on the screen. As per the \"Mint\" condition description, a device visually should have no wear and tear, has absolutely no scratches, scuffs, or other marks, and looks brand new. In case when the device has scratches and dings, it will classify as Good condition. The adjusted Offer is $691 (the original offer was $813)Me:There aren’t no scratches or damages on my iPhone 14 pro max. I examined my phone throughly on all sizes and I’ve gotten my phone inspected just in case something like this would to occur. It’s in perfect condition I recorded my phone before and after as I was sending it out I’m not sure if your intention is to lowball me but I know my phone is worth $800+. If you disagree with the original offer then you can send my phone back. If there’s appear to be any damages on the phone what’s so ever you will be held liable  for any damages to my phone IPhone 14 pro max.On Aug 16, 2023, at 7:38 AM, Michael savegadget.con wrote: We Hello, Thanks for the quick reply.I see that iPhone has scratches on the frame, scratches around the charging port; Scratches on the screen.Unfortunately, due to these findings, we can accept the phone as Good, not Mint.What would be the best offer you would accept for this iPhone?We are trying to close the deal.Regards,MichaelMe: I’m no longer interested in doing business with this company I see that ya’ll intention is to lowball me again I have proof that my phone is in excellent condition there are no scratches on the phone  if the original offer isn’t what you trying to offer me then you can send me back my phone.On Aug 16, 2023, at 2:37 PM, Michael savegadgadget Sure, we will return it back to you.Regards,MichaelMe: You lied and said there were scratches on my iPhone 14 pro max and underneath the bottom part of my phone.  There are no scratches. I received my phone today and I notice they’re a white spect on the left side of my phone that wasn’t there before. I’ve mentioned before any damage on my phone during the time it was in  savegadget care Savegadget is responsible for the full pay out of the phone. My iPhone 14 pro max is consider as damaged. This can be resolved before legal matter takes place. Compensate me how? I can send the phone back and get the offer that was mention before or legal matters will be placed.On Aug 22, 2023, at 8:55 PM, Michael savegadget﻿Good evening,Just to let you know, we have received the phone in the condition described in the inspection results.We do not damage customers' devices. Our inspection process is strict and straightforward.We have returned the phone to you in the same condition we received it. Unfortunately, we won't be able to payout for the phone.Regards,Support - SaveGadgetThis company constantly lie to customers do not go to this company they’re scammers take my word don’t go to them!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Q. Morris",
          "Nb_Reviews": 1,
          "Date": "2021-11-14T03:57:58.000Z",
          "Titre": "“BUYERS BEWARE…",
          "Contenu": "“BUYERS BEWARE “!!!Incompetent!Low~balled me after agreeing to a different price!Never again!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Herman HAJI",
          "Nb_Reviews": 2,
          "Date": "2021-05-21T23:39:19.000Z",
          "Titre": "I'm so disappointed with this company…",
          "Contenu": "I'm so disappointed with this company they deceived the customers they give you a pricing quote but later they give you BS excuses and change the price if you disagreed and you want your cell phone back they want you to pay $20 for postage in advance so please don't trust them try another company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "SWil",
          "Nb_Reviews": 1,
          "Date": "2022-10-04T23:09:02.000Z",
          "Titre": "they will cheat you!",
          "Contenu": "Save gadget gave me $5 for my Iphone X which was completely paid for and unlocked. they tried to claim it was still locked. won't use them again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Omer Trout",
          "Nb_Reviews": 2,
          "Date": "2022-09-21T17:37:52.000Z",
          "Titre": "Trade in Number 24276",
          "Contenu": "Trade in Number 24276I wrote a review 2 days age, my payment was short $201, WHERE IS THE MONEY DUE ME. PLEASE REPLY !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Richard Bailey",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T18:13:43.000Z",
          "Titre": "Sent in iPhone 13 pro",
          "Contenu": "Sent in iPhone 13 pro.  They claimed I sent an iPhone 12 Max.  I didn't own an iPhone 12 Max.  Somewhere phones got switch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T13:20:48.000Z",
          "Titre": "Have never received my check!!!!!",
          "Contenu": "Have never received my check!!!!!! Very Disappointed!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MC",
          "Nb_Reviews": 2,
          "Date": "2021-12-12T06:14:51.000Z",
          "Titre": "They lure you in and and then change up…",
          "Contenu": "They lure you in and and then change up the offer last minute. Go elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Reid",
          "Nb_Reviews": 2,
          "Date": "2023-02-22T18:16:00.000Z",
          "Titre": "I was told my S22 was worth $282 but…",
          "Contenu": "I was told my S22 was worth $282 but was sent $253 instead.  Bait and switch."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ej",
          "Nb_Reviews": 2,
          "Date": "2023-11-09T00:01:43.000Z",
          "Titre": "Price was lower than quoted"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "JOHN",
          "Nb_Reviews": 2,
          "Date": "2023-02-20T05:38:25.000Z",
          "Titre": "It’s going on 2 weeks and I still…",
          "Contenu": "So it’s been over  2weeks and I still haven’t been paid…."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rc",
          "Nb_Reviews": 1,
          "Date": "2022-02-01T04:53:05.000Z",
          "Titre": "Money still on hold in PayPal after 8…",
          "Contenu": "Money still on hold in PayPal after 8 days…"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Joshua Spradlin",
          "Nb_Reviews": 2,
          "Date": "2023-05-31T23:07:21.000Z",
          "Titre": "Gave me a lot less than they offered"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Doyle Smith",
          "Nb_Reviews": 1,
          "Date": "2023-10-09T04:41:51.000Z",
          "Titre": "Bait and switch don’t use!",
          "Contenu": "This company did what I call the bait and switch they give you a high or highest bid offer for your phone then when they receive it it’s a different story and one of the excuses they gave me after I’d sent them my phone was that it wasn’t paid off so that ended up knocking off like 200 or more off the original appraisal they had all the info before they received the phone so if that was the issue they should have mentioned that from the beginning I don’t recommend using there service I regret it and there rip off tactics are deceiving by offering the highest dollar for your phone to get it in there hands then your f****d!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jamie Macnealy",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T22:09:38.000Z",
          "Titre": "Not honest, would recommend you sell elsewhere.",
          "Contenu": "There are definitely some things that could be improved on and honesty is a must, and this company lacks that. First thing that needs improvement is the fact people are sending in devices worth a lot of money, yet can't see updates on where their package is?? Seems so outdated to me considering it's 2023 and every other buyback site allows for updates on where your package is, yet on here I had no clue if it was ever scanned at the post office. Second things that needs improvement is the fact there was absolutely no way to accept or decline the updated offer, leaving me to believe they just hope people won't respond and by default except the much lower price. They also are very dishonest and it proves it when I got a quote for Samsung Galaxy 23 128 GB at $401, but sent them a Samsung Galaxy s23+ 256 GB, which they pay $551 for. After the review they said it was financed so only offering me $168, but failed to mention the $150 increase because it was a better phone. It's unfair to take advantage of people and even worse to make them jump through hoops to receive they are deserved. I am hoping it doesn't take forever for a response from customer service as I need this money for my son's wedding in September."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "AVN",
          "Nb_Reviews": 6,
          "Date": "2023-04-26T22:49:04.000Z",
          "Titre": "PayPal Fees charged. You will not get agreed price.",
          "Contenu": "Sent in phone and they came back that it was still somehow connected to the carrier and they could not resell. Cleared up with carrier and responded the same day. It took more than a week - after numerous emails to get a response. Opted for PayPal payment but was charged a fee by PayPal. I suspect that SaveGadget put it as an immediate payment that resulted in the charge. If not they should explicitly state that you will not get the agreed upon price as PayPal will deduct a fee. If SaveGadget is charging the fee for using PayPal, then the payment should be increased to reflect the agreed upon price."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Reina Hamasaki",
          "Nb_Reviews": 1,
          "Date": "2021-07-26T01:22:49.000Z",
          "Titre": "Nothing wrong with the service it was…",
          "Contenu": "Nothing wrong with the service it was great however I have not yet received payment due to PayPal holding my money. If it’s easier to get funds without having to jump through useless hoops that would be great. Would still try again just a different payment form"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "FARAZ ANWAR",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T18:58:36.000Z",
          "Titre": "later offer reduced",
          "Contenu": "I marked mint condition and it was so but they reduced nearly $120 on phone later saying it has dents, which it never had"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "CLeon",
          "Nb_Reviews": 1,
          "Date": "2022-09-16T18:28:36.000Z",
          "Titre": "ok, amount got reduced",
          "Contenu": "my amount got reduced by 50%....."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "D Nice",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T21:50:05.000Z",
          "Titre": "I didnt like how they dont list what…",
          "Contenu": "I didnt like how they dont list what will make the phone depreciate in value."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Vic Sangveraphunsiri",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T22:20:59.000Z",
          "Titre": "The actual price is far below the…",
          "Contenu": "The actual price is far below the offering price.  The price is unclear and below the market price by more than 10%. However, I received the money very click via Paypal that I had to pay a 4% fee.  Venmo would be a better choice but it does not offer for me."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Good Samaritan",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T18:49:41.000Z",
          "Titre": "Karma sucks",
          "Contenu": "Well I'm pretty sure my screen had no cracks on it or at least before I sent it there's no cracks on it I do have pictures before I sent it also I don't know how there was dings or dents on the other parts from the day if left the store it's been in a phone case so but y'all were the only ones that didn't  ask if the phone was paid off or not which it's not it was just rooted to make it look like it was. So karma sucks that's why I didn't complain"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ronnie Bognanni",
          "Nb_Reviews": 2,
          "Date": "2023-03-27T22:57:48.000Z",
          "Titre": "MYoffer on a brand new iphone14 was 40…",
          "Contenu": "MYoffer on a brand new iphone14 was 40 dollars lower than expected. I m also still waiti g on my check for 550 for my unlocked iphone14. Next time if ever I go somewhere else. Check me out on youtube @Cracker321"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ann",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T09:34:33.000Z",
          "Titre": "My experience with Save Gadget was not as good as I had hoped …",
          "Contenu": "My experience with Save Gadget was not as greats I thought it would be.  The quote for my iPhoneX working ,with a cracked screen was around 70$. I was able to print a label and mail them my phone with no issues. The amount I finally was quoted was 18$.  The battery health was low and that took off another 50$??   Wouldn’t that be included in the refurbishing process anyways.  I had a problem logging into my account and customer service was very quick answer my email & help.   I was expecting a digital check , I check my email for a week and nothing came.  I had two unanswered emails to support and then a paper check arrived in the mail.  It was at least 15 days from when I sent the phone.  I was not impressed with this service."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "R. A. Dapaah",
          "Nb_Reviews": 3,
          "Date": "2023-04-04T19:26:53.000Z",
          "Titre": "The language and reasoning given for…",
          "Contenu": "The language and reasoning given for the reduction in value was not professional and ruined the customer experience. For a 15% reduction in value, your company should have honored the initial amount rather than leaving the customer with the feeling of bait and switch."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brian R",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T03:49:17.000Z",
          "Titre": "Free label was unusable, reimbursement denied for a proper label",
          "Contenu": "I recently completed an iPhone trade-in with SaveGadget. While they made a competitive offer which they honored without complications, and had a quick turnaround time, I wasn't very impressed with their customer service. They claim to provide a \"free pre-paid shipping label\" for trade-ins, but their label ended up being unusable for my particular case. They provided me with a USPS First Class shipping label. For those unfamiliar with USPS shipping regulations, USPS does not permit shipment of cell phones with a lithium battery via a First Class label. Unfortunately, I found this one out the hard way and the label was refused at the counter. I was forced to pay $10.50 for my own Retail Ground label, since walking away wasn't exactly an option when I also needed to pay for and pack a box on-site. I immediately documented the issue in a support e-mail to them after sending the package out and requested reimbursement for the corrected label. SaveGadget didn't bother to get back to me until after they processed the trade-in, refused to reimburse me, and ghosted me when I explained they made an error with their shipping label and was denied a good faith attempt to use it. It didn't seem very fair to me that I have to bear the cost of their mistake. I can't help but feel misled and swindled, and assuming they won't make this right, will likely avoid trading with them again. It's disappointing that an otherwise decent experience was tarnished by an unreasonable insistence on policy."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "文景灏",
          "Nb_Reviews": 1,
          "Date": "2022-03-30T00:14:09.000Z",
          "Titre": "Hadn't get payment until I submit for…",
          "Contenu": "Hadn't get payment until I submit for request after 5 days they received the item. Got the payment finally."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Qiana Boltom",
          "Nb_Reviews": 1,
          "Date": "2022-03-28T21:22:40.000Z",
          "Titre": "They shorted me almost $10 by charging…",
          "Contenu": "They shorted me almost $10 by charging a fee for receiving my proceeds from PayPal."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mitch",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T23:28:56.000Z",
          "Titre": "Wouldn’t recommend",
          "Contenu": "Wouldn’t recommend. High offer and then switch later."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Christian M Lamb",
          "Nb_Reviews": 1,
          "Date": "2023-02-08T21:37:20.000Z",
          "Titre": "Was quote $833 and only got $417 after…",
          "Contenu": "Was quote $833 and only got $417 after it was all said and done.I feel like we were ripped off."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dorothy Schwarz",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T13:58:32.000Z",
          "Titre": "Honesty Counts",
          "Contenu": "Being handicapped makes one very vulnerable, and once having been badly scammed on the internet, I was very reluctant to try again to enter into a transaction of selling my phone on line. From the start, however,I felt secure with SafeGadget. Everything was transparent and “up front”, I wished I was offered a better price, but it was a fair and competitive one and more importantly an honest and safe one. I highly recommend SafeGadget to anyone looking for a safe place to do business! Grateful customer"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "DAG",
          "Nb_Reviews": 1,
          "Date": "2022-06-14T21:18:52.000Z",
          "Titre": "After inspection the condition of my…",
          "Contenu": "After inspection the condition of my iPhone was downgraded because the battery maximum capacity was 78%.  All that is said about battery life in the FAQs is a battery that lasts less than 1 hour is an issue.  The battery on my iPhone did last much longer than 1 hour.  The battery life issue should be addressed more clearly in the FAQs."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Henry",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T08:23:32.000Z",
          "Titre": "The price might change",
          "Contenu": "I shipped my phone based on an offer I was given. Upon receipt of my phone I received a much lower figure.  It only took 1 email to clarify my position and they immediately reconsidered and approved their original offer. Thank you for being a stand up company."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jaycee",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T15:28:44.000Z",
          "Titre": "Super quick payout...",
          "Contenu": "Super quick payout, this company is the best way to sell your old device! I contacted SaveGadget for a quote and got a response so quickly! They give you more for your items than any other company and the process was extremely fast. I was shocked at the low quote for a iPhone 12 Pro Max even though there was an issue with my device that I wasn't aware of! Would definitely recommend, very honest people."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ralph Montgomery",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T20:01:45.000Z",
          "Titre": "I would provide 5 stars except standards are not clear",
          "Contenu": "I would provide 5 stars, but the standards of the quality of the device apparently are subject to individual interpretation and personal bias. I claimed my device was in Mint condition, less than a year old, no scratches/nicks on the body or frame, yet the receiving staff downgraded it from the maximum to a lower reward. Simply was not clear so I accepted the offer without bias"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Milfrank Combs",
          "Nb_Reviews": 2,
          "Date": "2023-03-10T05:50:47.000Z",
          "Titre": "Phone Sell",
          "Contenu": "Well could have ratings on phones not so microscopic.More pay options.Everything else was excellent."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ryan Johnston",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T14:59:36.000Z",
          "Titre": "Payment was fast",
          "Contenu": "Payment was fast. I did not notice the scratch that they claimed existed, but the payment amount was still more than others offered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Hallam",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T12:47:39.000Z",
          "Titre": "Decent",
          "Contenu": "Paid quickly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alex Kim",
          "Nb_Reviews": 1,
          "Date": "2022-12-13T07:45:35.000Z",
          "Titre": "They initially denied the condition of…",
          "Contenu": "They initially denied the condition of my phone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Donna White",
          "Nb_Reviews": 5,
          "Date": "2021-11-21T01:58:22.000Z",
          "Titre": "Was very easy to do",
          "Contenu": "Was very easy to do.  Just a little slow on receiving payment."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "VS",
          "Nb_Reviews": 1,
          "Date": "2022-05-28T00:27:29.000Z",
          "Titre": "Very nice",
          "Contenu": "I was being offered $5 for a phone and asked for $10. They helped!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hank",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T23:16:58.000Z",
          "Titre": "Too easy",
          "Contenu": "I’ve never sold a phone or other electronic device but decided to give it a try. I discovered SaveGadget on eBay and followed the instructions. Packaged it up and sent it USPS with the postage paid shipping label provided. Got there in a couple of business days, received an inspection the same day that agreed with my assessment, and I received funds via PayPal the next day. Could not have been a better experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel B",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T01:18:39.000Z",
          "Titre": "Easy process!",
          "Contenu": "The whole process was very easy. I was satisfied with the speed of payment and the simple process of sending the device in."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Douglas Peters",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T04:10:58.000Z",
          "Titre": "Great service",
          "Contenu": "Great service.  Easy.  Received payment quickly.  Will definitely use again"
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Alaa Rajab",
          "Nb_Reviews": 2,
          "Date": "2023-12-12T21:56:49.000Z",
          "Titre": "Accurate, fast and responsive",
          "Contenu": "Accurate, fast and excellent customer service. It's a great experience selling with SaveGadget.com"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Felipe R",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T01:30:38.000Z",
          "Titre": "Great transaction very satisfied.",
          "Contenu": "Sold my phone with a cracked back glass which many companies won’t accept. SaveGadget paid a fair price and it was what I was quoted on line, no surprise “damage discovered upon closer inspection”. I will definitely sell them my next used phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T04:43:18.000Z",
          "Titre": "Clear communication and got paid…",
          "Contenu": "Clear communication and got paid quickly once the item was received!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl C.",
          "Nb_Reviews": 3,
          "Date": "2023-11-17T03:53:23.000Z",
          "Titre": "Made the process a breeze",
          "Contenu": "Made the process a breeze, fast service got paid a day later with no issues. Communication was excellent as well, thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Krista",
          "Nb_Reviews": 5,
          "Date": "2023-12-08T00:26:31.000Z",
          "Titre": "They were fast and did what they said…",
          "Contenu": "They were fast and did what they said they would do - pay me for my used phone. It was easy peasy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Jones",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T21:52:54.000Z",
          "Titre": "My experience was excellent",
          "Contenu": "My experience was excellent! I walked in with my iPhone speaker not working well and within minutes the problem was resolved. I highly recommend this local business, in Land O Lakes, FL."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrea Eilts",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T02:52:23.000Z",
          "Titre": "I received payment within 3-4 business…",
          "Contenu": "I received payment within 3-4 business days after shipping them my old phone! I was very skeptical, but was paid via PayPal, and a fair amount given the phone condition. Highly recommend using this service, as the whole process was actually easy and fast, legit payment!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debbi North",
          "Nb_Reviews": 1,
          "Date": "2022-07-07T06:14:59.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Process was pretty straightforward and easy to complete. Unsure why the more damaged an item was it paid a little higher but ok im doing this anyway. Great communication all thru process and everything was in the timeline they said. I opted for paper check which is 1 of several options. Timing from start selling process to check in hand was less than 2 weeks with a holiday in there too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dustin Muse",
          "Nb_Reviews": 2,
          "Date": "2023-02-12T00:32:08.000Z",
          "Titre": "I was so skeptical when I first saw…",
          "Contenu": "I was so skeptical when I first saw this. I just knew it was going to be a scam. Too good to be true. Xfinity offered me $170 for an iPhone 12 Pro Max in pristine condition and was disappointed with the amount but at least knew I’d get the money. You know, since they’re such a reputable company (worst ever I’m now realizing). But I did my research and decided to tell Xfinity they can shove it. Just as SaveGadget explained how it worked was exactly my experience and I received nearly $400 for the phone. Never trade your phone anywhere else except with SaveGadget."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "W. Polk",
          "Nb_Reviews": 1,
          "Date": "2023-07-07T20:57:58.000Z",
          "Titre": "Very Easy",
          "Contenu": "Very smooth, easy experience. I accurately rated the condition of my iPad Air 3 per the definitions andSaveGadget honored the price. And they gave the highest price of the competitors (for my unit at least)."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bobby & Mike Abrams",
          "Nb_Reviews": 6,
          "Date": "2023-01-04T21:01:01.000Z",
          "Titre": "Great!If you enjoy being lied to while getting screwed!",
          "Contenu": "Thank goodness I make of movie of the functionality, the edges, screen, front and back as well as the Serial Number and IMEI, and continued the movie while I wrapped it, sealed it and addressed it.  I was sent a much lower figure with a few pictures of a phone that was not mine.  I asked them to turn on the phone in the pictures to see the serial number and IMEI."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brittany S",
          "Nb_Reviews": 1,
          "Date": "2022-06-15T21:58:59.000Z",
          "Titre": "The shipping process was pretty quick but not payment.",
          "Contenu": "The shipping process was pretty quick and painless but got the payment sent to my PayPal and it still hasn’t been released and it was sent in June first and says won’t be available until June 22nd.. which seems outrageous. So if you’re okay with waiting a while to get your payment then I would recommend them as far as customer service and shipping but not for receiving payment.UPDATE: 20 minutes after this review they responded and contacted PayPal for me and they released the funds. Customer service A+ and appreciate the timely response to my review. Changed from a 2 star review to 5 stars. Would recommends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shane Petty",
          "Nb_Reviews": 5,
          "Date": "2022-06-20T19:45:12.000Z",
          "Titre": "The BEST! Tried several other device buy back sites",
          "Contenu": "Save Gadget is legit. Tried several other device buy back sites. They were trying to low ball me by giving me excuses that something was wrong with the devices. So I sent them to Save Gadget and you gave me an honest assessment and paid out the true value."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T00:06:35.000Z",
          "Titre": "I appreciate the honesty and how…",
          "Contenu": "I appreciate the honesty and how everything was handled. Thank you very much."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wes Yarber",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T21:36:58.000Z",
          "Titre": "They were fair and honest with me",
          "Contenu": "They were fair and honest with me. The screen was messed up real bad to where the FaceTime did not work. They initially updated my quote to reflect that there was more than one issue with the phone which placed it in a lower price bracket. I reached out and asked if they could take a second look as I thought the FaceTime still worked - there was just glass obstructing it. They went out of their way to verify this and make me a better offer while they were in a position of power to not negotiate with me and say “take our initial offer or pay to have it shipped back to you.” I appreciate the way they did business with me and would very much recommend them. Thank you all!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TripletTeenMom",
          "Nb_Reviews": 5,
          "Date": "2021-05-13T21:04:44.000Z",
          "Titre": "Silver lining",
          "Contenu": "I was so disappointed when my husband dropped his Apple Watch and the screen cracked. Nothing else was wrong with it, but obviously it was ruined. It is way too expensive to have the crystal replaced. I was so happy to find SaveGadget, so that I could sell it and it wasn’t a total loss! The process of selling was very easy and sending it back was free and convenient. I will definitely use SaveGadget again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "courtney kelley",
          "Nb_Reviews": 1,
          "Date": "2023-07-01T01:46:06.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service, whenever I had a question or concern they were quick to respond with an answer. Will definitely be using their services again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Deborah Smith",
          "Nb_Reviews": 1,
          "Date": "2022-02-18T03:25:15.000Z",
          "Titre": "Great experience",
          "Contenu": "My Grandson had a iPad with a busted front.it still worked but no one would give us anything for it. Save gadget was easy to work with and was generous with their offer. We received our money in a very timely manner. I would definitely recommend SaveGadget.com LLC."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daniel Rackliffe",
          "Nb_Reviews": 1,
          "Date": "2021-06-24T14:01:33.000Z",
          "Titre": "The phone was compromised with seawater…",
          "Contenu": "The phone was compromised with seawater and according to two repair places it was a lost cause. They offered more for the remnants than any of the other websites I investigated and delivered as promised. It was quick and easy to work with them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nguzel",
          "Nb_Reviews": 2,
          "Date": "2022-02-17T23:29:01.000Z",
          "Titre": "Quick evaluation, fair price and check payment was received several days later",
          "Contenu": "iPhone was evaluated quickly, check payment came in a timely manner. It was extremely easy and convenient, and I got a fair price! Would recommend to anyone trying to get rid of their old phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M P",
          "Nb_Reviews": 1,
          "Date": "2022-10-18T17:27:20.000Z",
          "Titre": "End to end experience with SaveGadget.com",
          "Contenu": "The process to get it appraised was quick and easy and overall timing between finishing that, shipping, getting a notice of its acceptance and receiving a check was really fast. I received exactly what I was offered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tobias Kaplan",
          "Nb_Reviews": 2,
          "Date": "2021-05-04T15:16:09.000Z",
          "Titre": "Super quick payout, worth using!",
          "Contenu": "Super quick payout, honored the quote even though there was an issue with my device that I wasn't aware of! Would definitely sell them stuff in the future, very honest people"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AndyF",
          "Nb_Reviews": 1,
          "Date": "2022-02-24T16:25:19.000Z",
          "Titre": "Recommended!",
          "Contenu": "Super fast processing time and quick payment.  Would not hesitate to do business with again.  I was a bit skeptical sending my phone their, but no issues at all.  Would recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony L.",
          "Nb_Reviews": 1,
          "Date": "2023-09-01T02:14:55.000Z",
          "Titre": "Excellent experience",
          "Contenu": "Excellent experience . I got big money for my old s22 ultra! I received payment 3 days after mailing."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachel Palomino",
          "Nb_Reviews": 2,
          "Date": "2022-06-09T17:22:18.000Z",
          "Titre": "Great communication and understanding",
          "Contenu": "They communicated every step of the way and even gave me grace time to fix an issue on the side of my phone company who hadn't released the phone properly. Would use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JMW",
          "Nb_Reviews": 2,
          "Date": "2021-07-20T13:22:01.000Z",
          "Titre": "Issue solved quickly and efficiently",
          "Contenu": "I sent in 2 products, but was only paid for 1 of them... to their credit, they fixed it immediately upon my emailing them about the problem and sent payment for the second item.Despite the hiccup, I'm very happy with this company.  100%, would recommend their service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bledins EPIC Adventures!",
          "Nb_Reviews": 2,
          "Date": "2022-01-23T20:48:34.000Z",
          "Titre": "Smooth quick experience!",
          "Contenu": "Smooth, informative, & quick experience. I received payment quickly! Was able to print the pre-paid label with ease & ship same day! $ was in my account within days! 🙃 Great communication throughout entire process!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kierra Kennedy",
          "Nb_Reviews": 1,
          "Date": "2022-03-11T22:24:27.000Z",
          "Titre": "Self-explanatory process",
          "Contenu": "The process was easy! Customer service was really nice when asking about what happens next when shipping items. Super fast response time."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 5,
          "Date": "2023-10-17T00:21:30.000Z",
          "Titre": "On time payment",
          "Contenu": "On time payment, no issues with condition of phone sent in"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joseph Isenhoward",
          "Nb_Reviews": 1,
          "Date": "2021-04-27T21:47:54.000Z",
          "Titre": "Quick Payout",
          "Contenu": "SaveGadget gave me a great price on my old device. The shipping process was super easy and they processed the item very quickly and paid out fast. I would definitely recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mish",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T02:41:47.000Z",
          "Titre": "No hassle",
          "Contenu": "Fair offer, quick assessment of my device, and then quick payment.  Not every sale of a device is this simple and hassle free.  I appreciate you and I will gladly look to your company in the future."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Courtney White",
          "Nb_Reviews": 1,
          "Date": "2023-09-13T12:18:54.000Z",
          "Titre": "Great price for my phone",
          "Contenu": "Great price for my phone, fast and easy.Customer service and fast responses were wonderful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "HRO",
          "Nb_Reviews": 1,
          "Date": "2022-09-26T14:24:03.000Z",
          "Titre": "Highly recommend",
          "Contenu": "Great experience. Easy return, got paid exactly what was advertised. The pay was better than what I got at other websites."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Holden",
          "Nb_Reviews": 1,
          "Date": "2022-08-16T14:43:23.000Z",
          "Titre": "Prompt communication and quick turnaround.",
          "Contenu": "Prompt communication and quick turnaround once they received my phone. And they offered the best trade-in amount. Very satisfied."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-01-15T21:01:36.000Z",
          "Titre": "Process was fast and easy and I got a…",
          "Contenu": "Process was fast and easy and I got a very fair price for my iPhone. Payment was prompt and worry-free. Communication was excellent."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LaDonna Parker",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T01:52:02.000Z",
          "Titre": "Absolutely professional and the best…",
          "Contenu": "Absolutely professional and the best service . I would definitely recommend anyone trying to sell anything . Please go here ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Allison Hawksley",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T22:26:04.000Z",
          "Titre": "Super quick and easy to use",
          "Contenu": "Super quick and easy to use! Customer service responded really fast and I got the money in my paypal account faster than I expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jordan D.",
          "Nb_Reviews": 1,
          "Date": "2021-11-25T05:59:52.000Z",
          "Titre": "Quick, easy, and reliable.",
          "Contenu": "I couldn’t be happier with my experience. Everything was quick, straightforward, and I received the quoted price. I’ve already recommended SaveGadget to several friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron J.",
          "Nb_Reviews": 3,
          "Date": "2021-05-25T08:44:57.000Z",
          "Titre": "SaveGadget is AWESOME!!!",
          "Contenu": "Excellent trade-in offers, great customer service, and very fast at assessing devices & remitting payment for them!  What's not to like!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "JS",
          "Nb_Reviews": 1,
          "Date": "2022-05-18T21:39:15.000Z",
          "Titre": "No-Brainer!",
          "Contenu": "Fast service. Simple process. And they Venmoed the amount as promised with no issues. Can’t recommend enough!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ivan Avramov",
          "Nb_Reviews": 1,
          "Date": "2021-08-19T05:50:17.000Z",
          "Titre": "Great and reasonably fast service. No hidden fees",
          "Contenu": "Got exactly what I expected with a pre-paid label and no hassle. It took a while for the check to show up in the mail, but it did come through. Overall, the process took ~4 weeks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rex Riell",
          "Nb_Reviews": 1,
          "Date": "2022-08-09T16:08:29.000Z",
          "Titre": "It was an excellent experience",
          "Contenu": "It was an excellent experience, the agent to help me give me choices and made the experience great. I would highly recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cesar Maldonado",
          "Nb_Reviews": 1,
          "Date": "2023-11-15T06:11:35.000Z",
          "Titre": "Responsive",
          "Contenu": "Responsive, fast, and very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gregory Messer",
          "Nb_Reviews": 1,
          "Date": "2023-03-20T21:38:55.000Z",
          "Titre": "S22 ULTRA SALE",
          "Contenu": "After Savegadget recieved my S22 ultra on day one, the check was in the mail on day two. The check was for the exact amount quoted."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T02:14:41.000Z",
          "Titre": "Asked for quote",
          "Contenu": "Asked for quote, the price was much better than the other web sites!!!!!Printed the free shipping label and in about a week I have the check at the house. Just 3 words:Great price. Fast service. Very good place to do business with. Thank you very very much GREAT SERVICE RICKY C. San Diego, CA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Juan Rivera",
          "Nb_Reviews": 3,
          "Date": "2023-05-15T23:29:51.000Z",
          "Titre": "The process was very fast and easy",
          "Contenu": "The process was very fast and easy. I printed the label provided and made sure my phone was properly wrapped. It made it to the shop in 2 days and they checked it out and issued my money that day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "NellyB",
          "Nb_Reviews": 1,
          "Date": "2023-09-15T17:35:32.000Z",
          "Titre": "Easy process",
          "Contenu": "Process from start to finish is very easy and efficient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "OBAS",
          "Nb_Reviews": 2,
          "Date": "2022-05-04T20:59:32.000Z",
          "Titre": "Great company and Thanks to Micheal his…",
          "Contenu": "Great company and Thanks to Micheal his response was great evaluation and sent money on time. Will recommend many times over. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Celi",
          "Nb_Reviews": 3,
          "Date": "2021-06-09T14:53:02.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy. If I had opted to fix the screens on my phones and then sell them, it would've actually costed me money. This is a great option to get something back for your old phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jen S.",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T06:06:23.000Z",
          "Titre": "Easy to do",
          "Contenu": "Easy to do. Quick response. Definitely recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian",
          "Nb_Reviews": 5,
          "Date": "2023-07-18T23:02:36.000Z",
          "Titre": "No issues with sending in phone and…",
          "Contenu": "No issues with sending in phone and getting the price I was quoted. Check came fast within 5-7days."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jon Whittaker",
          "Nb_Reviews": 6,
          "Date": "2022-11-09T22:11:08.000Z",
          "Titre": "Simple and very fair fast process",
          "Contenu": "This was a very simple process to trade in my iPhone 12. They are easy to deal with and very communicative throughout.Very timely too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Chelsea Hughes",
          "Nb_Reviews": 1,
          "Date": "2022-07-15T18:53:27.000Z",
          "Titre": "Very satisfied!",
          "Contenu": "Was very impressed with the honesty from this company. I recieved what I was quoted, and recieved it very quickly. Very satisfied!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Javier",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T11:56:14.000Z",
          "Titre": "SaveGadget made the process quick  and…",
          "Contenu": "SaveGadget made the process quick  and easy. Payment came promptly! Thank you SG!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-08-01T22:29:18.000Z",
          "Titre": "Highly recommend!",
          "Contenu": "This was the easiest transaction ever!!!! I received check so quickly!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MM",
          "Nb_Reviews": 3,
          "Date": "2021-05-25T06:42:33.000Z",
          "Titre": "Great experience, smooth transaction",
          "Contenu": "Great experience. The instructions were very clear and the payment was prompt. Definitely better value than a traditional trade-in."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Alaa Rajab",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T11:22:06.000Z",
          "Titre": "Credibility and responsiveness"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carolina Silva",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T00:27:45.000Z",
          "Titre": "The process was easy and payment was…",
          "Contenu": "The process was easy and payment was prompt.  I will definitely use Save Gadget again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Heather",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T23:24:09.000Z",
          "Titre": "Excellent communication",
          "Contenu": "Excellent communication, a lil disappointed with the HUGE adjustment in payment, but very fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dannygrza",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T16:20:19.000Z",
          "Titre": "I had a issue with PayPal and I was…",
          "Contenu": "I had a issue with PayPal and I was able to refund the money back to them and they sent me a check. They have been more then helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2022-02-11T04:45:00.000Z",
          "Titre": "Simple process",
          "Contenu": "Simple process, fair pricing, pretty much exactly what the site claimed it would be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bryan Hickman",
          "Nb_Reviews": 2,
          "Date": "2022-12-12T19:01:00.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. Did exactly what they said they would. No issues."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christie Stanley",
          "Nb_Reviews": 1,
          "Date": "2023-09-07T05:09:07.000Z",
          "Titre": "Reliable and fair",
          "Contenu": "Reliable with fair quotes and timely payments."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hao",
          "Nb_Reviews": 1,
          "Date": "2023-01-18T05:50:26.000Z",
          "Titre": "smooth experience",
          "Contenu": "The trade-in process was very smooth and I got my payment 2 days after my iPhone was delivered."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carrie",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T22:31:17.000Z",
          "Titre": "Fast and Phenominal",
          "Contenu": "The customer service was phenominal and the speed of service was even better!  I would recommend Save Gadget to anyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Luis Hernandez",
          "Nb_Reviews": 2,
          "Date": "2023-06-08T23:59:01.000Z",
          "Titre": "Fast and Easy!!",
          "Contenu": "Sold My S22 Ultra to SaveGadget and was paid quick😁! I'm happy with the service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 3,
          "Date": "2021-05-18T04:13:18.000Z",
          "Titre": "Highly recommend",
          "Contenu": "They were understanding, kind and fast! Offered a lot more than I ever imagined I’d get for my cracked phone"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gian De Cecco",
          "Nb_Reviews": 4,
          "Date": "2023-07-14T20:58:56.000Z",
          "Titre": "Wonderful trade in experience and quick…",
          "Contenu": "Wonderful trade in experience and quick payment. Will definitely do business with again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T19:17:54.000Z",
          "Titre": "Device sell back quote was accurate",
          "Contenu": "Device sell back quote was accurate, quick turnaround on sale. Check mailed out promptly. I’d sell a device here again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jill Zimmerman",
          "Nb_Reviews": 2,
          "Date": "2023-01-06T20:18:23.000Z",
          "Titre": "This company is legit",
          "Contenu": "This company is legit. Had no issues and everything you see is exactly what you get! I would use them again if the price is right!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Alfieri",
          "Nb_Reviews": 1,
          "Date": "2023-07-04T18:09:40.000Z",
          "Titre": "Very quick turnaround and great…",
          "Contenu": "Very quick turnaround and great communication. I would definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeremy N",
          "Nb_Reviews": 3,
          "Date": "2022-06-30T20:07:17.000Z",
          "Titre": "Easy and quick process",
          "Contenu": "The free shipping process was easy and payment for my device was sent very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Imperfect Soldier for Christ💫",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T01:08:05.000Z",
          "Titre": "As Advertised",
          "Contenu": "They gave me exactly what they promised.  Very quick, very easy, and reliable.  I will sell more soon."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Amethyst",
          "Nb_Reviews": 1,
          "Date": "2021-05-26T17:47:39.000Z",
          "Titre": "Quick & Easy",
          "Contenu": "I received my check in a timely manner, and I was satisfied with the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TG",
          "Nb_Reviews": 1,
          "Date": "2021-11-24T04:07:40.000Z",
          "Titre": "Great experience",
          "Contenu": "The service and payment are really fast. I’m really happy with my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A.N.S.A",
          "Nb_Reviews": 3,
          "Date": "2021-05-18T19:36:30.000Z",
          "Titre": "Pretty straightforward. Money was in my PayPal promptly.",
          "Contenu": "Clear process from the get-go. Got a bit of money for my broken iPhone 7+. Pretty straightforward."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "S Watson",
          "Nb_Reviews": 1,
          "Date": "2022-07-01T00:21:59.000Z",
          "Titre": "Quick and easy process",
          "Contenu": "Quick and easy process, everything was explained well and they did what they said they would do."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric R.",
          "Nb_Reviews": 1,
          "Date": "2023-03-27T20:39:43.000Z",
          "Titre": "Quick turnaround and accurate…",
          "Contenu": "Quick turnaround and accurate description of reimbursement, what else could we ask for?"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stonewall Jackson",
          "Nb_Reviews": 2,
          "Date": "2022-07-18T18:07:06.000Z",
          "Titre": "Gave me a good offer on a non working…",
          "Contenu": "Gave me a good offer on a non working iPhone xr and they paid up fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexie Messer Price",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T01:12:15.000Z",
          "Titre": "Quick and honest service",
          "Contenu": "Quick and honest service! I would definitely use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Vince Edwards",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T21:59:01.000Z",
          "Titre": "Excellent service",
          "Contenu": "My experience was excellent.  Customer service and communication was exceptional. I will be doing more business with savegadget very soon.  Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stefan",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T02:43:57.000Z",
          "Titre": "SaveGadget works",
          "Contenu": "everything worked as described; I am cashing the check now"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "steveg",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T15:14:10.000Z",
          "Titre": "they offered the best price and they…",
          "Contenu": "they offered the best price and they made it a very easy process"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Drew Phillips",
          "Nb_Reviews": 1,
          "Date": "2023-09-05T03:41:38.000Z",
          "Titre": "Awesome company to work with!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Russ",
          "Nb_Reviews": 1,
          "Date": "2022-06-03T00:54:05.000Z",
          "Titre": "Efficient and customer friendly process…",
          "Contenu": "Efficient and customer friendly process from click to cash."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Jarrett",
          "Nb_Reviews": 1,
          "Date": "2022-02-11T04:39:04.000Z",
          "Titre": "Quick communication and quick payment",
          "Contenu": "Quick communication and quick payment.  Would recommend and will use again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2021-07-02T13:41:44.000Z",
          "Titre": "Fast and as promised",
          "Contenu": "Fast and as promised. Smooth transaction, Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Pate",
          "Nb_Reviews": 3,
          "Date": "2022-10-25T15:38:38.000Z",
          "Titre": "Fantastic!!",
          "Contenu": "Fantastic!!! I would definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ryan D.",
          "Nb_Reviews": 1,
          "Date": "2022-01-21T18:08:38.000Z",
          "Titre": "Accurate quote",
          "Contenu": "Accurate quote, quick delivery, and prompt payment. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Arif Shah",
          "Nb_Reviews": 4,
          "Date": "2023-10-17T21:08:03.000Z",
          "Titre": "Great service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melanie Joseph",
          "Nb_Reviews": 4,
          "Date": "2021-11-20T19:29:19.000Z",
          "Titre": "The process was quick and easy",
          "Contenu": "The process was quick and easy. I felt as if the price offered was very fair. Would highly recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Long",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T23:08:40.000Z",
          "Titre": "Very easy process",
          "Contenu": "Very easy process, fast payment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Edward",
          "Nb_Reviews": 1,
          "Date": "2022-09-25T18:17:10.000Z",
          "Titre": "awesome experience",
          "Contenu": "awesome experience, get my paycheck on time!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "AZ Review",
          "Nb_Reviews": 1,
          "Date": "2021-11-04T09:51:03.000Z",
          "Titre": "Simple process",
          "Contenu": "Sent my device in and got the money I was promised. Simple and straightforward"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charles C.",
          "Nb_Reviews": 2,
          "Date": "2021-06-27T02:43:04.000Z",
          "Titre": "Very prompt and accurate assessment",
          "Contenu": "Very prompt and accurate assessment.   Very quick payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Baker",
          "Nb_Reviews": 1,
          "Date": "2022-02-26T01:37:41.000Z",
          "Titre": "Can not be more than pleased with the…",
          "Contenu": "Can not be more than pleased with the process and payment"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2022-11-02T00:23:52.000Z",
          "Titre": "Good follow up prompt payment"
        }
      ]
    }
  ]
}