{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "scratchmonkeys.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "GR",
          "Pseudo": "Γιώργος Λιάπης",
          "Nb_Reviews": 2,
          "Date": "2023-12-22T00:50:40.000Z",
          "Titre": "Order always ends up being canceled",
          "Contenu": "I have tried so many times to buy from their site, and every single one my orders ends up being canceled even though I'm receiving an order receipt on my email just fine. The reason for that is that their site detects an unusual activity on my end. What's unusual thought, that I don't know. I also sent an email to their support to help me on what to do but it's been weeks and I have not received any response since.A total waste of time.Edit: just spoke with them on chat. They weren't helpful at all. Said that it's because of a 3rd party security that they are using and there's nothing they can do on their end to help me. Honestly I wouldn't be surprised if all this is just a scheme to steal my card info. Lemme cancel the ones I used ASAP."
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "Cameron Nobleman",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T19:36:10.000Z",
          "Titre": "My Debit Card got hacked",
          "Contenu": "My Debit Card got hacked, I know this because the transaction. Failed due to insufficient balance.The Online security here for American Multi Logging Key Cards is very pour. I will not be using your services. I demand to know what happened an hour ago to my Key Card on this website. Have a good day."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Gonzales",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T23:32:09.000Z",
          "Titre": "I have used this website 3 other times…",
          "Contenu": "I have used this website 3 other times without any problems before. But this time I tried using my credit card and I was charged twice but did not receive credit for my order. Tried reaching out to customer service via email and chat and did not get any response from either."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "Al-hussain Abdullahi",
          "Nb_Reviews": 2,
          "Date": "2022-12-07T14:53:30.000Z",
          "Titre": "Scam alert don't buy anything from them.",
          "Contenu": "I got debited $20 for Razer gold gift card but create an error that it wasn't successful, i chat Their CS they quickly respond that transaction is flag risky or i used VPN while it's not true.When i request a receipt for failed transaction from their end they open my message but refused to show or answer me.Be aware they will scam you if you buy from them.If you are not fraudster release my money, gift card or show me a failed receipt from your end."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Stephanie",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T00:58:59.000Z",
          "Titre": "Doesn't Let Me Click Checkout then Charges Me",
          "Contenu": "Have tried this site on TWO different occasions, months apart from each other. First time, it wouldn't even let me create an account with my email address. Second time, I manage to create the account by logging in with Google, but after inputting my credit card, it doesn't let me click \"Checkout.\" I backout, proceed to cart, and try again. Same issue, and it shows that my cart is still filled. Next morning, I see I got charged for the digital codes on my credit card even though I NEVER GOT PAST CHECK OUT OR RECEIVED THE CODES. THE ITEM IS STILL IN MY CART SO I DO NOT KNOW HOW THE TRANSACTION EVEN WENT THROUGH. Bank even called me because it was deemed suspicious activity. I will be buying my game cards elsewhere from now on due to my bad experience with this site."
        },
        {
          "Note": 1,
          "Lieu": "TT",
          "Pseudo": "Antonio Singh",
          "Nb_Reviews": 3,
          "Date": "2022-09-24T12:32:51.000Z",
          "Titre": "Made a purchase with paypal and money…",
          "Contenu": "Made a purchase with paypal and money was taken out from my debit card as I got the notification, however on the scratchmonkey site it gave an error. Paypal does not show the transaction but my bank sent me an email stating the funds were approved......... what the hell?Edit: Changed my email to my paypal email and got an error to verify myself. Was sent to submit a ticket, however when pressing submit..... it just sent me to an error page."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Y’all Suck",
          "Nb_Reviews": 1,
          "Date": "2022-04-22T15:01:26.182Z",
          "Titre": "Ridiculous",
          "Contenu": "Ridiculous. Make 1 purchase a few weeks ago, no issue. Try make another purchase a few weeks later with the same details, same billing/payment info, same name, same email address, and NOT through VPN and they decide to mark you for fraud and the only help you get is “Make sure your billing & payment info match up, that you’re using the same email address, and not using VPN”. Useless service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Candy Thayer",
          "Nb_Reviews": 4,
          "Date": "2023-04-08T17:05:54.000Z",
          "Titre": "Blocked on computer website that I…",
          "Contenu": "Blocked on computer website that I always use so had to use my phone to order. This version isn't as easy to navigate. Please fix your main site so I can use my computer. Feel free to contact me if you have questions or updates."
        },
        {
          "Note": 1,
          "Lieu": "VE",
          "Pseudo": "JM",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T17:42:47.000Z",
          "Titre": "I had an error buying",
          "Contenu": "I tried to buy a code and the system generated an error during the purchase, the debit was made and the code was not sent. I tried again and the same result but this time the reverse was generated. I sent 2 emails to technical support and haven't received a response yet. I understand that it's a system error and this can be solved. I also tried to use the contact area and it was not successful. There must be an easier way to solve these types of situations that are very common. I still can't give you a better rating because you still have my money and I haven't received the product even though it's been almost 2 weeks since I tried to make the purchase."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "mrs_fish",
          "Nb_Reviews": 2,
          "Date": "2023-10-11T04:15:25.000Z",
          "Titre": "I don't understand why I had to get…",
          "Contenu": "I don't understand why I had to get 'permission' from my bank in order to make a purchase from your website."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Lara Sode",
          "Nb_Reviews": 1,
          "Date": "2023-04-07T04:48:24.000Z",
          "Titre": "I got charged twice for an order and didnt receive the order",
          "Contenu": "I got charged twice for an order and did not recieve my card, i messaged their emails but i got no reply and im sitting here with -140$ on my bank account and no gift card, thanks scratchmonkeys."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Darque Wing",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T22:42:06.000Z",
          "Titre": "Tried to buy a gift card for my friend…",
          "Contenu": "Tried to buy a gift card for my friend in Canada, because Microsoft is dumb and doesn't allow it.  This site offers the service, but the payment options just plain don't work.  Now they have my credit card information, and I'll have to spend the rest of the day changing it.  Jerks."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ioajsksnssns Aosjabsbsks",
          "Nb_Reviews": 1,
          "Date": "2022-11-06T02:42:33.000Z",
          "Titre": "Didn't receive code",
          "Contenu": "Made a purchase with cashapp and money was taken out from my debit card as I got the notification, however on the scratchmonkey site it gave an error. its stuck on pending does"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Marcus McLaurin",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T21:07:33.000Z",
          "Titre": "I purchased a $10 iTunes card from this…",
          "Contenu": "I purchased a $10 iTunes card from this site. I got a notification from my card that the $10 was charged, but on the site it indicated it did not go through. My account says otherwise, but I have no way of contacting them to see how the card is supposed to be delivered! Very disappointing experience. Maybe a rip off.UPDATE: I received an update that noted this may have been marked for fraud by this vendor. I was not using a VPN, and all my information was correct, so I'm not sure how this happened. The card indicates the funds were removed, but the vendor indicates it may be in Pending status, meaning it's not in my account, not paid out, just inaccessible. I will contact the card company, but while that may return my funds, it does not get me any closer to the purchase. It's only $10, but because it's only $10, it shouldn't be this fraught to get it to work."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "sam",
          "Nb_Reviews": 1,
          "Date": "2022-11-19T18:15:21.000Z",
          "Titre": "Crap",
          "Contenu": "Crap! No matter what I do it doesn't take my payment. I've tried several different ways several times. Nothing but crap!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Bryanna Jacob",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T22:28:29.000Z",
          "Titre": "Save yourself the time and dont",
          "Contenu": "A friend swears by this site and recommended it to me. I put in my info to purchase and apparently my info is \"fraud\". Support team is no help and just copy pastes the same text here and in emails. Absolutely no help. If you don't want the business just say so."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "zero",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T05:08:15.000Z",
          "Titre": "pretty sure i got scammed just bought a…",
          "Contenu": "pretty sure i got scammed just bought a code but the purchase is pending and support page isnt working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-18T18:46:29.000Z",
          "Titre": "My email address was hacked and bank…",
          "Contenu": "My email address was hacked and bank accounts wasn't me victim of Frauud kevrenna McDonough 312 296 7229"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Anocae",
          "Nb_Reviews": 1,
          "Date": "2022-12-27T00:25:40.000Z",
          "Titre": "Got Charged when the checkout said…",
          "Contenu": "Got Charged when the checkout said there was an error. never received my $5 apple gift card and funds were taken out of my bank. Probably won’t use again."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Juliane Zieger",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T17:52:48.000Z",
          "Titre": "money gone and no cards",
          "Contenu": "I'm sorry. I did not place the order \"Order 423857\" and I arleady wrote an email to inform the admin but still havent got any answer. The money is gone and I dont have any cards. This is a bit of like not cool for me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robyn Pagano",
          "Nb_Reviews": 1,
          "Date": "2023-03-28T01:52:42.000Z",
          "Titre": "I purchased 2 different apple gift…",
          "Contenu": "I purchased 2 different apple gift cards and could use neither one. Of course I can't get a refund cos they were scrathed. I won't use this site again."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "KC",
          "Nb_Reviews": 2,
          "Date": "2022-11-19T03:04:00.000Z",
          "Titre": "Both codes did not work",
          "Contenu": "Both codes did not work. I logged into Wizards game and no added crowns. I do not recommend this site. Just wasted $10."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "buyer",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T00:31:01.000Z",
          "Titre": "Have yet to receive my refund"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tayon Stackzz",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T23:15:55.000Z",
          "Titre": "I made a purchase and never recieved my…",
          "Contenu": "I made a purchase and never recieved my purchased code."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-25T15:05:00.000Z",
          "Titre": "I did not purchase this gift card",
          "Contenu": "I did not purchase this gift card.  My computer was hacked. I gave since been reimbursed"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Mohamed Ahmed",
          "Nb_Reviews": 1,
          "Date": "2022-04-26T09:30:06.667Z",
          "Titre": "Does not accept transactions and…",
          "Contenu": "Does not accept transactions and distinguishes them as fraud"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "YogurlCay",
          "Nb_Reviews": 1,
          "Date": "2022-11-12T08:19:15.000Z",
          "Titre": "I wasn’t able to use code because I…",
          "Contenu": "I wasn’t able to use code because I wasn’t in canda now I can’t get money back"
        },
        {
          "Note": 1,
          "Lieu": "GT",
          "Pseudo": "Wolfgang B",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T03:56:26.000Z",
          "Titre": "Terrible customer service charged twice…",
          "Contenu": "Terrible customer service charged twice and had not refunded any of the transaction"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Alex Pritchett",
          "Nb_Reviews": 1,
          "Date": "2023-07-02T21:29:29.000Z",
          "Titre": "Ita nodont buy from these",
          "Contenu": "Didn't give me a code just a number"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-03-08T20:14:51.000Z",
          "Titre": "I want my money to be returned to my…",
          "Contenu": "I want my money to be returned to my account. This is the worst site I have ever seen."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Monica",
          "Nb_Reviews": 2,
          "Date": "2022-02-10T08:01:47.000Z",
          "Titre": "Who are you",
          "Contenu": "Who are you? I see I’ve been charged for your service but do not know who you are and what you do??"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dave Johnson",
          "Nb_Reviews": 1,
          "Date": "2021-05-19T01:15:27.000Z",
          "Titre": "ScratchMonkeys will not take my payment…",
          "Contenu": "ScratchMonkeys will not take my payment through PayPal, however they have no problem taking a payment from the same exact card by forcing me to enter my card number and information online, I am done with you people. I use PayPal for security and you are forcing me to give that up, I have spent a lot of money with you, but you have seen the last of me !!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "RR",
          "Nb_Reviews": 1,
          "Date": "2020-05-14T12:21:13.000Z",
          "Titre": "You have bad technology and bad…",
          "Contenu": "You have bad technology and bad advertising - you advertised a EU only product in the US and collected my dollars - when the product did not work - you offered no solutions and denied a refund on a technicality - this is dishonest business practice and extremely poor customer service - I shall never do business with you again and also advise my social circles about you as well as file every complaint I can about you"
        },
        {
          "Note": 1,
          "Lieu": "GT",
          "Pseudo": "Humberto Chan",
          "Nb_Reviews": 2,
          "Date": "2019-08-14T20:09:52.000Z",
          "Titre": "Bad support.",
          "Contenu": "Everything was fine until they asked me to verify my identity, i sent the proof they asked me for, support tells that \"risk department did not appove my proof of identity\", i asked them what was the problem and they said that \"there´s nothing they can do and can´t tell me what´s the problem due to security and privacy protocols\".How am i suppose to solve this if they can´t tell me what´s wrong?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T16:35:43.000Z",
          "Titre": "I was charged $100 for something I…",
          "Contenu": "I was charged $100 for something I didn’t order. I am disputing through PayPal. I tried to contact scratch monkeys and there was no way to contact someone. Thanks for your response. I did report to PayPal and they said it was a legit charge without any investigation so I am still disputing with them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 1,
          "Date": "2020-08-11T13:54:50.000Z",
          "Titre": "Horrible experience!!!!!!!",
          "Contenu": "\"ONCE YOU SCRATCH, NO REFUNDS.\"  IF YOU ARE SMART... BACK OUT NOW!! THE CODES ARE FAKE!!!!.WHICH OF COURSE ISNT FOUND OUT UNTIL YOU SCRATCH THE VIRTUAL GIFT CARD! AT THAT POINT YOU ARE OUT OF HOW EVER MUCH YOU SPENT. CUSTOMER SERVICE TREATS YOU LIKE YOU ARE 2 years old."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-01-20T17:51:17.298Z",
          "Titre": "Ordered Items not Working",
          "Contenu": "I placed an order for three items with this web-site.  They were quick to send orders.  Howevere when I tried to enter the codes for these items online.  They did not work, I have followed the customer service replied saying to send screen shots of error messages.  This was moere than three weeks ago.  I have yet to recieve a reply on this issue.  Its to the point that I am sending a message to pay-pal on this site."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T11:36:11.000Z",
          "Titre": "I bought a 10 dollar valorant gift…",
          "Contenu": "I bought a 10 dollar valorant gift card, in the end i got scammed by scummy people like you who gives out invalid codes. Im disappointed for actually trusting this third party site while i cant even get a refund for my purchase. Im disgusted."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Tom",
          "Nb_Reviews": 1,
          "Date": "2021-07-12T15:05:26.000Z",
          "Titre": "I bought 4 arc games cards and got an…",
          "Contenu": "I bought 4 arc games cards and got qn error message. I thought i didn't have enough money so i tried it again at 3 cards. Same error message. Upon checking my bank account,  I was charged for 7 but received no codes at qll"
        },
        {
          "Note": 1,
          "Lieu": "IR",
          "Pseudo": "Verified Customer",
          "Nb_Reviews": 1,
          "Date": "2015-09-17T20:45:07.000Z",
          "Titre": "Scam",
          "Contenu": "After your firstnpurchase they want you to send them a copy of front and back of your driver's license. And if you buy more than two items in half an hour, they won't give you what you bought and will calling you on the phone to te you that you must get a reseller account!!!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-01T08:35:06.000Z",
          "Titre": "The digital code said it went thow.but…",
          "Contenu": "The digital code said it went thow.but when I logged onto my xbox one there wasnt any xbox game pass time on it.it was for a month I paid for.i have been emailing them trying to get my money back or for them to fix it for me.but nothing."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "john",
          "Nb_Reviews": 1,
          "Date": "2016-01-09T22:14:25.000Z",
          "Titre": "this is a scam",
          "Contenu": "I never was able to authenticate how can I m ake a purchase customer service is non exsistant this is a big scam no one would reply to email \rhow can I make a purchase if this is not real\r don't do it if your thinking about it\rthey didn't even attempt to fix my issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "rebecca",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T14:20:21.000Z",
          "Titre": "I did not order anything from you this…",
          "Contenu": "I did not order anything from you this was done by someone who hacked into my laptop I reported this to the police and bank anything charged to me will not be paid   card used was canceled  please remove me from you sight"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kayla",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T19:50:20.000Z",
          "Titre": "I purchased Microsoft 365 and the key…",
          "Contenu": "I purchased Microsoft 365 and the key doesn't work. They told me I purchased from the wrong region and there's nothing that can be done. So I've just spent my money and can't use the product. I feel that it is unfair."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "katina_choovanski",
          "Nb_Reviews": 4,
          "Date": "2018-03-23T06:06:58.000Z",
          "Titre": "2nd visit to the website",
          "Contenu": "2nd visit to the website, I purchased 3 $15 tickets.  The second ticket said ERROR when I tried to use it, and when I re-tried it, it said this number has already been used.  I was only credited for $30 in my Neocash account.  Buyer beware."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "aaron",
          "Nb_Reviews": 1,
          "Date": "2021-06-25T07:47:23.000Z",
          "Titre": "I searched for $5 iTunes gift cards on…",
          "Contenu": "Update: didn’t let me buy another giftcard it marked my account as “fraud” I do not recommend buying from them they’ll just flag your account for no reason! I emailed them and no help! Do not buy!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David Johnson",
          "Nb_Reviews": 1,
          "Date": "2020-07-19T06:17:53.000Z",
          "Titre": "poor customer service & web design",
          "Contenu": "I purchased a PSN card with no issues several days ago, and today I attempted to make the exact same purchase, with the exact same payment method. I had to sign in to ScratchMonkeys with a username and password, I also had to sign into PayPal with a username and password, however this isn't enough for ScratchMonkeys. I was presented with a message that my purchase was cancelled and that I needed to verify my identity (I thought I did that when I signed in) and gave me a contact us support link. I left ScratchMonkeys and made my identical purchase with my identical payment method minutes later. GOODBYE ScratchMonkeys, You Successfully Lost A Good Customer !!!!  How is that for verification !!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-09-27T19:04:09.000Z",
          "Titre": "Was working with no problems but…",
          "Contenu": "Was working with no problems but eventually the site marked my account as suspicious (for no reason whatsoever). Was never able to fix it despite reaching out to customer service."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-27T19:58:42.000Z",
          "Titre": "I'd write a good review if i wasn't…",
          "Contenu": "I'd write a good review if i wasn't countlessly ripped off for my money, expanded prices just because i don't live in the same country, i'm dissapointed."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-09-11T12:29:59.000Z",
          "Titre": "Don’t trust this company",
          "Contenu": "Purchase was fraud, and I never received the order. I previously contacted ScratchMonkey and after one week I not received any reply. I do not recommend dealing with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Russell",
          "Nb_Reviews": 1,
          "Date": "2020-05-09T15:00:21.000Z",
          "Titre": "Scratchmonkeys let someone fraudulently…",
          "Contenu": "Scratchmonkeys let someone fraudulently use my debit card information so until I hear from them and we get this resolved and I get my money back their rating is a -0 to me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jean Carl",
          "Nb_Reviews": 3,
          "Date": "2020-02-21T14:34:25.000Z",
          "Titre": "I was hacked",
          "Contenu": "I didn't make a purchase. My Paypal account was hacked. I have no relationship with Scratchmonkeys. I had never heard of it until I saw the charge on my Paypal account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carmelo Stough",
          "Nb_Reviews": 1,
          "Date": "2021-01-03T20:31:15.000Z",
          "Titre": "I ordered a crunchy roll on VRV digital…",
          "Contenu": "I ordered a crunchy roll on VRV digital code and it told me the card security didn’t allow the payment to go through but I still got charged I don’t understand"
        },
        {
          "Note": 1,
          "Lieu": "SI",
          "Pseudo": "Dean Popic",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T21:46:26.000Z",
          "Titre": "my bank card was misused !"
        },
        {
          "Note": 1,
          "Lieu": "CL",
          "Pseudo": "Reinaldo",
          "Nb_Reviews": 2,
          "Date": "2019-01-30T10:09:34.000Z",
          "Titre": "Stolen money and maybe stolen codes, beware",
          "Contenu": "My first purchase failed, but they still charged my credit card.On the second try it worked, and I got the code, but I was banned from SiriusXM for fraud."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-31T17:08:58.000Z",
          "Titre": "If you purchase something",
          "Contenu": "If you purchase something, then try to purchase something later you will be unable to purchase it again, cause it thinks you're being a fraud."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Simon May",
          "Nb_Reviews": 9,
          "Date": "2019-04-20T06:02:33.000Z",
          "Titre": "My computer was hacked and the hacker…",
          "Contenu": "My computer was hacked and the hacker used this site to purchase lots of game vouchers. There is no cancel membership option so it could happen again"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-07-09T20:22:08.000Z",
          "Titre": "Fraudster created account and charged…",
          "Contenu": "Fraudster created account and charged me 180. Scratch monkey refused to refund money and now won't stop sending me requests to review them."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-19T16:11:49.000Z",
          "Titre": "You need to do a better job screening…",
          "Contenu": "You need to do a better job screening your buyer's. My phone was hacked and they purchased your gift card under my name."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-03T17:11:12.000Z",
          "Titre": "The reason i am Giving 1 Start Becuase…",
          "Contenu": "The reason i am Giving 1 Start Becuase they keep asking Id verification and Even after you buy something again Id Verification."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Renee Meador",
          "Nb_Reviews": 2,
          "Date": "2022-01-15T06:49:34.000Z",
          "Titre": "My bank acct was hacked and used to…",
          "Contenu": "My bank acct was hacked and used to make purchases thru this APP. Those purchases were not authorized."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Landon",
          "Nb_Reviews": 1,
          "Date": "2016-01-02T20:51:48.094Z",
          "Titre": "Have not yet received my product",
          "Contenu": "I ordered a year's subscription to Xbox live, they were quick to take my money, but I have not yet received my product."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "carole Johnston",
          "Nb_Reviews": 4,
          "Date": "2020-11-08T19:37:39.000Z",
          "Titre": "I did not order product",
          "Contenu": "I did not order product - credit card compriized - answered email and no response - disappoinred  scammed!!"
        },
        {
          "Note": 1,
          "Lieu": "PS",
          "Pseudo": "anat zakhut",
          "Nb_Reviews": 1,
          "Date": "2021-07-06T14:51:44.000Z",
          "Titre": "if you in israel you cant buy using…",
          "Contenu": "if you in israel you cant buy using credit card or paypal , why preventing israelian customers ?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-14T14:15:03.000Z",
          "Titre": "Unauthorized Paypal transaction",
          "Contenu": "Unauthorized Paypal transaction.  This transaction was not made by me and is under investigation by paypal."
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-06-02T06:24:30.000Z",
          "Titre": "i had buy code but it was had used by…",
          "Contenu": "i had buy code but it was had used by someone else . when im texted the support there is no one answar"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T06:52:27.000Z",
          "Titre": "The fb card code that I got was not…",
          "Contenu": "The fb card code that I got was not valid. I hope to get a new card or a refund for the product."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-11-10T11:39:21.000Z",
          "Titre": "👎🏻👎🏻👎🏻👎🏻👎🏻",
          "Contenu": "👎🏻👎🏻👎🏻👎🏻👎🏻،  l"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CYNTHIA RIPKE",
          "Nb_Reviews": 1,
          "Date": "2020-10-10T01:35:05.000Z",
          "Titre": "I BOUGHT 1 $5.00 FACEBOOK SCRATCH…",
          "Contenu": "I BOUGHT 1 $5.00 FACEBOOK SCRATCH GAMECARD AND IT IS NOT ABLE TO BE USED ON FACEBOOK ."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Daniel Garcia",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T04:39:35.000Z",
          "Titre": "Bought a $10 psn card got the code just…",
          "Contenu": "Bought a $10 psn card got the code just to find out the code was already used...."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mita Patel",
          "Nb_Reviews": 1,
          "Date": "2020-02-15T21:38:42.000Z",
          "Titre": "I didn't use my card I dont how come…",
          "Contenu": "I didn't use my card I dont how come they have changed  on my card not secure"
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-03T09:12:24.000Z",
          "Titre": "Worked for the first 3 orders and then…",
          "Contenu": "Worked for the first 3 orders and then the system flagged my account what a shame"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-22T22:27:59.000Z",
          "Titre": "What's with a random message to verify…",
          "Contenu": "What's with a random message to verify my identity after 2 purchases?"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michael Kraviec",
          "Nb_Reviews": 1,
          "Date": "2021-06-27T09:50:58.000Z",
          "Titre": "Literally wont take my money",
          "Contenu": "would love to purchase from the site but they refuse to take my money"
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Clark",
          "Nb_Reviews": 1,
          "Date": "2020-08-04T13:09:58.000Z",
          "Titre": "Unable to open you website error 502",
          "Contenu": "Unable to open you website error 502I used different devices same error"
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Thor Schramm",
          "Nb_Reviews": 2,
          "Date": "2020-04-06T16:16:34.000Z",
          "Titre": "Missig Authentication.",
          "Contenu": "Missig Authentication.A Hacker used my Data to create a Account and buy."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrian",
          "Nb_Reviews": 1,
          "Date": "2020-03-15T04:19:41.000Z",
          "Titre": "I bought a digital code and it gave me…",
          "Contenu": "I bought a digital code and it gave me an error but it still charged me"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-15T09:53:17.000Z",
          "Titre": "bought the wrong gift card and they…",
          "Contenu": "bought the wrong gift card and they wouldn't refund me"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ty Scharmach",
          "Nb_Reviews": 2,
          "Date": "2020-05-09T20:51:14.000Z",
          "Titre": "Used once successfully now it won’t…",
          "Contenu": "Used once successfully now it won’t accept my card.   Useless junk."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Order ID: 77960",
          "Nb_Reviews": 3,
          "Date": "2019-01-14T16:43:08.000Z",
          "Titre": "Hacked",
          "Contenu": "I never made this order. I was hacked, don't even own a Playstaion."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "luay",
          "Nb_Reviews": 2,
          "Date": "2019-11-30T06:18:20.000Z",
          "Titre": "My orders are rejected and I pay from…",
          "Contenu": "My orders are rejected and I pay from my PayPal, Visa or bank account"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-06-17T03:53:35.000Z",
          "Titre": "Not an honest description",
          "Contenu": "Bogus everything , got suckered into it , reporting with the BBB."
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "Renaldo Powell",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T22:14:00.000Z",
          "Titre": "Bad it's a shame"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jessenia",
          "Nb_Reviews": 2,
          "Date": "2020-02-23T06:02:30.000Z",
          "Titre": "My account was billed and it wasn’t me…",
          "Contenu": "My account was billed and it wasn’t me purchasing this"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Niya Playss",
          "Nb_Reviews": 1,
          "Date": "2020-06-07T17:19:12.000Z",
          "Titre": "🙄🙄",
          "Contenu": "It told me my code was already redeemed! Help me !"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-09-11T06:04:59.000Z",
          "Titre": "Did not help at all after accidental…",
          "Contenu": "Did not help at all after accidental purchase"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-28T07:02:47.000Z",
          "Titre": "I got robbed by you I didn’t get my code"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-09-12T10:10:54.000Z",
          "Titre": "They scammed me and canceled my account"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-12-05T08:17:46.000Z",
          "Titre": "Ps cards doesn't work..big scam"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Ehabomran",
          "Nb_Reviews": 1,
          "Date": "2019-01-11T16:21:07.000Z",
          "Titre": "I pay twice without the digital code"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2020-05-22T05:35:16.000Z",
          "Titre": "Because you dint give me any thing"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Liam",
          "Nb_Reviews": 1,
          "Date": "2020-11-01T07:12:38.000Z",
          "Titre": "Fake",
          "Contenu": "They gave me a fake crowns code"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T06:28:50.000Z",
          "Titre": "The product is still in CHINA"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-02-09T00:56:42.000Z",
          "Titre": "can you please refund my order"
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-09-22T11:04:50.000Z",
          "Titre": "Nol resolved"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-01-28T06:03:31.000Z",
          "Titre": "Worst experience"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dawn R",
          "Nb_Reviews": 8,
          "Date": "2023-07-28T21:41:24.000Z",
          "Titre": "Lost $50 on razer card redeemed not by me",
          "Contenu": "I was told that the $50 razer card was redeemed by me and it was not. I lost $50 on a card that was not usable. I spoke to Chyrs and understand what he said but upsets me to know I lost the money because was told it had to be me basically. Hope the next time things will go well since I buy from here alot."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2022-11-28T05:09:05.000Z",
          "Titre": "Really useful and reliable but probably won’t use them again.",
          "Contenu": "Really useful and reliable with all scratch codes. I’ve been using the platform for a couple of years and haven’t had any problems. However, they don’t offer price drop protection. I recently made a purchase and just a few hours after that they started advertising a discount. I was told that they can’t do anything about it. For this reason I probably won’t use the platform again."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "katina_choovanski",
          "Nb_Reviews": 4,
          "Date": "2022-08-20T13:28:18.000Z",
          "Titre": "Harder to use the site.",
          "Contenu": "With increasing frequency and annoyance, I have to enter my card info sometimes up to 3 times to get it to finally process.  Never used to be this way.  I've spent tons of money using this website.  The ease of use has gone downhill."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-01-26T06:05:24.000Z",
          "Titre": "it was ok at first but whenever i try…",
          "Contenu": "it was ok at first but whenever i try to purchase the second thing my banking would not go through and i check with my bank and they said it was ok so if you could just give me what i intended to do here i would like to get a digital 1,100 cod points for modern warfare plz and thank you."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-01-16T06:10:36.000Z",
          "Titre": "Options are great, customer service is bad",
          "Contenu": "Options are great, a good site. I have been locked out of transactions for days and I haven’t been helped in any useful way"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-01-24T12:58:25.000Z",
          "Titre": "I placed an order for instant delivery…",
          "Contenu": "I placed an order for instant delivery and didn’t get it. No one is there on weekends so I have to wait to get an email"
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Shabbir",
          "Nb_Reviews": 1,
          "Date": "2018-07-08T06:02:51.000Z",
          "Titre": "Doesn't let's me buy psn when I want",
          "Contenu": "Doesn't let's me buy psn when I want. All good other than that. Fix it and 5 stars from me."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2016-01-08T15:28:04.000Z",
          "Titre": "Slow sending the codes ordered",
          "Contenu": "The prices are good, but the time taken to get the codes was much longer than expected."
        },
        {
          "Note": 2,
          "Lieu": "SI",
          "Pseudo": "Sebastijan",
          "Nb_Reviews": 1,
          "Date": "2018-10-30T06:01:24.000Z",
          "Titre": "gift cards",
          "Contenu": "Want to order more gift cards, not just 5 for 100$"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Cheryl (new customer)",
          "Nb_Reviews": 6,
          "Date": "2023-08-16T12:18:33.000Z",
          "Titre": "User friendly site",
          "Contenu": "Quick, easy and user friendly site. Although getting annoyed at being asked to review after every purchase and then being reminded to review even though I already have."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Cleveland",
          "Nb_Reviews": 1,
          "Date": "2023-08-17T21:05:25.000Z",
          "Titre": "Most of my payments are being canceled"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "havn",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T08:11:26.000Z",
          "Titre": "I clicked gift to gift item to a friend…",
          "Contenu": "I clicked gift to gift item to a friend it game me a link but i pressed it and it wouldnt let me copy it and send it to him"
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Jannik Pacher",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T20:36:05.000Z",
          "Titre": "Great when it works, doesn't always work.",
          "Contenu": "The site is legitimate and is great when it works. Unfortunately they frequently flag transactions for fraud which prevents you from buying. Ive tried waiting 24h, Ive tried using the same Credit card, a different credit card, Paypal etc. My name and address of course match my billing/payment information and Im not using a VPN. Unfortunately theres nothing they can do to help you in this case."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Leanne Chorley",
          "Nb_Reviews": 6,
          "Date": "2022-03-22T20:12:09.000Z",
          "Titre": "Was brilliant first four purchases",
          "Contenu": "Was brilliant first four purchases, let me order and receive, but then next day being asked to verify myselfContacted website, got something to do with Risk Analysis Department, which they don't access to due private policy, nothing more they could do to helpNothing has changed in bank details or billing addressDon't understand why?"
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Manu",
          "Nb_Reviews": 1,
          "Date": "2022-08-12T14:51:12.000Z",
          "Titre": "redemption code has expired",
          "Contenu": "I bought a code for Pubg Mobile, I enter it in the field for the exchange code, it says to me: redemption code has expired.Support returned the money for the purchase. They promised to download the codes code without expired"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Preston",
          "Nb_Reviews": 1,
          "Date": "2022-08-19T00:35:03.000Z",
          "Titre": "I love ordering here but..",
          "Contenu": "I love ordering here because its so easy, but at the same time, I often get blocked because i make purchases one after another."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J. Bouderdaben",
          "Nb_Reviews": 3,
          "Date": "2022-09-03T18:59:11.000Z",
          "Titre": "OK rating",
          "Contenu": "Sometimes I get flagged and it makes it hard to give you a 5 star rating when this happens often."
        },
        {
          "Note": 3,
          "Lieu": "PR",
          "Pseudo": "Mary Nowicki",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T16:29:53.000Z",
          "Titre": "This was my second time using this…",
          "Contenu": "This was my second time using this website. The first time I had no problems. Then the second time it didn’t take my atm card. They took the money and got no card. Luckily the next day they refunded me my money."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Kaila Stewart",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T02:51:33.000Z",
          "Titre": "Sometimes it rejects my purchase",
          "Contenu": "It works thats the point of it but simrtines it takes more thsn one try."
        },
        {
          "Note": 3,
          "Lieu": "AW",
          "Pseudo": "customer",
          "Nb_Reviews": 3,
          "Date": "2023-06-05T01:14:42.000Z",
          "Titre": "Didn't accept my card",
          "Contenu": "Didn't accept my card. Had to use Paypal. Same card."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "GERALD",
          "Nb_Reviews": 3,
          "Date": "2022-01-19T20:33:18.000Z",
          "Titre": "There is a lack of info on the purchase process",
          "Contenu": "What I liked about Scratchmonkeys is that I could get a variety of gift cards safely and ones that work.However, my first time was horrendous because they had left out a lot of stuff about the purchase process.If you are buying via PayPal,make sure that your sign up email is the same as the one on your PayPal email ,otherwise the transaction will fail.If you are buying using a credit or debit card, make sure you are using a home computer and on a private network,otherwise the transaction is flagged.Scratchmonkeys should have mentioned all this on their guidelines ,rather than learning them from support after several failed transactions ."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Carmit Elias",
          "Nb_Reviews": 1,
          "Date": "2020-05-20T18:23:05.000Z",
          "Titre": "Always see error messages",
          "Contenu": "Always see this message:Oops! Something went wrong.We're having trouble processing your credit card. Please review your payment details or choose an alternative payment method.Error: General ErrorThen i contacted scratchmonkeys , they said : the problem is from my credit card. . I have tried to send him 10$ to  admin@scratchmonkeys.’com and  i saw refuse message from paypal . Then i have tried to send 10$ to another email and i saw success message"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-07-02T23:21:03.000Z",
          "Titre": "I would have rated 5 stars but I bought a invalid code.",
          "Contenu": "I would have rated 5 stars but I bought a code for x box live and it was invalid, once I messaged the customer service chat and told them I had received a invalid code and that I’ve wasted my money, they quickly figured out the issue and sent me a new code that was valid to make sure I had not wasted my money. Other than that a great website, fast custom we service responses and cheap prices for x box live codes."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Neel Sharma",
          "Nb_Reviews": 1,
          "Date": "2021-07-21T16:15:05.000Z",
          "Titre": "Attempted to buy a 5$ ITunes card",
          "Contenu": "I tried to buy one single 5$ gift card. When the transaction didn’t go through, the webpage said it had failed 3 separate times, so I gave up. Next thing I know, I’ve got 3 transactions that went through showing up on my back account, and I don’t even have the gift cards yet. I really hope support gets back to me soon about this.Edit: Thank you support for the response, I understand the security concerns and such, if the money does not return to my account, I will let you know, but otherwise thanks for your help, I can’t find a reason for the issue, but I guess I’ll have to figure it out. Thanks again!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "melanie ciza",
          "Nb_Reviews": 1,
          "Date": "2017-12-08T23:49:59.000Z",
          "Titre": "have problems getting it to accept my …",
          "Contenu": "have problems getting it to accept my credit cards, want me to call and verify more info. I just want to go online and buy no hassle, if I wanted to order by phone I would have just called instead :( this just happened as well as the last time I bought, took a few days and several attempts with various GOOD cards before order was placed, still attempting to purchase today!! if this keeps up I will look for an easier source, used to work great and would have given 5 stars a few months back but not with these hassles"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brent K Bowen",
          "Nb_Reviews": 1,
          "Date": "2016-01-21T16:44:31.323Z",
          "Titre": "Can trust them but may be bumpy",
          "Contenu": "I got my product but it required some manual intervention.  I highly recommend the website chat to interact with them.  Otherwise you need to use twitter.  I eventually got it - took about a month to straighten everything out but I did get it."
        },
        {
          "Note": 3,
          "Lieu": "TR",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-08-25T14:36:37.000Z",
          "Titre": "I gave a gift to one of my friend and…",
          "Contenu": "I gave a gift to one of my friend and payment and everything else was smooth, but it would be better if I was able to set the price myself instead of having only 3 option (Uber cards)"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-10-05T06:07:14.000Z",
          "Titre": "Could be a 5",
          "Contenu": "Could be a 5, but customer service is non-existent and I always have issues with my credit cards being flagged. The regular sales are nice. Will still use but not my favorite site."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Abaas Bazil",
          "Nb_Reviews": 1,
          "Date": "2021-05-02T08:31:57.000Z",
          "Titre": "i got my goods but the user interface…",
          "Contenu": "i got my goods but the user interface when checking out is iffy. i suggest you work on making it smoother and quicker next time"
        },
        {
          "Note": 3,
          "Lieu": "SA",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-11-03T11:03:35.000Z",
          "Titre": "You need to try many times until u get…",
          "Contenu": "You need to try many times until u get the card, they kept denying my card asking me for my personal photo"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-10-01T15:29:13.000Z",
          "Titre": "Everything worked fine",
          "Contenu": "Everything worked fine. I just wish you had more specials and coupons and deals.."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2021-07-04T12:24:54.000Z",
          "Titre": "Need more deals!",
          "Contenu": "Wish they had more promotions for black Friday and deals in general."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter Wald",
          "Nb_Reviews": 1,
          "Date": "2018-04-13T17:49:34.000Z",
          "Titre": "Might use.",
          "Contenu": "Update got money back- will update again if they sort there stuff out quickly."
        },
        {
          "Note": 3,
          "Lieu": "CL",
          "Pseudo": "Zan Lance",
          "Nb_Reviews": 2,
          "Date": "2021-10-27T11:09:13.000Z",
          "Titre": "In short",
          "Contenu": "In short, received the wrong code"
        },
        {
          "Note": 3,
          "Lieu": "LK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-02-14T22:32:14.000Z",
          "Titre": "It's work",
          "Contenu": "It's workAnd very fast."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Cheryl (new customer)",
          "Nb_Reviews": 6,
          "Date": "2023-11-05T15:31:33.000Z",
          "Titre": "Easy to use website",
          "Contenu": "Easy to use website. Was easy to find the products that I wanted and checkout. Frustrated with what feels like a million and one emails asking to review my experience when I did it at the time of purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ren Aris",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T20:06:33.000Z",
          "Titre": "Love instantaneous delivery",
          "Contenu": "The instantaneous delivery of a digital code is an amazing feature to have. Only reason this is a 4 star and not 5 is not because there is any flaw but space for improvement like getting a bit more banana points back for purchasing. I think I've done maybe around 15-20 purchases and made around 80 cents so. Also it would be nice/convenient if there was a longer wait period between being inactive and the site logging you out. Anyways, love scratchmonkey and will hopefully continue to purchase from here"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Emi",
          "Nb_Reviews": 1,
          "Date": "2022-09-14T08:33:29.000Z",
          "Titre": "I had an error buying one of my codes",
          "Contenu": "I got charged $40 for two codes and only received one working code. I wrote an email to scratchmonkey support but didn’t receive any help. They only contacted me and gave me a working code after leaving a one star review (now four stars)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ukanlosgod",
          "Nb_Reviews": 2,
          "Date": "2023-09-14T04:02:45.000Z",
          "Titre": "Was fast",
          "Contenu": "Was fast, but let me make sure the code works before asking to review yourself"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Peter Williams",
          "Nb_Reviews": 2,
          "Date": "2023-10-05T00:45:29.000Z",
          "Titre": "easy to find",
          "Contenu": "easy to find, but wish there was more options of pricing for this type of card."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kyky",
          "Nb_Reviews": 1,
          "Date": "2022-10-05T18:57:16.000Z",
          "Titre": "A lot of issues with payment",
          "Contenu": "A lot of issues with payment, but after spacing out my postal code for some reason, that worked. Codes were redeemed no problem and I am happily shopping for NC items again, WITH boxes! Woo! :)"
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "Jodysee Ferguson",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T14:10:00.000Z",
          "Titre": "immediate codes",
          "Contenu": "immediate codessimple and easy to use once your cards are verified"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kaelynn",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T03:00:15.000Z",
          "Titre": "It's like the worst I can't even sign…",
          "Contenu": "It's like the worst I can't even sign in with my Facebook account like I would never ever use this"
        },
        {
          "Note": 4,
          "Lieu": "GY",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-04-20T20:45:45.000Z",
          "Titre": "Fast & Easy",
          "Contenu": "Fast & Easy - the website is easy to navigate, codes and codes are delivered instantly!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Megan",
          "Nb_Reviews": 2,
          "Date": "2023-08-13T22:12:34.000Z",
          "Titre": "I have issue with payment every time"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kittie Ć",
          "Nb_Reviews": 1,
          "Date": "2021-12-24T07:48:13.000Z",
          "Titre": "Credit Cards Issues but Good Service!",
          "Contenu": "I struggled to get my credit cards to work on the site; either being blocked by the site, or blocked by my credit company, so that was a bit frustrating. However the team (Chrys specifically) were super helpful in trying to help figure out the issues so I could finally make my purchase and then all was well :3."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Nikkitawny",
          "Nb_Reviews": 3,
          "Date": "2021-08-24T08:12:57.000Z",
          "Titre": "Not bad",
          "Contenu": "ScratchMonkeys tend to charge the same as the game sites for add-ons and things but without any additional tax, they also email the codes way faster and are just a pretty good alternative. One criticism is the banana points being pretty useless though but I can get over that"
        },
        {
          "Note": 4,
          "Lieu": "PE",
          "Pseudo": "Mafe Balmaceda",
          "Nb_Reviews": 3,
          "Date": "2023-09-16T18:12:28.000Z",
          "Titre": "Its good",
          "Contenu": "Its easy to buy here :) thats cool"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heide Stull",
          "Nb_Reviews": 1,
          "Date": "2018-10-14T20:06:31.000Z",
          "Titre": "When it works great, when it doesn't create a new account.",
          "Contenu": "When I had problems buying they were unable to be resolved. They always rejected my payment no matter what method I used. I finally gave up with support who gave me various excuses. I decided to give it one last try by creating a new account. I was magically able to buy with no issues. They get 4 stars because despite my past issues, this transaction took seconds to successfully complete."
        },
        {
          "Note": 4,
          "Lieu": "BH",
          "Pseudo": "BR",
          "Nb_Reviews": 6,
          "Date": "2019-04-13T09:01:52.000Z",
          "Titre": "It is legit",
          "Contenu": "To be honest I was skeptical at first but I did my purchase and it worked! I bought a $20 PSN Card, got the code immediately. I just redeemed it and got the funds added to my wallet. 4 Stars instead of 5 because my purchase failed the first time -my scratchmonkeys and paypal email didn’t match- and I got charged a $1 from paypal -.- It was annoying as hell. Definitely recommend them though! And Scartch would definitely be my go to site if I want to purchase another PSN card."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Sharon",
          "Nb_Reviews": 1,
          "Date": "2022-02-14T21:41:30.000Z",
          "Titre": "Easy online ordering and quick shipping"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2017-12-25T11:55:49.000Z",
          "Titre": "Website isn't best and isn't super …",
          "Contenu": "Website isn't best and isn't super clear on what your getting. I'm still assuming what I ordered was a gift card that can be used for whatever the receiver wants. However I'm not positive. Also when ordering I want positive if it was going to provide megan a digital code or not. I haven't transferred the code yet because it says basically once you click the transfer button it will be lost or gone south now I'm worried about if I do something incorrectly once I push that button will my money of been wasted? No real instructions..."
        },
        {
          "Note": 4,
          "Lieu": "BS",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-11-27T13:01:47.000Z",
          "Titre": "I love this site because my paypal and…",
          "Contenu": "I love this site because my paypal and debit card dont work for playstation store and on this site it works to buy playstation cards so keep up the good work 👍🏽🙏🏽"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Garrett Connery",
          "Nb_Reviews": 3,
          "Date": "2017-12-07T01:53:41.000Z",
          "Titre": "I recommend this site.",
          "Contenu": "The site is viewer friendly. The codes are instantaneous. The only down side is the site runs out of codes often and they have a dollar amount/monthly limit for some reason. I'd give 5 stars if those two issues didn't exist."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2018-11-27T18:18:03.000Z",
          "Titre": "This is only the first time I have…",
          "Contenu": "This is only the first time I have purchased from this site but other than one small glitch on my side I was able to purchase with ease and the website was easy to navigate so I would definitely recommend them!"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-02-01T06:11:40.000Z",
          "Titre": "hi scratchmonkeys.com",
          "Contenu": "hi you work good but have thing not understand why can`t buy any mount you make limit other i be have money in my account Paypal and you not make me go on say sorry lol good luck with your work"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kyle Buchanan",
          "Nb_Reviews": 2,
          "Date": "2021-10-30T04:47:53.000Z",
          "Titre": "Top Tier But..",
          "Contenu": "excellent security and fast delivery but I didn't get one of my orders and I was charged still waiting on it.  will update this post when the problem is solved"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "DawsonJr",
          "Nb_Reviews": 1,
          "Date": "2020-11-04T08:34:57.000Z",
          "Titre": "Original Order Too Large to Process",
          "Contenu": "Overall, a good experience; purchase was legitimate and code worked. Unfortunately, due to fraud concerns, my original order had to be modified from three items to one, and the promo for new members was wasted. Also, a minor discrepancy with order total (price for original order came to approx. $85 CAD, but showed as approx. $90 CAD on Paypal), which isn't exactly proper. I had concerns that I wouldn't get customer service on the weekend, and was surprised to see a reply back within an hour. After a couple days going back and forth, finally got a replacement coupon, but three codes at a time was still flagged (did order a single code again, and no troubles redeeming)! Will attempt to do two, but doesn't look promising that more than one code at a time will ever be permitted."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jhonny Joestar",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T08:08:00.000Z",
          "Titre": "Would give 5 if gave me banana points"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "BurrChase",
          "Nb_Reviews": 1,
          "Date": "2023-04-21T06:23:40.000Z",
          "Titre": "great love the website"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T09:25:44.000Z",
          "Titre": "Great website",
          "Contenu": "Great website, received the product within a few minutes of waiting - only problem is that the 'banana points' should be increased for some products."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2021-12-13T08:36:47.000Z",
          "Titre": "Was Doubtful in the beginning",
          "Contenu": "Was Doubtful in the beginning, thought would still give it a try turned out to be a good deal. Thank You ScratchMonekys.com for helping me."
        },
        {
          "Note": 4,
          "Lieu": "FI",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2018-10-04T14:08:33.000Z",
          "Titre": "It just works",
          "Contenu": "I tried Amazon, Newegg and countless other sites to buy USD PS store keys from EU, but all of those attempts hit a wall due to geoblocking. This site worked flawlessly."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-12-05T23:24:18.000Z",
          "Titre": "Responsive when there is an issue",
          "Contenu": "Someone scammed me on PayPal and bought stuff on Scratchmonkeys. They were quick to respond and offered help even though they were on holiday."
        },
        {
          "Note": 4,
          "Lieu": "MV",
          "Pseudo": "Thothy",
          "Nb_Reviews": 1,
          "Date": "2021-03-19T19:10:44.000Z",
          "Titre": "Include cards from other regions than US",
          "Contenu": "Include cards from other regions than US. I know so many people who’d choose scratch monkeys but they are limited by the diversity."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A Satisfied Customer",
          "Nb_Reviews": 4,
          "Date": "2018-11-24T16:18:52.000Z",
          "Titre": "Service from ScratchMonkeys.com",
          "Contenu": "While i have ordered only one product from ScratchMonkeys, but have ordered the same product several times, I have received very good service."
        },
        {
          "Note": 4,
          "Lieu": "MN",
          "Pseudo": "Tengis",
          "Nb_Reviews": 1,
          "Date": "2018-11-23T12:44:18.000Z",
          "Titre": "Its perfect for me",
          "Contenu": "Its perfect for me, bur now I cant purchase again, couse system say: Warning: Payment method required! :( :( :( please help me Scratch Monkeys"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "PizzaFan468",
          "Nb_Reviews": 3,
          "Date": "2021-07-31T22:15:22.000Z",
          "Titre": "Great and trustable website",
          "Contenu": "Great and trustable website. Though often have trouble with one of my debit card, the website never seems to accept it."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Cheryl (new customer)",
          "Nb_Reviews": 6,
          "Date": "2018-04-17T00:13:45.000Z",
          "Titre": "Awesome help and service",
          "Contenu": "I found Ashley at Scratch Monkeys really nice and helpful and I would totally use the Scratch Monkeys website again in the future."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2021-09-04T06:23:27.000Z",
          "Titre": "Quick and easy to use I like that I…",
          "Contenu": "Quick and easy to use I like that I don’t have to wait for an email to get my redeem code."
        },
        {
          "Note": 4,
          "Lieu": "TT",
          "Pseudo": "Fish",
          "Nb_Reviews": 3,
          "Date": "2020-09-30T11:28:19.000Z",
          "Titre": "Great service so far",
          "Contenu": "Great service so far. I've had no problem with my code order. I'll continue to shop here."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "RedKing",
          "Nb_Reviews": 1,
          "Date": "2016-01-02T00:24:12.000Z",
          "Titre": "Wonderful Site",
          "Contenu": "It was quick to get my code, it took me several times to register but after that it was smooth sailing"
        },
        {
          "Note": 4,
          "Lieu": "TH",
          "Pseudo": "ErBuc",
          "Nb_Reviews": 1,
          "Date": "2015-11-19T08:55:27.947Z",
          "Titre": "Simple and it works!",
          "Contenu": "I like the fast checkout. Once you register, everything just works.\rNo chasing missing emails."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sandy Lemire",
          "Nb_Reviews": 1,
          "Date": "2017-12-02T03:54:59.000Z",
          "Titre": "Bought from ScratchMonkey a couple of …",
          "Contenu": "Bought from ScratchMonkey a couple of times and have had no problems--quick and easy"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2021-04-18T11:49:32.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good! Only ordered once. But will definitely use again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J. Bouderdaben",
          "Nb_Reviews": 3,
          "Date": "2023-02-26T01:36:45.000Z",
          "Titre": "That it went through ok."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Pi",
          "Nb_Reviews": 1,
          "Date": "2020-04-11T08:52:10.000Z",
          "Titre": "Great",
          "Contenu": "Didn’t accept Revolut, but all fine otherwise"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sherrie Myers",
          "Nb_Reviews": 2,
          "Date": "2019-06-29T10:58:29.000Z",
          "Titre": "not a lot for wiz 101 and one one on…",
          "Contenu": "not a lot for wiz 101 and one one on sale"
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Some guy",
          "Nb_Reviews": 4,
          "Date": "2017-12-07T04:33:32.000Z",
          "Titre": "Only used it once so far but it was good"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Javier",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T11:22:27.000Z",
          "Titre": "good and fast"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T12:03:36.000Z",
          "Titre": "Very easy to use site"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2019-01-28T13:18:05.000Z",
          "Titre": "Just adress problems"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Andrew Walker",
          "Nb_Reviews": 1,
          "Date": "2019-11-20T13:50:57.000Z",
          "Titre": "Noice",
          "Contenu": "Very good service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joanna Bramblet",
          "Nb_Reviews": 2,
          "Date": "2023-12-08T09:46:33.000Z",
          "Titre": "Super easy purchase and redeeming…",
          "Contenu": "Super easy purchase and redeeming experience!  They also have a rewards program too!  So glad to have found this site!  Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "SR",
          "Pseudo": "Joel Rensch",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T17:00:29.000Z",
          "Titre": "Great service and Fast Delivery"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Janet M",
          "Nb_Reviews": 7,
          "Date": "2023-11-23T23:34:58.000Z",
          "Titre": "Easy to use and quick!",
          "Contenu": "Easy to use and you get your codes instantly. Love it! Only issue ever can be with some credit cards security so I suggest using PayPal."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Void Chakra",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T08:08:08.000Z",
          "Titre": "Always have the right stuff and perfect…",
          "Contenu": "Always have the right stuff and perfect timing"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2023-11-16T12:05:23.000Z",
          "Titre": "Good place to purchase as EU citizen",
          "Contenu": "Easy to purchase the items you couldn't buy from for example Gamestop because they don't accept non-US citizens. Fair price for such a purchase."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Probing Eye",
          "Nb_Reviews": 1,
          "Date": "2022-10-30T22:01:07.000Z",
          "Titre": "I've been buying from ScratchMonkeys…",
          "Contenu": "I've been buying from ScratchMonkeys for years and I've always been satisfied. The codes are received immediately upon payment. No waiting for emails!, and they can be easily forwarded as an opened gift or scratched and copied for your own personal use. As an added bonus, I love building up my Bannana Points.  Thanks ScratchMonkeys! for your continued service to the game card community :*"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bigbadbean",
          "Nb_Reviews": 1,
          "Date": "2023-10-31T14:28:38.000Z",
          "Titre": "Perfect online gifting",
          "Contenu": "As a small streamer doing giveaways, this worked perfectly on more than one occasion. No problems at all!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Amy",
          "Nb_Reviews": 6,
          "Date": "2023-09-16T18:27:47.000Z",
          "Titre": "Good Giftcard Site",
          "Contenu": "Great for buying Neocash cards as you get more for your money than buying it straight from the site. Looking forward to purchasing other cards from ScratchMonkeys!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marie",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T08:39:25.000Z",
          "Titre": "Fast and Easy",
          "Contenu": "Got the email with the code immediately, it was super easy to redeem.  Wonderful service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Peter Williams",
          "Nb_Reviews": 2,
          "Date": "2023-12-15T10:59:12.000Z",
          "Titre": "easy to find",
          "Contenu": "just easy transactions"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cheryl Tapper",
          "Nb_Reviews": 6,
          "Date": "2023-11-24T14:14:08.000Z",
          "Titre": "Great Website!",
          "Contenu": "Great website as it is easy to navigate and find what you want."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candy Thayer",
          "Nb_Reviews": 4,
          "Date": "2022-10-10T13:17:23.000Z",
          "Titre": "None better",
          "Contenu": "Always quick return on my codes. Site works flawlessly 99.999% of the time. Occasional issue with codes being out of stock but generally they are always there when I need them. Absolutely love this site."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Anon",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T17:47:53.000Z",
          "Titre": "Amazing company.",
          "Contenu": "I've been buying Wizard101 codes here since 2018/2019 or so, I've never had an issue with a code not working during my time purchasing here! I've probably spent somewhere around $300-$500.I couldn't recommend this website more, especially  since Kingsisle has introduced international tax on their website for membership and crowns purchases!"
        },
        {
          "Note": 5,
          "Lieu": "SE",
          "Pseudo": "Axistra",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T09:26:17.000Z",
          "Titre": "Never had any issues with this company",
          "Contenu": "Never had any issues with this company. Immediately get my codes and the process is quick and easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joe Huynh",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T02:37:16.000Z",
          "Titre": "Actually worked",
          "Contenu": "Actually worked. Itunes kept declining my gift card, so I went to this site as a roundabout. Was a little skeptical but they actually delivered!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer Delisle Ruddock",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T16:40:48.000Z",
          "Titre": "Scratch Monkeys is my Go To",
          "Contenu": "Easy to use interface, fast processing, very safe. I use this for Neopets cash cards because it processes faster than the actual site, and I get the bonuses associated with physical cards."
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Sofia M.",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T23:08:48.000Z",
          "Titre": "Quick, easy & fast",
          "Contenu": "I mostly do the payments through PayPal and receive the cards codes immediately. Been using it for a few years without any kind of issue and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MmeT",
          "Nb_Reviews": 12,
          "Date": "2022-09-08T15:23:56.000Z",
          "Titre": "Happy NC Card Customer!",
          "Contenu": "I use ScratchMonkeys to buy NC cards for Neopets. The quick delivery of the codes is appreciated and the codes have always worked for the proper amount of NC. I give ScratchMonkeys 10/10 bananas."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danni Lee",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T06:38:48.000Z",
          "Titre": "immedate digital delivery",
          "Contenu": "extremely impressed. i buy cards from walmart usually and have to wait a few hours before delivery. i dont know why i tried buying them from here sooner."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Deborah Slater",
          "Nb_Reviews": 3,
          "Date": "2023-06-26T22:18:35.000Z",
          "Titre": "Always fast and reliable",
          "Contenu": "Always fast and reliable. Have never encountered any type of problem in the years I have been using this company. 100% ."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brett Garner",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T06:32:12.000Z",
          "Titre": "Easy to use site with great safety"
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Eric Dimitri",
          "Nb_Reviews": 16,
          "Date": "2022-08-31T20:46:57.000Z",
          "Titre": "Best without any doubt.",
          "Contenu": "I can say it a thousand times. It is the best, most reliable digital code selling site. No doubt.Years buying here and will continue doing so"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "anonymous",
          "Nb_Reviews": 13,
          "Date": "2023-11-20T17:29:52.000Z",
          "Titre": "Perfectly like always thanks…",
          "Contenu": "Perfectly like always thanks A++++++++++++++++++++"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "lyn",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T08:19:26.000Z",
          "Titre": "Easy buy online",
          "Contenu": "Easy buy online. Quick, fast and always in stock."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Bonnie",
          "Nb_Reviews": 1,
          "Date": "2023-12-08T02:55:07.000Z",
          "Titre": "review",
          "Contenu": "I use this site all the time to get cards, they're great"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Wyatt Fahrenkamp",
          "Nb_Reviews": 2,
          "Date": "2023-11-15T16:47:26.000Z",
          "Titre": "Super fast delivery",
          "Contenu": "Super fast delivery, very easy to use."
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Desai",
          "Nb_Reviews": 2,
          "Date": "2023-02-14T07:51:11.000Z",
          "Titre": "Fast & Secure",
          "Contenu": "Quick, easy & secure transactions which are delivered promptly. Super easy to buy and redeem gift cards etc."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-04-24T15:00:30.000Z",
          "Titre": "I am always able to count on the speed…",
          "Contenu": "I am always able to count on the speed and dependability of ScratchMonkeys. This time was no exception! Thank You"
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Eric Dimitri",
          "Nb_Reviews": 16,
          "Date": "2023-05-19T21:27:12.000Z",
          "Titre": "Awesome",
          "Contenu": "Awesome. I have been buying codes in ScratchMonkeys for the last 4 years, and NEVER a problem. EXCELENT!!"
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Eric Dimitri",
          "Nb_Reviews": 16,
          "Date": "2022-10-18T20:14:26.000Z",
          "Titre": "Excelent!",
          "Contenu": "Excelent!! I have been using this for the past three years, and never an issue, alwayst instant code. Amazing"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candy Thayer",
          "Nb_Reviews": 4,
          "Date": "2023-03-18T14:55:11.000Z",
          "Titre": "Simply amazing",
          "Contenu": "Almost always have what I'm looking for and it's quick and easy to buy. I also love the fact that they make it possible to donate to an amazing cause."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cheryl Tapper",
          "Nb_Reviews": 6,
          "Date": "2023-11-03T13:40:10.000Z",
          "Titre": "User friendly website",
          "Contenu": "User friendly website and able to find what I was looking for a good price."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A Satisfied Customer",
          "Nb_Reviews": 4,
          "Date": "2023-03-23T13:59:43.000Z",
          "Titre": "Great Experience",
          "Contenu": "I always have a great experience with ScratchMonkeys except when they don't have what I want in stock."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Preston",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T05:28:47.000Z",
          "Titre": "The code was as told",
          "Contenu": "The code was as told, up to my expectations."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kerfalla Dioubate",
          "Nb_Reviews": 1,
          "Date": "2022-12-23T10:09:07.000Z",
          "Titre": "Very easy to purchase from",
          "Contenu": "Very easy to purchase from, and they have low denominations I didn't even know existed! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "JO",
          "Pseudo": "Abdallah shishani",
          "Nb_Reviews": 1,
          "Date": "2023-02-14T06:42:53.000Z",
          "Titre": "I have never had a problem buying or…",
          "Contenu": "I have never had a problem buying or using redeems from your website , easy to use."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Mohammed Benkeblia",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T20:49:52.000Z",
          "Titre": "They have exactly what you need",
          "Contenu": "They have exactly what you need. Only got 2 dollars? They got it. Got 100? They got it. And the reward system is top notch. Love it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "k. f.",
          "Nb_Reviews": 2,
          "Date": "2022-09-06T22:33:20.000Z",
          "Titre": "i’ve been buying from scratchmonkeys",
          "Contenu": "i’ve been buying from scratchmonkeys for years now + it’s been good! i usually get some bonus items too!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "REVA HARMAN",
          "Nb_Reviews": 2,
          "Date": "2023-11-24T19:28:50.000Z",
          "Titre": "Ease of ordering.",
          "Contenu": "Easy to order.  Does not take very long to get the product we wanted."
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Eric Dimitri",
          "Nb_Reviews": 16,
          "Date": "2023-01-24T22:23:05.000Z",
          "Titre": "Excelent!",
          "Contenu": "Excelent!! Most reliable, and 100% secure place, no extra fees to buy digital codes"
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "Anthony Mendoza",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T04:12:26.000Z",
          "Titre": "Buyer of years",
          "Contenu": "I love that they know how to listen to the customer, a couple of years ago they did not process my payments and the payment methods were somewhat limited, however over the years they have improved, and their service is incredible, safe and fast"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Candy Thayer",
          "Nb_Reviews": 4,
          "Date": "2022-09-25T03:07:54.000Z",
          "Titre": "neopet purchase",
          "Contenu": "Excellent site. Almost always has what I'm looking for with few glitches"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Danni Lee",
          "Nb_Reviews": 2,
          "Date": "2023-02-08T00:47:36.000Z",
          "Titre": "the code always works.",
          "Contenu": "havent had a single problem with any/all purchases here at scratch monkey. a buy a card, scratch it, and the code always works."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "dean p",
          "Nb_Reviews": 6,
          "Date": "2022-11-19T07:49:45.000Z",
          "Titre": "Excellent very quick gift cards…",
          "Contenu": "Excellent very quick gift cards available straight away just brilliant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Zach Wolfe",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T16:19:15.000Z",
          "Titre": "Instant delivery, legit codes",
          "Contenu": "Code generated instantly. Code worked. No complaints here. Will shop again."
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Krayola",
          "Nb_Reviews": 1,
          "Date": "2023-12-03T20:00:43.000Z",
          "Titre": "Always get what I buy 💯"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 5,
          "Date": "2023-11-28T00:49:31.000Z",
          "Titre": "Quick and easy way to get currency cards"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tim Lehnerer",
          "Nb_Reviews": 1,
          "Date": "2023-04-30T14:02:15.000Z",
          "Titre": "It was a digital purchase--nothing went…",
          "Contenu": "It was a digital purchase--nothing went wrong and I got what I paid for."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "AlwaysLuvly",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T02:18:33.000Z",
          "Titre": "Trustworthy no complaints on gifts…",
          "Contenu": "Trustworthy no complaints on gifts codes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Catherine Jackson",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T17:58:07.000Z",
          "Titre": "Instant and worked!",
          "Contenu": "It was instant and the code actually worked. Amazing will buy again>"
        },
        {
          "Note": 5,
          "Lieu": "PE",
          "Pseudo": "Mafe Balmaceda",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T20:23:04.000Z",
          "Titre": "It was good!",
          "Contenu": "It was good, very quicly to understand how the page worked and I was able to buy my things quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashleig",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T18:47:33.000Z",
          "Titre": "Super fast!",
          "Contenu": "Quick delivery and the code worked! Will use again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roberts Jerene Lippert",
          "Nb_Reviews": 3,
          "Date": "2023-03-29T11:53:42.000Z",
          "Titre": "I like buying neopets cards from you…",
          "Contenu": "I like buying neopets cards from you rather than their site. It's very easy and I trust Scratch Monkey."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laurie Dionne",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T00:15:34.000Z",
          "Titre": "Great service and turnaround time with…",
          "Contenu": "Great service and turnaround time with no problems.  I love this site"
        },
        {
          "Note": 5,
          "Lieu": "BH",
          "Pseudo": "BR",
          "Nb_Reviews": 6,
          "Date": "2023-10-20T16:00:43.000Z",
          "Titre": "Customer for more than three years",
          "Contenu": "Probably the cheapest option out there."
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Eric Dimitri",
          "Nb_Reviews": 16,
          "Date": "2023-06-24T00:05:44.000Z",
          "Titre": "Awesome as usual",
          "Contenu": "Awesome as usual. The best site for digital codes"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tierra Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-06-15T23:07:39.000Z",
          "Titre": "I love the smooth transaction process…",
          "Contenu": "I love the smooth transaction process and the banana points. Thanks"
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "franferparraga",
          "Nb_Reviews": 18,
          "Date": "2023-02-16T15:03:10.000Z",
          "Titre": "Excellent seller",
          "Contenu": "Excellent seller, faster and easy. No problems with transaction"
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "FolkenSamaEcuador",
          "Nb_Reviews": 10,
          "Date": "2022-09-03T03:01:28.000Z",
          "Titre": "Excellent!",
          "Contenu": "Excellent!Never Fails100% Prove all codecstrust a lot"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Deborah Slater",
          "Nb_Reviews": 3,
          "Date": "2022-09-20T11:42:15.000Z",
          "Titre": "Have used ScratchMonkeys.com for years…",
          "Contenu": "Have used ScratchMonkeys.com for years now, and never had any problems. Quick, and easy to use."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Angel Bentley-Miles",
          "Nb_Reviews": 1,
          "Date": "2022-11-25T15:31:35.000Z",
          "Titre": "Great fast reliable service",
          "Contenu": "I've been buying from them for years and never had an issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn Gallant-George",
          "Nb_Reviews": 1,
          "Date": "2022-09-01T04:48:45.000Z",
          "Titre": "Thanks for always making it quick and…",
          "Contenu": "Thanks for always making it quick and easy transactions!"
        },
        {
          "Note": 5,
          "Lieu": "JM",
          "Pseudo": "Navado Mcdonald",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T20:30:30.000Z",
          "Titre": "That it was fast and legit"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "I can't get no",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T21:39:52.000Z",
          "Titre": "You'll never have an issue with this…",
          "Contenu": "You'll never have an issue with this site! They're awesome."
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "juan jose gomez",
          "Nb_Reviews": 18,
          "Date": "2022-11-03T22:30:10.000Z",
          "Titre": "great",
          "Contenu": "great! perfect! todo ok, muy recomendable                   !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Amy",
          "Nb_Reviews": 3,
          "Date": "2022-09-23T00:32:08.000Z",
          "Titre": "Perfect!",
          "Contenu": "Quick and easy! Never had a problem with scratchmonkeys!"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Elli Schmid",
          "Nb_Reviews": 3,
          "Date": "2023-10-16T20:51:13.000Z",
          "Titre": "Easy and quick transaction!"
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "franferparraga",
          "Nb_Reviews": 18,
          "Date": "2022-10-30T21:07:37.000Z",
          "Titre": "Excellent service",
          "Contenu": "Excellent service, fast shipping of the code. No problems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jacob Hutchison",
          "Nb_Reviews": 1,
          "Date": "2023-03-26T08:41:56.000Z",
          "Titre": "Very Good Service",
          "Contenu": "10/10 love and will always use Scratch Monkeys! It’s super simple and very easy to use!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn R",
          "Nb_Reviews": 8,
          "Date": "2023-05-15T16:55:35.000Z",
          "Titre": "Ordering is easy",
          "Contenu": "Ordering is fast and receiving is faster. I recommend them always"
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Eric Dimitri",
          "Nb_Reviews": 16,
          "Date": "2022-12-04T21:12:14.000Z",
          "Titre": "Absolutely the best code seller",
          "Contenu": "Absolutely the best code seller. 100% trustable, and no extra charges."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MichaelPalma Songco",
          "Nb_Reviews": 1,
          "Date": "2023-09-03T03:41:37.000Z",
          "Titre": "it works right away",
          "Contenu": "it works right away, i was kinda unsure at first but way to go!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nora Ivana Burris",
          "Nb_Reviews": 3,
          "Date": "2023-03-12T07:25:43.000Z",
          "Titre": "I have  no problems using  scratch…",
          "Contenu": "I have  no problems using  scratch monkey"
        },
        {
          "Note": 5,
          "Lieu": "TT",
          "Pseudo": "Darnell Jagroop",
          "Nb_Reviews": 1,
          "Date": "2023-04-06T00:20:29.000Z",
          "Titre": "Purchase was quick and easy I would…",
          "Contenu": "Purchase was quick and easy I would recommend"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alison Timerding",
          "Nb_Reviews": 1,
          "Date": "2022-10-22T02:40:04.000Z",
          "Titre": "Fast and convienient!",
          "Contenu": "Fast and easy; very happy with my experience!"
        },
        {
          "Note": 5,
          "Lieu": "BO",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2023-06-14T23:49:42.000Z",
          "Titre": "Quick and reliable",
          "Contenu": "Quick and reliable, the code arrives instantly."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Patsy Cameron",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T02:59:44.000Z",
          "Titre": "The purchase was just fast and I luv…",
          "Contenu": "The purchase was just fast and I luv that. Everything right away. No waiting. Thank you. 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 4,
          "Date": "2023-03-17T03:31:00.000Z",
          "Titre": "Always quick and easy",
          "Contenu": "Always quick and easy, so that I'm able to get right back into my game. Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "hüseyin sevilmiş",
          "Nb_Reviews": 1,
          "Date": "2022-09-15T13:43:10.000Z",
          "Titre": "very nice site",
          "Contenu": "very nice site. It is a very fast and reliable site. successful site."
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Angelica Dalisay",
          "Nb_Reviews": 1,
          "Date": "2023-09-21T08:01:41.000Z",
          "Titre": "very easy to navigate"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Cheryl Tapper",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T07:59:52.000Z",
          "Titre": "User friendly website",
          "Contenu": "User friendly website and easy to find what I wanted to find."
        },
        {
          "Note": 5,
          "Lieu": "UY",
          "Pseudo": "Eric Dimitri",
          "Nb_Reviews": 16,
          "Date": "2022-11-18T02:04:25.000Z",
          "Titre": "Excelent",
          "Contenu": "Excelent, no issues, instant. The best!!"
        },
        {
          "Note": 5,
          "Lieu": "AR",
          "Pseudo": "Juan Gómez",
          "Nb_Reviews": 8,
          "Date": "2023-07-12T22:08:03.000Z",
          "Titre": "Excellent +10 all…",
          "Contenu": "Excellent +10 all ok!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Mohammed Ershadul Haq",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T18:18:32.000Z",
          "Titre": "Best for PS5/Switch gift card"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sami",
          "Nb_Reviews": 2,
          "Date": "2023-03-20T14:44:42.000Z",
          "Titre": "always extremely fast",
          "Contenu": "always extremely fast, reliable, my go to."
        },
        {
          "Note": 5,
          "Lieu": "EC",
          "Pseudo": "franferparraga",
          "Nb_Reviews": 18,
          "Date": "2022-11-19T00:43:04.000Z",
          "Titre": "Great choice for purchase of PSN codes",
          "Contenu": "Great choice for purchase of PSN codes, no problems"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T17:08:02.000Z",
          "Titre": "Simple and Easy",
          "Contenu": "No hassle. Just bought a gift card online and got it within seconds."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SUZANNE",
          "Nb_Reviews": 4,
          "Date": "2023-06-27T00:56:23.000Z",
          "Titre": "Still the best",
          "Contenu": "It is the best way to buy in-game currency."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Delano Williamson",
          "Nb_Reviews": 1,
          "Date": "2022-09-13T05:04:22.000Z",
          "Titre": "Smooth transaction",
          "Contenu": "Smooth transaction, no hassle no worries"
        },
        {
          "Note": 5,
          "Lieu": "MU",
          "Pseudo": "customer",
          "Nb_Reviews": 6,
          "Date": "2023-12-11T16:30:36.000Z",
          "Titre": "Instant..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kyle Mannon",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T19:58:58.000Z",
          "Titre": "I love using this site",
          "Contenu": "I love using this site.  You can buy $5 cards or & $100 cards.  You get them rite away."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dawn R",
          "Nb_Reviews": 8,
          "Date": "2023-04-22T00:18:00.000Z",
          "Titre": "It was fast and easy and love using…",
          "Contenu": "It was fast and easy and love using your website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sami",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T10:41:39.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience! 10/10 quick and simple ^^"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CLL",
          "Nb_Reviews": 3,
          "Date": "2023-05-27T17:42:42.000Z",
          "Titre": "Easy to find my gaming cards and redeem"
        },
        {
          "Note": 5,
          "Lieu": "BD",
          "Pseudo": "Mushfiq Alam",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T15:43:44.000Z",
          "Titre": "Flawless",
          "Contenu": "Been using this site for years no issues."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Jordan",
          "Nb_Reviews": 2,
          "Date": "2022-11-02T00:19:40.000Z",
          "Titre": "best gift code site",
          "Contenu": "always cheaper, faster and reliable for receiving gift codes"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Amy",
          "Nb_Reviews": 3,
          "Date": "2023-06-20T10:32:24.000Z",
          "Titre": "Quick and easy",
          "Contenu": "Quick and easy! I'd never go anywhere else!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "cjc",
          "Nb_Reviews": 7,
          "Date": "2022-11-16T01:29:40.000Z",
          "Titre": "Easy and Fast",
          "Contenu": "It was easy and very user friendly. I was able to purchase and receive the codes very quickly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Void Chakra",
          "Nb_Reviews": 3,
          "Date": "2023-05-10T01:39:13.000Z",
          "Titre": "So Far i have not had a problem at all …",
          "Contenu": "So Far i have not had a problem at all  very good place."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Aaron Renshaw",
          "Nb_Reviews": 2,
          "Date": "2023-11-11T18:03:55.000Z",
          "Titre": "Great",
          "Contenu": "Great. Easy. Worked, and I was nervous!Thanks :D"
        }
      ]
    }
  ]
}