{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "sellthatcell.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Té Williams",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T20:29:22.000Z",
          "Titre": "After mailing my mobile phone through…",
          "Contenu": "After mailing my mobile phone through UPS, I was advised that I could check my account on Sell That Cell to track my package. This is incorrect, only the UPS tracker kept me updated. I called after a few days to follow up since I hadn’t heard anything. I’m in CA and my package was mailed to TX. I was advised by a Carter that he would call me back in a couple of hours once he had my phone in hand. He ended up texting late at night which is very unprofessional, advising me that he couldn’t unlock my phone. He sent me text after text, asking where I purchased the phone from and how I wanted him to go about unlocking it. He sent screenshots as well. I truly did not know what was happening with my phone or how to fix it. Carter became very aggressive and informed me that he had to send my phone back to me. I called in again to speak with a supervisor about his behavior and come to find out, he is the owner of the company! I WILL NOT be using this company again. Horrible experience that could have been avoided."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rmt",
          "Nb_Reviews": 2,
          "Date": "2023-03-30T19:12:00.000Z",
          "Titre": "Shipping was fast an easy and I was…",
          "Contenu": "Shipping was fast an easy and I was contacted about each device when shipped read carefully before sending in a device and things will go exactly as they say this site has been the only one I’ve found to be trustworthy and honest about the amount they offer plus they’re also willing to work with you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "SpecialK",
          "Nb_Reviews": 2,
          "Date": "2022-10-08T22:48:34.000Z",
          "Titre": "Great company, process was simple, the amount was lower than expected for a new, although older model never used brand new cellphone.",
          "Contenu": "Sell that Cell made the exchange of my new \"never used A10 Samsung\" cellphone seamless. The process was quick and easy and I got $5 extra for submitting the phone within 3 days.  Too bad the amount was very low."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T16:35:21.000Z",
          "Titre": "AirPods Sold",
          "Contenu": "Everything was done professionally and I got paid pretty quickly! The representative was was very kind!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customerGlen",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T21:08:21.000Z",
          "Titre": "Intuitive online process from the get…",
          "Contenu": "Intuitive online process from the get go.Delivery Issue was handled PRO-Actively by STCI as a customer just dropped my phone in the mail after a short process online and waited for my $82"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria Villasmil",
          "Nb_Reviews": 4,
          "Date": "2023-10-18T16:44:31.000Z",
          "Titre": "Great service!",
          "Contenu": "Very quick and seamless process. They sent the shipping label, and a few days after I dropped my broken cell phone off at USPS I got the money through PayPal. It wasn't much, but my phone was broken and I'd rather it get reused for some purpose rather than throwing it away or keeping it in my nightstand. They were good about communicating and received payment very fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carl",
          "Nb_Reviews": 3,
          "Date": "2023-11-27T03:40:22.000Z",
          "Titre": "Sell That Cell makes it very easy",
          "Contenu": "Sell That Cell makes it very easy. They email you a prepaid address label and pay very quickly after receiving your old phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlésa Holmes",
          "Nb_Reviews": 3,
          "Date": "2023-10-19T20:21:10.000Z",
          "Titre": "The entire experience was great…",
          "Contenu": "The entire experience was great throughout. Carder’s communication was excellent and the process was quick, easy, and smooth. I will definitely use Sell That Cell again and I’m so glad I found them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rupa",
          "Nb_Reviews": 1,
          "Date": "2023-09-23T16:57:56.000Z",
          "Titre": "Apple Watch & AirPods broken and missing",
          "Contenu": "I shipped two items, an Apple Watch Series 6 that had a cracked screen, and AirPod pros with one missing EarPod. Rather than it sitting at home with no value I decided to ship it in. They sent me a prepaid shipping label and were very prompt to send me payment. I’d definitely recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mary",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T17:50:37.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience.  It was easy and quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melissa",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T01:19:23.000Z",
          "Titre": "Got paid $$ for my broken iPhone!",
          "Contenu": "My phone was broken, cracked, and way beyond repair. I looked at a few options for trading in my phone before finding SellThatCell.com and saw that they paid better than other competitors. I was sent a free shipping label the same day and within a week they paid out what they originally had offered! Great experience overall and would recommend this service to anyone looking to get a fair price for their used phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T15:46:12.000Z",
          "Titre": "Easy process",
          "Contenu": "Easy process, shipping label provided and several ways to receive payment; not a scam, just what it purports to be."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T01:00:40.000Z",
          "Titre": "Was up front on selling price",
          "Contenu": "Was up front on selling price.  Thank You Sell That Cell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Linda",
          "Nb_Reviews": 3,
          "Date": "2023-06-14T21:21:50.000Z",
          "Titre": "Easy, friendly and fast",
          "Contenu": "The communication was excellent. I was notified when my phone was received and they confirmed the condition. They notified me when the check went out, and I have since received it. Also, they gave me several dollars more than the other site I had looked into. It was easy and fast."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Newton Morand",
          "Nb_Reviews": 2,
          "Date": "2022-10-19T23:11:17.000Z",
          "Titre": "Carder has been a sheer pleasure to…",
          "Contenu": "Carder has been a sheer pleasure to deal with, when he finally got my IPhone (my error) he emailed me and told me he finally received it.  Also, I listed our phone in Fair Condition, & after Carder reviewed it, he thanked me for being honest with my evaluation, but said it in was in Good condition & increased my refund! Now, that’s an honest business man."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T17:11:14.000Z",
          "Titre": "Super easy- Super friendly",
          "Contenu": "Super easy.  Felt good that the broken phone wasnt gonna end up in landfill or even worse become permanent resident of my desk drawer.I was texted by a really nice representative named Carder and kept informed every step of the way from receipt of phone to me getting paid."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ferrwell",
          "Nb_Reviews": 2,
          "Date": "2022-09-18T05:12:38.000Z",
          "Titre": "Sell that Cell is recommended",
          "Contenu": "Once my device was received by Sell that Cell, I got a text message explaining my device prognosis. They were only able to use the gifted device for parts, unbeknownst to me. My payment was changed to a different amount and agreed upon. I was even given a few extra dollars for being a first time customer. The tech that handled my device always confirmed with me before an action was taken."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrey",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T22:30:25.000Z",
          "Titre": "That's was simple and fast process from…",
          "Contenu": "That's was simple and fast process from the beginning (initial estimate of the device) to the end (receiving a money through Zelle). There isn't any hidden fee or any tricks. The stuff was helpful and updated me with everything (device receiving, final estimate confirm, money transfer confirm). Nice service!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Todd C",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T00:39:03.000Z",
          "Titre": "Seamless and Awesome Experience",
          "Contenu": "This was a seamless and awesome experience. They offered, and paid, the most money of any other buy-back sites I researched (probably around 10 others). Free shipping label, and was paid via PayPal within 24 hours of them receiving my old phone. Highly recommended!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Big Papa",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T17:44:18.000Z",
          "Titre": "That's what I'm talking about",
          "Contenu": "Buyer gives a $5 reward for shipping within 3 days after   getting quote and buyer provides variety of payment options from Zelle and Venmo as well as old school check. Next day payment after receiving and inspection."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marli",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T03:30:08.000Z",
          "Titre": "Quick and Easy Process",
          "Contenu": "The owner, Carder, is great. They offer quick and transparent communication - either via email and text. The process to send over the cell phone was easy. I don't have a printer so the fact that they provided me with a QR code that the post office can print out the label for me was why I was able to send it over quickly. The payment transaction was quick and simple. My mom has an old iPhone she's trying to get rid of - going to definitely recommend her here."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Alexa O",
          "Nb_Reviews": 1,
          "Date": "2022-12-20T22:53:38.000Z",
          "Titre": "10/10 - Don't hesitate to Sell That Cell",
          "Contenu": "My whole experience was quick, convenient, and easy. I really wasn't sure if this service was legit and was skeptical but was pleasantly surprised by the whole experience. My phone was cracked, under finance, and still feel I received a fair payment. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Richard Snow",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T08:59:45.000Z",
          "Titre": "Real happy customer",
          "Contenu": "This company not only has terrific time deadlines they follow to insure you get your payment of sale about as quick as can be expected .... which is fast , real fast ..... then you can combine that with great customer service for those times a bump in the road comes up believe me, with Carder and the team of well qualified customer service reps available to assist you , (over many social media accounts and the standard Gmail) rest assured Carder if your lucky enough to get  was professional, curtious, a real breath of fresh air , as far as customer service calls are concerned... and the saying the customer is always right really is the way I felt working with Carder.... thanks again to the team of reps and Carder for sure gets the credit here..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shavena Smith",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T03:25:17.000Z",
          "Titre": "Great experience!",
          "Contenu": "I didn’t know what to do with my old cell phone. I wanted to get rid of it as it had water damage, a cracked screen, and didn’t turn on but I also knew it could be refurbished. Luckily I found Sell That Cell through google search. I filled out a quick description about my phone and received a free shipping label to send it off. This company was responsive and efficient and I was very thrilled to be paid for my old piece of junk. Overall, 10/10 experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-10T06:41:18.000Z",
          "Titre": "Great Service",
          "Contenu": "I had such a great experience with Sell That Cell. I had an issue where I left some info on my phone and was so thankful that the person assisting me was very attentive, patient, and understanding throughout the whole situation. They solved my issue with the phone quickly and sent me the money I received from turning that phone in. I’m very happy with my experience with this service and if in the future I would like to trade in another phone I will definitely be using this service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tommi Mathis",
          "Nb_Reviews": 2,
          "Date": "2022-11-09T02:09:45.000Z",
          "Titre": "Pleased with this Co",
          "Contenu": "The owner messaged me and informed me that my phone wasn't worth the original quoted price because of TracFone and gave me an updated offer. He was very professional and I accepted his offer and before I could even thank him he had already deposited the money in my account. Great experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff C",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T04:05:16.000Z",
          "Titre": "Carder at Sell That Cell was extremely…",
          "Contenu": "Carder at Sell That Cell was extremely responsive and professional.  When I’m in the market to sell another product, this company will be my first choice.  Sold my AirPods Pro and was extremely satisfied. I was paid on the same day the AirPods were received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jerrzzgirl",
          "Nb_Reviews": 2,
          "Date": "2023-01-23T18:31:49.000Z",
          "Titre": "Great job",
          "Contenu": "Great job, associate very helpful I had a little issue with my Zelle account. After mailing phone received a response in a very timely manner. Price quoted for phone was what I received. Would do business agsin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christine",
          "Nb_Reviews": 1,
          "Date": "2022-12-11T02:52:00.000Z",
          "Titre": "Great experience - would sell to them again",
          "Contenu": "Good experience. Sell That Cell provided me a shipping label and responded to my emails quickly. They were honest and offered me a fair price for my old phone. Would definitely recommend to others!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Laura",
          "Nb_Reviews": 1,
          "Date": "2022-11-16T22:08:42.000Z",
          "Titre": "I was very pleased with how easy",
          "Contenu": "I was very pleased with how easy, fast and efficient the website and service are. It took me less than 10 minutes to submit my phone on the website and print my label. The information they request is short and simple and the process is smooth. From the time I submitted my phone to having cash in my account was less than 48 hours and that was over a holiday weekend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Julie",
          "Nb_Reviews": 1,
          "Date": "2022-10-21T18:16:45.000Z",
          "Titre": "They gave me the most value for my phone…",
          "Contenu": "They gave me the most value for my phone that I could find online despite my screen being cracked. The transaction went super smoothly and the communication was great! They even give you a bonus if you ship within three days which is great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bruce",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T04:19:54.000Z",
          "Titre": "Quick responses and professional follow…",
          "Contenu": "Quick responses and professional follow up!! Easy payment."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Odalice",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T20:56:05.000Z",
          "Titre": "Looking to sell old phones?",
          "Contenu": "I've been trying to sell my old phones for the longest time and couldn't find a company I trusted enough, this was the most easiest process ive ever gone through they sent me the label per email and I sent in my phones literally a week later I was contacted about them receiving the phones and how much Id receive on my CashApp! Deff recommend if your looking to get cash on your old phones!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Twyla",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T03:22:53.000Z",
          "Titre": "This is an amazing service!!",
          "Contenu": "This is an amazing service! The process was easy, fast, and my money was deposited right into my checking account as soon as they received my phone. Carder was very helpful when I called to ask a couple of questions before sending in my phone.  I will recommend this company to everyone!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dr. Thomas Nguyen",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T00:50:33.000Z",
          "Titre": "Great place to sell your cell!",
          "Contenu": "Their used phone condition categories were way more detailed than other websites. My phone was in \"like new\" condition cosmetically, it just was just broken in that it wouldn't turn on anymore. All other websites offered me next to nothing because it automatically classified it as the lowest condition same as a completely smashed phone. The process of selling the phone was very easy. Shipping (and returns if necessary) were paid for and I received the offer, plus a bonus for sending it in quickly, within a couple days of my package arriving. Overall, great experience and I would definitely use this company again for selling any future used phones should the need arise."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clarence Jr.",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T00:45:22.000Z",
          "Titre": "Want to sell you old cell, this is the place to go!",
          "Contenu": "The shipping experience and the customer service were both EXCELLENT! I will certainly use Sell That Cell the next time I have a trade in. They also offer way more then I would have gotten anywhere else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "RODNEY DOUBLIN",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T20:11:39.000Z",
          "Titre": "Great company",
          "Contenu": "Me and Mr. Carder communicated by email and discussed everything and it was a smooth transaction NO GAMES like trying to change the agreed upon price I will definitely be doing business with STC again 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ashhilee",
          "Nb_Reviews": 1,
          "Date": "2023-01-07T21:34:12.000Z",
          "Titre": "I would use them again",
          "Contenu": "The person I spoke with was helpful and worked around my slow responses due to work. They were able to assist me with the reimbursement as well as return a couple of the devices that I entered incorrectly in the system, with no charge."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T22:24:28.000Z",
          "Titre": "Quick and easy",
          "Contenu": "The entire process was quick and easy. I got a great deal for a cracked OnePlus 7 Pro in comparison to other companies. I contacted the company because I had not received a pre-paid shipping label and received a response in a matter of minutes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mel Lee",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T19:49:57.000Z",
          "Titre": "The process was easy!",
          "Contenu": "The process was easy and payment was fast!  I received feedback about the phone I sent in...and I approved the changes.  The transaction was easy!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2022-09-12T00:09:13.000Z",
          "Titre": "Easy and honest!",
          "Contenu": "This was such an easy and trustworthy company to work with. I sent in 2 cell phones and within a few days was contacted by Carder, who was super helpful! I got my money quickly and Carder was very efficient! Thank you so much, will definitely be doing business with them again!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Golden Crybaby",
          "Nb_Reviews": 2,
          "Date": "2023-05-25T16:31:53.000Z",
          "Titre": "My phone was 100% broken and cracked…",
          "Contenu": "My phone was 100% broken and cracked all over the way. Anyway, Sell That Cell have opportunity to sell anything at right price. It was such a pleasure to be recommended by this service and i make money from my old phone just in 2 days!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 2,
          "Date": "2022-09-23T02:27:45.000Z",
          "Titre": "Couldn't have done better!",
          "Contenu": "Sell That Cell couldn't have done a better job. Shipping was prepaid, and payment was extremely rapid, and exactly as quoted. I will without a doubt be a returning client."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeffrey H",
          "Nb_Reviews": 5,
          "Date": "2022-11-30T19:00:10.000Z",
          "Titre": "A perfect experience",
          "Contenu": "I had an old iPhone XS that I no longer needed and did not want to deal with eBay.  After much research, I found SellthatCell as the best option for me. I could not be happier as the experience was flawless and quick. Truly perfect in every way.I cannot recommend them highly enough. That you for being great!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T21:22:22.000Z",
          "Titre": "Quick response and fair offer",
          "Contenu": "Sell That Cell responded very quickly when I texted them to ask about a cell phone not on their website. They made me an offer, sent me a postage paid mailing label and quickly sent me a check upon receipt of my phone."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff C",
          "Nb_Reviews": 2,
          "Date": "2022-10-01T20:12:07.000Z",
          "Titre": "Quick service",
          "Contenu": "Carder at SellThatCell is awesome.  Very quick and responsive regarding the sale of AirPods Pro.  Received payment the day the AirPods were received.  The next time I’m in the market to sell a product, SellThatCell will be my first consideration."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Melody",
          "Nb_Reviews": 1,
          "Date": "2022-10-07T01:30:19.000Z",
          "Titre": "Super amazing customer service",
          "Contenu": "Super amazing customer service, my phone was locked when I sent it in. They spent the better part of a day walking me thru getting it unlocked so they could give me top dollar."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shannon Cleer",
          "Nb_Reviews": 1,
          "Date": "2022-10-15T01:32:44.000Z",
          "Titre": "The best quote out there!",
          "Contenu": "The best quote out there!! I recieved my payment the day after it was recieved. Carden wallace was great!! There was confusion on my part about payment and he was patient kept in constant communication to make sure i got paid!!! I would highly recomend this site and him for your next transaction. A++++ ACROSS THE BOARD!!! THANK YA"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lyla",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T15:18:30.000Z",
          "Titre": "Awesome payout and good service",
          "Contenu": "I am very happy with my experience with Sell That Cell. It was a higher payout than any other site. They texted when they reviewed the shipment to make sure it was correct. The money was in my account within the day I confirmed the price they sent after they reviewed the phones. They were very nice and helpful. I did find that the website order tracking was not working but it was great otherwise. Will use again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal J Huey",
          "Nb_Reviews": 3,
          "Date": "2022-09-18T19:37:47.000Z",
          "Titre": "Perfect easy instructions !",
          "Contenu": "I had a great experience selling my broken iPhone.    Instructions were clear and Carden was very helpful about iCloud cancellation.  I'm not very tech savy so his help was paramount.Thank you again .   I hope I don't get another broken phone but if I do I would use your business again. C. Huey"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M. Vasquez",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T00:37:05.000Z",
          "Titre": "Great Experience",
          "Contenu": "Sell That Cell promptly gave me a quote for my item, sent me a free mailing label and kept me informed throughout the process of the sale. I highly recommend them for cashing in on old devices!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-12T15:51:25.000Z",
          "Titre": "We sent an old phone back",
          "Contenu": "We sent an old phone back, after they got it and inspected it, they text to confirm the amount and payment method, we had the money in minutes. This was a super fast, easy experience!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isabelle",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T21:41:51.000Z",
          "Titre": "Great Service!",
          "Contenu": "The process was really simple and easy to follow - Carder was also really friendly and helped me receive my shipping label and payment fast too :) Would definitely sell my used tech here again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T22:34:51.000Z",
          "Titre": "Prompt response",
          "Contenu": "Prompt response. Within hours of receiving my device an agent responded to confirm the payment method and kept the promised rate.Will definitely return for future sales."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-27T02:32:41.000Z",
          "Titre": "Fast service",
          "Contenu": "Fast service, quick response in email, and got paid in quickly"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jessica Gray",
          "Nb_Reviews": 2,
          "Date": "2022-12-18T21:38:28.000Z",
          "Titre": "10 STARS if I could",
          "Contenu": "The entire process was so smooth and easy. You get a text with any comments or changes after devices are reviewed, which allows for a quick respond time. Payment was Zelled that very instant. AND all without any sales pitch or vocal convo. 10 STARS!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eman Salama",
          "Nb_Reviews": 1,
          "Date": "2022-08-27T00:57:13.000Z",
          "Titre": "They are very quick and professional",
          "Contenu": "They are very quick and professional. They payed me $15 extra for shipping my items within 3 days of receiving the label. They can pay for your broken damaged items. I highly recommend them."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shaunda",
          "Nb_Reviews": 1,
          "Date": "2022-09-23T23:16:41.000Z",
          "Titre": "I'm very thankful for this company",
          "Contenu": "I'm very thankful for this company. They are honest and pay in a timely manner. The employees are very kind. I was kept updated on my item's shipment and review. I would definitely recommend this company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Charlotte Perez",
          "Nb_Reviews": 5,
          "Date": "2023-03-27T08:54:34.000Z",
          "Titre": "Good job",
          "Contenu": "Good job, very helpful associate. I had a little problem with my Zelle account. After the email received a response in a very timely manner. The price quoted for the phone was what you received. I would do business agsin."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "LissaD",
          "Nb_Reviews": 2,
          "Date": "2022-09-18T23:15:32.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience.  Got rid of my old cell, they made it so simple, all I had to do was take it to the post office.  Very polite, kept in touch with me via text and email through the entire process.  Would definitely recommend this service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara",
          "Nb_Reviews": 1,
          "Date": "2022-09-02T04:33:35.000Z",
          "Titre": "Great option for an unwanted device",
          "Contenu": "I choose sell that cell because of its good ratings and was not disappointed. Clear instructions, responsive and friendly. Glad I didn’t have to just toss my device in a drawer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen Fleming",
          "Nb_Reviews": 2,
          "Date": "2022-09-10T22:01:33.000Z",
          "Titre": "Pleasantly pleased!",
          "Contenu": "My husband and I changed carrier companies and decided that we would get new phones. My husband was definitely due for an upgrade. I thought why donate when maybe we could get a few bucks? So I started looking online for somebody who buys old phones and found Sell that Cell. I had never heard of them but everything looked so authentic on the site, I thought why not. They even offered an incentive for getting the phones to them quickly of $5 per cell.  So I did everything they instructed, set my phones to factory settings, removed the Sim cards, shined them up, and packaged them safely, and printed out the First Class Packing Return slip and the cell packing slip. The return slip on the outside of my package, and the packing slip inside. I handed it to a postal worker, as Sell That Cell suggested, got a receipt so I could track my package, and waited. I shipped my package on Wednesday, got updates from USPS, Sell That Cell received my package Friday and I had my money Saturday. SEAMLESS! They did everything they said they would do! I highly recommend Sell That Cell the next time you’re looking to upgrade and relinquish old phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ncfsrb",
          "Nb_Reviews": 3,
          "Date": "2022-12-09T03:37:20.000Z",
          "Titre": "Very Pleasant Experience",
          "Contenu": "Everyone was great to deal with. You offered the best price and the smoothest, easiest, most pleasant experience. Everything proceeded in a very timely manner and could not have been more pleasant."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-12T02:20:42.000Z",
          "Titre": "amazing service",
          "Contenu": "Great communication, very quick and easy service. Will definitely continue to use them in the future and will recommend to other people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Reina Soltero",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T21:56:11.000Z",
          "Titre": "Great Choice when deciding to sell your phone",
          "Contenu": "The process was so extremely easy and fast! I was a little worried because my phones were delivered but I hadn’t heard back so I emailed them, got a fast response and a zelle payment! Got paid in literally 5 days. So glad I chose Sell That Cell!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachael B",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T21:14:11.000Z",
          "Titre": "The process was easy, very pleasant communicative workers",
          "Contenu": "The process was very easy! I just printed the label, scheduled the pickup from my mailbox, it went straight through to the company and I got my money. There was a delay in updating that my package had been received, but when I asked about it I got a couple of updates from very kind workers and all was well. Got a good price and the money transfered just in time to save me a fee. Would use again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-02-07T01:06:56.000Z",
          "Titre": "Great service",
          "Contenu": "Had an old phone that I didn't want to just throw out.  Received a small payment for sending it in and now have one less piece of clutter laying around.  Quick and easy.  Everything went exactly as described on the website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gretchen",
          "Nb_Reviews": 1,
          "Date": "2022-11-27T04:46:14.000Z",
          "Titre": "Sell me cell is 100% legit!",
          "Contenu": "Im am super happy with my experience using sell my cell. It was quick, easy and 100% real!!! My old iPhone 11 was very broken. It was bent, had a crack on the camera lens and wouldn’t turn on. Other services either quoted me $22 or less or wouldn’t accept my phone at all. Sell my cell gave me $76 for that phone + and extra $5 for sending it out within 3 days of receiving my QR code. Everything was legit and went down without a hassle. It took about 5 days for my phone to arrive and once it did, the money was in my cash app within 24 hours. They also were in communication with me the entire time! This is the best service! Thank you!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Crystal Coleman",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T11:04:53.000Z",
          "Titre": "Very professional",
          "Contenu": "Very professional, quick, kind and made me feel comfortable!  Gave me a very good price for my phone!  God bless then and their business. Go use their company what are you waiting for."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott K",
          "Nb_Reviews": 1,
          "Date": "2022-09-20T12:39:58.000Z",
          "Titre": "Best Way To Sell Electronics",
          "Contenu": "The process was easy to obtain a quote and ship my used electronics with a fast payment after the electronics were received and reviewed.Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim",
          "Nb_Reviews": 1,
          "Date": "2022-10-12T18:06:37.000Z",
          "Titre": "Quick and simple process",
          "Contenu": "Quick and simple process! Had an old phone just laying around so I sent it to Sell That Cell. Great communication from shipping to payment! Thanks Carder!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elliana",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T22:38:38.000Z",
          "Titre": "Awesome Service!",
          "Contenu": "I was given a great offer, and they paid for the shipping. It was very simple and convenient, and they held up to their offer. Overall it was a great experience, I will be using them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ria",
          "Nb_Reviews": 2,
          "Date": "2022-11-30T23:58:10.000Z",
          "Titre": "I appreciated your clear instructions…",
          "Contenu": "I appreciated your clear instructions and timely responses to my questions. Your offer was fair and you transferred the money quickly. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kris",
          "Nb_Reviews": 1,
          "Date": "2023-06-02T23:58:40.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience! Carder was very helpful and payment was made in a timely fashion. Would use this service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Katherine",
          "Nb_Reviews": 1,
          "Date": "2022-09-03T21:25:55.000Z",
          "Titre": "Great service",
          "Contenu": "This is a really great way to sell your phone! I sold mine to them and they were quick and helpful. I sent it in on the August 31 and got my money on September 3. If I ever need to sell another electronic I will definitely be using them again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rosetta",
          "Nb_Reviews": 1,
          "Date": "2022-08-24T21:03:05.000Z",
          "Titre": "Everything went as promised",
          "Contenu": "Everything went as promised, except I could not obtain the digital card, so had to wait for the paper check to come. Still, did not take that long."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jay Smith",
          "Nb_Reviews": 7,
          "Date": "2022-11-11T23:12:40.000Z",
          "Titre": "Fast evaluation and payment",
          "Contenu": "Mailed my phone on the 4th, got my Zelle payment on the 8th.  They honored their offer and the whole process couldn't have been faster or easier.  I will definitely use them again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Joline",
          "Nb_Reviews": 1,
          "Date": "2022-10-08T17:02:01.000Z",
          "Titre": "I’m very happy I chose Sell that cell",
          "Contenu": "I’m very happy I chose Sell that cell. They were a pleasure to do business with. Honest fair and quick turn around.  I received my payment immediately after they tested the phone.  I will choose them for all my old broken outdated phones."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T18:33:43.000Z",
          "Titre": "Great company would recomend gives you…",
          "Contenu": "Great company would recomend gives you more money than the eco ATM that's for sure thank you for your service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-11-06T19:37:01.000Z",
          "Titre": "I received the highest quote for my…",
          "Contenu": "I received the highest quote for my iPhone. They delivered everything as promised on the estimate, they are also great communicators, prior to issuing me my payment, they verified that my information was correct."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lydia",
          "Nb_Reviews": 1,
          "Date": "2022-10-16T03:10:51.000Z",
          "Titre": "Fast, Easy, and Professional",
          "Contenu": "Fast and easy! I did send in a different phone. They called and let me know and asked if I still wanted to sell it to them at a different amount.(They all look alike to me) Very professional. Yes I highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "happy customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-28T23:43:13.000Z",
          "Titre": "The customer service is really kind",
          "Contenu": "The customer service is really kind, keeps you updated, and replies fast. They made my experience great and easy"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Ezekiel Airegbeta",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T22:38:58.000Z",
          "Titre": "Sell that cell",
          "Contenu": "October 4, 2023EzFast service, easy to use website, prepaid postage."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dagny",
          "Nb_Reviews": 3,
          "Date": "2022-12-15T20:58:18.000Z",
          "Titre": "Sell That Cell Gets The Job Done, Even While Moving!",
          "Contenu": "My order was completed even while they were in the middle of moving locations. The payment process was fast and easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T02:41:06.000Z",
          "Titre": "Great customer service",
          "Contenu": "Great customer service. Nice person I spoke with and was very fast and reliable with getting me my money’s worth."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Christopher Ghalayini",
          "Nb_Reviews": 2,
          "Date": "2022-10-14T23:07:53.000Z",
          "Titre": "Absolutely flawless and easy process",
          "Contenu": "Absolutely flawless and easy process. Best value for trade in and quick payment upon receipt. A+ company."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dez",
          "Nb_Reviews": 1,
          "Date": "2022-10-09T03:17:50.000Z",
          "Titre": "This was a quick and easy experience.",
          "Contenu": "This was a quick and easy experience.I wanted to recycle my phone but it was going to cost money even though it's fixable. So I looked around and found this company. They helped me make a stress free decision. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T05:06:56.000Z",
          "Titre": "Very easy company to work with",
          "Contenu": "Very easy company to work with. They followed through with their promise and I received payment quickly. I am very happy with my experience."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Steve",
          "Nb_Reviews": 2,
          "Date": "2022-10-29T02:05:34.000Z",
          "Titre": "Fast payment",
          "Contenu": "Fast payment, responsive local customer service and follow up. I’ll be doing business with them again for sure."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nancy",
          "Nb_Reviews": 3,
          "Date": "2023-05-11T01:16:06.000Z",
          "Titre": "Easy to work with!",
          "Contenu": "Easy to work with and provide information to you if something changes.  Also let’s you know when your payout is sent to you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jules",
          "Nb_Reviews": 1,
          "Date": "2022-09-10T23:33:44.000Z",
          "Titre": "Great overall experience",
          "Contenu": "My order was taken care of and paid quickly. Great experience. Will definitely their service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "M Grossi",
          "Nb_Reviews": 1,
          "Date": "2022-09-17T23:11:37.000Z",
          "Titre": "Great Company",
          "Contenu": "Solid Company. Accountable people and readily accessible in the United States. Would do business again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Customer",
          "Nb_Reviews": 5,
          "Date": "2022-10-27T21:39:58.000Z",
          "Titre": "Easy to navigate on website Sellthatcell",
          "Contenu": "Easy to navigate on website, very fair offer and quick response from representative.I would use this service again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-01-15T10:59:00.000Z",
          "Titre": "Service was great",
          "Contenu": "Service was great, he helped me troubleshoot all the issues and followed up with me multiple times. Payment was quick and easy as well!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Demetria",
          "Nb_Reviews": 1,
          "Date": "2022-10-03T01:44:07.000Z",
          "Titre": "The process of selling my phone…",
          "Contenu": "The process of selling my phone couldn’t have been any easier!!  The support was wonderful and any questions I had were answered right away!!  I needed the money and I got it quickly!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "A. Ford",
          "Nb_Reviews": 4,
          "Date": "2022-12-12T22:57:08.000Z",
          "Titre": "Nice doing business with you",
          "Contenu": "I recently came across this company. Wish I would have found them sooner. But now I know. Quick and easy process. And money sent to your app of choice. Will recommend to other people."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Matthew  Mckinney",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T17:53:09.000Z",
          "Titre": "Best offer for my phone that I could find!",
          "Contenu": "I am very happy with how easy it was for me to sell my old phone to sellthatcell! They provided the highest pay and I checked around at a lot of different websites!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "ACJones",
          "Nb_Reviews": 3,
          "Date": "2023-03-20T03:23:50.000Z",
          "Titre": "Easy, Courteous, and Fair Payment",
          "Contenu": "Simplicity of the entire process, especially the prepaid shipping label.  And notification of reciept and processing of my old cell phones was very through and courtious."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2022-12-09T01:55:13.000Z",
          "Titre": "Helped me unlock the phone as it was…",
          "Contenu": "Helped me unlock the phone as it was broken and didn’t know how I could on new phone. Pay received quickly, way faster than expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T18:43:12.000Z",
          "Titre": "Awesome company to deal with",
          "Contenu": "Awesome company to deal with, quick response and great prices! Would recommend to others."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Roger",
          "Nb_Reviews": 1,
          "Date": "2022-09-22T22:56:57.000Z",
          "Titre": "Great assistance had 2 iPads",
          "Contenu": "Great assistance had 2 iPads. Called and got directions on how to send 2Was told if I sent them within 3 days get a 5.00 each bonus. All he said was true."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T17:10:45.000Z",
          "Titre": "Easy process with very clear…",
          "Contenu": "Easy process with very clear communication from the folks at Sell That Cell."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T00:43:45.000Z",
          "Titre": "Got a text from Carder verifying the…",
          "Contenu": "Got a text from Carder verifying the payment method and made sure it went through."
        }
      ]
    }
  ]
}