{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "shortlistd.io",
      "Review": [
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T10:17:19.000Z",
          "Titre": "The selection process is totally…",
          "Contenu": "The selection process is totally opaque. The decision is not supported by valid reasons.The results take very long. That's understandable because you might be handling high volume."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Mohammed Alibhai",
          "Nb_Reviews": 9,
          "Date": "2023-06-28T15:32:40.000Z",
          "Titre": "A little difficult for people with…",
          "Contenu": "Not too clear on the requirements i.e. didn't know exactly what the client requirements were therefore a little difficult for people who have disabilities."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "agha khan",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T18:12:25.000Z",
          "Titre": "Great Platform for providing best candidate to best client",
          "Contenu": "I really appreciate Mr Adil and its Team hard working with honestly for providing best clients and All the time keeps best link for helping, no time matters all the time be ready for helpingits great platform for best job providing."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "devesh sikarwar",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T09:27:00.000Z",
          "Titre": "I got an offer and everything within…",
          "Contenu": "I got an offer and everything within one hour. Amazing 🤩"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Subhan Ali",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T16:36:29.000Z",
          "Titre": "Excellent Service",
          "Contenu": "Mr. Adil and the Shortlistd.io team swiftly connected me with a job within a week. Their professionalism and efficiency were impressive. The entire team exudes a high level of expertise and support, making the recruitment process seamless. I highly recommend this firm for their personalized and effective approach to job placement. Grateful for their assistance!"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Paul Chinedu",
          "Nb_Reviews": 1,
          "Date": "2023-10-30T11:36:30.000Z",
          "Titre": "Great user experience. Just landed a job",
          "Contenu": "I recently joined the shortlistd.io platform after successfully completing their verification process. The platform matched me with a job that aligns perfectly with my experience, which I had highlighted on my CV. I submitted my application and received prompt feedback from the company. They scheduled a screening call to determine if I was a good fit for the role.During the interview, I found that my goals, skillset, and experience were a great match for the company's needs. At the end of the interview, they informed me that I would hear from them soon. To my delight, I received an email just two days later, confirming that I had been offered the job!I'd like to give a special shout-out to the founder, Adil Gwiazdowski. His support and guidance throughout the process were invaluable. If you're a software engineer seeking excellent remote job opportunities, I highly recommend trying out shortlistd.io"
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "abdullah",
          "Nb_Reviews": 1,
          "Date": "2023-11-23T12:07:23.000Z",
          "Titre": "great work from and adil and…",
          "Contenu": "great work from and adil and shortlistd, connected me with talent very quickly. many thanks to adil and shortlistd team."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Bartt",
          "Nb_Reviews": 1,
          "Date": "2023-11-14T11:00:13.000Z",
          "Titre": "Find a good opportunity with Shortlist",
          "Contenu": "Shortlistd.io helped me connect with the right opportunity, and the experience with them was great and smooth."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Abdelfattah Ragab",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T14:13:59.000Z",
          "Titre": "Best platform and perfect client match",
          "Contenu": "Shortlistd is focused, easy and straightforward. It eliminates unnecessary from filling that I was able to provide all my details and complete my profile in few minutes.I was able to find 100% perfect match client that matches my qualifications and expectations.It is the best platform I have ever used to land a job."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Andrew MacLachlan",
          "Nb_Reviews": 5,
          "Date": "2023-05-16T11:27:30.000Z",
          "Titre": "Quality over Quantity",
          "Contenu": "Quality of experience for both candidates and employers. Shortlistd.io is laser focused on quality over quantity - this is important for everyone involved in the hiring process.From a candidates perspective, it couldn't be easier - upload your CV/Resume, answer some additional questions around preferences etc, and you're done. No double entry of data."
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-10-19T15:41:59.000Z",
          "Titre": "Good experience so far as a developer.",
          "Contenu": "I really like the platform itself and the owner who is working hard to provide great talent to companies."
        },
        {
          "Note": 5,
          "Lieu": "AG",
          "Pseudo": "Michael Singh",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T19:56:04.000Z",
          "Titre": "Verifying references before onboarding…",
          "Contenu": "Verifying references before onboarding is an industry practice that seems to be excluded by some staffing companies I am also a part of"
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-21T10:35:58.000Z",
          "Titre": "Incredibly easy platform",
          "Contenu": "Incredibly easy to use and offers great talents meeting every tech hiring need."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Learnmystuff",
          "Nb_Reviews": 2,
          "Date": "2023-06-27T07:31:12.000Z",
          "Titre": "Very organized and interactive portal…",
          "Contenu": "Very organized and interactive portal to help in streamlining of hiring professionals and also easiest way to put across your requirements to make it more convenient for applicants in finding the right job.Good Job."
        },
        {
          "Note": 5,
          "Lieu": "GH",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-10-01T17:54:28.000Z",
          "Titre": "Great Platform",
          "Contenu": "On point. One of the best recruitment platforms with AI enabled matching."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Youssef Muhammad",
          "Nb_Reviews": 1,
          "Date": "2023-03-05T12:35:11.000Z",
          "Titre": "Shortlistd provides all comfort ways in…",
          "Contenu": "Shortlistd provides all comfort ways in the MENA region to find a job and I felt like they supported me till the end"
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "Fasi",
          "Nb_Reviews": 1,
          "Date": "2023-09-30T16:44:50.000Z",
          "Titre": "Very transparent and helpful",
          "Contenu": "Very transparent and helpful. Makes you feel as though they want the best for you which is amazing"
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Oluwatobi Afolabi",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T12:10:58.000Z",
          "Titre": "I had a fantastic experience using…",
          "Contenu": "I had a fantastic experience using shortlisted.io, from connecting me with the right opportunities to supporting me through the entire interview process. For the excellence and attention to details that goes into the service they provide, I'm more than happy to recommend their platform to anyone."
        },
        {
          "Note": 5,
          "Lieu": "AE",
          "Pseudo": "UAE Recruiter",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T10:56:38.000Z",
          "Titre": "Quality candidates",
          "Contenu": "In a world where companies have to review hundreds of resumes to find a few suitable candidates, this is a refreshingly efficient source of good candidates that were already vetted by industry leaders."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Adeyemi Gbenga",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T12:21:11.000Z",
          "Titre": "Great Experience",
          "Contenu": "My talent representative stood by me throughout the recruiting process, providing valuable tips and feedback, and even helped me negotiate my offer. The overall experience was excellent, and I would highly recommend this company to anyone looking to land their next job."
        },
        {
          "Note": 5,
          "Lieu": "EG",
          "Pseudo": "Mohamed Hendy",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T12:27:08.000Z",
          "Titre": "Creativity 👌",
          "Contenu": "My best personal experience ever was with shortlist.io. I found creativity, brilliance, and clarity in their approach. Also, great attention to customers, speed and flexibility of communication."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Clinton Onuigbo",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T11:24:20.000Z",
          "Titre": "It was seamless.",
          "Contenu": "It was seamless.I didn't have to register forms for applications and the communications were utmostly hassle-free"
        },
        {
          "Note": 5,
          "Lieu": "TH",
          "Pseudo": "Anthony Esdaile",
          "Nb_Reviews": 2,
          "Date": "2023-08-14T17:38:53.000Z",
          "Titre": "Simply a cut above the rest",
          "Contenu": "Simply a cut above the rest  i highly rec this to anyone"
        },
        {
          "Note": 5,
          "Lieu": "CY",
          "Pseudo": "customer",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T16:39:47.000Z",
          "Titre": "Very professional",
          "Contenu": "Very professional experience."
        },
        {
          "Note": 5,
          "Lieu": "IN",
          "Pseudo": "Customer",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T16:49:11.000Z",
          "Titre": "It's great experience 😄"
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Andrei",
          "Nb_Reviews": 1,
          "Date": "2023-06-06T23:13:41.000Z",
          "Titre": "Great",
          "Contenu": "The shortlist community"
        }
      ]
    }
  ]
}