{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "site123.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "BH",
          "Pseudo": "MAHMOOD ABDULHADI",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T22:49:48.000Z",
          "Titre": "Worst website",
          "Contenu": "I will never found worst website than this, I paid more than 240$ and still my page are bot clear, they send me a link it was working just few days then after 4 days it's stopped 👎🏻👎🏻"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jessica",
          "Nb_Reviews": 4,
          "Date": "2023-11-26T13:54:46.000Z",
          "Titre": "DO NOT USE THIS WEBSITE",
          "Contenu": "DO NOT USE THIS WEBSITE! Site123 has been a colossal waste of money. They billed my credit card after I had cancelled my auto-renew. This is a practice a lot of dodgy providers use and is called “negative option marketing”. They agreed to a partial refund after I made a dispute on PayPal. After the dispute was closed they did not issue a refund and ceased contact. I have had to reopen the dispute. Shameful and unethical practice. There are so many more affordable, easy to use and ethical website creators. Save your time and your money and don’t use SITE123."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Beatrice",
          "Nb_Reviews": 3,
          "Date": "2023-11-11T14:21:16.000Z",
          "Titre": "My site suddenly became unavailable !",
          "Contenu": "My site suddenly became unavailable !! no warning no explanation. It was a free package so it should not disappear. The assistance told me it was blocked but couldn't say why. They gave me a support email to contact that never replied despite multiple reminders. DON'T TRUST to put your business on this website. You could lose everything without notice."
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Andrew Emery",
          "Nb_Reviews": 1,
          "Date": "2023-11-08T21:04:42.000Z",
          "Titre": "Terrible accounting",
          "Contenu": "Terrible accounting. Even after you cancel auto-renewal and close your account, they will debit your credit card years later. I finally had to report them for Credit Card Fraud."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jessica",
          "Nb_Reviews": 4,
          "Date": "2023-10-25T17:52:39.000Z",
          "Titre": "Dodgy Policies",
          "Contenu": "SITE123 is not transparent in their auto-renew policy. They have it set to auto-renew in the settings when you join, so when it rolls around to renewing, they don’t ask permission and take the funds from your account. In my opinion this is dodgy and is how they make their money as they refuse to refund you. Honestly I would say spend your money elsewhere, their services are hardly worth the money you pay. There are plenty of user friendly affordable website platforms out there that are better than site123."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Shubham Agrawal",
          "Nb_Reviews": 3,
          "Date": "2023-11-18T09:41:01.000Z",
          "Titre": "Worst experience",
          "Contenu": "Cancellation of subscription is really very phatiatic and heactic. They do not even have a prover costumer support to whom you can talk properly."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Vlada",
          "Nb_Reviews": 3,
          "Date": "2023-10-02T15:50:29.000Z",
          "Titre": "AVOID",
          "Contenu": "AVOID! Asked to refund full payment as purchased subscription by mistake! They keep offering 3 months plans, but completely ignoring my emails and requests for refund! There are better website providers, please avoid if you don't want to loose your money!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Mr Easton",
          "Nb_Reviews": 4,
          "Date": "2023-09-15T23:26:35.000Z",
          "Titre": "Still no solution and no web site - 9 weeks +",
          "Contenu": "Still no solution and no web site. Cannot even get hold of Thomas \"Support Manager\" who promised to deal with this personally. Such a poor service, cant get someone to talk to, keep having to email or use chat. Having to re-explain the issue each time and being asked to follow the same process that clearly hasn't worked for 9 weeks!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mhudd Cans",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T17:18:54.000Z",
          "Titre": "Opened a website on here and the domain…",
          "Contenu": "Opened a website on here and the domain got taken down bc I never received a verification email. Told me it would take up to 48 hours and it was out of their hands. Here it is 3 days later and still no email and no website after I paid for it. No one will talk to me on the phone either and only want to use chat box. Getting ready to go to wix or foursquare"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Linda",
          "Nb_Reviews": 2,
          "Date": "2023-10-08T12:05:05.000Z",
          "Titre": "ROBBERS ROBBERS THEIVES!",
          "Contenu": "ROBBERS ROBBERS THEIVES!I was going to change my website to a different plan when it was time  to renew. I knew it was on auto renew but thought it was OK beause my credit card was expired and I had not updated the expiry date with them. They updated it themselves & took out my fee without telling me. When I saw the payment taken out this way I contacted them. It was still before the renewal date and I asked them to cancel my website & refund me. They refused"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Connor",
          "Nb_Reviews": 5,
          "Date": "2023-11-09T02:23:05.000Z",
          "Titre": "Actively encourages scam websites and…",
          "Contenu": "Actively encourages scam websites and phishing pages. Takes 3 days to shut down websites breaching our intellectual property rights and will not give the name of the website creator to take legal proceedings."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Jon",
          "Nb_Reviews": 1,
          "Date": "2023-09-28T07:01:17.000Z",
          "Titre": "I did not receive an email to verify my…",
          "Contenu": "I did not receive an email to verify my website and now it does not work. Not happyNo one I speak with can help resolve the issue of verifying my website. I cannot verify my website if I don't receive an email allowing me to do so. It has been over 24 hours since being in contact with support and have had no rectification."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "OS",
          "Nb_Reviews": 1,
          "Date": "2023-08-14T06:24:42.000Z",
          "Titre": "I chose to use the site based on a…",
          "Contenu": "I chose to use the site based on a friend's recommendation. I have not yet finished building the personal website. The process seems convenient. I purchased a package for two years but since than, for more than a week, I have not received the confirmation email for the free domain included in the program. Correspondence messenger service is indeed convenient but does has  not solved  the issue yet, I do not have a domain yet. I don't know if it's human service or bots, but you have to solve the issue for me to rate you excellent"
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Michael Conway",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T10:29:50.000Z",
          "Titre": "Very poor customer service",
          "Contenu": "Very poor customer service. horrible.  simple problem with correcting email address for domain registration that I paid for on site123 seems to have totally stumped your team.  I will be posting negative reviews to every social media and tech blog that I can find until you fix the scaffarossa.com domain registration error.  Thank you.... if you had negative stars I would have selected that."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "IR",
          "Nb_Reviews": 3,
          "Date": "2023-09-05T14:25:15.000Z",
          "Titre": "Unreliable with no quick resolution response",
          "Contenu": "The site was relatively easy to set up. However, after the first update the site disappeared. I contacted the help chat but they redirected me to their privacy team.I expected a quick reply as the site was down but, apparently, it takes 5 business days for a reply. Not good enough when you need the site.Am looking to set up with a different supplier."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gavin Baxter",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T14:33:14.000Z",
          "Titre": "Never use this company scam",
          "Contenu": "Never use this company. Cancelled in 14 days as they fraudulently advertised the product & they said would refund. 1 month later no contact & online agent just goes offline at the mention of money. Avoid scam avoid"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Hep",
          "Nb_Reviews": 4,
          "Date": "2022-12-06T03:51:24.000Z",
          "Titre": "Your created works are locked to their servers.",
          "Contenu": "Our website builder can be used on the company's servers only and it's not possible to *export* your website.Rough but not explicit translation: your *website* can only be used on the company's servers.So not fit for purpose. Deceptive. I can understand the builder being hosted but people own the products they create.  If I cannot export a static site it is pretty much useless to me.  It has one job, it does not do it."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "CARL VANN",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T13:16:56.000Z",
          "Titre": "Once told my domain name",
          "Contenu": "Once told my domain name, it has been smooth sailing, the process 2 create my own website, was much easier than expected!!!Support was top shelf& helped 2 resolve my issue with efficient speed & due diligence!!!Top shelf organization!!! Proud 2 be working with you as I build my company, CAV SECURITY LLC!!!, step by step!!!Dogged Determination will make CAV SECURITY LLC, one of the premier companies in NY!!!Prayers 4 All 2 Overcome This Pandemic!!!Prayers 4 All Generations!!!No worries!!!"
        },
        {
          "Note": 1,
          "Lieu": "AE",
          "Pseudo": "Mukotopso",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T14:06:29.000Z",
          "Titre": "Can you please put a plugin or create…",
          "Contenu": "Can you please put a plugin or create us where we can upload a Google Adsense Ads.txt file ( not a Adsense code the plugin is ready there on your system but where to upload the Adsense Ads.txt file is not there and Google Adsense needs it ) please guys your platform is so nice to use but thats the only problem stopping us"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Leora Marshall",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T02:15:51.000Z",
          "Titre": "I have asked for a refund when they…",
          "Contenu": "I have asked for a refund when they charged me $156 when it was supposed to only be $12. I have emailed and been trying to call daily because as they mentioned if you want a refund contact them within 14 days of signing up and I've been trying to contact them since the very next day. I wouldn't recommend. Very poor customer service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lee Edmond",
          "Nb_Reviews": 4,
          "Date": "2023-08-01T01:59:44.000Z",
          "Titre": "Site123.com practices are sleazy and unethical",
          "Contenu": "Site123 apparently has \"auto-renew\" set as a default and when you sign up with them, they do not disclose this.  We received an unexpected charge in the amount of $536 on our credit card.  Site123 has no published phone number or email address to communicate with them.  One must use a chat function.  They will then send a link to their billing department.  When we contacted them, we were informed that the \"auto-renew\" was disclosed in the small print in the \"user agreement\" that no one ever reads. Nor did they send us any warning that we would be billed again.  We notified within 24 hours of the charge on our credit card that  we didn't wish to auto-renew and requested a full refund.  We had to wait 4 business days before we received their response that their policy was \"no refunds.\" DO NOT DO BUSINESS WITH THIS UNETHICAL COMPANY."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Drew Cunningham",
          "Nb_Reviews": 6,
          "Date": "2023-04-16T11:18:43.000Z",
          "Titre": "Great websites, very dodgy company",
          "Contenu": "The website building tools and features are very impressive. Overall the product works really well.However, they have shady ways of dealing with payments and auto renewals. Keep close watch on your account for double charging, they charged the website renewal price twice to my credit credit card (nothing to do with the domain charges which are charged at a different time). They even have an option for \"I have been doubled charged\" in their billing complaints list to choose from, so this seems like a regular incident. Very sketchy"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Jon Easton",
          "Nb_Reviews": 1,
          "Date": "2023-08-29T11:23:09.000Z",
          "Titre": "Really poor service….7 weeks and they…",
          "Contenu": "Really poor service….7 weeks and they still can't transfer my domain!!!It is a great shame web builder was easy to use but SITE123 clearly havn’t got a clue how to manage the transfer of a Domain. I have spoken to countless people to resolve this and none of them are able to.  Unable to escalate this as there is no-one to speak to so keep going around in circles for over 7 weeks.The best advice the technical department could give me was to try a different domain name!!!Very disappointed!!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Isabel Eccles",
          "Nb_Reviews": 1,
          "Date": "2023-09-27T12:48:04.000Z",
          "Titre": "My website was removed and I was asked to pay!",
          "Contenu": "My website was removed without any form of warning, this has caused me to lose work for my university degree! I contacted support where the issue was initially resolved until I was told that the \"filter system\" had deleted the page once again. I was then told by support that my only options were to \"upgrade\" aka pay so that my page wouldn't be picked up by the filter system or recreate the page entirely. The \"deleted sites\" on my page are from trying to recreate my origional blog with duplicate pages and from scratch as the chat help on the website builder sugested, however all of these have been removed by the \"filter system\" aswell, this caused me to delete the duplicate pages as they had already been removed. I have sent an email to the suggested address already but will be sending another. Unacceptable and scammy service DO NOT USE!"
        },
        {
          "Note": 1,
          "Lieu": "TR",
          "Pseudo": "İman Badi",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T14:46:37.000Z",
          "Titre": "Bad services",
          "Contenu": "You don’t answer my e-mailThere are no solutions and no response to customersI sent you an email and no responseBad services"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Joana",
          "Nb_Reviews": 2,
          "Date": "2023-07-25T12:05:58.000Z",
          "Titre": "Price shown on cart is calculated incorrectly",
          "Contenu": "METAFORM expert account:The price shown on cart is calculated incorrectly! In a way that take losses for the costumer (seller) on every combined order, and this problem was reported for the first time 7 months ago!! You do nothing to solve it!!!!!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "joe",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T22:49:57.000Z",
          "Titre": "SEE THIS BEFORE JOINING",
          "Contenu": "NEVER AGREE TO THE RENEW OPTION. DO NOT LET THEM HAVE YOUR BANK INFORMATION. We tried to change plans to the cheaper option prior to the renew date (we have the screen shot), and despite our attempts in advising SITE123 billing department, our bank account was charged with the more expensive plan to top this an invoice was produced prior to the renew date indicated on their site. We gave SITE123 half a day to sort this up and come with a solution with zero results. make no mistake We offered to pay for cheaper plan in full, yet we been billed for another plan (more expensive) at the very same time.We feel cheated, we feel the newcomer payment setup is a trap offering a big discount so you will opt for the more expensive plan and then push renew and forget about it (WE DIDNT). Sadly, since we asked for answers and gave a grace time to sort it up (should have been easy) our Emails were ignored. Now it's up to you, as for us, our screen shots and relevant emails are going to be sheard with authorities, action is going to be taken by us, stay safe online and maybe learn from our experience."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandra Worthing Alves",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T01:58:13.000Z",
          "Titre": "Scam",
          "Contenu": "I was looking forward to trying this solution but they said it was $20 a month but it’s $250.56 for a year they swiped the full amount. I tried to call they are overseas and use WhatsApp for customer service  piggybacking off Facebook. Unavailability on weekends. I asked for a refund I don’t expect that will occur. The chat screen gets in the way of everything including the wallet area. Scam"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Adrienne Strickland",
          "Nb_Reviews": 2,
          "Date": "2023-09-18T17:27:35.000Z",
          "Titre": "Disappointed",
          "Contenu": "I requested a refund for my renewal and was only given a partial refund. If I did not use the service at all for the billed term which was the upcoming 12 months, I should have received a full refund. This is not right. I will not use this site in the future."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "eden mekonnen",
          "Nb_Reviews": 1,
          "Date": "2023-07-14T07:00:37.000Z",
          "Titre": "It has been 4 days since I Completed…",
          "Contenu": "It has been 4 days since I Completed Domain Transfer Request Form. It says I will be contacted within 1-3 business days but no one has reach out to me. I think I made a mistake signing up. Very disappointing"
        },
        {
          "Note": 1,
          "Lieu": "AR",
          "Pseudo": "Bruno",
          "Nb_Reviews": 1,
          "Date": "2023-06-27T19:58:26.000Z",
          "Titre": "Support team replies fast but solves nothing",
          "Contenu": "Absolutely disappointed with the support team. I cannot publish my website because there's a still unresolved bug that shows my Home page dark and opaque instead of just displaying the logo with the original colors that I uploaded. They keep saying that they are trying to solve this bug asap but so far there are no real solutions. Meanwhile, I'm being commercially damaged for not being able to publish the website properly and receiving pressure from my colleagues. Site123 support team replies fast, but solves nothing. So far, according to my experience, I strongly recommend people to find another website builder."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Anette",
          "Nb_Reviews": 5,
          "Date": "2023-05-21T11:28:38.000Z",
          "Titre": "STAY CLEAR FROM THIS SITE",
          "Contenu": "Its now May 10th. I have reported an issue in february and it is still not fixed. Even if i have been in contact with them several several several times.Its now been almost 4months without any help. And my company is loosing money like water because of them. STAY CLEAR FROM THIS SITE."
        },
        {
          "Note": 1,
          "Lieu": "BR",
          "Pseudo": "Yuri Werneck",
          "Nb_Reviews": 1,
          "Date": "2023-04-23T19:00:17.000Z",
          "Titre": "Dissatisfied",
          "Contenu": "I have been trying to contact you to solve a problem with my website. But i keep receiving the same answer, which doesn't help me at all. My website is already paid and I can't access it. It has been more than one week talking to the staff to see what the problem is but nothing changes....thay always suggest the same inefficient procedures."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scott K",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T19:13:22.000Z",
          "Titre": "They claim to be sending emails to…",
          "Contenu": "They claim to be sending emails to verify my domain, as 2 of my sites are suspended. I've \"chat\" with 5 different agents who give me all conflicting information. I don't think they're really doing what they say they're doing. I don't receive the emails. and I've reached out to the domain registrar and I get the same response from them. NOTHINGTerrible, scam and a waste of time."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ken Badoian",
          "Nb_Reviews": 3,
          "Date": "2023-02-03T02:08:36.000Z",
          "Titre": "Good the Bad and the Uguly",
          "Contenu": "Had a domain name and site up by 123.  Somehow authentication for the site got lost, so I could not integrate my Paypal into my site.I made many phone calls and went back and forth - Bottom line, people attempting to help me could not because the technical support people did not send authorization. I searched high and low in my email and span - no messages. Twenty-four hours turned into many days. Finally, in frustration told them to forget it. Now have had a site up with a slightly revised domain name. One hour authenticated and online. Nice helpers, extremely poor technical support staff. Also found out I could not take my domain name with me. They lock it in. PPA - Pretty Poor Attitude. It cannot raise problems to a higher level; only technical support can solve them."
        },
        {
          "Note": 1,
          "Lieu": "NZ",
          "Pseudo": "Anonymous",
          "Nb_Reviews": 1,
          "Date": "2023-03-22T03:20:01.000Z",
          "Titre": "Great team, but can not resolve time critical issues",
          "Contenu": "Lack of clarity about how long it will take to resolve an issue - lack of resolution is having a huge impact on my business. Bug in system means latest saved version not published correctly (defaulting to Site 123 template page)I like the Site 123 templates, so I tried to shift domain name to SITE 123 only to find they do not support the domain name - lack of clarity about this when this is time critical project is very disappointing. It has left me feeling that as they have billed me,  there is now little incentive for this issue to be resolved?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Stephen Cooke",
          "Nb_Reviews": 2,
          "Date": "2022-12-18T22:10:39.000Z",
          "Titre": "Removal of Websites - v.poor customer service",
          "Contenu": "I did run an abuse awareness website named beabuseaware and site123 removed it without notice and has not replied to my emails. I am an abuse survivor and author. Reaching out to others and providing free information (including providing my books for free to people who ask) about coercive and controlling behavior is very important. I can only assume as they are ignoring me and there chat just says email here is due to asking for 'donations' to help me provide this service they don't like it. I would not recommend site 123 for this reason. I did find there site building software easy to use and very good, but that is no us if they delete all your hard work."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Charlotte",
          "Nb_Reviews": 3,
          "Date": "2023-05-24T15:11:23.000Z",
          "Titre": "Worst website building company ever",
          "Contenu": "Worst company there is closed down my website for apparently selling illegal items. Everything we sell is organic and not illegal.The treatment from the company has been the worst I have ever came across wait days and days on replies no request to have this escalate to their senior manger was ever done.They have taken out money and not provided the service that’s expected and even the rest for a full refund has been ignored and not one email to their billing time has been replied to for weeks. I want a full refund and compensation for the fact I have now had to pay for a whole new website with another provider who are absolutely amazing, helpful and trustworthy not like this company"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Roger Mueller",
          "Nb_Reviews": 2,
          "Date": "2023-04-16T19:30:08.000Z",
          "Titre": "HELP-PLEASE!",
          "Contenu": "I communicate on a chat window. Any and everything I try, the widow closes, and the tech Im working with thinks Ive abandoned them without saying anything. Im retired and definitely not tech savvy. Im not a moron but I need someone-ANYONE-to walk me through the set up on the phone. I type one fingered dont know/understand the all terms. This needs to be simple as I have to update stock as soon as it sells or is added."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "anonymous",
          "Nb_Reviews": 4,
          "Date": "2023-05-10T20:46:43.000Z",
          "Titre": "Free plan is only a ruse",
          "Contenu": "Stay away from this company, their free plan is a rip off. It was supposed to have 1GB bandwidth but my site only has 250MB, which will only allow it to be seen around 300 times a month, which is too little. The customer service are quite useless and after lots of prodding all they say is \"if you need more buy upgrade to a paid plan\". Therefore, the free plan is only a ruse to get you to build the site with them, thinking it's going to meet your needs, and once you've built the site, reduce the free service to a minimum to force you to pay! Scam"
        },
        {
          "Note": 1,
          "Lieu": "MA",
          "Pseudo": "FabLab As'Souna",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T10:53:46.000Z",
          "Titre": "solution responsiveness availability action",
          "Contenu": "My site is not functional online. I contacted you on 02-02-2023 and 02-04-2023. you replied to me at the end of the conversation that you will contact the domain team to message me for domain validation. more than 48 hours have passed and still my site is not operational and your team has not reacted.Please do what is urgently needed."
        },
        {
          "Note": 1,
          "Lieu": "TZ",
          "Pseudo": "SODIMEX AFRICA LOGISTICS",
          "Nb_Reviews": 1,
          "Date": "2023-05-25T16:58:57.000Z",
          "Titre": "I have been asking for the reason why…",
          "Contenu": "I have been asking for the reason why my site is suspended since February still now, any person from your team have give me the response. I missed two essential contracts due to the suspension of my website."
        },
        {
          "Note": 1,
          "Lieu": "PR",
          "Pseudo": "Cine Nuestro Puerto Rico",
          "Nb_Reviews": 1,
          "Date": "2023-07-20T23:01:24.000Z",
          "Titre": "No customer support by phone",
          "Contenu": "No customer support by phone. Don't have access to administer the two domain names that I registered with my web hosting subscription.I have dozens of support chats and no solution to this problem.Not recommended."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "John Fothergill",
          "Nb_Reviews": 16,
          "Date": "2023-07-14T21:21:34.000Z",
          "Titre": "Bunch of lies.",
          "Contenu": "Bunch of lies.I had a website with this business for over a year. My website had a concrete calculator on it working fine then went down. I contacted support and asked why my concrete calculator was not working and was told if I up grade it would work again. I stressed that the concrete calculator was imperative it should be working on my website before I up grade. Don't worry they said, it will work once up grade. Since then I contacted support only to be given lots of links, find the HTML with no support what so ever. Daily I would express I need this calculator working only to be given link after link after link. Still I have the text email sent to me stating my Concrete calculator would work after up grade. And if below you post text please contact support, what gonna change? I done this already 50 times and still have not resolve the issue."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter King",
          "Nb_Reviews": 3,
          "Date": "2023-05-16T12:36:25.000Z",
          "Titre": "AVOID!",
          "Contenu": "After having been with SITE123 for a couple of years they notified me that renewal was required this May.I settled up for another year. But a couple of weeks later I have found that they have taken my site offline.I complained. They had not reinstated it nearly 18 hours later, so I have fired them. They don't act quickly if they have made a mistake, and they don't appear to care much. I gave my business card with my website address to a potential customer last weekend. My non-existent website must make me look like a total dweeb. Not acceptable for a business. My advice? AVOID!"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Ashutosh",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T05:59:55.000Z",
          "Titre": "My site is still down (More than 24…",
          "Contenu": "My site is still down (More than 24 hours) and issue is still not resolved while i am writing this review. SITE123 must handle \"Site down\" issue as priority 1 issue rather than ask customer to wait for 24 hours."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Garry Swift",
          "Nb_Reviews": 6,
          "Date": "2023-08-10T22:09:53.000Z",
          "Titre": "After the 14 day money back had expired…",
          "Contenu": "After the 14 day money back had expired site123 suspended my domian name blocking my site all this on a 2 years fully paid up planDont trust site123 once they have your money they dont care"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sandy McDonald",
          "Nb_Reviews": 1,
          "Date": "2023-08-30T16:46:35.000Z",
          "Titre": "Can you leave less than 1 star?????",
          "Contenu": "Can you leave less than 1 star?????A glitch happened overnight. All of my pages were renamed and links were broken. It caused days of rework that could not be remedied. I could not get the appropriate support from Site 123. It could not be rolled back to a stable version. Money wasted. I bought a two-year plan and am asking for a refund after 3 months. I have upset advertising customers and will lose money on this engagement due to lack of support from this website (in what appears to be a glitch on their side). Just not good business. Cannot get a live person on the phone AT ALL for any reason. Also cannot speak to a supervisor, but you can send an email, which will not help me right now. So, for anyone considering Site 123, I'd reconsider. I will be asking for a full refund on all of my websites with this company as this is not my first issue with this platform. This particular issue is a show stopper and my website had to be decommissioned."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Dion Ambrogio",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T22:13:41.000Z",
          "Titre": "Hilton called me to do my company web…",
          "Contenu": "Hilton called me to do my company web site for 99 dollars...turned out to be 500dollars...so after the lies I cancelled from a Rip off deal from 123website..DONT TRY THIS RIP OFF DEAL....SINCERELY DION AMBROGIO"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Thomas j KRITON",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T19:37:37.000Z",
          "Titre": "Well",
          "Contenu": "Well, before I purchased 2 year contract, I was told that I can get assistance all the way through the process of completing my web page, Very disappointed that was informed afterwards that the assistance I can get , was referred to instructions, That was it,"
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Anette",
          "Nb_Reviews": 5,
          "Date": "2023-04-25T17:59:59.000Z",
          "Titre": "Probably a scamsite",
          "Contenu": "Probably a scamsite I have now waited for 2 months for my issue to be resolved and are loosing money as water by using site123. Nobody gives me any answers or know anything about when this small issue is resolved. They just give me a \"bot answer\".Stay away from this site if you dont want to throw money out the window."
        },
        {
          "Note": 1,
          "Lieu": "NO",
          "Pseudo": "Anette",
          "Nb_Reviews": 5,
          "Date": "2023-03-30T16:11:45.000Z",
          "Titre": "I think the site is just a scam.",
          "Contenu": "I think the site is just a scam.I have waited 6 weeks to get my issue fixed and all answers i get from custumors service is like a chatbot is answering. They claim to have their site in my language, but despite several severe spellingmistakes in my language they dont fix it. They informed me that i can not edit the translation errors my self but they have to do it for me.I have waited 6 weeks, and they dont even give me a estimate to when the problem will be fixed. I am loosing money daily because i cant sell from my store before its fixed. They havent resolved a easy-fix problem that suddenly showed up in my shoppingcart either. So i still think the site is just a scam."
        },
        {
          "Note": 1,
          "Lieu": "KR",
          "Pseudo": "글로벌마케팅코칭연구원 Chol Lee",
          "Nb_Reviews": 1,
          "Date": "2023-06-04T03:58:06.000Z",
          "Titre": "Hi requesting to solve the problem",
          "Contenu": "Hi. I opened gmci2050.com through Site123 and paid full price for using one year. But I could not have entered my website since last week. Please check about what is wrong with my  website domain and solve the problem. I requested to solve it through chat adviser several times but it has not solved. Please activate my website domain gmci.com as soon as possible.  Thanks for your help in advance."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Victoria Seiden",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T19:10:36.000Z",
          "Titre": "Due to the default autopay setting I…",
          "Contenu": "Due to the default autopay setting I got charged $540 for the site I did NOT use. I was not aware of the automated renewal, never got a warning email, nothing. When I tried to get a refund I was told it was not refundable. DISHONEST company and a RIP OFF."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Adi K",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T20:26:41.000Z",
          "Titre": "Want to be lied and loose business then read on.",
          "Contenu": "I have been waiting 3 working weeks for my website to be active on their server.I have been on their virtual chat nearly every day.They never update you on the status.My website has gone it looks so unprofessional.I have lost business, also all my e-mails have gone.I was told 5 days time it would take to transfer over to themselves, nothing but lies have been given to me by them and they don't care.Some of my other colleagues reported the same problem with site123.comTheir chat says get back to you in under two minutes, that does not work either. Been waiting 15 minutes before getting a response.They told me the old provider hasn't switched over to themselves, when the who is registry search showed it had.Avoid loosing business go to another provider."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "G-Support",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T12:53:24.000Z",
          "Titre": "worst service ever",
          "Contenu": "im contacting the support team since 3 months to fix the bugs in my website , however till now they said we are working on it come on guys 3 moths just to fixing the seo advisor so for what im paying higher package ??i was writing before other review and the manager of the support team replays that send ,e email to (info at site123.com)i have sent to him but no replay till now its just the worst to choose this plat form to advertise your companythey will just take the money and leave you just waiting !!!!"
        },
        {
          "Note": 1,
          "Lieu": "LB",
          "Pseudo": "Julius Ceasar",
          "Nb_Reviews": 1,
          "Date": "2023-05-29T23:23:20.000Z",
          "Titre": "waiting verification email for more…",
          "Contenu": "waiting verification email for more than a month.. bad service as if purchasing your website package and domain was a perfect scam. thanks hackers"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Trending TECH",
          "Nb_Reviews": 1,
          "Date": "2023-07-23T20:16:17.000Z",
          "Titre": "disgusting",
          "Contenu": "disgusting, after spending hours try to create new website and a blog the website 1- kicked me out 2- removed my website 3- and i am unable to login again to my account its like i was not there for 14 hours !!!!"
        },
        {
          "Note": 1,
          "Lieu": "PT",
          "Pseudo": "Joana",
          "Nb_Reviews": 2,
          "Date": "2023-06-16T13:32:56.000Z",
          "Titre": "BAD SUPPORT on costumer service!",
          "Contenu": "METAFORM expert account:The calculation of shipments is done incorrectly and this problem was reported 6 months ago!! You do nothing to solve it!!!!!Enhancement requests - 3 years later and continue to be ignored!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "glenn newell",
          "Nb_Reviews": 1,
          "Date": "2023-04-05T22:43:26.000Z",
          "Titre": "Site123 is quick to take your money",
          "Contenu": "Site123 is quick to take your money, but they move at glacier speed when your website is down. I have had nothing but problems with my website,  and their customer service is horrible."
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "Denis",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T09:13:37.000Z",
          "Titre": "I bought the package 3 days ago, still didn't got the free domain they promised",
          "Contenu": "I Bought the Basic Package 3 days ago, And still didn't start to work with him, because the \"Free Domain\" I got is not yet approved.how many days should i wait to get what I was promised for my money?"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Gavin Baxter",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T14:35:13.000Z",
          "Titre": "Scam alert",
          "Contenu": "Scam alert. Never use this company cancelled in 14 days no refund given and making it impossible to get. Avoid"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Christopher Kennerly",
          "Nb_Reviews": 1,
          "Date": "2023-05-31T11:43:48.000Z",
          "Titre": "Follow up with members",
          "Contenu": "Follow up with members.  My website has been down for 2 weeks.  Many messages to get back online and so far nothing, no email but your ads.  No resolution."
        },
        {
          "Note": 1,
          "Lieu": "IN",
          "Pseudo": "Keyur Shah",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T06:01:33.000Z",
          "Titre": "No Support",
          "Contenu": "No SupportI purchase domain and tried to publish site, I have contacted but they are just giving me date by date for mail and confirmation. No support by team.Really disappointed"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Toby",
          "Nb_Reviews": 2,
          "Date": "2023-05-18T05:48:43.000Z",
          "Titre": "Ok with critical flaws",
          "Contenu": "Honestly they're ok, I was a bit naïve jumping in and now stuck there financially.Pros easy to build a site.Find the site you can build is rather limited.The course builder is non usable - absolutely critical weakness that people have to log in to use it, but if they buy your course they don't receive an email explaining how to do this, and logging in is really really not intuitive. Compared to say Podia where I also host websites this is a huge huge weakness.Biggest downer is that I've had an issue with my mailing list (emails not sending) and they won't actually look at it on an individual basis - I was told if it's affecting other people they'll fix it, otherwise it's at the back of the list for them.Pretty disappointing when you pay them a lot of money and now I don't have a mailing list for my company!UPDATE:I emailed the company as they suggested below - 'ifno' is (hilariously) a typo which can't accept emails, so I also emailed 'info@' instead which did work. (They have since updated their comment to correct their typo)They haven't responded to my email - I have downgraded my review therefore to one star because this is more of the terrible service that I've been experiencing.Update.I can confirm that after this update they have responded now."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Vincent",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T12:36:49.000Z",
          "Titre": "Conversion journey way to pushy",
          "Contenu": "Conversion journey way to pushy, doesnt show what you can or can’t do. I get there’s a great team working there, but the way its been marketed is painfull"
        },
        {
          "Note": 1,
          "Lieu": "QA",
          "Pseudo": "Ahmed",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T19:24:53.000Z",
          "Titre": "You offered 40% discount and while…",
          "Contenu": "You offered 40% discount and while testing features and getting approval to chooae the plan, you canceles the promotion. So we had to look for another site builder"
        },
        {
          "Note": 1,
          "Lieu": "MD",
          "Pseudo": "SRL DorDeSushi",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T11:29:50.000Z",
          "Titre": "I had a good but bad experience at the…",
          "Contenu": "I had a good but bad experience at the same time after I paid I couldn't find the right tools I want to withdraw my money and it takes a long time!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Robert Bowman",
          "Nb_Reviews": 1,
          "Date": "2023-05-10T03:07:57.000Z",
          "Titre": "Been a numer of days now and I still…",
          "Contenu": "Been a numer of days now and I still have not heard from anyone. I cannot get onto my website.  Thinking of canceling and taking my business elsewhere."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Isaiah ab",
          "Nb_Reviews": 1,
          "Date": "2023-06-09T04:51:49.000Z",
          "Titre": "These guys I was asking for help on why…",
          "Contenu": "These guys I was asking for help on why my pictures don't show up (Lucas) sends me a link that has ALL of my location info. My city, state, IP, street everything. When I ask him, he says I am not older than 18. After that he stops talking. All I wanted help was just why my Pictures don't show up."
        },
        {
          "Note": 1,
          "Lieu": "ZA",
          "Pseudo": "Dewald van den Heever",
          "Nb_Reviews": 1,
          "Date": "2023-05-30T18:17:56.000Z",
          "Titre": "Limited product service",
          "Contenu": "I need to Import over 4000 products onto the site but due to the system layout it is not possible nor can they provide me with assistance and we need to manually introduce 4000 products."
        },
        {
          "Note": 1,
          "Lieu": "JO",
          "Pseudo": "Isam Al Hassan",
          "Nb_Reviews": 3,
          "Date": "2023-04-03T17:12:50.000Z",
          "Titre": "i have waited for about 20 mints and it…",
          "Contenu": "i have waited for about 20 mints and it was written ( in 2 mints) , you 2 mints is too long , also i kept my question but no one answered my question in email."
        },
        {
          "Note": 1,
          "Lieu": "FR",
          "Pseudo": "Doflo",
          "Nb_Reviews": 9,
          "Date": "2023-10-31T07:34:05.000Z",
          "Titre": "I paid for an advanced plan for 2…",
          "Contenu": "I paid for an advanced plan for 2 years, my site is still with the features of the free plan and has not been updated technically, therefore does not offer the technical possibilities to really create a site… I am totally dissatisfied with the service!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "DB",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T00:29:29.000Z",
          "Titre": "If could give a negative 5 stars I…",
          "Contenu": "If could give a negative 5 stars I would. This company is a fraud and scam.They will take your money and swear they are working to fix the problem and wont. Then there is a 14 days limit on getting your money, and on the 16th day your site will crash and they don't care ...crooks....seriously stay away from this site."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Education and Nonprofit Soluti",
          "Nb_Reviews": 1,
          "Date": "2023-05-24T23:47:05.000Z",
          "Titre": "Can't Access Website or Email",
          "Contenu": "I paid SITE123 to use a template and to host a website for my nonprofit organization. Now I can't access the website and my email isn't working."
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "saka oluwasola",
          "Nb_Reviews": 1,
          "Date": "2023-03-25T11:02:56.000Z",
          "Titre": "Front end developer",
          "Contenu": "A word of encouragement during a failure is worth more than a whole book of praise after a success. on what truly matters."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Cheryl H.",
          "Nb_Reviews": 5,
          "Date": "2023-12-02T07:21:41.000Z",
          "Titre": "Constant issues, losing sales",
          "Contenu": "EDIT, EDIT: it's now the 2nd of December! Still not fixed. I keep complaining and keep getting, 'we're working on it.EDIT:It's now the 12th of November and I am still waiting for the issue to be fixed. They contacted me and did nothing except tell me the issue is still being looked at. Meanwhile I am unable to send out bulk emails. Each time I complain I am told to be patient it's in the queue. I am paying for a service that I don't get.I am constantly having issues with SITE123. I have been with them for 5 years and have thousands of products. I would like to change to a different platform but there is no way to download my products and details to create a new website so I am stuck with them. Currently I can send out any bulk emails on my email list because it's not working. It has not worked since March 2023. I have complained multiple times and am given the run around. A customer trying to create an order has just contacted me and I am getting the run around again. My website can currently be viewed on some platforms (MAC, iPad, Samsung phone) but when I try to view it on my iPhone or my customer tried on her tablet or phone it won't load. This is not the first time this has happened. I have lost so many sales because of SITE123"
        },
        {
          "Note": 1,
          "Lieu": "EG",
          "Pseudo": "Yousef Othman Elrahman",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T21:36:42.000Z",
          "Titre": "i purchased the domain",
          "Contenu": "i purchased the domain, and it went down after one week. i contacted customer serves, but they did not provide me with any solution"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "James Sicilian",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T17:09:27.000Z",
          "Titre": "my domain isn't what I want",
          "Contenu": "the free domain coupon I thought was for an additional domain, I named it after  my S corp and now it is the URL for my drone business.  Really disaapointed"
        },
        {
          "Note": 1,
          "Lieu": "SA",
          "Pseudo": "Alya Banafa",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T22:41:03.000Z",
          "Titre": "My website is not working and I’m still…",
          "Contenu": "My website is not working and I’m still waiting for the verification link email and didn’t receive it yet also I was not able to add visa payment"
        },
        {
          "Note": 1,
          "Lieu": "JM",
          "Pseudo": "Carlton",
          "Nb_Reviews": 3,
          "Date": "2023-05-18T05:11:12.000Z",
          "Titre": "Once you need customer service just change company",
          "Contenu": "If getting help as a new customer is this hard I feel sorry for their customers. The customer service feels So slow and care free towards customer satisfaction honestly that will stand out more than anything , you can test for your self and I do advise it because anything can go wrong and your business pause for days with this attitude. I was given a discount of 40% to upgrade professional or Gold . I picked professional package to use which was 40% of $16 a month original price without discount, which totol came to 108, so the time was passed I never say time was up. I reach out same day and person say can give me 10% discount but wait the original price went from $16 to $26 for professional. So now I got jacked up price with discount of joke if I never screen shot it time I saw it I would think I'm crazy. I send to them they need write someone so I delete account and use back a referred link but now account is blocked because they save you information , I was told 24-72 hours but time well passed they still have my email stored though I deleted account and not getting response from anyone. Customer support send me to write someone else that never replies lol . The bad start shows me what bad terrible customer service they have no joke. It's terrible they really slow and don't care. I even check reviews just before I write this and it's like once you have a problem that need support you are done for just go to a different company. 😅"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nadine K. T",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T05:54:05.000Z",
          "Titre": "The site froze up when I was trying to…",
          "Contenu": "The site froze up when I was trying to pay and when getting off the billing trying to pay another way I was charged 5X.Email for domain went to spam unlike all the rest of the email.sfrustrated with trying to buy.My first free site was deleted."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jovi",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T01:55:22.000Z",
          "Titre": "My website went wrong a month ago",
          "Contenu": "My website went wrong a month ago. I complained. brillunion. It still can't be visited. So what do you thing my experience is?"
        },
        {
          "Note": 1,
          "Lieu": "NL",
          "Pseudo": "Be Positive",
          "Nb_Reviews": 1,
          "Date": "2023-05-03T16:53:18.000Z",
          "Titre": "They never update and develop their…",
          "Contenu": "They never update and develop their platformlimited features compares to other website buildersHard to work with their gadgets and widgets"
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "Bassam",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T19:06:23.000Z",
          "Titre": "i have other account and that account…",
          "Contenu": "i have other account and that account have bugs with SEO Advisor i have contacted the support team via chat and now im waiting since 3 months and still not fixed every time they say we will fix it soon but this soon now its 3 months also they have bugs with the HTLM codes its not working even i contacted the support about is many time they just say we will open a ticket for you and 3 months no one is help to fix it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "MC",
          "Nb_Reviews": 1,
          "Date": "2023-09-22T23:52:44.000Z",
          "Titre": "You took my website down and will not…",
          "Contenu": "You took my website down and will not give me an explanation why."
        },
        {
          "Note": 1,
          "Lieu": "DE",
          "Pseudo": "Andreas Haizmann",
          "Nb_Reviews": 1,
          "Date": "2023-03-23T17:09:34.000Z",
          "Titre": "They don't fix bugs",
          "Contenu": "They don't fix bugs, but rather ask the customer to choose another website structure where the bug doesn't occur."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "szymon",
          "Nb_Reviews": 4,
          "Date": "2023-03-20T22:03:10.000Z",
          "Titre": "I do not recommend this company",
          "Contenu": "I do not recommend this company, they took money without my consent and do not want to return it and this is theft, embarrassing behaviorWaldemar Szymczak"
        },
        {
          "Note": 1,
          "Lieu": "IL",
          "Pseudo": "ProgrammerISR",
          "Nb_Reviews": 1,
          "Date": "2023-09-08T10:58:53.000Z",
          "Titre": "Very bad customer support",
          "Contenu": "Very bad customer support, a lot of urgent bugs without fast fixes."
        },
        {
          "Note": 1,
          "Lieu": "PL",
          "Pseudo": "G-Support",
          "Nb_Reviews": 2,
          "Date": "2022-11-17T21:12:07.000Z",
          "Titre": "if i can give 0 star i would give it…",
          "Contenu": "if i can give 0 star i would give it unfortunately i have to give them 1 star Worst site i have ever try it the only benefit that its cheapother things they do have too many bugs and they are not helpful i have contacted the support regarding some bugs since 3 moths in the SEO Advisor (its showing its scanning please wait) 3 months im waiting and the support team are not saying more than that we open for you ticket and it will be solved soon but till now nothing solved 3 months i just lost my time with trying to let them fix the bugs and any results"
        },
        {
          "Note": 1,
          "Lieu": "NG",
          "Pseudo": "victor robinson",
          "Nb_Reviews": 2,
          "Date": "2023-07-26T13:05:08.000Z",
          "Titre": "I tried several times to pay for a…",
          "Contenu": "I tried several times to pay for a subscription by it failed all the times I tried.Even with different card, yet failed"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Carole Herwig",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T06:52:33.000Z",
          "Titre": "I just had a hard time finding stuff…",
          "Contenu": "I just had a hard time finding stuff and according to another person my pictures are stretched and pixelated"
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Clinton",
          "Nb_Reviews": 2,
          "Date": "2023-01-30T15:40:51.000Z",
          "Titre": "Im still waiting for an email regarding…not happy",
          "Contenu": "Im still waiting for an email regarding domain verification , im going to go further with this, this site has course me issues from the start know its costing me money everyday its not working"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Sauntee Saulise",
          "Nb_Reviews": 4,
          "Date": "2023-05-05T18:40:21.000Z",
          "Titre": "Don't do business with SITE 123",
          "Contenu": "I had to change my review once again because dealing with Benjamin the technical support online, I am finding they do not know how to assist with technical issues in transferring of a web domain nor are they interested in keeping customers with SITE123. After speaking with Thomas for the past week, I thought I had my issue of domain transfer resolved. However, I still cannot pull up my website through Site123 like I thought. I noticed my webpage did not pull up online. Therefore, I reached out to my old provider to ensure they deactivated my domain. In doing so, they instructed me that SITE 123 needs to reset the DNS so that my website could go live with their web platform. However, Benjamin explained that it was live and could be seen online and that there was nothing SITE 123 needed to do. I explained I would have to get a return of my money since my site was not going live. He chatted that the email address and gave me the number to call to deactivate my account. Therefore, SITE 123 will be losing business today because the online chat team does not know how to assist. You can only reach SITE123 technical team via online chat. This is a terrible way to do business when it comes to IT support. Although the sites platform is easy to set up, you get no technical support from this company because everything is done online. You never get a live voice and if the person you are working with is not available you will get a terrible representative like Benjamin that cannot assist, is very rude, and does not have interest in promptly assisting customers. At the end of the day, this situation has caused me to lose business because I cannot get my domain transferred. Very upset!"
        },
        {
          "Note": 1,
          "Lieu": "KE",
          "Pseudo": "Kevin Kirika Irungu",
          "Nb_Reviews": 1,
          "Date": "2023-05-16T11:31:41.000Z",
          "Titre": "My site is offline yet I've paid for…",
          "Contenu": "My site is offline yet I've paid for domain. I'm told it's a SITE123 server issue. Hope you'll give me back the days lost of business"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Helen James",
          "Nb_Reviews": 1,
          "Date": "2023-01-27T20:37:24.000Z",
          "Titre": "i paid 120 rs as annual supcribtion and…",
          "Contenu": "i paid 120 rs as annual supcribtion and my domain for website was lost i had a great money lost on it"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Zakiyyah Zareef",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T20:24:13.000Z",
          "Titre": "I had to purchase a domain name",
          "Contenu": "I had to purchase a domain name.  This site is not free. Once I paid I still can't get the domain name to show my material once I send it to other people."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "AJ T",
          "Nb_Reviews": 1,
          "Date": "2022-12-14T16:08:52.000Z",
          "Titre": "Fraudsters - illegal charges",
          "Contenu": "UPDATE: Site123 in its response tries to look reasonable and accommodating but they only took action when I cancelled my account and threatened to file complaints with relevant authorities and regulators. Further, the refund was issued via PayPal after I contacted them and filed a complaint regarding the charges. The refund was from PayPal, not Site123. My opinion of Site123 remains unchanged. Anyone looking for a website builder would do well to look elsewhere. There are plenty of options. Do your homework. ORIGINAL POST - This site is based in Israel and do not follow the laws of US or Canada and take advantage of their location with respect to unauthorized charges. My account was auto charged despite my advising Site123 that I did not wish to Rene and despite my account settings have their “auto-renew” option set to “disabled”. They charged my card anyway then refuse to refund the money. I now have to try to get the credit card co/paypal to reverse charges. Avoid this service. They are a scam and will take your money."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Jill Kalakay",
          "Nb_Reviews": 1,
          "Date": "2022-11-17T14:15:29.000Z",
          "Titre": "I don’t like the site because I can’t…",
          "Contenu": "I don’t like the site because I can’t get the support that I need and I don’t seem to have the functions available that I need to make the website desired. I would like to cancel my account."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Johnnie McAninch",
          "Nb_Reviews": 1,
          "Date": "2023-07-17T01:17:14.000Z",
          "Titre": "Not good",
          "Contenu": "Not good.  Bad communication. Paid for website and you all shut it down.   Like my money back."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Oliver Lassalle",
          "Nb_Reviews": 12,
          "Date": "2023-11-08T17:33:01.000Z",
          "Titre": "Not free as initially announced on the…",
          "Contenu": "Not free as initially announced on the search! I didn't go far as I didn't wanted to lose more time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "TJ",
          "Nb_Reviews": 2,
          "Date": "2023-10-29T06:34:04.000Z",
          "Titre": "VERY difficult to build a web site…",
          "Contenu": "VERY difficult to build a web site compared to their sites.  Also the complete lack of ability to change fonts or font size makes your site VERY inferior to others."
        },
        {
          "Note": 2,
          "Lieu": "IN",
          "Pseudo": "Bhanu Pratap Singh Kushwaha",
          "Nb_Reviews": 1,
          "Date": "2023-06-26T16:34:17.000Z",
          "Titre": "Payment Gateway Failure and Lackadaisical approach of SITE123",
          "Contenu": "all payments and purchases on our website have come to a standstill because 'Stripe' the payment gateways changes its API applicable for India. Inspite of having discussed the same on the help chat with SITE123 its been over 48 hours and no action has been taken to resolve the issue. it shows 2 things about SITE123, 1. It is not aligned with the Gateway providers that it is sponsoring and 2 its technical team is not competent or serious enough the make the necessary amendments on the site to resolve such Urgent issues."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Daniel Lundquist",
          "Nb_Reviews": 4,
          "Date": "2023-05-02T22:56:37.000Z",
          "Titre": "Site123 step up people",
          "Contenu": "Site123, you are very, very unprofessional and act like you don't care about anyone.People would have a change of heart if you supply customers a way to talk to a real person that is capable of helping your customers. And get ride of that bot chat bull!Having a chat is nice but to have a Is Botchat is ridiculous And reflex bad on your company. Get a real person with a real phone number that customers can call for issues is number one."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "verb-o",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T13:21:19.000Z",
          "Titre": "Help provided after a week",
          "Contenu": "after page was blocked from going live for a week due to lack of assistance, problem was finally solved. Beware of what you enter as registry data - cannot be corrected/altered. Finally was allowed to \"migrate\" a site to a different domain (eg from .eu to .com), but only after writing neg feedback. ;o"
        },
        {
          "Note": 2,
          "Lieu": "GR",
          "Pseudo": "ΜΙΧΑΛΗΣ ΛΥΜΠΕΡΑΚΟΣ",
          "Nb_Reviews": 1,
          "Date": "2023-05-04T17:48:13.000Z",
          "Titre": "I am not a merchant so i don't want to…",
          "Contenu": "I am not a merchant so i don't want to sell anything. I just want a gallery to show my job in art photography but it's impossible because 1) I don't like exist the frame at the end of site with name, telephone e.tc. I need to exist only my email nothing else 2) A black bar with logos (facebook, twiter etc) is covering important part of photos. I asked you if can i remove it and the answer was this is possible if only i choose to pay the \"gold\" 24 euros per month to do the elementary thing."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "worker",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T17:44:53.000Z",
          "Titre": "123 site portrays everything free",
          "Contenu": "123 site portrays everything free, until you build your page, then comes the upgrades. you cannot transfer your domain name unless you upgrade to a bigger plan, the first 2 is not good enough, and there prices is not competitive. very pricey."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jonathan Chadwick",
          "Nb_Reviews": 9,
          "Date": "2023-02-23T13:45:47.000Z",
          "Titre": "Avoid if you have an existing domain…",
          "Contenu": "Eventually managed to get my site up and running but took 2 days of trying to sort out. May work well if you are starting from scratch and use their own domain. I already had a domain and the problems arose from getting that domain to point to the site I created at site 123, they did it for me but that stopped my email from working properly. My advice would be to avoid if you have an existing domain."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Debbie Mey",
          "Nb_Reviews": 1,
          "Date": "2023-07-24T08:27:26.000Z",
          "Titre": "My Website is not working",
          "Contenu": "My Website is not working. I was promised an email to verify my website.  I have committed to a three year subscription. Please assist me, as I am loosing business"
        },
        {
          "Note": 2,
          "Lieu": "BG",
          "Pseudo": "Tom Deschamps",
          "Nb_Reviews": 1,
          "Date": "2023-04-04T17:20:24.000Z",
          "Titre": "Packages",
          "Contenu": "Is good to explain to your customer what is exactly the package. I wanted to start with the basic one.. but after paid everything and the domain, I see that I have to take the professional package for having card paiement in my website. And without this is useless. I didn't appreciate that."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Oliver",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T16:45:41.000Z",
          "Titre": "Not recommended",
          "Contenu": "Unfortunately not recommended. Support reacts quickly, but can't do anything. Functions only limited and partly very complicated. The simplest functions, which are standard elsewhere, are completely missing. Not to be used for professional needs"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dennis Hupp",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T19:51:44.000Z",
          "Titre": "Horrible Customer Support...",
          "Contenu": "My website was/is UnitedStatesHistory.US. This was to be an e-commerce site to sell mostly history books. I liked the software until I found a logic flaw. In charging a sales tax, I discovered that the tax didn't show up as a detail line along with the cost of each book and shipping, so the calculated total did not include the tax. Then, on the payment page, the charged amount included the tax. Surprise!!!! I reported this problem and was assigned a trouble ticket number LPvsg2wm. On follow-up inquiries to see where my issue stood, I was told that my issue was thrown in with all other projects and developments. I couldn't get a commitment as to how long it would take. I suggested two days, two weeks, two months, two years. They had no idea. There seemed to be a much stronger effort to develop new templates and support getting new business than to support the business they already had. I gave up and requested a refund.Supplemental Review:I would like to buy back in, but you still haven't addressed the issue of leaving customers hanging and wondering if their issue will ever be addressed. Communicate, communicate, communicate. When you address this communication issue positively, I'll change my 2 stars to 5 stars and my review title to \"Great Company with Super Customer Support.\""
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Adrian Beckham",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T20:22:10.000Z",
          "Titre": "3 days since I paid and still not got…",
          "Contenu": "3 days since I paid and still not got an operating website"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Miriam Kappmeier",
          "Nb_Reviews": 2,
          "Date": "2022-11-23T20:46:05.000Z",
          "Titre": "Good for Standard websites",
          "Contenu": "First steps are quite easy but once you want to further customise and personalise your sites its not really possible sometimes...Also havent seen the possibility to see the ource code to adjust some setting there.Kind customer support though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "W. Michael Hewitt",
          "Nb_Reviews": 1,
          "Date": "2023-02-28T18:36:41.000Z",
          "Titre": "It seems to be taking a very long time…",
          "Contenu": "It seems to be taking a very long time to move my domain from Siteground to SITE123. I'm eager to get my site up and running yet I sit here waiting for you to complete the transfer."
        },
        {
          "Note": 2,
          "Lieu": "KW",
          "Pseudo": "Alexander Mathews",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T13:02:16.000Z",
          "Titre": "Verify my site",
          "Contenu": "I liked how easy it was to make my site but I couldn’t get it verified and I asked for a link and waited a week for the email to send. And I got nothing. And then I asked about it again on Thursday and the person told me they would look into it and he never got back to me."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "محمد",
          "Nb_Reviews": 1,
          "Date": "2023-06-25T07:23:21.000Z",
          "Titre": "No information about the need for more…",
          "Contenu": "No information about the need for more storage for the my website and no more than 100GB for my business."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "Brian  Vangsgaard",
          "Nb_Reviews": 3,
          "Date": "2023-03-22T07:42:46.000Z",
          "Titre": "I have Bern waiting 2 weekend for…",
          "Contenu": "I have Bern waiting 2 weekend for verify My account , Calling and chat but no luck still waiting"
        },
        {
          "Note": 2,
          "Lieu": "EG",
          "Pseudo": "Hussain Rizk",
          "Nb_Reviews": 1,
          "Date": "2023-05-11T22:05:05.000Z",
          "Titre": "Your editor is glitchy and I’ve raised…",
          "Contenu": "Your editor is glitchy and I’ve raised a ticket that is yet to be fixed after 2 days."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Lauren",
          "Nb_Reviews": 11,
          "Date": "2023-01-20T00:32:17.000Z",
          "Titre": "Support is frustrating",
          "Contenu": "Support is frustrating. Only chat. No one to actually talk to. Sometimes have to wait ages for response."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "sebastian dimitriu",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T14:07:58.000Z",
          "Titre": "I've used it only for a couple of days.",
          "Contenu": "I've used it only for a couple of days.The Positive: great support, if you get the right person. Easy to use, that's why i signed up for a paid option with them.The negative: it's not meant to be a landing page builder. it's just a 1 page website. yes you can create more than 1 websites to act like landing pages, but you need to upgrade each of them individually, which SUCKS. This is why i quit working with them.I think it's a great product, with lots of potential, but it's stuck. they should really add a paid version  at the account level, meant for people who want to build landing pages."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Doru-Ioan Tordai",
          "Nb_Reviews": 7,
          "Date": "2022-09-18T01:49:53.000Z",
          "Titre": "Look elsewhere if you need a professional website",
          "Contenu": "Overall a decent experience, but there are a few bugs that are really annoying.Most of the templates can’t be fully customised, is hard to add buttons and sub-menus, and there’s a difference between what you see on the PC when you choose mobile view and the actual mobile viewFor the amount of money they charge there are better options than site123"
        },
        {
          "Note": 2,
          "Lieu": "JM",
          "Pseudo": "Casanne Bartley",
          "Nb_Reviews": 1,
          "Date": "2022-10-01T01:17:44.000Z",
          "Titre": "I gave a two for customer service",
          "Contenu": "I gave a two as the customer service was good. I was shut down after publishing my site, with no explanation. I am still awaiting a response as to why my site was shut down. In summary I wasted my time and effort to create a website with this company."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "SORIN NICOLAS",
          "Nb_Reviews": 1,
          "Date": "2023-01-30T03:34:09.000Z",
          "Titre": "Construction nicolas ltd",
          "Contenu": "we have experience in construction for over 10-15 years"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kelly",
          "Nb_Reviews": 1,
          "Date": "2021-12-06T22:46:21.000Z",
          "Titre": "Auto-Renew by Default",
          "Contenu": "Site123 was easy to use and I enjoyed the process of making my website. BUT ... be careful, they make your subscription as AUTO-RENEWAL by default. So regardless if you are using your website or not, they will bill you. You will receive no prior notification that your subscription is about to renew. You MUST go in and deselect auto-renewal. They do not give refunds."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Audrey Thomas",
          "Nb_Reviews": 1,
          "Date": "2021-09-26T02:36:50.000Z",
          "Titre": "Your sells rep lies to people to get…",
          "Contenu": "Your sells rep lies to people to get them to sign up. Your support team is worthless. All they know how to do is send you links to outdated material, and play mind games with people. You templates are beautiful and easy to set-up, but they are none functional b/c you have minimum tools and plugins. Your prices are great, but a waste of money if you can't have a functional Website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Terry Rust",
          "Nb_Reviews": 1,
          "Date": "2021-10-17T17:22:49.000Z",
          "Titre": "I cannot get my site to come up on the…",
          "Contenu": "I cannot get my site to come up on the web. I have had trouble every since you all started. It would come up for a few days last week, but this week nothing. I was told you all were one of the best. But I cannot see how this can be with all the trouble I am having. I have contacted help many times. I wish i could get my money refunded since I have nothing to show for it.....All in all I am not satisfied with Site 123s performance. I want my money refunded."
        },
        {
          "Note": 2,
          "Lieu": "PT",
          "Pseudo": "Katija Nóvoa",
          "Nb_Reviews": 3,
          "Date": "2021-06-22T10:37:38.000Z",
          "Titre": "Before the renewal of the annuity",
          "Contenu": "Before the renewal of the annuity, which was disabled, I took care to ask a member of the 123site team the actual values, who informed me of the steps to follow to verify the values. (You can confirm with your platform the conversations established, and which I recorded).They debited, without my consent, an amount I didn't know, and without prior warning. I don't agree with this way of working."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "merlyn seay",
          "Nb_Reviews": 1,
          "Date": "2021-08-14T05:14:40.000Z",
          "Titre": "I have had this website for over 2…",
          "Contenu": "I have had this website for over 2 years I'm have selling my items in different places. But I have not sell anything on step 1 2 3 in the past 2 + years. I have been using Google apps Facebook app and my email list is still not growing. I haven' I have sold more on other websites. I'm having a hard time keeping my website"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Matilda Powell",
          "Nb_Reviews": 2,
          "Date": "2021-10-03T17:56:14.000Z",
          "Titre": "It takes too long to get customer help…",
          "Contenu": "It takes too long to get customer help and I ordered my business card on the 23rd of September and I still have not received them and today is October 3rd I received a message saying that they were left outside the door but they're not there so I need my money back or I need a replacement."
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Miss Sophie Harris",
          "Nb_Reviews": 1,
          "Date": "2021-07-19T11:02:51.000Z",
          "Titre": "Can do better",
          "Contenu": "Site is very user friendly, however it's the kind of site you use when your starting out then move onto more tailored services.  Used it for 2 years - was only prompted to this service again due to an automatic payment being able to go through on my expired card.  Overall not terrible but not great either."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Aghyad AlSherfawi",
          "Nb_Reviews": 13,
          "Date": "2021-11-18T07:48:41.000Z",
          "Titre": "Site123 has more prons than its cons..",
          "Contenu": "Site 123 has more problems than its cons.Many bugs were reported for the last 4 years, and they never worked on it or ever report me with updates as they always say at the conversation. And now this auto-renewal silly thieving game....And like every year, they always make new offers to get new clients to the business, but they never respect the loyal client and give them the attention they should have for staying at Site123.TBH, I never was satisfied with Site123, yes it is easy and handy, but nothing more than these two. And once I find another platform, I will make my move."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Ultimate Purchasing",
          "Nb_Reviews": 1,
          "Date": "2021-02-02T16:33:41.000Z",
          "Titre": "Do not use for e-commerce",
          "Contenu": "Overall support is ok, but if you have any technical issues with your e-commerce store you will be waiting a LONG time for a fix.I have an e-commerce store that you can purchase on but each time you purchase an error message appears. This leaves the customer not knowing if the order has been successful or not.I have been waiting quite a while now and I am in the queue with no idea when the problem will be fixed.Ok for simple sites, go elsewhere for e-commerce.....poor."
        },
        {
          "Note": 2,
          "Lieu": "AT",
          "Pseudo": "Beate",
          "Nb_Reviews": 4,
          "Date": "2021-08-17T11:19:55.000Z",
          "Titre": "Multi language package doesnt’t work well",
          "Contenu": "We paid for the multi language package which didn’t work at all. It might be great for one language only but otherwise it is just too much work and impossible for my client to keep it up to date. Whenever I changed something on the main language homepage the other languages were changed to the main language and everything needed to be translated manually again, which took up many hours. Customer support told me that there wasn’t a fix for that problem. Over a year later I decided that It was easier to program my own homepage and maintain it myself."
        },
        {
          "Note": 2,
          "Lieu": "BG",
          "Pseudo": "Maya Shtereva",
          "Nb_Reviews": 2,
          "Date": "2020-07-16T12:19:31.000Z",
          "Titre": "More negatives that positives",
          "Contenu": "*Very few fonts*Not available enough font size - there is not possible to change the font size IN different pages*Not possible to have just numbers in the price lists - you have to have currency and not possible to remove it*Not enough possible ways to improve my different pages and to add some personal touchFor now the only reason to choose 123site is that is available in bi-language mode"
        },
        {
          "Note": 2,
          "Lieu": "GH",
          "Pseudo": "health and fitness",
          "Nb_Reviews": 2,
          "Date": "2020-03-09T09:25:28.000Z",
          "Titre": "Your system malfunctions sometimes…",
          "Contenu": "Your system malfunctions sometimes which is not something good for customers. Please next time make awareness of customer reason for payment and your domain prices are so high. And also try to make listed of available domains instead of wasting someone's time by select dot whatever and you find out that its not available after that you must list out the available ones.not doing that its annoying. Extremely"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Oleksandr Mitskevych",
          "Nb_Reviews": 3,
          "Date": "2020-01-20T10:48:07.000Z",
          "Titre": "It kinda works as a last minute choice, but not much thereafter.",
          "Contenu": "Can't be downloaded.Servers are not quite up for the job, others load much faster.Page can't be downloaded.Although if you do and read through what their generator added in there.. You'd be shaking your head a lot.Some components wich are loaded in are straight up outdated.A lot of the end result (site) are loaded in with JS, wich is very much noticable on older devices - or phones."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Snapz Photographic Services",
          "Nb_Reviews": 1,
          "Date": "2020-07-22T09:48:25.000Z",
          "Titre": "Beware",
          "Contenu": "Beware, you are not told that for your website to be activated you need to purchase an upgrade your account, I was told that buying my own domain was enough to get me started, but no, I wasted £20 on a two year domain name, then once I built the website (features are brilliant in the editor) I was asked for stupid amount of yearly money to have it go live. So be prepared to pay a lot for your website.I quit, I will not pay that sort of money and I will not be conned."
        },
        {
          "Note": 2,
          "Lieu": "AE",
          "Pseudo": "Gehad Abdel Nasser",
          "Nb_Reviews": 1,
          "Date": "2020-07-07T00:23:00.000Z",
          "Titre": "I gave 2 stars for 2 reasons",
          "Contenu": "I gave 2 stars for 2 reasons 1st I asked the customer service for a problem I had over a month and no response to it  ,Also I asked them a different thing and still no email even reply me back for solving my problem ,2nd thing I believe they need a quick update to the platform for more ready made templates and menu bars shapes"
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "Yulia",
          "Nb_Reviews": 1,
          "Date": "2020-02-10T17:46:44.000Z",
          "Titre": "I received a message to renew 2 days…",
          "Contenu": "I received a message to renew 2 days prior to the end and requested to know why you want to charge me double from last year (991 nis instead of 551 nis I paid for first year)did not receive an answerthis is a business card site - do not do anything with it - so dont see any reason to pay so much money and no answer for my question...sorry"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Sofi Johansson",
          "Nb_Reviews": 9,
          "Date": "2020-05-21T13:46:36.000Z",
          "Titre": "I like the simplicity of the layout and…",
          "Contenu": "I like the simplicity of the layout and the possibilities, but too many functions randomly don’t work and you never get the help you need. The support people answer quickly and politely but they, at least in my case, cannot give any help or solutions that work. Had I known this from the beginning I wouldn’t have payed to join."
        },
        {
          "Note": 2,
          "Lieu": "MA",
          "Pseudo": "Daoui Zack",
          "Nb_Reviews": 2,
          "Date": "2021-06-21T10:23:35.000Z",
          "Titre": "UNTIL NOW THE TEAM DOESNOT RESOLVE MY 2…",
          "Contenu": "UNTIL NOW THE TEAM DOESNOT RESOLVE MY 2 PROBLEMES I PAY FOR 2 COMPLET PACK WITH FREE ADRESS DOMAIN AND I HAVE ONLY ONE DOMAINE FREE?????I WANT TO UPGRADE MY WORK AND PUT WEB SITE ONLINE  WHEN I INTEGRATE THE FREE DOMAIN ARTPALETTE.NET I LOSE ALL MY WORK CREATE"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "mjh pacha",
          "Nb_Reviews": 4,
          "Date": "2019-06-12T08:57:07.000Z",
          "Titre": "I give only 2 stars and I find it a…",
          "Contenu": "I give only 2 stars and I find it a shame because the interface is easy to use and the tools quiet great... when it's working! I first had an issue with a translating tool, by 2 times it erased fully my work. 6 months later Iam still waiting for a proper update about this bug that the CS promised me... whatever today I want to update my website, and the interface on site123 is gone, I just cannot do any work on it. Iam tired of losing my time with them."
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Thierry Chambert",
          "Nb_Reviews": 1,
          "Date": "2020-05-18T13:16:45.000Z",
          "Titre": "Too slow. And I get a lot of junk messages.",
          "Contenu": "Building the web pages is slow and cumbersome. It makes it very inefficient to build and updates pages regularly. Every time I try to modify a page, it burns a lot of my time. Very annoying. It looks like SITE123 does not have enough allocated bandwidth. Also, SITE123 does not have an anti-robot filter on the contact pages, so I receive a lot of junk messages thru the contact form of my website.Overall, not a great experience for building my website. I will not sign up for more once my contract expires."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Fidem",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T16:39:55.000Z",
          "Titre": "1- give possibility of adding the same…",
          "Contenu": "1- give possibility of adding the same pages unlimited to the web page.2- Cashing and payment handling is clear with a lot of binding charges. It is recommended to improve on transparency even with services.3- improve on step by step tutorial to all services.4- Your tool are not intuitive."
        },
        {
          "Note": 2,
          "Lieu": "JP",
          "Pseudo": "Oren",
          "Nb_Reviews": 1,
          "Date": "2020-07-27T15:12:01.000Z",
          "Titre": "Not the best features!",
          "Contenu": "The system is easy to use but and its a big BUT they are really not updateding or advance in there feature. There is stuff that are so easy to fix or add and they don't do that. I think that if they change thire approach they can be number one in this field (more then Wix) to bad.."
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "Dmytro Babeshko",
          "Nb_Reviews": 1,
          "Date": "2021-05-25T20:25:19.000Z",
          "Titre": "Because of slow sevice I had pay extra…",
          "Contenu": "Because of slow sevice I had pay extra 22.82$ to start my domain (with my domain included packege). Was waiting a week before my problem wasn`t solwed and I had to act very fast because of registration new patients. Was no other way but to pay onece more."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Riet Strijker",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T14:27:16.000Z",
          "Titre": "your pop-ups with questions could be…",
          "Contenu": "your pop-ups with questions could be nice for some people, but I found it to be too intrusive. It would be okay if you could follow it up with a real chat. Furthermore- the interaction in the chats takes too long, so if you have a question about something, it takes too long to get an answer."
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "فيصل الجربوع",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T15:05:40.000Z",
          "Titre": "I need my money back the customer…",
          "Contenu": "I need my money back the customer service isn’t good enough, until now they didn’t solve my issue with the service, they can’t understand what i need?! U can review their replies to me out of the subject i want, so i need to cancel my subscription service, that’s enough for me.Thanks"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "ndy",
          "Nb_Reviews": 7,
          "Date": "2020-09-07T19:08:59.000Z",
          "Titre": "Great price and easy to build",
          "Contenu": "Great price and easy to build. The customer service is atrocious and really has put me off. CUSTOMER SERVICE WANTED MY GO DADDY LOG ON AND PASSWORD to obtain my domain name. No contact phone number anywhere. Shocking. I had a complaint and dodnt get anywhere so emailed the ceo."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Adrienne Morgan",
          "Nb_Reviews": 1,
          "Date": "2020-01-27T17:34:55.000Z",
          "Titre": "I have tried to get help several times…",
          "Contenu": "I have tried to get help several times and haven’t been fully helped. The last time I was seeking the email settings (IMAP, SMTP) so I could use my Site123 email on my iPhone. I was given a generic list of settings. They did not work so now I have to contact support again. Very frustrating."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Christopher B",
          "Nb_Reviews": 1,
          "Date": "2019-08-26T12:33:02.000Z",
          "Titre": "Disappointed",
          "Contenu": "I really like the layout and process to build the site but my phone will not work with the program. My phone is a newer LG as well. With that I'm going to have to give it 2 stars. I spent a lot of money to have to have 2 web browser to make a store ad or add or manipulate pictures in my gallery."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Sandra Dumais",
          "Nb_Reviews": 1,
          "Date": "2020-04-08T17:38:13.000Z",
          "Titre": "Good to start Bad later",
          "Contenu": "A year ago I got the professional builder website as my first experience in building a website. I found that easy to start and to get help. A year later, as I try to improve my website, I asked help and I still wait for that help, after asking them a few times what's happening with my requests. At that time, I had already just renew for 2 years with the same builder website. Although a 14 days refund policy is mentioned before renewing, I was told I could not receive it because I was not a new customer. Is that a honest customer service???"
        },
        {
          "Note": 2,
          "Lieu": "CO",
          "Pseudo": "Paola Spitz",
          "Nb_Reviews": 1,
          "Date": "2020-05-19T16:21:44.000Z",
          "Titre": "full age requesting",
          "Contenu": "I´ve sent an email requesting a solution to set up the request of full age to our visitors but after almost a month I have not received answer back. Please this is a very important step to drive leads, contacts and members to my website. I request assistance for this process."
        },
        {
          "Note": 2,
          "Lieu": "CA",
          "Pseudo": "Jessica Nobrega",
          "Nb_Reviews": 2,
          "Date": "2019-05-15T22:59:14.000Z",
          "Titre": "Looking for a refund",
          "Contenu": "This service is ideal for those with a very specific website need, but not for those interested in using it outside of the way it’s designed. I was under the impression that the template was compatible with my existing domain and Wordpress so we could easily add it to our already running site/email. It unfortunately wasn’t for us and I’ve been trying for over a month now to obtain a refund. I’m sure it’s a good fit for certain individuals and businesses but not  for me and all I want now is my money back as per their policy."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "andrew darlington",
          "Nb_Reviews": 3,
          "Date": "2020-09-13T10:02:27.000Z",
          "Titre": "I found the software to make the…",
          "Contenu": "I found the software to make the website not as easy to use as was advertised I think they’re adding other things to be able to add such as buttons, links, SEO etcI recently used another company called Blam and their website software was Childs play in comparison"
        },
        {
          "Note": 2,
          "Lieu": "NZ",
          "Pseudo": "Louise Penn",
          "Nb_Reviews": 1,
          "Date": "2023-06-29T03:12:45.000Z",
          "Titre": "Not flexible enough"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "William",
          "Nb_Reviews": 1,
          "Date": "2019-12-24T23:08:56.000Z",
          "Titre": "Unfortunately I didn't get the advice I…",
          "Contenu": "Unfortunately, I didn't get the advice I was asking forI was asking how to create a sub-category within a category. For example, I have \"Other Approaches\" as the main category and then I would like to have 3 or 4 sub-categories under this main category."
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Romke Visser",
          "Nb_Reviews": 6,
          "Date": "2020-07-07T13:22:39.000Z",
          "Titre": "Still not resolved",
          "Contenu": "Reaction time is perfect. I never had a quicker response. The bad news is that the problem is not resolved. So, if IT stays this wat, I have to find another platform/site to promote my pictures. And hopefully het back my money as I will not be using site123."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Abbas Universe",
          "Nb_Reviews": 2,
          "Date": "2021-11-11T13:39:12.000Z",
          "Titre": "Terrible Site",
          "Contenu": "This is ABBAS Site 123 removed my website even though I had a removed the domain LINK that sends you to there site and people can now the website was made by site 123 but they removed it after I deleted the link to the domain for ever not a great experience at all"
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "Dario",
          "Nb_Reviews": 12,
          "Date": "2020-04-30T12:00:58.000Z",
          "Titre": "not well optimised for mobile navigation",
          "Contenu": "The website is not well optimised for the smartphone navigation. I ask many times to fix this problem but nothing happened until now. If we consider that most of people use the smartphone to navigate on internet, this is a big bug. For the rest is ok."
        },
        {
          "Note": 2,
          "Lieu": "ES",
          "Pseudo": "María Snoussi Aroca",
          "Nb_Reviews": 1,
          "Date": "2020-07-29T14:16:17.000Z",
          "Titre": "It's not free, you finally have to pay. Really disapointed.",
          "Contenu": "They say you can build a free website. But it's not true. You can't find it in google (even if there are only ten results when you search its name), and you can't choose the domain number you want. I'm really desapointed with it."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "sengedoo",
          "Nb_Reviews": 1,
          "Date": "2020-08-19T14:48:11.000Z",
          "Titre": "High maintenance what you pay what you get!",
          "Contenu": "If you reading this review, might you are looking for e-commercial web provider. I suggest you that this web is one of your option not that ideal one. What you pay what you get principle apply in this web provider. Most important thing is to select suitable plan for your needs. First one moths free trail and used as experience it and second one not that much option. Instead order longer months but professional ones. The other plan is useless and there is no way to checkout as normal website is you select the down version plans. I have used it almost 3 months now. I didn't earn any cent what i built on the web but paid for this provider."
        },
        {
          "Note": 2,
          "Lieu": "EG",
          "Pseudo": "Mohamed Hassan Zaki",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T10:43:57.000Z",
          "Titre": "Shipping Methods & Inventory",
          "Contenu": "Inventory Stock Management didn't WorkShipping methodsEgypt is a one region only which had a negative effect on our sales as Egypt divided into 27 region and shipping fees are different from region to other"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jim Aikens",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T20:58:40.000Z",
          "Titre": "I needed to change the color of my…",
          "Contenu": "I needed to change the color of my writing on a portion of my homepage. From talking to the tech. I essentially found out it couldn't be done. I really wish you would add that feature. It doesn't seem that hard to do."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jessica Rasmussen Randall",
          "Nb_Reviews": 1,
          "Date": "2021-08-17T20:58:08.000Z",
          "Titre": "Here's my experience",
          "Contenu": "Here's my experience. I made a lovely website with site123. It was a good experience, and I agreed to keep the tacky banner because it was a free service. Now, I didn't know how many photos I'd be allowed to add to my portfolio, because numbers. So I just added them. A lot of them. I loved my website. Suddenly today, a long time later, I try to update my website and it won't allow it unless I pay for an upgrade. They tell me I'm way over, and they don't know why it would have allowed me to add so much content. Well, I have an idea. Because now that I have business cards printed and the website all made it's going to be a lot harder to change to another service. But they underestimate my stubbornness and my cheapness."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jill Lawrence",
          "Nb_Reviews": 32,
          "Date": "2020-09-10T13:20:21.000Z",
          "Titre": "Okay for “simple” sites",
          "Contenu": "Tried many site builders after being a long term user of the much missed Microsoft Front Page. Site123 Site Builder is very basic, with annoying glitches with no get around such as not being able to attach hyperlinks to photos, (despite the answer below) and very limited page layouts to name but two.Despite having 30yrs experience in designing web sites, I have constantly had to contact Customer Service, to solve the most basic of problems, many of which “it does not do”. If you know anything about Site Design or want something that doesn’t fit one of their limited choice of Templates, this will highly frustrate you. If you know nothing, it might be the best thing since sliced bread!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "christopher",
          "Nb_Reviews": 1,
          "Date": "2020-10-18T19:03:17.000Z",
          "Titre": "Customer service is unfocused and…",
          "Contenu": "Customer service is unfocused and understaffed.  They really should just direct each question to tutorials as the customer agents are jumping from one customer to the next and are largely unavailable for any thorough communication.  They would do better to allow voice to voice communication or to allow customers to schedule time with an agent so that a meaningful exchange may be established.  I have spent hours with their agents and more that half of the time spent has been highly unsatisfactory leaving my issues unresolved.  In looking for a website service for me it is imperative that customer service is more than the equivalent of texting back and forth for hours with overburdened agents."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "jimmy fann",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T18:52:39.000Z",
          "Titre": "you put your add up instead of my web…",
          "Contenu": "you put your add up instead of my web for 10 days saying to up grade and then u tell us how to fix site. works now but had to dispute credit charge was resolved but still not the way i like to do bussiness"
        },
        {
          "Note": 2,
          "Lieu": "DO",
          "Pseudo": "Julio Maldonado",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T12:44:56.000Z",
          "Titre": "The site is great my only issue is that…",
          "Contenu": "The site is great my only issue is that I did not get any kind of email or message before one of my sites was automatically renewed. I wish you could send a little message a some days before"
        },
        {
          "Note": 2,
          "Lieu": "SE",
          "Pseudo": "Oskar",
          "Nb_Reviews": 3,
          "Date": "2019-10-07T09:21:49.000Z",
          "Titre": "Many problems of different nature",
          "Contenu": "Not as flexible as it seemed. Was promised a functionality by customer support the turned up not working as promised. (Their customer service was otherwise very good and fast, this was perhaps a special lite diffcult case.) Long time though (soon one week) for refund handling, instead of a quick \"ok sorry for providing the wrong info, here's your money back\".Also unclear that the basic pay solution wasn't actually ad-free - I just paid for \"Remove SITE123 floating tag\", but the footer ad was not removed. To know about this, they thought I should have studied the more expensive plans (which are hidden from their first pricing page), which I was not interested in."
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Duck512",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T13:10:57.000Z",
          "Titre": "Bad tools",
          "Contenu": "Bad tools, not enough tools, features are premium that should be free and no custom domains like test.site123.com instead you get a domain like 829u292e19.site123.com which is so low compared to other tools"
        },
        {
          "Note": 2,
          "Lieu": "PR",
          "Pseudo": "rafy1",
          "Nb_Reviews": 2,
          "Date": "2020-07-06T12:49:12.000Z",
          "Titre": "My credit card was charge for the year…",
          "Contenu": "Dissapointed!!!My credit card was charge for the year and no monthly as advertised, myDashboard  is different and i cant set the payment method. The reply takes more than 10 minutes and sometimes much more"
        },
        {
          "Note": 2,
          "Lieu": "SA",
          "Pseudo": "صادق حسين الشيخ حسين",
          "Nb_Reviews": 2,
          "Date": "2020-08-03T14:12:16.000Z",
          "Titre": "You don’t have a payment with saudi…",
          "Contenu": "You don’t have a payment with saudi mada card Also you don’t have an auto receiving email for customers when they buy a code from me so that I asked to cancel my site and refounthe money.Thanks.."
        },
        {
          "Note": 2,
          "Lieu": "IE",
          "Pseudo": "Bani Programare",
          "Nb_Reviews": 1,
          "Date": "2020-11-11T10:55:29.000Z",
          "Titre": "Not a single prior notification until the automatically renewal",
          "Contenu": "Hey guys! As another fellow described below, I also found myself in the position where my money were automatically taken from my card, without any single prior notification that the subscription will automatically renew.I mean, you could have implemented a simple notification system that could have notified users when the renewal period would approach. Moreover, there are several other platforms on the Internet that  switch off the subscription if the user doesn't manually pay for the subscription to continue. And yes, 90 f***** dollars can mean something for someone that has lost his job due to this pandemic situation.I hope you will find this useful for the future and probably next time we will find ourselves switching seats.Tough luck!"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Sarah Scott Falk",
          "Nb_Reviews": 2,
          "Date": "2020-08-31T16:02:18.000Z",
          "Titre": "My domain name is now held captive by…unhappy",
          "Contenu": "My domain name is now held captive by Site123, they sent a renew your domain email before I knew the use of my site was increasing to almost 300 dollars. The first year offer was under 100 dollars."
        },
        {
          "Note": 2,
          "Lieu": "IL",
          "Pseudo": "sar",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T11:27:21.000Z",
          "Titre": "Lost money on ads because of spam…",
          "Contenu": "Lost money on ads because of spam emails on the contact page. Nothing the site builder could do about it Can’t add a WhatsApp button for call to action to get customers Looking for a different site"
        },
        {
          "Note": 2,
          "Lieu": "NL",
          "Pseudo": "Petra Buijse",
          "Nb_Reviews": 1,
          "Date": "2020-09-15T05:41:08.000Z",
          "Titre": "No posibility to choose Ideal as…",
          "Contenu": "No posibility to choose Ideal as payment method. So my website is useless. I paid for 3 years. And that's strange because Stripe, wich I chose for the payments have Ideal in their package."
        },
        {
          "Note": 2,
          "Lieu": "IT",
          "Pseudo": "keyvan",
          "Nb_Reviews": 1,
          "Date": "2020-04-27T13:23:46.000Z",
          "Titre": "I can't be bothered to write a review…",
          "Contenu": "I can't be bothered to write a review that can be understood by people who have not used this service before, I hope the site123's devs will read this however so here we go:The \"multi-page website\" system is basically unusable. You are not allowed to expand pages that are not the home page with other pages (because pages = modules?). Creating a pages category is pointless because everything nested in the category will appear in the menu.Adding more contact pages also works on the surface, in practice it's just dumb and useless. You can't add 2 contact locations in the same page because pages can't be expanded.This system only works exclusively for one-location, one-page websites with extremely minimal information.Hire somebody new pls."
        },
        {
          "Note": 2,
          "Lieu": "ZA",
          "Pseudo": "Nqobile",
          "Nb_Reviews": 1,
          "Date": "2020-02-17T13:22:01.000Z",
          "Titre": "Very limiting number of emails that can…",
          "Contenu": "Very limiting number of emails that can be sent in an hour,ends up very inconveniencing and  not serving the purpose for what the business is designed for to reach out its clientele in time."
        },
        {
          "Note": 2,
          "Lieu": "CL",
          "Pseudo": "Núcleo Teko Porã",
          "Nb_Reviews": 1,
          "Date": "2021-04-22T22:35:39.000Z",
          "Titre": "I can't get this website off the ground yet !",
          "Contenu": "I had to pay a lot of money and this website doesn't work at all. I'm very disappointed so far,  but i hope to have a better performance very soon. I will keep trying."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Customer",
          "Nb_Reviews": 2,
          "Date": "2020-09-07T17:19:45.000Z",
          "Titre": "I'm only staying because it is too…",
          "Contenu": "I'm only staying because it is too difficult to transfer all my posts to another host. The customer service may be quite fast but it is extremely conflicting from person to person resulting in incorrect information that the customer service representatives take zero accountability for. I've been lied to and then blamed for basically not being 'bright enough' to understand what was said. When I have the time I'll be changing providers not that site123 will care because they didn't care in the slightest when I said I was changing hosts and why. Clearly they don't really care about customer satisfaction as long as it is a fast turn around time and they get slightly high scores on the surveys after the conversation... even when the customer is still awaiting a response."
        },
        {
          "Note": 2,
          "Lieu": "DZ",
          "Pseudo": "Bilalghost",
          "Nb_Reviews": 1,
          "Date": "2020-06-23T23:34:29.000Z",
          "Titre": "Goof idea site123 but the only problem…",
          "Contenu": "Goof idea site123 but the only problem is not free thant's don't help you to post your servive i hope to site123 allow the users to put him service easly and for free.. Thanks"
        },
        {
          "Note": 2,
          "Lieu": "DE",
          "Pseudo": "Sebastian Burbach",
          "Nb_Reviews": 1,
          "Date": "2023-06-21T08:12:53.000Z",
          "Titre": "Good service but too expensive",
          "Contenu": "Good customer service, but too expensive"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ben D",
          "Nb_Reviews": 1,
          "Date": "2020-08-25T21:55:02.000Z",
          "Titre": "Shut down with no warning - 2 days overdue on expected autorenewal.",
          "Contenu": "So, I have been hosting with Site123 for a year. Today i was told that my site was down. I checked. It was.When i contacted Site123's support, they explained how to renew my subscription. My payment period had expired and they shut me off. No warning, no invoice, no grace period. 2 days overdue, and I'm toast!I had my account set for auto-renewal. But Nooooo!While I have previously recommended Site123, I am now rescinding that recommendation. Letting a business site shut down without warning, failing to recognize my autorenewal choice, and not bothering to let me know there was a problem are each unacceptable, and together, just unforgivable.I did get an email asking me to review the compnay. I will be doing that later today.STAY AWAY FROM SITE123. THEIR BAD BUSINESS PRACTICES CAN COST YOU MONEY!"
        },
        {
          "Note": 2,
          "Lieu": "AU",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2021-03-18T09:11:44.000Z",
          "Titre": "Unhappy that Site123 does not…",
          "Contenu": "Unhappy that Site123 does not accommodate facilities for Drop Shipping. The E-Commerce section is not appropriate for my needs and I will be cancelling my subscription."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Michael",
          "Nb_Reviews": 2,
          "Date": "2020-05-11T12:41:06.000Z",
          "Titre": "Photographic images are cut off at the…",
          "Contenu": "Photographic images are cut off at the bottom to allow for social media links. When requested to move the links or resize the images, I was told that it was not possible."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Calm me",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T22:34:58.000Z",
          "Titre": "I am truly a novice but I found this…",
          "Contenu": "I am truly a novice but I found this site pretty difficult to use.  I  still can't get my credit card acceptor to work!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jon",
          "Nb_Reviews": 16,
          "Date": "2020-06-03T18:29:47.000Z",
          "Titre": "Still waiting for resolution from a…",
          "Contenu": "Still waiting for resolution from a week ago. Not the sort of service I'm used to with Ionos 1&1. which are thehosting company I've ever dealt with."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Gene Corneau",
          "Nb_Reviews": 1,
          "Date": "2020-12-17T09:53:36.000Z",
          "Titre": "Love the site at first but it doesn't…",
          "Contenu": "Love the site at first but it doesn't make it into any search engines like wix its like the site is there but its silent. I had no hits in 2 years."
        },
        {
          "Note": 2,
          "Lieu": "UZ",
          "Pseudo": "Arius Star",
          "Nb_Reviews": 4,
          "Date": "2021-07-17T08:25:03.000Z",
          "Titre": "Customer service is really terrible",
          "Contenu": "Customer service is really terrible. They don't fix the issues in time. In fact, I have a issues that hasn't been fixed since December."
        },
        {
          "Note": 2,
          "Lieu": "PA",
          "Pseudo": "Joey Castro",
          "Nb_Reviews": 1,
          "Date": "2020-02-04T13:57:42.000Z",
          "Titre": "Support was good",
          "Contenu": "Support was good, website functionality is limited, I'm asking for my website EPP code through e mail and I've had no answer from you support team."
        },
        {
          "Note": 2,
          "Lieu": "ID",
          "Pseudo": "Reiki  les energies",
          "Nb_Reviews": 1,
          "Date": "2023-02-27T03:08:46.000Z",
          "Titre": "Referencement",
          "Contenu": "Referencement , not enough configuration access to improve position in google"
        },
        {
          "Note": 2,
          "Lieu": "PL",
          "Pseudo": "ARTBREATHSONE",
          "Nb_Reviews": 1,
          "Date": "2019-11-05T01:16:03.000Z",
          "Titre": "I cant attach the site with my YouTube…",
          "Contenu": "I cant attach the site with my YouTube page , Facebook page ,twitter and instogram , I can't share the link so that can track my followers habitats"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Emily Mehlman",
          "Nb_Reviews": 1,
          "Date": "2021-10-25T18:33:34.000Z",
          "Titre": "Cannot get the logo on the website to…",
          "Contenu": "Cannot get the logo on the website to show up in a reasonable size or position.  Should be easy to do and is not even possible."
        },
        {
          "Note": 2,
          "Lieu": "HK",
          "Pseudo": "Global SmartShoppers",
          "Nb_Reviews": 1,
          "Date": "2019-12-02T07:47:31.000Z",
          "Titre": "When export the report",
          "Contenu": "When export the report, cannot show the options' selection.  when choose active status for export the report, still can show the active items"
        },
        {
          "Note": 2,
          "Lieu": "FR",
          "Pseudo": "Philippe ANTONIO",
          "Nb_Reviews": 1,
          "Date": "2020-01-05T12:30:01.000Z",
          "Titre": "No french call center",
          "Contenu": "No french call centerNo infirmation about the protection name oh the siteWe are surprised to be obliged to buy and no free services. It a lie."
        },
        {
          "Note": 2,
          "Lieu": "EG",
          "Pseudo": "roviel",
          "Nb_Reviews": 1,
          "Date": "2021-11-15T16:27:50.000Z",
          "Titre": "The first thing is the site is in…",
          "Contenu": "The first thing is the site is in English and I want everything in the Arabic language + I want change my link website free"
        },
        {
          "Note": 2,
          "Lieu": "CZ",
          "Pseudo": "ZZ|",
          "Nb_Reviews": 1,
          "Date": "2020-05-27T06:24:44.000Z",
          "Titre": "Very long response times",
          "Contenu": "Very loooooong response times when having some issues on sites. Poor customers care quality. They are not informing you about your tickets."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Jax",
          "Nb_Reviews": 1,
          "Date": "2022-06-22T20:33:15.000Z",
          "Titre": "because you did not give over the phone…",
          "Contenu": "because you did not give over the phone help which is better and quicker. someone else helped me"
        },
        {
          "Note": 3,
          "Lieu": "NO",
          "Pseudo": "Finn Myrvang",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T12:18:48.000Z",
          "Titre": "Inform more detailed about the top line…",
          "Contenu": "Inform more detailed about the top line capacity (how many letters available) + about what is possible or not when re-arrangement of sides + sections are wanted. Much good to say - but the language in the Norw. vers. of site123 is a bit un-clear/confusing, and I MISS THE NEW NORW. VERSION! - At least inform much better about how to switch off spelling «help» in Google Chrome and other browsers."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "is tarar",
          "Nb_Reviews": 1,
          "Date": "2023-12-10T19:39:38.000Z",
          "Titre": "The process of creating the site is…",
          "Contenu": "The process of creating the site is very easy and simple. However, there are too many places where I can't modify the part I want (Footer cannot be modified, mobile header icon cannot be added, text color cannot be changed, product page details cannot be changed, etc.)"
        },
        {
          "Note": 3,
          "Lieu": "BE",
          "Pseudo": "Ricardo Brambilla",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T00:23:38.000Z",
          "Titre": "Nice website but domain@site123 don't help me..I still don't have the domain, is a big frustration bi",
          "Contenu": "I paid for two years.   Website is very nice, very easy and friendly, only negative, is I still don't have the domain, I have a Foult in my database and I ask in domain@site123.... for change the error but I still wait for help and solution and this happen almost 2 week,This is a very big frustration, because I needed the website up and running last week, I have already lost some important contracts for this reason. I hope you can help me asap. Please, please, please... If you want can I pay extra domain..... But please give me a solution please...... Thanks. Ricardo Brambilla.Domain www.floodzone. be"
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Osarugue",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T15:51:19.000Z",
          "Titre": "to expensive i cant get domain"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Manish Sharma",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T13:35:23.000Z",
          "Titre": "A few features I was looking for",
          "Contenu": "A few features I was looking for, couldn't find them on the website editor...such as a personalized chatbot,a feature where i could have colorful slides flashing across the webpage to display something particular,such as results of my students, and i was also looking for a feature where the contact button starts right from the top and continues right throughout while I am navigating the website..."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Les soins de Virginie",
          "Nb_Reviews": 1,
          "Date": "2023-10-28T18:27:31.000Z",
          "Titre": "I think that thé Web site is easy to…",
          "Contenu": "I think that thé Web site is easy to use and i like thé result.But there is two point that i would like to find.I would like to have somme assistance not by tchat but by Phone directly to have some détails and explication.And then i have some problem because clients can't send me and email by thé Web site by contact mail.We have done à test and it does not works.Thank you"
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "M. ALI BAIG",
          "Nb_Reviews": 1,
          "Date": "2023-07-05T17:08:13.000Z",
          "Titre": "ALL INFORMATION I PROVED YOU BUT I DONT…",
          "Contenu": "ALL INFORMATION I PROVED YOU BUT I DONT GET ANY IMAGES SUPPORT WHICH I PROVIDE IN THAT NOT BACK GROUND CHANGE IF I PUBLISH THIS TYPE MY WEB SITE NO ONE RESPONCE MY SITE SHOW SUM YOUR CREATIVITY TO MAKE MORE INTERSTING MY WEB SITE. HELP US WE NOT PROFESSIONAL WE PROVIDE YOU WHAT TYPE OF WEB SITE WE NEED ADD NEW VIEW  AND IMAGES TO GOOD LOOKING WEB SITE. ADVICE US"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Purchaser",
          "Nb_Reviews": 13,
          "Date": "2023-10-12T13:57:56.000Z",
          "Titre": "If you want a simple website using…",
          "Contenu": "If you want a simple website using preset templates you can't alter a great deal then this is for you. The price was excellent and the customer support very good. I am happy with my purchase overall."
        },
        {
          "Note": 3,
          "Lieu": "DK",
          "Pseudo": "Benjamin",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T22:43:07.000Z",
          "Titre": "Slow solution response time",
          "Contenu": "It was not hard to design the website, but when we chose to go premium by adding a domain, everything went south.  Today I contacted them that our website does not show up when entering the website address; even though it did for about two weeks after going premium.  They said I should have gotten an email (which I never got) that told me to confirm the domain/email.Now they said they would resend it in the next 48 hours and in the meantime, my domain is suspended.Never had this problem with GoDaddy."
        },
        {
          "Note": 3,
          "Lieu": "KR",
          "Pseudo": "임해성",
          "Nb_Reviews": 1,
          "Date": "2023-03-03T06:46:38.000Z",
          "Titre": "So.so",
          "Contenu": "No email support in Basic. It seems to be designed to charge extra for things that are too basic...Lack of interaction with site users.You can't link to comments or post photos or attachments.It's still early days, but overall, I don't feel like I have a good set of tools to interact with my site visitors."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "James E Price",
          "Nb_Reviews": 1,
          "Date": "2023-03-08T07:48:36.000Z",
          "Titre": "The site was very easy to setup and…",
          "Contenu": "The site was very easy to setup and design.  Only thing that kept me from rating 5 stars was due to the inability to setup individual pages just for members to see controlled information that is not public facing.  You can hide individual pages from from being seen by public, but no way to password pages that can only be viewed by members.  This feature would be very useful for sensitive and private information that needs to be posted and shared only with members of the club."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Romeo Dudley",
          "Nb_Reviews": 1,
          "Date": "2023-07-10T14:25:15.000Z",
          "Titre": "I have been satisfied up until…above",
          "Contenu": "I have been satisfied up until yesterday. Tobi was great helping to TSHOOT my initial issue with a photo that I could not change in my site. However, I had a launch planned for the site yesterday that was my day off and now I my site DNS is down. I have not received any support to get the site back up and running in order to fulfill my objective. I have paid up front in hopes that the first week would be a bit more smooth than this. Understanding that Site123 is utilized for the less tech savvy individuals. That would be my experience thus far with about 350 days left. I really hope this feedback helps."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2023-10-16T15:33:20.000Z",
          "Titre": "Easy to use, but limited in format options",
          "Contenu": "I was trying to get a posted photo from my phone to my web page, on my phone. The program on my phone offered no way to scale the picture, so I get an overly cropped, useless picture posted. When I asked tech support, they told me to try to do it on my PC. I’ll try soon."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Amanda",
          "Nb_Reviews": 2,
          "Date": "2023-05-10T12:51:14.000Z",
          "Titre": "Our site has been down for 5 days",
          "Contenu": "Our site has been down for 5 days. They got it back up for about an hour and it is down again.Update: it was requested by the company that I update my review. They resolved the issue quicker and my site was back up within a day. I’m told the reason the site went down is because it was edited several times in a row in a short amount of time and I guess this triggers some sort of security setting? I will continue to update if we have more issues and or if the experience improves."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Riana Meyer",
          "Nb_Reviews": 1,
          "Date": "2023-03-13T07:11:11.000Z",
          "Titre": "My site is still not online waiting for…",
          "Contenu": "My site is still not online waiting for an email to verify my contact details since last week Friday. I gave 2 different email addresses. So disappointing!@ Thomas I did sent an e-mail no response for 2 days.  It has been 5 days I still have not received any e-mails from the domain registrar.After a week it seems we have found the problem."
        },
        {
          "Note": 3,
          "Lieu": "CO",
          "Pseudo": "julian fernando diaz",
          "Nb_Reviews": 3,
          "Date": "2022-12-15T00:14:53.000Z",
          "Titre": "Bad atention, of staff",
          "Contenu": "Experience date december 14, 2022Yesterday, in this blog desing, when \"I question about that, normativa blog, any work, got an Irrelevant information about that\" its or not, important the copyright rules for create an blog\""
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Hatim ALGhamdi",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T16:19:12.000Z",
          "Titre": "I don't know how to add media like…",
          "Contenu": "I don't know how to add media like videos. Also I would like to add time and date on the website. everything else is good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Daniel Lundquist",
          "Nb_Reviews": 4,
          "Date": "2023-04-21T05:08:41.000Z",
          "Titre": "Is this company Is awful",
          "Contenu": "I spoke to someone on chat that helped me through my issues and finally found the problem in 5 minutes of chatting with this guy. It was as simple as logging off then logging on again.I've been trying to get this fixed for 2 months and everyone else Has done nothing to help me fix it and it was as easy as logging off and logging on again And in 2 months they couldn't tell me that. To the gentleman that helped me on chat thank you. And for every other person that was trying to help me learn from the person that did help me"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Playtime Pals",
          "Nb_Reviews": 1,
          "Date": "2023-09-11T22:49:45.000Z",
          "Titre": "you said it was free but at the end it…",
          "Contenu": "you said it was free but at the end it costed money it was also hard to use because we offer a service so I wish that there was a calender so they could pick the date and time for the service"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Parley Elijah Smith",
          "Nb_Reviews": 1,
          "Date": "2022-12-07T19:42:26.000Z",
          "Titre": "The help here is great What I think is silly that you have pay for plans and the prices also that you can only send 1 message for having many subscribers per month. For this I would rate one star.",
          "Contenu": "The help here is great! What I think is silly that you have pay for plans and the prices also that you can only send 1 message for having many subscribers per month. For this I would rate one star."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Donna Rainey",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T20:35:00.000Z",
          "Titre": "Disappointment in response time on issue",
          "Contenu": "I was disappointed in the untimely response about my account being blocked. This should have been resolved in a few hours. Other than that, has been a good experience with the online help."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Larry Attard",
          "Nb_Reviews": 2,
          "Date": "2023-10-07T02:51:42.000Z",
          "Titre": "I sorted problem paid bill but keep…",
          "Contenu": "I sorted problem paid bill but keep getting messages my page is cancelled"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Michael Langfus",
          "Nb_Reviews": 2,
          "Date": "2023-09-22T04:06:04.000Z",
          "Titre": "The good and bad",
          "Contenu": "Likes- easy to use Cons- postage needs program like pirate Need to add Venmo as payment option"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Ksenia",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T23:17:21.000Z",
          "Titre": "I need your attention! Urgent",
          "Contenu": "Dear Customer SupportI hope this email finds you well. I am writing to bring to your attention an issue I am currently facing with your platform as a seller of digital products. This problem is of utmost importance to me, as it directly affects the ability of my customers to view and purchase my products.The specific concern is related to the zooming functionality for digital images on mobile devices. As an essential part of my product offering, it is crucial that customers are able to zoom in and examine the details of the digital images before making a purchase. Unfortunately, I have noticed that on mobile devices, the zooming feature does not seem to be functioning as intended. This limitation is concerning because it prevents potential customers from being able to read and understand the content contained within the digital packs.I would greatly appreciate it if you could allocate some time to investigate and resolve this issue as soon as possible. waiting for your response"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Peter B Godfrey",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T07:38:05.000Z",
          "Titre": "Your team is responsive but they…",
          "Contenu": "Your team is responsive but they haven't been able to fix my problem. And now my site is unavailable for some reason."
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Gilles",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T08:13:22.000Z",
          "Titre": "No satisfying answers",
          "Contenu": "Kind people, but no complete answers to my questions : it was impossible to access my second draft and to edit it, I did ask 2 or 3 times this question (online and by mail), but no answer at all to this question, if like they didn't understand."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Samuel Ozekhome",
          "Nb_Reviews": 8,
          "Date": "2022-12-14T21:58:00.000Z",
          "Titre": "For now the company site123 is doing…",
          "Contenu": "For now the company site123 is doing well to me because I like my website too much. I am looking forward for a good traffic for my website"
        },
        {
          "Note": 3,
          "Lieu": "IE",
          "Pseudo": "Emerald Isle Media",
          "Nb_Reviews": 1,
          "Date": "2023-03-12T21:34:18.000Z",
          "Titre": "I love the costumer service but the…",
          "Contenu": "I love the costumer service but the problem was not fixed. I keep getting your emails even after I Unsubscribed 8 5imes"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Stuart",
          "Nb_Reviews": 2,
          "Date": "2023-05-03T07:36:34.000Z",
          "Titre": "Not a review",
          "Contenu": "To be honest, I haven't spent enough time on it to make an informed decision on what I think of it.Honestly, why ask me this when I've barely spent any time on it? Ask me in a week or two!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Snaider",
          "Nb_Reviews": 1,
          "Date": "2023-09-10T15:05:33.000Z",
          "Titre": "Good experience however I can't get my…",
          "Contenu": "Good experience however I can't get my email to work well and it would just be great if I could get somebody to call me and walk me through that that would change my experience to great I've gone through two sessions of chat and the person has yet to be able to get my email to work for me on the site"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Nanou",
          "Nb_Reviews": 1,
          "Date": "2023-07-25T11:10:02.000Z",
          "Titre": "When you ask for help",
          "Contenu": "When you ask for help, the operators seem to be only focused on sending process before trying to understand the problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "duckduck",
          "Nb_Reviews": 1,
          "Date": "2022-11-07T01:20:07.000Z",
          "Titre": "Good except not good subdomain.",
          "Contenu": "Sites 123 is very easy to use and has a top tier support team. But it is impossible to change the subdomain in a free account which is beyond annoying. Because the subdomain that it assigned was a random number that had nothing to do with my sites name. I feel that it is a bit of a trick to get you hooked and make you pay for the premium service. Other than that the website builders is simple to use and quite well set up."
        },
        {
          "Note": 3,
          "Lieu": "GR",
          "Pseudo": "SOFIA",
          "Nb_Reviews": 1,
          "Date": "2022-11-13T08:52:14.000Z",
          "Titre": "simple construction, few layouts",
          "Contenu": "I liked the simplicity of constructing my site, it saved me valuable time. But the layouts were only a few to choose and it doesn't have an option to customize them, like getting the photos smaller etc"
        },
        {
          "Note": 3,
          "Lieu": "GT",
          "Pseudo": "Copesalud",
          "Nb_Reviews": 1,
          "Date": "2023-06-08T21:08:10.000Z",
          "Titre": "Like the way is very easy to make a web…",
          "Contenu": "Like the way is very easy to make a web page, dont like the way you put the adress of the page. no one cant find it, if you dont give de htpp adress."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Averluke AE&J Foundation",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T03:42:36.000Z",
          "Titre": "In general",
          "Contenu": "In general, I like the templates that your site offers. I also feel comfortable with the layout. However, the nonprofit’ name constantly needs correcting. I am having to constantly correct the name. This is a bit concerning. The name should read, AVERLUKE AE&J Foundation. I was able to make the modifications below.My hope is that this glitch can be fixed.  Thank you!"
        },
        {
          "Note": 3,
          "Lieu": "IT",
          "Pseudo": "tan sze nyan",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T12:36:13.000Z",
          "Titre": "Problem has not be solve after talked to 3 customer supports",
          "Contenu": "I love the fact that your customer service representatives are very fast response, however, after talked to 3 of your customer representatives and my problem has not been solve and that’s pretty frustrating. I published my website yesterday and when I clicked on my website and is not available for public view, the customer support asked me to verify my email (which to be happened on spam), the end I have verified both my domain as well as my email address, and being told my website shall be available in a couple of hours, that happened last night, so it’s about 12 hours has passed and problem still not solveUpdate: it takes about 48 hours, and now my website is live and available for public, I gave a 3 stars ⭐️ ⭐️ ⭐️ review because they need to improve the email not enter to spam!"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Lehlohonolo Tlali",
          "Nb_Reviews": 1,
          "Date": "2022-10-31T05:22:53.000Z",
          "Titre": "As an issue of rationale and principle…",
          "Contenu": "As an issue of rationale and principle it helps when the cash is not demanded immediately but then again you are running a business and must realize your bottom line.As a small business most of the times money is not immediately available but as a result of your assistance one can get by in establishing themselves at the same time keep SITE123 as a partner in their corner always. Money is the biggest challenge especially in this post covid era."
        },
        {
          "Note": 3,
          "Lieu": "NG",
          "Pseudo": "Joseph, Victor Chisom",
          "Nb_Reviews": 2,
          "Date": "2023-07-14T07:43:35.000Z",
          "Titre": "Cost effective plans but the builder is…",
          "Contenu": "Cost effective plans but the builder is very limited."
        },
        {
          "Note": 3,
          "Lieu": "PH",
          "Pseudo": "Merydha David",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T12:55:50.000Z",
          "Titre": "I'm only using it for my computer…",
          "Contenu": "I'm only using it for my computer subject."
        },
        {
          "Note": 3,
          "Lieu": "NA",
          "Pseudo": "Gift Mandaza",
          "Nb_Reviews": 1,
          "Date": "2023-04-27T18:23:10.000Z",
          "Titre": "Fairly good",
          "Contenu": "Mobile layout is bad. No better options for mobile phone layout"
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "DC77",
          "Nb_Reviews": 9,
          "Date": "2022-10-20T06:45:48.000Z",
          "Titre": "Great site builder poor billing dept…",
          "Contenu": "Great site builder excellent tech support but not so great payments/accounts department.  I paid for the domain registration separately and was unable to get a refund (not included in the 14 day guaranteed money back apparently) or have this unnecessary fee deducted from my 2 year premium plan, that includes the registration as part of the package."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Karen Fraser",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T23:56:48.000Z",
          "Titre": "Still Deciding",
          "Contenu": "Excellent site.  Only problem I found is the paygate system.  None of the paygates works with South Africa.  I did not know that, as I could only view the paygates after payments.  Dissapointing though.  I would probably not have joined.Wis h they would add Payfast.But dont get me wrong, I could only find that 1 negative.  Friendly and helpful people.  South Africans be aware of their paygates."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "Axel",
          "Nb_Reviews": 2,
          "Date": "2023-03-22T16:58:47.000Z",
          "Titre": "Easy to use, but…",
          "Contenu": "Easy to use.No plans if you need multiple Websites.If you need 6 Websites you have to pay 6 times the Price of a Single Site…."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Samantha Quantock",
          "Nb_Reviews": 3,
          "Date": "2023-04-06T18:22:04.000Z",
          "Titre": "I need SEO as website not appearing on…",
          "Contenu": "I need SEO as website not appearing on search"
        },
        {
          "Note": 3,
          "Lieu": "BG",
          "Pseudo": "Yoan Hristov",
          "Nb_Reviews": 2,
          "Date": "2022-11-13T09:56:31.000Z",
          "Titre": "There is a big watermark and I can't…",
          "Contenu": "There is a big watermark and I can't remove it, but this is the best builder I've ever seen!"
        },
        {
          "Note": 3,
          "Lieu": "FI",
          "Pseudo": "Mikko",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T07:31:52.000Z",
          "Titre": "Good things and bad things",
          "Contenu": "Good things: everything works pretty well and site is easy to set up. It's also easy to arrange products into categories and overall the store function is pretty good even if we don't use it for selling products online, but mainly showcasing them.Bad things: the level of customization the editor allows is not sufficient. Adding pictures, text boxes and other elements on the site is very limited and has to be done only in the framework of the existing templates. If there's no template for your idea of the site it's not really possible to have enough creative freedom to drag things where you want them to be. Great and quick customer support.Overall: An easy choice and a good option for a starter online shop or other small business. But the lack of freedom makes me want to look at other alternatives for the future."
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "Daniel Ojesto",
          "Nb_Reviews": 1,
          "Date": "2023-02-13T17:57:16.000Z",
          "Titre": "My website was blocked",
          "Contenu": "My website was blocked. It took a lot  to restablish"
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Richard Turnbull",
          "Nb_Reviews": 1,
          "Date": "2023-04-29T04:19:09.000Z",
          "Titre": "I haven't had time to explore the…",
          "Contenu": "I haven't had time to explore the software to it's fullest yet."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jon Frattasio",
          "Nb_Reviews": 1,
          "Date": "2022-08-30T19:13:14.000Z",
          "Titre": "I gave 3 stars and not 5 because I don't care for your pricing. I do like the control I get in creating my site and your online team of help is very good and they're quick in their response.",
          "Contenu": "I'm having a good experience in-fact I'm still navigating and developing my web pages thru your site, I like the control afforded me to develop my own site with help from your team, who respond quickly and are knowledgeable about your service. However, I'm not crazy about your pricing."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Yolla Bechara",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T09:45:32.000Z",
          "Titre": "Issue taking too long to be solved",
          "Contenu": "The issue I encountered isn't solved yet for more than  month. As per the support they are great people, but technically talking the issue is still under process and I don't see why the team isn't as much tecchy savvy. I tried helping in so many ways but useless. I still don't know where I am or what to do!!!!"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Grace Mwanauta",
          "Nb_Reviews": 1,
          "Date": "2022-08-02T12:47:47.000Z",
          "Titre": "I Finally have a website.",
          "Contenu": "I had a wonderful experience especially that I needed a website I could use urgently. The only down side was that there wasn't many options when it came to choosing the events page. It was limited and I just had to settle for what was available.Thank you anyway, I finally have a website of my own. Grace"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Yaniv s",
          "Nb_Reviews": 1,
          "Date": "2022-07-19T13:40:00.000Z",
          "Titre": "Easy platform that does the job but fails in the small stuff",
          "Contenu": "A super easy platform that really does the job of helping you build a website in no time compared to other platforms. I was somewhat disappointed that some features were uneditable like a strip underline under headlines that you can't delete or some pages with images that you cant resize the image next to the text. Also, there is minimal control over colors - only the main website layout which is a huge problem."
        },
        {
          "Note": 3,
          "Lieu": "ES",
          "Pseudo": "David Scrivens",
          "Nb_Reviews": 4,
          "Date": "2022-07-21T13:20:43.000Z",
          "Titre": "This site COULD be so much better... Shame.",
          "Contenu": "This site would be so much better and the cream of the crop, if it offered an actual pay monthly plan. I only intend to use it for information regarding my hobby, and therefore any payment for a website is just additional dead outgoings, with no additional income. Due to this, I certainly can't warrant paying out a large sum, whereas a smaller monthly fee would have been acceptable. If this had been the case, I would have started a plan over a two or three year period, to reduce the outlay of my hobby."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "No Trees No Future",
          "Nb_Reviews": 1,
          "Date": "2022-09-27T03:00:37.000Z",
          "Titre": "It's overall very good",
          "Contenu": "It's overall very good, just doesn't have what I need. It does not show up when you search online and the donations page did not work. You need to pay for anything useful."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Egmont Ottermann",
          "Nb_Reviews": 1,
          "Date": "2023-04-12T07:21:45.000Z",
          "Titre": "My problem was not resolved"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Prince Rozario",
          "Nb_Reviews": 2,
          "Date": "2022-06-16T02:56:17.000Z",
          "Titre": "More advanced options please.",
          "Contenu": "I thought I would have a lot more options once I purchased a plan, but everything is still the same.  The design templates are extremely limited to what is there, and simple things, like buttons colors and overall background colors are not changeable.  I wished there were advanced design options for the site."
        },
        {
          "Note": 3,
          "Lieu": "CI",
          "Pseudo": "Yao Bi Tibe Joel",
          "Nb_Reviews": 1,
          "Date": "2023-03-02T12:27:51.000Z",
          "Titre": "i can't  access my website yet."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Tez",
          "Nb_Reviews": 2,
          "Date": "2022-01-28T05:10:34.000Z",
          "Titre": "Can be 5 stars in the future",
          "Contenu": "There could be lots more options available to push this to 5 stars. No members only section for pages. Also the price chart doesn't allow much editing to your cart options. We are a digital only and yet my members have to add address details. If I go ecommerce page i have this option but then can't do subscriptions. Very easy building site to use however its just missing a few options."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Daphne Doreen Maritz",
          "Nb_Reviews": 1,
          "Date": "2022-01-20T16:42:55.000Z",
          "Titre": "Amateur Me Did A Website in 1.5 days...",
          "Contenu": "Logged onto site123. Got started right away put my business website together with ease. Guidance was offered to me by the on line virtual assistants. My domain was set and site123 published my website!!!! Received great feedback from all. Who did your website they asked!!!!!!You rock site123"
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Peti Nárcisz",
          "Nb_Reviews": 1,
          "Date": "2021-07-05T11:09:08.000Z",
          "Titre": "I like but you have some misstakes",
          "Contenu": "I like the site123. I really do. But sometimes happening too many intresting things. For exaple, the thanks message, doesn't appear to my customers. Why? Nobody know...Sometimes my prices disappear. Why? I don't know, but I always publish my changes.When I ask the support, I always get an answer like that, \"ok. This is a ticket numer about your question/problem\".And nothing happening after this  little conversation!"
        },
        {
          "Note": 3,
          "Lieu": "FR",
          "Pseudo": "Imran",
          "Nb_Reviews": 2,
          "Date": "2021-06-15T13:49:32.000Z",
          "Titre": "design engine but with limitations",
          "Contenu": "Good interactive design engine but with limitations. Insertion of media, pics or starting with a blank page of one's own choice is not possible.My request of fixing reservation calendar could not be addressed to, from last two years. Despite my numerous requests it wasn't fixed neither a response was given.New models need to be included.Site should also propose forms."
        },
        {
          "Note": 3,
          "Lieu": "IQ",
          "Pseudo": "Dr. Mohammed alhamadani",
          "Nb_Reviews": 2,
          "Date": "2021-06-01T14:26:37.000Z",
          "Titre": "Dear Sir",
          "Contenu": "Dear SirWe ask to improve the services and the paragraphs that we are working on by adding paragraphs on the siteParagraphs can be controlled by merging, sorting, or changing measurementsAfter subscribing for a year, there is a free domain in the offer. But we didn't get it because we had to use our external domainWe require that the domain be included in the subscription"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "john slay",
          "Nb_Reviews": 1,
          "Date": "2021-08-18T00:55:10.000Z",
          "Titre": "Removing newsletter acceptance box",
          "Contenu": "Hi, Luis helped me and he was courteous, timely, and helpful in that he shared the pertinent info I requested. However, I requested instructions on how to remove the box accepting a newsletter on the registration form of the scheduling page and was told it can’t be done. Newsletter are not as common these days and there should be an option to delete that option. I don’t have a newsletter so I just wrote an explanation that Site 123 doesn’t have an option to remove it so they know why it’s there."
        },
        {
          "Note": 3,
          "Lieu": "GH",
          "Pseudo": "Herman Nuake Kofi, Agboh",
          "Nb_Reviews": 1,
          "Date": "2021-06-22T10:38:44.000Z",
          "Titre": "COST and The mobile interface doesn't function…",
          "Contenu": "The mobile interface doesn't function normally.  For instance, the mailing on the phone interphase cannot search for items, does not allow to scroll writeups,  and makes navigation difficult.  The purchasing deal is not transparent. Aside from it being relatively more expensive that other providers, I only got to know that the payments made for the domain lasts for a period that is different from the site name acquisition. This is absolutely unacceptable.  I am considering moving away."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "michael screen",
          "Nb_Reviews": 2,
          "Date": "2021-06-15T12:49:10.000Z",
          "Titre": "Its an easy and intuitive platform to…",
          "Contenu": "Its an easy and intuitive platform to use. However, the customers often cannot download their digital purchases requiring me to have to mail them directly. Despite numerous attempts to resolve this, no progress has been made. It doesnt offer a news or story page to act as a diary or interest page for potential customers"
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "אלי שם טוב",
          "Nb_Reviews": 1,
          "Date": "2020-12-16T06:58:43.000Z",
          "Titre": "The service is excellent",
          "Contenu": "The service is excellent.  The problem with the software is that if you want to update a directory you can not ask it to take only the new items from a file.  It is not possible to scroll through the file and directory on the site to try to check what already exists and what does not exist and this causes the whole file to be moved again and then for hours delete the duplicate."
        },
        {
          "Note": 3,
          "Lieu": "HU",
          "Pseudo": "Papp Rencsi",
          "Nb_Reviews": 1,
          "Date": "2022-07-30T15:06:45.000Z",
          "Titre": "My feedback",
          "Contenu": "The admin part is very nice with good videos and pictures, easy to use. The issue is that I can't bring my website somewhere else just for money. Helpdesk guys are kind."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Shaun",
          "Nb_Reviews": 1,
          "Date": "2020-10-02T19:38:29.000Z",
          "Titre": "Playing Tricks with Rates",
          "Contenu": "Rate was going to double at renewal; called to ask for better price. They said no, I canceled and started to make a new webpage. Then got an automated offer for a huge discount.... Was a huge pain in the back to have my website down for a week. Ended up renewing because it was a good price; but I already have a back up website made and ready to launch incase they pull that stunt again."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JON",
          "Nb_Reviews": 10,
          "Date": "2020-11-17T14:13:30.000Z",
          "Titre": "Building my website is more involved than I thought",
          "Contenu": "Building my website is more involved than I realized. Have spent hours and still not complete. The assistance via chat is very good, though. Have had to use chat many times to get instruction on how to proceed with functions needed on my site. I will get back to it again later today hope to finish it by the end of the week...3 more days to work on it."
        },
        {
          "Note": 3,
          "Lieu": "AE",
          "Pseudo": "Naqeeb",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T17:20:12.000Z",
          "Titre": "Overall its fine but the domain given…",
          "Contenu": "Overall its fine but the domain given is out of my mind its a mixture of letters and digits and its so strange. If you can give me a suitable free domain with your 123 domain, it will be useful then.I have sent a message regarding this but didn't hear about it yet.  Something like this will be of use...Www.tarkato.123site.com or close to this, but i got actually is just waste."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff B",
          "Nb_Reviews": 1,
          "Date": "2020-08-05T12:40:11.000Z",
          "Titre": "I am disappointed in the fact that on…",
          "Contenu": "I am disappointed in the fact that on at least three occasions I have spoken with your staff regarding an option of standard banners being available instead of just buttons (customer option) and my suggestion has basically been ignored. Not all customers  simply want a button option and I have had to tell my loyal customers no over and over again."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "happy",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T10:59:55.000Z",
          "Titre": "Site 123 is a very simple and a good…",
          "Contenu": "Site 123 is a very simple and a good platform to create your website, one thing boring is that they dont use or allow all payment gateways, like me I'm in south Africa and our popular gateway here is payfast, and they dont support payfast. As a result I had to leave them."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Heidi Poole",
          "Nb_Reviews": 2,
          "Date": "2020-10-13T07:50:55.000Z",
          "Titre": "Your chaps are very happy to answer…",
          "Contenu": "Your chaps are very happy to answer questions and respond quickly.  However, the site is not as versatile as some.  It doesn't allow enough flexibility in the design of pages.  I feel it would be a good idea for your chaps to offer to refer areas where they can't help to management for future improvement."
        },
        {
          "Note": 3,
          "Lieu": "IL",
          "Pseudo": "Muhammed Abu Elhija ENG",
          "Nb_Reviews": 1,
          "Date": "2021-08-10T17:20:54.000Z",
          "Titre": "i think there is a lot of things to…",
          "Contenu": "i think there is a lot of things to migrate ' sometimes there a difficulties with configuring and customizing some things , there is a big problem with authentication when you make a site for a client to give him permissions to update store or pictures and etc."
        },
        {
          "Note": 3,
          "Lieu": "RU",
          "Pseudo": "Aleksandr Buharin",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T13:08:09.000Z",
          "Titre": "3 stars",
          "Contenu": "Good afternoon. Everything seems to be fine, but it's taking a long time. Besides, sometimes when editing a product the page becomes white. And one more thing. Add the ability to move products not one, but several at once. I want to move several items, but I can not choose. Only one I can move. It's really annoying."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "pete piccoli",
          "Nb_Reviews": 1,
          "Date": "2021-08-15T11:37:49.000Z",
          "Titre": "It is beyond belief that a “ make your…",
          "Contenu": "It is beyond belief that a “ make your own website” company doesn’t have something as simple as an “insert text box” feature. Online print companies do, and other  website builders do, but not this company. I have a federally mandated disclaimer that must go on  every page of the site, so i cannot use this company for my website. Boggles the mind, actually.*- a follow up on my review. I came up with my own workaround for my site, so I did decide to go with SITE 123. Its not perfect, but it does look good. Im hoping they will take this review and add this simple feature in the future."
        },
        {
          "Note": 3,
          "Lieu": "RO",
          "Pseudo": "Ghinea Daniel",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T07:03:14.000Z",
          "Titre": "We need the currency changed for…",
          "Contenu": "We need the currency changed for Romania badly ! make the currency show after the amount so that it would look normal.and so that the clients dont mistake the pcs with priece   there is no symbol for the currency here that is why evereyone puts it after the amount . please make the change for Romania."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "BB",
          "Nb_Reviews": 1,
          "Date": "2020-09-08T17:17:23.000Z",
          "Titre": "If we were able to sync our…",
          "Contenu": "If we were able to sync our appointments on the website that would be great. Also, we have noticed some communication errors where our customer's try to message us over the website and we don't get them or the email notification. If these things were fixed, we would love to continue using SITE123."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "RILEY",
          "Nb_Reviews": 2,
          "Date": "2021-08-11T22:50:39.000Z",
          "Titre": "It is a very good site with friendly…",
          "Contenu": "It is a very good site with friendly assistance however, when I want to add things onto my website like my ABN into my footer I was told I cant. I also cant use any payment gateway that requires me to type in specific code. Other than that it is pretty good."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeff Consoer",
          "Nb_Reviews": 2,
          "Date": "2020-09-14T18:02:40.000Z",
          "Titre": "Gets expensive over time",
          "Contenu": "The costs for my second year were notably more expensive. In truth my website has not generated much (if any) additional business. Maintaining it has just become and additional business task.While Site123 is relatively simple to use, there are some specific issues I have had. One is that I cannot create an item menu for my business and simply upload it. I have to completely recreate it on Site123. Likewise, I cannot create it on Site123 and then download that to print it locally. This is a major flaw in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "David",
          "Nb_Reviews": 8,
          "Date": "2020-08-17T12:38:06.000Z",
          "Titre": "Good service but got rather confused",
          "Contenu": "Good service but got rather confused, looks of jargen which I did not understand. Got the email wrong but online chat service helped to sorry me out. They were very good indeed. Only thing I would say is that older people like me might want a phone help service as we find talking to a person easier."
        },
        {
          "Note": 3,
          "Lieu": "CH",
          "Pseudo": "Sandra",
          "Nb_Reviews": 1,
          "Date": "2021-06-20T12:52:06.000Z",
          "Titre": "I will give 5 stars",
          "Contenu": "I will give 5 stars. But today I saw that an important mail is landing in my spamMails. And I was very sad because it was a new client who was asking me for dogwalking and she need answer soon. But I saw it today in the spams one week to late 😠😠"
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Sue Eksteen",
          "Nb_Reviews": 2,
          "Date": "2020-09-08T08:12:34.000Z",
          "Titre": "The site is not very user friendly",
          "Contenu": "The site is not very user friendly. Emails don't reach me directly. I get a notification from STE re emails and when I click on it I only get one word and no communication. I would prefer for clients to be able to contact me directly via my email address and not go through STE sites first."
        },
        {
          "Note": 3,
          "Lieu": "IN",
          "Pseudo": "Anurag Gangal",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T13:15:33.000Z",
          "Titre": "This is a good platform for active and…",
          "Contenu": "This is a good platform for active and effective online presence. Main difficulty is it's video and YouTube video uploading process. If this is made easier and direct quite like the process of video uploading in YouTube, then 123 will be the best in online web and blog business."
        },
        {
          "Note": 3,
          "Lieu": "JM",
          "Pseudo": "Simone M.",
          "Nb_Reviews": 1,
          "Date": "2022-05-10T14:24:02.000Z",
          "Titre": "Although your team is wonderful & I've…",
          "Contenu": "Although your team is wonderful & I've had absolutely no issues with any of them, I've been unable to get effective step by step guidance to properly utilize your services, including my recently purchased professional package. To the best of my knowledge there are now 3 websites in my name. With the exception of the 1st one \"freegiftfrom...\" I'm not clear how to proceed with either of the other 2. I'm told login details are an issue however I'd love to have your help to reset that so that I can get on with business and we can build each other up! Thanks for this opportunity to air my views especially as someone new to website development. Let's fix the issues soon please. Thanks again.👍🏽💻📉🌻"
        },
        {
          "Note": 3,
          "Lieu": "KW",
          "Pseudo": "Imran Sheikh",
          "Nb_Reviews": 1,
          "Date": "2020-08-06T16:16:36.000Z",
          "Titre": "Well you need to improve a lot in your…",
          "Contenu": "Well you need to improve a lot in your site as i found missing options and support told me these options will be available when i will purchase. How can i purchase if i am not satisfied. All what i needed got it for free trail and i registered with them. so you lost one customer."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Shirley Almeta LENNON",
          "Nb_Reviews": 4,
          "Date": "2021-09-21T11:40:01.000Z",
          "Titre": "Beginning my website.",
          "Contenu": "I was a very difficult client, I believe, because I am not at all website savvy.   The folk who attempted to assist me were as helpful as they could be, but my understanding is limited.   I DID have a Zoom call with Samuel and he is a very gifted 'teacher', and he made it possible for me to make some progress.   However, I believe my own computer is just Windows 8, and I think that the screen doesn't show all that it is supposed to.  I still do not know how to upload my artwork that I don't want to sell online.....I just want to upload them with the advice to contact me via email or phone if they are interested in purchasing."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "June McKenzie",
          "Nb_Reviews": 9,
          "Date": "2020-07-21T10:48:34.000Z",
          "Titre": "Quite easy to use, however---",
          "Contenu": "Quite easy to use and I made what I think is a good site! - - - but I haven't had much footfall so am a bit disillusioned. I have had more c orrespondance in my Facebook page which isn't nearly as well organised! Your agents are helpful but I still don't get anyone."
        },
        {
          "Note": 3,
          "Lieu": "ZA",
          "Pseudo": "Thrifty",
          "Nb_Reviews": 1,
          "Date": "2020-10-13T22:10:46.000Z",
          "Titre": "The site itself is excellent and user…",
          "Contenu": "The site itself is excellent and user friendly. Unfortunately users in South Africa are limited to choosing a reputable pay gate. Only supported by 2 checkout which unfortunately has extremely bad reviews. I had to cancel my subscription due to these limitations."
        },
        {
          "Note": 3,
          "Lieu": "AU",
          "Pseudo": "Andy Sinnasamy",
          "Nb_Reviews": 1,
          "Date": "2020-09-06T11:20:27.000Z",
          "Titre": "I was hoping site 123 will have all the…",
          "Contenu": "I was hoping site 123 will have all the tools I need to promote my website and business but that’s not the case. Here are some of the improvements that are required.1. Cannot upload videos while sending email on a new message. We need to be able to upload you tube videos or copy embedded code and insert into our content to attract visitors.2. Maximum emails can be sent a month is only 10000 email. Need to increase this to 20,000 emails as a minimum.3. I need to be able to edit my website not through site123 tagging.These are the improvements required for now in my opinion."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Sharon Hoffman",
          "Nb_Reviews": 7,
          "Date": "2021-06-01T14:57:15.000Z",
          "Titre": "Just so-so on customer service",
          "Contenu": "Have had to contact them on several issues.  Seems that the responses I am getting back are \"canned\" ones that they typical just copy & paste from a book.  They never seem to know what to tell you until they have \"looked at a manual\" or other sources.  Also it doesn't give me a straight answer, it's just in the neighborhood of what to do.  I have to dig around to find what I need or hunt thru the website to locate how to do something.  Personally I wish that I could change the color of the texts in areas that I want it to pop out for my customers. Haven't been able to find that if it's even supported."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rose",
          "Nb_Reviews": 4,
          "Date": "2020-06-03T13:54:46.000Z",
          "Titre": "Our website still does not show up when…",
          "Contenu": "Our website still does not show up when searched for it. The fact that when orders are placed, there is no way to do a progressive order number, that is just nuts. Our old website could do that no problem.Your folks on the chat line have been pretty helpful."
        },
        {
          "Note": 3,
          "Lieu": "HR",
          "Pseudo": "Andrej Trostin",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T13:31:49.000Z",
          "Titre": "Good but with room for improvement",
          "Contenu": "I like idea of your site. Relatively easy to put up page with few minutes. But relatively advanced  stuff is hard to do.I think that CEO is not as good as it should be. After two years of my page online i'm still not on first or second page while one of my pages I made with wordpress (With little knowledge of wordpress and no knowledge of coding) are on first pages of searches. There every word is counted for searches while here not....My goal is to \"develop\" web shop and to get some revenue from it, but for now I have paid more for page (Your yearly fee and domain) than i got from webshop..."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Lunn Nelson",
          "Nb_Reviews": 1,
          "Date": "2022-11-08T00:45:13.000Z",
          "Titre": "it is nice to have a website but a…",
          "Contenu": "it is nice to have a website but a little pricey"
        },
        {
          "Note": 3,
          "Lieu": "MX",
          "Pseudo": "ernesto",
          "Nb_Reviews": 1,
          "Date": "2020-08-03T15:25:32.000Z",
          "Titre": "Very Simple but enclosed",
          "Contenu": "Very Simple.Easy To use.Could be so much much better with more interesting and creative templates.Could be Powerful if exist the possibility to add more content to each page, after the closed template. I mean, add photos and text boxes."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Anthony Jones",
          "Nb_Reviews": 13,
          "Date": "2022-08-30T16:42:13.000Z",
          "Titre": "my bank card screwed up and I have had…",
          "Contenu": "my bank card screwed up and I have had to sort it all out. Being severely disabled, it has taken a lot of time and effort."
        },
        {
          "Note": 3,
          "Lieu": "DE",
          "Pseudo": "babak zanjani",
          "Nb_Reviews": 1,
          "Date": "2020-06-24T08:30:32.000Z",
          "Titre": "Hi  your program its good but ,",
          "Contenu": "Hi  your program its good but ,I have a question there is couple of days that when i am trying to go to the edit page it takes long time to open around 30 minutes. how come and can you please check what is the problem. Thank you"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pearl Abalo",
          "Nb_Reviews": 1,
          "Date": "2022-03-22T14:00:17.000Z",
          "Titre": "Company name not in link/website",
          "Contenu": "It was cool setting up the site, wish there were more background options. Also as a free site, my company name is not in the link/]website and that is the worst part of it."
        },
        {
          "Note": 3,
          "Lieu": "GH",
          "Pseudo": "Richard Boateng",
          "Nb_Reviews": 2,
          "Date": "2021-05-11T08:48:42.000Z",
          "Titre": "The best experience for me 🙂 s your…",
          "Contenu": "The best experience for me 🙂 s your support, that is exceptional but I am of the opinion that the site needs a lot of training materials like videos to help us redesign the templates to our liking."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Jim",
          "Nb_Reviews": 3,
          "Date": "2020-11-06T08:35:54.000Z",
          "Titre": "When it comes to creating a nice…",
          "Contenu": "When it comes to creating a nice website this is a great site. Easy to use and the people are very helpful and always available. On the other hand I don't find their email set up for sites very user friendly."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "محمد الطاهر نصري",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T14:17:51.000Z",
          "Titre": "A good start to progress..",
          "Contenu": "Easy treatment in using the site and good treatment of the people working on improving the services. Thank you for the good treatment"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "N.Y.",
          "Nb_Reviews": 2,
          "Date": "2023-12-09T11:12:51.000Z",
          "Titre": "Great assistant service",
          "Contenu": "Great assistant service!  Some of the design was not very flexible ( like changing the horizontal length of text box and making links on the text are not possible) and I hope those will be improved."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Michael",
          "Nb_Reviews": 1,
          "Date": "2023-12-13T08:04:01.000Z",
          "Titre": "Online customer support is great !",
          "Contenu": "Online customer support is great! They also reply client questions in the weekend. Michael"
        },
        {
          "Note": 4,
          "Lieu": "UA",
          "Pseudo": "OpenPC",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T21:20:03.000Z",
          "Titre": "I've been waiting over a week for a…",
          "Contenu": "I've been waiting over a week for a domain setup, every time I contacted support I was told that my problem would be solved within 48 hours, but nothing changed.P.S. It's been 2 weeks since I bought a domain from their website and made a request to set up a domain. Nothing has changed, the site is not workingP.S.The site team contacted me and answered not all my questions, but I don't understand, if the team knew that the letter was sent to me, then why they kept asking me to wait for the problem to be solved. But I am still grateful that they were able to answer me and solve my problem"
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Rayan Charrier",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T08:22:22.000Z",
          "Titre": "Wouldn't have said no to a simple pdf…",
          "Contenu": "Wouldn't have said no to a simple pdf viewer in the website."
        },
        {
          "Note": 4,
          "Lieu": "CW",
          "Pseudo": "A. Damberg",
          "Nb_Reviews": 3,
          "Date": "2023-12-10T16:18:26.000Z",
          "Titre": "Great helpdesk",
          "Contenu": "Great helpdesk, easy to edit the websites and great price to quality ratio"
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "Leo",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T07:12:18.000Z",
          "Titre": "Requires Futuristic Designs",
          "Contenu": "The designs should be like in the new Genth not the old generation design. Make it more futuristic."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LAFC",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T16:50:37.000Z",
          "Titre": "Pretty easy to use",
          "Contenu": "Pretty easy to use.  It would be helpful to have a description if each layout's underlying functionality of each layout up front... where calls to action or categories can be added. A lot of trial and error within each page type."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "ND",
          "Nb_Reviews": 1,
          "Date": "2023-11-16T01:01:02.000Z",
          "Titre": "Easy to use site builder",
          "Contenu": "Easy to use site builder and lots of templates available.   Some long term issues getting live help eventually got fixed.   Overall a good service ."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "ELSAYED EID",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T16:57:24.000Z",
          "Titre": "Easy and Supportable for non expert business' clients",
          "Contenu": "A very good experience, easy to use, and the support is convenient and fast"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Raja",
          "Nb_Reviews": 1,
          "Date": "2023-10-26T23:32:20.000Z",
          "Titre": "Satisfied Customer",
          "Contenu": "It was easy to set up a website with the company, even though I was very new to this. The on line advice was also very useful and you feel there is someone to support. The upgrade service so far seems value for money allowing to create your own unique domain and giving enough storage for uploads."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Sameer Wadhwani",
          "Nb_Reviews": 1,
          "Date": "2023-10-04T01:56:19.000Z",
          "Titre": "Easy and Convenient to Use.",
          "Contenu": "Easy and Convenient to Use.Still few basic features need to be added.Login with Password (Instead of OTP)Downloads & upload of content.Few more, but overall smooth and covers quite good features and templates."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha G.",
          "Nb_Reviews": 5,
          "Date": "2023-11-26T04:22:04.000Z",
          "Titre": "Chat help was helpful",
          "Contenu": "Chat help was helpful.  Not as difficult as other pages I tried to build.  However, I still need to learn more about all the functions."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Sandra. Staffordshire",
          "Nb_Reviews": 4,
          "Date": "2023-10-20T11:59:29.000Z",
          "Titre": "The fact you can put a basic free…",
          "Contenu": "The fact you can put a basic free website together yourself is great, that said, there are areas I struggled with. I cant correct a spelling mistake on my top page cant find out how, so for that it loses 1 star."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Colin Leaney",
          "Nb_Reviews": 5,
          "Date": "2023-10-22T12:54:38.000Z",
          "Titre": "I made contact with them via email and…",
          "Contenu": "I made contact with them via email and chat line, and spoke to 2 different people. Both of them were polite-patient-and understanding. You can't do better than that. !!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Anilu FLORES GONZALEZ",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T16:38:25.000Z",
          "Titre": "good",
          "Contenu": "goodIm building my site by myself, dont have so much experience, I like that is easy and the fact that I could have the help but some guys are very goods (spanish and english) bute the are some ones others (service uin french) that they doesn't known very well their site, or the doesn't interest."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Margret",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T18:59:12.000Z",
          "Titre": "Easy, free platform with great service",
          "Contenu": "SITE123 is fantastic. It is very easy to use and the staff which you can talk to on chat are really great - they always take into account feedback and suggestions and provide great advice. I would reccomend it for anyone starting out with a business and its completely free to begin with, if you like it you can upgrade to premuim packages."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alita Murray",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T14:57:54.000Z",
          "Titre": "Quick, easy, professional outcome",
          "Contenu": "Quick and easy, & much better than other sites. Ont bothersome thing was the constant chat box popping up in front of my screen which distracted and made things take longer because I had to contstantly minimize, which by the way also was not easy...there was no minimize box, only an x out which created new chat boxes. Another improve, would be to make clear prior to picking a design which ones have url addition capability or image etc...so adding a filter button."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Franco",
          "Nb_Reviews": 2,
          "Date": "2022-12-26T00:28:02.000Z",
          "Titre": "Purchase price vs customer service",
          "Contenu": "There was a misunderstanding about the payment. What Site123 meant as the equivalent of monthly payments looked to me as actual monthly payments. I had to go with a shorter plan and get a partial refund as a result. Their customer service is great & guided a novice thru the whole process of creating a unique website in record time."
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Zeeshan Sharif",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T11:45:17.000Z",
          "Titre": "Site123 is the easiest website among the competitors",
          "Contenu": "Site123 is the easiest website among the competitors I have ever used, its not just a site builder is an institute for beginners as well, the more you work with it more you learn gradually, some issues with store kind I just can not find, the compression, and the sorting tools by brand or size, etc."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Pam Vickars",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T06:30:45.000Z",
          "Titre": "Great on-line support",
          "Contenu": "The on-line help was very responsive when I had questions about the site.One thing I do wonder about and am planning to follow up on is the fact that I paid for two years of support and was then told I was eligible for one free year.  My expiry date, however, shows 2024, two years from now."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Laurie Durbin",
          "Nb_Reviews": 3,
          "Date": "2022-12-12T04:33:29.000Z",
          "Titre": "Easy way to learn how to make a website properly",
          "Contenu": "They helped me step by step and then the tutorials on utube helped some more. My only problem is with other sites you get to pick a domain name to use even before you are able to afford to register it. It's seen on Google or Bing  At Wix it's the domain name you pick with wix.com behind it. Kind of difficult even for friends to find you when your just listed as this long string of letters and numbers. I figure I'll learn how to make a proper blog here and then consider which to use and register by the price of the packages they offer."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "BRENT GILPIN",
          "Nb_Reviews": 3,
          "Date": "2023-02-20T10:16:07.000Z",
          "Titre": "So far so good",
          "Contenu": "So far so good. Very easy to setup new site and to make changes. Intuitive and good range of options. Help has been responsive. While free site works well, I upgraded to professional from the free site which good value on longer options. Couple of additional features which have asked about and they have added to possible future developments. If they implement those then no brainer 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "DZ",
          "Pseudo": "khoukhi zaki",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T12:06:10.000Z",
          "Titre": "hello",
          "Contenu": "helloI worked a lot with WordPress and Shopify, but after discovering your site, I found that it is much easier and helps a lot in adding productsBut there are some important advantages that I did not find with you Example The listing of states is incompleteWhen choosing a template, all titles change with itStore backup cannot be takenBut with all this, I thank you very much because it is an excellent site and its advantages outweigh its disadvantages"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Lesley Inglis",
          "Nb_Reviews": 2,
          "Date": "2023-07-04T17:53:04.000Z",
          "Titre": "Supporter of the Support Team",
          "Contenu": "The support Site 123 offer is second to none.  The support team are proactive in offering help and they are friendly as well as Knowledgeable. Nothing seems too much trouble for them and they are encouraging when you are putting your website together which is great!"
        },
        {
          "Note": 4,
          "Lieu": "BE",
          "Pseudo": "Gert",
          "Nb_Reviews": 1,
          "Date": "2023-03-07T15:44:21.000Z",
          "Titre": "It was a great experience",
          "Contenu": "It was a great experience, with mostly very helpful support. There was a difference in support however. First time right, use of open questions to get a good picture of the situation and understanding of the customers knowledge could be a point of attention for defining best further actions for some online support agents. But Emma and Michel definately met and overshooted my expectations: big thanks to both of them for going the extra mile! And the sharing of some snips/screenshots both ways helped me a lot bringing domain-website and emails together! KRGert"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Neil SC",
          "Nb_Reviews": 24,
          "Date": "2023-05-04T10:43:14.000Z",
          "Titre": "Seems quite an easy site to use and the…",
          "Contenu": "Seems quite an easy site to use and the customer support was very prompt (although I found the answer before I got a reply - the site really is intuitive if you think!)Only reason for 4 stars is the 24 hour limit on discounted prices. Irritating as I was just trying out and not ready to start building the site yet. Will now be shopping around."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "J.B. Lee",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T22:11:52.000Z",
          "Titre": "Wish it was more plug and play",
          "Contenu": "I like how easy it is to use the site builder, but I wish it was a little more plug and play/drag and drop. I don't like that it is impossible to add a text box or do other edits like making different fonts and spacing. Still, it is a good, utilitarian site for what I need, and looks nice, with some good features, and is reasonably priced."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "mark",
          "Nb_Reviews": 1,
          "Date": "2023-07-12T14:36:32.000Z",
          "Titre": "I knew almost nothing",
          "Contenu": "I knew almost nothing, but step by step by step I became better, I didn't become better just like that, if it wasn't for site123 and their great team, they were there for me all the time, they were never late. Now, in facing difficulties login into my account and the guys are with me I feel I gave them a pain in the neck. Conclusion, site123 and the team are amazing. Thanks to all"
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Onisim Stefanescu",
          "Nb_Reviews": 2,
          "Date": "2023-04-27T05:29:09.000Z",
          "Titre": "The platform is very simple to use and…",
          "Contenu": "The platform is very simple to use and you will use to it fast. You can build a website and put it online realy quick.The chap support was very helpful but  unfortunately, even if I had the Gold package, the Zoom support meetings was canceled by the support team three or for times.In rest is very helpful to build sites from personal blog to more complex commercial websites."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Sassenach-Création",
          "Nb_Reviews": 1,
          "Date": "2023-07-06T17:26:43.000Z",
          "Titre": "Nouvel création de Site Artisanale",
          "Contenu": "Sassenach-Créationjust a little regret...No information on the size and dimensions of the photos... so I have to redo all the photos of my articles smaller and re-upload them on my site... a considerable waste of time and money. Apart from this small downside, the interlocutors are very attentive, patient, courteous and very responsive.I recommend ."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Cornelius",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T10:50:09.000Z",
          "Titre": "I would have given 5 stars but site123…",
          "Contenu": "I would have given 5 stars but site123 do not have enough payment gateways for the country I'm trading in, this will make payment options more challenging with debit and credit cards if I compare to my competition but the rest is very good so far"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Anto",
          "Nb_Reviews": 1,
          "Date": "2023-06-30T04:40:46.000Z",
          "Titre": "Need Templates",
          "Contenu": "Hello, it is very user friendly. It would have better, if we have many choice of website templates Eventhough it looks different, but most of the designs are almost similar. BUT I AM SURE TO BE YOUR PERMANENT CUSTOMER."
        },
        {
          "Note": 4,
          "Lieu": "FR",
          "Pseudo": "Nicolas Gauthier",
          "Nb_Reviews": 2,
          "Date": "2023-06-19T07:12:09.000Z",
          "Titre": "Setting up the its own website is…",
          "Contenu": "Setting up the its own website is simple and user friendly. The support is Quick and efficient. The referencing on Google is Good. I do not succeed for the moment to search it from yahoo?I need more time to understand the various few functionalities"
        },
        {
          "Note": 4,
          "Lieu": "IL",
          "Pseudo": "Aby brakha",
          "Nb_Reviews": 4,
          "Date": "2023-11-29T11:13:57.000Z",
          "Titre": "Good customer service around the clock.",
          "Contenu": "Good customer service around the clock. Many oportunities for pages"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Wednesday Surprise Bakery",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T04:06:18.000Z",
          "Titre": "Chat support",
          "Contenu": "I appreciated that when I had a question about how to do something on my website this month, the chat tool was helpful. My questions were answered right away. This is my first experience with a website and I'm glad I had some support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mikaela Branch",
          "Nb_Reviews": 1,
          "Date": "2023-05-01T17:57:45.000Z",
          "Titre": "Easy to use",
          "Contenu": "The process of building my site was very easy and I love the different templates and photos you can choose from. The only reason I gave 4 stars is because I had issued not receiving the email to verify and my domain was inactive until resolved. Other than that I really like site123"
        },
        {
          "Note": 4,
          "Lieu": "NA",
          "Pseudo": "Shirley",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T07:52:55.000Z",
          "Titre": "Timely response but improve on help",
          "Contenu": "Timely response to the enquiry but can improve on the actual help. instead of giving generic links could make it relevant to the specific case by looking at the source of the enquiry and giving help accordingly. That way we don't have to dwell on the same problem"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Dana Hayned",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T07:07:02.000Z",
          "Titre": "Intuitive and great support",
          "Contenu": "Intuitive and easy to use. Excellent 24-7 fast chat support. The only reason I did not say give 5/5 is because of some ongoing issues with embedding feature... things don't center well and the solution (if there is one) is not easy to find."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Melvin",
          "Nb_Reviews": 1,
          "Date": "2023-05-05T20:06:17.000Z",
          "Titre": "Prompt support",
          "Contenu": "One of the most wonderful things you can expect when starting a website from scratch is timely technical support. Site123 offers a 3-minute response cycle most of the time, so what else can I expect?"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "KMP",
          "Nb_Reviews": 3,
          "Date": "2023-08-06T17:07:47.000Z",
          "Titre": "Really easy to build the website-…",
          "Contenu": "Really easy to build the website- redirecting my domain and setup of emails was not obvious. Alex was extremely helpful on chat function to guide through the process though."
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "Walter José",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T16:47:54.000Z",
          "Titre": "The service is quick and all the doubts…",
          "Contenu": "The service is quick and all the doubts were resolved, but the platform still doesn't have all the solutions I would like."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Mary",
          "Nb_Reviews": 4,
          "Date": "2023-07-05T19:34:39.000Z",
          "Titre": "Up and running in one day!",
          "Contenu": "It was very easy to set up, which is great and the live chat support was very helpful and much appreciated. I would like more design features and page layouts. I would also love to get some simple traffic statistics with my Advanced package."
        },
        {
          "Note": 4,
          "Lieu": "SE",
          "Pseudo": "Ylva Gertrud Hjert Åstenius",
          "Nb_Reviews": 38,
          "Date": "2023-12-17T10:14:02.000Z",
          "Titre": "the support is outstanding"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Ernest Ojemu",
          "Nb_Reviews": 1,
          "Date": "2023-06-03T11:17:39.000Z",
          "Titre": "I have made lots of request for feature…",
          "Contenu": "I have made lots of request for feature to archive what I wanted because I noticed that the major focus is for stores, restaurant, and the likes. But there are other field of business that needs a friendly website as well.Though I would like to commend the effort of the IT and support team for a great job well done. Lots of friendly templates to make the job easy and an easy to use features.Thanks"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Lordshina",
          "Nb_Reviews": 1,
          "Date": "2023-12-01T09:56:44.000Z",
          "Titre": "A Website for the beginner to work",
          "Contenu": "This your site is a beginner friendly. You are doing Great"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Gill Martin",
          "Nb_Reviews": 1,
          "Date": "2023-10-20T05:29:09.000Z",
          "Titre": "So far so good",
          "Contenu": "I have no complain this far, any problems I could have is from my side and the time I can dedicate to improve the website."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 8,
          "Date": "2023-08-06T22:35:21.000Z",
          "Titre": "Like having a real person to chat with…",
          "Contenu": "Like having a real person to chat with immediately! Glad Gary called to follow up on an chat. He explained alot and was very helpful. Was not pushy which I really appreciate!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Paul Long",
          "Nb_Reviews": 2,
          "Date": "2023-05-13T13:54:06.000Z",
          "Titre": "SITE123 is the best website builder.",
          "Contenu": "After spending a long time researching website builders SITE123 was by far the best. The ability to design and easily build my own website was so satisfying. The customer support team is exceptional with quick replies and easy to understand answers to any question I had."
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "Rasheedah Shah",
          "Nb_Reviews": 1,
          "Date": "2023-03-06T09:42:58.000Z",
          "Titre": "As a writer it has a lot of tools I…",
          "Contenu": "As a writer it has a lot of tools I would need to create and build a community. It has mailing, and analytics all rolled into one. The only thing I'd complain about is that there is a lot of sub-categories in the website. As someone who has a the memory as a gold fish, I always forget where I was and I have to go on a whole journey to find where I just was. It may be a me problem, but that's the only criticism I have."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Miiko Naffateli",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T00:29:43.000Z",
          "Titre": "I love designing websites",
          "Contenu": "I love designing websites. I used to try copy the templates or some elements in the theme. Though it took me alot of time to understand what element needs to be added.  And the help with customer service.  👍"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cynthia Thomas",
          "Nb_Reviews": 1,
          "Date": "2023-06-14T16:31:02.000Z",
          "Titre": "I was finally able to get my site back up!",
          "Contenu": "I finally was able to get my site back up. It had been down about two weeks. The problem was that I needed an email that would allow me to verify my domain registrar. After numerous chats (4) it was determined that for some unknown reason that essential email would not deliver to my email address of record. Mt tech then used my second domain then to verify and point to my site and its back up. This could have been resolved way before if I had 1) been told to look for the email to begin with, and  2) been believed that I had not received said email. I did on this day finally get a helpful technician who worked with me to make it happen.  I really like my site. It was easy to set up and it looks wonderful. I'm very happy that this was finally resolved."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Gregory",
          "Nb_Reviews": 16,
          "Date": "2023-05-09T08:39:45.000Z",
          "Titre": "Quality and frequency of contact - splendid.",
          "Contenu": "I have been impressed with the level of contact post-purchase and the invitation to seek help has been reassuring. If I am disappointed at all, it is in myself for not preparing in advance AND not fully acquainting myself with a) what was on offer and b) how it suited my requirement. The politeness and enthusiasm shown by every person who has contacted me from 123 has been splendid. I cannot claim to be cash rich and time poor but I am certainly always pressed for time and I have failed to devote more time to creating this personal website. SO - it is a tad early for me to 'review' - suffice to say that I am hoping to 'do-better' soon."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sarah",
          "Nb_Reviews": 1,
          "Date": "2023-02-22T02:40:56.000Z",
          "Titre": "The site is easy to navigate",
          "Contenu": "The site is easy to navigate. The templates are helpful. My only complaint is that I have set up my website and it is published. However, I am still getting weekly emails asking me to set up my website and look at the templates available. It’s annoying."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jim Crutchfield",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T15:09:12.000Z",
          "Titre": "customer service sales was…",
          "Contenu": "customer service sales was knowledgeable and was able to answer all my questionseasy processi will wait to see how the site build goes and will be happy to give a testimonial or review then !"
        },
        {
          "Note": 4,
          "Lieu": "NL",
          "Pseudo": "CARLOS LAIDLER",
          "Nb_Reviews": 3,
          "Date": "2023-02-07T17:35:57.000Z",
          "Titre": "Easy and direct",
          "Contenu": "To do something simple, as in my case, it's very good. The chat support is quite useful when you can't find the desired option. I think they could improve certain aspects of the questionnaires."
        },
        {
          "Note": 4,
          "Lieu": "JO",
          "Pseudo": "Manar Shati",
          "Nb_Reviews": 1,
          "Date": "2022-11-23T05:12:36.000Z",
          "Titre": "Simple",
          "Contenu": "Simple, easy to use, have e-commerce advanced plans and simple marketing plan, good for starters and small businessesI am taking off one star because it doesn't have a plan for an advanced marketing website, also you need to delete your account if you don't want to receive more emails from them \" no unsubscribe button \"Otherwise it has great customer support"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Paul Nield",
          "Nb_Reviews": 2,
          "Date": "2023-03-16T13:25:45.000Z",
          "Titre": "You do better than 4 star,",
          "Contenu": "You do better than 4 star,, you should give the boys a raise,, always helpful+Can you tell me, in Russia, is the Government as corrupt m as West Australia?"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Claude Herzberg",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T15:30:17.000Z",
          "Titre": "Simplicity of website construction",
          "Contenu": "Constructing the website was less complicated than others that I tried.I do like the live chat & support"
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "سماح محمد عبد الفتاح",
          "Nb_Reviews": 1,
          "Date": "2023-07-16T22:31:34.000Z",
          "Titre": "They are amazing helpful and this site very easy to used to be beginning",
          "Contenu": "I found something different in this site. It's easy and awesome. The temples are amazing. It's very good for beginners to start our business and teamwork are helpful."
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Apurva IT",
          "Nb_Reviews": 1,
          "Date": "2023-04-13T10:55:28.000Z",
          "Titre": "Need More Option Product Wise Tax…",
          "Contenu": "Need More Option Product Wise Tax categorythis is important all the Customers Godaddy doing wellthat partand import Excel not Working need Develop immediate"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Curtis",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T18:48:02.000Z",
          "Titre": "Problem solved",
          "Contenu": "Everything started fine, but ran into some issues with establishing domain. Kept getting same message with chat help that they were escalating it to their domain team. Was told it would take 48 hours. Unfortunately, it took 240 hours (no joke) before someone on the other end finally said it will be fixed in 40 minutes -- and it was. I had already posted a negative review, and someone  from Site123 reached to make sure everything was ok (but only after negative review - I wish they had been more proactive earlier). I ran into a second issue which they checked immediately for me and it caused me to realize the situation was on my end. So, I appreciate their follow up and the matter was resolved. The only reason they don't get 5 stars is because of how long it took to get to the bottom of things."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Américo",
          "Nb_Reviews": 1,
          "Date": "2022-12-19T21:00:42.000Z",
          "Titre": "some editor functions are not very…",
          "Contenu": "some editor functions are not very practical for someone like me with little experience with editors (I'm 66years old), but with the help of support, I managed to solve it, thanks."
        },
        {
          "Note": 4,
          "Lieu": "EG",
          "Pseudo": "Ahmed Ramadan Aly Taha",
          "Nb_Reviews": 1,
          "Date": "2022-12-21T05:27:09.000Z",
          "Titre": "Good helping",
          "Contenu": "The tools are great and the tech support is very responsive.Bot one not good thing is that the font formats are not complete on all pagesAbove all; I am happy to deal with you."
        },
        {
          "Note": 4,
          "Lieu": "QA",
          "Pseudo": "noor G",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T15:34:13.000Z",
          "Titre": "More modern design template is needed…",
          "Contenu": "More modern design template is needed for the website and I'm hoping for more payment options that includes worldwide"
        },
        {
          "Note": 4,
          "Lieu": "IN",
          "Pseudo": "Alwin Thomas",
          "Nb_Reviews": 1,
          "Date": "2022-11-29T10:33:52.000Z",
          "Titre": "1 Pro 1 Con",
          "Contenu": "I'd say site123 is great but steer clear if you don't have cash to spend on their premium plans to get a domain."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Edna H.",
          "Nb_Reviews": 1,
          "Date": "2023-03-14T20:19:46.000Z",
          "Titre": "Made my first website.",
          "Contenu": "Relatively easy to use. Was able to figure most things on my own using the templets they offer.If I did get stumped on something they promptly answered my questions."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Tamara Apsitis",
          "Nb_Reviews": 1,
          "Date": "2023-02-20T03:58:22.000Z",
          "Titre": "Love the site and customer service but…",
          "Contenu": "Love the site and customer service but giving a 4 because the email service isn't good and you can't import your email list....that's a big issue...."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Abbie Elkin",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T03:44:21.000Z",
          "Titre": "It was pretty easy to use but when I…",
          "Contenu": "It was pretty easy to use but when I did have specific questions the chat team wasn’t that helpful."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Nizarat Bano",
          "Nb_Reviews": 1,
          "Date": "2023-05-12T05:08:55.000Z",
          "Titre": "I found SITE123 to be easy to use and…",
          "Contenu": "I found SITE123 to be easy to use and even when I did have an easy, the help option allowed me to move forward with the help of SITE123's IT Tech who was able to help me with very clear instructions.Thank you SITE123."
        },
        {
          "Note": 4,
          "Lieu": "NZ",
          "Pseudo": "Jackie",
          "Nb_Reviews": 1,
          "Date": "2023-02-06T04:01:01.000Z",
          "Titre": "Lucas was very helpful even though he…",
          "Contenu": "Lucas was very helpful even though he couldn't provide what I requested as we are a small non-profit group and are unable to upgrade to a paid site."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "samdub",
          "Nb_Reviews": 3,
          "Date": "2023-03-20T08:53:31.000Z",
          "Titre": "Great value and help box, but restrictive builder",
          "Contenu": "Chat box help/customer service is really good and quick the site builder is quite restrictive though, you can’t just put anything anywhere like you photos or text like you can on say wix or Squarespace, but it’s better value than those so I’m happy."
        },
        {
          "Note": 4,
          "Lieu": "DE",
          "Pseudo": "Halina Weyers",
          "Nb_Reviews": 2,
          "Date": "2023-06-20T14:58:57.000Z",
          "Titre": "I liked thw simolicity of the…",
          "Contenu": "I like the simplicity of the site/templates. It works well for what I needed, with the limited time and skillset i have in developing a website."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Noon AIN",
          "Nb_Reviews": 1,
          "Date": "2023-01-24T16:32:37.000Z",
          "Titre": "Till now it is fine",
          "Contenu": "Till it is fine .Good Supporting team as the are helping.Facilities till now are ok .. need more time to discover everything.But thank foe 123 fir such a service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Hailey",
          "Nb_Reviews": 1,
          "Date": "2023-04-10T00:51:13.000Z",
          "Titre": "I love site123!",
          "Contenu": "I love site123!! It works so perfectly for my business. They get back to you so quickly if you have and questions and are always willing to help. The only problem I had was that so fetchers don't work on my iPad. Overal amazing and recommend highly!"
        },
        {
          "Note": 4,
          "Lieu": "HR",
          "Pseudo": "KLAUDIO JURIČIĆ",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T13:14:21.000Z",
          "Titre": "Simple to use.",
          "Contenu": "Simple to use.Very good support.Quick response when solving problems.There are limitations with the editor of some pages, i.e. the editor on all pages does not have the same options.On the content page in the editor, I cannot insert an image into the table."
        },
        {
          "Note": 4,
          "Lieu": "CZ",
          "Pseudo": "manar fraihat",
          "Nb_Reviews": 2,
          "Date": "2023-06-12T14:25:38.000Z",
          "Titre": "More details about your servic like a…",
          "Contenu": "More details about your servic like a tutorial have a step by step I just start with you i would like to know more about your site to make another feedback later Thanks"
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Des Lanham",
          "Nb_Reviews": 1,
          "Date": "2023-03-18T04:15:18.000Z",
          "Titre": "The decision to go with SITE123 was not…",
          "Contenu": "The decision to go with SITE123 was not a hasty one. Being in Australia I was primarily looking for an Aussie organization to fill my requirements. This was to be my first web site. I found SITE123 to be different to anywhere else. There web based app was very intuitive and free which was very attractive. Sure it's not perfect but my skills aren't either. Being an older person (approaching 80) my short term memory isn't what  it used to be but I found that what I needed to do in compiling a website was easy to follow. As I got into it more ideas started happening. The result turned out to be better than I expected it to be. The cost factor was very important as I was compiling the website for my  small local Presbyterian Church without a budget. Using my own limited resources I opted for the 5 year Professional deal which was surprisingly cost affective.Nothings perfect hence the 4 star review and some of the staff need to get a few more lessons on customer relation but I generally ignored that having been in sales myself for many years. We all have bad days. I was to use a domain that I had previously purchased wanting to get a site in the new .au TLD. I had no Idea how to transfer it but I was talked through it in an efficient manner.  Yes, I would rate SITE123 as a candidate for your short, It came out tops for me it could well be the same for you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greg Koehn",
          "Nb_Reviews": 1,
          "Date": "2023-07-15T22:40:00.000Z",
          "Titre": "So far everything is fine",
          "Contenu": "So far everything is fine, I still have more questions concerning my site and will seek to fine answers on Monday."
        },
        {
          "Note": 4,
          "Lieu": "AU",
          "Pseudo": "Radhika Kulhalli",
          "Nb_Reviews": 1,
          "Date": "2023-09-09T07:52:02.000Z",
          "Titre": "I am first time blog creator",
          "Contenu": "I am first time blog creator.  So don't know much about it.  But I get online help quickly whenever I ask any question, so makes it easy for me. Thank you"
        },
        {
          "Note": 4,
          "Lieu": "SA",
          "Pseudo": "عبدالعزيز محمد",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T14:04:19.000Z",
          "Titre": "After the ease of usingcustomer service the site",
          "Contenu": "After the ease of using the site, the quick and effective dealing with customer service is what I liked the most."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David F Bishop",
          "Nb_Reviews": 4,
          "Date": "2022-12-13T16:41:29.000Z",
          "Titre": "Customer service was quite prompt in…",
          "Contenu": "Customer service was quite prompt in responding to my questions,  efficient in that they knew exactly the problem and solution,  and hence quite helpful."
        },
        {
          "Note": 4,
          "Lieu": "KZ",
          "Pseudo": "Yersultan Kuletov",
          "Nb_Reviews": 1,
          "Date": "2023-02-17T10:20:21.000Z",
          "Titre": "It's easy to create site using this…",
          "Contenu": "It's easy to create site using this service. But i don't like limits to paste custom code. Not much space at all for creativity"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "HItutu",
          "Nb_Reviews": 2,
          "Date": "2023-03-01T20:44:11.000Z",
          "Titre": "Very reponsive with helpful tutorials",
          "Contenu": "Very reponsive with helpful tutorials, but program is lacking some elements that would make life easier, like text wrap. Instructions are not always intuitive."
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Eco Biz SA",
          "Nb_Reviews": 1,
          "Date": "2023-04-11T10:01:16.000Z",
          "Titre": "I love that the website was so easy to…",
          "Contenu": "I love that the website was so easy to set up. Would love to see more (optional) integration with dropshipping companies."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rita Rumgay",
          "Nb_Reviews": 1,
          "Date": "2023-05-02T13:46:22.000Z",
          "Titre": "I had a little difficulty with framing…",
          "Contenu": "I had a little difficulty with framing my books. It cut the top it off and I couldn’t fix it if you could look at that and fix it for me I would appreciate it."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "James D Gillespie",
          "Nb_Reviews": 2,
          "Date": "2023-04-08T19:18:46.000Z",
          "Titre": "Easy web site construction",
          "Contenu": "Easy web site construction using intuitive methods. Many templates to choose from. Blogs are easy to implement"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Jed",
          "Nb_Reviews": 1,
          "Date": "2023-06-11T17:30:39.000Z",
          "Titre": "you guys are one of the best Iv ever…",
          "Contenu": "you guys are one of the best Iv ever seen in my whole life you should be very proud of yourselves. there were a few bumps along the way, but you guys are all goats in the end. ill be sure to suggest your company to my friends."
        },
        {
          "Note": 4,
          "Lieu": "TZ",
          "Pseudo": "Ushauri Biashara",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T10:27:21.000Z",
          "Titre": "Makes it easy to develop and scale",
          "Contenu": "Makes it easy to develop and scale. You have been responsive to my inquiries as well."
        },
        {
          "Note": 4,
          "Lieu": "AE",
          "Pseudo": "Sandeep Shrestha",
          "Nb_Reviews": 1,
          "Date": "2023-01-13T12:01:11.000Z",
          "Titre": "Response time and clear guidance",
          "Contenu": "Response time and clear guidance! I rated only 4 stars because I want team to keep on doing improvement to become the best in all aspects."
        },
        {
          "Note": 4,
          "Lieu": "SK",
          "Pseudo": "OneZ",
          "Nb_Reviews": 1,
          "Date": "2023-02-02T18:59:53.000Z",
          "Titre": "I have some problems about…",
          "Contenu": "I have some problems about fonts...somewhere cannot change font size, cannot add hyperlinks ...."
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "Uyanwa Chinonso Andrew",
          "Nb_Reviews": 1,
          "Date": "2023-01-05T00:06:41.000Z",
          "Titre": "I love the way u flow with ur clients…",
          "Contenu": "I love the way u flow with ur clients and also ur website offers but can u make a user to access his/her personal site easily on the app."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sunny",
          "Nb_Reviews": 1,
          "Date": "2023-01-31T15:19:22.000Z",
          "Titre": "Slow but Efficient",
          "Contenu": "I already took this review, but I'll do it again - once!The agent was VERY helpful and knowledgeable.  It just took a while to answer.  I found the process slow but efficient."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Website User",
          "Nb_Reviews": 5,
          "Date": "2022-11-19T11:27:32.000Z",
          "Titre": "Good value for money",
          "Contenu": "Good on line support for novice website builders - easy to design and looks good on screen and for mobiles - prompt and efficient/knowledgeable agents - very pleased with final result."
        },
        {
          "Note": 4,
          "Lieu": "BR",
          "Pseudo": "Raffael Amaral",
          "Nb_Reviews": 1,
          "Date": "2023-04-28T16:36:18.000Z",
          "Titre": "It's easy to make a website",
          "Contenu": "It's easy to make a website, but doesn't have a day to you drop a component that you want and just edit it. You just can drop a full layout."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Stephen Aikins",
          "Nb_Reviews": 3,
          "Date": "2023-06-11T03:46:19.000Z",
          "Titre": "The exprience was not the best in the…",
          "Contenu": "The exprience was not the best in the beginning but the staff and robbot system have been helpful in addressing some the challenges faced."
        },
        {
          "Note": 4,
          "Lieu": "HK",
          "Pseudo": "Ocean Wong",
          "Nb_Reviews": 1,
          "Date": "2023-04-24T09:13:01.000Z",
          "Titre": "It great Template and Layout design",
          "Contenu": "It great Template and Layout design, is easy to use, and have a very responsive support team."
        },
        {
          "Note": 4,
          "Lieu": "RO",
          "Pseudo": "Veronel",
          "Nb_Reviews": 2,
          "Date": "2023-10-19T15:38:51.000Z",
          "Titre": "Was OK..",
          "Contenu": "Was OK... I found information, I got answer quickly"
        },
        {
          "Note": 4,
          "Lieu": "ZA",
          "Pseudo": "Courage Gurende",
          "Nb_Reviews": 1,
          "Date": "2023-05-26T22:33:19.000Z",
          "Titre": "nice having you",
          "Contenu": "every thing was great i could link my domain with google ads which is what i wanted, to reach more clients"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "valerie hallman-roth",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T15:41:26.000Z",
          "Titre": "So far the support has been excellent",
          "Contenu": "So far the tech support has been your company's “standout” for me! My only hesitation in not giving you a 5-star rating is the technical limitation of not being able to adjust the size (visually) of the Soundcloud icons on my site. They look disproportionately huge... and subsequently the imported picture on the sound clip (despite importing the highest resolution possible) becomes blurry. Ohhh darn! This takes away from the polished, professional look of my site. Otherwise, great work all —easy to edit, navigate and attain support! Well done. Val"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Mr Graham Bright",
          "Nb_Reviews": 15,
          "Date": "2023-12-18T10:15:51.000Z",
          "Titre": "Had a couple of issues that I could not…",
          "Contenu": "Had a couple of issues that I could not sort myself, due to not having much built previous web sites.Sorted immediately by their online chat team. ***** From me..."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Firozali Malik",
          "Nb_Reviews": 3,
          "Date": "2023-12-14T23:01:54.000Z",
          "Titre": "Honesty",
          "Contenu": "Honesty, from my side as I write, the Company is performing what it says. So far I am very happy how they assist the customers/clients. Personnel are good and sincere. Thank you all."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MyDMCoaching",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T21:25:19.000Z",
          "Titre": "I love site123",
          "Contenu": "I love site123.  I have had so many questions and they are ALWAYS there.  Voice calls and online chat have been so helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maria",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T07:54:36.000Z",
          "Titre": "I have tried more times that I care to…",
          "Contenu": "I have tried more times that I care to admit to build my own site this is the only one I have been able to get past naming the site I have never been able to post anything until Site123 if you are not a techy like me try them out their customer service gets back to you in a reasonable time."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Margo",
          "Nb_Reviews": 1,
          "Date": "2023-12-06T17:37:16.000Z",
          "Titre": "The Site123 website builder is so easy…",
          "Contenu": "The Site123 website builder is so easy to use, and if you have questions, help is readily available vs chat. I'd used Site123 on a couple of previous sites, so was already familiar with how it worked. The template features parallax and responsible design, displays great on all devices, and unlike many other website builders, its template provides just about any option you can imagine, from blogs and about and team pages to ecommerce and video. I took advantage of discount pricing and signed up for two years. Using Site 123, my website looks so much better!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ellen Rickel",
          "Nb_Reviews": 1,
          "Date": "2023-12-18T21:40:29.000Z",
          "Titre": "Easy to setup",
          "Contenu": "I love the fact that everything is template based and very easy to understand."
        },
        {
          "Note": 5,
          "Lieu": "MT",
          "Pseudo": "Gesco Group International",
          "Nb_Reviews": 2,
          "Date": "2023-12-13T20:28:52.000Z",
          "Titre": "Very Good support from day one",
          "Contenu": "Very Good support from day one. Always clear and find the best options to my questions. I will highly recommended"
        },
        {
          "Note": 5,
          "Lieu": "DE",
          "Pseudo": "Tanja",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T18:22:09.000Z",
          "Titre": "Fast help even on Sunday",
          "Contenu": "I dind't use the web site builing tool for a while and needed some help in how to preview prior to putting the site on air- and the help came quickly even on a Sunday. Really enjoyed this part of my customer journey."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "convicusine.com",
          "Nb_Reviews": 1,
          "Date": "2023-11-29T15:52:28.000Z",
          "Titre": "relatively intuitive and excellent value",
          "Contenu": "When using SITE123 for the first time, the website build was relatively intuitive, and when you need assistance, the help is excellent. This is by far one of the easiest platforms to build a site. The hosting costs are excellent value. Once you are used to the build method, you could use this platform to build plenty of websites in a week."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Helen",
          "Nb_Reviews": 1,
          "Date": "2023-12-17T12:10:09.000Z",
          "Titre": "Excellent",
          "Contenu": "Easy to navigate in the site andExcellent support for small businesses"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elizabeth",
          "Nb_Reviews": 7,
          "Date": "2023-11-30T17:56:38.000Z",
          "Titre": "My best experience building a website so far",
          "Contenu": "The customer service for Site123 is superb. I am finishing up my website and I have had to use them several times. They respond almost immediately and every time they solved my problem. This is the easiest website platform I have used and could not be happier!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Firozali Malik",
          "Nb_Reviews": 3,
          "Date": "2023-11-30T18:02:57.000Z",
          "Titre": "As soon as I log in",
          "Contenu": "As soon as I log in, the customer support team member is on line asking if any help is needed. Your support team is very professional and that is what your members want and need. Thank you all and with kind regards."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "ماهر الجعيد",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:48:28.000Z",
          "Titre": "Really amazing",
          "Contenu": "I thank you all for your cooperation and quick response to us"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "DC",
          "Nb_Reviews": 1,
          "Date": "2023-12-20T17:01:35.000Z",
          "Titre": "Great customer service and the web…",
          "Contenu": "Great customer service and the web builder is fantastic"
        },
        {
          "Note": 5,
          "Lieu": "CN",
          "Pseudo": "Jane Zheng",
          "Nb_Reviews": 1,
          "Date": "2023-12-12T07:51:25.000Z",
          "Titre": "Easy to build a web use site 123",
          "Contenu": "Easy to build a web use site 123, service is in time also, thanks for services, I will share with my friends"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Cook",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T12:56:20.000Z",
          "Titre": "I wanted to know why my link to my…",
          "Contenu": "Update on review yes I was not happy with not receiving an email since the email they verified with me was correct. I received the email to correct my issue. Thank you Thoams for getting my issue resolved.I wanted to know why my link to my website wasn’t working. I was told that it wasn’t verified. I was told an email was sent but never received that email. I was told another email would be sent in which I never received the second email regarding to verify the domain. Not happy that I paid money to build a website and get a domain name. Not happy with the customer support."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "MRSLINDSEYDAVIES",
          "Nb_Reviews": 2,
          "Date": "2023-12-07T12:53:31.000Z",
          "Titre": "Helpline brilliant as a 65 year old…",
          "Contenu": "Helpline brilliant as a 65 year old found building my online shop not so daunting with help"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Saeid Kondori",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T23:06:10.000Z",
          "Titre": "New experimental ahead …",
          "Contenu": "Gary who is building my website is a great guy and honest and looking forward to see how my website will be handled for coming years."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Danjuma",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T17:09:15.000Z",
          "Titre": "SITE 123 is exceptionally good",
          "Contenu": "SITE 123 is exceptionally good I’m creating my own website in the most simplified way ever and I’m very grateful.I will patronize this any time,as long as the value remains"
        },
        {
          "Note": 5,
          "Lieu": "SK",
          "Pseudo": "Mosha",
          "Nb_Reviews": 1,
          "Date": "2023-11-07T00:06:58.000Z",
          "Titre": "Their support and customer service is great!",
          "Contenu": "I just purchased my package, and I'm going to start working on my website. The reason that i chose Site123 is some of my friends recommended it, and based on my experience with them so far is their support and customer service is amazing. They asked me couple times if i need any help or any other questions to be answered. Keep it up that way 👏 👌"
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Gonzalo Gomez Sala",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T13:48:58.000Z",
          "Titre": "Frankly I am delighted with the experience",
          "Contenu": "Frankly I am delighted with the experience of building and publishing a website with Site123. I am not a computer expert and I have reached the end without difficulty thanks to the quick support of the chat.A major improvement is that language flags could appear on a mobile user's first page. It is difficult to find it in the bars and users who do not understand the default language abandon the website"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Natalie M",
          "Nb_Reviews": 5,
          "Date": "2023-11-13T15:39:41.000Z",
          "Titre": "Excellent",
          "Contenu": "Excellent. Very helpful. Any questions and you were prompt to help me. I made a lovely website by-myself with kind and helpful information from you guys. A lovely experience as didn’t think I would be able to do such a great job! Thanks a lot. Natalie"
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "sabina",
          "Nb_Reviews": 1,
          "Date": "2023-10-25T13:07:48.000Z",
          "Titre": "excellent customer support",
          "Contenu": "Customer support is amazing; always available, friendly, fast and knowledgeable! Helped me from the beginning with the ideal layout picking to its customization options and possibilities. Not to mention that they took it upon themselves to handle the domain setup and plugin activation. By doing so they saved me a lot of time and i got exactly what i wanted.Thank you again!"
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "Arie",
          "Nb_Reviews": 1,
          "Date": "2023-12-09T10:41:42.000Z",
          "Titre": "The tool is great for creating small sites",
          "Contenu": "The tool is great for creating small site for exposure your companhy"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Idrissi Joutei",
          "Nb_Reviews": 1,
          "Date": "2023-12-21T16:29:58.000Z",
          "Titre": "Best for the best & nothing but the…",
          "Contenu": "Best for the best & nothing but the best only for the best. Thank you"
        },
        {
          "Note": 5,
          "Lieu": "GR",
          "Pseudo": "George S",
          "Nb_Reviews": 3,
          "Date": "2023-10-23T08:01:59.000Z",
          "Titre": "Site123 offers a very friedly environment for people who have no previous expirience on web development and they ant a fast solution with no code skills",
          "Contenu": "Site123 offers a very friedly environment as to create a web site very fast. The iterface is very friedly and all procedures are made as to help anyone with no previous expirience to built a beatifull website in min not hours or days. After spending many hours looking for a real friedly product as web builder i suggest the site123 for anyone who wants a fast development with great results!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Takisha",
          "Nb_Reviews": 3,
          "Date": "2023-12-08T14:27:04.000Z",
          "Titre": "I love Site 123 and they have proven to…",
          "Contenu": "I love Site 123 and they have proven to be driving force for my small business in many ways."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dennis K. Brown",
          "Nb_Reviews": 2,
          "Date": "2023-11-08T06:55:52.000Z",
          "Titre": "I did it myself, with their help.",
          "Contenu": "Prompt service, a nice product and a professional outcome. A complete package with domain name, construction of website and great support….I am extremely satisfied. Thank you Site123!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Patrick Buck",
          "Nb_Reviews": 5,
          "Date": "2023-10-22T18:25:25.000Z",
          "Titre": "Excellent site",
          "Contenu": "For once a site that lived up to its billing.  Thoroughly recommended for someone who wants to build a website who has limited technical knowledge.  The online help was the best I have experienced"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rodolfo",
          "Nb_Reviews": 1,
          "Date": "2023-11-22T00:54:05.000Z",
          "Titre": "To be honest......site123 is amazing 👏…",
          "Contenu": "To be honest......site123 is amazing 👏 I love the way they have their settings set up and they are better than any free website builder."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephanie McLerran",
          "Nb_Reviews": 1,
          "Date": "2023-12-11T15:44:57.000Z",
          "Titre": "Thank you for the clear and helpful…",
          "Contenu": "Thank you for the clear and helpful instructions."
        },
        {
          "Note": 5,
          "Lieu": "MU",
          "Pseudo": "Chad and Klara",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T06:49:41.000Z",
          "Titre": "Simply the best for most everyone",
          "Contenu": "Great site builder, not as many features of some of the more expensive services out there but for 90% of the people that want a great looking functional site with a minimum of trouble this is it. And, the customer service guys are the best in the business.  Period."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Renna Shesso",
          "Nb_Reviews": 1,
          "Date": "2023-09-02T07:34:46.000Z",
          "Titre": "My questions? ANSWERED! :D",
          "Contenu": "My questions - I think there were three different ones - were each responded to quickly and clearly, so I could go forward: importing my subscribers list, making some site changes, and sending out my first SITE123-created email. Success! I'm very pleased with the customer service."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Croft",
          "Nb_Reviews": 1,
          "Date": "2023-09-14T22:27:25.000Z",
          "Titre": "WOW!  Incredible Experience!",
          "Contenu": "WOW!  Your site is the State of the Art in designing and hosting a website!  You are light years ahead of all the competition that relies heavily on programing or coding knowledge!  You made my experience fun and quick.  Your Sales Department, especially Gary Mohan, is the best in the business when it comes to understanding what I was looking for and what I needed!  I've tried many others and you are the BEST!!!"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "VAN-SYSTEM",
          "Nb_Reviews": 1,
          "Date": "2023-12-02T16:37:18.000Z",
          "Titre": "Your help is so rapid and after your…",
          "Contenu": "Your help is so rapid and after your intervention everithing was ok"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Robert Powell",
          "Nb_Reviews": 5,
          "Date": "2023-07-28T14:34:54.000Z",
          "Titre": "definitely the easiest web design tool",
          "Contenu": "i did a bit of shopping around before settling on site 123. i have recently taken my small builders company online and only needed a simple website, after using Wordpress, Grow and squarespace Site123 was by far the most straight forward. after choosing a template the website was more or less complete for what i needed the rest was very intuitive. the couple of questions i did have were answered almost immediately by a human. cannot recommend this site enough!"
        },
        {
          "Note": 5,
          "Lieu": "NL",
          "Pseudo": "Liliana  Molina",
          "Nb_Reviews": 2,
          "Date": "2023-11-21T11:30:20.000Z",
          "Titre": "I love this platform",
          "Contenu": "I love this platform! highly recommended: so easy, beautiful and a kind team always ready to help you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Emilie Juliet",
          "Nb_Reviews": 3,
          "Date": "2023-08-29T19:18:38.000Z",
          "Titre": "This is made by kind people!",
          "Contenu": "They are made by kind people, only after about half an hour, they replied to questions and yes it's truly free. I asked how to customize a feature I couldn't find and they sent an easy tutorial telling me a clear idea of how to. Now I am close to publishing an amazing website, I would recommend!!"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Qaisar Munir",
          "Nb_Reviews": 1,
          "Date": "2023-09-20T17:00:41.000Z",
          "Titre": "Good service but I feel something need…",
          "Contenu": "Good service but I feel something need more features like,_You can work werity of more website thems/template _Do you need work one more features like customised multiple Latter Head & Invoices templates_when we transfer a website to clients as an expert program partner when we need an option transfer website with a domain or without doman to clients transfer (ex: 1_Do you want transfer website to clients with Domain 2_Do you want transfer website to clients without Domain)"
        },
        {
          "Note": 5,
          "Lieu": "MA",
          "Pseudo": "Hamid",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T01:35:20.000Z",
          "Titre": "No need to be a master!",
          "Contenu": "You don't need to be a master to create your website, all you need is gather your content and go to site123.com. I made my website in some days and now it's online, and all people that visited find it very professional and efficient!!!Of course I would like to find some features. I'll share with team and I'm sure they will update."
        },
        {
          "Note": 5,
          "Lieu": "BR",
          "Pseudo": "Jhonatan da Costa Leite Piment",
          "Nb_Reviews": 1,
          "Date": "2023-11-12T02:28:39.000Z",
          "Titre": "When you already have the website…",
          "Contenu": "When you already have the website domain, the plan should be cheaper or create a free policy with advertising the website123 in the footer."
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Ivo Taksic",
          "Nb_Reviews": 1,
          "Date": "2023-11-04T16:11:00.000Z",
          "Titre": "Amazing work experience",
          "Contenu": "Amazing work experience, great Web sites and customer support is always helpful and fast! The best Web site builder I have found on the Internet in 30 years!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jorge R Ortiz Jr",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T04:06:51.000Z",
          "Titre": "So helpful I had no choice but to get my site up",
          "Contenu": "So I started as I did on other sites but just never maintained interest to finish, but Daniel called, and called, and called, not in a way that was bothersome but in a way that motivated me to get it done. And he was always offering to help every step of the way, but his persistence made me want to match his willingness to help me get it done. I honestly dont know if I would have finished it without his persistence to help me and nudge me along. Even the tech guys that helped me connect my domain and get the site up and running were top notch but Thank u Daniel. Don't know if I would have gotten it done - at least no time soon without ur persistent and kindness in motivating me to get it done. Top notch all around...!!!"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Dan Monaghan",
          "Nb_Reviews": 1,
          "Date": "2023-12-14T15:11:24.000Z",
          "Titre": "Very simple to use but quality outcome"
        },
        {
          "Note": 5,
          "Lieu": "MY",
          "Pseudo": "Patrick Teh",
          "Nb_Reviews": 1,
          "Date": "2023-08-03T14:39:18.000Z",
          "Titre": "I somehow love this simple and ingenious website builder",
          "Contenu": "1. Quite easy to build a basic website.2. The auto-generated proposed business description according to our text input is very helpful.3. Adding landing pages and additional pages, and images were quite simple for me after a few tries.4. Customer service, even though I am looking to establish a free website hosting, is very prompt."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken K",
          "Nb_Reviews": 2,
          "Date": "2023-08-08T01:12:55.000Z",
          "Titre": "Things take time...",
          "Contenu": "Can't say everything was great immediately, it just took longer than I thought it would. Being new at this did not help, however after the initial bumps and failure to come up to speed as fast as I thought it should, everything is now great! The website builder is outstanding and very easy to navigate. We are online and it has met and excided our expectations..."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Cathy",
          "Nb_Reviews": 1,
          "Date": "2023-12-04T09:15:21.000Z",
          "Titre": "The website builder your best choice",
          "Contenu": "The website builder , site123.com , is really a great guide for a beginner ."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Perla Mansour",
          "Nb_Reviews": 1,
          "Date": "2023-08-25T22:15:55.000Z",
          "Titre": "Great for artists websites!",
          "Contenu": "Very easy structure and templates to follow, with a lot of options to be creative and make it truly your own. Assistance and help provided within minutes of an inquiry, it really helped me make quick progress on building my artist website."
        },
        {
          "Note": 5,
          "Lieu": "ZA",
          "Pseudo": "Rebekka Liebenberg",
          "Nb_Reviews": 1,
          "Date": "2023-08-13T02:48:35.000Z",
          "Titre": "The main reason why this site works…",
          "Contenu": "The main reason why this site works well for me is that the support features actually work. So far, the agents have been fast to respond and have given me loads of helpful information. There are some features that would be even better with some tweaking, and I hope that the feedback site owners offer will be taken into consideration. I love that it was so easy for me to build a site in one weekend - given that I only just figured out what a plug in is ... I think...."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "thierry hervo",
          "Nb_Reviews": 1,
          "Date": "2023-10-02T21:02:32.000Z",
          "Titre": "great website solution",
          "Contenu": "quite easy to use, most of the needs are covered with a solution. Not always obvious to discover, but we benefit from a real great support which answer very quickly"
        },
        {
          "Note": 5,
          "Lieu": "UA",
          "Pseudo": "Tetiana Tsyhankova",
          "Nb_Reviews": 1,
          "Date": "2023-08-15T13:17:30.000Z",
          "Titre": "Thank you very much for my positive experience!",
          "Contenu": "Thank you very much for my positive experience and I am very happy with the result of my page. The support service works very professionally, and I quickly received all the advice and answers.I plan to pay for a future business plan. For now, I'll make additions to the layout and see how it works.  I wish everyone a good day!"
        },
        {
          "Note": 5,
          "Lieu": "PH",
          "Pseudo": "Jan Kenneth Hansen",
          "Nb_Reviews": 2,
          "Date": "2023-09-17T07:09:31.000Z",
          "Titre": "Super easy to use + great for SEO",
          "Contenu": "For the past 6 months I've created about 30 websites with site123 for guest posting. It's super easy to use, and the sites are hightly mobile optimized. I just wish they had more table solutions for affiliate sites."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Corinne",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T03:17:39.000Z",
          "Titre": "By far the easiest of all the websites I searched to create a website for my business!",
          "Contenu": "EXCEPTIONAL service by far!  The support team answered by questions online within 2 min!  Can you believe that. SUPERIOR customer service.  I have left 1and1 and will stay with Site123 :)"
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Rebondlire Roussillonnais",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T15:10:33.000Z",
          "Titre": "Though it was my first attempt at…",
          "Contenu": "Though it was my first attempt at building a site and though I'm far from being a computer scientist, it was an easy enough experience. I was provided with adequate tips and very clear explanations. I would not hesitate to recommend using 1,2,3 even to beginners like myself."
        },
        {
          "Note": 5,
          "Lieu": "RO",
          "Pseudo": "Alchemyhealing.org",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T19:16:18.000Z",
          "Titre": "Absolutely impressed with the quality…",
          "Contenu": "Absolutely impressed with the quality of assistance and support.Very easy to use and very professional!Thank you very much!!!"
        },
        {
          "Note": 5,
          "Lieu": "PL",
          "Pseudo": "mab",
          "Nb_Reviews": 3,
          "Date": "2023-11-09T12:44:15.000Z",
          "Titre": "They care about each case…",
          "Contenu": "I felt that the support actually cared about helping. I would compare it to Apple support (that's a compliment)."
        },
        {
          "Note": 5,
          "Lieu": "PA",
          "Pseudo": "melissa",
          "Nb_Reviews": 1,
          "Date": "2023-08-11T16:01:27.000Z",
          "Titre": "I have cero experience on website…",
          "Contenu": "I have cero experience on website design, so for me having  a good customer support was very important.  They answered all my questions very fast and where the key element I needed for my website.  I have absolutely nothing bad  to say about my experience. Fast, easy and lovely designs.   I totally recommend it!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "SmallVanCampers",
          "Nb_Reviews": 1,
          "Date": "2023-10-21T03:36:57.000Z",
          "Titre": "Best of the Best",
          "Contenu": "Quick loading, super fast customer service, no glitches, reasonable cost snd user friendly.   Doesn't get any better."
        },
        {
          "Note": 5,
          "Lieu": "MW",
          "Pseudo": "Fedoma",
          "Nb_Reviews": 1,
          "Date": "2023-11-05T16:37:32.000Z",
          "Titre": "I found out that the website builder is…",
          "Contenu": "I found out that the website builder is very easy to use and was able to develop the website within a few hours and can custom my ideas accordingly"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Vickie",
          "Nb_Reviews": 4,
          "Date": "2023-08-04T07:44:40.000Z",
          "Titre": "Great, intuitive, fast",
          "Contenu": "After struggling for months trying to set up a website with a couple of other website design sites, I tried site123 and was amazed at how easy the site was to navigate! Managed to get my new website up and running in a morning and I am really happy with the results!"
        },
        {
          "Note": 5,
          "Lieu": "LT",
          "Pseudo": "andrej frizel",
          "Nb_Reviews": 1,
          "Date": "2023-11-11T17:48:23.000Z",
          "Titre": "super",
          "Contenu": "It is very easy to model on your own, and if something does not work out, the help group is always there 24/7."
        },
        {
          "Note": 5,
          "Lieu": "HU",
          "Pseudo": "Dániel Mészáros",
          "Nb_Reviews": 1,
          "Date": "2023-08-22T22:01:17.000Z",
          "Titre": "Wonderful",
          "Contenu": "Very kind and pratical support, you get immediately help from them. You can discuss with your problem with true people who know what do you need. I recommend it truly for everyone."
        },
        {
          "Note": 5,
          "Lieu": "SL",
          "Pseudo": "Jeff Iorwuese Ndzughul",
          "Nb_Reviews": 1,
          "Date": "2023-08-10T11:48:01.000Z",
          "Titre": "I Never give up",
          "Contenu": "What makes my experience great is that even at difficult moments in business I never give up at anytime. I have learned from it. The company is doing well at her best in order deliver good service to clients."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "logan",
          "Nb_Reviews": 1,
          "Date": "2023-11-30T22:14:45.000Z",
          "Titre": "very good",
          "Contenu": "they have a very usable and easy site maker and alwase know what to do for help"
        },
        {
          "Note": 5,
          "Lieu": "MW",
          "Pseudo": "Doreen Tembo",
          "Nb_Reviews": 1,
          "Date": "2023-10-10T14:19:39.000Z",
          "Titre": "I am impressed with how easy it is to design a website and the support…",
          "Contenu": "I am impressed with how easy it is to come up with a website in just minutes or hours. The support is just wow; I always like how you are available 24/7 to address all questions and resolve all my issues. Keep it up"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nadia Ramadan",
          "Nb_Reviews": 2,
          "Date": "2023-08-28T19:25:56.000Z",
          "Titre": "A Great place for designing stunning Websites",
          "Contenu": "I am a Multimedia Graphic Designer, and using SITE 123 was a great help to me in designing great websites for my clients. From tools to stunning graphics, this is your go-to place for your imagination to run wild."
        },
        {
          "Note": 5,
          "Lieu": "CL",
          "Pseudo": "Rolando A. Vargas",
          "Nb_Reviews": 1,
          "Date": "2023-09-29T10:32:19.000Z",
          "Titre": "Cost/Benefit can't be better",
          "Contenu": "It has all we need, in one site. Domain, webhosting, webpage frames are great and easy to handle, emailing works great, capacity and speed are enough, the cost worth it and the guys at help desk chat...just amazing"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "MIPC",
          "Nb_Reviews": 1,
          "Date": "2023-07-29T08:05:21.000Z",
          "Titre": "Thanks to all the Site123 team",
          "Contenu": "I am a volunteer web site administrator with a voluntary conservation group in Australia who moved to Site123 from another web host.  The knowledge of staff and ability to respond in a timely manner to get us up and running was an order of magnitude better than our previous host. I was initially skeptical of a web host where one cannot move the content of the web sit to another host, but am now a big fan of the web development software. I accidentally paid for a subscription for an account I didn't mean to and the refund was issued immediately even though all my own fault.  Such a relief to find these guys."
        },
        {
          "Note": 5,
          "Lieu": "NZ",
          "Pseudo": "Clyde Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-11-09T05:30:04.000Z",
          "Titre": "Fast response to questions",
          "Contenu": "Fast response to questions. Easiest site to use and edit and only site i could find for dedicated Rental"
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Steve B",
          "Nb_Reviews": 1,
          "Date": "2023-08-12T12:45:12.000Z",
          "Titre": "Being a luddite when it comes to tech I…",
          "Contenu": "Being a luddite when it comes to tech I was amazed how easy site123 makes making your own website and the support is spot on, so if you're like me and devoid of such skills I recommend you use these guys.Steve B."
        },
        {
          "Note": 5,
          "Lieu": "NG",
          "Pseudo": "Instameg",
          "Nb_Reviews": 1,
          "Date": "2023-09-06T07:59:57.000Z",
          "Titre": "Very good site for website design I…",
          "Contenu": "Very good site for website design I recommended it to anyone who want to build a website....But the management should try to increase the number of plugin and layout on the platform... thanks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cindy S",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T22:35:56.000Z",
          "Titre": "Simple enough for a novice",
          "Contenu": "I was able to create a website for the first time ever with SITE123. I had a bit of a learning curve at first, but nothing was too difficult to figure out. I appreciated how simple it is to import graphics. There was no need to resize mine or tweak the color palettes. It looks great."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Deborah",
          "Nb_Reviews": 34,
          "Date": "2023-08-05T16:38:06.000Z",
          "Titre": "wonderful",
          "Contenu": "i have to say i was very apprehensive about using this site , but i was so wrong. absolutely amazing. i have tried a few in the past but they were just to complicated. this was just wonderful, and the on line help was fantastic, love the fact you can change things to suit yourself"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kristle Harris-Huynh",
          "Nb_Reviews": 1,
          "Date": "2023-09-18T23:26:49.000Z",
          "Titre": "Easy to Use and Amazing Customer Service",
          "Contenu": "The website is really easy to use and the customer service so far has been amazing hands down! Everyone has been very professional and kind regarding the process."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Maria Potempski",
          "Nb_Reviews": 1,
          "Date": "2023-08-26T18:10:33.000Z",
          "Titre": "Your team excellent",
          "Contenu": "Your team. Helpful. Knowledgeable and speak plain English easy to understand and kind for someone who has never built a website before"
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "maria",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T11:31:18.000Z",
          "Titre": "Amazing",
          "Contenu": "It is perfect"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jenny L",
          "Nb_Reviews": 1,
          "Date": "2023-10-01T00:53:12.000Z",
          "Titre": "The site is super dummy proof",
          "Contenu": "I am the least technologically inclined person, but The site is super easy to use and if you need an agent to help they are always there"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anuoluwakitan Okuwobi",
          "Nb_Reviews": 1,
          "Date": "2023-10-03T02:10:21.000Z",
          "Titre": "Best website ever!",
          "Contenu": "This website has helped me to create a website which will make millions and I thank the people who helped me through the journey through this website, my best regards to this website."
        },
        {
          "Note": 5,
          "Lieu": "SA",
          "Pseudo": "Penguin",
          "Nb_Reviews": 1,
          "Date": "2023-11-21T12:30:49.000Z",
          "Titre": "Easy and beautiful website",
          "Contenu": "Easy and beautiful website, good and fast people helping you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Kath parsons",
          "Nb_Reviews": 7,
          "Date": "2023-09-10T10:06:42.000Z",
          "Titre": "Loving making my website",
          "Contenu": "I've loved building my website. My husband got me started and I've tweaked and added my stock. If I've had a query the on line chat service is second to none! Quick response,  and very helpful. So far I'm a bit addicted to doing the website as its quite easy, but help when needed. It's all just great! Thank you"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Aaron Angel",
          "Nb_Reviews": 1,
          "Date": "2023-10-05T18:58:22.000Z",
          "Titre": "Benjamin was awesome!",
          "Contenu": "Benjamin was awesome! He directed me to the right area and included a visual to make it a lot easier. thanks so much, very helpful!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca Cumbee",
          "Nb_Reviews": 2,
          "Date": "2023-08-02T14:57:20.000Z",
          "Titre": "Easy to build an impressive and functional website",
          "Contenu": "Couldn’t believe how easy it was to build a fantastic looking website. I chatted for help on a few things and it was incredibly quick and accurate advice."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Festus",
          "Nb_Reviews": 1,
          "Date": "2023-11-28T02:44:59.000Z",
          "Titre": "Everything is perfectly fine especially…",
          "Contenu": "Everything is perfectly fine especially customer support and user friendly service"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia",
          "Nb_Reviews": 1,
          "Date": "2023-08-08T14:41:20.000Z",
          "Titre": "Site 123 has delivered according to…",
          "Contenu": "Site 123 has delivered according to their promise. With 247 customer care. Thank you. Your services so far has been top notch. I will definitely spread the news."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "john",
          "Nb_Reviews": 6,
          "Date": "2023-11-25T17:09:13.000Z",
          "Titre": "123 site builder.",
          "Contenu": "Very good site builder great customer service highly recommendedThanks"
        },
        {
          "Note": 5,
          "Lieu": "PK",
          "Pseudo": "Sarmad Waqar",
          "Nb_Reviews": 1,
          "Date": "2023-10-15T18:50:02.000Z",
          "Titre": "Really amazing website and their staff…",
          "Contenu": "Really amazing website and their staff members are relly helpful in any critical situation with website or related it."
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Justin Ancelin",
          "Nb_Reviews": 2,
          "Date": "2023-09-21T00:19:17.000Z",
          "Titre": "Easy to use platform",
          "Contenu": "Easy to use platform.  Helpful assistance and kind staff from SITE123.  I would recommend SITE123 for building any webpage."
        },
        {
          "Note": 5,
          "Lieu": "MX",
          "Pseudo": "Jose Angel Aguilar",
          "Nb_Reviews": 1,
          "Date": "2023-08-05T02:42:30.000Z",
          "Titre": "It is extremely easy to create a web…",
          "Contenu": "It is extremely easy to create a web site with SITE123, it has lots of images and designs, fonts and styles. Initially I was using W....X to create my site, but it was extremely slow and did not saved changes, and... then I discover SITE123 and what I was trying to do trough days, was ready in a few hours. 5 stars for SITE123 team"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Tuba Tuğran",
          "Nb_Reviews": 1,
          "Date": "2023-08-28T22:53:57.000Z",
          "Titre": "WhatsApp group",
          "Contenu": "i love working so much then i love to be with you i love running your company and i think it would be better if you create me a whatsapp group"
        },
        {
          "Note": 5,
          "Lieu": "TR",
          "Pseudo": "Alper",
          "Nb_Reviews": 1,
          "Date": "2023-08-21T15:54:26.000Z",
          "Titre": "It was really good.The website was…",
          "Contenu": "It was really good.The website was perfect.I liked it so much.People were pretty good as well, they responded instantly and were very helpful.Only bad thing is that they didnt make it accesible if someone doesnt have the link.I think you should fix that.If you would think about it please let me know thank you."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Renaut Mosdale",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T18:30:40.000Z",
          "Titre": "Very good reactivity",
          "Contenu": "Thank you for the reactivity"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "CANNSAGOE/GLORIA",
          "Nb_Reviews": 2,
          "Date": "2023-08-01T11:39:30.000Z",
          "Titre": "When I realized I had a  missed  email…",
          "Contenu": "When I realized I had a  missed  email that I didn't replied  and  during to that reason my account was  canceled , I panicked.  So I sent an email . But honestly  I thought  it  was gonna take  a long time for me  to receive  a response back from you.  But no it was so fast . And everything got resolved and I was back again.  Than you."
        },
        {
          "Note": 5,
          "Lieu": "GB",
          "Pseudo": "Pamela Macdonald",
          "Nb_Reviews": 7,
          "Date": "2023-08-16T01:29:48.000Z",
          "Titre": "The website is very easy to set up and…",
          "Contenu": "The website is very easy to set up and if you need help with anything there is someone on hand to help immediately. Highly recommend."
        },
        {
          "Note": 5,
          "Lieu": "ES",
          "Pseudo": "Amigos del Románico",
          "Nb_Reviews": 1,
          "Date": "2023-10-27T18:57:41.000Z",
          "Titre": "A very easy way to have a professional…",
          "Contenu": "A very easy way to have a professional web without coding. I recommend it."
        },
        {
          "Note": 5,
          "Lieu": "IL",
          "Pseudo": "shahar Jupiter",
          "Nb_Reviews": 1,
          "Date": "2023-07-26T19:51:08.000Z",
          "Titre": "The product itself is amazing giving a…",
          "Contenu": "The product itself is amazing giving a lot of solutions for the site admin and what i like most is the very good service and tech support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Gary Bryant",
          "Nb_Reviews": 1,
          "Date": "2023-11-25T20:26:47.000Z",
          "Titre": "It was very easy to set up my basic web…",
          "Contenu": "It was very easy to set up my basic web page. I have link so I can go back to make any changes."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tammy Lambert",
          "Nb_Reviews": 2,
          "Date": "2023-11-17T16:14:38.000Z",
          "Titre": "The reply explained my question and it…",
          "Contenu": "The reply explained my question and it was relatively timely."
        },
        {
          "Note": 5,
          "Lieu": "VE",
          "Pseudo": "Naka Pools",
          "Nb_Reviews": 1,
          "Date": "2023-12-19T19:43:37.000Z",
          "Titre": "Easy and fast use",
          "Contenu": "Easy and fast use. thanks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anthony Johnson",
          "Nb_Reviews": 1,
          "Date": "2023-10-17T02:09:04.000Z",
          "Titre": "Good tech helpThe tech help was very informative and…",
          "Contenu": "The tech help was very informative and allowed me to do what I needed for this web site."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "gabe liliedahl",
          "Nb_Reviews": 1,
          "Date": "2023-08-07T00:02:00.000Z",
          "Titre": "They were very helpful and offered a…",
          "Contenu": "They were very helpful and offered a couple of different solutions when I had a problem with something I was trying to add on to the site"
        }
      ]
    }
  ]
}