{
  "Catégorie": "electronics_technology",
  "Entreprise": [
    {
      "Entreprise": "softwarekeep.com",
      "Review": [
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "David",
          "Nb_Reviews": 1,
          "Date": "2023-12-16T00:20:17.000Z",
          "Titre": "What I received is not what I ordered",
          "Contenu": "What I received is not what I ordered.  Expected 'Windows 11 Pro'.  Got a link related to upgrading fromWindows 10 to Windows 11.  I need to do a completeinstall.  This is of no use to me."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Arius Hopman",
          "Nb_Reviews": 5,
          "Date": "2023-10-11T20:45:57.000Z",
          "Titre": "I was never able to download the Word…",
          "Contenu": "I was never able to download the Word program I bought.You have not been responding to my many emails explaining the problem.I will not be able to Continue buying your products."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ChuckRohde",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T18:40:10.000Z",
          "Titre": "I cannot get it to redeem",
          "Contenu": "I cannot get it to redeem. I keep trying to erase the old software and it is never enough"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "mcq mcq",
          "Nb_Reviews": 3,
          "Date": "2023-03-24T22:06:46.000Z",
          "Titre": "AVOID",
          "Contenu": "AVOID. An absolute scam. No product, no refund..... Go with reputable company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "dr james",
          "Nb_Reviews": 5,
          "Date": "2023-10-11T19:09:52.000Z",
          "Titre": "needed microsoft tech support to install",
          "Contenu": "impossible to download your programs"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rusty Fleming",
          "Nb_Reviews": 1,
          "Date": "2021-03-27T16:14:02.000Z",
          "Titre": "The price was really good for unavailable product",
          "Contenu": "The price was really good. Of course, you can offer a good price when you do not have the product.  Claimed they could deliver license in 30 minutes. Waited 30 minutes then received email stating \"out of inventory\" Will provide license in 2 business days (did not provide a guarantee).  Support was very helpful and cancelled my order.  Or course it will take 1 to 3 days to get a credit."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Blaise Mercadante",
          "Nb_Reviews": 2,
          "Date": "2021-04-01T13:00:45.000Z",
          "Titre": "I would have given 0 stars",
          "Contenu": "I would have given 0 stars. I purchased Office Pro and was not able to download it. I jumped on chat last night and after 3 hours with Joe the activation wouldn't work. He stated I only had to wait for a little bit and the issue would resolve itself. It did not. This morning it still was not activated."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Bob Smith",
          "Nb_Reviews": 1,
          "Date": "2021-05-12T22:38:19.000Z",
          "Titre": "Can't keya right key",
          "Contenu": "bought Office 16 but when I installed I could not register it. I talked with Microsoft support and they told me that the key I got was for developers. Have work on this problem for over 8 hours now and I can't get the right ket or refund of my money. Beware of this with this company."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Scammed by softwarekeep.com",
          "Nb_Reviews": 2,
          "Date": "2020-08-22T20:39:28.000Z",
          "Titre": "AVOID THESE SCAMMERS!!!!",
          "Contenu": "AVOID THESE SCAMMERS!!!!! I BOUGHT WINDOWS 7 PRO AND DOES NOT WORK OR INSTALLS!!! Finally got the bootable USB working and LOW-N-BEHOLD. the sh** didn't work! and STILL NO REFUND!YOU ARE BETTER OFF BUYING **DIRECTLY** from Microsoft themselves. I wish I can attached my screenshot but can't BUT here but here's what the screenrnshot says...\"Windows cannot be installed. The files are corrupt or missing......\"DO NOT, I REPEAT, DO NOT BUY FROM THESE SCAMMERS!!!!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mary G",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T10:28:27.000Z",
          "Titre": "This is a scam",
          "Contenu": "This is a scam. They never sent me what I ordered. There is no key, there is nothing. They took twice fee. Over $ 100. I made a complaint. I called and no communication. A person who does not speak English. I wrote an email. They answer the same message. I already have over 10 emails from them. We are glad for contact as our cooperation .... They do not answer about my case. Massacre! Thieves! I reported it to the police. A thieving country!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "jim jones",
          "Nb_Reviews": 1,
          "Date": "2020-09-18T17:15:42.000Z",
          "Titre": "joe did a phenomenal job at assisting…",
          "Contenu": "joe did a phenomenal job at assisting me. however, my experience using your website was complete garbage. i didn't receive my key code, and had to contact support, and still didn't receive my key code until we used a different email. so once again. joe was great, but my experience was beyond awful"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "michael presizniuk",
          "Nb_Reviews": 1,
          "Date": "2020-05-11T22:10:16.000Z",
          "Titre": "HORRIBLE PRODUCT AND DOWNLOADING",
          "Contenu": "The key provided was already used by someone else so thought I was screwed out of my money.  Went through the email and in fine print at bottom there are instructions to uninstall other office and reinstall which I did.   key still doesn't work so now ive uninstalled the office that comes on the laptop and have a garbage download on my computer.  so helpful wowwww just awful.  DO NOT USE THIS!  I cant believe the ratings are so high.  Work experience Ive had online downloading/shopping etc"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Bertrand Dulis",
          "Nb_Reviews": 2,
          "Date": "2019-01-10T18:26:53.000Z",
          "Titre": "I have been trying for 2 days to…",
          "Contenu": "I have been trying for 2 days to download Windows 10. I have been on  live chat with the representatives today but still no joy and no real explanation for the problem. I have to work and want a quick and simple download. I have asked for a refund if they don't sort this soon so watch this space... Whilst all the staff are pleasant it doesn't really help when you really just want the product you paid for."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Azia Cai",
          "Nb_Reviews": 2,
          "Date": "2018-11-06T05:12:54.000Z",
          "Titre": "NEVER TRUST THIS COMPANY",
          "Contenu": "NEVER TRUST THIS COMPANY, THEY ARE SELLING PIRATED SOFTWARE, THATS WHY MOST OF THE PRODUCT KEYS ARE NOT WORKING. PEOPLE WHO REVIEWS THIS COMPANY ARE ONLY THEIR EMPLOYEES!!!! WHAT A BOGUS COMPANY THEY MAKE MULTIPLE TRUSTPILOT ACCOUNTS TO MAKE GOOD REVIEWS, THEY DONT EVEN HAVE A LEGIT OFFICE IN THE STATES! EVERYTHING HERE IS BOGUS AND PEOPLE WORKING HERE ARE FROM OFFSHORE HOMEBASED AGENTS."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "melaniemacro",
          "Nb_Reviews": 2,
          "Date": "2019-10-06T20:15:22.000Z",
          "Titre": "They do not respond to price match requests",
          "Contenu": "I asked them for a price match (with link to the product elsewhere) and they said they would get back to me within 24 hours. I didn't hear so I messaged them again and they said the sales team would get back to me in 30 mins-1 hour. Hours later, still nothing. I guess they don't want to fulfil their promise of price matching. I will report that to the ASA. I won't buy from here now, I only wanted to because the reviews seemed better than the other company."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Peter Fey",
          "Nb_Reviews": 3,
          "Date": "2017-11-03T17:11:53.000Z",
          "Titre": "Very unclear regarding procedure",
          "Contenu": "Very unclear regarding procedure Blurb states instantaneous download and then told to wait 15 minutes and then after completing payment details had a rude and insulting call to verify who I am and was told credit reference had a problem which is an insult as I have no problem with credit at all Very bad experience person on phone was unintelligible did not speak good english"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "T. Tzur",
          "Nb_Reviews": 3,
          "Date": "2017-06-20T11:59:29.000Z",
          "Titre": "Really poor products and service.",
          "Contenu": "Really poor products and service.1. Windows 8.1 download was defective and was not recognised as an .ISO file.2. calling customer services 5 times, but getting disconnected immidetly when the phone is answered.3. customer services will not call you back.4. chat service is manned by people who cannot deal with any technical issues. 5. Remote assistance reply very amateur and inexperienced.Appalling!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Tom Mahoney",
          "Nb_Reviews": 2,
          "Date": "2017-04-04T00:29:04.000Z",
          "Titre": "Buyer beware",
          "Contenu": "The customer service is non-existent and unacceptable.  I sent in 2 help desk tickets and attempted (all day) without success to call the phone number splashed all over the website.  As for the help desk tickets the only response I received was that they combined the 2 and sent me an e-mail informed me of their action.  No one contacted me as I requested.  I was able to activate the software by calling Microsoft directly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Harold Goodwin",
          "Nb_Reviews": 1,
          "Date": "2018-07-06T00:35:39.000Z",
          "Titre": "Chat session was great with Kim",
          "Contenu": "Chat session was great with Kim, My problem was after I ordered the product and my card was charged I didn't get a link to download from, After waiting for over 30 minuets I was inform by Kim that someone would call, Rep call and said they didn't know if I was the one using the card, My response was why did you post a charge on my credit card? Long story short I canceled the order, Never heard of such before. Will not be ordering anything from their website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Kalyn Dorland",
          "Nb_Reviews": 1,
          "Date": "2020-03-30T18:43:11.000Z",
          "Titre": "I bought word for my mac",
          "Contenu": "I bought word for my mac. I had nothing but problems from the very beginning. David was less than helpful. It would not download to my mac at all. I asked for a refund and was refused. If I could 0 stars I would. Seems like all the good reviews are customers who dealt with Ray and not David."
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "J A",
          "Nb_Reviews": 1,
          "Date": "2019-12-10T12:06:29.000Z",
          "Titre": "Never received the product.",
          "Contenu": "Ordered Symantec Endpoint Protection licenses and never received the product. Sent an email, followed up with a call and was told that they had run out of stock (this is a digital with license download !!!???). In their favour, they did refund payment but are still selling it on their website."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Michelle Corrine",
          "Nb_Reviews": 1,
          "Date": "2017-02-13T15:09:31.000Z",
          "Titre": "Horrible",
          "Contenu": "UPDATE:  The reply from Softwarekeep below is completely fabricated.  None of the information they state is accurate.I highly recommend you avoid doing any business with this company.  I've contacted the BBB and reported the company as fraudulent with my credit card. The very worst experience I've ever had with an online company."
        },
        {
          "Note": 1,
          "Lieu": "AU",
          "Pseudo": "Meta",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T02:54:27.000Z",
          "Titre": "I bought Microsoft Word 2019 Home and…",
          "Contenu": "I bought Microsoft Word 2019 Home and Office. When I downloaded the program I could not choose my own country. I was told to choose another English speaking country.  There was no other English speaking country on the drop down list.  I've had no help from this company, just get the runaround constantly.  Then with the problem still unresolved, they sent me a survey asking if I was happy with the product.  I have now bought this program from somewhere else and I will be  filing a complaint plus seeking a refund (although I don't like my chances)."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Shirley Porter",
          "Nb_Reviews": 5,
          "Date": "2017-08-10T13:41:05.000Z",
          "Titre": "Worst experience ever",
          "Contenu": "Worst experience ever! I purchased Microsoft Office for Mac from these guys in May. In August Apple needed to wipe my computer clean. I was now unable to re-install my MS Office. I contacted Software Keep as I purchased this from them. 2 calls One was Ann and the other Ivy. Both essentially said tough luck you only get one install. The one gal shuffled me over to Microsoft who wanted $470 to help me. Seriously the product was only $100. I ended up having to RE-PURCHASE the product. Not from these crooks though."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T21:22:19.000Z",
          "Titre": "It was a completely waste of time",
          "Contenu": "It was a completely waste of time. Joe was supposedly helping me to activate the Microsoft Office I just purchased. I spent almost an hour online with him, he barely reply to my messages/questions, and asked me the same questions repeatedly."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "elena alim",
          "Nb_Reviews": 1,
          "Date": "2019-05-10T01:24:32.000Z",
          "Titre": "order has been held, but cc charged",
          "Contenu": "My \"order has been held for further review\", but they already CHARGED my credit card. I tryed to call them, but their phone is NOT answering.... I e-mailed to them, but still I didnt get an answer....Fishy.....DO NOT ORDER FROM THEM.SCAM"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "KatieK",
          "Nb_Reviews": 6,
          "Date": "2020-07-22T08:48:30.000Z",
          "Titre": "This company is just a joke",
          "Contenu": "This company is just a joke! I work for the NHS test and trace service and thought that my mac had been hacked. So it is imperative that I get a good security package and the bitdefender was the one recommended for mac. I found it on software keep so went on there and purchased it.Before I did, I searched the company for one compatible with mac and bought the one that was recommended by them. However, I wasnt able to download it. The company then said it was only for windows. I sent them the blurb from their own website and was told it would take 24 - 72 hours to refund my money!!! What a scam!! Terrible service and I am absolutely fuming."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "uAmanda Lantz",
          "Nb_Reviews": 1,
          "Date": "2021-07-09T04:06:25.000Z",
          "Titre": "Brutal company",
          "Contenu": "Brutal company. The 30 day money back guarantee is far from the truth. What I bought was not compatible and I quickly realized the mistake (within minutes), and they were very quick to take their $100 and run!"
        },
        {
          "Note": 1,
          "Lieu": "CZ",
          "Pseudo": "Stefan Mustek",
          "Nb_Reviews": 1,
          "Date": "2018-12-19T17:02:08.000Z",
          "Titre": "Fake licenses",
          "Contenu": "This company is selling MSDN licenses that can be used by Terms and Conditions of Microsoft only for testing purposes by companies which have acquired MSDN subscription. Do not buy them if you do not want to have problems with Microsoft and BSA."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jerry Keenum",
          "Nb_Reviews": 2,
          "Date": "2021-03-22T12:17:01.000Z",
          "Titre": "No Help from Software Keep",
          "Contenu": "Software Keep helped me with my installation but when I asked for help when I could not edit my contacts and groups in Outlook they ignored my problem.  After sending me something they found on the web I documented my problem again and sent two more emails.  When I tried to use the Chat, I got an email stating they would get back to me.  They lied!!  My initial contact was 12 days ago.  No communication yet and I'm not holding my breath.  After reading the response, Software Keep did not respond after the first contact. This was not an operator issue as I have been using the same software for over 20 years.  If you don’t know how to fix a problem then state that  rather than no contact!!!!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Patti Tiernan",
          "Nb_Reviews": 1,
          "Date": "2021-04-05T18:08:28.000Z",
          "Titre": "Office licenses",
          "Contenu": "I ordered 4 - 2016 Office licenses. 3 out of 4 said the license was already used. I tried emailing them and Chat on the web page and I got no response. I even email the president. Nothing. DO NOT BUY FROM THEM."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Amanda Royce",
          "Nb_Reviews": 2,
          "Date": "2016-09-30T21:29:33.000Z",
          "Titre": "Is there a zero star option?",
          "Contenu": "I looked at the website. \"Only 11 available for download. But now\". I bought. They charged me. No product download for me, but they charged me $100. I called them, I was polite, I was hung up on. I called back, I was more assertive, but not vulgar, I was hung up on. I called back, I swore once \"BS\",  I was hung up on. I used the website chat option.  FYI, it's just you chatting, no one responds. Email option, canned answer, they will get back to you in 24-48 hours. This company is horrible. Spend the extra $50 and get your software from the actual company that sells it, not this one. They suck."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Melanie Chisholm",
          "Nb_Reviews": 2,
          "Date": "2019-11-06T17:23:05.000Z",
          "Titre": "Lots of red flags",
          "Contenu": "Lots of red flags - scam likely. In the process of trying to get a refund right now. Pray for me. Never order from anyone other than the manufacturer directly - I mistakenly thought that was what I was doing. HUGE Regret!"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Sam Abyssinia",
          "Nb_Reviews": 1,
          "Date": "2021-07-25T22:15:45.000Z",
          "Titre": "Do not buy product from software.ca I…",
          "Contenu": "Do not buy product from software.ca I purchased an office product and it was a pain to follow instructions. Then the wrong product downloaded . They will not change or refund it, SCAM SCAM SCAM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris Jester`",
          "Nb_Reviews": 1,
          "Date": "2017-06-09T16:07:37.000Z",
          "Titre": "Buyer beware",
          "Contenu": "Buyer beware, the 100% Guarantee is a sham !Bought Windows 10 Pro but it would not download on new HP desktop. Even their techs remoting in could not fix it. They refused to refund our purchase, stating that it was a hardware problem."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Ronald",
          "Nb_Reviews": 3,
          "Date": "2019-10-31T20:00:41.000Z",
          "Titre": "Improper sales of software with no follow up.",
          "Contenu": "I purchased two weeks ago MS Word 2016 and had problems downloading it. When I tried to re-load the program on my new iMac over the weekend, unable to do so. Talking to MS, found out that the program I was sold was for DEVELOPERS ONLY. Not to be sold.I have called and emailed the company with out any responds. My next step it to let my card company get involved for my refund.My order number was 00000922 on 10/16/2019. Ordered MS Word for Mac Home and Student. After two contacts with tech (the first one sent did not load. 2nd e mail to me as a different link and downloaded Home and Business 2016). As of today, made three efforts to contact them in Washington state with no responds."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Aaron",
          "Nb_Reviews": 1,
          "Date": "2016-12-30T20:38:54.000Z",
          "Titre": "I was fooled - don't be!",
          "Contenu": "I received a software key that didn't work at the Microsoft download site provided.  I chatted with Arlyn asking for help and she told me to instead download software from a pcloud link.  Telling them I didn't want to download anything from a third-party site, I asked for a refund and she told me she would get me a new software key within 5-8 hours.  Not having received that key the next day I chatted with Alvin and he told me he couldn't give me a refund without a screenshot.  I asked him to try the key himself at the Microsoft site I was given and he told me that he doesn't have web access to that link.  My next call was to my credit card company!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Lourdes Williams",
          "Nb_Reviews": 1,
          "Date": "2018-01-08T17:53:21.000Z",
          "Titre": "Purchased Microsoft office 2011 for Mac …",
          "Contenu": "Purchased Microsoft office 2011 for Mac from Softwarekeep.comI am very disappointed with the software. I had issues with the activation.  The customer service people were very polite and kept telling that it would be 10 to 15 minutes to activate the software.  That they had to get approval from Microsoft.  After 24 hrs of 3 phone calls multiple emails.I had to finally ask for a refund because customer services could not get it done. If you want to know why the delay you have to call them they will not call you back.  Their comment that it will take 10 to 15 minutes for the downloads to activate could be days. So if you need your software right away, look some where else."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Mahdi Behzadi",
          "Nb_Reviews": 1,
          "Date": "2020-09-16T22:42:01.000Z",
          "Titre": "People BE AWARE OF THIS SCAMMING COMPANY",
          "Contenu": "People, this company is a SCAM! BE AWARE OF THEMI am in Canada they charged my credit card and they claimed to deliver the product key within half an hour and they did not never!BE AWARE OF THIS SCAM"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "travis",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T20:47:11.000Z",
          "Titre": "beware",
          "Contenu": "First of all purchased 2 days ago with no confirmation email.  Joe seemed great. Then sent me student edition when I was charged for business.  Filing claim with amex.  Better luck to anyone who shops here."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Derian Dupler",
          "Nb_Reviews": 1,
          "Date": "2020-03-21T20:14:45.000Z",
          "Titre": "I never got my product and they had…",
          "Contenu": "I never got my product and they had ultimatley just wasted my time, so now Im out $40 and finding myself buying it again this time from Microsoft which is what I should have done in the first place."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "John Spires",
          "Nb_Reviews": 1,
          "Date": "2018-04-27T19:04:47.000Z",
          "Titre": "The initial Product Key sent did not…",
          "Contenu": "The initial Product Key sent did not work, so I had to contact Tech Support, who then provided me a second Product Key, which also did not work, so they sent me a link to do an off-line download, which took over three hours and when it was complete, the program did not work.  Therefore, I had to contact Tech Support again, who I then had to relinquish control of my computer to (which I am never comfortable with) for them to start a download, which again would have taken another 3-4 hours.  When I observed this, I took control of my computer, stopped the download and went direct with Microsoft. To be clear the personnel were very courteous, I was frustrated with time and lack of functionality of the Product Keys provided."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Katie Stramara",
          "Nb_Reviews": 1,
          "Date": "2018-11-25T15:06:21.000Z",
          "Titre": "I could not get the download for Office…",
          "Contenu": "I could not get the download for Office to work...went through 3 tech partners that did not solve the problem. The third, supposedly named \"joe\" (but when he took over my computer, his name was a foreign name), took over my computer and had me sit there for about 15-20 minutes until he even moved his mouse, eventually did nothing for me. I started to him that I was getting a little nervous because I hadn't seen his mouse move yet and he said \"I was helping another customer, calm down\", which i found to be very rude. He also clicked out of the main chat box and hit the thumbs up symbol for me, basically showing that I was satisfied with his help. I disconnected with him and cancelled my order. Would never recommend this service."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Jim Adams",
          "Nb_Reviews": 1,
          "Date": "2020-06-18T00:06:28.000Z",
          "Titre": "Purchased Office 2019",
          "Contenu": "Purchased Office 2019, got a link with a product key and an install link, clicked the link, and got malware.  DON\"T USE THIS COMPANY - THEY WILL INSTALL MALWARE ON YOUR COMPUTER."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Penny Curran",
          "Nb_Reviews": 1,
          "Date": "2019-01-04T13:42:58.000Z",
          "Titre": "Failing to Refund our Money for a non working program",
          "Contenu": "After calling and speaking to a rep @ software keep we were advised to purchase M office for Mac instead of 365 because it would be a one time download instead of a yearly renewal.  After making the purchase the program would not load and when we called back they said the program was not compatible both via phone and email and stated we needed to purchase a more expensive version and the money would be refunded by the end of the day for the incompatible version.  It has been 8 days so far and they have not given us our money back nor have they communicated with Paypal.  I would beware of purchasing from them and glad we didn't make the second purchase they wanted us to.  We will also be filing with other government agencies to make this company transparent."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Paul S.",
          "Nb_Reviews": 3,
          "Date": "2018-03-10T23:05:38.000Z",
          "Titre": "Joe finally got me through downloading…",
          "Contenu": "Joe finally got me through downloading of Office 2016 pro plus......but left me trying to get a 4-digit code  from an unresponsive Microsoft.I still don't have the installation operational"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Chris McAuliffe",
          "Nb_Reviews": 1,
          "Date": "2017-12-29T22:08:28.000Z",
          "Titre": "This company is unbelievable and Sucks",
          "Contenu": "This company is unbelievable. I ordered the software and it did not work. I researched on their website and found that office 2011 for Mac  was discontinued by Microsoft in October 2017. I told Customer Service why would the ever try and sell that on their web portal but could not get a straight answer.  I requested a refund. They told me would be coming forth with. Never happened!I’ve been ordered Microsoft office 2016 for Mac from the same company. I waited 16 hours get the link to download with no success.I sent an email back to the company told him to cancel all the orders and I’ll find another company. Surprisingly, 10 minutes later they sent me a link for their software.I responded back to them they could keep it no use for them in the future"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Anthony",
          "Nb_Reviews": 1,
          "Date": "2019-12-17T19:52:07.000Z",
          "Titre": "After 5 chats, DLC out of stock???",
          "Contenu": "After 5 chats, at least half an hour for each chat. With the same answer at the end is give them another 24 hours. The final answer is out of stock? for DLC out of stock???"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Gigi Starr",
          "Nb_Reviews": 1,
          "Date": "2016-09-15T03:38:25.000Z",
          "Titre": "Don't trust",
          "Contenu": "I tried downloading their software 4-5 times and it wouldn't download. Disputing it with my bank because I couldn't get a hold of them to resolve the issue"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Rhonda Wright",
          "Nb_Reviews": 1,
          "Date": "2022-05-27T09:31:22.000Z",
          "Titre": "I requested a refund and it’s going on…",
          "Contenu": "I requested a refund and it’s going on two weeks and they have not refunded my money. These people are thieves"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Laura Berndt",
          "Nb_Reviews": 1,
          "Date": "2020-12-11T13:57:46.000Z",
          "Titre": "This company is a scam!!",
          "Contenu": "This company is a scam!!! Took my $99.99 & never received a keycode so I could access my product.  Will not refund my money.12/20"
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Donald Hull",
          "Nb_Reviews": 2,
          "Date": "2020-05-14T17:40:10.000Z",
          "Titre": "I ordered and payed for AVG PC tune up",
          "Contenu": "I ordered and payed for AVG PC tune up. I was expecting a full year, and it is telling me, I only got a 30 day trial."
        },
        {
          "Note": 1,
          "Lieu": "CA",
          "Pseudo": "Terrance",
          "Nb_Reviews": 2,
          "Date": "2018-02-05T03:42:10.000Z",
          "Titre": "Invalid Product Keys",
          "Contenu": "Bought windows 7 pro product key and activation was fine. Than the next day there's a pop-up saying the key in invalid!"
        },
        {
          "Note": 1,
          "Lieu": "GB",
          "Pseudo": "Pauline",
          "Nb_Reviews": 2,
          "Date": "2018-03-02T08:10:43.000Z",
          "Titre": "I purchased an instant download.",
          "Contenu": "I purchased an instant download.However I had to have a new hard drive fitted to my PC and lost the software.  I contacted this company and was informed I could not download it again as the licence was only for 1 pc.  After explaining several times my issue, I was offered a 20% discount to purchase the download again.  I then contacted Microsoft direct and was informed this company had already used the product key serveral times for the software I had purchased.  Customer service at Softwarekeep is appalling, avoid at all costs.  It has been a costly experience as I've had to now purchase the product via Microsoft direct.After writing this review I was sent an email offering me a new product key or a full refund. Plus a link to remove my negative comment!! I requested a full refund and received the credit within a couple of days. Will I remove the negative comment..... absolutely not. Without this negative comment I wouldn’t have been offered any of the above. I’d have been left out of pocket as the person I spoke to during the chat session was extremely unhelpful!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "kipp",
          "Nb_Reviews": 1,
          "Date": "2018-09-27T19:55:45.000Z",
          "Titre": "Fake company with fake reviews.",
          "Contenu": "Fake company with fake reviews.. Stole my money.. Now just waiting for my credit card company to file a dispute."
        },
        {
          "Note": 1,
          "Lieu": "IE",
          "Pseudo": "JIM FITZPATRICK",
          "Nb_Reviews": 4,
          "Date": "2018-04-23T16:04:00.000Z",
          "Titre": "I paid for a Microsoft Word for Mac…",
          "Contenu": "I paid for a Microsoft Word for Mac download YESTERDAY and nothing....zilch....STILL WAITING .Just cancelled."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Clint White",
          "Nb_Reviews": 1,
          "Date": "2020-09-07T11:20:59.000Z",
          "Titre": "Buyer Beware!",
          "Contenu": "When I saw that Softwarekeep had an average rating of 4.9 on Trustpilot, I thought that I could trust the company. However, I should have taken the time to look at the negative reviews. I discovered that the process of purchasing software can be a bit confusing. I initially received an email stating that the purchase failed to pass the “automated verification” process and that I needed to provide a “screenshot of the transaction with the visible merchant name, date and the amount.” The request seemed awful suspicious to me, so I ignored the email thinking that it was a phishing scam. However, it was a legitimate email and by ignoring the request my purchase was cancelled. But, the next day I received an email stating that the order was approved and that I would be receiving an “instructional email on how to download and install your software.” I never received the instructional email and the very next day I received an email from PayPal notifying me that the amount of the purchase had been refunded. Therefore, I found that the entire process of attempting to try to purchase 2019 Microsoft Office was very confusing. Rather than trying to save money by going through a third party vendor, I should have purchased the software directly from Microsoft."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Mary B",
          "Nb_Reviews": 1,
          "Date": "2021-12-03T17:51:17.000Z",
          "Titre": "Took my payment and then told me the product I paid for did not exist on the site",
          "Contenu": "I am dissatisfied with this business. It had a buy button next to the software app I wanted to purchase, and then automatically added a suggested purchase presumably to make the app I wanted work better. I added the upgrade of the other app and clicked the buy button, put in payment information and the website immediately received my charge. Then when I attempted the download, I got \"Houston, we have a problem, the page you are looking for does not EXIST.\" Why does your site take my money for something you don't even have?I was able to contact customer service by chat, but I received a message from PayPal about my payment less than 30 seconds after I submitted payment, and the rep said we have to wait 15 minutes because he couldn't see the transaction (I couldn't give him the order number because the dialog box with the message that the page does not exist obscured the number). I told him I just wanted a refund, and I was waiting, but then he left the chat and I had to go into the chat box to get him back on the line after waiting at least 20 minutes. The rep did process a refund, but I have to wait 24-48 hours for that refund to process. How does it take over 24 hours to process a refund when it takes less than 30 seconds to process my payment. I won't try to purchase anything from this site again. I'm just praying I actually do get my refund."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Shelby",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T22:34:04.000Z",
          "Titre": "Do NOT use Softwarekeep!",
          "Contenu": "I was sent the serial key, which didn't work because it had \"already been activated,\" which wasn't true. I had to call Microsoft directly who told me that the key was only useable in China and the like, but not the US.  I contacted Softwarekeep and was quickly connected to Joe who helped me.  He was polite throughout the entirety of our conversation.  Initially, over the phone he said he would email me another key, but the key was not in his email.  I had to call back and talk with him again at which point he accessed my computer using Zoho and helped directly.  Only then did I receive a new key.  He initially installed a version that didn't work on my computer, which took over 30 minutes.  He then had to install a different version, which took another half hour.  Throughout the time he was assisting me, there would be times I would ask questions in the chat and it would take at lest 5 minutes for him to respond.  It was also somewhat frustrating that he relentlessly kept asking me to complete the review before he finished helping me- even after I told him more than once that I would complete the review after everything was completely installed.  Overall, very terrible experience.  I will not use Softwarekeep in the future and will not recommend it to anyone I know.  Joe was polite and eventually got the job done, but it took much longer than it should have."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Eric",
          "Nb_Reviews": 1,
          "Date": "2019-03-10T20:23:52.000Z",
          "Titre": "Bunch of crooks",
          "Contenu": "Bunch of crooks. Software won't install a d they refuse to give refund"
        },
        {
          "Note": 1,
          "Lieu": "CH",
          "Pseudo": "chicco di stasi",
          "Nb_Reviews": 2,
          "Date": "2021-08-17T21:44:52.000Z",
          "Titre": "It’s a spam!!",
          "Contenu": "It’s a spam!!! I paid for the software and never got anything"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ashley crowe",
          "Nb_Reviews": 1,
          "Date": "2019-03-13T01:18:22.000Z",
          "Titre": "Problem not fixed",
          "Contenu": "Didn’t fix anything and left when I was still asking questions!"
        },
        {
          "Note": 1,
          "Lieu": "MX",
          "Pseudo": "Jerry Liedtke",
          "Nb_Reviews": 2,
          "Date": "2018-01-18T21:32:25.000Z",
          "Titre": "As soon as they have your money the …",
          "Contenu": "As soon as they have your money the support stops!"
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "Nelson butler",
          "Nb_Reviews": 1,
          "Date": "2017-02-14T20:36:22.000Z",
          "Titre": "Very satisfied!",
          "Contenu": "Best customer service ever."
        },
        {
          "Note": 1,
          "Lieu": "US",
          "Pseudo": "ROBERT MAGNUSON",
          "Nb_Reviews": 1,
          "Date": "2017-02-23T22:36:55.000Z",
          "Titre": "WHEN I TRY TO ACTIVATE  OFFICE MAC  …",
          "Contenu": "WHEN I TRY TO ACTIVATE  OFFICE MAC 2011, THE MESSAGE IS \"PRODUCT KEY NUMBER NOT VALID\".PHONE CALLS TO THE POSTED TELEPHONE NUMBER RING 50 TIMES WITH NO ANSWER.EMAILS TO THE LISTED EMAIL ADDRESS ARE NOT ANSWERED.THUS1- PRODUCT, TO DATE, DOES NOT WORK2- CONSUMER SUPPORT DOES NOT APPEAR TO EXIST----------------------------------------------------------------------AFTER POSTING THIS REVIEW THREE DAYS AGO, I CALLED MICROSOFT.THE MS TECH ASSISTANT FINALLY DETERMINED THAT THE DISK THAT I HAD ENTERED (LABELLED OFFICE MAC 2011) WAS, IN REALITY, A PC DISK.HAVING BEEN UNABLE TO CONTACT SOFTWAREKEEP, I GAVE UP THE GHOST AND JUST BOUGHT AN OFFICE MAC PROGRAM DIRECTLY FROM MICROSOFT.ON DAY 4,  I FINALLY GOT AN EMAIL REPLY FROM SOFTWAREKEEP, IN FACT I GOT 2.IN MY REPLY I EXPLAINED THE ABOVE, TOLD THEM THAT THEY WERE TOO LATE, AND JUST ASKED FOR A REFUND.SUBSEQUENTLY, I RECEIVED A REPLY FROM \"MS X\" (PRESUMABLY A SOFTWAREKEEP REPRESENTATIVE) TELLING ME \"AS THE BUYER, IT IS YOUR RESPONSIBILITY TO KNOW YOUR SYSTEM AND COMPATIBILITY REQUIREMENTS OF THE PRODUCT BEFORE MAKING A PURCHASE.\" (MIND YOU, I HAVE A MAC, ORDERED A MAC PRODUCT, RECEIVED A DISC THAT WAS LABELLED OFFICE MAC 2011, BUT WHICH WAS, IN FACT, A PC DISK). \"IF YOU HAVE ANY QUESTIONS OR CONCERNS PRIOR TO MAKING YOUR PURCHASE, PLEASE TAKE ADVANTAGE OF OUR LIVE CHAT OR TALK IT THROUGH WITH OUR CUSTOMER CARE TEAM\"\"ONCE WE ISSUE YOU A MICROSOFT PRODUCT KEY ... THE SALE IS CONSIDERED FINAL ONCE YOU HAVE USED IT OR TRIED IT AND WE CANNOT ACCEPT REFUND REQUESTS. WE CANNOT ISSUE REFUNDS ONCE PRODUCT KEYS HAVE BEEN DISTRIBUTED\".-------------------------------------------------------------------------------------BOTTOM LINE1- I BOUGHT IT2- THE INSTALLATION FAILED3- SOFTWAREKEEP WAS NOT AVAILABLE TO ME BY PHONE OR EMAIL4- I BOUGHT A REPLACEMENT PRODUCT DIRECTLY FROM MICROSOFT5- SOFTWAREKEEP REFUSED TO REFUND, CLAIMING THAT THE ERROR WAS MINE-----------------------------------------------------------------OUT OF CURIOSITY, I THEN WENT TO THE SOFTWAREKEEP WEB SITE AND READ THEIR TERMS AND CONDITIONS.IT WAS INTERESTING READING.AT THE END, I FOUND THAT THEY ARE BOUND BY THE GOVERNING LAW OF (THEIR OWN LISTED ADDRESS) IN ROBERTS POINT WASHINGTON (ROBERTS POINT IS A LAND ENCLAVE ON THE US/CANADA BORDER)ON GOOGLE EARTH, (THE CORPORATE ADDRESS SHOWN IN THEIR WEB SITE) \"APPEARS TO BE\" A RESIDENTIAL LOCATION.NOTE: I HAVE NO KNOWLEDGE OF WASHINGTON STATE LAW.I ALSO REVIEWED (ON THEIR WEBSITE) \"WHO WE ARE\" ... AN INTERESTING COLLECTION OF SKETCH DRAWINGS AND PERSONAL PROFILES.I LEAVE IT TO YOU TO DRAW YOUR OWN CONCLUSIONS.I AM OUT THE MONEY.I KNOW THAT.BUT I FEEL BETTER AFTER POSTING THIS UPDATE------------------------------------------------------------------------------------------------------------------------------------------------FURTHER INVESTIGATION REVEALS THAT (THE WASHINGTON ADDRESS) IS THE ADDRESS OF \"POINT TO POINT\" ... A PARCEL SERVICE THAT IS THREE BLOCKS FROM U.S. CUSTOMS. \"POINT TO POINT'S\" WEBSITE INCLUDES PICTURES OF THEIR FACILITY WHICH DO NOT APPEAR TO SHOW ANY EXISTING OFFICE SPACE THAT MIGHT BE RENTED. THEIR RATE STRUCTURE DOES NOT APPEAR TO INCLUDE ANY SPACE RENTAL OPTIONS.ON A SIMILAR NOTE, SOFTWAREKEEP.canada IS LOCATED AT (AN ADDRESS TO BE FOUND IN THEIR WEB SITE REGARDING THEIR CANADIAN OPERATION) ... THIS APPEARS TO BE A \"SERVICED APARTMENT\" USED BY SEVERAL CLIENTSTHE (CANADIAN WEB SITE) ADDRESS AND THE POINT ROBERTS SITE ARE 20 MILES APART.-------------------------------------------------------------------------------------------I AM ADVISED BY THE POINT ROBERTS CHAMBER OF COMMERCE THAT SOFTWAREKEEP.usa IS NOT LOCATED AT (THE WASHINGTON SITE REFERENCED IN THE WEB SITE). THEY (THE CHAMBER) OFFERED NO ADDITIONAL DETAILS.-------------------------------------------------------------------------------------------------------------------------------------------------------------------THE CURRENT SOFTWAREKEEP.ca WEBSITE SHOWS AN ADDRESS THAT IS DIFFERENT FROM THE ADDRESS REFERENCED IN THEIR CANADIAN WEB SITE AS BEING THEIR \"GOVERNING LAW\" SITE.THEIR \"ADDRESS\" IS  A UPS LOCATION.THE VANCOUVER BBB SHOWS A THIRD VANCOUVER AS THE MAILING ADDRESS FOR SOFTWAREKEEP, AND LISTS A BUSINESS INCEPTION DATE OF 2-12-2014NOTE: THIS REVIEW HAS BEEN EDITED SO AS TO REMOVE EMAIL ADDRESSES, AND SPECIFIC LOCATIONS. THAT INFORMATION IS AVAILABLE FROM THE SOFTWAREKEEP WEB SITE.MY MESSAGE IS SIMPLY THAT YOU USE  CAUTION."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ronda Whitford",
          "Nb_Reviews": 1,
          "Date": "2023-04-19T00:34:15.000Z",
          "Titre": "Mixed review, the good AND bad!",
          "Contenu": "Their customer chat support is 5 stars. They started processing my order quickly. Their listed pricing is reasonable. Beyond that I give them zero stars.  I first tried a 20% coupon code their Tech Talk \"commercial\" Youtube video recommended but that was invalid. Then when I set up my account their website offered me a 12% coupon code in a pop-up, so I used that. My invoice was processed, a person assigned to my purchase, and information on my Microsoft Account provided via email as they requested. I received confirmation that my order would be processed within 2 business days. I was already on a tight timeline to complete the installation on 5 PC's. Then I received an email from a different person saying they would not honor the 12% discount because in the fine print Office 365 products were excluded. I didn't see any of that during my purchase. Why would it allow me to complete the purchase if it was not valid? They told me that I would need to complete a second purchase and not use the coupon code this time. After already processing my invoice and work being started. I asked them to cancel my purchase and went direct through Microsoft instead. They did process a refund invoice immediately. I wasted 2 days on this, checking their reviews, shopping for the right product, asking questions, and going through their order steps. Disappointing in the end."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Dr David Watkins",
          "Nb_Reviews": 2,
          "Date": "2020-03-21T11:42:09.000Z",
          "Titre": "Software Has Not Been Activated!!",
          "Contenu": "Unfortunately, I am having a most difficult time! I was told that MS Office for Mac 2011 had been activated! However, I continue to have a pop up during my online meeting stating that my software has NOT been activated! This must be corrected TODAY, since I will videoconference tomorrow, and I don't want this pop up to happen again!!Please advise by phone call or chat!Dr. David Watkins"
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Mike Wellman",
          "Nb_Reviews": 1,
          "Date": "2017-12-22T13:02:58.000Z",
          "Titre": "Buyer beware",
          "Contenu": "This is an updated review. SoftwareKeep sold me a product that stopped working after I reinstalled windows. After a painful and persistent several days back and forth with customer service, they finally addressed my concerns. To their credit, they went above and beyond with a free software upgrade in the final solution, but the original problem and their initial reaction to it makes me wary."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Ruby Cooper",
          "Nb_Reviews": 2,
          "Date": "2016-08-29T22:46:23.000Z",
          "Titre": "Beware. Difficult to reach and product used up.",
          "Contenu": "I was sold  MS Office Professional. I was unable to activate it because it had been activated too many times. I tried for 4 days to resolve the issue but kept getting the same message from them: to try a difdferent way of activating it. I asked for a refund several times. Finally, I called my bank and asked them to file a dispute. They will refund my money, because the company refused  to send me software that works, or a refund."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Frederick Wilson",
          "Nb_Reviews": 1,
          "Date": "2018-02-01T03:14:26.000Z",
          "Titre": "The software came with an expired …",
          "Contenu": "The software came with an expired product key. I called your help and a fellow remotely accessed my machine and \"fixed\" it. It allowed execution of the software. The next day i got the message to activate again. I can cancel the message and the software will work.  Every time I launch Word or Excel I have to go through canceling the activation procedure.  If follow through the activation prompt it fails. There were no bad action or words between me and the tech. I thought he had fixed it."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Simon Prowse",
          "Nb_Reviews": 4,
          "Date": "2017-07-17T14:16:54.000Z",
          "Titre": "Non UK software",
          "Contenu": "Bought MS Office for Mac via their UK site. Good price but supplied key wasn't valid in UK though! Had to call Microsoft to sort out. Fortunately they did within 20 minutes but still unnecessary hassle. I'd avoid in future and go direct to developers website."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "ICJ",
          "Nb_Reviews": 1,
          "Date": "2020-04-21T15:28:57.000Z",
          "Titre": "Terrible download experience, great tech support.",
          "Contenu": "I was a bit skeptical about buying a MS Home and Student 2019 from this site. I did get a invoice confirmation and about 20 mins later I received an email with the product key and a download link. The link sent me to a web page that stated the download was 'limited due to high traffic', and if I wanted to continue I should upgrade to premium ($48+ to upgrade). Talked to tech support ('Joe') and said I had the 'offline' link provided in the initial email (Not sure why)... Joe then suggested i download from MS.com. Which worked and i was able to install MS. 2 star for the terrible download experience, 5 star for the tech support."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kins",
          "Nb_Reviews": 21,
          "Date": "2018-03-07T21:25:48.000Z",
          "Titre": "Awful company",
          "Contenu": "Awful company. Sold me some antivirus product with keys that were apparently already in use in a different country. They seem disingenuous. I'm trying to get them to refund my money. Stay far away from these people!They did finally refund my money. I still wouldn't trust these people.. I've read some other reviews where the people have contacted the support for MS and Microsoft actually told them the keys that Softwarekeep sold them were pirated. So I'm not saying this for sure, just from what I've read it seems likely. Glad that they did finally step up and refund my money though."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Kat Marie",
          "Nb_Reviews": 2,
          "Date": "2017-12-17T21:48:49.000Z",
          "Titre": "very disappointing",
          "Contenu": "very disappointing.  I purchased a product with a single installation in September.  Worked fine, but then had my laptop worked on and the OS upgraded.  After that, the product would not open without a confirmation with the original key, except that it wouldn't accept the key because it had already been used once.  Requested help and advise but was told the warranty had expired (a few days prior) and so another key could not be issued.  I tried to save money by purchasing a one time download, not a good idea and I won't do it again. The company is within their rights on this, but I will pay the extra money for a hard copy (disc) from now on."
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Zen Standing",
          "Nb_Reviews": 2,
          "Date": "2017-12-04T09:52:30.000Z",
          "Titre": "No product keys to sell but take your money.",
          "Contenu": "No product keys to sell however they still took my money. To add insult to injury they offered me a mediocre virus software as a replacement to what I had orginallay purchased.  They were unwilling to negotiate a decent anti virus software I was willing to pay more. The loser is the custmoer and the winner is Softwarekeep, as now they have my money and it takes 4-5 day for refund.A note to Softwarekeep if you are selling products ensure you have the supplies before taking customers money and also remove the product from your website its not that hard. All those customers ordering items that you do not have the product keys for but you have there money. Not a bad way to build some interest in the bank account. Bad buisness practice."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Marianne Lawson",
          "Nb_Reviews": 1,
          "Date": "2017-07-10T22:38:03.000Z",
          "Titre": "Talked or chatted with at least three …",
          "Contenu": "Talked or chatted with at least three representatives that I could not download Microsoft Office. Finally they sent a link that I could actually use.  Will never recommend your software."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Luis Osorio",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T11:47:16.000Z",
          "Titre": "I have not received a response after…",
          "Contenu": "I have not received a response after several attempts. I cannot register my product online. I've asked this question several times now and no one has responded."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Lynn",
          "Nb_Reviews": 1,
          "Date": "2018-01-19T20:07:47.000Z",
          "Titre": "Had another problem with the program purchased",
          "Contenu": "I had another problem with the program and this time, the tech was no help.  In fact, he could not do in an hour what our tech guy did in 5 minutes!!! Waste of our time."
        },
        {
          "Note": 2,
          "Lieu": "US",
          "Pseudo": "Victoria",
          "Nb_Reviews": 1,
          "Date": "2020-05-15T20:29:51.000Z",
          "Titre": "JOE sent me my MS Publisher Key that…",
          "Contenu": "JOE sent me my MS Publisher Key that was missing in my mailbox. Quick and efficient service. Thanks!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2018-12-05T17:04:40.000Z",
          "Titre": "A complete waste of time.",
          "Contenu": "I am currently going through the refund process with Software Keep.Basically I ordered Word 2016 for £69. Went through checkout and 30 minutes later I was still yet to receive my download link. So ...I contacted them via chat, and the clerk tells me they have run out of 'Keys' for Word but...they are willing to offer me an upgrade. 'Great' I thought an upgrade sounds good! But ...what they were offering was a version of Office 365 priced at £47. When I asked if they would refund the differance they said no they could'nt do that. To me, this did'nt make any sense! No matter what I said they still could not explain why this was the case. So I asked for a refund seeing as they acted like they did'nt care and were slow to apologize. So...was this the end of my ordeal? Nope. Of course not. I'm now going back and forth asking for a refund. Although they say a full refund will be granted they still can't send me a confirmation email stating this for some reason. Apparently it's in the hands of their auto service or some rubbish. Absolutely crazy. The chat system on their website is also useless, the clerk just ignorned me for minutes at a time (Likely off on a tea break in between questions).So, above all the whole expereince for me has been a complete waste of my time. Thanks Software Keep for inspiring me to shop elsewhere in the future!"
        },
        {
          "Note": 2,
          "Lieu": "GB",
          "Pseudo": "Jim",
          "Nb_Reviews": 2,
          "Date": "2018-12-05T16:58:51.000Z",
          "Titre": "A complete waste of time.",
          "Contenu": "I am currently going through the refund process with Software Keep.Basically I ordered Word 2016 for £69. Went through checkout and 30 minutes later I was still yet to receive my download link. So ...I contacted them via chat, and the clerk tells me they have run out of 'Keys' for Word but...they are willing to offer me an upgrade. 'Great' I thought an upgrade sounds good! But ...what they were offereing was a version of office 365 priced at £47. When I asked if they would refund the differance they said no they could'nt do that. To me, this just did'nt make any sense! No matter what I said they still could not explain why this was the case. So I asked for a refund seeing they acted like they did'nt care and were slow to apologize. So...was this the end of my ordeal? Nope. Of course not. I'm now going back and forth asking for a refund. Although they say a full refund will be granted they still can't send me a confirmatiin email stating this for some reason. Apparently it's in the hands of their auto service or some rubbish. Absoltley crazy. The chat system on their website is also useless, the clerk just ignorned me for minutes at a time (Likely off on a tea break in between questions).So, above all the whole expereince for me has been a complete waste of my time. Thanks Software Keep for inspiring me to shop elsewhere in the future!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Pete Palmisano",
          "Nb_Reviews": 3,
          "Date": "2023-02-16T18:38:36.000Z",
          "Titre": "Stand Up Professional Supervisors. Great Personal Attention.",
          "Contenu": "Had some issues with this company.  Couldn't get them resolved. I had given up. Bryan who I assume is s supervisor reached out a few days later after learning of my issue.  He was very professional and went above and beyond.  He apologized for the mishandling by the original rep. He resolved the issue quickly. Won't go into details but I appreciate Bryan for taking over the situation personally and making the effort to reach out to me."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "Siobhan Markwell",
          "Nb_Reviews": 2,
          "Date": "2021-02-04T23:14:16.000Z",
          "Titre": "Carl was really good but when I buy…",
          "Contenu": "Carl was really good but when I buy online software for download, I've kinda got used to it just downloading instantly and installing with a few simple clicks. Glad that Carl really knew what he was doing and could do a telephone activation of the software. To be fair, I have multiple machines on the same account and maybe Microsoft don't like that. Thanks a lot Carl. You were quick, knowledgeable and got the job done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "WernerEPIC",
          "Nb_Reviews": 1,
          "Date": "2020-12-09T23:45:33.000Z",
          "Titre": "Excellent Customer Support",
          "Contenu": "We purchased a copy of Microsoft Office 2019 and when we went to redeem it, the code claimed it was already used. We went straight to customer service and were helped by a representative by the name of Ping. Within 5 minutes and a screenshot for understanding they were able to replace our product and we got what we paid for with no further problems. 2/5 system, 5/5 customer support. Thank you Ping!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Laughing Flower",
          "Nb_Reviews": 1,
          "Date": "2018-04-24T01:38:15.000Z",
          "Titre": "I had problems installing the software…",
          "Contenu": "I had problems installing the software for Microsoft Office.  Chat was trying to help the first time and I got really busy and couldn't deal with it.  The next time I started the chat I got  Ela she was a very helpful person and she stuck with me until we could get it installed.  I'm not sure why I had so much trouble with the activation.  But I have to say she would not give up and got the job done for me."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "Michael-C. Cottrell",
          "Nb_Reviews": 1,
          "Date": "2019-02-05T22:27:06.000Z",
          "Titre": "Keys invalidated if not installed quickly? Fishy.",
          "Contenu": "I placed two orders for Office 2013 Professional Plus, but waited a month to install them on two PCs. Both keys were deemed invalid by Microsoft. SoftwareKeep tech chat was efficient at diagnosing the issue and providing me with fresh keys that activated just fine, but I'm left with this nagging feeling that the keys aren't completely legit—if I'd bought retail sealed-box keys, I would have been guaranteed they were unique to me and would not lose validity in a few weeks."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Latricia",
          "Nb_Reviews": 3,
          "Date": "2019-05-01T02:52:03.000Z",
          "Titre": "Not happy",
          "Contenu": "After spending more than a couple hours last night the software never fully installed. I should have just stuck with the normal purchase through a trusted site. It shows the software is there but it gives errors everytime I open PowerPoint, word, etc., and states its unregistered. What a waste of time and money."
        },
        {
          "Note": 3,
          "Lieu": "CA",
          "Pseudo": "joe",
          "Nb_Reviews": 1,
          "Date": "2016-12-13T10:05:11.000Z",
          "Titre": "did not receive product",
          "Contenu": "Purchased product online and did not receive email key within what I would have considered a timely manner. Phone not answered during normal business hours nor email replied to.  Finally received product key. Please explain how your process works online and normal delays which may be encountered in receiving product. \"product key\" sent implies an imminent delivery !"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jai Son Cue",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T21:22:59.000Z",
          "Titre": "Rude customer service",
          "Contenu": "\"Fabian was helpful in logging in and remotely activating my product for me\" then forced me to write this review and submitted this himself. Since then this is my update. Where I did receive the product that I requested, I do not appreciate the way it had to be done."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "John Grossenbacher",
          "Nb_Reviews": 2,
          "Date": "2018-03-30T17:33:24.000Z",
          "Titre": "OPEN MON-FRIDAY 0800 to 1700 PT",
          "Contenu": "The company needs to provide hours of operation in the message that is reached when attempting to contact Technical Support. As it is now, all the recording does is say that \"NO-ONE is available to help at this time\". If I had known that contacting during the hours of 8a to 5p PACIFIC time would have put me in contact with a technician days earlier. Jason the technician was able to identify and remedy the issue but in order to connect with him took several frustrating attempts."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Rob Carson",
          "Nb_Reviews": 2,
          "Date": "2017-10-02T20:45:01.000Z",
          "Titre": "After a fair amount of hassle (and a poor review), they made good on the sale to me.",
          "Contenu": "According to Microsoft support the software they sold me is pirated OEM software and the product key is blocked by Microsoft. I am still waiting for SotwareKeep to provide a legitimate regular licensed product key or refund my money.Update: After waiting several hours I placed the above review. Shortly after, a support supervisor, Anne, personally called me, emailed me a new activation code, and stayed on the phone until I got it installed and verified some of the applications included in the product was activated."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "J Putney",
          "Nb_Reviews": 1,
          "Date": "2017-10-05T22:08:40.000Z",
          "Titre": "Issue Resolved",
          "Contenu": "For some reason, after four months use with no issues, my copy of Win7 Pro was flagged by Windows/Microsoft as possible counterfeit.  I was unable to fully resolve the issue with SoftwareKeep to my own satisfaction.  They believe the cause was related to the installation.In the end, after many support chats, emails and calls, I was provided a refund outside of the normal refund/return window.Not 100% happy I'm having the authentication issue which will likely result in a complete clean install, but SoftwareKeep did make a real effort at an equitable solution."
        },
        {
          "Note": 3,
          "Lieu": "GB",
          "Pseudo": "S R",
          "Nb_Reviews": 5,
          "Date": "2020-03-18T18:03:09.000Z",
          "Titre": "I am only giving this company 3 stars",
          "Contenu": "I am only giving this company 3 stars, because I had difficulty getting the product downloaded, as the download button did not work.  The first person that I had helping me on chat, was not at all helpful.  I was angry and frustrated.  He was unable to help me, and eventually guided me to the Mcafee free trial download page.  I ended up installing a free one month trial.  I did not get what I had ordered. Thankfully, a second person that I spoke to, David, helped me.  He figured out the convoluted situation, and quickly and efficiently, solved my problem.  I give him 5 stars.  He is an asset to this company.  He saved my day!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Lisa White",
          "Nb_Reviews": 1,
          "Date": "2017-03-27T19:23:06.000Z",
          "Titre": "Not the greatest 1st experience....",
          "Contenu": "I will update this if possible after my issue is hopefully resolved.  I just ordered a digital download of MS Publisher 2016.  After waiting about 40 minutes after receiving my initial email that stated my digital purchase was on its way I used the \"chat\" option at the bottom of the screen to see if I could see what was taking so long.  A guy named Don was very nice and quickly responded.  However the answer given was that they temporarily ran out of codes and I will receive one immediately upon them getting more.  They were expecting this to be in the next 3-4 hours.  I'm hoping that is the case, time will tell......"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "George Jaskiw",
          "Nb_Reviews": 3,
          "Date": "2021-10-24T22:12:52.000Z",
          "Titre": "Product key would not associate with the software",
          "Contenu": "In August 2021, we purchased Windows 10 Enterprise LTSB 2016 65 bit. Sofrwarekeep had the best price we could find on the web. We downloaded the product and successfully installed it but but the provided product key would not associate with program we tried to register. After considerable on and off communications, repeated clean installations and online troubleshooting with the company representatives, SofwareKeep provided me with a different product key. This too would not  associate with the program. SofwareKeep then refunded me the purchase price. Overall, I lost considerable time during the repeated installations and troubleshooting and was delayed in my work. We turned to a different vendor, trustedtechteam.com Their product was marginally more expensive but it installed cleanly and the correct product key became associated with the version I installed"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brenda Williams",
          "Nb_Reviews": 2,
          "Date": "2021-02-09T00:58:01.000Z",
          "Titre": "Jesus was kind and patient with me and…",
          "Contenu": "Jesus was kind and patient with me now that I'm older.  To have someone fix stuff you used to be able to do but can fanagle the \"new\" stuff is wonderful.  Thank you Sir."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Priscilla",
          "Nb_Reviews": 1,
          "Date": "2020-12-22T18:47:55.000Z",
          "Titre": "Slow to email link",
          "Contenu": "I recently purchased a Microsoft Office link and was sent to a page that said they do their best to send the purchaser a passkey and link within 30 minutes. I was hoping to get it within that time limit and did receive an email with my invoice within 30 minutes but the email stated that the link would come separately. I waited slightly over an hour from the time I received the email before I contacted the website through live chat. I was helped by Carl who quickly sent over the link within a few minutes. I just wish they wouldn't boast about getting the link within 30 minutes and even display a timer unless they are completely sure it is possible to send in that time frame. Other than that everything went smoothly just disappointed about the amount of time it took to receive the link."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Kathy Gordon",
          "Nb_Reviews": 2,
          "Date": "2020-07-30T00:14:35.000Z",
          "Titre": "This was very confusing and difficult…",
          "Contenu": "This was very confusing and difficult to download.  I finally took it to my son-in-law and he works for Dell, and it took him several hours to figure out the issues.  Not user friendly."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ken Laura",
          "Nb_Reviews": 2,
          "Date": "2018-08-07T21:00:16.000Z",
          "Titre": "Multiple trials",
          "Contenu": "It took over three weeks and multiple emails to make the final solution work. The initial software key didn't work and I had to get two other ones before we could finally get it solved."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Jeremy Person",
          "Nb_Reviews": 1,
          "Date": "2020-09-28T16:35:15.000Z",
          "Titre": "poor overall experience",
          "Contenu": "Tech did fix my issue finally. However, 30 days later and two invalid keys for office project is a little ridiculous overall bad experience and wasted too much of my time"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "JJ River's Bend",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T22:58:32.000Z",
          "Titre": "I took 5 hours to download my version",
          "Contenu": "I took 5 hours to download my version. That was ridicuals. Loved Paul who helped me though the issues, he was patience. Again 5 hours is really unexceptable."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Peter",
          "Nb_Reviews": 2,
          "Date": "2019-08-20T23:12:20.000Z",
          "Titre": "They have great support",
          "Contenu": "They have great support, but I was disappointed they were unable to restore my word after it was deleted by Apple even though they had record of my purchase."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Susan L. Phillips",
          "Nb_Reviews": 1,
          "Date": "2018-01-01T00:44:29.000Z",
          "Titre": "The Software Didn't Work",
          "Contenu": "I couldn't get the software I ordered to download & asked for my money back.  I assume I will be getting it back."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Brandon Priddy",
          "Nb_Reviews": 1,
          "Date": "2020-06-16T02:44:30.000Z",
          "Titre": "you sent the wrong soft wear i ordered …",
          "Contenu": "you sent the wrong soft wear i ordered  to get magix acid studio 10 and got audio studio sound forge instead"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Mike",
          "Nb_Reviews": 1,
          "Date": "2018-03-22T20:11:12.000Z",
          "Titre": "Had issue, resolved quickly",
          "Contenu": "We had an issue with the Software Key, Management rectified the situation to our satisfaction, Very prompt!"
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Ara Sawayn",
          "Nb_Reviews": 1,
          "Date": "2022-07-23T16:31:52.000Z",
          "Titre": "Great 1st class service",
          "Contenu": "Great 1st class service, polite people, helpful."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Dr. Todd",
          "Nb_Reviews": 3,
          "Date": "2020-07-22T03:27:29.000Z",
          "Titre": "Disappointed... But, They Do Communicate",
          "Contenu": "In a nutshell:- I went to their website and selected Microsoft Office for Windows and Mac (download).- I went through the checkout process and then hit submit.- I received an email about 15 minutes later saying that they were 'verifying' my purchase and it should only take another 15 minutes.- A half-hour later, I contacted them via chat to find out the status of my order.  The person on the other end asked what kind of computer I had, and I told them a Mac.  They then told me that I had ordered the Windows version and gave me a link to the Mac version.-  They then cancelled my order and started to process a refund.-  I went back to the shopping cart and the version in the shopping cart said \"for windows and mac\".-  I sent an email to \"Chase\", who I guess is the owner or manager or customer service dude, with a screenshot of what I ordered and an explanation of what had happened. - 24-hours later..... no response.- I clicked on the link sent to me to purchase the Mac version.  Went through the checkout process and processed my payment.-  The payment never processed.  It just sat there.... and sat there... and sat there....  All the buttons on the page were disabled so I couldn't go back, or try again.-  I finally just gave up and ordered it directly from Microsoft.  It was more expensive, but at least I know that Microsoft is a reputable company.UPDATE:  A representative from the company reached out after seeing my review and apologized for the experience.  I appreciated the contact and have adjusted my rating based on the follow-up."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Colleen McAvoy",
          "Nb_Reviews": 2,
          "Date": "2018-03-13T21:27:18.000Z",
          "Titre": "Not the best but resolved the issue",
          "Contenu": "I still have not been able to reactivate MS Office pro plus 2016 on my new laptop.   License shows up related to my account but when I called Microsoft they told me it was a one time use license and coultd not be reused.   Dealing with support has been ridiculous.  They had me uninstall software on my old laptop and before installing on new and still I cannot use the license.   Software support called me and initiated a desktop support session which got disconnected and they never called me back.  I now have no usable software.  Sent an email to the desktop support team with all documentation and screen shots and then send back a survey?  This all started when I purchased MS home and office 2016 from them and they couldn't deliver a license number, so instead they \"upgraded\" me for free and sent a MS Pro Plus license number which is useless now.   I asked for them to just send me the license number for the software I paid for and still have not received a response. And I still do not have software reinstalled to use.  Wish I had pressed them for a refund to begin with.. I have a receipt for software I was never provided a key for.  Headed to the Microsoft site to get the software I need.  Microsoft told me directly that the license I was sold is no longer valid.UPDATE SINCE MY ORIGINAL POSTING>  Software keep immediately after seeing the awful review sent me a new product key and then started calling me about every 4 hours trying to get in touch with me to ensure the software could be installed and the key was valid.Since the key was always the issue, once I had a new key the installation was no problem."
        },
        {
          "Note": 3,
          "Lieu": "US",
          "Pseudo": "Celia Knoll",
          "Nb_Reviews": 2,
          "Date": "2020-06-23T16:08:17.000Z",
          "Titre": "I had Mustafa today",
          "Contenu": "I had Mustafa today, very helpful and knowledgeable"
        },
        {
          "Note": 4,
          "Lieu": "PK",
          "Pseudo": "Daily Rush",
          "Nb_Reviews": 1,
          "Date": "2023-11-02T16:22:15.000Z",
          "Titre": "SoftwareKeep is a website that sells software licenses at a discounted price.",
          "Contenu": "SoftwareKeep is a website that sells software licenses at a discounted price. The company has a wide selection of software available, including operating systems, productivity suites, security software, and more. SoftwareKeep also offers a variety of services, such as software installation and support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Melanie  MacLennan",
          "Nb_Reviews": 2,
          "Date": "2022-11-24T16:31:37.000Z",
          "Titre": "SO I bought a word copy from soft keep",
          "Contenu": "SO I bought a word copy from soft keep. I got good instructions but they didnt work. I went on their chat which I got immediately, and received the same instructions. I went back and chatted with Joe and got a link that was direct and should have been on the instructions- its worked quickly and correctly and I downloaded and installed the soft ware!  Thanks!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark Rossignol",
          "Nb_Reviews": 1,
          "Date": "2023-09-24T00:42:10.000Z",
          "Titre": "Great support Staff",
          "Contenu": "Able to assist in the correction of my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vera",
          "Nb_Reviews": 2,
          "Date": "2022-08-23T22:56:00.000Z",
          "Titre": "Joe was quick to respond",
          "Contenu": "Joe was quick to respond to my question.  My order was upgraded, without my knowledge."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Greatful Customer",
          "Nb_Reviews": 1,
          "Date": "2023-05-18T20:25:09.000Z",
          "Titre": "Emre was very helpful in getting my…",
          "Contenu": "Emre was very helpful in getting my Microsoft Office reinstalled and verified."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John Clark",
          "Nb_Reviews": 1,
          "Date": "2022-09-29T18:15:09.000Z",
          "Titre": "very helpful and helped to resolve the…",
          "Contenu": "very helpful and helped to resolve the issue"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angel",
          "Nb_Reviews": 1,
          "Date": "2022-06-05T00:33:16.000Z",
          "Titre": "Activation iffy at start but with help was easy",
          "Contenu": "When I typed my activation key at first it said that the key was already activated on another computer. I called customer service and they quickly showed me what to do, gave picture visuals of what to do correctly, and gave me what I needed swiftly and easily."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "CJ C",
          "Nb_Reviews": 1,
          "Date": "2022-02-08T04:57:45.000Z",
          "Titre": "I bought windows 11 pro",
          "Contenu": "I bought windows 11 pro.  Installation was not happening.  1 tech gave me bad advice (SEVERAL TIMES...kept getting the same one....)  Then i met Adin, that guy ROCKS!!!  He not only figured out what was wrong but also fixed it himself.  Without that guy, i would have been getting a refund.  The only reason this is 4 stars, is the previous tech otherwise its 5 stars!!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jeffery Mitchell",
          "Nb_Reviews": 1,
          "Date": "2022-01-27T00:08:50.000Z",
          "Titre": "I was in the market for MS Word",
          "Contenu": "I was in the market for MS Word. I ran across another website that offered the product with more features for half of the price. I ran across your website and opened the chat with Carl who was patient and helpful in answering all of my questions. H e did such a good job that I ended up purchasing the product even at a larger cost because of his informed counsel. Thanks Carl."
        },
        {
          "Note": 4,
          "Lieu": "SI",
          "Pseudo": "Ivan Marolt",
          "Nb_Reviews": 1,
          "Date": "2022-05-25T11:43:31.000Z",
          "Titre": "My business works due to this company",
          "Contenu": "My business required a brand new computer software for running marketing campaigns and creating incredible videos with the  highest qulity available for today. Thus, I always choose only reliable companies which serve people and IT companies for many many years. I thought that it would be good to apply to this company and find out what they propose. It turned out the quality of computer software provided here is an outstanding and I was convinced in it after acquiring this software. Without a doubt, this is my favorite company when it comes to various issues with software. I know for sure they will handle any task. Cheers."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steven Schuyler",
          "Nb_Reviews": 4,
          "Date": "2022-04-23T21:42:14.449Z",
          "Titre": "My Windows crashed and Eric helped me…",
          "Contenu": "My Windows crashed and Eric helped me and was very patient and understanding. I had lots of questions and was stressing over not remembering passwords and all that sorts of stuff and I was not happy and he helped me find the answer that was right for me!"
        },
        {
          "Note": 4,
          "Lieu": "NG",
          "Pseudo": "shaibu patrick",
          "Nb_Reviews": 11,
          "Date": "2022-03-25T22:57:29.000Z",
          "Titre": "Review Of Softwarekeep: The Best Software Backup And Recovery Solution?",
          "Contenu": "Softwarekeep is a software company that provides backup and recovery solutions for businesses. I was recently approached by them to do a review of their product. I have to say, I was really impressed!The software is easy to use and can be installed in minutes. It's a cloud-based solution, so there's no need to download or install any software on your computer. Plus, it's affordable and doesn't require any monthly fees.Overall, I was really impressed with Softwarekeep and would definitely recommend it to anyone looking for a reliable backup and recovery solution."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Steve Yoho",
          "Nb_Reviews": 2,
          "Date": "2022-04-12T20:18:29.000Z",
          "Titre": "I was having some confusion with running the software for the first time after installation.",
          "Contenu": "I was having some confusion with Microsoft messages that I was receiving while attempting to run the Microsoft Office products for Mac I purchased through SoftwareKeep.com and Eric did a wonderful job troubleshooting and walking me through the process."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Martha Sample",
          "Nb_Reviews": 2,
          "Date": "2020-11-12T16:54:52.000Z",
          "Titre": "Frugal Lady",
          "Contenu": "I just finished a chat with Carl, He was so helpful and non-judgmental as this frugal lady tried to navigate her way to a deal for software.  If he could have found me a better deal than the 10% offered, I would have given the experience a higher rating. As it stands, Carl is the reason for my four star rating but not the reason why I did not leave a five star rating. Carl is a ten."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Nathan Lizotte",
          "Nb_Reviews": 1,
          "Date": "2021-03-30T15:11:02.000Z",
          "Titre": "Carl solved my issue!",
          "Contenu": "Carl did great at capturing what the issue was. I have been struggling at dialing into what Mac version I have and what Office works best for it. After I could not connect to the server twice, Carl was able to come up with a solution for me and get me on my way. I can finally get to work at home! Thank you for the service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ned Helwig",
          "Nb_Reviews": 1,
          "Date": "2021-04-03T14:50:51.000Z",
          "Titre": "Joe was able to answer all my question, left out just 1 thing",
          "Contenu": "Joe was able to answer all my questions promptly. He seems quite knowledgeable about Office products and, as a result, I am buying Office 2019 Home and Student from you now, thanks to Joe.UPDATE: Turns out to not be what I was looking for so I cancelled. This version requires a digital download and I wanted the software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Diane B",
          "Nb_Reviews": 1,
          "Date": "2021-05-09T01:49:35.000Z",
          "Titre": "Technician Paul provided superb support.",
          "Contenu": "After purchasing MS Office 2016 from Softwarekeep we had trouble with the download.  It showed as an image and we didn't know how to get to the excecutable file to actually activate the program.  When we called in Paul came on and helped us get the program installed so it worked properly.  It took quite awhile -- because my computer is old -- but Paul hung in there until he had verified that we were able to access all the different programs within MS Office.  He was very patient and helpful.  Thanks again!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lisa Dean",
          "Nb_Reviews": 1,
          "Date": "2020-07-28T15:50:03.000Z",
          "Titre": "Great job, MUSTAFA!",
          "Contenu": "I concur w/ a previous gentleman's comments about the technology piece...never recv' a \"4-digit code\" to help w/ the installation process prior to inputting the Product Key, but nevertheless, Mustafa did a great job once we were remotely connected to get me up & running w/ the Microsoft Office for Mac software.  Sincerely appreciated his knowledge and patience."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pierre Grinspan",
          "Nb_Reviews": 1,
          "Date": "2020-07-18T20:49:21.000Z",
          "Titre": "A bit worried at first, but all good in the end",
          "Contenu": "The website looked a bit shady at first, and after paying through Paypal it wasn't very clear what the next steps were, but it turns out they get your email through Paypal and email you a download link & license key within 15 minutes... and they did! The live-chat guy (Mustafa) was helpful in reassuring me about the process, and they kindly waited on the line until I got the download link."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Hoelewyn",
          "Nb_Reviews": 1,
          "Date": "2020-10-01T17:27:57.000Z",
          "Titre": "Great deal. Delivery could have been better",
          "Contenu": "So I was really pleased that I could get Windows 10 at a discounted price. The delivery of the product was not super smooth, and took around 40 minutes of waiting and contacting support. However, Carl the support person was very helpful and got the problem resolved. It would have been nice to have no issues, but I was still content with the purchase."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Aileen",
          "Nb_Reviews": 5,
          "Date": "2021-01-28T15:17:21.000Z",
          "Titre": "download problem",
          "Contenu": "Joe helped me with a problem I had with downloading as i found that the microsoft account was in my husband's name and wasnt sure if I should continue with the download if I didnt have a microsoft account in my own name . He was very patient indeed even when I couldnt manage to get the laptop to allow remote access ."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Anon",
          "Nb_Reviews": 1,
          "Date": "2020-09-23T18:53:17.000Z",
          "Titre": "Great price",
          "Contenu": "Great price, and great customer service. I made a purchase, and although the initial instructions on how to receive the software weren't clear, I worked with customer service rep Anne, who followed up on the status of my order and walked me through how to download my purchase. I recommend keeping your order number, registering an account with safekeep, and following up with the customer service chat feature if you haven't received an email in 30min."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandi Kuykendall",
          "Nb_Reviews": 1,
          "Date": "2021-01-24T20:55:28.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "My product would not activate.  I contacted customer service through the chat and Carl answered.  He was friendly and patient while I retrieved the information he needed.  Within 10 minutes, my product was active and ready to use.  I didn't even get frustrated or aggravated!   Lol.  Awesome customer service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chryl McCarty",
          "Nb_Reviews": 1,
          "Date": "2021-02-23T16:45:22.000Z",
          "Titre": "Remedied situation",
          "Contenu": "I ordered software on a Sunday, but did not receive it, so contacted Softwarekeep via Chat on Tuesday.  Carl was very helpful in remedying my situation.  There were no longer licenses for the product I purchased, so I was offered a package product that included what I was looking for.  Thank you, Carl."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "James Healy",
          "Nb_Reviews": 2,
          "Date": "2020-05-10T14:50:25.000Z",
          "Titre": "Every time I have to put in a new…",
          "Contenu": "Every time I have to put in a new program into the computer, I cringe. (Needless to say, I'm far from being a computer nerd.) Once in a while, I find a program that needs nothing on my behalf to install it, not even a brain. Office needs some thinking, and that is my downfall. But, when everything is said and done, I was finally able to get things done."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Kathy E",
          "Nb_Reviews": 1,
          "Date": "2020-01-25T19:00:32.000Z",
          "Titre": "Frustration ends with a positive outcome",
          "Contenu": "This was a frustrating experience as the download process failed three times. When it finally loaded, it was not compatible with my existing software. Mark to the rescue. He discovered the problem and offered to upgrade my software package...at no additional cost. He stayed with me during much of the process and was quick to respond when I had questions. I am not an IT/Geek and he was patient and efficient. Thank you Mark!"
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "vivian dibert",
          "Nb_Reviews": 2,
          "Date": "2020-07-26T13:27:35.000Z",
          "Titre": "I did have a few problems downloading…",
          "Contenu": "I did have a few problems downloading the product but I think that was mainly due to my ineptitude with computers! I contacted the help team and was guided through the process by a chap named Jesus. He certainly worked miracles for me!All elements of the product work well and knowing there is back up available is very reassuring."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lois Schwieters",
          "Nb_Reviews": 1,
          "Date": "2020-04-06T22:57:44.000Z",
          "Titre": "Thanks for sticking with me as most of…",
          "Contenu": "Thanks for sticking with me as most of this is foreign to me, but husband is fairly familiar and it was confusing him too.  It would seem there could be a much simpler process, step by step.  It was very confusing when we had trouble downloading the Zoho Assist as the paperclip you were talking about was under the Zoho Assist block and I couldn't move either the chat or the Zoho.  Only after I 'x'd the Zoho Assist could things move on."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Theater Mom",
          "Nb_Reviews": 2,
          "Date": "2020-09-05T22:59:19.000Z",
          "Titre": "Helpful info given by Jesus, before my purchase.",
          "Contenu": "Received help in placing an order for MS Office.  Jesus helped by answering questions about find the best software package for MS Office for my MacBook Pro and answering my questions re: setting up a Microsoft account.  I still have a few questions, but Jesus was able to answer my questions at the time before my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Bronson",
          "Nb_Reviews": 1,
          "Date": "2021-01-08T23:55:35.000Z",
          "Titre": "Good Customer Service",
          "Contenu": "The service tech, Joe, was very helpful. He hung in there until all probems were resolved.Sadly, the overal experience I had with the purchase was less than stellar. I was led to believe that it would take as much as 30 minutes to receive the key and download link.An hour later I got ahold of Joe.His people informed him it would be another 15 minutes.After 45 minutes, I asked Joe again.This time the email came thru right away.Like I say, Joe hung in there all that time to make sure it got done, so Kudos to him!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Davis Allen",
          "Nb_Reviews": 1,
          "Date": "2021-05-21T17:06:33.000Z",
          "Titre": "I purchased Windows 10 Pro from Softwarekeep",
          "Contenu": "I purchased Windows 10 Pro from Softwarekeep and received excellent initial service with my order.  After I tried to activate my license multiple times, I contacted support.  It was determined that I was given the wrong product license key with my order confirmation.  After several timely exchanges of emails with the support team, I had the correct license key and was on my way.  I would have rated my experience a full 5 had I not had to go through incorrect license key issue.  Thank you support team!!!!!  I appreciate your timely responses to my issue."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Kenneth",
          "Nb_Reviews": 1,
          "Date": "2019-10-23T20:46:37.000Z",
          "Titre": "Softwarekeep has a great support staff…",
          "Contenu": "Softwarekeep has a great support staff and are able to remote into your computer and solve any problems with their product..Today, I was assisted by Don in their customer service/tech department to move my office product onto another device and although they were busy, it was none the less completed to satisfaction. 4 stars because it took a while but still happy with the support"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Randman",
          "Nb_Reviews": 1,
          "Date": "2020-03-28T19:26:24.000Z",
          "Titre": "Great customer service",
          "Contenu": "Fine price, quick and easy. The only reason no five stars is that something went wrong with the first download and Microsoft couldn't find my license after installation and I couldn't open my apps. Emir (on chat) helped me try a number of things until we finally uninstalled the apps, he sent me a new product key, and it downloaded and works just fine now. Emir was great. The whole process was a bit bothersome, but we got it done, and things work fine."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Brandon L. Milner",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T19:29:53.000Z",
          "Titre": "I got a product key for windows 10 that…",
          "Contenu": "I got a product key for windows 10 that got rejected by Microsoft. Within minutes of the issue, David waked me through the steps of verifying and then sent me a new product key that worked perfectly! if not for that one minor hiccup (the initial key not working) I'd give this a five star review: functional product, exactly as advertised and a lot cheaper than most other websites and retailers! If you need a new OS, come here and ask for David: He's worth the fifth star!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deliver on Demand",
          "Nb_Reviews": 2,
          "Date": "2020-06-04T19:11:16.000Z",
          "Titre": "All in all I had a great experience!",
          "Contenu": "All in all I had a great experience. Initially I had a little bit of a hiccup with the product download not being the correct version. I was able to instantly get in touch with Mustafa, and he in a couple of minutes had the solution. After a couple of more sentences I was happy again. Thanks Mustafa and Softwarekeep!"
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Hali",
          "Nb_Reviews": 2,
          "Date": "2021-02-01T20:51:27.000Z",
          "Titre": "Carl was very pleasant and helped me…",
          "Contenu": "Carl was very pleasant and helped me with my questions.  I understand that there are a lot of clients looking for help and staffing can be a tough situation, however, there were a few times I waited quite awhile.Having said that, I am very satisfied with the experience as a whole."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Rob",
          "Nb_Reviews": 1,
          "Date": "2019-03-07T21:55:31.000Z",
          "Titre": "As I am not adept, the assistant was very patient and helpful",
          "Contenu": "Out of my own error, I downloaded a word program and used the wrong signin, so it wouldn't work.  I got online and though I had to wait a few times, Jaysen helped me through some frustrating moments, a disconnection, and my own ineptitude at systems.  He got it to work, for which I am grateful.  Never rude, always polite and patient.  I recommend the service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dave D",
          "Nb_Reviews": 4,
          "Date": "2020-02-02T19:42:35.000Z",
          "Titre": "great experience.",
          "Contenu": "Softwarekeep was great to work with. Since I had issues with two other vendors for Office products, I was leary when they upgraded my order. The support techs answered all of my questions in a timely manner. I would have given them 5 stars, but I did not like the fact that they upgraded my order before consulting with me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Susan",
          "Nb_Reviews": 1,
          "Date": "2020-07-01T21:40:45.000Z",
          "Titre": "I had difficulty installing software…",
          "Contenu": "I had difficulty installing software I'd purchased. Joe walked me through the steps. It took a few different routes to get it to work. In the end, it seems like it had already been installed, that it was the installation instructions that were lacking, but Joe helped me figure it all out."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TSERV",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T14:08:59.000Z",
          "Titre": "I ordered a standalone copy of…",
          "Contenu": "I ordered a standalone copy of Microsoft Excel so I could install it for use with an ERP solution. The delivery of the product (download) was a bit slow, but maybe I was impatient. I received the product, and I installed the product without issue. I would certainly buy from this place again."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Russell Maynard",
          "Nb_Reviews": 2,
          "Date": "2020-07-08T18:47:54.000Z",
          "Titre": "Got more than I needed",
          "Contenu": "I placed an order for a copy of MS Office, but somehow I was billed for 2 copies.  Jesus helped me and arranged for a refund for one copy.  Strange thing was that I did not recieve any email regardng the first order.Anyway, Jesus was able to resolve the issue in a fair amount of time"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "TS",
          "Nb_Reviews": 1,
          "Date": "2021-01-18T20:24:33.000Z",
          "Titre": "Carl was excellent via Chat, voice support not answer",
          "Contenu": "Carl was excellent via Chat and resolved my issue.  It would have been 5 stars had I not called in for support initially before using chat and listened to a ring-no answer for about 3 minutes then an automated voice telling me to call back later, then a disconnect."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Robert Malinchock",
          "Nb_Reviews": 2,
          "Date": "2020-06-23T14:11:30.000Z",
          "Titre": "I got it up and running!",
          "Contenu": "I got it up and running! Had a download problem. Joe quickly got it resolved. Only reason I didn't rate 5 stars is because of your process. Both Joe and Jesus (I mistakenly cut him off) requested me to snip a screen, something I have never done. Too much pressure to learn it while on a chat (I'm 78). I suggested that both just go to the sites I was given in the email and see what I saw. But by the time I sent the suggestion in, Joe gave me a new location from which to download. From then on it was a piece of cake. Thanks Joe (and Jesus)!Bob"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dmitriy Redka",
          "Nb_Reviews": 4,
          "Date": "2019-01-26T21:30:38.000Z",
          "Titre": "Great price on MS Office from SoftwareKeep",
          "Contenu": "Placed my order for MS Office 2016 on Wednesday 5:47 PM and received the product key the next day,  Thursday 7:46 AM.  The price was very competitive. There were no issues installing the software and registering it. I'm very happy with my purchase. Minus 1 star because it took a while to get the product key."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Vicki Bermudez",
          "Nb_Reviews": 4,
          "Date": "2021-01-31T15:06:22.000Z",
          "Titre": "Above and beyond",
          "Contenu": "Emir was able to make a rather complicated installation for me, which I appreciated very much. Then I requested something which he had to research, and he promised to email or call me back later.  I have every confidence that he will do that, just as he said."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bill Stackhouse",
          "Nb_Reviews": 2,
          "Date": "2019-04-18T00:47:50.000Z",
          "Titre": "Purchasing MSOffice",
          "Contenu": "After purchasing, which works very well, and during the purchasing process no information is provided that says anything about the fact that within 15 minutes the key code will be sent.  One is left with the idea that one has been bamboozled out of money.  Other than that, it seems to be a 5 star deal."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob Freeman",
          "Nb_Reviews": 1,
          "Date": "2020-04-30T18:41:26.000Z",
          "Titre": "WAS ON WITH MUSTAFA THIS MORNING",
          "Contenu": "WAS ON WITH MUSTAFA THIS MORNING. HE WAS VERY GOOD AT GETTING THE SOFTWARE INSTALLED. I AM STILL NOT SURE WHY I COULD NOT DOWNLOAD THE SOFTWARE, MS OFFICE 2010, AND USE THE GIVEN PRODUCT KEY. THERE WAS SOMETHING WRONG WITH THE LINKS AND THE INSTALL. ALL'S WELL THAT ENDS WELL."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Andrew McGovern",
          "Nb_Reviews": 1,
          "Date": "2020-06-01T20:27:13.000Z",
          "Titre": "Microsoft review",
          "Contenu": "I had a helpful guy Joe I think his name who assisted me to fix my Microsoft account and setup my office home and student. His help is much appreciated. The only problem was him not admitting his real name Quir and telling me it was Joe. Im not sure though. Good Service!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Heidi Sue LeBoeuf",
          "Nb_Reviews": 1,
          "Date": "2020-10-09T15:45:01.000Z",
          "Titre": "Turned out fabulous in the end",
          "Contenu": "Joe and I got off to a rough start, but after I communicated that their mocking was offensive, they made a complete turn around and became tremendously helpful.  Joe kindly upgraded my purchase, which was totally unexpected and genuinely appreciated and it helped me learn that Joe may have a sense of humor that may not translate well in text.  I'm so grateful for Joe's support in the end and I never expected to be able to continue having Joe as a support if I have any future troubleshooting needs.  So in the end it was a great experience and I'm grateful for Joe's support."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Louis Voit",
          "Nb_Reviews": 2,
          "Date": "2017-12-07T15:52:58.000Z",
          "Titre": "great chat support unfortunately I …",
          "Contenu": "great chat support unfortunately I could not resolve the problem.  Still can NOT get the Win10 download to work on my laptop.. just a glitch in the system.  Lenova may have just forgotten to enable the upgrade of this machine.  Who knows??I hope I can get a refund on the transaction??  or just $99 lost."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard",
          "Nb_Reviews": 2,
          "Date": "2020-04-10T16:01:53.000Z",
          "Titre": "Joe was helpful",
          "Contenu": "Joe was helpful, and solved the problem quickly.  I rated at 4 stars not because of Joe, but because I had a computer problem that demanded reset and your license for my product previously purchased became invalid. I had to repurchase the software.  That seems unfair."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Chuck",
          "Nb_Reviews": 2,
          "Date": "2021-02-18T01:35:09.000Z",
          "Titre": "Ping was my chat tech",
          "Contenu": "Ping was my chat tech. My problem was solved but it took a long time for the first response and there were several times when the tech's answers were delayed by several minutes, I suspect the tech was working multiple cases at the same time."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jan Schardt",
          "Nb_Reviews": 1,
          "Date": "2020-06-02T18:25:00.000Z",
          "Titre": "I purchased Microsoft Office…",
          "Contenu": "I purchased Microsoft Office Professional Pro 2010. The price was excellent but when I put in the product key it would not accept it. The company was able to provide me with a new key and remotely installed it for me so I would not have to uninstall the program."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sharon Mitchell",
          "Nb_Reviews": 1,
          "Date": "2020-09-19T23:23:22.000Z",
          "Titre": "I purchased Microsoft's Office program…",
          "Contenu": "I purchased Microsoft's Office program and had a great problems activating with the number that was given me.  After several phone calls, one of them to Allan, my program was activated.  He was very helpful.  It was simpler in the old days.Thank you."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jazz Elzea",
          "Nb_Reviews": 2,
          "Date": "2021-02-25T21:29:18.000Z",
          "Titre": "Pricing, Company & Business Local Legitimacy",
          "Contenu": "I was concerned about the price being so low and thought this was a scam, as the original price for the product I requested was a difference of $300. I was assured by Joe, the support team member via chat, that this was legitimate, was provided additional links to other customer reviews and answered all my questions as to the location of the business, how the discount is achieved and offered an additional discount as well. Overall, so far, very satisfied with the service, pending purchase and download of the software. Covid forced lay off and funks are tight, so being financially scammed right now would be a double-downer. Thanks Joe"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Satisfied Customer",
          "Nb_Reviews": 2,
          "Date": "2020-06-01T19:59:38.000Z",
          "Titre": "I purchased Microsoft Office Home and…",
          "Contenu": "I purchased Microsoft Office Home and Student 2019 along with a Usb Software Backup from Softwarekeep.  I had researched the company to make sure they sold legitimate Microsoft products because the price was over a third less than purchasing it from a local store. I am not \"techno savy\" so I must say that the installation instructions were not as detailed as I needed (that's why I took away a star).  After 2 days and several tries, I contacted the company through the Chat Room.  Mark was very helpful and installed the software remotely for me.  I am now very pleased with my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mary Kubal",
          "Nb_Reviews": 1,
          "Date": "2021-05-01T21:32:19.000Z",
          "Titre": "Minus one star…",
          "Contenu": "Taking off one star for the sneakiness here.... Of course in researching Softwarekeep you might check out the reviews and see only positive ones because this is where they send you after helping you. Let's see if I have problems again after another \"update\", which apparently is a Microsoft update...which happens often!!! I didn't get any other explanation for why my activation key wasn't working. I'll need to reach out again to support if it happens again. But overall, the support staff was somewhat helpful. It took 3 attempts in calling them to get towards a solution. And my questions weren't entirely being answered."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Cal B",
          "Nb_Reviews": 1,
          "Date": "2020-11-24T23:34:22.000Z",
          "Titre": "Poor instructions but excellent support…",
          "Contenu": "I had some difficulty activating MS Publisher.Joe was quick to respond and help me out.He spend just a few minutes to get it working as it should.I think the instructions were somewhat garbled and may have caused this problem.Thank you Joe."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Dashlane Customer",
          "Nb_Reviews": 3,
          "Date": "2019-01-29T06:03:23.000Z",
          "Titre": "Ordering process went without a hitch",
          "Contenu": "Ordering process went without a hitch. Initial email from SK had a broken URL. Chatted with Tim and got a workable one and downloaded. Haven't installed yet but anticipate no problems.I was impressed with the prompt chat session since this was on a Sunday. Many thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "MS Word Purchaser",
          "Nb_Reviews": 1,
          "Date": "2020-05-29T14:34:39.000Z",
          "Titre": "Great customer support, awkward purchase mechanism",
          "Contenu": "Joe was super helpful on chat, but I did find the purchase process a little nerve-wracking and confusing. the 15-minute window between purchase and download makes me nervous! I accidentally clicked \"back\" and thought I had lost my purchase."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Gary",
          "Nb_Reviews": 2,
          "Date": "2017-11-09T05:18:43.000Z",
          "Titre": "Got things working as quickly as possible",
          "Contenu": "Got things working in a relatively short amount of time.  My only suggestion would be to provide more feedback when the user, me, has to wait for something.  there were a few times I was not sure what was going on or if the connection had been lost because the person helping didn't provide enough feedback Like \" i'm researching and will get back to you in a couple of minutes\"  or '...I'm still here just following up on a lead...\" or something like that.  But over all I can't complain since s/he fixed my problem.thanks!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "LORRAINE Michlin",
          "Nb_Reviews": 2,
          "Date": "2021-01-17T08:59:06.000Z",
          "Titre": "Anne on chat got office activated",
          "Contenu": "When I tried to activate the MS office I purchased on line using the activation key provided MS rejected it.  I used chat to contact SofwareKeeper and was helped by Anne. She was very patient with me and helped me get Office activated."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "A King",
          "Nb_Reviews": 1,
          "Date": "2021-02-21T16:12:20.000Z",
          "Titre": "Product didn't activated right away… Carl helped me out in a few small steps",
          "Contenu": "Product didn't activated right away with Mircosoft office activation wizard. I went to my email and found a chat link at the bottom,  which I was able connect with Carl. I provided my order number and what error I was receiving which was that product key has already been activated the maximum number of times. He asked me to Open any program and then from the activation wizard, Kindly select phone activation. Take a screenshot of the Installation ID and send it here so I could activate your software. He took a few mins and gave me my confirmation ID and I went back to Activation wizard entered my ID and it successfully worked. Thanks Carl."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2020-07-15T18:48:19.000Z",
          "Titre": "Nice job",
          "Contenu": "Just completed an exchange of a difficult product fulfillment experience. Strange because I had purchased from here several times without issue. Chatted with Jesus who completely resolved my issue and restored my confidence in using this company."
        },
        {
          "Note": 4,
          "Lieu": "CO",
          "Pseudo": "William Pulgarin",
          "Nb_Reviews": 1,
          "Date": "2020-08-23T00:40:34.000Z",
          "Titre": "The measure of any good company is what…",
          "Contenu": "The measure of any good company is what they do when things go wrong. I was able to get a lot of help from Ray during some issues with the license I purchase. It turned a seemingly crappy situation into something workable and fair. Thanks Ray."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Marcia LaVille Schwendiman",
          "Nb_Reviews": 1,
          "Date": "2020-12-30T20:44:44.000Z",
          "Titre": "Problems solved!  When my purchased Microsoft Office…",
          "Contenu": "When my purchased Microsoft Office software would not load onto my computer, JD took over and made it work. While not being able to do it myself was frustrating, JD managed to fix the problems that I would never have been able to fix."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Jackie Snell",
          "Nb_Reviews": 4,
          "Date": "2019-07-27T01:22:53.000Z",
          "Titre": "Windows 10",
          "Contenu": "I purchased Windows 10 because I had Windows Vista and it is know longer around so I have to start all over.  I am having trouble installing windows 10 on my computer.  The people that I have talked to in the live chat were very helpful each one got me a little further setting up Windows 10 but I just cannot get the last part.  I don't know what I am doing wrong.  I might be contacting them again next weed and maybe then I will get set up.  But, so far I am completely satisfied with Softwarekeep even though I am having trouble.  Ask me again in a couple weeks then I might rate it 5 stars."
        },
        {
          "Note": 4,
          "Lieu": "PH",
          "Pseudo": "bernadette ocampo",
          "Nb_Reviews": 1,
          "Date": "2020-05-28T16:28:07.000Z",
          "Titre": "Hi there!",
          "Contenu": "Hi there!I talked to a previous representative and it was David and Mustafa. They help me with more information though I don't know if I can fix it alone. But they help me so much! Thanks for the great customer service!Be safe everyone."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Doug Overacker",
          "Nb_Reviews": 1,
          "Date": "2021-03-05T01:39:56.000Z",
          "Titre": "Carl helped me register my software",
          "Contenu": "Carl helped me register my software. I got everything installed but I couldn't register my software with the code I was given but he gave me a new code and when I had trouble with that, he managed to fix it for me. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mord Horn",
          "Nb_Reviews": 1,
          "Date": "2020-05-07T11:15:26.000Z",
          "Titre": "Great customer service!",
          "Contenu": "They upgraded my product for free, which was nice. The product came with a virus that crashed my computer entirely, causing me to have to pay for repair. Upon contacting them about the issue, they issued a refund. I appreciate their response."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Barbara Silberman",
          "Nb_Reviews": 1,
          "Date": "2021-04-10T13:44:04.000Z",
          "Titre": "Excellent help, a lot of noise",
          "Contenu": "Ray provided excellent help.  Sent email saying he was running late on another call but didn't say he would call when he finished on that call. That would be helpful.   Also, a lot of background noise, including a dog."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Lia Serina Sparacino",
          "Nb_Reviews": 1,
          "Date": "2020-03-26T19:48:42.000Z",
          "Titre": "Wonderful customer service.",
          "Contenu": "I had a good deal of trouble being able to download the correct software for my PC, and Joe not only helped me figure out what the problem even was but also took me through getting a refund and directions on where to find the right software."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Leann S.",
          "Nb_Reviews": 1,
          "Date": "2020-10-22T21:58:03.000Z",
          "Titre": "I purchased MS Publisher",
          "Contenu": "I purchased MS Publisher.  It didn't download so I chatted with Jesus.  They were out of licenses for it, so they gave me Pro for the same price.  I give Jesus a 5, but the company a 4 for selling something they were out of..."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Daphne Helena",
          "Nb_Reviews": 1,
          "Date": "2020-06-10T21:06:23.000Z",
          "Titre": "I received an email with an code for…",
          "Contenu": "I received an email with an code for Microsoft Word Student edition 2019. the code didn't work but I spoke to Mustafa on the Live Chat and he was super responsive and helpful. I received a new code via email and that did the job :)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Angela Dula",
          "Nb_Reviews": 1,
          "Date": "2020-06-25T04:50:19.000Z",
          "Titre": "Paul and I got off to a bad start",
          "Contenu": "Paul and I got off to a bad start. It seemed to take a long time for questions to be answered. He finally offered to take over my computer and download and install for me. This wet much faster and much easier on my part. Thanks Paul."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Bell",
          "Nb_Reviews": 2,
          "Date": "2021-04-03T01:40:14.000Z",
          "Titre": "Downloading MS Office required help",
          "Contenu": "I was unable to download my MS Office purchase using the link from Softwarekeep. It was a 4GB file and it wouldn't load faster than 500KBS and the download failed twice. I used the online chat and remote access for a tech to try to install the SW but the first attempt loaded for half an hour and failed at <40%. A second tech then had me load directly from Microsoft itself (I had never done this and he had to do it by remote access). That downloaded in minutes. The tech did all the clicks and MS Office loaded fine. Overall the process is excessively cumbersome and next time I'd pay for the software on a memory stick or other physical medium but the technical support was very good."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Craig",
          "Nb_Reviews": 1,
          "Date": "2021-01-01T21:34:06.000Z",
          "Titre": "Joe and I got off on the wrong foot at…",
          "Contenu": "Joe and I got off on the wrong foot at first.  But he was able to assist me with the issues I was having.  Being a bit skeptical for letting someone having control over my computer I did it anyway.Thanks for the help!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "That Daily Deal Customer",
          "Nb_Reviews": 2,
          "Date": "2021-05-13T02:29:26.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "Paul did a fabulous job of installing Microsoft Office on my computer. The only thing he could've improved on was explaining a little better how to get out of S mode. But I was really impressed in the end."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "Cathy Saint John",
          "Nb_Reviews": 1,
          "Date": "2017-10-20T21:12:07.000Z",
          "Titre": "Finally, after three days and twenty emails, I met Kay...",
          "Contenu": "Finally, after three days and twenty emails, I met Kay at Softwarekeep. Kay was proactive, knowledgeable and instrumental in getting my product problem resolved in a timely manner. Wish all service-technicians were as effective and efficient as Kay!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Sean",
          "Nb_Reviews": 1,
          "Date": "2020-11-19T21:21:00.000Z",
          "Titre": "I just ordered Publisher from…",
          "Contenu": "I just ordered Publisher from Softwarekeep. There was a slight issue with getting the activation email. with a quick chat with Joe he had fixed my problem and stayed on the chat until install was complete. Thanks Joe"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Mark",
          "Nb_Reviews": 1,
          "Date": "2019-01-31T23:35:03.000Z",
          "Titre": "Order Fulfilled (after a rough start)",
          "Contenu": "They made good on an error.  And for that, I give Softwarekeep a lot of credit.I had a rough start with Softwarekeep, as my order (Microsoft Office 2019 for Mac) was not initially fulfilled.  After placing my order, I learned that they were out of stock.  I was frustrated that they would \"confirm\" my order and charge my credit card if they were not able to fulfill the order.After a couple rounds of discussing options with their support staff, I was eventually contacted by a supervisor (yes, HE called ME back), who was able to fulfill my order.Thanks, Softwarekeep, for working hard to make a (frustrated) customer satisfied!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Bob",
          "Nb_Reviews": 1,
          "Date": "2020-10-23T18:27:10.000Z",
          "Titre": "Microsoft did not accept my key code.",
          "Contenu": "I was getting an error message from Microsoft saying the code key had already been used, and therefore I couldn't download the software.  Joe, the customer service agent, was able to obtain a new key code for me."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elissa Gonzalez",
          "Nb_Reviews": 1,
          "Date": "2020-10-28T15:05:53.000Z",
          "Titre": "Purchase went smoothly but then I…",
          "Contenu": "Purchase went smoothly but then I received an email that they were out of stock so I received an upgrade. I reached out to Joe who helped get that to me since I did not receive it via email. good customer service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "John",
          "Nb_Reviews": 1,
          "Date": "2021-03-24T21:21:50.000Z",
          "Titre": "Joe was instrumental for Office installations",
          "Contenu": "Joe was instrumental to make the Office 2010 installation. However, he needed to remove Office 2003 that we said we need it for network compatibility issues.He was able to re-install Office 2003 as well."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "ruth sproull",
          "Nb_Reviews": 2,
          "Date": "2017-11-09T16:11:21.000Z",
          "Titre": "Fast efficient service",
          "Contenu": "I had trouble installing the software because the activation keys didn't work but was able to get assistance immediately to resolve the issue. That it didn't work immediately for me without help is why I gave 4 instead of 5 starts."
        },
        {
          "Note": 4,
          "Lieu": "CA",
          "Pseudo": "M Smith",
          "Nb_Reviews": 1,
          "Date": "2020-04-29T20:26:47.000Z",
          "Titre": "I engaged SoftwareKeep via the chat…",
          "Contenu": "I engaged SoftwareKeep via the chat option as I needed some info and question answered related to two products they sell.  Joe answered all my questions and provided me a promo code to save some money.   Great service."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Banker",
          "Nb_Reviews": 2,
          "Date": "2021-02-02T18:38:23.000Z",
          "Titre": "Mixed results with Office 2019, lots of support needed (and delivered)",
          "Contenu": "This product has been problematic from the start.  It took 4 tries to get the installation right.  Then, a month later, something went wrong with the updater.  That was today's issue.  Luckily today I got Jesus who just happened to be the one that fixed the installation.  Today he also fixed the problem, by reinstalling it yet again.  In both cases he was able to explain what had happened and what he did to fix it.  Bottom line: Software Keep provides good support although some techs are not as skilled as others but I'd not purchase Office 2019 Home & Student again.  I'm on pins and needles waiting for the next problem to crop up.  It may be related to my Visio2007 that is also installed...time will tell."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "jerry wheeless",
          "Nb_Reviews": 1,
          "Date": "2020-07-17T15:00:52.000Z",
          "Titre": "Initial trouble, but good support.",
          "Contenu": "Bought product and received dead links in email. Initially had trouble contacting support, but managed to live chat with Joe and he gave me a good link and resolved all my issues getting product installed. Thanks."
        },
        {
          "Note": 4,
          "Lieu": "GB",
          "Pseudo": "Neil LeMond",
          "Nb_Reviews": 1,
          "Date": "2017-12-22T20:29:29.000Z",
          "Titre": "Slight hitch activating product, but good support from Joe.",
          "Contenu": "Bought a product (MS Office 2016) from UK site, only to find I couldn't activate because I was in wrong region (I am in UK). Live chat with JOE resolved the issue very quickly, so I would rate their tech support (Joe, at least!)."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pam",
          "Nb_Reviews": 1,
          "Date": "2021-02-11T06:51:08.000Z",
          "Titre": "HelpedI",
          "Contenu": "It took about 3 hours, but the Job got done.   I had to allow remote access to my computer which I did not want to do, but that seemed to be the only way.  Qlint hung in there and got it set up.  Thanks"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Richard Frank",
          "Nb_Reviews": 1,
          "Date": "2018-02-07T06:48:38.000Z",
          "Titre": "A job well done.",
          "Contenu": "I purchase windows 10 In this company. Since im not a computer literate, I had trouble in installing the software. I tried watching video in youtube but none of them really helps me. Then i decided to call their support team. I explain what i did and my incapability when in comes to technology. They tolerated my incompetence and explain all the details in english not in the tech word. They walk me through the process they also let me take notes what steps i should take and important details i need to keep in my mind. Now im writing this review in my windows 10 that i bough to them. They are really professional. I would recommend this to all of my friends."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Elisabeth Talis",
          "Nb_Reviews": 1,
          "Date": "2021-07-13T01:28:16.000Z",
          "Titre": "Downloading and implementing the new version of Microsoft Word: Daniel was extremely helpful!",
          "Contenu": "Daniel was extremely helpful and patient. He was willing to go the extra mile(s), take the time and help me get access to what I needed, so that I could do the work that is required of me to do. It seemed he may have had too many calls at once - during this time the process was slow, and communication was unclear. We did not have a great connection, but he was persistent, and an amazing help!  THIS HAS NOTHING TO DO WITH DANIEL - BUT There is a definite problem in getting access to documents that are not word (for example, like apple docs). There must be a way to make that an easier process, especially if the package is made for Macs! Daniel spent a lot of time assisting me with this issue as well, as my most recent resume(s) were not word documents. Thank you!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Phil Sanders",
          "Nb_Reviews": 4,
          "Date": "2018-04-02T13:02:18.000Z",
          "Titre": "Arnie was very professional even though…",
          "Contenu": "Arnie was very professional even though I had to purchase another license key when he was unable to repair the one that I was issued in Jan 2018.  The company offers great prices compared to off the shelf items from Microsoft."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Alyssa",
          "Nb_Reviews": 1,
          "Date": "2020-06-28T14:53:58.000Z",
          "Titre": "Great customer service !",
          "Contenu": "Great customer service !Haven't had a chance to install yet.. but I did not get the email to download software in the 15 minute window they say.  I opened the chat and Mustafa took care of it instantly !"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "David Smith",
          "Nb_Reviews": 3,
          "Date": "2021-04-17T07:28:46.000Z",
          "Titre": "One of the great customer support",
          "Contenu": "One of the great customer support service provided by Softwarekeep. Resolves all the queries quick and fast. Doing their work professionally. They also provide some amazing offers and discounts."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "San",
          "Nb_Reviews": 1,
          "Date": "2021-04-23T15:48:17.000Z",
          "Titre": "Joes was great",
          "Contenu": "Joes was great. He helped me place an order successfully when I encountered an error. He stayed with me through the process and waited until  I received an confirmation email. Thank you Joe!"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Pat Banker",
          "Nb_Reviews": 2,
          "Date": "2021-01-09T22:41:59.000Z",
          "Titre": "Week-old local Office version installation suddenly required login",
          "Contenu": "I was pleased to get through to a real person (Joe) almost right away.  That level of support is rare nowadays.  My problem was my 1 week old installation of Office 2019 suddenly required security information.  I didn't think that should happen since it is not an online version of Office.  We got Joe set up to see and control my screen and he fixed everything.  It was so fast, I have no idea what he did.  When asked why this happened, he said it was due to an Office 2019 update.  I haven't a clue when, why, or how such an update occurred so for now I've just taken his word for it that the problem is fixed permanently.  (Joe, if you read this...you said you would be my support person for future problems, but I forgot to ask how to contact you.)"
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Erika Lusk",
          "Nb_Reviews": 1,
          "Date": "2021-02-10T23:37:24.000Z",
          "Titre": "Good Service",
          "Contenu": "I got my software and my only complaint was that it did not work to activate online and needed to be activated by telephone. However, Ping was very helpful and got it activated promptly."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Ron",
          "Nb_Reviews": 3,
          "Date": "2021-04-01T21:43:41.000Z",
          "Titre": "Loved the fact that I could buy…",
          "Contenu": "Loved the fact that I could buy legitimate, licensed (older) MS software, e.g. Office 2013. (I ended up upgrading to 2019, but I could have replaced my original 2013 software with a new legal copy.)  I found some websites that were more expensive and others less expensive. When I purchased, the web page said \"working hard to deliver in < 30 minutes\".  It actually took ~10 hours. When I tried precisely use the download/activation instructions provided via email, they didn't work. So I had to reach out to the world-class support department. Joe did a good job. He worked with me for 2 hours to get operational.  I like the notion that Joe will be my \"personal tech\" for future issues. Joe was anxious to resolve issues quickly, and was persistent until we finally got it working."
        },
        {
          "Note": 4,
          "Lieu": "US",
          "Pseudo": "Deborah Schaeffer",
          "Nb_Reviews": 1,
          "Date": "2021-03-31T22:19:59.000Z",
          "Titre": "Helpful support from Joe but better protocol for ending remote sessions is needed",
          "Contenu": "I received very helpful support from the online technicians Daniel and Joe.  They were able to quickly address all my issues, and I gave remote access to Joe, who was able to help me download the software and get access to it.  My only discomfort came at the end, as I received no official confirmation that the remote session had ended.  I was unnerving to think of someone having access to everything on my computer.  I don't know why the \"Join\" software used in the remote session doesn't have a function where it states \"Joe has left the session and no longer has access to your computer.\"  But that is a big problem.  Please consider coming up with a solution to put customers' minds at ease regarding this issue.  Otherwise, I'm very happy with the support I received."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shoes In The City",
          "Nb_Reviews": 4,
          "Date": "2023-12-13T19:11:01.000Z",
          "Titre": "Again coming through as the best assist…",
          "Contenu": "Again coming through as the best assist around, Joe with software1985 is amazing, making it easy to access your laptop remotely and download what's needed.   A great group to work with, I highly recommend SoftwareKeep."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mario",
          "Nb_Reviews": 1,
          "Date": "2023-12-07T01:29:53.000Z",
          "Titre": "Thank You!",
          "Contenu": "Paul was able to resolve a significant activation issue with the Microsoft software on my Mac laptop.  He was knowledgeable, courteous, professional, and patient with my numerous questions.  Thank You!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "customer",
          "Nb_Reviews": 2,
          "Date": "2023-11-19T00:25:43.000Z",
          "Titre": "Good price for the product",
          "Contenu": "Good price for the product. There were a few technical issues however the chat site was very helpful. Joe assisted and promptly corrected the issue. He was very helpful and efficient.{quite unlike the typical chat at other sites}. I am very pleased. Richard O"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "carl mcnickle",
          "Nb_Reviews": 1,
          "Date": "2023-12-05T18:22:12.000Z",
          "Titre": "Joe resolved my issue",
          "Contenu": "Joe resolved my issue. After fighting a reinstall for 2 days Joe fixed it in 5 minutes. Thank you."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robert lefaver",
          "Nb_Reviews": 2,
          "Date": "2023-11-30T06:22:32.000Z",
          "Titre": "I loved the camry",
          "Contenu": "The car is evil. He vgrooy. I've only had a car like this. and according to fourth version the really stepped there game up now it's by the thousands in a week or so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WayneC",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T19:10:12.000Z",
          "Titre": "Excellent value, installs and registers quickly and easily.",
          "Contenu": "I received my license for MS Office Pro 2019 within a few minutes of placing the order.  The install and license registration went very smoothly.The only bit that was a little confusing is that during the install, the MS pop up window said it was installing Microsoft 365 instead of the single purchase 2019 version.  I just accepted the install, and it installed the correct software version.That is a small error from Microsft, not from Softwarekeek. I've had the same confusing message when I've installed other MS products."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jack",
          "Nb_Reviews": 1,
          "Date": "2023-06-23T22:30:52.000Z",
          "Titre": "Daniel is the BEST!",
          "Contenu": "Daniel patiently guided me through a long process to correct a problem with a new MS Office license. It required re-downloading the app and several steps to activate the license again. Throughout the two hour session, he remained professional and most helpful. He exemplifies the kind of service we all wish we could get.  He deserves all five stars!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Marian Olson",
          "Nb_Reviews": 1,
          "Date": "2023-11-18T01:33:41.000Z",
          "Titre": "I have had a couple of problems",
          "Contenu": "I have had a couple of problems.  I have reached out to technical support both times and have received the help that I needed.  Joe was right there and took care of everything"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "TheCaveCreeker",
          "Nb_Reviews": 1,
          "Date": "2023-07-13T05:19:04.000Z",
          "Titre": "I had a gun to my head to get a project…",
          "Contenu": "I had a gun to my head to get a project done..... Paul was my Guru and is an absolute PRO!  I picked up the Office product and have a brand new computer.  Upon completion of my purchase, he had completely answered all my question...installed the software, made me giddy with the results, all within 17 minutes. Additionally, they have the best pricing anywhere. I will be telling all my associates about this terrific experience   Thank you Paul"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "DavidNelms",
          "Nb_Reviews": 1,
          "Date": "2023-10-11T20:13:58.000Z",
          "Titre": "I was hesitant to buy from the site…",
          "Contenu": "I was hesitant to buy from the site because i never heard of them, but i was very pleasantly surprise that minutes after paying for the software i got an email with the product and directions for it. I get emails about my product plus tips on using it. I would give a higher rating if it was available. Top notch and a huge thabk you. I will be buying from your site from now on. Dave"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cheri Fogelberg",
          "Nb_Reviews": 1,
          "Date": "2023-05-23T21:08:36.000Z",
          "Titre": "Great, lightening fast service!!",
          "Contenu": "I made a request regarding being able to use my previously downloaded Microsoft office on a new laptop because my laptop that I downloaded Microsoft office on crashed.  Within three minutes I received a reply from Joe saying yes, I could use it again on a new computer and he sent the directions on how to install it!   I thought they were going to tell me no!   Great service!  Lightening fast response!!"
        },
        {
          "Note": 5,
          "Lieu": "IT",
          "Pseudo": "James Lindsay",
          "Nb_Reviews": 7,
          "Date": "2023-06-01T16:39:44.000Z",
          "Titre": "The best customer service ever.",
          "Contenu": "The best customer service I have ever experienced online.  I screwed some things up and Anne, Emir and especially Eric patiently helped me resolve the errors I had made.  Can't say enough in favor of customer support.  Prices of software were great, too."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "tester",
          "Nb_Reviews": 3,
          "Date": "2023-04-05T21:49:32.000Z",
          "Titre": "Great Software Store",
          "Contenu": "I have been buying from Softwarekeep since 9-2020 and haven't had any failures of software losing genuine status, everything is legal. Once or twice I had an issue installing and Softwarekeep had it corrected immediately!! Now I consistently buy my software from them, will be buying Office 2019 this week or next. Thanks for your software, honesty and fair pricing services Softwarekeep! Keep up the good work!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Naa-Diane Green",
          "Nb_Reviews": 2,
          "Date": "2023-07-21T23:47:37.000Z",
          "Titre": "Installing Microsoft suite and getting my refund",
          "Contenu": "I called for two things... I only meant to purchase Microsoft suite and I mistakenly purchased something along with my purchase. Daniel was my customer service rep.  He reversed my charges immediately and walked me through how to install my product. He was very kind and patient. A person like myself who isn't tech savvy needed a kind person like Daniel to help me with my concerns. Daniel is an asset to your company Kudos to you Daniel and Thanks a Mil"
        },
        {
          "Note": 5,
          "Lieu": "SG",
          "Pseudo": "Fong Kah Chun",
          "Nb_Reviews": 1,
          "Date": "2022-12-18T11:32:50.000Z",
          "Titre": "Fast and reliable platform for your Microsoft software",
          "Contenu": "Bought my Windows 11 Pro license from Software Keep. The online purchase process was smooth although the verification with my credit card statement took a while after the 30 mins waiting time. But Carl was very helpful, and I got my license key immediately once Carl verified. What amazed me was his fast response on Sunday. Really appreciate and will recommend to my friends."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Robin Messing",
          "Nb_Reviews": 1,
          "Date": "2022-12-08T18:19:44.000Z",
          "Titre": "Joe did a good job clearing up my confusion.",
          "Contenu": "I was confused--I thought that I had ordered Microsoft Office 2021 Home and Student for Windows and, separately, Microsoft Access. When I went to download my software, I only saw MS Office Professional Plus 2021. I wanted to make sure I wouldn't be billed extra. I chatted with Joe, and Joe told me that you had upgraded me for free. That was very reassuring."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Michael McCann",
          "Nb_Reviews": 1,
          "Date": "2023-03-29T03:20:50.000Z",
          "Titre": "I purchased Microsoft Windows 10 and…Office Home and Student 2019",
          "Contenu": "I purchased Microsoft Windows 10 and Office Home and Student 2019. A few months back. I did have issues installing the pass key but customer support took care of my issue without any hesitation. Two months later I noticed that I did not properly install Office 2019 and contacted customer support via chat. I was connected with Ray and he discovered my problem in 30 seconds and fixed it. I realize it's hard to trust on-line purchases such as software like this but this company has gone above and beyond my trust level with there software and further yet with there customer support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ron Cole",
          "Nb_Reviews": 7,
          "Date": "2023-01-03T02:35:53.000Z",
          "Titre": "Professional response for help",
          "Contenu": "The response to my request for assistance by Paul was fast and stress free. Good instructions for a relative \"computer dummy\" were easy to follow and the process was smooth and a joy to watch. My gratitude for a quick fix to a long frustrating attempt by myself to implement the product download.Thank you, Paul!Ron Cole"
        },
        {
          "Note": 5,
          "Lieu": "BT",
          "Pseudo": "Pema Tashi",
          "Nb_Reviews": 1,
          "Date": "2023-08-16T17:14:30.000Z",
          "Titre": "Knowledgeable Joe",
          "Contenu": "Joe was able to understand what I wanted and advised me of the products that would best suit my needs. Always feels comfortable when you are dealing with a knowledgeable person without having to explain much"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rebecca",
          "Nb_Reviews": 1,
          "Date": "2023-01-08T00:51:47.000Z",
          "Titre": "Great support!!",
          "Contenu": "This agent, Carl, had a LOT of patience with me.  It took forever to let him take over the computer, but once he did he was lightening fast getting done what I'd been trying to do for AGES!!!  I am so glad I opted to go with SoftwareKeep!!!The gentleman I talked with yesterday was of great help after trying to load my new software and discovering my computer wasn't updated enough.  His suggestion to go to Apple and download a new one as no upgrades showed available to me was just the ticket I needed!  Apple couldn't help with the Microsoft portion, however, so you still need to use both supports - at least I did."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MH",
          "Nb_Reviews": 1,
          "Date": "2023-07-18T18:03:27.000Z",
          "Titre": "A company that cares about people!",
          "Contenu": "Emre (Software Group) was of amazing assistance! After I purchase the product, he told me that I was able to use the product from my old computer. He was interested in me as a person, not just a customer. When I had problems applying what he had told me to do, he graciously helped me. This is clearly a company who cares about people;  I will be happy to pass the name of this company along."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jenny Cool",
          "Nb_Reviews": 1,
          "Date": "2023-08-04T18:20:15.000Z",
          "Titre": "Joe was a great technician",
          "Contenu": "Joe was a great technician. I got a response to my initial message right away. He asked good questions and gave quick, clear answers. I am awaiting resolution of the issue (a refund) within the 24-72 hours stated. Thank you, Joe!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Shirley Bahler",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T02:32:58.000Z",
          "Titre": "Excellent customer service",
          "Contenu": "I ordered Office suite software June 2022 from SoftwareKeep after struggling with an online subscription to Office 365 with another vendor. Recently I couldn't connect my email accounts via Outlook to the server. I contacted Daniel at SoftwareKeep after the email provider couldn't solve the problem. Daniel was knowledgeable and patient. It was an obscure problem and yet he calmly stayed with it, researching the problem, all the while with a level of professionalism rarely seen these days. THANKS DANIEL."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eric in CA",
          "Nb_Reviews": 1,
          "Date": "2022-11-28T23:48:25.000Z",
          "Titre": "Great tech support",
          "Contenu": "Softwarekeep has older versions of ms office at affordable prices. Their tech support team got back to me within minutes of my request. Eric resolved my issue during our chat session. This is a great company!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "PK",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T03:20:44.000Z",
          "Titre": "I bought Microsoft Office to replace an…old version that stopped working",
          "Contenu": "I bought Microsoft Office to replace an older version that mysteriously stopped working three years ago.  Even a local tech group couldn't figure it out.  The Softwarekeep price for Microsoft Office was amazing and I also got a discount.  But after downloading, the new version didn't work either.  The team put me in touch with a tech named Paul online.  I told him the issue and he was off and running.  After trying a million things, he found the problem...a bug...embedded in my computer three years ago by a free antivirus program that was supposed to protect me from such things.  Bravo Paul!  You and your Softwarekeep team are awesome!  I am a very happy customer!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ken Blum",
          "Nb_Reviews": 1,
          "Date": "2023-02-26T01:24:30.000Z",
          "Titre": "A fantastic technician from Turkey who…",
          "Contenu": "A fantastic technician from Turkey who spent about an hour setting up a new version of Microsoft Office after I upgraded to iMac Catalina. He knew my Mac backwards and forwards and set everything up remotely. Very knowledgeable, very friendly. One of the best ever, A++++++++++Ken Blum"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ronna McHammond",
          "Nb_Reviews": 1,
          "Date": "2023-03-01T02:20:44.000Z",
          "Titre": "I was helped by Emre today and I am so thankful I was able to receive his expertise",
          "Contenu": "I was helped by Emre today and I am happy to say the customer service was excellent!  He was knowledgeable and resolved my problem quickly and efficiently. Above all he was kind and empathetic as it quickly became clear that I had no clue what I was doing. Never had a more positive experience with a staff member. This guy deserves a raise!"
        },
        {
          "Note": 5,
          "Lieu": "HR",
          "Pseudo": "Mateo Kos",
          "Nb_Reviews": 1,
          "Date": "2023-11-01T15:19:11.000Z",
          "Titre": "Great experience",
          "Contenu": "Great experience. They are working on the project and it's becoming better by day so i would recommend it."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "D Davis",
          "Nb_Reviews": 1,
          "Date": "2023-06-10T19:28:52.000Z",
          "Titre": "Daniel helps user",
          "Contenu": "I was concerned that I did not get the product expected.Daniel walked me through set-up and setting, and all is good now.Daniel's assistance relieved my concerns as well as gave the functionality I needed and expected."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan R.",
          "Nb_Reviews": 2,
          "Date": "2023-01-01T23:32:33.000Z",
          "Titre": "Eric did a fantastic job Getting Office Installed on our laptop",
          "Contenu": "Eric did a fantastic job.  I was unable to unzip the downloaded program, so he remotely connected and unzipped it and installed it.  Watching him, I would not have been able to do that.  Office 2012 is now up and running, thanks to you and Erik.  This my second experience with Software Keep.  Earlier this year, I installed Office 2016 on my sister's Windows 10 laptop, and it worked perfectly.  I am thoroughly pleased.  And yes, you ARE my preferred software provider.  Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Judith",
          "Nb_Reviews": 2,
          "Date": "2022-10-11T21:41:06.000Z",
          "Titre": "Eric solved my install of Microsoft…",
          "Contenu": "Eric solved my install of Microsoft Office problems w/kindness & good will. I worked w/another fellow earlier regarding  accounts & passwords. He was also patient & kind.  They both solved my problems and made my day!!!"
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Ben Austin",
          "Nb_Reviews": 1,
          "Date": "2023-02-18T19:40:31.000Z",
          "Titre": "What a fantastic company",
          "Contenu": "What a fantastic company. I found them with a quick google search, they have a great easy-to-use website. I was looking to purchase Microsoft office but I had multiple questions and wasn't sure what product exactly to purchase from their great selection. I jumped onto their live chat and spoke with one of their customer support agents, his name was Joe. He answered all my questions right away and helped me decide what product was right for me. Subsequently, I had a small issue with my order, I was able to contact Joe straight away and it was solved in a matter of minutes. I wanted to write this review to show my appreciation for Joe's help and also for this company as it runs a great business with exceptional prices. Thanks again."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Missy Brown",
          "Nb_Reviews": 2,
          "Date": "2022-12-23T16:51:48.000Z",
          "Titre": "The online chat support was immediate…",
          "Contenu": "The online chat support was immediate by Joe.  He was able to fulfill my request for a refund, as I had chosen the wrong product for my computer.  I then made a 2nd purchase with the right product, which I've already received the download for.  Knowing that I can get online chat support with someone who's already helped me once is great."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Cathey Bruce",
          "Nb_Reviews": 2,
          "Date": "2022-10-08T01:15:26.000Z",
          "Titre": "After ordering software",
          "Contenu": "After ordering software, I received two conflicting invoices.  The first was correct, but the second one was higher.  Joe was very helpful in checking this out and assured me the first invoice amount was correct and would be the amount billed to my credit card.  I appreciated his assistance!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tana C. Gilmore",
          "Nb_Reviews": 1,
          "Date": "2022-12-17T16:37:41.000Z",
          "Titre": "OMG I have such an appreciation for…",
          "Contenu": "OMG I have such an appreciation for people in IT and their patience! I admit I am not the savviest, but it was great working with Anne and Eric ( specifically Eric). He was patient with me even though I was skeptical this company was a scam initially, but I knew I needed Microsoft Office installed on an older iMac. Even Apple told me it couldn't be done. I have a huge presentation in 3 days! This company and team is the real deal! Whew!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "larry",
          "Nb_Reviews": 1,
          "Date": "2023-05-17T22:40:53.000Z",
          "Titre": "5 stars for Emre",
          "Contenu": "Emre is a top notch tech support rep... he is patient, knowledgeable and very efficient... he spent a good hour getting me set up with a MS Office package that would work with my older software package... I cannot rate him high enough... whatever you are paying Emre, it is not enough... many thannks"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David White",
          "Nb_Reviews": 7,
          "Date": "2022-10-25T19:10:33.000Z",
          "Titre": "Eric fixed a difficult problem.",
          "Contenu": "I was having a hard time because, apparently, two programs were fighting against each other. I needed to use both of them and I couldn't figure out how to do it. Eric saw the problem and came up with a solution, and they both work now. I tested them to make sure, and they definitely work. It's a real pain when you have to take your computer to the shop for repairs, they install a new hard drive, and then you have to reinstall all your programs one by one."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "F. Gonzalez",
          "Nb_Reviews": 2,
          "Date": "2022-11-12T00:13:09.000Z",
          "Titre": "A year later, help",
          "Contenu": "I bought Office last year, downloaded it, and apparently, I created confusion with the Office that came with the computer, and now I was billed for a subscription renewal.  Joe was clear, and direct and provided me with a new download to clean up the trouble. At a time of automated responses and no engagement, no follow-through after the sale, his help was much appreciated."
        },
        {
          "Note": 5,
          "Lieu": "IE",
          "Pseudo": "Edel R",
          "Nb_Reviews": 1,
          "Date": "2023-02-03T16:17:44.000Z",
          "Titre": "Real people - no bots - real service!",
          "Contenu": "Super fast service from Joe - answer straightaway. Painless experience. So unusual in this day and age with automated Customer Service the norm. And I haven't even bought the software yet! Keep it up SoftwareKeep ;)"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Anju",
          "Nb_Reviews": 1,
          "Date": "2022-10-13T21:40:58.000Z",
          "Titre": "Softwarekeep + Joe = A+",
          "Contenu": "I'm very glad I chose Softwarekeep.  The price of my Microsoft Office license was excellent and their service experience has been great.  I had issues with getting started and Joe was available immediately.  All was resolved in minutes.  As a businessowner and a busy mother this kind of service is more important to me than anything else."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Daryl",
          "Nb_Reviews": 2,
          "Date": "2023-01-04T23:22:09.000Z",
          "Titre": "Joe saved the day",
          "Contenu": "I had been going back and forth all morning trying to resolve a software key activation issue with the seller. I thought I had it solved once they sent me a new key but I had to run. Got stuck in heavy traffic, missed my appointment, paid parking fees for naught. Then realized much later that the company sent me the wrong installer. My day was pretty much trash.I contacted tech support expecting to get the run-around. Joe sent me the correct installer, I dowloaded, verified and installed the software within the 5-10 minutes we were chatting. All tech support should be this swift. I know this sounds like I'm laying it on but it's the little things that can make your day."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Trish Brinkley",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T20:16:37.000Z",
          "Titre": "GREAT!!!!!",
          "Contenu": "i had a couple of hitches with my purchase but the response time to my support requests was almost instantaneous by Emre. He solved both issues I had with expediency and professionalism.  I couldn't be happier with the company and the service.thanks so much Emre and EK Software."
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "Michelle",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T00:39:25.000Z",
          "Titre": "I purchased software via SoftwareDepot…",
          "Contenu": "I purchased software via SoftwareDepot and used the chat facility to get some assistance with installation.Emre was friendly & helpful and was able to resolve my questions quickly. In addition, Emre was available to assist as soon as I began the chat."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MARK C",
          "Nb_Reviews": 2,
          "Date": "2023-02-09T23:12:40.000Z",
          "Titre": "Emre helped me sort out an issue with…",
          "Contenu": "Emre helped me sort out an issue with the version of Microsoft Office that I had just purchased from you. He went into my computer and installed the correct version in no time at all.  It was enjoyable to sit and watch him do his magic!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Lisa",
          "Nb_Reviews": 1,
          "Date": "2023-04-03T06:49:57.000Z",
          "Titre": "Very helpful",
          "Contenu": "I was assisted by Bryan, and he helped me with my lifetime package when the files got corrupted and wouldn't let me use my Microsoft Word. He guided me through it step by step and was extremely helpful."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Armour",
          "Nb_Reviews": 1,
          "Date": "2022-12-25T22:56:20.000Z",
          "Titre": "I was nervous about purchasing this…but",
          "Contenu": "I was so nervous about purchasing this product online, but after I read through your website, I went ahead.  It is Christmas day, so I was worried that if things didn't go right I wouldn't be able to reach anyone. I did have some issues with regard to activating, so I went to your Chat option - never thinking someone would be available...but I hardly had to wait at all and got ahold of Eric. He was fantastic! He taught me how to take a screenshot, (which I had never done before) and we got the confirmation number and he told me what to do from there! I am so pleased with your website and service!!!! And very appreciative of Eric!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jennifer",
          "Nb_Reviews": 3,
          "Date": "2023-01-04T17:45:50.000Z",
          "Titre": "Great service from Joe",
          "Contenu": "Joe was very knowledgeable and went through the steps to see what the issue was. I had to re-install windows 11 and had lost my Microsoft suite which is why I needed to contact him. I could show that I had purchased the item a year ago, that I had used the code but my Microsoft account did not show that I had ever purchased it. After some working through things, Joe was able to get it reinstalled for me. I use excel to do my budget and checkbook as well as many other important things and he was able to get me back up and running. I am so very grateful to him!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Denise Parker",
          "Nb_Reviews": 2,
          "Date": "2022-10-20T04:02:46.000Z",
          "Titre": "I had accidentally purchased 2…",
          "Contenu": "I had accidentally purchased 2 instances of MS Office, so I asked if I could return it and get reimbursed. I chatted with Paul who was pleasant and helpful, even though it was my mistake. We need more people like Paul for Support staff! Thank you so much! :D"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Scott",
          "Nb_Reviews": 1,
          "Date": "2022-12-04T18:33:06.000Z",
          "Titre": "Had an activation issue on a Sunday…",
          "Contenu": "Had an activation issue on a Sunday morning. Eric was quick to respond and in very short order things were set properly.Have bought before from softwarekeep and will continue to do so."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Geof",
          "Nb_Reviews": 1,
          "Date": "2022-10-25T17:46:34.000Z",
          "Titre": "Patient service",
          "Contenu": "I pretty much hate MS but am forced to buy it and install it on our computers.   Eric did a great job guiding me through the reinstall after MS thinks you have already used it.   I bought 2 copies yesterday from Softwarekeep and am very happy with their service and response.  Call them instead of MS and you will speak with a very nice person!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Stacey Wong",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T05:03:21.000Z",
          "Titre": "Customer support is very quick to respond…",
          "Contenu": "I’m not a tech savvy person but Bryan at support made instructions very clear and easy to follow. He even followed up to see if I was able to reinstall my program. Great customer service. Thanks!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kelli Barber",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T19:40:50.000Z",
          "Titre": "Easy download, fantastic support!",
          "Contenu": "I bought Microsoft Office 2016 to download onto my Mac M1 (I hate Microsoft 365). When I ran into a snag installing it, I called their number and got a person right away. He then very patiently stepped me through the process. Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "AU",
          "Pseudo": "mark mclean",
          "Nb_Reviews": 1,
          "Date": "2022-11-03T15:35:45.000Z",
          "Titre": "carl was amazing helping me install…",
          "Contenu": "carl was amazing helping me install Office. Couple of issues initially more than likely down to my lack of understanding but helped me sort it in the end. Would recommend completely"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Clarice Miller",
          "Nb_Reviews": 2,
          "Date": "2022-11-10T18:10:06.000Z",
          "Titre": "I made a purchase for Mac Office 2011",
          "Contenu": "I made a purchase for Mac Office 2011. Realizing after the fact. I download and nothing would happen. I read the email sent with the zip file. My Mac is from 2021 and not compatible. I emailed them and sent screenshoots of the situation and within 48hrs I was refunded. Even though this purchase did not workout for me. I will definitely comeback for other ditigal purchases."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Isla Borinqueña",
          "Nb_Reviews": 1,
          "Date": "2022-11-05T21:43:08.000Z",
          "Titre": "Great",
          "Contenu": "The technician that assisted me, Joe, was very patient and helpful. He was dealing with someone new to the MAC, and I had no idea what I was doing, but he patiently waited for the info he needed from me. I needed to re-install software, and accomplished what I needed. Thank you very much for your assistance."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Tailynn",
          "Nb_Reviews": 1,
          "Date": "2023-01-10T08:27:25.000Z",
          "Titre": "I really loved the amazing dedication…",
          "Contenu": "I really loved the amazing dedication Carl and Paul had to make sure I was helped, and all my answers were solved. I wasn't able to install Windows 11 because my USB port was broken yet I still was able to get a refund for my order. Keep up the good work guys!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Hassan Elasfouri",
          "Nb_Reviews": 1,
          "Date": "2023-05-19T17:09:11.000Z",
          "Titre": "Good man Emre…",
          "Contenu": "Emre was incredibly professional and patient. He kept assuring me that my issue will be resolved and not to worry. I am very happy with the end result. Great Customer Service. Emre Rocks."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Don Pate",
          "Nb_Reviews": 1,
          "Date": "2023-02-24T20:27:16.000Z",
          "Titre": "Joe-Tech Support",
          "Contenu": "Joe, my tech support did an excellent job working me thru an issue that was preventing my new software from being activated. In my opinion, he went above and beyond to make sure I was a happy customer. I will continue to use Softwarekeep for all my software needs based on my experience with Joe, my excellent tech support!!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jeff",
          "Nb_Reviews": 1,
          "Date": "2022-11-09T19:35:54.000Z",
          "Titre": "Outstanding Customer Service",
          "Contenu": "I am new to Softwarekeep and placed an order for Windows 11.  I didn't get an email with my license key and download instructions.  I used the chat option and Joe came on and saw that I put my email address wrong on the order.  He immediately fixed it and I got the email.  He then offered to stay online while I downloaded the software in case I had questions.  I told him I was not that tech savvy and that my son would take care of it.  A pleasant interaction with Joe with quick and through service. I will look first to Softwarekeep on any future needs."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Paul Ragin",
          "Nb_Reviews": 1,
          "Date": "2022-10-28T08:32:33.000Z",
          "Titre": "Mr Carl",
          "Contenu": "Mr. Carl, was very knowledgeable, and extremely patient, in helping me work through getting microsoft 2016, I would recommend your products, because of the great service I received from Mr. Carl.  He was awesome.  I salute him!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Penny Paque",
          "Nb_Reviews": 1,
          "Date": "2023-01-20T18:17:23.000Z",
          "Titre": "Outlook license issue",
          "Contenu": "Eric did a great job solving my license issue with Outlook.   I had been struggling for several hours with this issue and Eric solved within 15 minutes.   He used online access to my computer."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Taylor",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T21:46:32.000Z",
          "Titre": "Emre assisted me today - Wonderful",
          "Contenu": "Emre assisted me today and could not have been more precessional, courteous, attentive and knowledgeable. I will definitely look to software keep for my software needs. Thank you again Emre!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Barbara Hart Warczinsky",
          "Nb_Reviews": 1,
          "Date": "2023-01-28T21:11:48.000Z",
          "Titre": "Eric is amazing!",
          "Contenu": "Eric was incredibly helpful in guiding me through the installation of my new software from my initial question of \"Is this an instant download? to \"Help did I really order what I want?\" to \"Oh no, it's not working!' to \"How does that link work?\" to \"I'm stuck, now what?\" to final victory! :-)  Each time his answers were clear and easy to follow. He answered my clarification questions quickly and was very patient in doing so. Because of his help, I can now proceed with a project I am working on... and more!  If you ever enlist the help of chat, I hope Eric receives your question. He is amazing!  Thank you to him many times over!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "K'ma",
          "Nb_Reviews": 1,
          "Date": "2023-04-14T18:24:34.000Z",
          "Titre": "Success - even at 75, with help, I can do this!",
          "Contenu": "Joe brought me to a successful fix my problem!  He stuck with me as I had questions and got me up and running!  This has been a problem I dreaded calling about, because I thought it would take too long and I would have difficulty getting it done.  No problem, Joe to the rescue!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "WJM Inva",
          "Nb_Reviews": 1,
          "Date": "2023-06-19T20:16:41.000Z",
          "Titre": "Emre was terrific!",
          "Contenu": "Emre spent an entire hour figuring out and fixing the issue that had arisen with my Office ProPlus. There's no way I could have figured it out on my own. I'm thrilled he was the rep who responded to my chat!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Antoinette Hills",
          "Nb_Reviews": 3,
          "Date": "2023-10-26T06:43:56.000Z",
          "Titre": "Thanks for sharing great friend…",
          "Contenu": "Thanks for sharing great friend @worldbaddest ,I'm at your service anytime"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Debnet",
          "Nb_Reviews": 2,
          "Date": "2022-10-10T13:19:13.000Z",
          "Titre": "Carl called exactly when scheduled",
          "Contenu": "Carl called exactly when scheduled. He was very knowledgeable and knew just what needed to be done to get my new Microsoft Office Professional software to be installed. It was very quick."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Dan",
          "Nb_Reviews": 1,
          "Date": "2023-01-12T05:07:04.000Z",
          "Titre": "Very helpful Session",
          "Contenu": "Very helpful Session! Used the remote tool and it was super easy and the software install was done successfully. I was nice to follow the process and see the steps.  I don't write many reviews in this case I am pleased to do so.  I very much recommend software keep."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jesus",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T23:27:53.000Z",
          "Titre": "Emre was amazing!!",
          "Contenu": "Emre was amazing!!! I am not sure whether is she or he but definitively was kind, super helpful. I wish all customer service persons were like she/he."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Kim Bentley",
          "Nb_Reviews": 1,
          "Date": "2023-02-16T18:54:10.000Z",
          "Titre": "Stellar customer service",
          "Contenu": "I screwed up and forgot to apply a discount code to my order. Not only was their chat extremely prompt, they were knowledgeable and quickly addressed my issue. 10/10, will be buying from them again"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Elisha",
          "Nb_Reviews": 1,
          "Date": "2023-02-04T22:46:48.000Z",
          "Titre": "Getting a new key",
          "Contenu": "Emre was very understandable when I contacted support. He was able to assist me with obtaining a new key since the first one did not work on the Microsoft website."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Nan Shorey",
          "Nb_Reviews": 2,
          "Date": "2022-10-21T01:08:15.000Z",
          "Titre": "Zolo assist from Paul",
          "Contenu": "10/20/22The technical assistant I worked with was named Paul. I was having a terrible time with the most basic tasks, but he helped me figure it out, introduced me to Zolo assist. I can't believe how easy it was with his help.Nan Shorey"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Maggie Kosoy",
          "Nb_Reviews": 1,
          "Date": "2022-11-21T09:19:23.000Z",
          "Titre": "This tech was completely professional…",
          "Contenu": "This tech was completely professional and able to fix my issue very quickly . They are representative of the highest quality of customer support you can have ! Promote them !  and give them a raise !"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Caroline",
          "Nb_Reviews": 1,
          "Date": "2022-10-19T04:35:39.000Z",
          "Titre": "Very grateful for the customer service…",
          "Contenu": "Very grateful for the customer service today. I have many skills, installing new software is not one of them. Paul was amazing in providing support and installing the whole thing. I could not have done this without him. Many thanks, will be coming back and shopping again!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rachelle",
          "Nb_Reviews": 1,
          "Date": "2022-11-15T20:50:28.000Z",
          "Titre": "Joe was super fast and efficient at…",
          "Contenu": "Joe was super fast and efficient at handling my refund request after I ordered the wrong item. He even sent me the link for the correct one! I really appreciate  his help!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Fab Tup",
          "Nb_Reviews": 1,
          "Date": "2023-04-26T23:27:56.000Z",
          "Titre": "Emre was great to assist me remotely…",
          "Contenu": "Emre was great to assist me remotely with installation and activation with a new product key of Outlook 2016. Took his time to navigate and solve all the problems."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Karen",
          "Nb_Reviews": 1,
          "Date": "2022-10-06T22:07:26.000Z",
          "Titre": "Software Download Troubles",
          "Contenu": "I was having trouble getting my download to show up.  Joe was extremely helpful and walked me through, step by step until my purchased download was installed on my computer.  THANKS!!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eli",
          "Nb_Reviews": 1,
          "Date": "2023-01-19T21:31:55.000Z",
          "Titre": "All my fault",
          "Contenu": "I was feeling rather impatient and didn't wait long enough so I wasn't sure how Id get the download key. He ensured that I'd get it within 15 minutes."
        },
        {
          "Note": 5,
          "Lieu": "OM",
          "Pseudo": "Ahsan Iftikhar",
          "Nb_Reviews": 1,
          "Date": "2023-08-18T13:07:36.000Z",
          "Titre": "Eric detail with my query very professionally",
          "Contenu": "Eric detail with my query very professionally. Also I am really happy with my purchase experience from Sofwarekeep."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Brian R",
          "Nb_Reviews": 1,
          "Date": "2023-01-29T17:41:18.000Z",
          "Titre": "Eric did a great job",
          "Contenu": "Eric did a great job.  Very knowledgeable and fast.  Hung in there when I had to take my time cleaning up some issues but responded right away when I returned to the conversation."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "David Ogden",
          "Nb_Reviews": 4,
          "Date": "2023-01-19T17:57:45.000Z",
          "Titre": "Joe was helpfull in my sofware download",
          "Contenu": "Joe was helpfull in letting me know when I would receive the link to download software. He remained on the chat to help with any issues in the process. very helpful, very friendly."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Bill",
          "Nb_Reviews": 1,
          "Date": "2022-11-11T22:03:36.000Z",
          "Titre": "I was having an activation issue",
          "Contenu": "I was having an activation issue. I chatted with Eric who got my software activated with a quickness! Eric solved my issue and allowed me to get back to work. Thanks Eric!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ms. Estell",
          "Nb_Reviews": 1,
          "Date": "2022-11-18T02:20:02.000Z",
          "Titre": "I was assisted by Carl",
          "Contenu": "I was assisted by Carl, and he was very respectful and professional when I requested a refund.  He clearly explained the process and time frame of when I would receive my money."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Jax",
          "Nb_Reviews": 1,
          "Date": "2022-10-14T22:26:20.000Z",
          "Titre": "Joe is the man",
          "Contenu": "Joe is the man My Windows needed reactivation after some hardware changes but they were not taking my product key. Joe had this solved in no time and I was back up and running in no time. His instructions were very clear."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Mark Wagstaff",
          "Nb_Reviews": 2,
          "Date": "2022-11-05T15:37:24.000Z",
          "Titre": "Berin was absolutely amazing, thanks Softkeep!",
          "Contenu": "Berin was absolutely amazing! I could not ask for better, quality support from Softkeep. Berin was patient, professional, and understanding. He was able to assist me and solve the issues. Thanks!!!!!"
        },
        {
          "Note": 5,
          "Lieu": "CA",
          "Pseudo": "Jenny Noble",
          "Nb_Reviews": 1,
          "Date": "2023-09-19T01:47:18.000Z",
          "Titre": "Daniel to the rescue!",
          "Contenu": "Daniel solved a complex problem for me with patience and expertise.  I will recommend your company for excellent support."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "MAF",
          "Nb_Reviews": 1,
          "Date": "2022-12-03T20:06:29.000Z",
          "Titre": "I was assisted by Joe",
          "Contenu": "I was assisted by Joe. He rocked. He deserves a raise. He got me what I wanted and paid for, which Micro$oft was not doing. Joe is a keeper. I hope your employee retention protocols are better than the products. You do not want to lose him."
        },
        {
          "Note": 5,
          "Lieu": "FR",
          "Pseudo": "Hugo Shiboski",
          "Nb_Reviews": 2,
          "Date": "2022-11-18T00:50:37.000Z",
          "Titre": "Great customer support",
          "Contenu": "Very fast and clear customer support. Joe helped me out with an order that had an issue with and resolved it immediately. Thank you!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stephen Alcombright Jr",
          "Nb_Reviews": 1,
          "Date": "2022-10-20T20:34:46.000Z",
          "Titre": "Was having problems installing office…",
          "Contenu": "Was having problems installing office and got in touch with Eric via Chat.  He was extremely helpful and knew exactly what the problem was.  Thanks, Eric!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Woodrow Gray",
          "Nb_Reviews": 1,
          "Date": "2023-04-22T22:21:36.000Z",
          "Titre": "Sometimes it's easy",
          "Contenu": "Getting the step by step email from Paul made this install of Windows 11 Pro using RUFUS fairly easy."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam Holland",
          "Nb_Reviews": 4,
          "Date": "2022-10-22T22:51:09.000Z",
          "Titre": "I couldn't be happier …",
          "Contenu": "I couldn't be happier with the ease of using mhy purchase and most of all the fabulous customer service that I got when I had a problem related to the purchase of a new computer.My first experience with Softwarekeep but certainly not my last!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Rick Brown",
          "Nb_Reviews": 2,
          "Date": "2023-03-13T02:59:06.000Z",
          "Titre": "I’m happy with the service and will…",
          "Contenu": "I’m happy with the service and will come back for another purchase. There was a small issue that was corrected and the final outcome exceeded my expectations. 👍"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Carlos Saenz",
          "Nb_Reviews": 1,
          "Date": "2023-02-15T19:47:11.000Z",
          "Titre": "My 2021 Office Home & Student for my…",
          "Contenu": "My 2021 Office Home & Student for my mac had issues. Working with Denzil was a great experience. Was very professional and was able to fix the issue."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Stan Breedlove",
          "Nb_Reviews": 1,
          "Date": "2023-04-02T22:04:04.000Z",
          "Titre": "The assistant I who help lay",
          "Contenu": "The assistant I who help lay, Denzil, notably she was extremely helpful and with her expert assurance she was able to correct my problem. I greatly appreciate her talents."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Eileen Marmon",
          "Nb_Reviews": 1,
          "Date": "2023-02-05T19:55:52.000Z",
          "Titre": "Emre did a fantastic job helping me…",
          "Contenu": "Emre did a fantastic job helping me with my refund, as I purchased a product that I did not need in the end.  Professional and thorough"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Glenn",
          "Nb_Reviews": 1,
          "Date": "2023-07-31T17:37:43.000Z",
          "Titre": "Exceptional",
          "Contenu": "Coincidentally, this was my second call with Emre. Exceptional and very helpful even when it was my mistake."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Patricia Lambert",
          "Nb_Reviews": 2,
          "Date": "2023-07-28T18:10:21.000Z",
          "Titre": "Joe was so helpful today in getting my…",
          "Contenu": "Joe was so helpful today in getting my order completed.  Answered all my questions and was very patient."
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Ben",
          "Nb_Reviews": 1,
          "Date": "2023-01-04T22:04:10.000Z",
          "Titre": "Great Customer Service!",
          "Contenu": "I purchased the wrong software and Joe helped me get what I needed.  He also assisted in refunding my purchase.  Highly recommend!"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Keith Turek",
          "Nb_Reviews": 1,
          "Date": "2023-11-26T00:51:29.000Z",
          "Titre": "Customer service rep was very helpful"
        },
        {
          "Note": 5,
          "Lieu": "US",
          "Pseudo": "Pam Root",
          "Nb_Reviews": 3,
          "Date": "2023-06-01T20:47:54.000Z",
          "Titre": "Every time that I need order licenses",
          "Contenu": "Every time that I need order licenses, I usually receive them with in an hour.  I have never had any real issues."
        }
      ]
    }
  ]
}